
// Функция устанавливает новое значение для переданного реквизита.
// Если новое значение совпадает со старым, то флаг модифицированности не взводится.
// Возвращает "ИСТИНА", если произведено изменение реквизита
// Параметры
//  Реквизит  – Произвольный – Реквизит, для которого надо установить новое значение
//  Значение  – Произвольный – Новое значение для реквизита
//Функция УстановитьЗначение(Реквизит, НовоеЗначение, СтароеЗначение = Неопределено, УстанавливатьНеопределено = Истина) Экспорт
//	СтароеЗначение = Реквизит;
//	Если Реквизит <> НовоеЗначение Тогда
//		Если НовоеЗначение = Неопределено и УстанавливатьНеопределено = ЛОЖЬ Тогда
//		Иначе	
//			Реквизит = НовоеЗначение;
//			Возврат Истина;
//		КонецЕсли;	
//		
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//КонецФункции

Функция ЧисловоеПредствалениеПадежа(Падеж) Экспорт 
	//Возвращает числовое представление падежа в не зависимости от того, передано число или перечисление
	Если ЗначениеНеЗаполнено(Падеж) Тогда
		Возврат 1; //Именительный	
	КонецЕсли;
	
	Если ТипЗнч(Падеж) = Тип("ПеречислениеСсылка.Падежи") Тогда 
		Возврат Перечисления.Падежи.Индекс(Падеж) + 1; 
	ИначеЕсли ТипЗнч(Падеж) = Тип("Число") И Падеж > 0 и Падеж < 7 Тогда
		Возврат Цел(Падеж);
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции


//Функция получает либо полное ФИО, либо части ФИО и возвращает склонение ФИО
//Из полного ФИО и из частей выбираются наиболее длинные части и помещаются обратно в параметры 
//Например: ФамилияИмяОтчество = "Иванов И. Иванович", Фамилия = "", Имя = "Иван", Отчество = "И"
//Получим: ФамилияИмяОтчество = "Иванов Иван Иванович", Фамилия = "", Имя = "Иван", Отчество = "Иванович" 
//По отчеству определяется пол, если не передан явно.
//Если бВозвращать_ФИОКратко = Истина, то вернется склонение "Фамилия И. О."
// Параметр "Падеж" - тип ПеречислениеСсылка.Падежи или число от 1 до 6 
//&НаСервере
Функция ФИО_Склонение(Знач ФамилияИмяОтчество = "", Знач Фамилия = "", Знач Имя = "", Знач Отчество = "", Пол = Неопределено, Падеж = Неопределено, 
	бВозвращать_ФИОКратко = Ложь
	,бПробелМеждуТочкойИОтчеством = Истина
	) Экспорт 
	
	ФамилияИмяОтчество = СокрЛП(ФамилияИмяОтчество);
	Фамилия = СокрЛП(Фамилия);
	Имя = СокрЛП(Имя);
	Отчество = СокрЛП(Отчество);	
	ПолучитьФИОБезТочек(Фамилия, Имя, Отчество);						
	
	Если Падеж <> Неопределено и Падеж <> 1 и ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована Тогда
		Попытка 
			Компонента = Новый COMОбъект("Padeg.Declension");
		Исключение
			//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось подключить компоненту склонения для ФИО",,Истина,,,,"Не удалось подключить компоненту Padeg: " + ОписаниеОшибки());
			Компонента = Null;
		КонецПопытки;
	Иначе
		Компонента = Null;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФамилияИмяОтчество) Тогда
		//Дополняет более полными значениями ФИО
		ОбновитьПараметрыФамилияИмяОтчество(ФамилияИмяОтчество, Фамилия, Имя, Отчество, Компонента);		
	КонецЕсли;
	
	Если СтрДлина(Имя) = 1 Тогда
		ТочкаПослеИмени = Истина;
	Иначе
		ТочкаПослеИмени = Ложь;
	КонецЕсли;
	Если СтрДлина(Отчество) = 1 Тогда
		ТочкаПослеОтчества = Истина;
	Иначе
		ТочкаПослеОтчества = Ложь;
	КонецЕсли;
	
	РазделительТиО = ?((НЕ бПробелМеждуТочкойИОтчеством И ТочкаПослеИмени),""," ");
	ФамилияИмяОтчество = СокрЛП(СокрЛП(Фамилия + " " + Имя + (?(ТочкаПослеИмени,".","")) + ?(ПустаяСтрока(Имя),"",РазделительТиО + Отчество + (?(ТочкаПослеОтчества,".","")))));
	//Определять Род с помощью функций Pageg   GetSex(pMiddleName: PChar): 
	//Определяем Род
	Род = Неопределено;
	//Сначала по переданному полу, если передан
	Если Компонента <> NULL Тогда 
		Если ТипЗнч(Пол) = Тип("ПеречислениеСсылка.ПолФизическихЛиц") И ЗначениеЗаполнено(Пол) Тогда 
			Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда 
				Род = "М";
			ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский  Тогда
				Род = "Ж";
			КонецЕсли;
		Иначе
			//Если пол не передан, то по отчеству
		    iРод = Компонента.GetSex(ФамилияИмяОтчество);
			Если iРод = 1 Тогда
				Род = "М";
			ИначеЕсли iРод = 0 Тогда
				Род = "Ж";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Нормализуем падеж
	iПадеж = ЧисловоеПредствалениеПадежа(Падеж);
	//Склоняем ФИО
	//Если нет Имени, отчество в функцию не передаем	
	Имя = Имя + ?(ТочкаПослеИмени,".","");	
	Отчество = ?(ПустаяСтрока(Имя),"",Отчество + ?(ТочкаПослеОтчества,".",""));
	ПадежПол = 3;
	Если ТипЗнч(Пол) = Тип("ПеречислениеСсылка.ПолФизическихЛиц") И Не Пол.Пустая() Тогда
		Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			ПадежПол = 1;
		Иначе
			ПадежПол = 2;
		КонецЕсли;
	КонецЕсли;
	Если Компонента <> NULL Тогда 
		//Для корректного склонения в случае отсутствия отчества необходимо передать Род
		ФИОСклонение = Компонента.GetFIOPadeg(Фамилия, Имя, Отчество, Род, iПадеж);
		Компонента = Null;
	Иначе
		Если iПадеж = 1 Тогда
			ФИОСклонение = ФамилияИмяОтчество;
		Иначе
			ФИОСклонение = Падеж(ФамилияИмяОтчество, ?(бВозвращать_ФИОКратко, -1, 1) * iПадеж, ПадежПол, "123");
		КонецЕсли;
	КонецЕсли;
	Если бПробелМеждуТочкойИОтчеством И ТочкаПослеИмени И НЕ ПустаяСтрока(Отчество) Тогда
		ФИОСклонение = СтрЗаменить(ФИОСклонение,"."+Лев(Отчество,1),". "+Лев(Отчество,1));	
	КонецЕсли;
	Если бВозвращать_ФИОКратко Тогда
		ФамилияВПадеже = ОбщегоНазначения.ВыделитьСлово(ФИОСклонение);		
		Результат = СокрЛП(?(НЕ ПустаяСтрока(ФамилияВПадеже), 
					СокрЛП(ФамилияВПадеже + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + РазделительТиО + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), "")),
					""));			
	Иначе
		Результат = ФИОСклонение;
	КонецЕсли;
		
	Возврат СокрЛП(Результат);
	
КонецФункции

Процедура ПолучитьФИОБезТочек(Фамилия, Имя, Отчество)
	
	ПозицияПробелаВФамилии = Найти(Фамилия, " ");//в фамилии будет пробел, если инцициалы в поле фамилия
	Если ЗначениеЗаполнено(Имя) И Не ЗначениеЗаполнено(Отчество) Тогда
		ИмяОтчество = Имя;
	ИначеЕсли НЕ ЗначениеЗаполнено(Имя) И ЗначениеЗаполнено(Отчество) Тогда
		ИмяОтчество = Отчество; 	
	ИначеЕсли НЕ ЗначениеЗаполнено(Имя) И НЕ ЗначениеЗаполнено(Отчество) И ПозицияПробелаВФамилии > 0 Тогда
		ИмяОтчество = СокрЛП(Сред(Фамилия, ПозицияПробелаВФамилии + 1)); //всё, что после пробела - это отчество
		Фамилия = СокрЛП(Лев(Фамилия, ПозицияПробелаВФамилии - 1)); //всё, что до пробела - это фамилия					
	Иначе	
		ИмяОтчество = "";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ИмяОтчество) Тогда  		
		ПозицияРазделителя = Найти(ИмяОтчество," ");
		Если ПозицияРазделителя = 0 Тогда  //если нет пробела, то ищем точку
			ПозицияРазделителя = Найти(ИмяОтчество,".");
		КонецЕсли;
		Если ПозицияРазделителя = 0 Тогда  //если нет точки, то ищем запятую
			ПозицияРазделителя = Найти(ИмяОтчество,",");
		КонецЕсли;	
		Если ПозицияРазделителя > 0 Тогда						
			Имя = СокрЛП(Лев(ИмяОтчество, ПозицияРазделителя - 1)); //всё, что до разделителя - это имя			
			ТочкаПослеИмени = Истина;
			Отчество = СокрЛП(Сред(ИмяОтчество, ПозицияРазделителя + 1)); //всё, что после разделителя - это отчество
			Если ЗначениеЗаполнено(Отчество) Тогда
				ПозицияРазделителя = Найти(Отчество," ");
				Если ПозицияРазделителя = 0 Тогда  //если нет пробела, то ищем точку
					ПозицияРазделителя = Найти(Отчество,".");
				КонецЕсли;
				Если ПозицияРазделителя = 0 Тогда  //если нет точки, то ищем запятую
					ПозицияРазделителя = Найти(Отчество,",");
				КонецЕсли;
				Если ПозицияРазделителя > 0 Тогда
					Отчество = СокрЛП(Лев(Отчество, ПозицияРазделителя - 1)); //всё, что до разделителя - отчество
					ТочкаПослеОтчества = Истина;
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;	
	Иначе			
		Имя = СокрЛП(СтрЗаменить(Имя, ".", ""));
		Отчество = СокрЛП(СтрЗаменить(Отчество, ".", ""));
	КонецЕсли;
КонецПроцедуры
//Разбивает ФИО на отдельные значения и в случае если они длиннее, производит перезаполнение Фамилии, Имени и Отчества
Процедура ОбновитьПараметрыФамилияИмяОтчество(ФамилияИмяОтчество, Фамилия, Имя, Отчество, Компонента)
	
	ФамилияИзФИО 	= "";
	ИмяИзФИО 		= "";
	ОтчествоИзФИО 	= "";
	Если Компонента <> NULL Тогда
		Компонента.SeparateFIO(ФамилияИмяОтчество, ФамилияИзФИО, ИмяИзФИО, ОтчествоИзФИО);
	Иначе
		РазбитаяСтрока = СтрЗаменить(ФамилияИмяОтчество, " ", Символы.ПС);
		ФамилияИзФИО = СтрПолучитьСтроку(РазбитаяСтрока, 1);
		ИмяИзФИО = СтрПолучитьСтроку(РазбитаяСтрока, 2);
		ОтчествоИзФИО = СтрПолучитьСтроку(РазбитаяСтрока, 3);
	КонецЕсли;
	ПолучитьФИОБезТочек(ФамилияИзФИО, ИмяИзФИО, ОтчествоИзФИО);
	Если СтрДлина(ФамилияИзФИО) > СтрДлина(Фамилия) Тогда
		Фамилия = ФамилияИзФИО;
	КонецЕсли;
	Если СтрДлина(ИмяИзФИО) > СтрДлина(Имя) Тогда
		Имя = ИмяИзФИО;	
	КонецЕсли;
	Если СтрДлина(ОтчествоИзФИО) > СтрДлина(Отчество) Тогда
		Отчество = ОтчествоИзФИО;		
	КонецЕсли;
			
КонецПроцедуры	
//Функция ФИО_Склонение(ФамилияИмяОтчество = "", Фамилия = "", Имя = "", Отчество = "", Пол = Неопределено, Падеж = Неопределено, бВозвращать_ФИОКратко = Ложь) Экспорт 
//	
//	бПробелМеджуТочкойИОтчеством = Истина;
//	
//	ТочкаПослеИмени = Прав(СокрЛП(Имя),1) = ".";
//	ТочкаПослеОтчества = Прав(СокрЛП(Отчество),1) = ".";
//	
//	Имя = СокрЛП(СтрЗаменить(Имя, ".", ""));
//	Отчество = СокрЛП(СтрЗаменить(Отчество, ".", ""));
//	
//	Если ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована Тогда
//		Попытка 
//			Компонента = Новый COMОбъект("Padeg.Declension");
//		Исключение
//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось подключить компоненту склонения для ФИО",,Истина,,,,"Не удалось подключить компоненту Padeg: " + ОписаниеОшибки());
//			Компонента = Null;
//		КонецПопытки;
//	Иначе
//		Компонента = Null;
//	КонецЕсли;
//	Если  СокрЛП(ФамилияИмяОтчество) <> "" Тогда
//		//Вычленяем по отдельности фамилию имя и отчество
//		Фамилия2 	= "";
//		Имя2 		= "";
//		Отчество2 	= "";
//		Если Компонента <> NULL Тогда
//			Компонента.SeparateFIO(ФамилияИмяОтчество, Фамилия2, Имя2, Отчество2);
//		Иначе
//			РазбитаяСтрока = СтрЗаменить(ФамилияИмяОтчество, " ", Символы.ПС);
//			Фамилия2 = СтрПолучитьСтроку(РазбитаяСтрока, 1);
//			Имя2 = СтрПолучитьСтроку(РазбитаяСтрока, 2);
//			Отчество2 = СтрПолучитьСтроку(РазбитаяСтрока, 3);
//		КонецЕсли;
//		ТочкаПослеИмени2 = Прав(СокрЛП(Имя2),1) = ".";
//		ТочкаПослеОтчества2 = Прав(СокрЛП(Отчество2),1) = ".";
//		Имя2 = СокрЛП(СтрЗаменить(Имя2, ".", ""));
//		Отчество2 = СокрЛП(СтрЗаменить(Отчество2, ".", ""));
//		//Если полученные части ФИО длинее параметров, то обновляем их (длиннее они в том числе когда указаны в полном ФИО и не указаны в параметрах) 
//		//Но если при этом в Полном ФИО были переданы инициалы, а в параметрах - полные Имя и Отчество, то они будут обновлены на полные варианты
//		Если СтрДлина(Фамилия2) > СтрДлина(Фамилия) Тогда
//			Фамилия = Фамилия2;
//		КонецЕсли;
//		Если СтрДлина(Имя2) > СтрДлина(Имя) Тогда
//			Имя = Имя2;
//			ТочкаПослеИмени = ТочкаПослеИмени2;
//		КонецЕсли;
//		Если СтрДлина(Отчество2) > СтрДлина(Отчество) Тогда
//			Отчество = Отчество2;
//			ТочкаПослеОтчества = ТочкаПослеОтчества2;
//		КонецЕсли;
//	КонецЕсли;
//	Если СтрДлина(Имя) = 1 Тогда
//		ТочкаПослеИмени = Истина;
//	КонецЕсли;
//	Если СтрДлина(Отчество) = 1 Тогда
//		ТочкаПослеОтчества = Истина;
//	КонецЕсли;
//	РазделительТиО = ?((НЕ бПробелМеджуТочкойИОтчеством И ТочкаПослеИмени),""," ");
//	ФамилияИмяОтчество = СокрЛП(СокрЛП(Фамилия + " " + Имя + (?(ТочкаПослеИмени,".","")) + ?(ПустаяСтрока(Имя),"",РазделительТиО + Отчество + (?(ТочкаПослеОтчества,".","")))));
//	//Определять Род с помощью функций Pageg   GetSex(pMiddleName: PChar): 
//	//Определяем Род
//	Род = Неопределено;
//	//Сначала по переданному полу, если передан
//	Если Компонента <> NULL Тогда 
//		Если ТипЗнч(Пол) = Тип("ПеречислениеСсылка.ПолФизическихЛиц") И НЕ ЗначениеНеЗаполнено(Пол) Тогда 
//			Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда 
//				Род = "М";
//			ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский  Тогда
//				Род = "Ж";
//			КонецЕсли;
//		Иначе
//			//Если пол не передан, то по отчеству
//			iРод = Компонента.GetSex(ФамилияИмяОтчество);
//			Если iРод = 1 Тогда
//				Род = "М";
//			ИначеЕсли iРод = 0 Тогда
//				Род = "Ж";
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	//Нормалезуем падеж
//	iПадеж = ЧисловоеПредствалениеПадежа(Падеж);
//	//Склоняем ФИО
//	//Если нет Имени, отчество в функцию не передаем
//	Имя2 = Имя + ?(ТочкаПослеИмени,".","");	
//	Отчество2 = ?(ПустаяСтрока(Имя),"",Отчество + ?(ТочкаПослеОтчества,".",""));	
//	Если Компонента <> NULL Тогда 
//		//Для корректного склонения в случае отсутствия отчества необходимо передать Род
//		ФИОСклонение = Компонента.GetFIOPadeg(Фамилия, Имя2, Отчество2, Род, iПадеж);
//		Компонента = Null;
//	Иначе
//		Если iПадеж = 1 Тогда
//			ФИОСклонение = ФамилияИмяОтчество;
//		Иначе
//			ФИОСклонение = Падеж(ФамилияИмяОтчество,?(бВозвращать_ФИОКратко,-1,1)*iПадеж,,"123");
//		КонецЕсли;
//	КонецЕсли;
//	Если бПробелМеджуТочкойИОтчеством И ТочкаПослеИмени И НЕ ПустаяСтрока(Отчество2) Тогда
//		ФИОСклонение = СтрЗаменить(ФИОСклонение,"."+Лев(Отчество2,1),". "+Лев(Отчество2,1));	
//	КонецЕсли;
//	Если бВозвращать_ФИОКратко Тогда
//		Фамилия2 = ОбщегоНазначения.ВыделитьСлово(ФИОСклонение);
//		Результат = СокрЛП(?(НЕ ПустаяСтрока(Фамилия2), 
//					СокрЛП(Фамилия2 + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + РазделительТиО + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), "")),
//					""));
//	Иначе
//		Результат = ФИОСклонение;
//	КонецЕсли;
//	Имя = Имя + ?(ТочкаПослеИмени И СтрДлина(Имя) > 1,".","");	
//	Отчество = Отчество + ?(ТочкаПослеОтчества И СтрДлина(Отчество) > 1,".","");	
//	
//	Возврат Результат;
//	
//КонецФункции


//Функция определяет пол Физ. лица по отчеству
//
//	Параметры:	ФизЛицо					- ссылка на справочник физ. лиц
//				ИгнорироватьЗаполненый	- Если Истина, не производим проверку на заполнение реквизита "Пол"
//
//	Возращаемое значение: Перечисление.ПолФизическихЛиц
//
//	5.3.1.	GetSex
//	function GetSex(pMiddleName: PChar): Integer; stdcall; export;
//	Определяет род по отчеству, записанному в произвольном падеже.
//	Значение, возвращаемое этой функцией, содержит информацию о роде:
//		1 — мужской;
//		0 — женский;
//		-1 — невозможно определить;
//	Позволяет определить род ФИО. Допускается параметром передавать не только отчество, но и ФИО целиком. Главное, чтобы в передаваемой строке последним было отчество.
Функция ФизЛицо_ОпределитьПол(ФизЛицо = "", Отчество = "") Экспорт
	
	Если (ЗначениеНеЗаполнено(ФизЛицо) И ЗначениеНеЗаполнено(Отчество)) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если ЗначениеНеЗаполнено(Отчество) Тогда
		//Получим Отчество
		//PS: если допустима смена пола физ. лица, необходимо добавить параметр на дату
		ФИОСрез 	= РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(,Новый Структура("ФизЛицо", ФизЛицо));
		Отчество	= ФИОСрез.Отчество;
	Иначе
		Если Найти(Отчество,"вич")>0 и Найти(Отчество,"вна")= 0 Тогда
			Возврат	Перечисления.ПолФизическихЛиц.Мужской;
		ИначеЕсли Найти(Отчество,"вна")>0 и Найти(Отчество,"вич")=0 Тогда
			Возврат	Перечисления.ПолФизическихЛиц.Женский;
		КонецЕсли;	
	КонецЕсли;
		
	
	Попытка
		Компонента = Новый COMОбъект("Padeg.Declension");
	Исключение
		Компонента = Null;
		//Сообщить("Не удалось подключить компоненту: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	iПол = Компонента.GetSex(Отчество);
	Компонента = Null;
	
	Если iПол = 1 Тогда
		Возврат	Перечисления.ПолФизическихЛиц.Мужской;
	ИначеЕсли iПол = 0 Тогда
		Возврат	Перечисления.ПолФизическихЛиц.Женский;
	Иначе
		//-1 — невозможно определить;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьПолПоФамилии(Фамилия) Экспорт
	
	ПоследниеДваСимвола = Прав(СокрЛП(Нрег(Фамилия)),2);
	Если ПоследниеДваСимвола = "ва" Или ПоследниеДваСимвола = "на" Или ПоследниеДваСимвола = "ая" Тогда
		Возврат	Перечисления.ПолФизическихЛиц.Женский;
	ИначеЕсли ПоследниеДваСимвола = "ов" Или ПоследниеДваСимвола = "ев" Или ПоследниеДваСимвола = "ий" Или ПоследниеДваСимвола = "ой" Или ПоследниеДваСимвола = "ый" Тогда
		Возврат	Перечисления.ПолФизическихЛиц.Мужской;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция Склонение(Знач Фраза = "", Падеж = 1) Экспорт 
	
	Если ТипЗнч(Фраза) <> Тип("Строка") Тогда
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ФункцииРасширения.Склонение(): Некорретный тип передаваемого параметра Фраза. Тип значения: " + ТипЗнч(Фраза), ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
		Фраза = Строка(Фраза);
	КонецЕсли;
	Попытка 
		Компонента = Новый COMОбъект("Padeg.Declension");
	Исключение
		//Сообщить("Не удалось подключить компоненту: " + ОписаниеОшибки());
	КонецПопытки;
	Если Компонента <> Неопределено Тогда
		Попытка 
			Фраза = Компонента.GetAppointmentPadeg(Фраза, ЧисловоеПредствалениеПадежа(Падеж));
		Исключение
			//Сообщить("Не удалось выполнить функцию GetAppointmentPadeg: " + ОписаниеОшибки());
		КонецПопытки;
		Компонента = Null;
	КонецЕсли;
	Возврат Фраза;
	
КонецФункции


//Функция получает должность (должность включая подразделение) 
//возвращает склонение в заданном падеже
// Параметр "Падеж" - тип ПеречислениеСсылка.Падежи или число от 1 до 6 
Функция Должность_Склонение(Должность = "", Падеж = 1) Экспорт 
	
	Если нрег(Должность) = "устав" Тогда
		Если Падеж = Перечисления.Падежи.Родительный Тогда
			Возврат Лев(Должность,1)+"става";
		КонецЕсли;	
	КонецЕсли;	
	Рез = Склонение(Должность, Падеж);
	Рез = СтрЗаменить(Рез,". ""","."""); //заменяем глюкавое поведение функции склонения
	Рез = СтрЗаменить(Рез,". ру""",".ру"""); //заменяем глюкавое поведение функции склонения
	Возврат Рез;
	
КонецФункции

//
// z1 - фамилия имя отчество например Железняков Юрий Юрьевич
// z2 - Падеж ( по  умолчанию = 2 - родительный)
// 2 - родительный  ( нет кого?    ) Железнякова Юрия Юрьевича     
// 3 - дательный    ( кому?        ) Железнякову Юрию Юрьевичу 
// 4 - винительный  ( вижу кого?   ) Железнякова Юрия Юрьевича  
// 5 - творительный ( кем?         ) Железняковым Юрием Юрьевичем    
// 6 - предложный   ( о ком?       ) Железнякове Юрии Юрьевиче 
// Если задать Z2 меньше 0, то на выходе получим от -1=Железняков Ю. Ю. до -6=Железнякове Ю. Ю.
// z3 - параметр Пол может не указываться, но при наличии фамилий с 
// инициалами точное определение пола невозможно, поэтому предлагается задавать пол этим
// параметром  1 - мужской 2 - женский  
// ДЛЯ СКЛОНЕНИЯ ПРОФЕССИЙ ИСПОЛЬЗУЙТЕ ФУНКЦИЮ ПАДЕЖП И БУДЕТ ВАМ СЧАСТЬЕ!
// ---------------------------------------------------------------------------------------
// Бибик Галушка Цой Николайчик Наталия Петровна Герценберг Кривошей Капица-Метелица
// Если Падеж(Фио ,1 ,3),       то на выходе получим Фамилия Имя Отчество и т.д.
// Если Падеж(Фио ,1 ,3,"1" ),  то                   Фамилия 
// Если Падеж(Фио ,1 ,3,"2" ),  то                   Имя 
// Если Падеж(Фио ,1 ,3,"3" ),  то                   Отчество 
// Если Падеж(Фио, 1 ,3,"12" ), то                   Фамилия Имя 
// Если Падеж(Фио, 1 ,3,"23" ), то                   Имя Отчество 
// Если Падеж(Фио,-1 ,3,"231" ),то                   И. О. Фамилия 
// Если Падеж(Фио,-1 ,3,"23" ), то                   И. О.  
// 
Функция ПадежС(z1,Знач z2=2,Знач z3="*",z4=0) Экспорт
	z5=Найти(z1,"-");
	z6=?(z5=0,"","-"+ПадежС(Сред(z1,z5+1,СтрДлина(z1)-z5+1),z2,z3,z4));
	z1=НРег(?(z5=0,z1,Лев(z1,z5-1)));
	z7=Прав(z1,3);z8=Прав(z7,2);z9=Прав(z8,1);
	z5=СтрДлина(z1);
	za=Найти("ая ия ел ок яц ий па да ца ша ба та га ка",z8);
	zb=Найти("аеёийоуэюяжнгхкчшщ",Лев(z7,1));
	zc=Макс(z2,-z2);
	zd=?(za=4,5,Найти("айяь",z9));
	zd=?((zc=1)или(z9=".")или((z4=2)и(Найти("оиеу"+?(z3="ч","","бвгджзклмнпрстфхцчшщъ"),z9)>0))или((z4=1)и(Найти("мия мяэ лия кия жая лея",z7)>0)),9,?((zd=4)и(z3="ч"),2,?(z4=1,?(Найти("оеиую",z9)+Найти("их ых аа еа ёа иа оа уа ыа эа юа яа",z8)>0,9,?(z3<>"ч",?(za=1,7,?(z9="а",?(za>18,1,6),9)),?(((Найти("ой ый",z8)>0)и(z5>4)и(Найти("опой вбой",Прав(z1,4))=0))или((zb>10)и(za=16)),8,zd))),zd)));
	ze=Найти("лец нёк вей бей дец пец мец нец рец вец аец иец ыец бер",z7);
	zf=?((zd=8)и(zc<>5),?((zb>15)или(Найти("жий ний",z7)>0),"е","о"),?(z1="лев","ьв",?((Найти("аеёийоуэюя",Сред(z1,z5-3 ,1))=0)и((zb>11)или(zb=0))и(ze<>49),"",?(za=7,"л",?(za=10,"к",?(za=13,"йц",?(ze=0,"",?(ze<16,"ь"+?(ze=1,"ц",?(ze=5,"к","")),?(ze<41,"ц",?(ze<53,"йц","р"))))))))));
	zf=?((zd=9)или((z4=3)и(Прав(z1,1)="ы")),z1,Лев(z1,z5-?((zd>6)или(zf<>""),2,?(zd>0,1,0)))+zf+СокрП(Сред("а у а "+?((z8="ич")или(z8="ыш"),"е",?((z8="ов")or(z8="ин"),"ы","о"))+"ме "+?(Найти("гжкхш",Лев(z8,1))>0,"и","ы")+" е у ойе я ю я ем"+?(za=16,"и","е")+" и е ю ейе и и ь ьюи и и ю ейи ойойу ойойойойуюойойгомуго"+?((zf="е")или(za=16)или((zb>12)и(zb<16)),"и","ы")+"мм",10*zd+2*zc-3,2)));
	Возврат ?(""=z1,"",?(z4>0,ВРег(Лев(zf,1))+?((z2<0)и(z4>1),".",Сред(zf,2)),zf)+z6);
КонецФункции

Функция Падеж(z1,z2=2,z3=3,z4="123",z5=1) Экспорт
	z6=Нрег(Прав(СокрП(z1),4));
	z7=Прав(z6,1);
	Возврат?(z5<4,Падеж(СокрЛП(СтрЗаменить(Сред(z1,Найти(z1+" "," ")+1),".",". ")),z2,z3,СтрЗаменить(z4,z5,ПадежС(?((z5=3)и(z7="ы"),z1,Лев(z1,Найти(z1+" "," ")-1)),z2,Сред("ча"+z7,?(z3=3,?(z6="оглы",1,?(z6="кызы",1,3)),z3),1),z5)+" "),z5+1),z4);
КонецФункции

Функция ПадежП(Знач z1,Знач z2,z3=0) Экспорт
	z1=СокрЛП(z1);z4=Найти(z1+" "," ")+1;z5=Лев(z1,z4-2);z6=Прав(z5,2);
	z7=?((Найти("ая ий ый",z6)>0)и(Найти("ющий нный",Сред(z1,z4-5,4))=0)и(z3=0),"1","*");
	Возврат НРег(?((z6="ая")или(Прав(z6,1)="а"),ПадежС(z5,z2,z7,1)+" "+ПадежС(Сред(z1,z4),z2),ПадежС(z5,z2,"ч",1)+?((z6="ий")и(Найти(z1," ")=0),""," "+?(z7="1",ПадежП(Сред(z1,z4),z2,Число(z7)),Сред(z1,z4)))));
КонецФункции

Функция СмешениеДвухЦветов(Цвет1,Цвет2,Вариант=0) Экспорт
	
	//Цвета стиля
	Если Цвет1.Красный =-1 Тогда 
		Возврат Цвет2;
	ИначеЕсли Цвет2.Красный =-1 Тогда 	
		Возврат Цвет1;
	КонецЕсли;	
	Если Вариант = 1 Тогда
		//Первый цвет приоритетней
		Результат  = Новый Цвет(ЦЕЛ((Цвет1.Красный+Цвет1.Красный+Цвет2.Красный)/3),ЦЕЛ((Цвет1.Зеленый+Цвет1.Зеленый+Цвет2.Зеленый)/3),ЦЕЛ((Цвет1.Синий+Цвет1.Синий+Цвет2.Синий)/3));
	ИначеЕсли Вариант = 2 Тогда
		//Второй цвет приоритетней
		Результат  = Новый Цвет(ЦЕЛ((Цвет1.Красный+Цвет2.Красный+Цвет2.Красный)/3),ЦЕЛ((Цвет1.Зеленый+Цвет2.Зеленый+Цвет2.Зеленый)/3),ЦЕЛ((Цвет1.Синий+Цвет2.Синий+Цвет2.Синий)/3));
	Иначе
		//Равномерное смешивание
		Результат  = Новый Цвет(ЦЕЛ((Цвет1.Красный+Цвет2.Красный)/2),ЦЕЛ((Цвет1.Зеленый+Цвет2.Зеленый)/2),ЦЕЛ((Цвет1.Синий+Цвет2.Синий)/2));
	КонецЕсли;	
	Возврат Результат;
КонецФункции	

Функция НаложитьНаКартинкуЦвет(Картинка,Цвет,Вариант = 0) Экспорт
	
	Попытка
		Скрипт= Новый COMОбъект("MSScriptControl.ScriptControl");
		Скрипт.language="javascript";
		
		ИмяФайла = ПолучитьИмяВременногоФайла();
		Img =  IMG(Картинка,ИмяФайла);
		
		IP = Новый Comobject("WIA.ImageProcess");
		IP.Filters.Add(IP.FilterInfos("ARGB").FilterID);
		
		Скрипт.AddObject("newARGBData",Img.ARGBData._NewEnum);
		
		Замена = "  var r_ = " + Цвет.Красный + "; 
		| var g_ = " + Цвет.Зеленый + ";
		| var b_ = " + Цвет.Синий   + ";";
		Если Вариант = 0 Тогда
			УсловиеИсключения =	"a == 0";
		Иначе
		КонецЕсли;	
		
		Для номерТочки = 1 по  Img.ARGBData.Count Цикл
			СтрокаНомераТочки = Формат(НомерТочки,"ЧДЦ=0; ЧГ=");
			Если Вариант = 1 Тогда
				УсловиеИсключения =	"newARGBData("+СтрокаНомераТочки+")==  newARGBData(1)";
			КонецЕсли;	
			Строка = Замена+"
			| var argb = newARGBData("+СтрокаНомераТочки+");
			| var a = (argb&0xFF000000)>>24; 
			| var r = (argb&0x00FF0000)>>16; 
			| var g = (argb&0x0000FF00)>>8;
			| var b =  argb&0x000000FF;
			| if ("+УсловиеИсключения+") 
			| 	argb =(a<<24)|(r<<16)|(g<<8)|b;
			| else 
			|	argb =(a<<24)|(((r_+r+r)/3)<<16)|(((g_+g+g)/3)<<8)|((b_+b+b)/3);
			| newARGBData("+СтрокаНомераТочки+") = argb;
			|";
			Попытка
				Скрипт.Eval(Строка);
			Исключение
				Сообщить(ОписаниеОшибки()+Символы.ПС+Строка);
			КонецПопытки;	
		КонецЦикла;	
		IP.Filters(1).Properties("ARGBData").Value = Скрипт.CodeObject.newARGBData;
		
		Img = IP.Apply(Img);
		
		УдалитьФайлы(ИмяФайла);
		Img.SaveFile (ИмяФайла);
		
		Результат =  Новый Картинка(ИмяФайла,Вариант=1);
		УдалитьФайлы(ИмяФайла);
		
		Возврат результат;
	Исключение
		Возврат Картинка;
	КонецПопытки;
КонецФункции	

Функция IMG(Картинка,ИмяФайла) Экспорт 
	Двоичныеданные = Картинка.ПолучитьДвоичныеДанные();
	//ФорматФайла = Картинка.Формат();
	Двоичныеданные.Записать(ИмяФайла);
	Img = Новый Comobject( "WIA.ImageFile");
	Img.LoadFile(ИмяФайла);
	Возврат Img;
КонецФункции	

Функция ПараметрыКартинки(ИмяФайла) Экспорт
	Структура = Новый Структура("Ширина,Высота,Ошибка",0,0,"");
	
	Попытка
		Img = Новый Comobject( "WIA.ImageFile");
		Img.LoadFile(ИмяФайла);
		Структура.Вставить("Ширина",Img.Width);
		Структура.Вставить("Высота",Img.Height);
	Исключение
		Структура.Вставить("Ошибка",ОписаниеОшибки());
	КонецПопытки;	
	
	Возврат Структура;
	
КонецФункции
//иконки только  16*16
Функция СлияниеИконок(МассивИконок)
	
  ИмяФайла = ПолучитьИмяВременногоФайла();
  ВсегоИконок =  МассивИконок.Количество();
  
  Если ВсегоИконок = 0 Тогда
	  Возврат Новый картинка;
  ИначеЕсли ВсегоИконок = 1 Тогда
	  Возврат МассивИконок[0]; 
  КонецЕсли;	  
  
  IP = Новый Comobject("WIA.ImageProcess");
  IP.Filters.Add(IP.FilterInfos("Scale").FilterID);
  IP.Filters(1).Properties("MaximumHeight").Value = 16;
  IP.Filters(1).Properties("MaximumWidth").Value  = 16*МассивИконок.Количество();
  
  IP.Filters(1).Properties("PreserveAspectRatio").Value = Ложь;
  ПараметрыКартинки(IP);
  img = IP.Apply(IMG(МассивИконок[0],ИмяФайла));
  
  Скрипт= Новый COMОбъект("MSScriptControl.ScriptControl");
  Скрипт.language="javascript";
  Скрипт.AddObject("newARGBData",Img.ARGBData._NewEnum);
 // ОчисткаКартинки
  //Для i=1 по ВсегоИконок Цикл
  //Скрипт.AddObject("ARGBData1",IMG(БиблиотекаКартинок.уб_ВосклицательныйЗнак,ИмяФайла).ARGBData._NewEnum);
  //Скрипт.AddObject("ARGBData2",IMG(БиблиотекаКартинок.уб_ВосклицательныйЗнак,ИмяФайла).ARGBData._NewEnum);
  //Скрипт.AddObject("ARGBData3",IMG(БиблиотекаКартинок.уб_ВосклицательныйЗнак,ИмяФайла).ARGBData._NewEnum);
  //Строка = " for (i=1;i<=newARGBData.Count;i++) {
  //	|newARGBData(i)=0xFFFFFF;
  //	|};
  //	|var kor=0,point=0;
  //	|for (i=1;i<=ARGBData1.Count;i++) {
  //	|  if (i%16==1){
  //	|    kor=kor+32;
  //	|  }
  //	|  newARGBData(i+kor)=ARGBData1(i);
  //	|}
  //	|kor=-16;
  //	|for (i=1;i<=ARGBData2.Count;i++) {
  //	|  if (i%16==1){
  //	|    kor=kor+32;
  //	|  }
  //	|  newARGBData(i+kor)=ARGBData2(i);
  //	|}
  //	|kor=-32;
  //	|for (i=1;i<=ARGBData3.Count;i++) {
  //	|  if (i%16==1){
  //	|    kor=kor+32;
  //	|  }
  //	|  newARGBData(i+kor)=ARGBData3(i);
  //	|}";
  //	
  //Попытка
  //	Скрипт.Eval(Строка);
  //Исключение
  //	Сообщить(ОписаниеОшибки()+Символы.ПС+Строка);
  //КонецПопытки;	
  //
  //IP = Новый Comobject("WIA.ImageProcess");
  //IP.Filters.Add(IP.FilterInfos("ARGB").FilterID);
  //IP.Filters(1).Properties("ARGBData").Value = Скрипт.CodeObject.newARGBData;
  //
  //Img = IP.Apply(Img);
  //
  //
  //УдалитьФайлы("F:\_InWork\3.bmp");
  //
  //img.SaveFile("F:\_InWork\3.bmp");
  

КонецФункции	

Функция ФункцияСКД (Данные) Экспорт
	Если Данные = Null Тогда
		Возврат Null;
	ИначеЕсли ТипЗнч(Данные) <> Тип("ДанныеГрупповойОбработкиКомпоновкиДанных") Тогда
		Сообщить(ТипЗнч(Данные));
		Сообщить(Данные);
		//ВызватьИсключение "В функцию ФункцияСКД() можно передавать только объект типа ДанныеГрупповойОбработкиКомпоновкиДанных";
	КонецЕсли;
	
	
КонецФункции	

// Текст - проверяемый текст
// Шаблон - шаблон проверки
// Возвращает - Истина, если текст нормальный
Функция ПроверкаНаШаблон(Текст, Шаблон) Экспорт
	
	Если Текст <> "" Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.MultiLine 	= Истина; // истина — текст многострочный, ложь — одна строка
		RegExp.Global 		= Истина; // истина — поиск по всей строке, ложь — до первого совпадения
		RegExp.IgnoreCase 	= Истина; // истина — игнорировать регистр строки при поиске
		RegExp.Pattern 		= Шаблон ; // шаблон (регулярное выражение) для поиска параметра
		мНайд = RegExp.Execute(Текст); 
		Если мНайд.count>0 Тогда 
			Возврат Ложь
		КонецЕсли;
	КонецЕсли;
	Возврат Истина
	
КонецФункции // ПроверкаНаШаблон()


Функция ПолучитьТаблицыЗначенийИзHTML(рИсходныйДокумент, мТаблиц = Неопределено) Экспорт
	
	Если мТаблиц = Неопределено Тогда // первый запуск, читаем сам документ
		
		мТаблицИтого = Новый Массив;
		
		рКодировка="UTF-8";
		
		чтен=Новый ЧтениеHTML;
		
		Если ТипЗнч(рИсходныйДокумент)=Тип("Строка") Тогда
			
			// считаем, что передали строку HTML-кода (фрагмент)
			
			чтен.УстановитьСтроку(рИсходныйДокумент,рКодировка);
			
		ИначеЕсли ТипЗнч(рИсходныйДокумент)=Тип("Файл") Тогда
			
			// считаем, что передали файл, проверенно существующий и читающийся оттуда, где он есть
			
			чтен.ОткрытьФайл(рИсходныйДокумент.ПолноеИмя,рКодировка);
			
		Иначе
			
			Сообщить("Передан неверный аргумент: "+СокрЛП(рИсходныйДокумент)+", недопустимый тип!",СтатусСообщения.Важное);
			
			Возврат мТаблицИтого;
			
		КонецЕсли;
		
		пострДОМ=Новый ПостроительDOM;
		
		гдок=пострДОМ.Прочитать(чтен);
		
		// запускаем уже рекурсивное чтение
		
		ПолучитьТаблицыЗначенийИзHTML(гдок.ЭлементДокумента,мТаблицИтого);
		
		// возвращаемся с верхнего уровня и вообще выходим
		
		Возврат мТаблицИтого;
		
	Иначе
		
		// рекурсивный запуск, уже читается ДокументHTML
		
		Для каждого элдок Из рИсходныйДокумент.ДочерниеУзлы Цикл
			
			Если ТипЗнч(элдок)=Тип("ЭлементТаблицаHTML") Тогда // таблица, переходим непосредственно к её обработке
				
				//===========================================================================================
				
				Если элдок.ДочерниеУзлы.Количество()>=1 Тогда
					рЭлемент = элдок; //РТ+
					//рЭлемент=элдок.ДочерниеУзлы.Элемент(0);
					//
					//Если ТипЗнч(рЭлемент)=Тип("ЭлементHTML") Тогда
						
						Если рЭлемент.ЕстьДочерниеУзлы() Тогда
							
							// колонки добавляются по факту и по порядку
							
							тзнч=Новый ТаблицаЗначений;
							
							Для каждого рСтрока Из рЭлемент.ДочерниеУзлы Цикл
								
								#Если Клиент Тогда
									ОбработкаПрерыванияПользователя();
								#КонецЕсли
								мЗначенийКолонок=Новый Массив;
								
								Для каждого рЯчейка Из рСтрока.ДочерниеУзлы Цикл
									
									#Если Клиент Тогда
										ОбработкаПрерыванияПользователя();
									#КонецЕсли
									
									
									Если ТипЗнч(рЯчейка)<>Тип("ЭлементЯчейкаТаблицыHTML") Тогда Продолжить КонецЕсли;
									
									// в ячейке может быть как один элемент (тогда вносится простое значение), так и несколько (тогда их массив)
									
									мЗначенийЯчейки=Новый Массив;
									
									Для каждого рУзел Из рЯчейка.ДочерниеУзлы ЦИкл
										
										Если ТипЗнч(рУзел)=Тип("ТекстDOM") Тогда
											
											рЗначение=СокрЛП(рУзел.ТекстовоеСодержимое);
											
										ИначеЕсли ТипЗнч(рУзел)=Тип("ЭлементТаблицаHTML") Тогда
											
											// идём ещё глубже, обрабатывая таблицу через вызов обработки её родителя
											
											мПодтаблиц=Новый Массив;
											
											ПолучитьТаблицыЗначенийИзHTML(рУзел.РодительскийУзел,мПодтаблиц);
											
											Если мПодтаблиц.Количество()=0 Тогда // ни одной таблицы не было
												
												рЗначение=Неопределено;
												
											ИначеЕсли мПодтаблиц.Количество()=1 Тогда
												
												рЗначение=мПодтаблиц.Получить(0);
												
											Иначе
												
												рЗначение=мПодтаблиц; // прямо как массив и идёт
												
											КонецЕсли;
											
										Иначе
											
											// идём ещё глубже в общем виде
											
											мПодтаблиц=Новый Массив;
											
											ПолучитьТаблицыЗначенийИзHTML(рУзел,мПодтаблиц);
											
											Если мПодтаблиц.Количество()=0 Тогда // ни одной таблицы не было
												
												рЗначение=СокрЛП(рУзел.ТекстовоеСодержимое);//Неопределено;
												
											ИначеЕсли мПодтаблиц.Количество()=1 Тогда
												
												рЗначение=мПодтаблиц.Получить(0);
												
											Иначе
												
												рЗначение=мПодтаблиц; // прямо как массив и идёт
												
											КонецЕсли;
											
										КонецЕсли;
										
										Если ТипЗнч(рЗначение)=Тип("Массив") Тогда // перекидываем в итоговый
											
											Для каждого знчм Из рЗначение Цикл мЗначенийЯчейки.Добавить(знчм) КонецЦикла;
											
										Иначе // просто добавляем
											
											мЗначенийЯчейки.Добавить(рЗначение);
											
										КонецЕсли;
										
									КонецЦикла;
									
									рЗначениеЯчейки=?(мЗначенийЯчейки.Количество()=1,мЗначенийЯчейки[0],мЗначенийЯчейки);
									
									// определяем, сколько колонок вмещает текущая ячейка (возможно объединение, тогда будет повтор значения)
									
									квокол=?(рЯчейка.ОбъединениеКолонок=0,1,рЯчейка.ОбъединениеКолонок);
									
									//Если рЯчейка.Атрибуты.Количество()<>0 Тогда // можно и так, оставил для общего интересу...
									
									// рАтрОбъКол=рЯчейка.Атрибуты.ПолучитьИменованныйЭлемент("colspan"); // именно в нижнем регистре
									
									// Если рАтрОбъКол<>Неопределено Тогда квокол=рАтрОбъКол.Значение КонецЕсли;
									
									//КонецЕсли;
									
									Для й=1 По квокол Цикл
										
										мЗначенийКолонок.Добавить(рЗначениеЯчейки);
										
									КонецЦикла;
									
								КонецЦикла;
								
								// теперь массив значений для строки таблицы значений готов
								
								стротзнч=тзнч.Добавить();
								
								Для ы=0 По мЗначенийКолонок.Количество()-1 Цикл
									
									Если ы>тзнч.Колонки.Количество()-1 Тогда // по ситуации добавляем колонку произвольного типа
										
										тзнч.Колонки.Добавить("к"+СокрЛП(ы));
										
									КонецЕсли;
									
									стротзнч[ы]=мЗначенийКолонок.Получить(ы);
									
								КонецЦикла;
								
							КонецЦикла;
							
						Иначе
							
							тзнч=Неопределено;
							
						КонецЕсли; // если есть дочерние/нет дочерних
						
					//Иначе
					//	
					//	тзнч=Неопределено;
					//	
					//КонецЕсли; // по типу исходного основного элемента таблицы
					
				Иначе
					
					тзнч=Неопределено;
					
				КонецЕсли; // по количеству исходных узлов
				
				//===========================================================================================
				
				Если тзнч<>Неопределено Тогда мТаблиц.Добавить(тзнч) КонецЕсли;
				
			Иначе
				
				Если элдок.ЕстьДочерниеУзлы() Тогда
					
					ПолучитьТаблицыЗначенийИзHTML(элдок,мТаблиц);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено; // тут результат нас не интересует
	
КонецФункции

Функция ПолучитьТаблицыЗначенийИзHTML2(рИсходныйДокумент, мТаблиц = Неопределено) Экспорт
	
	Если мТаблиц = Неопределено Тогда // первый запуск, читаем сам документ
		
		мТаблицИтого = Новый Массив;
		
		рКодировка="UTF-8";
		
		чтен=Новый ЧтениеHTML;
		
		Если ТипЗнч(рИсходныйДокумент)=Тип("Строка") Тогда
			
			// считаем, что передали строку HTML-кода (фрагмент)
			
			чтен.УстановитьСтроку(рИсходныйДокумент,рКодировка);
			
		ИначеЕсли ТипЗнч(рИсходныйДокумент)=Тип("Файл") Тогда
			
			// считаем, что передали файл, проверенно существующий и читающийся оттуда, где он есть
			
			чтен.ОткрытьФайл(рИсходныйДокумент.ПолноеИмя,рКодировка);
			
		Иначе
			
			Сообщить("Передан неверный аргумент: "+СокрЛП(рИсходныйДокумент)+", недопустимый тип!",СтатусСообщения.Важное);
			
			Возврат мТаблицИтого;
			
		КонецЕсли;
		
		пострДОМ=Новый ПостроительDOM;
		
		гдок=пострДОМ.Прочитать(чтен);
		
		// запускаем уже рекурсивное чтение
		
		ПолучитьТаблицыЗначенийИзHTML(гдок.ЭлементДокумента,мТаблицИтого);
		
		// возвращаемся с верхнего уровня и вообще выходим
		
		Возврат мТаблицИтого;
		
	Иначе
		
		// рекурсивный запуск, уже читается ДокументHTML
		
		Для каждого элдок Из рИсходныйДокумент.ДочерниеУзлы Цикл
			
			Если ТипЗнч(элдок)=Тип("ЭлементТаблицаHTML") Тогда // таблица, переходим непосредственно к её обработке
				
				//===========================================================================================
				
				Если элдок.ДочерниеУзлы.Количество()=1 Тогда
					//рЭлемент = элдок; //РТ+
					рЭлемент=элдок.ДочерниеУзлы.Элемент(0);
					//
					Если ТипЗнч(рЭлемент)=Тип("ЭлементHTML") Тогда
						
						Если рЭлемент.ЕстьДочерниеУзлы() Тогда
							
							// колонки добавляются по факту и по порядку
							
							тзнч=Новый ТаблицаЗначений;
							
							Для каждого рСтрока Из рЭлемент.ДочерниеУзлы Цикл
								
								#Если Клиент Тогда
									ОбработкаПрерыванияПользователя();
								#КонецЕсли
								мЗначенийКолонок=Новый Массив;
								
								Для каждого рЯчейка Из рСтрока.ДочерниеУзлы Цикл
									
									#Если Клиент Тогда
										ОбработкаПрерыванияПользователя();
									#КонецЕсли
									
									
									Если ТипЗнч(рЯчейка)<>Тип("ЭлементЯчейкаТаблицыHTML") Тогда Продолжить КонецЕсли;
									
									// в ячейке может быть как один элемент (тогда вносится простое значение), так и несколько (тогда их массив)
									
									мЗначенийЯчейки=Новый Массив;
									
									Для каждого рУзел Из рЯчейка.ДочерниеУзлы ЦИкл
										
										Если ТипЗнч(рУзел)=Тип("ТекстDOM") Тогда
											
											рЗначение=СокрЛП(рУзел.ТекстовоеСодержимое);
											
										ИначеЕсли ТипЗнч(рУзел)=Тип("ЭлементТаблицаHTML") Тогда
											
											// идём ещё глубже, обрабатывая таблицу через вызов обработки её родителя
											
											мПодтаблиц=Новый Массив;
											
											ПолучитьТаблицыЗначенийИзHTML(рУзел.РодительскийУзел,мПодтаблиц);
											
											Если мПодтаблиц.Количество()=0 Тогда // ни одной таблицы не было
												
												рЗначение=Неопределено;
												
											ИначеЕсли мПодтаблиц.Количество()=1 Тогда
												
												рЗначение=мПодтаблиц.Получить(0);
												
											Иначе
												
												рЗначение=мПодтаблиц; // прямо как массив и идёт
												
											КонецЕсли;
											
										Иначе
											
											// идём ещё глубже в общем виде
											
											мПодтаблиц=Новый Массив;
											
											ПолучитьТаблицыЗначенийИзHTML(рУзел,мПодтаблиц);
											
											Если мПодтаблиц.Количество()=0 Тогда // ни одной таблицы не было
												
												рЗначение=Неопределено;
												
											ИначеЕсли мПодтаблиц.Количество()=1 Тогда
												
												рЗначение=мПодтаблиц.Получить(0);
												
											Иначе
												
												рЗначение=мПодтаблиц; // прямо как массив и идёт
												
											КонецЕсли;
											
										КонецЕсли;
										
										Если ТипЗнч(рЗначение)=Тип("Массив") Тогда // перекидываем в итоговый
											
											Для каждого знчм Из рЗначение Цикл мЗначенийЯчейки.Добавить(знчм) КонецЦикла;
											
										Иначе // просто добавляем
											
											мЗначенийЯчейки.Добавить(рЗначение);
											
										КонецЕсли;
										
									КонецЦикла;
									
									рЗначениеЯчейки=?(мЗначенийЯчейки.Количество()=1,мЗначенийЯчейки[0],мЗначенийЯчейки);
									
									// определяем, сколько колонок вмещает текущая ячейка (возможно объединение, тогда будет повтор значения)
									
									квокол=?(рЯчейка.ОбъединениеКолонок=0,1,рЯчейка.ОбъединениеКолонок);
									
									//Если рЯчейка.Атрибуты.Количество()<>0 Тогда // можно и так, оставил для общего интересу...
									
									// рАтрОбъКол=рЯчейка.Атрибуты.ПолучитьИменованныйЭлемент("colspan"); // именно в нижнем регистре
									
									// Если рАтрОбъКол<>Неопределено Тогда квокол=рАтрОбъКол.Значение КонецЕсли;
									
									//КонецЕсли;
									
									Для й=1 По квокол Цикл
										
										мЗначенийКолонок.Добавить(рЗначениеЯчейки);
										
									КонецЦикла;
									
								КонецЦикла;
								
								// теперь массив значений для строки таблицы значений готов
								
								стротзнч=тзнч.Добавить();
								
								Для ы=0 По мЗначенийКолонок.Количество()-1 Цикл
									
									Если ы>тзнч.Колонки.Количество()-1 Тогда // по ситуации добавляем колонку произвольного типа
										
										тзнч.Колонки.Добавить("к"+СокрЛП(ы));
										
									КонецЕсли;
									
									стротзнч[ы]=мЗначенийКолонок.Получить(ы);
									
								КонецЦикла;
								
							КонецЦикла;
							
						Иначе
							
							тзнч=Неопределено;
							
						КонецЕсли; // если есть дочерние/нет дочерних
						
					Иначе
					//	
						тзнч=Неопределено;
					//	
					КонецЕсли; // по типу исходного основного элемента таблицы
					
				Иначе
					
					тзнч=Неопределено;
					
				КонецЕсли; // по количеству исходных узлов
				
				//===========================================================================================
				
				Если тзнч<>Неопределено Тогда мТаблиц.Добавить(тзнч) КонецЕсли;
				
			Иначе
				
				Если элдок.ЕстьДочерниеУзлы() Тогда
					
					ПолучитьТаблицыЗначенийИзHTML(элдок,мТаблиц);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено; // тут результат нас не интересует
	
КонецФункции

