
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	
	ПараметрыФункции = Неопределено;
	уб_СС.ПодчиненныеРуководителя(, ТекущаяДата(), ПараметрыФункции);
	Если РольДоступна("уб_ЗП_ПолныйДоступ") Или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ВыставлятьШтрафы, Ложь) Тогда
		СписокСотрудников = 	уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(ТекущаяДата());
	Иначе
		СписокСотрудников = ПараметрыФункции.СписокСотрудников;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если СписокСотрудников.Количество() = 0 Тогда
			СписокСотрудников.Добавить(ПараметрыСеанса.уб_ТекущееФизЛицо);
		КонецЕсли;	
	КонецЕсли;	
	Если СписокСотрудников.Количество() = 1 Тогда
		Менеджер = СписокСотрудников[0].Значение ;
		Элементы.Менеджер.ТолькоПросмотр = Истина;
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод);
		Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(СписокСотрудников.ВыгрузитьЗначения());

	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(уб_temp.ПолучитьСписокАктуальныхПодразделений().ВыгрузитьЗначения());
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Обновить(Элемент);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ш.Штраф КАК Объект,
	|	Ш.ДатаШтрафа КАК Период,
	|	Ш.Период КАК Ключ,
	|	Ш.СуммаШтрафа КАК СуммаШтрафа,
	|	Ш.ОтветственныйЗаНачисление КАК Ответственный,
	|	Ш.Комментарий,
	|	Ш.Автор,
	|	Ш.Модификатор
	|ИЗ
	|	РегистрСведений.уб_Штрафы КАК Ш
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК С
	|		ПО Ш.Физлицо = С.Агент
	|ГДЕ
	|	Ш.ДатаШтрафа >= &Дата1
	|	И Ш.ДатаШтрафа <= &Дата2
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	С.Подразделение.Владелец,
	|	С.Подразделение.Наименование,
	|	Ш.Физлицо.Наименование
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА С.Подразделение ЕСТЬ NULL 
	|			ТОГДА С.Подразделение.Владелец
	|		КОГДА Ш.Физлицо ЕСТЬ NULL 
	|			ТОГДА С.Подразделение
	|		ИНАЧЕ Ш.Физлицо
	|	КОНЕЦ КАК Объект,
	|	СУММА(СуммаШтрафа)
	|ПО
	|	С.Подразделение.Владелец,
	|	С.Подразделение,
	|	Ш.Физлицо");
	//Запрос.УстановитьПараметр("РасчетныйПериод", ДатаФормирования);
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	ДопТекст = "";
	Если РольДоступна("уб_ЗП_ПолныйДоступ") Или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ВыставлятьШтрафы, Ложь)  Тогда
		// обработка фильтров
		
		Если ЗначениеЗаполнено(Менеджер) Тогда
			ДопТекст = "Ш.ФизЛицо = &Сотрудник";
			Запрос.УстановитьПараметр("Сотрудник", Менеджер);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ДопТекст = ДопТекст +?(ДопТекст="",""," И ")+ "С.Подразделение = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
	Иначе
		//СписокПодчиненных = уб_СС.ПодчиненныеРуководителя(, ДатаФормирования);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1","Ш.Физлицо В (&СписокДоступных)");
		Запрос.УстановитьПараметр("СписокДоступных", Элементы.Менеджер.СписокВыбора.ВыгрузитьЗначения());
	КонецЕсли;	
	
	//Если ЗначениеЗаполнено(фильтрАвтор) Тогда
	//	ДопТекст = ДопТекст +?(ДопТекст="",""," И ")+"Ш.Автор = &Автор";
	//	Запрос.УстановитьПараметр("Автор", фильтрАвтор);
	//КонецЕсли;
	
	Если ДопТекст <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1", ДопТекст);
	КонецЕсли;
	
	ЭлементыДерева = ДеревоШтрафов.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		ЭлементыДерева = ДеревоШтрафов.ПолучитьЭлементы();
		ВыборкаПодразделения = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПодразделения.Следующий() Цикл
			СтрокаДерева = ЭлементыДерева.Добавить();
			СтрокаДерева.Объект = ВыборкаПодразделения.Объект;
			
			ЭлементыДереваПодразделения = СтрокаДерева.ПолучитьЭлементы();
			
			ВыборкаСотрудники = ВыборкаПодразделения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСотрудники.Следующий() Цикл
				СтрокаДерева = ЭлементыДереваПодразделения.Добавить();
				СтрокаДерева.Объект = ВыборкаСотрудники.Объект;
				
				ЭлементыДереваСотрудника = СтрокаДерева.ПолучитьЭлементы();
				
				ВыборкаШтрафы = ВыборкаСотрудники.Выбрать();
				Пока ВыборкаШтрафы.Следующий() Цикл
					СтрокаДерева = ЭлементыДереваСотрудника.Добавить();
					//рокаДерева.Объект = ЭлементыДереваСотрудника.Объект;
					ЗаполнитьЗначенияСвойств(СтрокаДерева,ВыборкаШтрафы);
					СтрокаДерева.Комментарий = СтрЗаменить(СтрокаДерева.Комментарий,"¶",Символы.ПС);
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
		
	КонецЦикла;	
	
	
	//ЭлементыФормы.ДеревоШтрафов.СоздатьКолонки();	
	//   
	//Если УровеньВложенности < 3 Тогда
	//	Для Каждого Строка из ДеревоШтрафов.Строки Цикл
	//		ЭлементыФормы.ДеревоШтрафов.Развернуть(Строка, Ложь);
	//		Если УровеньВложенности < 2 Тогда
	//			Для Каждого Строка2 из Строка.Строки Цикл
	//				ЭлементыФормы.ДеревоШтрафов.Развернуть(Строка2, Ложь);
	//				Если УровеньВложенности < 1 Тогда
	//					Для Каждого Строка3 из Строка2.Строки Цикл
	//						ЭлементыФормы.ДеревоШтрафов.Развернуть(Строка3, Ложь);
	//					КонецЦикла;
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	Для каждого ЭлементДерева из ДеревоШтрафов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоШтрафов.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	Обновить(Элемент);
КонецПроцедуры
