//Настройки подключения
Процедура Инициализировать() Экспорт
	Адрес = "localhost";
	//Адрес = "172.26.99.43";
	//Адрес = "tau";
	Адрес = "omega";
	
	Ресурс = "/workmoney/hs/json/doc";
	Порт = 8081;
	Пользователь = "roman";
	Пароль = "dfhifdf";
	//РазмерПорции = 1000;
	ФлПроводить = Истина;
КонецПроцедуры	

Функция ОтправитьСсылку(Ссылка) Экспорт
	
	МассивОбъектов = Новый Массив;
	КэшЗначения = Новый Соответствие;
	СчетчикКэша = 0;
	СчетчикДокументов = 0;
	ТекОбъект = ЗначениеСтруктурой(Ссылка,КэшЗначения,ИСТИНА,,,,ЛОЖЬ,СчетчикКэша);
	ДополнитьОбъект(Ссылка,КэшЗначения);
	МассивОбъектов.Добавить(ТекОбъект);
	МассивОбъектов.Вставить(0,СтруктураКэша(КэшЗначения));
	Строкаjson = ЗаписьJSON(МассивОбъектов);
	Ответ = ОтправитьСтрокой(Строкаjson);
	
	//Возврат ЛОЖЬ;//Отладка
	Возврат ТипЗнч(Ответ)=Тип("Структура") и Ответ.Свойство("Ответ") и Найти(Ответ.Ответ,"Обработано 0")=0;
КонецФункции
//RDP+
//Отправка через сервис данных из узла регистрации (настройки соединения из узла)
Процедура Отправить() Экспорт
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Сообщить("Не заполнен узел обмена");
		Возврат;
	КонецЕсли;
	
	
	МассивОбъектов = Новый Массив;
	КэшЗначения = Новый Соответствие;
	СчетчикКэша = 0;
	СчетчикДокументов = 0;
	МассивОтправки = Новый Соответствие();
	
	ВыборкаДанных = ПланыОбмена.ВыбратьИзменения(Узел,1,);
	
	
	Организации = Узел.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
	
	Пока ВыборкаДанных.Следующий() Цикл
		//Попытка
		_Объект = ВыборкаДанных.Получить();
		Если ТипЗнч(_Объект) = ТИп("УдалениеОбъекта") Тогда
			МассивОтправки.Вставить(_Объект.Ссылка.УникальныйИдентификатор(),_Объект);
			МассивОбъектов.Добавить(Новый Структура("_Имя_,Метаданные,УникальныйИдентификатор","_УдалениеОбъекта_",_Объект.Ссылка.Метаданные().Имя,Строка(_Объект.Ссылка.УникальныйИдентификатор())));
		Иначе	
			Если Организации.Найти(_Объект.Фирма) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(_Объект)  = Тип("ДокументОбъект.Табель") и _Объект.Утвержден = ЛОЖЬ  Тогда
				Продолжить;
			КонецЕсли;
				
				
			МассивОтправки.Вставить(_Объект.Ссылка.УникальныйИдентификатор(),_Объект.Ссылка);
			ТекОбъект = ЗначениеСтруктурой(_Объект.Ссылка,КэшЗначения,ИСТИНА,,,,ЛОЖЬ,СчетчикКэша);
			ДополнитьОбъект(_Объект.Ссылка,КэшЗначения);
			МассивОбъектов.Добавить(ТекОбъект);
		КонецЕсли;	
		//Исключение
		//КонецПопытки;	
			
			//Сообщить("Подготовлен "+Выборка.Ссылка);
			//Прервать;
			
			СчетчикДокументов = СчетчикДокументов+1;
	КонецЦикла;	
	МассивОбъектов.Вставить(0,СтруктураКэша(КэшЗначения));
	Строкаjson = ЗаписьJSON(МассивОбъектов);
	
	Адрес        = Узел.Адрес;//"192.168.1.25";
	Ресурс       = Узел.Ресурс;//"/SB/hs/api/post";
	Порт         = Узел.Порт;//8080;
	Пользователь = Узел.Пользователь;//"Администратор";
	Пароль       = Узел.Пароль;//"rarus";
	РазмерПорции = 10;
	Защищенное   = Ложь;
	
	ПараметрыСоединения = Новый Структура;
	//Ответ = СоединениеДок(Выборка.Запрос); 
	Ответ = _Соединение(Адрес,
	Порт,
	Ресурс,
	Пользователь,
	Пароль,
	Защищенное,
	Строкаjson);
	Сообщить(Ответ);
	Если Не ПустаяСтрока(Ответ.Ответ) Тогда
		Сообщить(Ответ.Ответ);
	КонецЕсли;	
	Если Ответ.Свойство("Обработанные") Тогда
		
		Для каждого _Объект из Ответ.Обработанные Цикл
			
			ЗначениеОтмены = МассивОтправки.Получить(Новый УникальныйИдентификатор(_Объект));
			Если Не ЗначениеОтмены = Неопределено Тогда
				 //
				 ПланыОбмена.УдалитьРегистрациюИзменений(Узел,ЗначениеОтмены);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	

КонецПроцедуры	

//Отправка через сервис строки данных (настройки соединения из формы)
Функция ОтправитьСтрокой(Строкаjson) Экспорт
	
	ПараметрыСоединения = Новый Структура;
			//Ответ = СоединениеДок(Выборка.Запрос); 
		Ответ = _Соединение(Адрес,
		Порт,
		Ресурс,
		Пользователь,
		Пароль,
		Защищенное,
		Строкаjson);
		
		
		ЕстьСообщения = ТипЗнч(Ответ)=Тип("Структура") и Ответ.Свойство("Сообщения");
		
		Если ЕстьСообщения Тогда 
			Сообщить(Ответ.Сообщения);
		Иначе
			Попытка
				Сообщить("Отправлен пакет "+Ответ.Ответ);
			Исключение
				Сообщить("ОШИБКА "+Ответ);
			КонецПопытки;	
		КонецЕсли;	
		
		Возврат Ответ
		//"192.168.0.135",1986,"/MDM/hs/api/post","Администратор","",ЛОЖЬ,СтрокаЗапрос);
		
	//	Запись = Выборка.Ссылка.ПолучитьОбъект();
		//ЕстьСтатус = ТипЗнч(Ответ)=Тип("Структура") и Ответ.Свойство("Статус");
		//Если ЕстьСтатус И Ответ.Статус = "ЗаписьСоздана" Тогда
		//	Запись.Доставленно = Истина;
		//КонецЕсли;
		//Если ЕстьСтатус Тогда
		//	Запись.Ответ = Ответ.Статус;
		//Иначе	
		//	Запись.Ответ = Ответ;
		//КонецЕсли;	
		//ЕстьСообщения = ТипЗнч(Ответ)=Тип("Структура") и Ответ.Свойство("Сообщения");
		//Если ЕстьСообщения и НЕ ПустаяСтрока(Ответ.Сообщения) Тогда
		//	Запись.Ответ = Запись.Ответ+"/"+Ответ.Сообщения;
		//КонецЕсли;	

		//Запись.Записать();
	//КонецЦикла;
	
КонецФункции

//Вспомогательная функция, чтобы добавить в структуру объекта дополнительные данные
Процедура ДополнитьОбъект(_ОбъектСсылка,КэшЗначения) Экспорт
	Если ТипЗнч(_ОбъектСсылка) = тип("ДокументСсылка.уб_ОтчетКассира") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	П.Ссылка.Категория как Категория,
			|	ЕСТЬNULL(СУММА(П.Сумма), 0) КАК Сумма,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА П.ОбоснованиеРазницы = ""Оплата выезда клиентом""
			|					ТОГДА П.Сумма
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК СуммаВознагражденияКурьераКлиентом,
			|	ЕСТЬNULL(СУММА(П.Сумма) - СУММА(ВЫБОР
			|				КОГДА П.ОбоснованиеРазницы = ""Оплата выезда клиентом""
			|					ТОГДА П.Сумма
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК СуммаПоСтраховкам
			|ИЗ
			|	Документ.уб_ОтчетКассира КАК ОК
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК П
			|		ПО (П.Ссылка.ОтчетКассира = ОК.Ссылка)
			|			И (П.Ссылка.Проведен)
			|			И (П.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)
			|				ИЛИ (П.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
			|					И П.Ссылка.Дата > ДАТАВРЕМЯ(2023, 7, 1)))
			|ГДЕ
			|	ОК.Ссылка = &ОтчетКассира
			|
			|СГРУППИРОВАТЬ ПО
			|	П.Ссылка.Категория";
		Запрос.УстановитьПараметр("ОтчетКассира",_ОбъектСсылка);	
		ОтчетыКассиру = Запрос.Выполнить().Выгрузить();
		Если ОтчетыКассиру.НайтиСтроки(Новый Структура("Категория",Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка())).Количество()= 0 Тогда
			итОтчетаКассиру = ОтчетыКассиру.Вставить(0);
			итОтчетаКассиру.Категория = Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка();
			итОтчетаКассиру.Сумма = 0;
			итОтчетаКассиру.СуммаВознагражденияКурьераКлиентом= 0;
			итОтчетаКассиру.СуммаПоСтраховкам= 0;
		КонецЕсли;	
		Структура = КэшЗначения.Получить(_ОбъектСсылка);
		Структура.Значение.Вставить("_КатегорииВыплат_", ЗначениеСтруктурой(ОтчетыКассиру,КэшЗначения,ИСТИНА,,,,ЛОЖЬ));
	КонецЕсли;
КонецПроцедуры	

//Вспомогательная функция для индивидуальной настройки выгрузки, чтобы исключить конкретный объект 
Функция ИсключитьОбъект(_ОбъектСсылка) Экспорт
	Возврат Ложь;
КонецФункции	
	
//RDP-


//RDP+
//Альтернативный сериализатор ссылочных объектов, для последующей упаковки ЗначениеВСтрокуВнутр/JSON и т.п.
//Для идентичных или схожих объектов

Функция ЗначениеСтруктурой(Значение,КэшЗначения,Перезаписать = ЛОЖЬ,МаксУровень = 10,Уровень=0,ЭтоОтладка = ЛОЖЬ,ВставитьКэш = ЛОЖЬ,СчетчикКэша = 0) Экспорт
	ТекУровень = 1+Уровень;
	Если КэшЗначения = Неопределено Тогда
		КэшЗначения = Новый Соответствие;
	КонецЕсли;	
	ПромКэш = КэшЗначения.Получить(Значение);
	Если ПромКэш = Неопределено Тогда
		типЗнч = ТипЗнч(Значение);
		Если ТипЗнч = Тип("Дата") тогда
			Возврат XMLСтрока(Значение);
		ИначеЕсли ТипЗнч = Тип("Строка") 
			или ТипЗнч = Тип("Дата")
			ИЛИ ТипЗнч = Тип("Число")
			ИЛИ ТипЗнч = Тип("Булево")
			ИЛИ ТипЗнч = Тип("Неопределено")
			Тогда
			Возврат Значение
		Иначе
			Попытка 
				Мета = Значение.Метаданные();
				ЕстьМета = Истина;
			Исключение
				ЕстьМета = Ложь;
			КонецПопытки;	
			Если естьМета Тогда
				кэш = КэшЗначения.Получить(Мета);
				Если Кэш = Неопределено Тогда
					Если НЕ Метаданные.Справочники.Найти(Мета.Имя) = Неопределено Тогда
						//Это справочник
						Кэш = ПолучитьСтруктуруРеквизитов(Мета,"Справочники");
						КэшЗначения.Вставить(Мета,Кэш);
					ИначеЕсли НЕ Метаданные.Документы.Найти(Мета.Имя) = Неопределено Тогда 	
						//Это документ
						Кэш = ПолучитьСтруктуруРеквизитов(Мета,"Документы");
						Кэш.Добавить("Дата","Дата");
						Кэш.Добавить("Проведен","Проведен");
						Кэш.Добавить("Номер","Номер");
						КэшЗначения.Вставить(Мета,Кэш);
						//ИначеЕсли НЕ Метаданные.Документы.Найти(Мета.Имя) = Неопределено Тогда 	
						//	//Это документ
						//	Кэш = ПолучитьСтруктуруРеквизитов(Мета);
						//	КэшЗначения.Вставить(Мета,Кэш);
					ИначеЕсли НЕ Метаданные.Перечисления.Найти(Мета.Имя) = Неопределено Тогда 	
						//
						Если ЗначениеЗаполнено(Значение) Тогда
							ИндексЗначенияПеречисления = Перечисления[Мета.Имя].Индекс(Значение);
							Кэш = "_Перечисления."+Мета.Имя+"."+Метаданные.Перечисления[Мета.Имя].ЗначенияПеречисления[Перечисления[Мета.Имя].Индекс(Значение)].Имя;
							//КэшЗначения.Вставить(Мета,Кэш);
						Иначе
							Кэш = Неопределено;
						КонецЕсли;	
						Возврат Кэш;
					ИначеЕсли НЕ Метаданные.ПланыВидовРасчета.Найти(Мета.Имя) = Неопределено Тогда 	
						//Это документ
						Кэш = ПолучитьСтруктуруРеквизитов(Мета,"ПланыВидовРасчета");
						КэшЗначения.Вставить(Мета,Кэш);
					ИначеЕсли НЕ Метаданные.ПланыВидовХарактеристик.Найти(Мета.Имя) = Неопределено Тогда 	
						//Это документ
						Кэш = ПолучитьСтруктуруРеквизитов(Мета,"ПланыВидовХарактеристик");
						КэшЗначения.Вставить(Мета,Кэш);	
						//ИначеЕсли НЕ Метаданные.Документы.Найти(Мета.Имя) = Неопределено Тогда 	
						//	//Это документ
						//	Кэш = ПолучитьСтруктуруРеквизитов(Мета);
						//	КэшЗначения.Вставить(Мета,Кэш);	
					ИначеЕсли НЕ Метаданные.ПланыСчетов.Найти(Мета.Имя) = Неопределено Тогда 	
						Кэш = ПолучитьСтруктуруРеквизитов(Мета,"ПланыСчетов");
						КэшЗначения.Вставить(Мета,Кэш);	
					Иначе
						СтрокаОшибки = "--- НЕИЗВЕСТНО -- "+ Мета;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрокаОшибки;
						Сообщение.Сообщить();
						//Сообщить ("-"+ Мета);
						Возврат Новый Структура
					КонецЕсли;	
				Иначе
				КонецЕсли;	
				Если Не Кэш = Неопределено Тогда
					СтруктураЗначения   = Новый Структура;
					Если Перезаписать = ИСТИНА ТОГДА
						СтруктураЗначения.Вставить("_Перезаписать_",Перезаписать);
					КонецЕсли;	
					
					Если ЭтоОтладка = Истина Тогда
						Сообщить(Лев(">>>>>>>>>>>>>>>>>",ТекУровень)+Значение);
					КонецЕсли;	
					
					Для каждого ЭлСтруктуры из кэш Цикл
						ИмяКлюча = ЭлСтруктуры.Значение;
						Если Лев(ИмяКлюча,1) = "_" и Прав(ИмяКлюча,1) = "_" Тогда
							СтруктураЗначения.Вставить(ИмяКлюча,ЭлСтруктуры.Представление);
							Если ИмяКлюча = "_Коллекция_" Тогда
								СтруктураЗначения.Вставить("_УникальныйИдентификатор_",""+значение.УникальныйИдентификатор());								
								Если ЭлСтруктуры.Представление = "Справочники" Тогда
									СтруктураЗначения.Вставить("_ЭтоГруппа_",значение.ЭтоГруппа);								
								ИначеЕсли ЭлСтруктуры.Представление = "Документы" Тогда
									СтруктураЗначения.Вставить("_Проводить_",ФлПроводить);								
								КонецЕсли;
								//Для исключения возможного зацикливания сразу включаем объект в кэш, в нем будут только ключевые реквизиты
								//КэшЗначения.Вставить(Значение, СтруктураЗначения);
								УидКэша = СтруктураЗначения._Имя_+"_"+СтрЗаменить(СтруктураЗначения._УникальныйИдентификатор_,"-","_");
								СчетчикКэша = СчетчикКэша+1;
								КэшЗначения.Вставить(Значение, Новый Структура("УИД,Значение,Счетчик",УидКэша,СтруктураЗначения,СчетчикКэша));
							КонецЕсли;
							ИмяТЧ = Сред(ИмяКлюча,2,СтрДлина(ИмяКлюча)-2);
							СсылкаТЧ = значение.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ);
							Если НЕ СсылкаТЧ = Неопределено Тогда
								РеквизитыТЧ = РазложитьСтрокуВМассивПодстрок(ЭлСтруктуры.Представление,";");
								Массив = Новый Массив;
								Для каждого СтрокаТЧ из  Значение[ИмяТЧ] Цикл
									СтруктураСтрокиТЧ = Новый Структура;
									Для каждого РеквизитТЧ из  РеквизитыТЧ Цикл
										ТекИмяРеквизитаТЧ = СокрЛП(РеквизитТЧ);
										ЗначениеРеквизитаТЧ = СтрокаТЧ[ТекИмяРеквизитаТЧ];
										ТипЗнчРеквизитаТЧ =  ТипЗнч(ЗначениеРеквизитаТЧ); 
										Если ТипЗнчРеквизитаТЧ = Тип("Дата") Тогда
											СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, XmlСтрока(ЗначениеРеквизитаТЧ));
										ИначеЕсли ТипЗнчРеквизитаТЧ = Тип("Строка") 
											или ТипЗнчРеквизитаТЧ = Тип("Дата")
											ИЛИ ТипЗнчРеквизитаТЧ = Тип("Число")
											ИЛИ ТипЗнчРеквизитаТЧ = Тип("Булево") тогда
											СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, ЗначениеРеквизитаТЧ);
										Иначе
											СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, ЗначениеСтруктурой(ЗначениеРеквизитаТЧ,КэшЗначения,,МаксУровень,ТекУровень,ЭтоОтладка,,СчетчикКэша));
										КонецЕсли;
									КонецЦикла;	
									Массив.Добавить(СтруктураСтрокиТЧ);
								КонецЦикла;	
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение,Массив);
							КонецЕсли;
							
							Продолжить;
						КонецЕсли;	
						значениеЭлемента = значение[ИмяКлюча];
						
						Если ЗначениеЗаполнено(значениеЭлемента) Тогда
							Если ЗначениеЭлемента = Значение Тогда
								//Ссылка на себя же
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение,КопияСтруктуры(СтруктураЗначения))
							Иначе	
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение,ЗначениеСтруктурой(значениеЭлемента,КэшЗначения,,МаксУровень,ТекУровень,ЭтоОтладка,,СчетчикКэша));	
							КонецЕсли;	
						Иначе     
							ТипЗнчРеквизита =  ТипЗнч(значениеЭлемента); 
							Если ТипЗнчРеквизита = Тип("Дата") Тогда
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение, xmlстрока(значениеЭлемента));
							ИначеЕсли ТипЗнчРеквизита = Тип("Строка") 
								или ТипЗнчРеквизита = Тип("Дата")
								ИЛИ ТипЗнчРеквизита = Тип("Число")
								ИЛИ ТипЗнчРеквизита = Тип("Булево") тогда
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение, значениеЭлемента);							
							Иначе
								//Пустая ссылка
								СтруктураЗначения.Вставить(ЭлСтруктуры.Значение, Новый Структура);		
							КонецЕсли;
						КонецЕсли;
						//#Если Клиент Тогда
						//	ОбработкаПрерыванияПользователя();
						//#КонецЕсли
					КонецЦикла;	
					
					//КэшЗначения.Вставить(Значение, СтруктураЗначения);
					//Возврат СтруктураЗначения;
					
					
					//УидКэша = "_"+СтрЗаменить(Новый УникальныйИдентификатор,"-","_");
					УидКэша = СтруктураЗначения._Имя_+"_"+СтрЗаменить(СтруктураЗначения._УникальныйИдентификатор_,"-","_");
					СчетчикКэша = СчетчикКэша+1;
					КэшЗначения.Вставить(Значение, Новый Структура("УИД,Значение,Счетчик",УидКэша,СтруктураЗначения,СчетчикКэша));
					
					Если ВставитьКэш = Истина Тогда
						СтруктураЗначения.Вставить("_Кэш_",СтруктураКэша(КэшЗначения));
						Возврат СтруктураЗначения;
					Иначе	
						Возврат УидКэша; //Строка = ЗаписьJSON(СтруктураЗначения)
					КонецЕсли;	
					
					
					
				Иначе
					СтрокаОшибки = "Кэш не заполнен" + Значение;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрокаОшибки;
					Сообщение.Сообщить();
					
					Возврат Значение
				КонецЕсли;	
			Иначе
				Если ТипЗНЧ(Значение) = Тип("ХранилищеЗначения") Тогда
					Возврат Новый Структура;
				ИначеЕсли ТипЗНЧ(Значение) = Тип("ХранилищеЗначения") Тогда
					Возврат ""+Значение;
				ИначеЕсли ТипЗнч(Значение) = Тип ("ТаблицаЗначений") Тогда
					РеквизитыТЧ = Значение.Колонки;
					Массив = Новый Массив;
					Для каждого СтрокаТЧ из  Значение Цикл
						СтруктураСтрокиТЧ = Новый Структура;
						Для каждого РеквизитТЧ из  РеквизитыТЧ Цикл
							ТекИмяРеквизитаТЧ = РеквизитТЧ.Имя;
							ЗначениеРеквизитаТЧ = СтрокаТЧ[ТекИмяРеквизитаТЧ];
							ТипЗнчРеквизитаТЧ =  ТипЗнч(ЗначениеРеквизитаТЧ); 
							Если ТипЗнчРеквизитаТЧ = Тип("Дата") Тогда
								СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, XmlСтрока(ЗначениеРеквизитаТЧ));
							ИначеЕсли ТипЗнчРеквизитаТЧ = Тип("Строка") 
								или ТипЗнчРеквизитаТЧ = Тип("Дата")
								ИЛИ ТипЗнчРеквизитаТЧ = Тип("Число")
								ИЛИ ТипЗнчРеквизитаТЧ = Тип("Булево") тогда
								СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, ЗначениеРеквизитаТЧ);
							Иначе
								СтруктураСтрокиТЧ.Вставить(ТекИмяРеквизитаТЧ, ЗначениеСтруктурой(ЗначениеРеквизитаТЧ,КэшЗначения,,МаксУровень,ТекУровень,ЭтоОтладка,,СчетчикКэша));
							КонецЕсли;
						КонецЦикла;	
						Массив.Добавить(СтруктураСтрокиТЧ);
					КонецЦикла;	
				
					Возврат Массив;

				Иначе	
					СтрокаОшибки = "Без мета " + Значение;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрокаОшибки;
					Сообщение.Сообщить();
					//Сообщить("Без мета " + Значение);
					Возврат ""+Значение;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 
		
	Иначе
		Если ТекУровень>МаксУровень Тогда
			//Уровень, при котором данные о ссылке не переносятся
			Возврат Новый Структура;
		КонецЕсли;	
		Если ЭтоОтладка = Истина Тогда
			Сообщить(Лев(">>>>>>>>>>>>>>>>>",ТекУровень)+Значение);
		КонецЕсли;	
		кэш    = ПромКэш.Значение;
		уидкэш = ПромКэш.УИД;
		Возврат уидкэш;//КопияСтруктуры(Кэш);
	КонецЕсли;	
	
КонецФункции
//
Функция КопияСтруктуры(СтруктураЗначения) Экспорт
	Если ТипЗнч(СтруктураЗначения) = Тип("Структура") Тогда
		КопияСтруктуры = Новый ФиксированнаяСтруктура(СтруктураЗначения);
		////Для каждого ЭлВлож  из СтруктураЗначения Цикл
		////	КопияСтруктуры.Вставить(ЭлВлож.Ключ,ЭлВлож.Значение)
		////КонецЦикла;
		Возврат КопияСтруктуры;
	Иначе
		Возврат СтруктураЗначения;
	КонецЕсли;
КонецФункции								

//Метаданные объекта в виде списка значений Имя/Синоним/Табличные части
Функция ПолучитьСтруктуруРеквизитов(Мета,Коллекция="")
	Структура = Новый СписокЗначений;//Список значений позволяет выборку в порядке добавления/а также последющую сортировку при необходимости 
	Структура.Добавить("_Имя_",Мета.Имя);
	Структура.Добавить("_Коллекция_",Коллекция);
	Попытка
		Структура.Добавить("ПометкаУдаления","ПометкаУдаления");
		
		Если Мета.ДлинаКода>0 Тогда
			Структура.Добавить("Код","Код");
		КонецЕсли;
		Если Мета.ДлинаНаименования>0 Тогда
			Структура.Добавить("Наименование","Наименование");
		КонецЕсли;
		
		Если Мета.Иерархический = Истина Тогда
			Структура.Добавить("Родитель","Родитель");
		КонецЕсли;
		
		Если Мета.Владельцы.Количество()>0 Тогда
			Структура.Добавить("Владелец","Владелец");
		КонецЕсли;
	Исключение
	КонецПопытки;

	
	Для каждого рекв из Мета.Реквизиты Цикл
		Структура.Добавить(Рекв.Имя,Рекв.Синоним);
	КонецЦикла;	
	
	
	Для каждого ТЧ из Мета.ТабличныеЧасти Цикл
		
		СтруктураТЧ = "";
		Для каждого РеквТЧ из ТЧ.Реквизиты Цикл
			//СтруктураТЧ.Добавить(РеквТЧ.Имя);
			СтруктураТЧ = СтруктураТЧ+?(СтруктураТЧ="","",";")+РеквТЧ.Имя;
		КонецЦикла;
		
		Структура.Добавить("_"+ТЧ.Имя+"_",СтруктураТЧ);
	КонецЦикла;	

	
	
	Возврат Структура;
	
КонецФункции

Функция СтруктураКэша(Кэш) Экспорт
	Структура = Новый Структура;
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Значение");
	тз.Колонки.Добавить("Счетчик");
	//тз.Колонки.Добавить("Ссылка");
	тСтруктура = Тип("Структура");
	Для каждого элемент из Кэш Цикл
		Значение = элемент.Значение;
		Если ТипЗнч(Значение) = тСтруктура Тогда
			//Структура.Вставить(Значение.Ключ,Значение.Значение);
			
			Структура.Вставить(Значение.УИД,Значение.Значение);
			СтрокаТЗ =тз.Добавить();
			
			СтрокаТЗ.Значение = Новый Структура(Значение.УИД,Значение.Значение);
			СтрокаТЗ.Счетчик = Значение.Счетчик;
		КонецЕсли;	
	КонецЦикла;	
	//Тот что выше не имеет в себе ссылочных объектов или они пустые 
	ТЗ.Сортировать("Счетчик");
	Возврат ТЗ.ВыгрузитьКолонку("Значение"); 
КонецФункции	
//RDP-


// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт

	МассивСтрок = Новый Массив();

	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;

КонецФункции // РазложитьСтрокуВМассивПодстрок()

Функция ЗаписьJSON(Объект) Экспорт
	
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.УстановитьСтроку();
	//ЗаписатьJSON(ЗаписьJSON, Строка);	
	//СтрокаJSON = ЗаписьJSON.Закрыть();
	СтрокаJSON = СформироватьСтрокуJSON(Объект);
	Возврат СтрокаJSON;
	
КонецФункции

Функция ЧтениеJSON(Строка) Экспорт
	
	//ЧтениеJSON = Новый ЧтениеJSON;
	//ЧтениеJSON.УстановитьСтроку(Строка);
	//ОбъектJSON = ПрочитатьJSON(ЧтениеJSON);
	//ЧтениеJSON.Закрыть();
	ОбъектJSON = ЗаполнитьСтруктуруИзОтветаJSON(Строка);
	Возврат ОбъектJSON;
		
КонецФункции 

//Для старых версий 1С

Функция ПреобразоватьвСистему(Число10,система) Экспорт
	Если система > 36 или система < 2 тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система*(ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	КонецЦикла;
	
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	Если Нечётное тогда
		СтрокаСистема = "0"+СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
КонецФункции


Функция URLEncode(стр) Экспорт	
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимвола(Знак);
		
		если ((Знак>="a")и(Знак<="z")) или
			 ((Знак>="A")и(Знак<="Z")) или
			 ((Знак>="0")и(Знак<="9")) тогда
			Итог=Итог+Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
			Иначе
				Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
КонецФункции


Функция СформироватьСтрокуJSONИзМассива(Объект)
	СтрокаJSON = "[";
	
	Для каждого Элемент Из Объект Цикл
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			_Элемент = ""+Элемент;
			_Элемент = СтрЗаменить(_Элемент,"\","\\");
			_Элемент = СтрЗаменить(_Элемент,"""","\""");
			_Элемент = СтрЗаменить(_Элемент,Символы.Таб,"\t");
			_Элемент = СтрЗаменить(_Элемент,Символы.ВК,"\r");
			_Элемент = СтрЗаменить(_Элемент,Символы.ПС,"\n");
			СтрокаJSON = СтрокаJSON + """" + _Элемент + """";
		ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент), Символы.НПП, "");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		Иначе
			СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "]";
КонецФункции


Функция СформироватьСтрокуJSONИзСтруктуры(Объект)
	СтрокаJSON = "{";
	
	Для каждого Элемент Из Объект Цикл
		Если Элемент.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + """" + ":";
		
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			_Элемент = ""+Элемент.Значение;
			_Элемент = СтрЗаменить(_Элемент,"\","\\");
			_Элемент = СтрЗаменить(_Элемент,"""","\""");
			_Элемент = СтрЗаменить(_Элемент,Символы.Таб,"\t");
			_Элемент = СтрЗаменить(_Элемент,Символы.ВК,"\r");
			_Элемент = СтрЗаменить(_Элемент,Символы.ПС,"\n");

			СтрокаJSON = СтрокаJSON + """" + _Элемент + """";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, "");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		Иначе
			СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "}";
КонецФункции


Функция СформироватьСтрокуJSON(Объект) Экспорт
	СтрокаJSON = "";
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
		СоставСтруктуры = "";
		Для каждого Колонка Из Объект.Колонки Цикл
			СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
		КонецЦикла;
		
		МассивСтрок = Новый Массив;
		Для каждого Строка Из Объект Цикл
			СтруктураКолонок = Новый Структура(СоставСтруктуры);
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
			МассивСтрок.Добавить(СтруктураКолонок);
		КонецЦикла;
		
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(МассивСтрок);
	КонецЕсли;
	
	Возврат СтрокаJSON;
КонецФункции


Процедура ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, ТипДанных)
	ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));	
	НомерЗначения = 0;
	
	Пока ТекстJSON <> "" Цикл
		ПервыйСимвол = Лев(ТекстJSON, 1);
		Если ПервыйСимвол = "{" Тогда
			Значение = Новый Структура;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			ИначеЕсли ТипДанных = "Массив" Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
		ИначеЕсли ПервыйСимвол = "[" Тогда
			Значение = Новый Массив;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			Иначе
				Результат.Добавить(Значение);
			КонецЕсли;
		ИначеЕсли ПервыйСимвол = "}" И ТипДанных = "Структура" Тогда
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
		ИначеЕсли ПервыйСимвол = "]" И ТипДанных = "Массив" Тогда
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
		Иначе
			Если ТипДанных = "Структура" Тогда
				
				Поз = Найти(ТекстJSON, ":");
				Если Поз = 0 Тогда
					Прервать;
				КонецЕсли;
				
				ИмяЗначения = СокрЛП(Лев(ТекстJSON, Поз-1));
				
				ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз+1));
				
				Если Лев(ТекстJSON, 1) = "{" Тогда
					Значение = Новый Структура;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
				ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
					Значение = Новый Массив;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
				Иначе
					Поз = 0;
					Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
						Символ = Сред(ТекстJSON, Сч, 1);
						Если Символ = "," ИЛИ 
							Символ = "]" ИЛИ Символ = "}" Тогда
							Поз = Сч;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Поз = 0 Тогда
						Значение = ТекстJSON;
						ТекстJSON = "";
					Иначе
						//КОСТЫЛЬ
						ПозПС = Найти(ТекстJSON,Символы.ПС);
						Если ИмяЗначения= "Комментарий"	Тогда
							Поз = ПозПС-1;
							Значение = Лев(ТекстJSON, Поз-1);
							
						//КОСТЫЛЬ-
						Иначе	
							Значение = Лев(ТекстJSON, Поз-1);
						КонецЕсли;	
						
						ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
					КонецЕсли;
					
					Значение = СокрЛП(Значение);
				КонецЕсли;
				
				Попытка
					Результат.Вставить(ИмяЗначения, Значение);
				Исключение
					Сообщить(""+ОписаниеОшибки()+" "+ИмяЗначения+":"+Значение);
				КонецПопытки;	
			ИначеЕсли ТипДанных = "Массив" Тогда
				Поз = 0;
				Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
					Символ = Сред(ТекстJSON, Сч, 1);
					Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
						Поз = Сч;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Поз = 0 Тогда
					Значение = ТекстJSON;
					ТекстJSON = "";
				Иначе
					Значение = Лев(ТекстJSON, Поз-1);
					ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
				КонецЕсли;
				
				Значение = СокрЛП(Значение);
				
				Результат.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON) Экспорт
	Результат = Новый Структура;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, "\""", """");
	ТекстJSON = СтрЗаменить(ТекстJSON, """", "");	
	Если Лев(ТекстJSON, 1) = "{" Тогда
		ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, "Структура");
	ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
		МассивДанных = Новый Массив;
		ЗаполнитьДанныеИзОтветаJSON(МассивДанных, ТекстJSON, "Массив");
		
		Результат.Вставить("Значение", МассивДанных);
	КонецЕсли;
		
	Возврат Результат;
КонецФункции  



///
//HTTP соединения для отправки строки и получения в ответ строки JSON
Функция _Соединение(Адрес,Порт = 80,Ресурс,Пользователь,Пароль,Защищенное = ЛОжь,ТелоСтрокой) Экспорт
	
	Попытка
	//8.3 НОВЫЙ КОД 
		//HTTPСоединение = Новый HTTPСоединение(Адрес,Порт,Пользователь,Пароль); 
		//HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
		//
		//HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");    	 	
		//HTTPЗапрос.УстановитьТелоИзСтроки(ТелоСтрокой);
		//Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		//ОтветСтрокой = Результат.ПолучитьТелоКакСтроку();

	//8.2
	//Результат = уб_обменДанными.ВыполнитьHttpЗапрос();
	XMLHttp = GetCOMObject("", "Microsoft.XMLHTTP"); 
	
	Попытка
		XMLHttp.Open("POST", "http://"+Адрес+":"+Формат(порт,"ЧГ=")+""+Ресурс, Ложь,Пользователь,Пароль);
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибочный OPEN "+Ошибка+"("+Адрес+")";
		Сообщение.Сообщить();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина,,,,Адрес+".Error.Open" );
		Возврат Ложь;
	КонецПопытки;	
	//Отправка запроса      
	XMLHTTP.SetRequestHeader("Content-Type", "text/json");
	//Попытка
		XMLHttp.Send(ТелоСтрокой);	
	//Исключение
	//КонецПопытки;
	Если XMLHttp.Status = 200 Тогда //Список статусов: http://msdn.microsoft.com/en-us/library/ie/ms767625(v=vs.85).aspx
		// после возврата ResponseText - можно еще анализировать сам текст ответа приобразованый в ХМЛ структуру
		// использовать при необходимости прочитать результат запроса. 
		// Напр. мы в строке юзаем пхп скрипт и он нам должен отдать результат выполнения... В ResponseText и хранится это значение
		ОтветСтрокой = XMLHttp.ResponseText;
	Иначе	
         Сообщить(XMLHttp.ResponseText);

		 ОтветСтрокой="";
	КонецЕсли;	 
		
		Если ЛЕВ(ОтветСтрокой,1)="<" Тогда
			//Ответ = Результат.ПолучитьТелоКакСтроку("windows-1251");
		ИначеЕсли ОтветСтрокой ="" Тогда
			Возврат "Пустая строка в ответе";
		Иначе	
			Попытка
				//Ответ = ЧтениеJSON(ОтветСтрокой);//"windows-1251"));
				Ответ = ЗначениеИзСТрокиВнутр(ОтветСтрокой);
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат ОтветСтрокой;	
			КонецПопытки;
			
		КонецЕсли;	
		
		Возврат Ответ;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	
КонецФункции


//Подготовить массив данных типа соответствие {УИД, Ссылка}
Функция МассивОтправки(Узел) Экспорт
	
	
	ВыборкаДанных = ПланыОбмена.ВыбратьИзменения(Узел,1,);
	
	
	ДатаНачалаОбмена = Узел.ДатаНачалаОбмена;
	Организации = Узел.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
	Объекты = Неопределено;
	МассивОтправки = Новый Соответствие();
	Пока ВыборкаДанных.Следующий() Цикл
		//Попытка
		_Объект = ВыборкаДанных.Получить();
		Если ТипЗнч(_Объект) = ТИп("УдалениеОбъекта") Тогда
			МассивОтправки.Вставить(_Объект.Ссылка.УникальныйИдентификатор(),_Объект);
			//МассивОбъектов.Добавить(Новый Структура("_Имя_,Метаданные,УникальныйИдентификатор","_УдалениеОбъекта_",_Объект.Ссылка.Метаданные().Имя,Строка(_Объект.Ссылка.УникальныйИдентификатор())));
		Иначе	
			//Попытка
			//	Если Организации.Найти(_Объект.Организация) = Неопределено Тогда
			//		Продолжить;
			//	КонецЕсли;
			//	Если _Объект.Дата<ДатаНачалаОбмена Тогда
			//		Продолжить;
			//	КонецЕсли;	
			//Исключение
			//КонецПопытки;
			Если ВыгружатьОбъект(_Объект,Организации,ДатаНачалаОбмена,Объекты) = Истина Тогда
				МассивОтправки.Вставить(_Объект.Ссылка.УникальныйИдентификатор(),_Объект.Ссылка);
			КонецЕсли;	
		КонецЕсли;	
		//Исключение
		//КонецПопытки;	
		
		//Сообщить("Подготовлен "+Выборка.Ссылка);
		//Прервать;
		
		СчетчикДокументов = СчетчикДокументов+1;
	КонецЦикла;	
КОнецФункции	

//Отправить через сервис массив данных типа соответствие {УИД, Ссылка}
Процедура ОтправитьМассив(Узел,МассивОтправки) Экспорт
	
	МассивОбъектов = Новый Массив;
	КэшЗначения = Новый Соответствие;
	
	СчетчикКэша = 0;
	//СчетчикДокументов = 0;
	
	Организации = Неопределено;
	Попытка
		ДатаНачалаОбмена = Узел.ДатаНачалаОбмена;
	Исключение
		ДатаНачалаОбмена = Узел.ДатаНачалаВыгрузкиДокументов;
	КонецПопытки;	
	Объекты = Неопределено;
			
	Для каждого _ОбъектСтруктуры из МассивОтправки Цикл
		_Объект = _ОбъектСтруктуры.Значение;
		Если ТипЗнч(_Объект) = ТИп("УдалениеОбъекта") Тогда
			МассивОбъектов.Добавить(Новый Структура("_Имя_,Метаданные,УникальныйИдентификатор","_УдалениеОбъекта_",_Объект.Ссылка.Метаданные().Имя,Строка(_Объект.Ссылка.УникальныйИдентификатор())));
		Иначе	
			Если ВыгружатьОбъект(_Объект.Ссылка,Организации,ДатаНачалаОбмена,Объекты) = Истина Тогда
				
				Попытка
					Владелец =_Объект.Ссылка.Владелец;
					ЕстьВладелец = Истина;
				Исключение
					ЕстьВладелец = Ложь;
				КонецПопытки;
				
				Если ЕстьВладелец и ВыгружатьОбъект(Владелец,Организации,ДатаНачалаОбмена,Объекты) = Ложь Тогда
					Сообщить("Пропущен "+_Объект.Ссылка+" по владельцу "+Владелец);
					Продолжить;
				КонецЕсли;	
				
				ТекОбъект = ЗначениеСтруктурой(_Объект.Ссылка,КэшЗначения,ИСТИНА,,,,ЛОЖЬ,СчетчикКэша);
			Иначе
				Сообщить("Пропущен "+_Объект.Ссылка);
			КонецЕсли;	
			МассивОбъектов.Добавить(ТекОбъект);
		КонецЕсли;		
	КонецЦикла;			
	МассивОбъектов.Вставить(0,СтруктураКэша(КэшЗначения));
	Строкаjson = ЗаписьJSON(МассивОбъектов);
	
	
	СтруктураНастроек = РегистрыСведений.НастройкиТранспортаОбмена.НастройкиТранспортаWS(Узел);
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("URL",      СтруктураНастроек.WSURLВебСервиса);
	ПараметрыПодключения.Вставить("UserName", СтруктураНастроек.WSИмяПользователя);
	ПараметрыПодключения.Вставить("Password", СтруктураНастроек.WSПароль);
	
	//Возврат;
	ПараметрыАдреса = ИзвлечьАдрес(СтруктураНастроек.WSURLВебСервиса);
	Адрес        = ПараметрыАдреса.Адрес;//"192.168.1.25";
	Ресурс       = "/"+ПараметрыАдреса.ИмяБазы+"/hs/api/post";
	Порт         =ПараметрыАдреса.Порт;
	Пользователь = СтруктураНастроек.WSИмяПользователя;//"Администратор";
	Пароль       = СтруктураНастроек.WSПароль;//"rarus";
	РазмерПорции = 10;
	Защищенное   = Ложь;
	
	ПараметрыСоединения = Новый Структура;
	//Ответ = СоединениеДок(Выборка.Запрос); 
	Ответ = _Соединение(Адрес,
	Порт,
	Ресурс,
	Пользователь,
	Пароль,
	Защищенное,
	Строкаjson);
	Сообщить(Ответ);
	Если Не ПустаяСтрока(Ответ.Ответ) Тогда
		Сообщить(Ответ.Ответ);
	КонецЕсли;	
	Если Ответ.Свойство("Обработанные") Тогда
		
		Для каждого _Объект из Ответ.Обработанные Цикл
			
			ЗначениеОтмены = МассивОтправки.Получить(Новый УникальныйИдентификатор(_Объект));
			Если Не ЗначениеОтмены = Неопределено Тогда
				//
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел,ЗначениеОтмены);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры	

//Функция проверки трубетуся ли выгружать объекты исходя из настроек в узле
Функция ВыгружатьОбъект(_Объект,Организации = Неопределено,ДатаНачалаОбмена = Неопределено,Объекты = Неопределено) Экспорт
	//АДАПТАЦИЯ+++
	Если ТипЗнч(Узел) = Тип("Строка") Тогда
		Возврат Истина
	КонецЕсли;	
	//АДАПТАЦИЯ---
		
	Если Организации = Неопределено Тогда
		Организации=Узел.Организации.Выгрузить().ВыгрузитьКолонку("Организация")
	КонецЕсли;	
	
	Если Объекты = Неопределено Тогда
		Попытка
			ЕстьОбъекты = Истина;
			_Объекты=Узел.Объекты.Выгрузить();
			Объекты  = Новый Массив;
			Для каждого _ВидыОбъектов из _Объекты Цикл
				Если _ВидыОбъектов.Регистрация = Истина Тогда
					Объекты.Добавить(_ВидыОбъектов.Вид);
				КонецЕсли;	
			КонецЦикла;	
		Исключение
			ЕстьОбъекты = Ложь;
		КонецПопытки
	КонецЕсли;	

	
	Если ДатаНачалаОбмена = Неопределено Тогда
		ДатаНачалаОбмена = Узел.ДатаНачалаОбмена;
	КонецЕсли;	

	//Индивидуальная проверка
	Если ИсключитьОбъект(_Объект) = Истина Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	//универсальные проверки
	Попытка
		Если Организации.Найти(_Объект.Организация) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		Если Объекты.Найти(ПолучитьВид(_Объект.Метаданные()))= Неопределено и ЕстьОбъекты = Истина Тогда
			Возврат Ложь; 
		КонецЕсли;
		Если _Объект.Дата<ДатаНачалаОбмена и _Объект.Дата<>Дата(1,1,1) Тогда
			Возврат Ложь;
		КонецЕсли;	
		Возврат Истина;
	Исключение
		Возврат Истина;
	КонецПопытки;
КонецФункции		

Функция ИзвлечьАдрес (Строка)
	_Строка =""+Строка;
	
	_Адрес = "";
	//https://web.skype.com/
	Поз1 = Найти(_Строка,"//");
	Если Поз1>0 Тогда
		_Строка = Сред(_Строка,Поз1+2);
	КонецЕсли;	
	Поз1 = Найти(_Строка,":");//СтрНайти(Строка,":",НаправлениеПоиска.СНачала,Поз1+2);
	
	Если Поз1 = 0 Тогда 
		//сразу имя базы
		Поз2 = Найти(_Строка,"/");
		_Адрес = лев(_Строка,Поз2-1);
		_Порт  = 80;
	Иначе
		_Адрес = лев(_Строка,Поз1-1);
		_Строка = Сред(_Строка,Поз1+1);
		Поз2 = Найти(_Строка,"/");
		_Порт = Лев(_Строка,Поз2-1);
	КонецЕсли;
	
	_ИмяБазы = Сред(_Строка,Поз2+1);
	
	Если Прав(_ИмяБазы,1) ="/" Тогда
		_ИмяБазы = Лев(_ИмяБазы,СтрДлина(_ИмяБазы)-1);
		
	КонецЕсли;	
	
	Возврат Новый Структура("Адрес,ИмяБазы,Порт",_Адрес,_ИмяБазы,_Порт)
	
	
	
КонецФункции	

//Вспомогательная функция представления вида по метаданным
Функция ПолучитьВид(ТекущиеМетаданные)
	
	Имя = ТекущиеМетаданные.Имя;
	Префикс = "";
	Если Метаданные.Справочники.Содержит(ТекущиеМетаданные) Тогда
		Префикс = "Справочник.";
	ИначеЕсли Метаданные.Документы.Содержит(ТекущиеМетаданные) Тогда
		Префикс = "Документ.";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ТекущиеМетаданные) Тогда
		Префикс = "Регистр сведений.";
	КонецЕсли;
	СтрокаВида = Префикс+Имя;
	
	Возврат СтрокаВида;
	
КонецФункции	