
Функция СоздатьПустуюТЗДляВидовДокументов(Реквизит = Неопределено, Значение = Неопределено) Экспорт

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Реквизит");
	ТЗ.Колонки.Добавить("Значение");
	Если Реквизит <> Неопределено Тогда
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Реквизит = Реквизит;
		СтрокаТЗ.Значение = Значение;
	КонецЕсли;
	Возврат ТЗ;

КонецФункции // СоздатьПустуюТЗДляВидовДокументов()

Процедура ЗаписатьСтрокуРСВидовДокументов(Ссылка, ВидДокумента, ТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПД.Объект,
	|	ПД.ВидДокумента,
	|	ПД.Используется,
	|	ПД.Предоставлен,
	|	ПД.Комментарий,
	|	ПД.Автор,
	|	ПД.ДатаСоздания,
	|	ПД.ТипПодразделения
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|ГДЕ
	|	ПД.ВидДокумента = &ВидДокумента
	|	И ПД.Объект = &Ссылка";
	Запрос.УстановитьПараметр("ВидДокумента", 	ВидДокумента);
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда
		Строка = Результат[0];
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			Строка[СтрокаТЗ.Реквизит] = СтрокаТЗ.Значение;
		КонецЦикла;
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Модификатор 		= ПараметрыСеанса.ТекущийПользователь;
		Запись.ДатаИзменения    = ТекущаяДата();
		Попытка
			Запись.Записать();
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтрокуТЗРегистраВидовДокументов(Ссылка, ВидДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПД.Используется,
	|	ПД.Предоставлен,
	|	ПД.Комментарий,
	|	ПД.Автор,
	|	ПД.ДатаСоздания
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|ГДЕ
	|	ПД.ВидДокумента = &ВидДокумента
	|	И ПД.Объект = &Ссылка";
	Запрос.УстановитьПараметр("ВидДокумента", 	ВидДокумента);
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		Возврат ТЗ[0];
	КонецЕсли;

КонецФункции // ПолучитьСтрокуТЗРегистраВидовДокументов()

Функция МассивНедобавленныхДокументов(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВД.Ссылка,
	|	ВД.ТипПодразделения
	|ИЗ
	|	Справочник.уб_ВидыДокументовКПолисам КАК ВД
	|ГДЕ
	|	НЕ ВД.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПД.ВидДокумента
	|				ИЗ
	|					РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|				ГДЕ
	|					ПД.Объект = &Ссылка)
	|	И НЕ ВД.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // СписокНедобавленныхДокументов()

Процедура ЗаполнитьПредоставленныеДокументыПоЗаявке(Ссылка, Заявка) Экспорт

	Если Не Ссылка.Пустая()
		И ТипЗнч(Заявка) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста")
		И Не Заявка.Пустая() 
		Тогда
		//заполняем
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПД.ВидДокумента,
		|	ПД.Используется,
		|	ПД.Предоставлен,
		|	ПД.Комментарий,
		|	ПД.ТипПодразделения
		|ИЗ
		|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
		|ГДЕ
		|	ПД.Объект = &Заявка
		|	И НЕ ПД.Объект.НетДокументов");
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Набор = СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить(Ссылка);
			текПользователь 	= ПараметрыСеанса.ТекущийПользователь;
			ДатаЗаписиНабора 	= ТекущаяДата();
			Пока Выборка.Следующий() Цикл
				Запись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Объект			= Ссылка;
				Запись.Автор 			= текПользователь;
				Запись.Модификатор  	= текПользователь;
				Запись.ДатаСоздания 	= ДатаЗаписиНабора;
				Запись.ДатаИзменения    = ДатаЗаписиНабора;
			КонецЦикла;
			Если Набор.Количество() > 0 Тогда
				Попытка
					Набор.Записать();
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ПредоставленныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Ссылка, ИзСписка = Истина, Форма = Неопределено) Экспорт
	
	Если Форма <> Неопределено Тогда
		Если Форма.Модифицированность() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ модифицирован. Перед изменением предоставленных документов необходимо записать документ.";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВД.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ВД.Ссылка) КАК Наименование,
	|	ВД.ТипПодразделения,
	|	ПРЕДСТАВЛЕНИЕ(ВД.ВидФайлаB2B) КАК Вид
	|ИЗ
	|	Справочник.уб_ВидыДокументовКПолисам КАК ВД
	|ГДЕ
	|	НЕ ВД.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПД.ВидДокумента
	|				ИЗ
	|					РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|				ГДЕ
	|					ПД.Объект = &Ссылка)
	|	И НЕ ВД.ПометкаУдаления
	|	И НЕ ВД.НеИспользуется
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВД.ВидФайлаB2B,
	|	ВД.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.Выполнить().Выгрузить();
	ТЗНеДобавленных = Запрос.Выполнить().Выгрузить();
	Меню = Новый СписокЗначений();
	Для Каждого СтрокаТЗ Из ТЗНеДобавленных Цикл
		Меню.Добавить(СтрокаТЗ.Ссылка, СтрокаТЗ.Наименование + "  [" + СтрокаТЗ.Вид + "]");
	КонецЦикла;
	Если Меню.Количество() = 0 Тогда
		//нечего добавлять
		#Если Клиент Тогда
			Предупреждение("Все документы уже присутствуют в списке!");
		#КонецЕсли
	ИначеЕсли ИзСписка Тогда
		ВыбраныЭлементы = Меню.ОтметитьЭлементы("Выберите виды документов:");
		Если ВыбраныЭлементы Тогда
			МенюКоличество = Меню.Количество();
			Индекс = 0;
			Для Каждого ЭлементСпискаЗначений Из Меню Цикл
				Если ЭлементСпискаЗначений.Пометка Тогда
					Индекс = Индекс + 1;
					Запись = СоздатьМенеджерЗаписи();
					Запись.ВидДокумента 	= ЭлементСпискаЗначений.Значение;
					СтрокаТЗ = ТЗНеДобавленных.Найти(ЭлементСпискаЗначений.Значение, "Ссылка");
					Запись.ТипПодразделения = СтрокаТЗ.ТипПодразделения;
					Запись.Объект			= Ссылка;
					Запись.Используется		= Истина;
					//уб_СС.ЗаполнитьИнфоОМодификацииДляРС(Запись, Истина);					
					//Запрос = Новый Запрос;
					//Запрос.Текст = 
					//"ВЫБРАТЬ
					//|	ВЫБОР
					//|		КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
					//|			ТОГДА уб_СтраховойПолис.ОбъектСтрахования
					//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
					//|	КОНЕЦ КАК ОбъектСтрахования,
					//|	ВЫБОР
					//|		КОГДА уб_СтраховойПолис.Заявка.СозданНаОсновании = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
					//|			ТОГДА уб_СтраховойПолис.Заявка
					//|		ИНАЧЕ уб_СтраховойПолис.Заявка.СозданНаОсновании
					//|	КОНЕЦ КАК Заявка,
					//|	уб_СтраховойПолис.Ссылка
					//|ПОМЕСТИТЬ ВТ_СтраховойПолис
					//|ИЗ
					//|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
					//|ГДЕ
					//|	уб_СтраховойПолис.Ссылка = &Ссылка
					//|	И НЕ уб_СтраховойПолис.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
					//|	И ВЫБОР
					//|			КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
					//|				ТОГДА НЕ уб_СтраховойПолис.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
					//|			ИНАЧЕ ИСТИНА
					//|		КОНЕЦ
					//|;
					//|
					//|////////////////////////////////////////////////////////////////////////////////
					//|ВЫБРАТЬ
					//|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Заявка
					//|ПОМЕСТИТЬ ВТ_ВсеСвязанныеЗаявки
					//|ИЗ
					//|	ВТ_СтраховойПолис КАК ВТ_СтраховойПолис
					//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
					//|		ПО (ВТ_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
					//|				ИЛИ ВТ_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.СозданНаОсновании)
					//|;
					//|
					//|////////////////////////////////////////////////////////////////////////////////
					//|ВЫБРАТЬ
					//|	МАКСИМУМ(уб_ПредоставленныеДокументыСП.Предоставлен) КАК Предоставлен
					//|ИЗ
					//|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК уб_ПредоставленныеДокументыСП
					//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеСвязанныеЗаявки КАК ВТ_ВсеСвязанныеЗаявки
					//|		ПО (уб_ПредоставленныеДокументыСП.Объект ССЫЛКА Документ.уб_СтраховойПолис)
					//|			И уб_ПредоставленныеДокументыСП.Объект.Заявка = ВТ_ВсеСвязанныеЗаявки.Заявка
					//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтраховойПолис КАК ВТ_СтраховойПолис
					//|		ПО (уб_ПредоставленныеДокументыСП.ВидДокумента = &ВидДокумента)
					//|			И (&ВидДокументаНеСвязанСОбъектомСтрахования = ИСТИНА
					//|				ИЛИ уб_ПредоставленныеДокументыСП.Объект.ОбъектСтрахования = ВТ_СтраховойПолис.ОбъектСтрахования)";
					//Запрос.УстановитьПараметр("Ссылка", Ссылка);
					//Запрос.УстановитьПараметр("ВидДокумента", Запись.ВидДокумента);
					//Запрос.УстановитьПараметр("ВидДокументаНеСвязанСОбъектомСтрахования", Запись.ВидДокумента.НеСвязанСОбъектомСтрахования);
					//Выборка = Запрос.Выполнить().Выбрать();
					//Если Выборка.Следующий() Тогда
					//	Запись.Предоставлен = Выборка.Предоставлен;
					//КонецЕсли;
					Попытка
						Запись.Записать();
						Если Индекс = МенюКоличество Тогда
							//возвращаем структуру ключа
							Возврат СоздатьКлючЗаписи(Новый Структура("Объект, ВидДокумента", Запись.Объект, Запись.ВидДокумента));
						КонецЕсли;
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//ВыбранныйПункт = Меню.ВыбратьЭлемент("Выберите вид документа");
		//Если ВыбранныйПункт <> Неопределено Тогда
		//	Запись = СоздатьМенеджерЗаписи();
		//	Запись.ВидДокумента 	= ВыбранныйПункт.Значение;
		//	СтрокаТЗ = ТЗНеДобавленных.Найти(ВыбранныйПункт.Значение, "Ссылка");
		//	Запись.ТипПодразделения = СтрокаТЗ.ТипПодразделения;
		//	Запись.Объект			= Ссылка;
		//	Запись.Используется		= Истина;
		//	уб_СС.ЗаполнитьИнфоОМодификацииДляРС(Запись, Истина);			
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ВЫБОР
		//	|		КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
		//	|			ТОГДА уб_СтраховойПолис.ОбъектСтрахования
		//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		//	|	КОНЕЦ КАК ОбъектСтрахования,
		//	|	ВЫБОР
		//	|		КОГДА уб_СтраховойПолис.Заявка.СозданНаОсновании = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
		//	|			ТОГДА уб_СтраховойПолис.Заявка
		//	|		ИНАЧЕ уб_СтраховойПолис.Заявка.СозданНаОсновании
		//	|	КОНЕЦ КАК Заявка,
		//	|	уб_СтраховойПолис.Ссылка
		//	|ПОМЕСТИТЬ ВТ_СтраховойПолис
		//	|ИЗ
		//	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		//	|ГДЕ
		//	|	уб_СтраховойПолис.Ссылка = &Ссылка
		//	|	И НЕ уб_СтраховойПолис.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
		//	|	И ВЫБОР
		//	|			КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
		//	|				ТОГДА НЕ уб_СтраховойПолис.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		//	|			ИНАЧЕ ИСТИНА
		//	|		КОНЕЦ
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Заявка
		//	|ПОМЕСТИТЬ ВТ_ВсеСвязанныеЗаявки
		//	|ИЗ
		//	|	ВТ_СтраховойПолис КАК ВТ_СтраховойПолис
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		//	|		ПО (ВТ_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
		//	|				ИЛИ ВТ_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.СозданНаОсновании)
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	МАКСИМУМ(уб_ПредоставленныеДокументыСП.Предоставлен) КАК Предоставлен
		//	|ИЗ
		//	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК уб_ПредоставленныеДокументыСП
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеСвязанныеЗаявки КАК ВТ_ВсеСвязанныеЗаявки
		//	|		ПО (уб_ПредоставленныеДокументыСП.Объект ССЫЛКА Документ.уб_СтраховойПолис)
		//	|			И уб_ПредоставленныеДокументыСП.Объект.Заявка = ВТ_ВсеСвязанныеЗаявки.Заявка
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтраховойПолис КАК ВТ_СтраховойПолис
		//	|		ПО (уб_ПредоставленныеДокументыСП.ВидДокумента = &ВидДокумента)
		//	|			И (&ВидДокументаНеСвязанСОбъектомСтрахования = ИСТИНА
		//	|				ИЛИ уб_ПредоставленныеДокументыСП.Объект.ОбъектСтрахования = ВТ_СтраховойПолис.ОбъектСтрахования)";
		//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		//	Запрос.УстановитьПараметр("ВидДокумента", Запись.ВидДокумента);
		//	Запрос.УстановитьПараметр("ВидДокументаНеСвязанСОбъектомСтрахования", Запись.ВидДокумента.НеСвязанСОбъектомСтрахования);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Запись.Предоставлен = Выборка.Предоставлен;
		//	КонецЕсли;
		//	
		//	Попытка
		//		Запись.Записать();
		//		//возвращаем структуру ключа
		//		Возврат СоздатьКлючЗаписи(Новый Структура("Объект, ВидДокумента", Запись.Объект, Запись.ВидДокумента));
		//	Исключение
		//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки());
		//	КонецПопытки;
		//КонецЕсли;
	Иначе
		Форма = Справочники.уб_ВидыДокументовКПолисам.ПолучитьФормуВыбора();
		Форма.МножественныйВыбор = Истина;
		ОтборСсылка = Форма.СправочникСписок.Отбор.Ссылка;
		ОтборСсылка.ВидСравнения 	= ВидСравнения.ВСписке;
		ОтборСсылка.Значение		= Меню;
		ЗначениеВыбора = Форма.ОткрытьМодально();
	КонецЕсли;
	
КонецФункции

Процедура ПредоставленныеДокументыПередНачаломИзменения(Элемент, Отказ, Форма = Неопределено) Экспорт
	
	Если Форма <> Неопределено Тогда
		Если Форма.Модифицированность() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ модифицирован. Перед изменением предоставленных документов необходимо записать документ.";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если Элемент.ТекущаяКолонка.Имя = "ВидДокумента" И Не Элемент.ТекущаяСтрока["ВидДокумента"].Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредоставленныеДокументыПередУдалением(Элемент, Отказ) Экспорт
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура ПредоставленныеДокументыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, стрДокументы) Экспорт
	
	//Сохраняем данные для ручной обработки модификации
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		стрДокументы = Новый Структура;
		стрДокументы.Вставить("Комментарий",		ТекДанные.Комментарий);
		стрДокументы.Вставить("Используется",   	ТекДанные.Используется);
		стрДокументы.Вставить("Предоставлен",   	ТекДанные.Предоставлен);
		стрДокументы.Вставить("ВидДокумента",		ТекДанные.ВидДокумента);
		стрДокументы.Вставить("ТипПодразделения",	ТекДанные.ТипПодразделения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредоставленныеДокументыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	Если Не ДанныеСтроки.Используется Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Серый;
	КонецЕсли;
	
КонецПроцедуры

Функция ПредоставленныеДокументыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Ссылка, стрДокументы) Экспорт
	
	Результат = Ложь;
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.Предоставлен И НЕ ТекДанные.Используется Тогда 
			ТЗ = СоздатьПустуюТЗДляВидовДокументов("Используется", Истина);
			ЗаписатьСтрокуРСВидовДокументов(Ссылка, ТекДанные.ВидДокумента, ТЗ);
		КонецЕсли;
		//ручная модификация регистра сведений уб_ПредоставленныеДокументыСП
		//Если 
		//	ТекДанные.ВидДокумента 			<> стрДокументы.ВидДокумента 
		//	Или ТекДанные.Комментарий 		<> стрДокументы.Комментарий 
		//	Или ТекДанные.Используется 		<> стрДокументы.Используется 
		//	Или ТекДанные.Предоставлен 		<> стрДокументы.Предоставлен 
		//	Или ТекДанные.ТипПодразделения  <> стрДокументы.ТипПодразделения
		//	Тогда
		//	Запрос = Новый Запрос(
		//	"ВЫБРАТЬ
		//	|	ПД.Объект,
		//	|	ПД.ВидДокумента,
		//	|	ПД.Используется,
		//	|	ПД.Предоставлен,
		//	|	ПД.Комментарий,
		//	|	ПД.ТипПодразделения,
		//	|	ПД.Автор,
		//	|	ПД.ДатаСоздания
		//	|ИЗ
		//	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
		//	|ГДЕ
		//	|	ПД.Объект = &Ссылка И ПД.ВидДокумента = &ВидДокумента");
		//	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		//	Запрос.УстановитьПараметр("ВидДокумента",	ТекДанные.ВидДокумента);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Запись = СоздатьМенеджерЗаписи();
		//		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		//		ЗаполнитьЗначенияСвойств(Запись, ТекДанные);
		//		Запись.Модификатор 		= ПараметрыСеанса.ТекущийПользователь;
		//		Запись.ДатаИзменения    = ТекущаяДата();
		//		Попытка
		//			
		//			Запись.Записать();
		//			Результат = Истина;
		//		Исключение
		//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки());
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции

