
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не Отказ Тогда
		Объект = Отбор.Объект.Значение;
		
		Если ЭтотОбъект.Количество() > 0 
			И ТипЗнч(Объект) = Тип("ДокументСсылка.уб_СтраховойПолис") 
			И Не Объект.Пустая() Тогда
			
			МассивОбъектовДляОповещения = Новый Массив;
			МассивОбъектовДляОповещения.Добавить(Объект);
			
			ВидДокумента = Отбор.ВидДокумента.Значение;
			Если ЗначениеЗаполнено(ВидДокумента) Тогда
				НовоеЗначениеПредоставлен = ЭтотОбъект[0].Предоставлен;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ВЫБОР
				               |		КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
				               |			ТОГДА уб_СтраховойПолис.ОбъектСтрахования
				               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
				               |	КОНЕЦ КАК ОбъектСтрахования,
				               |	ВЫБОР
				               |		КОГДА уб_СтраховойПолис.Заявка.СозданНаОсновании = НЕОПРЕДЕЛЕНО
				               |			ТОГДА уб_СтраховойПолис.Заявка
				               |		ИНАЧЕ уб_СтраховойПолис.Заявка.СозданНаОсновании
				               |	КОНЕЦ КАК Заявка,
				               |	уб_СтраховойПолис.Ссылка
				               |ПОМЕСТИТЬ ВТ_СтраховойПолис
				               |ИЗ
				               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
				               |ГДЕ
				               |	уб_СтраховойПолис.Ссылка = &Ссылка
				               |	И НЕ уб_СтраховойПолис.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
				               |	И ВЫБОР
				               |			КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ЛОЖЬ
				               |				ТОГДА НЕ уб_СтраховойПолис.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Заявка
				               |ПОМЕСТИТЬ ВТ_ВсеСвязанныеЗаявки
				               |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |ГДЕ
				               |	(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В
				               |				(ВЫБРАТЬ
				               |					ВТ_СтраховойПолис.Заявка
				               |				ИЗ
				               |					ВТ_СтраховойПолис КАК ВТ_СтраховойПолис)
				               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.СозданНаОсновании В
				               |				(ВЫБРАТЬ
				               |					ВТ_СтраховойПолис.Заявка
				               |				ИЗ
				               |					ВТ_СтраховойПолис КАК ВТ_СтраховойПолис))
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	ПредДокументыСП.Объект,
				               |	МАКСИМУМ(ПредДокументыСП.Предоставлен) КАК Предоставлен
				               |ИЗ
				               |	(ВЫБРАТЬ
				               |		уб_ПредоставленныеДокументыСП.Объект КАК Объект,
				               |		уб_ПредоставленныеДокументыСП.Объект.Заявка КАК Заявка,
				               |		уб_ПредоставленныеДокументыСП.ВидДокумента КАК ВидДокумента,
				               |		уб_ПредоставленныеДокументыСП.Предоставлен КАК Предоставлен,
				               |		уб_ПредоставленныеДокументыСП.Объект.ОбъектСтрахования КАК ОбъектСтрахования
				               |	ИЗ
				               |		РегистрСведений.уб_ПредоставленныеДокументыСП КАК уб_ПредоставленныеДокументыСП
				               |	ГДЕ
				               |		ВЫБОР
				               |				КОГДА &ВидДокументаНеСвязанСОбъектомСтрахования = ИСТИНА
				               |					ТОГДА ИСТИНА
				               |				ИНАЧЕ уб_ПредоставленныеДокументыСП.Объект.ОбъектСтрахования В
				               |						(ВЫБРАТЬ
				               |							ВТ_СтраховойПолис.ОбъектСтрахования
				               |						ИЗ
				               |							ВТ_СтраховойПолис КАК ВТ_СтраховойПолис)
				               |			КОНЕЦ
				               |		И НЕ уб_ПредоставленныеДокументыСП.Объект В
				               |					(ВЫБРАТЬ
				               |						ВТ_СтраховойПолис.Ссылка
				               |					ИЗ
				               |						ВТ_СтраховойПолис КАК ВТ_СтраховойПолис)
				               |		И уб_ПредоставленныеДокументыСП.Объект.Заявка В
				               |				(ВЫБРАТЬ
				               |					ВТ_ВсеСвязанныеЗаявки.Заявка
				               |				ИЗ
				               |					ВТ_ВсеСвязанныеЗаявки КАК ВТ_ВсеСвязанныеЗаявки)) КАК ПредДокументыСП
				               |ГДЕ
				               |	ПредДокументыСП.Предоставлен <> &НовоеЗначениеПредоставлен
				               |	И ПредДокументыСП.ВидДокумента = &ВидДокумента
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ПредДокументыСП.Объект";
				Запрос.УстановитьПараметр("Ссылка", Объект);
				Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
				Запрос.УстановитьПараметр("ВидДокументаНеСвязанСОбъектомСтрахования", ВидДокумента.НеСвязанСОбъектомСтрахования);
				Запрос.УстановитьПараметр("НовоеЗначениеПредоставлен", НовоеЗначениеПредоставлен);
				Выборка = Запрос.Выполнить().Выбрать();
				ТекущаяЗапись = ЭтотОбъект[0];
				Если Выборка.Следующий() И НЕ ЗначениеЗаполнено(ТекущаяЗапись.Автор)Тогда 
					НовоеЗначениеПредоставлен = Выборка.Предоставлен;
					ЭтотОбъект.ОбменДанными.Загрузка = Истина;
					ТекущаяЗапись.Предоставлен = НовоеЗначениеПредоставлен;
					уб_СС.ЗаполнитьИнфоОМодификацииДляРС(ТекущаяЗапись, Истина);
					ЭтотОбъект.Записать();
				Иначе
					ЭтотОбъект.ОбменДанными.Загрузка = Истина;
					уб_СС.ЗаполнитьИнфоОМодификацииДляРС(ТекущаяЗапись, Истина);
					ЭтотОбъект.Записать();
				КонецЕсли;
				Выборка.Сбросить();
				
				Пока Выборка.Следующий() Цикл
					НаборЗаписей = РегистрыСведений.уб_ПредоставленныеДокументыСП.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
					НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
					НаборЗаписей.Прочитать();
					Для Каждого СтрокаНабора Из НаборЗаписей Цикл
						СтрокаНабора.Предоставлен = НовоеЗначениеПредоставлен;
						уб_СС.ЗаполнитьИнфоОМодификацииДляРС(СтрокаНабора, Истина);
					КонецЦикла;
					НаборЗаписей.ОбменДанными.Загрузка = Истина;//чтобы не зацикливалось
					НаборЗаписей.Записать();
					МассивОбъектовДляОповещения.Добавить(Выборка.Объект);
				КонецЦикла;
			КонецЕсли;
			
			#Если Клиент Тогда
				Для Каждого Элемент Из МассивОбъектовДляОповещения Цикл
					Оповестить("ПриЗаписи_уб_ПредоставленныеДокументыСП", Элемент);
				КонецЦикла;
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



