
//Добавляем запись в журнал регистрации и выводим сообщение
//
//														ПАРАМЕТРЫ:
//*************************************************************************************************************************
//	ТекстСообщение			- Строка                                                                                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	ТипСообщение			- Строка						Сообщить, Предупреждение	                                  *
//															Значение по умолчанию: Сообщить                               *
//*************************************************************************************************************************
//	ДобавлятьЗаписьВЖурнал  - Булево						Значение по умолчанию: Ложь							          *
//															                                                              *
//*************************************************************************************************************************
//															Информация, Ошибка, Предупреждение, Примечание                *
//	УровеньРегистрации   	- УровеньЖурналаРегистрации		Значение по умолчанию: Ошибка. Для информационного сообщения  *
//															будем использовать "Примечание"                               *
//*************************************************************************************************************************
//	ОбъектМетаданных		- ОбъектМетаданных                                                                            *
//                                                                                                                        *
//*************************************************************************************************************************
//															Данные, с которыми связано событие.                           *
//	СсылкаНаОбъект			- Произвольный					Рекомендуется указывать ссылки на объекты данных (элементы    *
//															справочников, документы, к которым относится событие).        *
//*************************************************************************************************************************
//	КомментарийЖурнала		- Строка						Комментарий к записи журнала регистрации                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	Статус					- СтатусСообщения				БезСтатуса, Важное, Внимание, Информация, Обычное, ОченьВажное*
//															Значение по умолчанию: Обычное                                *
//*************************************************************************************************************************
//	Таймаут					- Число							Таймаут предупреждения                                        *
//															Значение по умолчанию: 0                                      *
//*************************************************************************************************************************
//	Заголовок				- Строка						Заголовок предупреждения                                      *
//															Значение по умолчанию: "1С:Предприятие"                       *
//*************************************************************************************************************************
//Функция ЗаписатьОшибкуИСообщить(
//	ТекстСообщения,
//	ТипСообщения = "Сообщить", 
//	ДобавлятьЗаписьВЖурнал = Ложь,  //3
//	УровеньРегистрации = "",        //4
//	ОбъектМетаданных = "",          //5
//	СсылкаНаОбъект = "",            //6
//	СобытиеЖурнала = "Логирование", //7
//	Статус = "",                    //8
//	Таймуат = 0,                    //9
//	Заголовок = "") Экспорт         //10
//	//Выводим информацию на экран
//	Если ТипСообщения = "Сообщить" Тогда
//		Если Статус = "" Тогда 
//			Статус = СтатусСообщения.Обычное;
//		КонецЕсли;
//		//#Если Клиент Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = ТекстСообщения; 
//			Сообщение.Сообщить();
//			//Сообщить(ТекстСообщения, Статус);
//		//КонецЕсли
//	ИначеЕсли ТипСообщения = "Предупреждение" Тогда
//		//Предупреждение возможно выдавать только в режиме клиента
//		#Если Клиент Тогда
//			Предупреждение(ТекстСообщения, Таймуат, Заголовок);
//		#Иначе	
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = ТекстСообщения; 
//			Сообщение.Сообщить();
//		#КонецЕсли
//	КонецЕсли;
//	//Создаем запись в журнале регистрации
//	Если ДобавлятьЗаписьВЖурнал Тогда
//		Если УровеньРегистрации = "" Тогда 
//			УровеньРегистрации = УровеньЖурналаРегистрации.Ошибка;
//		КонецЕсли;
//		Если ОбъектМетаданных = "" и ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
//			Попытка
//				ОбъектМетаданных = СсылкаНаОбъект.Метаданные();
//			Исключение
//				Сообщение = Новый СообщениеПользователю;
//				Сообщение.Текст = "Передан объект не имеющий Метаданные() "+СсылкаНаОбъект; 
//				Сообщение.Сообщить();
//			КонецПопытки;	
//		КонецЕсли;	
//		ЗаписьЖурналаРегистрации("ITC."+СобытиеЖурнала, УровеньРегистрации, ОбъектМетаданных, СсылкаНаОбъект, ТекстСообщения);
//	КонецЕсли;
//КонецФункции

//*******************************************************************
//							История									*
//						  	 BEGIN									*
//*******************************************************************

//Формируем список реквизитов для фиксации истории документа ОтчетПоставщику
//	Можно сделать все реквизиты, с исключением Автор, Модификатор и тп
Функция ПолучитьСписокРеквизитовДляИстории_ОтчетПоставщику()
	
	СписокРеквизитовОтчетПоставщику = Новый Массив;
	
	СписокРеквизитовОтчетПоставщику.Добавить("Дата");
	СписокРеквизитовОтчетПоставщику.Добавить("Поставщик");
	СписокРеквизитовОтчетПоставщику.Добавить("НачалоОтчетногоПериода");
	СписокРеквизитовОтчетПоставщику.Добавить("КонецОтчетногоПериода");
	СписокРеквизитовОтчетПоставщику.Добавить("ОрганизацияАгент");
	СписокРеквизитовОтчетПоставщику.Добавить("ОтветственныйБСО");
	СписокРеквизитовОтчетПоставщику.Добавить("ОтветственныйФинансы");
	СписокРеквизитовОтчетПоставщику.Добавить("ВидСП");
	СписокРеквизитовОтчетПоставщику.Добавить("НомерОтчетаПоставщику");
	СписокРеквизитовОтчетПоставщику.Добавить("Номер");
	СписокРеквизитовОтчетПоставщику.Добавить("ИтогОС_НачисленнаяСуммаВзноса");
	СписокРеквизитовОтчетПоставщику.Добавить("ИтогОС_КВ");
	СписокРеквизитовОтчетПоставщику.Добавить("ИтогОС_КПеречислениюПоставщику");
	СписокРеквизитовОтчетПоставщику.Добавить("ПлатежныйДокументПримечание");
	СписокРеквизитовОтчетПоставщику.Добавить("Комментарий");
	
	Возврат СписокРеквизитовОтчетПоставщику;
	
КонецФункции

//Формируем список реквизитов для фиксации истории документа ОплатаПолисов
//	Можно сделать все реквизиты, с исключением Автор, Модификатор и тп
Функция ПолучитьСписокРеквизитовДляИстории_ОплатаПолисов()
	
	СписокРеквизитовОплатаПолисов = Новый Массив;
	
	СписокРеквизитовОплатаПолисов.Добавить("СК");
	СписокРеквизитовОплатаПолисов.Добавить("СтраховойПродукт");
	СписокРеквизитовОплатаПолисов.Добавить("Дата");
	СписокРеквизитовОплатаПолисов.Добавить("Агент");
	СписокРеквизитовОплатаПолисов.Добавить("Курьер");
	СписокРеквизитовОплатаПолисов.Добавить("СтраховойПолис");
	СписокРеквизитовОплатаПолисов.Добавить("НомерКвитанции");
	СписокРеквизитовОплатаПолисов.Добавить("ПолнаяСтраховаяПремия");
	СписокРеквизитовОплатаПолисов.Добавить("НачисленнаяСуммаВзноса");
	СписокРеквизитовОплатаПолисов.Добавить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику");
	СписокРеквизитовОплатаПолисов.Добавить("КВПроцент");
	СписокРеквизитовОплатаПолисов.Добавить("КВСумма");
	СписокРеквизитовОплатаПолисов.Добавить("Баланс_Брокер_Поставщик");
	СписокРеквизитовОплатаПолисов.Добавить("Комментарий");
	СписокРеквизитовОплатаПолисов.Добавить("ОтчетАгента");
	СписокРеквизитовОплатаПолисов.Добавить("Номер");
	СписокРеквизитовОплатаПолисов.Добавить("Валюта");
	
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("ДопРеквизит, Имя" , "СтраховойПолис", "Поставщик"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("ДопРеквизит, Имя" , "СтраховойПолис", "Страхователь"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("ДопРеквизит, Имя" , "СтраховойПолис", "Номер"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("ДопРеквизит, Имя" , "СтраховойПолис", "Дата"));
	
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("Имя,Команда" , "НомерБСО", "ЗначениеРеквизита = уб_СС.ДайНомерБСОПоСП(Оплата.СтраховойПолис)"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("Имя,Команда" , "ПериодСтрахования", "ЗначениеРеквизита = Формат(Оплата.СтраховойПолис.ДатаНачала,""ДФ=dd.MM.yy"") + ""/"" + Формат(Оплата.СтраховойПолис.ДатаОкончания,""ДФ=dd.MM.yy"")"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("Имя,Команда" , "НомерВзноса", "	Если Оплата.НомерВзноса = 1 И Оплата.СтраховойПолис.СтраховаяПремия = Оплата.НачисленнаяСуммаВзноса Тогда
	|ЗначениеРеквизита = ""П.премия"";
	|Иначе
	|ЗначениеРеквизита = Строка(Оплата.НомерВзноса) + "" взнос"";
	|КонецЕсли;"));
	СписокРеквизитовОплатаПолисов.Добавить(Новый Структура("Имя,Команда" , "ВидОплаты", "Если Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса ИЛИ Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Безнал Тогда
	|ЗначениеРеквизита = ""В брокер"";
	|Иначе
	|ЗначениеРеквизита = ""В СК"";
	|КонецЕсли;"));
	
	Возврат СписокРеквизитовОплатаПолисов;
	
КонецФункции

//*******************************************************************
//							  END									*
//							История									*
//*******************************************************************

Функция КодироватьСтрокуВBase64(ИсходнаяСтрока) экспорт //КодироватьСтрокуВBase64(ИсходнаяСтрока) Экспорт
	ИмяВрФ = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВрФ);
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	Результат = Base64Строка(Новый ДвоичныеДанные(ИмяВрФ));
	
	// Обрезаем 77u/
	Результат = Прав(Результат, СтрДлина(Результат)-4);
	Результат  = СтрЗаменить(Результат,"+","%2B");
	Результат  = СтрЗаменить(Результат,"/","%2F");
	
	Результат  = СтрЗаменить(Результат,Символы.ПС,"");
	Результат  = СтрЗаменить(Результат,Символы.ВК,"");
	Попытка 
		УдалитьФайлы(ИмяВрФ) 
	Исключение 
		
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Функция Base64(Строка) экспорт
	Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
	Скрипт.Language="vbscript";
	Скрипт.AddCode("Function Base64Encode(inData)
	|  'rfc1521
	|  '2001 Antonin Foller, Motobit Software, http://Motobit.cz
	|  Const Base64 = ""ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/""
	|  Dim cOut, sOut, I
	|  
	|  'For each group of 3 bytes
	|  For I = 1 To Len(inData) Step 3
	|	Dim nGroup, pOut, sGroup
	|	
	|	'Create one long from this 3 bytes.
	|	nGroup = &H10000 * Asc(Mid(inData, I, 1)) + _
	|	  &H100 * MyASC(Mid(inData, I + 1, 1)) + MyASC(Mid(inData, I + 2, 1))
	|	
	|	'Oct splits the long To 8 groups with 3 bits
	|	nGroup = Oct(nGroup)
	|	
	|	'Add leading zeros
	|	nGroup = String(8 - Len(nGroup), ""0"") & nGroup
	|	
	|	'Convert To base64
	|	pOut = Mid(Base64, CLng(""&o"" & Mid(nGroup, 1, 2)) + 1, 1) + _
	|	  Mid(Base64, CLng(""&o"" & Mid(nGroup, 3, 2)) + 1, 1) + _
	|	  Mid(Base64, CLng(""&o"" & Mid(nGroup, 5, 2)) + 1, 1) + _
	|	  Mid(Base64, CLng(""&o"" & Mid(nGroup, 7, 2)) + 1, 1)
	|	
	|	'Add the part To OutPut string
	|	sOut = sOut + pOut
	|	
	|	'Add a new line For Each 76 chars In dest (76*3/4 = 57)
	|	'If (I + 2) Mod 57 = 0 Then sOut = sOut + vbCrLf
	|  Next
	|  Select Case Len(inData) Mod 3
	|	Case 1: '8 bit final
	|	  sOut = Left(sOut, Len(sOut) - 2) + ""==""
	|	Case 2: '16 bit final
	|	  sOut = Left(sOut, Len(sOut) - 1) + ""=""
	|  End Select
	|  Base64Encode = sOut
	|End Function
	|Function MyASC(OneChar)
	|  If OneChar = """" Then MyASC = 0 Else MyASC = Asc(OneChar)
	|End Function");
	Результат = Скрипт.Run("Base64Encode",Строка);
	Возврат Результат;
КонецФункции

Функция unBase64(Строка) Экспорт
	Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
	Скрипт.Language="vbscript";
	Скрипт.AddCode("Function Base64Decode(ByVal base64String)
	|  'rfc1521
	|  '1999 Antonin Foller, Motobit Software, http://Motobit.cz
	|  Const Base64 = ""ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/""
	|  Dim dataLength, sOut, groupBegin
	|  
	|  'remove white spaces, If any
	|  base64String = Replace(base64String, vbCrLf, """")
	|  base64String = Replace(base64String, vbTab, """")
	|  base64String = Replace(base64String, "" "", """")
	|  
	|  'The source must consists from groups with Len of 4 chars
	|  dataLength = Len(base64String)
	|  If dataLength Mod 4 <> 0 Then
	|	Err.Raise 1, ""Base64Decode"", ""Bad Base64 string.""
	|	Exit Function
	|  End If
	
	|  
	|  ' Now decode each group:
	|  For groupBegin = 1 To dataLength Step 4
	|	Dim numDataBytes, CharCounter, thisChar, thisData, nGroup, pOut
	|	' Each data group encodes up To 3 actual bytes.
	|	numDataBytes = 3
	|	nGroup = 0
	
	|	For CharCounter = 0 To 3
	|	  ' Convert each character into 6 bits of data, And add it To
	|	  ' an integer For temporary storage.  If a character is a '=', there
	|	  ' is one fewer data byte.  (There can only be a maximum of 2 '=' In
	|	  ' the whole string.)
	
	|	  thisChar = Mid(base64String, groupBegin + CharCounter, 1)
	
	|	  If thisChar = ""="" Then
	|		numDataBytes = numDataBytes - 1
	|		thisData = 0
	|	  Else
	|		thisData = InStr(1, Base64, thisChar, vbBinaryCompare) - 1
	|	  End If
	|	  If thisData = -1 Then
	|		Err.Raise 2, ""Base64Decode"", ""Bad character In Base64 string.""
	|		Exit Function
	|	  End If
	
	|	  nGroup = 64 * nGroup + thisData
	|	Next
	|	
	|	'Hex splits the long To 6 groups with 4 bits
	|	nGroup = Hex(nGroup)
	|	
	|	'Add leading zeros
	|	nGroup = String(6 - Len(nGroup), ""0"") & nGroup
	|	
	|	'Convert the 3 byte hex integer (6 chars) To 3 characters
	|	pOut = Chr(CByte(""&H"" & Mid(nGroup, 1, 2))) + _
	|	  Chr(CByte(""&H"" & Mid(nGroup, 3, 2))) + _
	|	  Chr(CByte(""&H"" & Mid(nGroup, 5, 2)))
	|	
	|	'add numDataBytes characters To out string
	|	sOut = sOut & Left(pOut, numDataBytes)
	|  Next
	|  Base64Decode = sOut
	|End Function");
	Результат = Скрипт.Run("Base64Decode",Строка);
	Возврат Результат;
КонецФункции

Функция УбратьСимволы(строка, СимволЗамены = "",УдаляемыеСимволы  ="", УбратьДвойныеПробелы = Истина) Экспорт
	
	НоваяСтрока = Строка;
	
	Если УдаляемыеСимволы = "" Тогда
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"""",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"'",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	">",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"<",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"|",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"?",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"/",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"\",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	":",	СимволЗамены);
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"*",	СимволЗамены);
	Иначе
		Для Счетчик = 1 по СтрДлина(УдаляемыеСимволы) Цикл
			НоваяСтрока = стрЗаменить(НоваяСтрока,	Сред(УдаляемыеСимволы,Счетчик,1),	СимволЗамены);
		КонецЦикла;
		
	КонецЕсли;
	
	Если УбратьДвойныеПробелы = Истина Тогда
		НоваяСтрока = стрЗаменить(НоваяСтрока,	Символы.Таб, " ");
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"  ",	" ");
		НоваяСтрока = стрЗаменить(НоваяСтрока,	"  ",	" ");
		
		НоваяСтрока = СокрЛП(НоваяСтрока);
	КонецЕсли;	
	
	Возврат НоваяСтрока
	
КонецФункции


Функция ДайКонтактнуюИнформациюФизлица(ФизЛицо, ВидКИ, Предупреждать = Ложь) Экспорт 
	
	Если ЗначениеНеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Установить(ФизЛицо);
	НаборЗаписейКИ.Отбор.Вид.Установить(ВидКИ);
	НаборЗаписейКИ.Прочитать();
	Если Предупреждать И НаборЗаписейКИ.Количество() = 0 Тогда
		#Если Клиент тогда
			Заг = "Необходимо указать """ + ВидКИ.Наименование + """ физ. лица!";
			СОО = "Не найден """ + ВидКИ.Наименование + """ физ. лица '" + Строка(ФизЛицо)  + "'
			|
			|Зайдите в справочник физлиц и внесите необходимые данные.
			|
			|Открыть форму физлица?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Форма = ФизЛицо.ПолучитьФорму();
				Форма.ЭлементыФормы.Панель1.ТекущаяСтраница = Форма.ЭлементыФормы.Панель1.Страницы.Дополнительно;
				Форма.ТекущийЭлемент = Форма.ЭлементыФормы.КонтактнаяИнформация;
				Форма.ТекущийЭлемент.ТекущаяКолонка =  Форма.ТекущийЭлемент.Колонки.Представление;
				Форма.ОткрытьМодально();			
				НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
				НаборЗаписейКИ.Отбор.Объект.Установить(ФизЛицо);
				НаборЗаписейКИ.Отбор.Вид.Установить(ВидКИ);
				НаборЗаписейКИ.Прочитать();
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	Если НаборЗаписейКИ.Количество() <> 0 Тогда 
		Возврат НаборЗаписейКИ[0].Представление;
	Иначе
		Возврат ""
	КонецЕсли;
	
КонецФункции //

Функция ДайСлужебныйТелефонФизлица(ФизЛицо, Предупреждать = Истина) Экспорт 
	Если ЗначениеНеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	//Служебный телефон
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Значение = ФизЛицо;
	НаборЗаписей.Отбор.Вид.Значение = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный;
	НаборЗаписей.Отбор.Объект.Использование = Истина;
	НаборЗаписей.Отбор.Вид.Использование = Истина;
	НаборЗаписей.Прочитать();
	
	Если Предупреждать = Истина И НаборЗаписей.Количество() = 0 Тогда
		
		#Если Клиент тогда
			
			Заг = "Необходимо указать служебный телефон физ. лица!";
			СОО = "Не найден служебный телефон физ. лица '" + Строка(ФизЛицо)  + "'
			|
			|Зайдите в справочник физлиц и внесите необходимые данные.
			|
			|Открыть форму физлица?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Форма = ФизЛицо.ПолучитьФорму();
				Форма.ЭлементыФормы.Панель1.ТекущаяСтраница = Форма.ЭлементыФормы.Панель1.Страницы.Дополнительно;
				Форма.ТекущийЭлемент = Форма.ЭлементыФормы.КонтактнаяИнформация;
				Форма.ТекущийЭлемент.ТекущаяКолонка =  Форма.ТекущийЭлемент.Колонки.Представление;
				Форма.ТекущийЭлемент.ТекущаяСтрока = Форма.ТекущийЭлемент.Значение[5];
				Форма.ОткрытьМодально();
				
				
				//Адрес по прописке
				НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Значение = ФизЛицо;
				НаборЗаписей.Отбор.Вид.Значение = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный;
				НаборЗаписей.Отбор.Объект.Использование = Истина;
				НаборЗаписей.Отбор.Вид.Использование = Истина;
				НаборЗаписей.Прочитать();
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	Возврат НаборЗаписей;
КонецФункции //


// Функция возвращает родительский документ
Функция ДайРодительскийДокумент(ДокументСсылка) Экспорт
	мУжеВСписке = Неопределено;
	мДерево = Неопределено;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			
			Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
				И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					И Метаданные.Документы.Содержит(МетаданныеЗначения)
					И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		//ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		//ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;
	
	
	СтрокаДерева = мДерево.Строки.Добавить();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
	| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		СтрокаДерева.Ссылка= Выборка.Ссылка;
		СтрокаДерева.Проведен = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		СтрокаДерева.ВидДокумента = Выборка.Метаданные;				
	Иначе
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента = ДокументСсылка.СуммаДокумента;
	КонецЕсли;
	
	мДерево = СтрокаДерева;
	
	
КонецФункции

//// Функция возвращает предыдущий для пролонгированного полиса
////  по регистру сведений уб_ЗаданияНаПролонгацию 
//Функция ВернутьПредыдущийПолис (НовыйПолис,ДатаСреза=Неопределено) Экспорт
//	Если ДатаСреза=Неопределено Тогда
//		ДатаСреза = ТекущаяДата();
//	КонецЕсли;	
//	Запрос = Новый Запрос("ВЫБРАТЬ
//						  |	уб_ЗаданияНаПролонгациюСрезПоследних.СтраховойПолис как СтраховойПолис
//						  |ИЗ
//						  |	РегистрСведений.уб_ЗаданияНаПролонгацию.СрезПоследних(&ДатаСреза, НовыйПолис = &НовыйПолис) КАК уб_ЗаданияНаПролонгациюСрезПоследних");
//						  //|ГДЕ
//						  //|	уб_ЗаданияНаПролонгациюСрезПоследних.СтатусПролонгации = &СтатусПролонгации ИЛИ уб_ЗаданияНаПролонгациюСрезПоследних.СтатусПролонгации = &СтатусПролонгации");
//	Запрос.УстановитьПараметр("НовыйПолис",НовыйПолис);					  
//	Запрос.УстановитьПараметр("ДатаСреза",ДатаСреза);					  
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.СтраховойПолис;
//	Иначе
//		Возврат Документы.уб_СтраховойПолис.ПустаяСсылка();
//	КонецЕсли;	
//	
//	//Запрос.УстановитьПараметр("СтатусПролонгации",Перечисления.уб_СтатусыПролонгирования.Пролонгирован);					  
//	
//КонецФункции	

Функция ВернутьНомерКвитанцииА7ПоНомеруПолиса(НомерПолиса,ВидБСО=Неопределено) Экспорт
	
	Если ВидБСО = Неопределено Тогда
		ЭтоПолис = Истина;
	Иначе
		
		ЭтоПолис = уб_СЛ.ОпределитьЭтоПолис(ВидБСО);
	КонецЕсли;	
	
	Если НЕ ЭтоПолис Тогда
		Возврат Неопределено;
	Иначе	
		Запрос =Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	уб_ДвиженияБСОСрезПоследних.НомерБСО как НомерБСО
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
		|			,
		|			ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7)
		|				И НомерПолиса = &НомерПолиса) КАК уб_ДвиженияБСОСрезПоследних");
		Запрос.УстановитьПараметр ("НомерПолиса",НомерПолиса);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			//
			Возврат Выборка.НомерБСО;
		КонецЕсли;	
	КонецЕсли;
КонецФункции	

Функция ЗаполнитьКраткийСоставДокумента(ТЧДокумента, ДополнительнаяТЧДокумента = Неопределено, ИмяРеквизита = "Сотрудник") Экспорт
	
	КраткийСоставДокумента = "";
	
	Для каждого СтрокаТЧ Из ТЧДокумента Цикл
		
		ФИОФизЛица = ОбщегоНазначения.ФИО_ФизЛица(УдалениеСимволовСкобок(СтрокаТЧ[ИмяРеквизита].Наименование));
		Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
			
			Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
				КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
			Иначе
				КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
				Прервать;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ДополнительнаяТЧДокумента <> Неопределено И СтрДлина(КраткийСоставДокумента) < 100 Тогда
		
		Для каждого СтрокаТЧ Из ДополнительнаяТЧДокумента Цикл
			
			ФИОФизЛица = ОбщегоНазначения.ФИО_ФизЛица(УдалениеСимволовСкобок(СтрокаТЧ[ИмяРеквизита].Наименование));
			Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
				
				Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
					КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
				Иначе
					Если Лев(КраткийСоставДокумента,2) = ", " Тогда
						КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
					Иначе
						КраткийСоставДокумента = Лев(КраткийСоставДокумента,97) + "...";
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Лев(КраткийСоставДокумента,2) = ", " Тогда
		ДлинаСтроки = СтрДлина(КраткийСоставДокумента);
		Если ДлинаСтроки < 100 Тогда
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3)
		Иначе
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат КраткийСоставДокумента;
	
КонецФункции // ЗаполнитьКраткийСоставДокумента()

// Удаляет из строки фрагмент заключенный в скобки
//
// Параметры
//  СтрокаДляОбработки  – Строка – строка из которой необходимо удалить фрагмент
//
// Возвращаемое значение:
//   Строка   – строка без фрагмента заключенного в скобки.
//
Функция УдалениеСимволовСкобок(СтрокаДляОбработки)
	
	НачальнаяПозиция	= Найти(СтрокаДляОбработки,"(");
	КонечнаяПозиция		= Найти(СтрокаДляОбработки,")");
	ДлинаСтроки			= СтрДлина(СтрокаДляОбработки);
	
	Если НачальнаяПозиция > 0 Тогда
		Возврат Лев(СтрокаДляОбработки, НачальнаяПозиция - 1) + ?(КонечнаяПозиция > 0,Прав(СтрокаДляОбработки, ДлинаСтроки - КонечнаяПозиция),"")
	Иначе
		Возврат СтрокаДляОбработки
	КонецЕсли; 
	
КонецФункции // ()

Функция ПолучитьСписокГоловныхОрганизаций() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &ПустаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
	СписокОрганизаций = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокОрганизаций;
	
КонецФункции 

// Функции нечеткого сравнения строк

#Если Клиент Тогда
	Процедура СоздатьКэшСправочника(КодКэша = 111, ВидСправочника = "Контрагенты", Запрос = Неопределено, ПересоздатьКэш = Истина, ДобавитьВидСправочникаВКод = Ложь) Экспорт
		
		Если Запрос = Неопределено Тогда
			Запрос = Новый Запрос;
		Конецесли;	
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Справочник.Код,
		|	Справочник.Наименование
		|ИЗ
		|	Справочник."+ВидСправочника+" КАК Справочник
		|ГДЕ
		|	(НЕ Справочник.ЭтоГруппа)";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если ПересоздатьКэш Тогда
			strmatch = Расширение().strmatch;
			Если  strmatch = Неопределено Тогда
				Возврат;
			Иначе	
				strmatch.СоздатьКэш(КодКэша);
			КонецЕсли;	
		КонецЕсли;	
		счетчик =0;
		ВсегоВыборка =Выборка.Количество();
		Суффикс  = ?(ДобавитьВидСправочникаВКод,ВидСправочника,"");
		Пока Выборка.Следующий() Цикл
			//
			
			Состояние("Инициализация кэша """+ВидСправочника+""""+Окр(100*Счетчик/(2*ВсегоВыборка),2)+"%");
			счетчик=счетчик+1;
			strmatch.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.Наименование),счетчик , Строка(Выборка.Код)+Суффикс);
			//счетчик=счетчик+1;
			//Компонента.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.НаименованиеПолное),счетчик , Строка(Выборка.Код));
			
			//Добавляет в созданный кэш следующую строку.
			//@Параметры:
			//<Ид> - Идентификатор кэша. Положительное целое число переданное в СоздатьКэш.
			// <Строка> - Строка для добавления.
			//<Хеш> - Числовое значение, идентифицирующее строку.
			//<Имя> - Строковое значение, идентифицирующее строку. Тот же <Хеш>, но строковой.
			Если Счетчик%20 Тогда
				ОбработкаПрерыванияПользователя();
			КонецЕсли;	
		КонецЦикла;	
	КонецПроцедуры
	
	Процедура ОбновитьКэшСправочника(КодКэша = 111, ВидСправочника = "Контрагенты", Запрос = Неопределено) Экспорт
		Если Запрос = Неопределено Тогда
			Запрос = Новый Запрос;
		Конецесли;	
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Справочник.Код,
		|	Справочник.Наименование
		|ИЗ
		|	Справочник."+ВидСправочника+" КАК Справочник
		|ГДЕ
		|	(НЕ Справочник.ЭтоГруппа)
		|	И Справочник.ДатаСоздания >= &ДатаСеанса";
		Запрос.УстановитьПараметр("ДатаСеанса",ПараметрыСеанса.уб_ДатаНачалаСеанса);					  
		
		Выборка = Запрос.Выполнить().Выбрать();
		strmatch = Расширение().strmatch;
		ТекстОшибки = "";
		//Strmatch = уб_Кэшируемые.StrMatch(ТекстОшибки);
		Если  strmatch = Неопределено Тогда
			Возврат;
		Иначе	
			strmatch.СоздатьКэш(КодКэша);
		КонецЕсли;	
		
		счетчик=0;
		ВсегоВыборка = Выборка.Количество();
		Пока Выборка.Следующий() Цикл
			//
			
			Состояние("Обновление кэша """+ВидСправочника+""""+Окр(100*Счетчик/(2*ВсегоВыборка),2)+"%");
			счетчик=счетчик+1;
			strmatch.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.Наименование),счетчик , Строка(Выборка.Код));
			//счетчик=счетчик+1;
			//Компонента.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.НаименованиеПолное),счетчик , Строка(Выборка.Код));
			
			//Добавляет в созданный кэш следующую строку.
			//@Параметры:
			//<Ид> - Идентификатор кэша. Положительное целое число переданное в СоздатьКэш.
			// <Строка> - Строка для добавления.
			//<Хеш> - Числовое значение, идентифицирующее строку.
			//<Имя> - Строковое значение, идентифицирующее строку. Тот же <Хеш>, но строковой.
			Если Счетчик%20 Тогда
				ОбработкаПрерыванияПользователя();
			КонецЕсли;	
		КонецЦикла;	
	КонецПроцедуры
	
	Функция НайтиПоКэшуВСправочнике(НомерКэша = 111, Подстрока, ВидСправочника = "Контрагенты", КоличествоВТопЛисте = 10, ТипВозвращаемого = "Массив", ВыводитьСообщения = Ложь, ИсключаемыйЭлемент = Неопределено, Соединение = Неопределено) Экспорт
		ОчиститьСообщения();
		
		
		Внешнее = НЕ Соединение=Неопределено;
		
		ЭтоМассив = ТипВозвращаемого ="Массив";
		Если ЭтоМассив Тогда
			Если Внешнее Тогда
				МассивДублей = Соединение.NewObject("Массив");
			Иначе	
				МассивДублей = Новый Массив;
			КонецЕсли;	
		Иначе
			Если Внешнее Тогда
				МассивДублей = Соединение.NewObject("СписокЗначений");
			Иначе	
				МассивДублей = Новый СписокЗначений;
			КонецЕсли;	
		КонецЕсли;
		
		strmatch = Расширение().strmatch;
		Если  strmatch = Неопределено Тогда
			Возврат МассивДублей;
		Иначе	
			strmatch.СравнитьСКэшем(НомерКэша, Строка(Подстрока), КоличествоВТопЛисте);
		КонецЕсли;	
		
		ВидСправочникаВКоде = ВидСправочника="";
		ДлинаКода = 9;
		
		Для СчПодбора = 1 по КоличествоВТопЛисте Цикл
			Имя ="";
			КоэффициентСхожести=0;
			Хэш = Strmatch.ПолучитьИзПодбора(СчПодбора,Имя,КоэффициентСхожести);
			Если ВидСправочникаВКоде Тогда
				ВидСправочника = СокрЛП(Сред(Имя,ДлинаКода+1));
				Код = Лев(Имя,ДлинаКода);
			Иначе	
				Код = Имя;
			КонецЕсли;	
			Если Внешнее Тогда
				Ссылка = Соединение.Справочники[ВидСправочника].НайтиПоКоду(Код);
			Иначе
				Ссылка = Справочники[ВидСправочника].НайтиПоКоду(Код);
			КонецЕсли;	
			
			Если ИсключаемыйЭлемент = Ссылка  Тогда
				Продолжить;
			КонецЕсли;	
			Если ЭтоМассив Тогда
				Если МассивДублей.Найти(Ссылка)= Неопределено Тогда
					
					Если Ссылка.Пустая() Тогда
					Иначе	
						Если ВыводитьСообщения Тогда
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("" + Ссылка + "(" + КоэффициентСхожести + ")");
						КонецЕсли;
						МассивДублей.Добавить(Ссылка);
					КонецЕсли;
				КонецЕсли;
			Иначе
				//СписокЗначений
				Если МассивДублей.НайтиПоЗначению(Ссылка)= Неопределено Тогда
					
					Если Ссылка.Пустая() Тогда
					Иначе	
						Если ВыводитьСообщения Тогда
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(""+Ссылка+"("+КоэффициентСхожести+")");
						КонецЕсли;	
						МассивДублей.Добавить(Ссылка,Ссылка.Наименование);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		Возврат МассивДублей;
	КонецФункции	
#КонецЕсли


Функция ПолучитьИмяБазыДанных(ПолноеИмя = Истина) Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	Если Найти(Врег(СтрокаСоединения), "FILE=") Тогда
		//Файловая версия
		
		ИмяБазы = СтрЗаменить(Сред(СтрокаСоединения,6),";","");
		
	Иначе
		//SQL
		
		СтрокаСоединения = СтрЗаменить(СтрокаСоединения,";",Символы.ПС);
		ИмяСервера = Сред(СтрПолучитьСтроку(СтрокаСоединения,1),6);
		ИмяБазы = Сред(СтрПолучитьСтроку(СтрокаСоединения,2),5);
		
		Если ПолноеИмя Тогда 
			ИмяБазы = ИмяСервера + "/" + ИмяБазы;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяБазы;
	
КонецФункции

Функция ВернутьСписокСотрудниковОУБСО(КакМассив = Ложь) Экспорт
	
	#Если Клиент Тогда
		МассивМОЛПоБСО = уб_КЭШируемые.СписокСотрудниковПодразделения(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО,НачалоМесяца(ТекущаяДата()));
	#Иначе 
		//TODO Когда так вызывается? 
		МассивМОЛПоБСО = уб_КЭШируемые.СписокСотрудниковПодразделения(Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),НачалоМесяца(ТекущаяДата()));
	#КонецЕсли
	
	МОЛПользователя = уб_КЭШируемые.ПолучитьМОЛпоБСОДляПользователя(ПараметрыСеанса.ТекущийПользователь);
	Если ЗначениеЗаполнено(МОЛПользователя) Тогда
		МассивМОЛПоБСО.Добавить(МОЛПользователя);//TODO Проверить необходимо ли это	
	КонецЕсли;	
	Если КакМассив Тогда
		СписокМОЛПоБСО = МассивМОЛПоБСО;
	Иначе	
		СписокМОЛПоБСО = Новый СписокЗначений;
		СписокМОЛПоБСО.ЗагрузитьЗначения(МассивМОЛПоБСО); 
	КонецЕсли;	
	
	Возврат СписокМОЛПоБСО;
	
КонецФункции	


//если руководитель в нескольких подразделениях, в запросах процедур, которые вызывают эту функцию
//собираются данные по СКВ по всем подразделениям, следовательно и планы по нескольким подразделениям должны суммироваться
Функция ПолучитьПланРуководителяОП(Сотрудник, ЗарплатныйПериод = Неопределено, ТЗПланов = Неопределено, ПараметрыПодчиненных = Неопределено) Экспорт
	
	Если ЗарплатныйПериод = Неопределено тогда
		ЗарплатныйПериод = ТекущаяДата();
	КонецЕсли;	
	//МассивП = Неопределено;
	Если ПараметрыПодчиненных = Неопределено Тогда
		ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		уб_СС.ПодчиненныеРуководителя(Сотрудник, ЗарплатныйПериод, ПараметрыПодчиненных);
	КонецЕсли;
	//Массив = ПолучитьСписокПодчиненныхРуководителя(Сотрудник,ЗарплатныйПериод,Истина,Истина,МассивП);
	//Если МассивП.Количество()=1 Тогда
	//	Подразделение = МассивП[0];
	//Иначе
	//	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	//КонецЕсли;	
	ТЗПланов = Новый ТаблицаЗначений;
	ТЗПланов.Колонки.Добавить("Агент");
	ТЗПланов.Колонки.Добавить("План");
	//Для Счетчик = 0 по Массив.Количество()-1 Цикл
	//	Агент = Массив[Счетчик];
	//	тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Подразделение, Агент);
	//	Если тз.Количество() > 0 Тогда
	//		//			Стр.План = тз[0].План;
	//		Стр =ТЗПланов.Добавить();
	//		Стр.Агент = Агент;
	//		Стр.План = тз[0].План;
	//	Иначе
	//		ЗаписатьОшибкуИСообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Агент) + " на дату " + Строка(ЗарплатныйПериод) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
	//	КонецЕсли;
	//КонецЦикла;	
	Для Каждого СтрокаТЗ Из ПараметрыПодчиненных.ТЗ Цикл
		Если Не СтрокаТЗ.Заместитель Или СтрокаТЗ.Сотрудник = Сотрудник  Тогда
			ТЗ = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , СтрокаТЗ.Подразделение, СтрокаТЗ.Сотрудник);
			Если ТЗ.Количество() > 0 Тогда
				Стр = ТЗПланов.Добавить();
				Стр.Агент 	= СтрокаТЗ.Сотрудник;
				Стр.План 	= ТЗ[0].План;
			Иначе
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + СтрокаТЗ.СотрудникСтрока + " на дату " + Строка(ЗарплатныйПериод) + " (Подразделение: " + СтрокаТЗ.ПодразделениеСтрока + ")" );
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ТЗПланов.Итог("План"); 
	
КонецФункции

Процедура ПередНачаломРаботыСистемы() Экспорт
	
	//Обновление оплат по схеме АВ
	//ЗаполнитьВДокументахОплатаПолисовСхемуРасчетаСМенеджером();
	//ПроверкаКорректностиФлагаПолномочиеВНастройкахПользователя();
	//ПроверитьЗаполненностьНастроекКонфигурации();
	
Конецпроцедуры	


Процедура ПриНачалеРаботыСистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	журналСобытий = Справочники.журналСобытий.СоздатьЭлемент();
	журналСобытий.Дата = ТекущаяДата();
	журналСобытий.Событие = Справочники.ВидСобытия.Вход;
	журналСобытий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	журналСобытий.Информация = "Вход в 1С";
	журналСобытий.Записать();
	УстановитьПривилегированныйРежим(Ложь);

	
	ПараметрыСеанса.уб_РежимОтладки = ПолучитьПредопределеннуюНастройкуПользователя("УровеньОтладки", 0);
	ИнициализацияКомпонентыПадежей();	
	#Если Клиент Тогда		
		Если ПолучитьПредопределеннуюНастройкуПользователя("ОткрыватьПанельФункций", Ложь) Тогда
			ФормаПанелиФункций = ПолучитьОбщуюФорму("уб_ПанельФункций");
			ФормаПанелиФункций.Открыть();
		КонецЕсли;
		//Открыть Форму управления статусами заявок
		ОтображатьСтатусы = Не ПолучитьПредопределеннуюНастройкуПользователя("НеОткрыватьСтатусыПриЗапуске", Ложь);
		Если ОтображатьСтатусы Тогда
			Обработки.уб_СтатусыЗаявок.ПолучитьФорму("Форма").Открыть();
		КонецЕсли;
		Если ПараметрыСеанса.уб_Константы.ПоказыватьОбновления = Истина Тогда
			ФормаПоказаОбновлений = Обработки.уб_ПоказВерсийОбновлений.ПолучитьФорму("Форма");
			ФормаПоказаОбновлений.ВыполнитьСразу = Истина;
			ФормаПоказаОбновлений.Открыть();
		КонецЕсли;
		//Получаем количество ошибок текущего пользователя
		
		//Если ПараметрыСеанса.уб_ЭтоМенеджер  Тогда
		//	КоличествоОшибок = КоличествоОшибокТекущегоПользователя();
		//	Если КоличествоОшибок.Все > 0 Тогда
		//		ФормаБоковогоМеню = ПолучитьОбщуюФорму("уб_БоковоеМеню");
		//		ФормаБоковогоМеню.ЭтоРабочаяБаза    = ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина;
		//		ФормаБоковогоМеню.Параметры 		= Новый Структура("КоличествоОшибок", КоличествоОшибок);
		//		ФормаБоковогоМеню.Открыть();
		//	КонецЕсли;
		//КонецЕсли;
	#КонецЕсли
	ПолучитьИнтерфейсы();			
	//проверяем незаполненные константы
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") И ПолучитьПредопределеннуюНастройкуПользователя("ПроверятьЗаполнениеНастроекКонфигурации", Ложь) Тогда
		ПроверитьНезаполненныеКонстанты();
	КонецЕсли;	
	
		
Конецпроцедуры

//количество ошибок не равно количеству строк - результат группируется по полису, а в ТД ошибки одного полиса могут быть в пределах различных группировок
Функция КоличествоОшибокТекущегоПользователя() Экспорт
	
	Если НЕ ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
		Результат = Новый Структура;
		Результат.Вставить("Все", 		0);
		Результат.Вставить("Срочные",	0);
		Возврат Результат;
	КонецЕсли;
	ОбъектОтчет = Отчеты.уб_ОшибкиПолиса.Создать();
	ФормаОтчетаОшибок = ОбъектОтчет.ПолучитьФорму();
	Если ПараметрыСеанса.ТекущийПользователь = уб_КЭШируемые.ПолучитьМОЛпоБСО(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО) Тогда
		ФормаОтчетаОшибок.ТипПодразделения = Перечисления.уб_ТипыПодразделений.ОУБСО;
	КонецЕсли;
	Отказ = ФормаОтчетаОшибок.ПриИзмененииУсловий(,"Неинтерактивный вызов");
	Если Не Отказ Тогда
		ФормаОтчетаОшибок.СК 				= Справочники.Контрагенты.ПустаяСсылка();
		ФормаОтчетаОшибок.Организация		= Справочники.Организации.ПустаяСсылка();
		ФормаОтчетаОшибок.ДатаС				= Дата(1,1,1);
		ФормаОтчетаОшибок.ДатаПо			= Дата(1,1,1);
		ФормаОтчетаОшибок.Статус 			= Справочники.уб_СостоянияОшибок.НеРешено;
		ФормаОтчетаОшибок.Состояние 		= Неопределено;
		ФормаОтчетаОшибок.ТипОшибок 		= 0;
		ФормаОтчетаОшибок.ИзмененаНастройка	= Ложь;
		Результат = ФормаОтчетаОшибок.КоличествоОшибок(Истина);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Все", 		0);
		Результат.Вставить("Срочные",	0);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // КоличествоОшибокТекущегоПользователя()


Функция ПолучитьСлужебнуюСК () Экспорт
	//Возврат Справочники.Контрагенты.НайтиПоНаименованию("-- КупиПолис --");
	Возврат ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент;
КонецФункции

//ЧастнаяНастройка - структура для частного заполнения свойств кнопки 
Функция УстановитьСтатусДокумента(ЭтаФорма, ЭтоОткрытие = Ложь, ЧастнаяНастройка = Неопределено) Экспорт
	
	#Если Клиент Тогда		
		Объект = ЭтаФорма.ЭтотОбъект;
		ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
		нСтатус = ЭлементыФормы.Найти("НадписьСтатусДокумента");
		Если нСтатус = Неопределено Тогда
			нСтатус = ЭлементыФормы.Добавить(Тип("Надпись"), "НадписьСтатусДокумента");
			нСтатус.Ширина	= 185;
			нСтатус.Лево	= ЭтаФорма.Ширина - нСтатус.Ширина;
			нСтатус.Высота	= 23;
			нСтатус.Шрифт	= Новый Шрифт(, 10, Истина);
			нСтатус.ГоризонтальноеПоложение	= ГоризонтальноеПоложение.Центр;
			нСтатус.ВертикальноеПоложение	= ВертикальноеПоложение.Центр;
			нСтатус.УстановитьПривязку(ГраницаЭлементаУправления.Лево,	ЭтаФорма.Панель,	ГраницаЭлементаУправления.Право);
			нСтатус.УстановитьПривязку(ГраницаЭлементаУправления.Право,	ЭтаФорма.Панель,	ГраницаЭлементаУправления.Право);
			нСтатус.УстановитьПривязку(ГраницаЭлементаУправления.Верх,	ЭтаФорма.Панель,	ГраницаЭлементаУправления.Верх);
			нСтатус.УстановитьПривязку(ГраницаЭлементаУправления.Низ,	ЭтаФорма.Панель,	ГраницаЭлементаУправления.Верх);
		Иначе
			нСтатус.Шрифт	= Новый Шрифт(, 10, Истина);
			нСтатус.ГоризонтальноеПоложение	= ГоризонтальноеПоложение.Центр;
			нСтатус.ВертикальноеПоложение	= ВертикальноеПоложение.Центр;
			нСтатус.Высота	= 23;
			//нСтатус.Ширина	= 185;
			//нСтатус.Лево	= ЭтаФорма.Ширина - нСтатус.Ширина;
		КонецЕсли;
		Если нСтатус <> Неопределено Тогда
			Если ЧастнаяНастройка <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(нСтатус, ЧастнаяНастройка)
			ИначеЕсли Объект.Проведен Тогда
				Если НЕ ПравоДоступа("ИнтерактивноеИзменениеПроведенных", Объект.Метаданные()) Тогда
					нСтатус.Заголовок	= "Изменение запрещено!";
					нСтатус.ЦветТекста	= ЦветаСтиля["ЦветТекстаПроведен"];
					нСтатус.ЦветФона	= ЦветаСтиля["ЦветФонаПроведен"];
				Иначе	
					нСтатус.Заголовок	= "Проведен";
					нСтатус.ЦветТекста	= ЦветаСтиля["ЦветТекстаПроведен"];
					нСтатус.ЦветФона	= ЦветаСтиля["ЦветФонаПроведен"];
				КонецЕсли;	
				//ИначеЕсли Объект.Проведен И ) Тогда
			ИначеЕсли Объект.ПометкаУдаления Тогда
				нСтатус.Заголовок	= "Помечен на удаление!";
				нСтатус.ЦветТекста	= ЦветаСтиля["ЦветТекстаУдален"];
				нСтатус.ЦветФона	= ЦветаСтиля["ЦветФонаУдален"];
			ИначеЕсли Объект.ЭтоНовый() Тогда
				нСтатус.Заголовок	= "Не записан!";
				нСтатус.ЦветТекста	= ЦветаСтиля["ЦветТекстаНеЗаписан"];
				нСтатус.ЦветФона	= ЦветаСтиля["ЦветФонаНеЗаписан"];
			Иначе
				нСтатус.Заголовок	= "Не проведен!";
				нСтатус.ЦветТекста	= ЦветаСтиля["ЦветТекстаНеПроведен"];
				нСтатус.ЦветФона	= ЦветаСтиля["ЦветФонаНеПроведен"];
			КонецЕсли;
		КонецЕсли;	
	#КонецЕсли
	
КонецФункции	

Процедура ВидимостьКолонок(ПутьККолонкам,ПутьККнопке) Экспорт;
	#Если Клиент Тогда
		Если ПутьККолонкам.Колонки.Найти("Автор") = Неопределено Тогда
			Попытка
				ПВ = ПутьККолонкам.Колонки.Добавить();
				ПВ.Имя = "Автор";
				ПВ.ТекстШапки = "Автор";
				ПВ.Данные = "Автор";
				ПВ.ЦветТекстаПоля = ЦветаСтиля["ТекстДатыСозданияИАвтора"];
				ПВ.ЦветТекстаШапки = ЦветаСтиля["ТекстДатыСозданияИАвтора"];
				ПВ.Ширина = 21;
				ПВ.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
				ПутьККолонкам.НастройкаПорядка.Автор.Доступность = Истина;
				ПутьККолонкам.НастройкаОтбора.Автор.Доступность = Истина;	
			Исключение
				ПутьККолонкам.Колонки.Удалить(ПВ);
			КонецПопытки;
			
			Попытка
				ПВ = ПутьККолонкам.Колонки.Добавить();
				ПВ.Имя = "ДатаСоздания";
				ПВ.ТекстШапки = "Дата создания";
				ПВ.Данные = "ДатаСоздания";
				ПВ.ЦветТекстаПоля = ЦветаСтиля["ТекстДатыСозданияИАвтора"];
				ПВ.ЦветТекстаШапки = ЦветаСтиля["ТекстДатыСозданияИАвтора"];
				ПВ.Ширина = 17;
				ПВ.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
				ПутьККолонкам.НастройкаПорядка.ДатаСоздания.Доступность = Истина;
				//ПутьККолонкам.НастройкаОтбора.ДатаСоздания.Доступность = Истина;
			Исключение
				ПутьККолонкам.Колонки.Удалить(ПВ);
			КонецПопытки;
			
			Попытка
				ПВ = ПутьККолонкам.Колонки.Добавить();
				ПВ.Имя = "Модификатор";
				ПВ.ТекстШапки = "Модификатор";
				ПВ.Данные = "Модификатор";
				ПВ.ЦветТекстаПоля = ЦветаСтиля["ТекстДатыИзмененияИМодификатора"];
				ПВ.ЦветТекстаШапки = ЦветаСтиля["ТекстДатыИзмененияИМодификатора"];
				ПВ.Ширина = 21;
				ПВ.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
				ПутьККолонкам.НастройкаПорядка.Модификатор.Доступность = Истина;
				ПутьККолонкам.НастройкаОтбора.Модификатор.Доступность = Истина;
			Исключение
				ПутьККолонкам.Колонки.Удалить(ПВ);
			КонецПопытки;
			
			Попытка
				ПВ = ПутьККолонкам.Колонки.Добавить();
				ПВ.Имя = "ДатаИзменения";
				ПВ.ТекстШапки = "Дата изменения";
				ПВ.Данные = "ДатаИзменения";
				ПВ.ЦветТекстаПоля = ЦветаСтиля["ТекстДатыИзмененияИМодификатора"];
				ПВ.ЦветТекстаШапки = ЦветаСтиля["ТекстДатыИзмененияИМодификатора"];
				ПВ.Ширина = 17;
				ПВ.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
				ПутьККолонкам.НастройкаПорядка.ДатаИзменения.Доступность = Истина;
				//ПутьККолонкам.НастройкаОтбора.ДатаИзменения.Доступность = Истина;
			Исключение
				ПутьККолонкам.Колонки.Удалить(ПВ);
			КонецПопытки;
			
			ПутьККнопке.Текст = "Убрать скрытые реквизиты";
			ПутьККнопке.Картинка = БиблиотекаКартинок.уб_ДопРеквизитыСкрыть;
			
		Иначе
			
			Попытка
				ПутьККолонкам.НастройкаПорядка.Автор.Доступность = Ложь;
				ПутьККолонкам.Колонки.Удалить(ПутьККолонкам.Колонки.Индекс(ПутьККолонкам.Колонки.Автор));
				ПутьККолонкам.НастройкаОтбора.Автор.Доступность = Ложь;
			Исключение
			КонецПопытки;
			Попытка
				ПутьККолонкам.НастройкаПорядка.ДатаСоздания.Доступность = Ложь;
				ПутьККолонкам.Колонки.Удалить(ПутьККолонкам.Колонки.Индекс(ПутьККолонкам.Колонки.ДатаСоздания));
			Исключение
			КонецПопытки;
			Попытка
				ПутьККолонкам.НастройкаПорядка.Модификатор.Доступность = Ложь;
				ПутьККолонкам.Колонки.Удалить(ПутьККолонкам.Колонки.Индекс(ПутьККолонкам.Колонки.Модификатор));
				ПутьККолонкам.НастройкаОтбора.Модификатор.Доступность = Ложь;
			Исключение
			КонецПопытки;
			Попытка
				ПутьККолонкам.НастройкаПорядка.ДатаИзменения.Доступность = Ложь;
				ПутьККолонкам.Колонки.Удалить(ПутьККолонкам.Колонки.Индекс(ПутьККолонкам.Колонки.ДатаИзменения));
			Исключение
			КонецПопытки;
			//ПутьККолонкам.НастройкаОтбора.ДатаСоздания.Доступность = Ложь;
			//ПутьККолонкам.НастройкаОтбора.ДатаИзменения.Доступность = Ложь;
			ПутьККнопке.Текст = "Показать скрытые реквизиты";
			ПутьККнопке.Картинка = БиблиотекаКартинок.уб_ДопРеквизитыОтобразить;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

//рекурсивный поиск кнопки по имени в дереве и по всем вложенным подменю
Функция НайтиКнопкуВПодменю(Корень, Имя)
	#Если Клиент Тогда
		Для Каждого Кнопка Из Корень Цикл
			Если Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю Тогда
				Если Кнопка.Имя = Имя Тогда
					Возврат Кнопка
				КонецЕсли;
				КнопкаПодч = НайтиКнопкуВПодменю(Кнопка.Кнопки, Имя);
				Если КнопкаПодч <> Неопределено Тогда
					Возврат КнопкаПодч
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	#КонецЕсли
КонецФункции // НайтиКнопкуВПодменю()

//Расчитывает количество БСО в ТЧ БСО 
Функция ПолучитьКоличествоБСОвТЧ(ТЧБСО) Экспорт
	СчетчикБСО = 0;
	тзБСО = ТЧБСО.Выгрузить();
	Для каждого СтрокаТЧ из тзБСО Цикл 
		тсВидБСО = СтрокаТЧ.ВидБСО;
		КоличественныйУчет = уб_СЛ.ОпределитьВедетсяКоличественныйУчет(тсВидБСО);
		Если КоличественныйУчет Тогда
			СчетчикБСО = СчетчикБСО + СтрокаТЧ.Количество;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерБСО) Тогда
				СчетчикБСО = СчетчикБСО + 1;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Возврат СчетчикБСО;
КонецФункции	

// Получает ФИО ФизЛица
Функция ПолучитьФИО(ФЛ,Полно = Истина) Экспорт
	
	#Если Клиент Тогда
		ОчиститьСообщения();
	#КонецЕсли
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|ГДЕ
	|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо");
	
	Запрос.УстановитьПараметр("ФизЛицо", ФЛ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Фамилия = "" Тогда
			Сообщить("Некорректная фамилия физ.лица!");
		КонецЕсли;
		
		Фамилия = СокрЛП(Выборка.Фамилия);
		
		Если Выборка.Имя = "" Тогда
			Сообщить("Некорректное имя физ.лица!");
		КонецЕсли;
		
		Имя = СокрЛП(Выборка.Имя);
		
		Если Выборка.Отчество = "" Тогда
			Сообщить("Некорректное отчество физ.лица!");
		КонецЕсли;
		
		Отчество = СокрЛП(Выборка.Отчество);
		
	КонецЕсли;
	
	ФИО = "";
	
	Если Полно Тогда
		
		Если Фамилия <> "" Тогда
			ФИО = ФИО + ВРег(Лев(Фамилия, 1)) + СРед(Фамилия, 2);
			Если Имя <> "" Или Отчество <> "" Тогда
				ФИО = ФИО + " ";
			КонецЕсли;
		КонецЕсли;
		
		Если Имя <> "" Тогда
			ФИО = ФИО + ВРег(Лев(Имя, 1)) + СРед(Имя, 2);
			Если Отчество <> "" Тогда
				ФИО = ФИО + " ";
			КонецЕсли;
		КонецЕсли;
		
		ФИО = ФИО + ВРег(Лев(Отчество, 1)) + СРед(Отчество, 2);
		
	Иначе
		
		Если Фамилия <> "" Тогда
			ФИО = ВРег(Лев(Фамилия, 1)) + СРед(Фамилия, 2);
			Если Имя <> "" Или Отчество <> "" Тогда
				ФИО = ФИО + " ";
			КонецЕсли;
		КонецЕсли;
		
		Если Имя <> "" Тогда
			ФИО = ФИО + ВРег(Лев(Имя, 1)) + ".";
			Если Отчество <> "" Тогда
				ФИО = ФИО + " ";
			КонецЕсли;
		КонецЕсли;
		
		Если Отчество <> "" Тогда
			ФИО = ФИО + ВРег(Лев(Отчество, 1)) + ".";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФИО;
	
КонецФункции // ПолучитьФИО()

#Если Клиент Тогда
	Процедура ДобавитьКнопкиПанелиДействий(
		КнопкиПанели, 
		ИсточникВызова, 
		Форма 			= Неопределено, 
		Параметры		= Неопределено
		) Экспорт
		
		сИсточникДействий = РазделитьИсточникДействий(ИсточникВызова);
		//TODO исправить после исправления вызовов в оплате
		Если Параметры = Неопределено Тогда
			Параметры = СтруктураПараметровДобавленияКнопокДействийПоУмолчанию()
		КонецЕсли;
		ДобавлятьКнопкуРазблокировки 	= ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Параметры, "КнопкаРазблокировки", 		Истина);
		ДобавлятьКнопкуСкрытыеРеквизиты = ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Параметры, "КнопкаСкрытыеРеквизиты",   Истина);
		Если сИсточникДействий = Неопределено Тогда
			Сообщить("Источник действий неверен!");
			Возврат;
		КонецЕсли;	
		Если (сИсточникДействий.Тип = "Документ" И (Найти(сИсточникДействий.Форма, "ФормаСписка") <> 0 Или Найти(сИсточникДействий.Форма, "ФормаДокумента") <> 0))
			Или (сИсточникДействий.Тип = "Справочник" И (Найти(сИсточникДействий.Форма, "ФормаСписка") <> 0 Или Найти(сИсточникДействий.Форма, "ФормаЭлемента") <> 0)) Тогда
			СоздатьКнопкуПоискСсылок(КнопкиПанели);
		КонецЕсли;
		Если ДобавлятьКнопкуСкрытыеРеквизиты
			И (Найти(сИсточникДействий.Форма, "ФормаСписка") <> 0 ИЛИ Найти(сИсточникДействий.Форма, "ФормаВыбора") <> 0)
			И НЕ сИсточникДействий.Тип = "ЖурналДокументов"
			//To DO Реализовать исключения более универсальным способом
			И НЕ ИсточникВызова = "Справочник.уб_Справка.ФормаСписка" 
			И НЕ ИсточникВызова = "РегистрСведений.уб_ДвиженияБСО.ФормаСписка" 
			И НЕ ИсточникВызова = "РегистрНакопления.уб_ОстаткиБСО.ФормаСписка"
			Тогда
			СоздатьКнопкуСкрытыеРеквизиты(КнопкиПанели);
		КонецЕсли;	
		ЕстьКнопкаСправки = Ложь;
		//Для Каждого Кнопка Из КнопкиПанели Цикл
		//	Если Найти(Кнопка.Имя ,"ВызовСправкиHTML")= 1 Тогда
		//		ЕстьКнопкаСправки = Истина;
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
		//ЕстьКнопкаСправки = КнопкиПанели.Найти("ВызовСправкиHTML") <> Неопределено;
		//Если Не ЕстьКнопкаСправки И (Форма = Неопределено Или Не Форма.МодальныйРежим) Тогда
		//	СоздатьКнопкуВызоваСправки(КнопкиПанели, ИсточникВызова)
		//КонецЕсли;
		Если сИсточникДействий.Тип = "Документ" Или сИсточникДействий.Тип = "ЖурналДокументов" Тогда
			// Исключения документов, для которых не нужна структура подчиненности
			Массив = Новый Массив;
			Массив.Добавить("уб_ТабельУчетаРабочегоВремени");
			Массив.Добавить("уб_НачислениеЗП");
			Если Массив.Найти(сИсточникДействий.Имя) = Неопределено
				И (Найти(сИсточникДействий.Форма, "ФормаДокумента") <> 0 Или Найти(сИсточникДействий.Форма, "ФормаСписка") <> 0) Тогда
				СоздатьКнопкуСтруктураПодчиненности(КнопкиПанели);
			КонецЕсли
		КонецЕсли;
		Если ДобавлятьКнопкуРазблокировки Тогда
			//обрабатываем кнопку разблокировки
			//СтруктураБлокировкиОтчета = Документы.уб_ОтчетПоставщику.СтруктураБлокировкиОтчетаПоставщику(Неопределено);
			СтруктураБлокировки = уб_temp.СтруктураБлокировкиДокумента(Форма.Ссылка.ОтчетПоставщику);
			Структура = Новый Структура;
			Структура.Вставить("Имя", 			"Разблокировать");
			Структура.Вставить("ТипКнопки", 	ТипКнопкиКоманднойПанели.Действие);
			Структура.Вставить("Действие",		Новый Действие("ДействияФормыРазблокировать"));
			Структура.Вставить("Текст",			"Разблокировать");
			Структура.Вставить("Подсказка",		"Разблокирует объект для пользователя на определенную дату");
			Структура.Вставить("Пояснение",		"Разблокирует объект для пользователя на определенную дату");
			Структура.Вставить("Картинка",		БиблиотекаКартинок.уб_Unlock);
			Структура.Вставить("Отображение",   ОтображениеКнопкиКоманднойПанели.Картинка);
			уб_temp.ДобавитьИлиУдалитьКнопкуПанели(КнопкиПанели, Структура, Не (СтруктураБлокировки.ЕстьПравоРазблокировки И СтруктураБлокировки.ЕстьПеречисление), Истина);
		КонецЕсли;
		
		ЕстьСобытиеВхода(ИСТИНА);
		УстановитьПривилегированныйРежим(Истина);
		Если сИсточникДействий.Тип="Отчет" или сИсточникДействий.Тип="Обработка" Тогда
			
			журналСобытий = Справочники.журналСобытий.СоздатьЭлемент();
			журналСобытий.Дата = ТекущаяДата();
			журналСобытий.Событие = Справочники.ВидСобытия.Открытие;
			журналСобытий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			журналСобытий.Объект = ИсточникВызова;
			журналСобытий.Информация = "Открытие формы отчета";
			журналСобытий.Записать();
		ИначеЕсли Найти(сИсточникДействий.Форма, "ФормаСписка") <> 0 Тогда
			журналСобытий = Справочники.журналСобытий.СоздатьЭлемент();
			журналСобытий.Дата = ТекущаяДата();
			журналСобытий.Событие = Справочники.ВидСобытия.Открытие;
			журналСобытий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			журналСобытий.Объект = ИсточникВызова;
			журналСобытий.Информация = "Открытие списка";
			журналСобытий.Записать();

		КонецЕсли;	
		УстановитьПривилегированныйРежим(Ложь);
	КонецПроцедуры
#КонецЕсли

Функция ЕстьСобытиеВхода(Создавать = Истина) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если уб_Кэшируемые.ЕстьСобытиеВхода(НачалоДня(ТекущаяДата())) = ЛОЖЬ Тогда
		Если  Час(ТекущаяДата())>=4 Тогда
			журналСобытий = Справочники.журналСобытий.СоздатьЭлемент();
			журналСобытий.Дата = ТекущаяДата();
			журналСобытий.Событие = Справочники.ВидСобытия.Вход;
			журналСобытий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			журналСобытий.Информация = "Автовход";
			журналСобытий.Записать();
		КонецЕсли;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;  
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции	

Процедура СоздатьКнопкуСкрытыеРеквизиты(ПутьККнопке) Экспорт
	#Если Клиент Тогда
		Разделитель = ПутьККнопке.Добавить();
		Разделитель.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		Кнопка = ПутьККнопке.Добавить();
		Кнопка.Доступность = Истина;
		Кнопка.Имя = "СкрытыеРеквизиты";
		Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		Кнопка.Действие = Новый Действие("ОбработчикДопКнопокДействийФормы");
		Кнопка.Текст = "Показать/Отобразать данные по автору и модификатору ";
		Кнопка.Подсказка = 	"Показать/Отобразать колонки по автору, модификатору и датам событий изменения";
		Кнопка.Картинка = БиблиотекаКартинок.уб_ДопРеквизитыОтобразить;
	#КонецЕсли
КонецПроцедуры

Процедура СоздатьКнопкуВызоваСправки(КнопкиПанели, ИсточникВызова,КэшЗаменыУрл = Неопределено) Экспорт
	
	//Если ЗаписыватьЛог Тогда
	//	СоздатьЛогПользователя(ИсточникВызова, Ложь)
	//КонецЕсли;
	ОсновнаяКнопкаСправкиСоздана = Ложь;
	URL = ПолучитьURLПоНеURLМодуль(ИсточникВызова,КэшЗаменыУрл);
	#Если Клиент Тогда
		ВыборкаВсе = КэшЗаменыУрл.Получить("ЗапросКнопокСправки");
		Если  ВыборкаВсе = Неопределено Тогда
			ЗапросКнопокСправки = Новый Запрос;
			ЗапросКнопокСправки.Текст =
			"ВЫБРАТЬ
				|	уб_СправкаСтраницы.ТипКнопки,
				|	уб_СправкаСтраницы.Доступность,
				|	уб_СправкаСтраницы.Имя,
				|	уб_СправкаСтраницы.Действие,
				|	уб_СправкаСтраницы.Текст,
				|	уб_СправкаСтраницы.Картинка,
				|	уб_СправкаСтраницы.Подсказка,
				|	уб_СправкаСтраницы.Отображение,
				|	уб_СправкаСтраницы.Подменю,уб_СправкаСтраницы.Ссылка.Наименование как  Наименование
				|ИЗ
				|	Справочник.уб_Справка.Страницы КАК уб_СправкаСтраницы
				|ГДЕ
				//|	уб_СправкаСтраницы.Ссылка.Наименование = &ИсточникВызова
				//|	И 
				|	НЕ уб_СправкаСтраницы.Ссылка.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
			|	уб_СправкаСтраницы.НомерСтроки";
			ЗапросКнопокСправки.УстановитьПараметр("ИсточникВызова", ИсточникВызова);		
			ВыборкаВсе = ЗапросКнопокСправки.Выполнить().Выгрузить();		
			КэшЗаменыУрл.Вставить("ЗапросКнопокСправки",ВыборкаВсе);
		КонецЕсли;
		Выборки = ВыборкаВсе.Скопировать(Новый Структура("Наименование",ИсточникВызова));
		ТаблицаДействий =  Новый ТаблицаЗначений;
		ТаблицаДействий.Колонки.Добавить("ТипКнопки");
		ТаблицаДействий.Колонки.Добавить("Доступность");
		ТаблицаДействий.Колонки.Добавить("Имя");
		ТаблицаДействий.Колонки.Добавить("Действие");
		ТаблицаДействий.Колонки.Добавить("Текст");
		ТаблицаДействий.Колонки.Добавить("Картинка");
		ТаблицаДействий.Колонки.Добавить("Подсказка");
		ТаблицаДействий.Колонки.Добавить("Подменю");		
		
		ЕстьСправочникСправка = Ложь;
		Действие    = Перечисления.уб_ТипыКнопокКоманднойПанели.Действие;
		Разделитель = Перечисления.уб_ТипыКнопокКоманднойПанели.Разделитель;
		Подменю     = Перечисления.уб_ТипыКнопокКоманднойПанели.Подменю;
		кэшКартинок = Новый Соответствие;
		Для Каждого Выборка Из Выборки Цикл
		
			Если Не Выборка.Отображение Тогда
				Продолжить
			КонецЕсли;			
			СтрокаДействия = ТаблицаДействий.Добавить();			
			Если Выборка.ТипКнопки = Действие Тогда
				СтрокаДействия.ТипКнопки = ТипКнопкиКоманднойПанели.Действие
			ИначеЕсли Выборка.ТипКнопки = Разделитель Тогда
				СтрокаДействия.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель
			Иначе
				СтрокаДействия.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю
			КонецЕсли;
			СтрокаДействия.Имя 		= Выборка.Имя;
			СтрокаДействия.Подменю  = Выборка.Подменю;
			Если Выборка.ТипКнопки <> Перечисления.уб_ТипыКнопокКоманднойПанели.Разделитель Тогда
				СтрокаДействия.Текст = Выборка.Текст;
				СтрокаДействия.Подсказка = ?(Выборка.Подсказка = "", "Открывает Wiki-статью в отдельном окне", Выборка.Подсказка);
				Картинка = кэшКартинок.Получить(Выборка.Картинка);
				Если  Картинка = Неопределено  Тогда
					Если Выборка.Картинка = "" Тогда
						Картинка = Новый Картинка;
					Иначе
						Картинка = БиблиотекаКартинок[Выборка.Картинка];
					КонецЕсли;
					кэшКартинок.Вставить(Выборка.Картинка,Картинка);
				КонецЕсли;
				СтрокаДействия.Картинка = Картинка;
				
				Если Выборка.ТипКнопки <> Подменю Тогда
					СтрокаДействия.Доступность = Выборка.Доступность;
					Действие = ?(Выборка.Действие = "", Новый Действие("ОбработчикДопКнопокДействийФормы"), Новый Действие(Выборка.Действие));
					СтрокаДействия.Действие = Действие;
				КонецЕсли;			
				ЕстьСправочникСправка = Истина;
			КонецЕсли;	
		КонецЦикла;				
		Если ЕстьСправочникСправка Тогда
			ПутьККнопке = КнопкиПанели;
			Доступность = Истина;	
		Иначе
			ПутьККнопке = КнопкиПанели;
			Если URL = ИсточникВызова Тогда
				Доступность = ЛОЖЬ;
			Иначе	
				Доступность = НЕ (URL = "" или URL = Неопределено);
			КонецЕсли;	
			ТаблицаДействий = Неопределено;
		КонецЕсли;
		Разделитель = ПутьККнопке.Добавить();
		Разделитель.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		Если ТаблицаДействий = Неопределено Тогда
			Кнопка = ПутьККнопке.Добавить();
			Кнопка.Доступность = Истина;
			Кнопка.Имя = "ВызовСправкиHTML";//+СтрЗаменить(ИсточникВызова,".","__");
			Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
			Кнопка.Действие = Новый Действие("ОбработчикДопКнопокДействийФормы");
			Кнопка.Текст = "Вызвать справку HTML";
			Кнопка.Картинка = БиблиотекаКартинок.СправкаHTML;
			Кнопка.Подсказка = "Открывает Wiki-справку в отдельном окне";
			Кнопка.Доступность = Доступность;
			ОсновнаяКнопкаСправкиСоздана = Истина;
		Иначе
			НовыйПутьККнопке = ПутьККнопке;
			Если ТаблицаДействий.Количество() > 1  Тогда
				НовыйПутьККнопке = ПутьККнопке.Добавить();
				НовыйПутьККнопке.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю;
				НовыйПутьККнопке.Картинка = БиблиотекаКартинок.СправкаHTML;
				НовыйПутьККнопке.Подсказка = "Меню доступной Wiki-справки в отдельном окне";
				НовыйПутьККнопке.Доступность = Истина;
				НовыйПутьККнопке.Текст = "WIKI-справка";
				НовыйПутьККнопке.Имя = "ВызовСправкиHTML";
				ОсновнаяКнопкаСправкиСоздана = Истина;
				НовыйПутьККнопке = НовыйПутьККнопке.Кнопки;
			КонецЕсли;	
			//массив имен подменю
			мПодменю = Новый Массив;
			Для Каждого ПараметрыКнопки из ТаблицаДействий Цикл
				//если подменю - записываем имя в массив для последующего поиска и иерархии справки
				Если ПараметрыКнопки.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю Тогда
					мПодменю.Добавить(ПараметрыКнопки.Имя);
				КонецЕсли;
				Подменю = ПараметрыКнопки.Подменю;
				Если Подменю <> "" Тогда
					//если кнопка в подменю - проверяем наличие
					Если Найти(мПодменю, Подменю) <> Неопределено Тогда
						КнопкаПодменю = НайтиКнопкуВПодменю(НовыйПутьККнопке, Подменю);
						Если КнопкаПодменю = Неопределено Тогда
							Кнопка = НовыйПутьККнопке.Добавить();
						Иначе
							Кнопка = КнопкаПодменю.Кнопки.Добавить();
						КонецЕсли;
					Иначе
						Кнопка = НовыйПутьККнопке.Добавить();
					КонецЕсли;
				Иначе
					Кнопка = НовыйПутьККнопке.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Кнопка,ПараметрыКнопки);
				Если ОсновнаяКнопкаСправкиСоздана = Истина Тогда
					Кнопка.Имя = ПараметрыКнопки.Имя;
				Иначе
					Кнопка.Имя = "ВызовСправкиHTML";
					ОсновнаяКнопкаСправкиСоздана = Истина;
				КонецЕсли;
				//если кнопка всего одна и у нее нет картинки - ставим стандартную
				Если ТаблицаДействий.Количество() = 1 И ПараметрыКнопки.Картинка.Вид = ВидКартинки.Пустая Тогда
					Кнопка.Картинка = БиблиотекаКартинок.СправкаHTML;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Функция ПолучитьURLПоНеURLМодуль(URL,СоответствиеСтрокиURL  = Неопределено) Экспорт                 
	//Возможно позднее переделать на справочник или 
	//на возможность работать с локально сохраненной копией:
	//если есть копия ее, иначе с сервера
	
	Если СоответствиеСтрокиURL = Неопределено Тогда
	
	СоответствиеСтрокиURL = Новый Соответствие;	
	//СоответствиеСтрокиURL.Вставить("","");
	
	// По категориям
	//////////////////////////////////////////////////////////////////////////////////////////////
	
	// Общие формы
	
	СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ПодборБСО", 						"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9764968");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ПодборОплат",						"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ПодборПринятыхОплат",				"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ПростойПодбор",					"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_Техподдержка",					"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_УстановкаДатыЗапретаСтрБрокер",	"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ФормаКонстантСтраховойБрокер",	"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ФормаПодбора",					"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.уб_ФормаПросмотраТЗ",				"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.ФормаВводаКурсаИКратности",			"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.ФормаВводаМестаРождения",			"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.ФормаПользователяБД",				"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.ФормаРедактированияТекста",			"");
	//СоответствиеСтрокиURL.Вставить("ОбщиеФормы.ФормаСтруктурыПодчиненности",		"");
	
	// Справочники
	
	//СоответствиеСтрокиURL.Вставить("Справочник.Банки.ФормаЭлемента",				"");
	СоответствиеСтрокиURL.Вставить("Справочник.БанковскиеСчета.ФормаСписка",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581872");
	СоответствиеСтрокиURL.Вставить("Справочник.БанковскиеСчета.ФормаЭлемента",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581872");
	//СоответствиеСтрокиURL.Вставить("Справочник.Валюты.ФормаСписка",					"");
	//СоответствиеСтрокиURL.Вставить("Справочник.Валюты.ФормаЭлемента",				"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ВидыВзаиморасчетов.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ВидыОплатОрганизаций.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ВнешниеОбработки.ФормаЭлемента",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ГруппыПользователей.ФормаЭлемента",	""); // есть просто про пользователей
	СоответствиеСтрокиURL.Вставить("Справочник.ГруппыПользователейТорговогоОборудования.ФормаЭлемента", "");
	СоответствиеСтрокиURL.Вставить("Справочник.ДоговорыКонтрагентов.ФормаЭлемента",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581876");
	СоответствиеСтрокиURL.Вставить("Справочник.ДоговорыКонтрагентов.ФормаСписка",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581876");
	//СоответствиеСтрокиURL.Вставить("Справочник.ДокументыУдостоверяющиеЛичность.ФормаСписка", "");
	//СоответствиеСтрокиURL.Вставить("Справочник.ДокументыУдостоверяющиеЛичность.ФормаЭлемента", "");
	//СоответствиеСтрокиURL.Вставить("Справочник.ДолжностиОрганизаций.ФормаСписка",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ДолжностиОрганизаций.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.Звания.ФормаСписка",					"");
	//СоответствиеСтрокиURL.Вставить("Справочник.Звания.ФормаЭлемента",				"");
	//СоответствиеСтрокиURL.Вставить("Справочник.КлассификаторЕдиницИзмерения.ФормаЭлемента", "");
	//СоответствиеСтрокиURL.Вставить("Справочник.КлассификаторСтранМира.ФормаЭлемента", "");
	СоответствиеСтрокиURL.Вставить("Справочник.КонтактныеЛица.ФормаЭлемента",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581810");
	СоответствиеСтрокиURL.Вставить("Справочник.Контрагенты.ФормаЭлемента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=13795356");
	СоответствиеСтрокиURL.Вставить("Справочник.Контрагенты.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=13795356");
	//СоответствиеСтрокиURL.Вставить("Справочник.НастройкиОбменаДанными.ФормаЭлемента", "");
	//СоответствиеСтрокиURL.Вставить("Справочник.НоменклатурныеГруппы.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ОбработкиОбслуживанияТО.ФормаЭлемента", "");
	СоответствиеСтрокиURL.Вставить("Справочник.ОВД.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15565195");
	СоответствиеСтрокиURL.Вставить("Справочник.ОВД.ФормаЭлемента",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15565195");
	СоответствиеСтрокиURL.Вставить("Справочник.Организации.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15007753");
	СоответствиеСтрокиURL.Вставить("Справочник.Организации.ФормаЭлемента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15007753");
	СоответствиеСтрокиURL.Вставить("Справочник.ПодразделенияОрганизаций.ФормаЭлемента", "http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15302687");
	СоответствиеСтрокиURL.Вставить("Справочник.ПодразделенияОрганизаций.ФормаСписка",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15302687");
	СоответствиеСтрокиURL.Вставить("Справочник.Пользователи.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564927");
	СоответствиеСтрокиURL.Вставить("Справочник.Пользователи.ФормаЭлемента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564927");
	//СоответствиеСтрокиURL.Вставить("Справочник.РолиКонтактныхЛиц.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ТорговоеОборудование.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_БанкиКредитные.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_БанкиКредитные.ФормаЭлемента",	"");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_ВидыБСО.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564840");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_ВидыБСО.ФормаЭлемента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564840");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ВидыНумерации.ФормаЭлемента",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ВидыНумерации.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ГруппыДоговоровB2B.ФормаСписка",	"");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_КВ.ФормаЭлемента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273898");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_Константы.ФормаЭлемента",			"");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_МаркиТС.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14155796");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_МоделиТС.ФормаЭлемента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14155796");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_МоделиТС.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14155796");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ОбъектыСтрахования.ФормаСписка",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ОбъектыСтрахования.ФормаЭлемента","");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_ПечатныеФормы.ФормаЭлемента",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=16908662");
	//СоответствиеСтрокиURL.Вставить("Справочник.ПользователиB2B.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ПротивоугонныеСистемы.ФормаСписка", "");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_СостоянияОшибок.ФормаСписка",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_СписокОбъектовИстории.ФормаЭлемента", "");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_СтраховыеПродукты.ФормаЭлемента",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=5931163");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_СтраховыеПродукты.ФормаСписка",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=5931163");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ТерриторииСтрахования.ФормаСписка", 	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ТерриторииСтрахования.ФормаЭлемента", "");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_ТипыОбъектовСтрахования.ФормаСписка",  "http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15565096");
	СоответствиеСтрокиURL.Вставить("Справочник.уб_ТипыОбъектовСтрахования.ФормаЭлемента","http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15565096");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ТипыТС.ФормаСписка",				"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_Цвета.ФормаСписка",				"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ШтрафныеСанкции.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.уб_ШтрафныеСанкции.ФормаСписка",		"");
	СоответствиеСтрокиURL.Вставить("Справочник.ФизическиеЛица.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581763");
	СоответствиеСтрокиURL.Вставить("Справочник.ФизическиеЛица.ФормаЭлемента",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=14581763");
	//СоответствиеСтрокиURL.Вставить("Справочник.ФормыСобственности.ФормаЭлемента",	"");
	//СоответствиеСтрокиURL.Вставить("Справочник.ХранилищеДополнительнойИнформации.ФормаЭлемента", "");
	
	// Документы
	
	//СоответствиеСтрокиURL.Вставить("Документ.уб_БлокировкаБСО.ФормаСписка",					"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_БлокировкаБСО.ФормаДокумента",				"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВводНачальныхОстатковБСО.ФормаСписка", 		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВводНачальныхОстатковБСО.ФормаДокумента",	"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВозвратБСОотПоставщика.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВозвратБСОотПоставщика.ФормаДокумента",		"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ВыплатаЗП.ФормаСписка",						"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273434");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ВыплатаЗП.ФормаДокумента",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273434");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ДвиженияНомераПолиса.ФормаСписка",			"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ДвиженияНомераПолиса.ФормаДокумента",		"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_Доверенности.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273824");
	СоответствиеСтрокиURL.Вставить("Документ.уб_Доверенности.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273824");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ДокументДляВыгрузкиВУП.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ДокументДляВыгрузкиВУП.ФормаДокумента",		"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы.ФормаДокумента", "");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаСписка", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749116");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаКорзина",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749116");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаДокумента",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749116");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявлениеВПолицию.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749124");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявлениеВПолицию.ФормаДокумента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749124");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявлениеОбУтрате.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749120");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ЗаявлениеОбУтрате.ФормаДокумента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749120");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ИнвентаризацияБСО.ФормаСписка",				"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ИнвентаризацияБСО.ФормаДокумента",			"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_КомпенсацияДвиженийБСО.ФормаСписка",		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_КомпенсацияДвиженийБСО.ФормаДокумента",		"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_НачислениеЗП.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749595");
	СоответствиеСтрокиURL.Вставить("Документ.уб_НачислениеЗП.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749595");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОбъявлениеВСМИобУтратеБСО.ФормаСписка", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749122");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОбъявлениеВСМИобУтратеБСО.ФормаДокумента", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749122");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОплатаПолисов.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749118");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОплатаПолисов.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749118");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетАгента.ФормаСписка",					"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетАгента.ФормаДокумента",				"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетКассира.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=13795347");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетКассира.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=13795347");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетПоставщику.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749132");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ОтчетПоставщику.ФормаДокумента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749132");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПередачаБСОПоставщику.ФормаСписка",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749134");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПередачаБСОПоставщику.ФормаДокумента",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749134");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПеремещениеБСО.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749114");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПеремещениеБСО.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749114");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВзаиморасчетСПоставщиком.ФормаСписка", 		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ВзаиморасчетСПоставщиком.ФормаДокумента", 	"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПоступлениеБСО.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749112");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ПоступлениеБСО.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749112");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ПоступлениеНомеровПолисов.ФормаСписка", 	"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_ПоступлениеНомеровПолисов.ФормаДокумента", 	"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СверкаБСО.ФормаСписка",						"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9274039");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СверкаБСО.ФормаДокумента",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9274039");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СписаниеБСО.ФормаСписка",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273873");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СписаниеБСО.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273873");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СтраховойПолис.ФормаСписка",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749130");
	СоответствиеСтрокиURL.Вставить("Документ.уб_СтраховойПолис.ФормаДокумента",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749130");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_СтраховыеПолисыБух.ФормаСписка",			"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_СтраховыеПолисыБух.ФормаДокумента",			"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_СчетНаОплатуПолиса.ФормаСписка",			"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_СчетНаОплатуПолиса.ФормаДокумента",			"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ТабельУчетаРабочегоВремени.ФормаСписка", 			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749557");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ТабельУчетаРабочегоВремени.ФормаДокумента",			"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749557");
	СоответствиеСтрокиURL.Вставить("Документ.уб_ТабельУчетаРабочегоВремени.ФормаРедактированияДня",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749557");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_УведомлениеОДосрочномПрекращенииДействияДоговора.ФормаСписка", 		"");
	//СоответствиеСтрокиURL.Вставить("Документ.уб_УведомлениеОДосрочномПрекращенииДействияДоговора.ФормаДокумента", 	"");
	СоответствиеСтрокиURL.Вставить("Документ.уб_УведомлениеПоставщикаОбУтратеБСО.ФормаСписка", 		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749126");
	СоответствиеСтрокиURL.Вставить("Документ.уб_УведомлениеПоставщикаОбУтратеБСО.ФормаДокумента", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749126");
	
	// Отчеты
	
	//СоответствиеСтрокиURL.Вставить("Отчет.ДвиженияДокумента.Форма",					"");
	//СоответствиеСтрокиURL.Вставить("Отчет.ОтчетПоДаннымКонтрагента.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.ОтчетСписокКроссТаблица.ФормаОсновная",	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ДниРожденияКлиентов.ФормаОтчета",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ЗПКурьера.ФормаОтчета",				"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОшибкиПолиса.ФормаОтчета",				"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_МониторингДляТочкиПродаж.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_МониторингПоНаправлениям.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_МониторингПролонгации.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОжидаемыеПлатежи.Форма",				"");
	СоответствиеСтрокиURL.Вставить("Отчет.уб_ОстаткиБСО.Форма",						"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=16908444");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОстаткиБСО_старый.Форма",				"");
	СоответствиеСтрокиURL.Вставить("Отчет.уб_ОстаткиСвобНомеровПолисов.Форма",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=16908469");
	СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетЗаявкаНаЗаказВыездногоСпециалиста.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетОПродажахДляСтраховыхКомпаний.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоАннулированнымПолисам.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоКарточкам.ФормаОтчета",			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоПравкамОплатДляЗП.ФормаОтчета",	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоПролонгации.ФормаОтчета",		"");
	СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоРаспределениюСтраховокПоСуммамПремий.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПоСреднимЗаПериод.ФормаОтчета",	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетУчетаВремениСотрудника.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОформленныеНоНеСданныеПолисы.Форма",	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ПлатежиПоСтраховымПолисам.ФормаОтчета","");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ПодведениеФинансовыхИтогов.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ПодведениеФинансовыхИтоговПоСК.Форма",	"");
	СоответствиеСтрокиURL.Вставить("Отчет.уб_РассогласованияОплат.ФормаОтчета",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=9273868");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_РеестрЗаполненныхПолисов.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СводныеДанныеПоОплатам.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.УниверсальныйОтчетПоМетаданным.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.ШаблонТиповогоОтчета.ФормаОтчета",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ВзаиморасчетыСПоставщиками.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОтчетПроверкаОтсутствияОППриНевключатьВОП.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ПремииЗаПериод.ФормаОтчета", 			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ПроверкаПринятыхОплатБезОП.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СостояниеБСОПоЗаявкам.ФормаОтчета",	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СтатистикаЗаявок.ФормаОтчета", 		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СтатистикаПоСтраховкам.ФормаОтчета", 	"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СтатусыЗаявок.ФормаОтчета",			"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ВзаиморасчетыПоОтчетамПоставщику.ФормаОтчета", "");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_ОбъектыСтрахования.ФормаОтчета",		"");
	//СоответствиеСтрокиURL.Вставить("Отчет.уб_СравнениеКВ.ФормаОтчета",				"");
	
	// Обработки
	
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ImageResize.Форма",				"");
	//СоответствиеСтрокиURL.Вставить("Обработка.SS_УниверсальныеПодборИОбработкаОбъектов.ПодборИОбработка", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.БлокировкаСоединенийСИнформационнойБазой.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ВыгрузкаЗагрузкаДанныхXML.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ВыгрузкаМетаданных.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ГрупповаяОбработкаСправочниковИДокументов.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ГрупповоеПерепроведениеДокументов.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ЗагрузкаБанков.ФормаКлассификатора",	"");
	//СоответствиеСтрокиURL.Вставить("Обработка.КонсольЗапросов.Форма",				"");
	//СоответствиеСтрокиURL.Вставить("Обработка.КонсольОтчетов.Форма",				"");
	//СоответствиеСтрокиURL.Вставить("Обработка.КонструкторПользовательскихПолей.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.НастройкаПравДоступа.НастройкаПравДоступа", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ОбменСБухгалтерией.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ОтправкаЭлектронногоСообщенияВОтделТехническойПоддержки.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ПоискДанных.Форма",					"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ПоискИЗаменаЗначений.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ПолучениеФайловИзИнтернета.ФормаПараметрыПрокси", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.ПомощникНастройкиОбменаДанными.Форма","");
	//СоответствиеСтрокиURL.Вставить("Обработка.ПредставлениеКонтактнойИнформации.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.РегистрацияИзмененийДляОбмена.Форма",	"");
	//СоответствиеСтрокиURL.Вставить("Обработка.СписокПользователейБД.ФормаОтбора",	"");
	//СоответствиеСтрокиURL.Вставить("Обработка.ТОНастройка_Шаблон.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ВыгрузкаЖурналаРегистрации.Форма",	"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ВыдачаЗаданийНаПролонгацию.Форма",	"");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_ДеревоУправленияНачислениями.Форма", 						"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749555");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_ДеревоУправленияНачислениями.ФормаЗаписи",					"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749555");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_ДеревоУправленияНачислениями.ФормаРедактированиПериода",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749555");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_ДеревоУправленияШтрафами.Форма",		"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749552");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_ДеревоУправленияШтрафами.ФормаЗаписи",	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=8749552");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ЗадолженностьОрганизацииПоЗПнаЗаданнуюДату.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ИзменениеОсновногоПодразделения.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ИмпортНомеровБСО.ФормаИмпорта",	"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ИмпортСверки_из_EXCE_TXT.ФормаИмпорта", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_МониторингОстатковБСО.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_НастройкаНаправлений.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ОтчетПоЛичнымЗаявкам.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ПечатьКонвертов.Форма",			"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ПечатьСеткиКВ.Форма",				"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ПланыПоСКВ.Форма",					"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ПоискНесоответствияОргАгентаДляАгоМиллионИОСАГО.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_РасчетВМ.Форма",					"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_СтатистикаПоСтраховкам.Форма",		"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_Чат.Форма",						"");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ШтрихКодыКБСО.ФормаГрупповойПривязкиШК", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.УниверсальныйЖурналДокументов.ОсновнаяФорма","");
	//СоответствиеСтрокиURL.Вставить("Обработка.УниверсальныйОбменДаннымиXML.Форма",	"");	
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_ЗагрузкаВзаиморасчетовСПоставщиками.Форма", "");
	//СоответствиеСтрокиURL.Вставить("Обработка.уб_СинхронизацияКонтрагентовБПиУБ.Форма", "");
	СоответствиеСтрокиURL.Вставить("Обработка.уб_СтатусыЗаявок.Форма",				"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564996");
	
	// Регистры сведений
	
	СоответствиеСтрокиURL.Вставить("РегистрСведений.уб_ПараметрыДоговоровИОтчетов.ФормаСписка", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564936");
	СоответствиеСтрокиURL.Вставить("РегистрСведений.уб_ПараметрыДоговоровИОтчетов.ФормаДокумента", 	"http://wiki.itc-labs.ru/pages/viewpage.action?pageId=15564936");
	КонецЕсли;

	ЗначениеURL = СоответствиеСтрокиURL.Получить(URL);
	Если  ЗначениеURL = Неопределено Тогда
		Возврат URL;
	Иначе
		Возврат ЗначениеURL;
	КонецЕсли;
	
КонецФункции // ПолучитьURLПоНеURL()

Процедура СоздатьКнопкуПоискСсылок(ПутьККнопке)
	
	#Если Клиент Тогда
		Разделитель = ПутьККнопке.Добавить();
		Разделитель.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		Кнопка = ПутьККнопке.Добавить();
		Кнопка.Доступность 	= Истина;
		Кнопка.Имя 			= "ПоискСсылокНаОбъект";
		Кнопка.ТипКнопки 	= ТипКнопкиКоманднойПанели.Действие;
		Кнопка.Действие 	= Новый Действие("ОбработчикДопКнопокДействийФормы");
		Кнопка.Текст		= "Поиск ссылок на объект";
		Кнопка.Картинка 	= БиблиотекаКартинок.Найти;
		Кнопка.Подсказка	= "Поиск ссылок на объект";
	#КонецЕсли
	
КонецПроцедуры

Процедура СоздатьКнопкуСтруктураПодчиненности(ПутьККнопке) Экспорт
	
	#Если Клиент Тогда
		
		Разделитель = ПутьККнопке.Добавить();
		Разделитель.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
		
		Кнопка = ПутьККнопке.Добавить();
		Кнопка.Доступность = Истина;
		Кнопка.Имя = "СтруктураПодчиненности";
		Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		Кнопка.Действие = Новый Действие("ОбработчикДопКнопокДействийФормы");
		Кнопка.Текст = "Структура подчиненности";
		Кнопка.Картинка = БиблиотекаКартинок.СтруктураПодчиненностиДокумента;
		Кнопка.Подсказка = "Открывает структуру подчиненности документа";
		Кнопка.Доступность = Истина;
		
	#КонецЕсли
	
КонецПроцедуры

#Если Клиент Тогда
Процедура ОбработатьСобытиеДействийФормы(Кнопка, ТабличноеПолеСсылка, ФормаИсточник, ИдентификаторИсточника) Экспорт
	
	ИмяКнопки = Кнопка.Имя;	
	Если ИмяКнопки = "СкрытыеРеквизиты" Тогда
		Попытка
			ВидимостьКолонок(ТабличноеПолеСсылка,Кнопка);
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка при установке видимости колонок "
			+ ФормаИсточник + Символы.ПС + "Технические детали ошибки: " + ОписаниеОшибки());				
		КонецПопытки;	
	ИначеЕсли ИмяКнопки = "СтруктураПодчиненности" Тогда
		Если ТипЗнч(ТабличноеПолеСсылка) = Тип("ТабличноеПоле") Тогда
			Если Не ТабличноеПолеСсылка.ТекущиеДанные = Неопределено Тогда
				Ссылка = ТабличноеПолеСсылка.ТекущиеДанные.Ссылка
			Иначе
				Ссылка = Неопределено;
			КонецЕсли;	
		Иначе
			Ссылка = ТабличноеПолеСсылка
		КонецЕсли;		
		Если Ссылка <> Неопределено Тогда
			РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Ссылка);
		КонецЕсли
	ИначеЕсли Лев(ИмяКнопки, 9)= "Помощник_" Тогда
		ОбработатьНажатиеКнопкиПомощника(Кнопка, ФормаИсточник);
	ИначеЕсли Лев(ИмяКнопки, 14) = "СкрытьПоказать" Тогда
		СкрытьПоказатьПоля(Кнопка, ФормаИсточник);
	ИначеЕсли Найти(ИмяКнопки,"ВызовСправкиHTML")= 1 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	уб_СправкаСтраницы.URL,
		|	уб_СправкаСтраницы.Имя,
		|	уб_СправкаСтраницы.СетевойПутьКСтранице
		|ИЗ
		|	Справочник.уб_Справка.Страницы КАК уб_СправкаСтраницы
		|ГДЕ
		|	уб_СправкаСтраницы.Ссылка.Наименование = &ИдентификаторИсточника
		|	И НЕ уб_СправкаСтраницы.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	уб_СправкаСтраницы.НомерСтроки";
		Запрос.УстановитьПараметр("ИдентификаторИсточника", ИдентификаторИсточника);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СправкаHTML(Выборка.URL, Истина, Выборка.СетевойПутьКСтранице);
		Иначе
			СправкаHTML(ИдентификаторИсточника);
		КонецЕсли;
	ИначеЕсли ИмяКнопки = "СканерШК" Тогда
		Кнопка.Пометка = НЕ Кнопка.Пометка;
		уб_ШК.УстановитьСостояниеСканераШК(Кнопка);	
	ИначеЕсли ИмяКнопки = "РучнойВводШтрихкода" Тогда
		уб_ШК.РучнойВводШтрихкода(ФормаИсточник, Ложь);
	ИначеЕсли ИмяКнопки = "ПоискСсылокНаОбъект" Тогда
		Если ТипЗнч(ТабличноеПолеСсылка) = Тип("ТабличноеПоле") Тогда
			Если Не ТабличноеПолеСсылка.ТекущиеДанные = Неопределено Тогда
				Ссылка = ТабличноеПолеСсылка.ТекущиеДанные.Ссылка
			КонецЕсли;
		Иначе
			Ссылка = ТабличноеПолеСсылка
		КонецЕсли;		
		Если Ссылка <> Неопределено Тогда
			Массив = Новый Массив;
			Массив.Добавить(Ссылка);
			//при отсутствии права чтения на какойлибо объект вызывается исключение
			Попытка
				ТЗБезФильтра = НайтиПоСсылкам(Массив);
			Исключение
			КонецПопытки;
			Если ТЗБезФильтра <> Неопределено Тогда
				ТЗ = ТЗБезФильтра.СкопироватьКолонки();
				Для Каждого СтрокаТЗ Из ТЗБезФильтра Цикл
					Если Найти(СтрокаТЗ.Данные, "РегистрСведенийКлючЗаписи") = 0 Тогда
						Стр = ТЗ.Добавить();
						ЗаполнитьЗначенияСвойств(Стр, СтрокаТЗ);
					КонецЕсли;
				КонецЦикла;
				Фрм = ПолучитьОбщуюФорму("уб_ФормаПросмотраТЗ");
				Фрм.ТаблицаЗначений = ТЗ;
				Фрм.ТолькоПросмотр 	= Истина;
				Фрм.ОткрытьМодально();
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли Лев(ИмяКнопки,4)="xxx_" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уб_СправкаСтраницы.URL,
		|	уб_СправкаСтраницы.Имя,
		|	уб_СправкаСтраницы.СетевойПутьКСтранице
		|ИЗ
		|	Справочник.уб_Справка.Страницы КАК уб_СправкаСтраницы
		|ГДЕ
		|	уб_СправкаСтраницы.Имя ПОДОБНО &ИмяКнопки
		|	И НЕ уб_СправкаСтраницы.Ссылка.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИмяКнопки", ИмяКнопки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СправкаHTML(Выборка.URL, Истина, Выборка.СетевойПутьКСтранице);
		КонецЕсли;	
	ИначеЕсли Лев(ИмяКнопки, 3) = "кн_" Тогда
		//это кнопка определенной группировки
		Уровень = Число(Кнопка.Заголовок); // здесь записан нужный уровень
		ФормаИсточник.ЭлементыФормы[ТабличноеПолеСсылка].ПоказатьУровеньГруппировокСтрок(Уровень - 1);
		ФормаИсточник.ТекущийЭлемент = ФормаИсточник.ЭлементыФормы[ТабличноеПолеСсылка];
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

//Функция производит поисх похожих по наименованию Физлиц с учетом веса вхождения
Функция ПолучитьСписокПохожихФизлиц (ФИО, КакМассив = Ложь, ЗапроС = Неопределено, Получатель = Неопределено) Экспорт
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	Конецесли;	
	МассивПодстрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ФИО," ");		
	ТекстЗапроса = "ВЫБРАТЬ
	|	Вложенный.Ссылка,
	|	Вложенный.Вес
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		ФизическиеЛица.Ссылка КАК Ссылка,
	|		ВЫБОР
	|			КОГДА ФизическиеЛица.Наименование ПОДОБНО &Фамилия
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ФизическиеЛица.Наименование ПОДОБНО &Имя
	|				ТОГДА 2
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ФизическиеЛица.Наименование ПОДОБНО &Отчество
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Вес
	|	ИЗ
	|		Справочник.ФизическиеЛица КАК ФизическиеЛица
	|	ГДЕ (ФизическиеЛица.Наименование ПОДОБНО &Фамилия
	|				ИЛИ ФизическиеЛица.Наименование ПОДОБНО &Имя
	|				ИЛИ ФизическиеЛица.Наименование ПОДОБНО &Отчество)
	|		
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Вес УБЫВ) КАК Вложенный
	|ГДЕ
	|	Вложенный.Вес >= &Вес";
	ВсегоПодСтрок = МассивПодстрок.Количество();
	Если ВсегоПодСтрок >=3 Тогда
		//
		Запрос.УстановитьПараметр("Фамилия",  МассивПодстрок[0]+"%");
		Запрос.УстановитьПараметр("Имя",      "%"+МассивПодстрок[1]+"%");
		Запрос.УстановитьПараметр("Отчество", "%"+МассивПодстрок[2]+"%");
		Запрос.УстановитьПараметр("Вес",4);
	ИначеЕсли ВсегоПодСтрок = 2 Тогда		   
		//
		Запрос.УстановитьПараметр("Фамилия",  МассивПодстрок[0]+"%");
		Запрос.УстановитьПараметр("Имя",      "%"+МассивПодстрок[1]+"%");
		Запрос.УстановитьПараметр("Отчество", "9876");
		Запрос.УстановитьПараметр("Вес",3);
	ИначеЕсли ВсегоПодСтрок = 1 Тогда		   		
		Запрос.УстановитьПараметр("Фамилия",  МассивПодстрок[0]+"%");
		Запрос.УстановитьПараметр("Имя",      "9876");
		Запрос.УстановитьПараметр("Отчество", "9876");
		Запрос.УстановитьПараметр("Вес",3);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;		   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
		Если НЕ Получатель = НЕопределено и КакМассив Тогда
			Получатель.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	
	Если НЕ КакМассив Тогда
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(Массив);
		Если НЕ Получатель = НЕопределено Тогда
			Для каждого ЭлемЗнч из Список Цикл
				Получатель.Добавить(ЭлемЗнч.Значение,ЭлемЗнч.Представление,ЭлемЗнч.Пометка);
			КонецЦикла;	
		КонецЕсли;
		Возврат Список;
	Иначе	
		Возврат Массив;
	КонецЕсли;	
	
КонецФункции	

#Если Клиент Тогда	
	Процедура СгенерироватьКнопкиУправленияГруппировкой(ЭлементыФормы, ИмяТабличногоДокумента, Панель = "") Экспорт
		
		НачалоВерх = 0;
		НачалоЛево = 0;
		
		Если Панель <> "" Тогда
			НачалоВерх = ЭлементыФормы[Панель].Верх + ЭлементыФормы[ИмяТабличногоДокумента].Верх + 3;
			НачалоЛево = ЭлементыФормы[Панель].Лево + ЭлементыФормы[ИмяТабличногоДокумента].Лево + 3;
		Иначе
			НачалоВерх = ЭлементыФормы[ИмяТабличногоДокумента].Верх + 3; // Привязка к верхнему левому углу ПоляТабличногоДокумента
			НачалоЛево = ЭлементыФормы[ИмяТабличногоДокумента].Лево + 3; // Привязка к верхнему левому углу ПоляТабличногоДокумента
		КонецЕсли;
		
		ШагКнопок      = 13;
		ПрефиксИмениКн = "кн_";
		
		// Удалить старые кнопки
		Сч = 0;
		Пока Сч < ЭлементыФормы.Количество() Цикл
			ТекЭлемент = ЭлементыФормы.Получить(Сч);
			Если Найти(ТекЭлемент.Имя, ПрефиксИмениКн) > 0 Тогда
				ЭлементыФормы.Удалить(ТекЭлемент);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
		
		// Добавить новые кнопки по количеству группировок
		КоличествоГруппировок = ЭлементыФормы[ИмяТабличногоДокумента].КоличествоУровнейГруппировокСтрок();
		Для Сч = 1 По КоличествоГруппировок Цикл
			НоваяКнопка = ЭлементыФормы.Добавить(Тип("Кнопка"), ПрефиксИмениКн + Сч + "_" + ИмяТабличногоДокумента);
			НоваяКнопка.Верх      = НачалоВерх;
			НоваяКнопка.Лево      = НачалоЛево + (ШагКнопок * (Сч - 1));
			НоваяКнопка.Высота    = 12;
			НоваяКнопка.Ширина    = 12;
			НоваяКнопка.Шрифт     = Новый Шрифт("Шрифт диалогов и меню", 7);
			НоваяКнопка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			НоваяКнопка.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			НоваяКнопка.Заголовок = "" + Сч;
			НоваяКнопка.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["_"+сч], Истина, Ложь, Ложь);  
			НоваяКнопка.УстановитьДействие("Нажатие", Новый Действие("ОбработчикДопКнопокДействийФормы"));
			НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЭлементыФормы[ИмяТабличногоДокумента], ГраницаЭлементаУправления.Верх);
			НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭлементыФормы[ИмяТабличногоДокумента], ГраницаЭлементаУправления.Верх);
			НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы[ИмяТабличногоДокумента], ГраницаЭлементаУправления.Лево);
			НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы[ИмяТабличногоДокумента], ГраницаЭлементаУправления.Лево);
		КонецЦикла;
		
	КонецПроцедуры //СгенерироватьКнопкиУправленияГруппировкой()
	
	Процедура ДобавитьКолонтитулыВТабличныйДокумент(ТабличноеПоле) Экспорт
		
		ТабличноеПоле.РазмерКолонтитулаСверху = 6;
		ВКлн = ТабличноеПоле.ВерхнийКолонтитул;
		ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ВКлн.НачальнаяСтраница = 1;
		ВКлн.Выводить = Истина;
		
		ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
		ВКлн.Шрифт = Новый Шрифт(,7);
		
		ТабличноеПоле.РазмерКолонтитулаСнизу = 8;
		HКлн = ТабличноеПоле.НижнийКолонтитул;
		HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		HКлн.НачальнаяСтраница = 1;
		HКлн.Выводить = Истина;
		HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия + "." + Формат(ТекущаяДата(),"ДФ=yyMMdd.HHmm");
		HКлн.Шрифт = Новый Шрифт(,7);
		
	КонецПроцедуры
#КонецЕсли

///////////////////////////////////////
// Для управления отборами в отчетах //

#Если Клиент Тогда
//Пустая ТЗ для обработки отбора
Функция СоздатьТЗОтбора() Экспорт
		
		ТЗ = Новый ТаблицаЗначений;
		
		ТЗ.Колонки.Добавить("ИмяПоля");
		ТЗ.Колонки.Добавить("ЗначениеОтбора");
		ТЗ.Колонки.Добавить("ВидСравнения");
		
		Возврат ТЗ;
		
	КонецФункции // СоздатьТЗОтбора()
	
//добавляет поле отбора для последующей обработки
	//ТЗ - ТЗ с помощью функции СоздатьТЗОтбора
	//ИмяПоля - строковое значение левого значения поля отбора
	//ЗначениеОтбора - правое значение поля отбора, если ЗначениеНеЗаполнено то отбор для поля не производится
	//ВидСравнения - строковое ВидСравненияКомпоновкиДанных
Процедура ДобавитьОтбор(ТЗ, ИмяПоля, ЗначениеОтбора, ВидСравнения = "Равно") Экспорт
		
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.ИмяПоля 			= ИмяПоля;
		СтрокаТЗ.ЗначениеОтбора 	= ЗначениеОтбора;
		СтрокаТЗ.ВидСравнения		= ВидСравнения;
		
	КонецПроцедуры // ДобавитьОтбор()
	
//обрабатывает поле отбора отчета
Процедура ОбработатьОтбор(Отбор, ТЗ) Экспорт
		
		//массив для проверки обработанных полей,
		//т.к. может быть несколько отборов по одному показателю
		ПолеУжеОбработано = Новый Массив();
		Для Счетчик = 0 По ?(ТЗ.Количество() > Отбор.Количество(), ТЗ.Количество(), Отбор.Количество()) Цикл
			ПолеУжеОбработано.Добавить(Ложь);
		КонецЦикла;
		
		Для Каждого Элемент из ТЗ Цикл
			ЭлементОтбора = Неопределено;
			
			Для Индекс = 0 По Отбор.Количество() - 1 Цикл
				Если Отбор[Индекс].ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.ИмяПоля) И Не ПолеУжеОбработано[Индекс] Тогда
					ЭлементОтбора = Отбор[Индекс];
					ПолеУжеОбработано[Индекс] = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЭлементОтбора = Неопределено Тогда
				ЭлементОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(Элемент.ИмяПоля);
			КонецЕсли;
			
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных[Элемент.ВидСравнения];
			ЭлементОтбора.Использование 	= ЗначениеЗаполнено(Элемент.ЗначениеОтбора);
			ЭлементОтбора.Представление		= Элемент.ЗначениеОтбора;
			ЭлементОтбора.ПравоеЗначение	= Элемент.ЗначениеОтбора;
		КонецЦикла;
		
	КонецПроцедуры
#КонецЕсли

//Wscript.shell 
//закрывает окно служебных сообщений
Процедура ЗакрытьОкноСлужебныеСообщения() Экспорт
	Shell = Новый COMОбъект("Wscript.shell");
	Shell.SendKeys("^+{z}");
	Shell.SendKeys("^+{я}");
КонецПроцедуры

//восстанавливает положение окна
Процедура ВосстановитьПоложениеОкна() Экспорт
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("%+(R)"); // вызов Alt+Shift+R
КонецПроцедуры

//получает серию и номер квитанции А7 отдельно по полному номеру
Процедура ПолучитьСериюИНомерКвитанцииА7(НомерА7, НомерКвитанции = "", СерияКвитанции = "") Экспорт
	
	НомерА7 = СокрЛП(НомерА7);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ПоступлениеБСОБСО.НачНомерБСО,
	|	уб_ПоступлениеБСОБСО.КонНомерБСО,
	|	уб_ПоступлениеБСОБСО.СерияБСО
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК уб_ПоступлениеБСОБСО
	|ГДЕ
	|	уб_ПоступлениеБСОБСО.ВидБСО.Тип = &А7";
	
	Запрос.УстановитьПараметр("А7", Перечисления.уб_ТипыБСО.КвитанцияА7);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		СерияБСО	= СокрЛП(Выборка.СерияБСО);		
		Если СерияБСО <> Лев(НомерА7, СтрДлина(СерияБСО)) Тогда
			Продолжить
		КонецЕсли;
		
		КонНомерБСО = ?(Выборка.КонНомерБСО = "", Число(СокрЛП(Выборка.НачНомерБСО)), Число(СокрЛП(Выборка.КонНомерБСО)));
		НачНомерБСО	= Число(СокрЛП(Выборка.НачНомерБСО));
		
		//Серия равна началу номера с серией убираем ее - оставляем номер
		НомерБСО = Сред(НомерА7, СтрДлина(СерияБСО) + 1);
		
		Попытка
			чНомерБСО = Число(НомерБСО)
		Исключение
			Продолжить
		КонецПопытки;
		
		Если чНомерБСО >= НачНомерБСО И чНомерБСО <= КонНомерБСО Тогда
			//нашли
			НомерКвитанции = НомерБСО;
			СерияКвитанции = СерияБСО;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьСериюИНомерКвитанцииА7()

//получаем серию и номер полиса по номеру полиса путем перебора документа Поступление БСО
Функция ПолучитьСериюИНомерПолиса(НомерПолиса) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("СерияПолиса", 	"");
	Структура.Вставить("НомерПолиса", 	"");
	Структура.Вставить("СуффиксПолиса", "");
	Лев3 = Лев(НомерПолиса,3);
	Поз = Найти(НомерПолиса,"-");
	Если  Лев3 = "XXX" ИЛИ Лев3 = "ХХХ" 
		или Лев3 = "TTT" ИЛИ Лев3 = "ТТТ" Тогда
		Структура.Вставить("СерияПолиса", 	Лев3);
		Структура.Вставить("НомерПолиса", 	СтрЗаменить(Сред(НомерПолиса,4),"-",""));
	ИначеЕсли Поз>0 Тогда
		Структура.Вставить("СерияПолиса", 	Лев(НомерПолиса,Поз-1));
		Структура.Вставить("НомерПолиса", 	Сред(НомерПолиса,Поз+1));
	ИначеЕсли Найти("0123456789",Лев(НомерПолиса,1)) = 0 Тогда
		Серия = "";
		Номер = "";
		Для Счетчик = 1 по СтрДлина(НомерПолиса) Цикл
			Символ = Сред(НомерПолиса,Счетчик,1);
			Если Найти("0123456789",Символ) = 0 Тогда
				Серия = Серия+Символ;
			Иначе
				Номер = Сред(НомерПолиса,Счетчик);
				Прервать
			КонецЕсли;	
			
		КонецЦикла;	
		Структура.Вставить("СерияПолиса", 	Серия);
		Структура.Вставить("НомерПолиса", 	Номер);
	ИначеЕсли Найти(НомерПолиса,"/")  Тогда	
		Поз = Найти(НомерПолиса,"/");
		Серия = Лев(НомерПолиса,Поз);
		Номер  = Сред(НомерПолиса,Поз+1);
		Структура.Вставить("СерияПолиса", 	Серия);
		Структура.Вставить("НомерПолиса", 	Номер);
	Иначе
		Структура.Вставить("НомерПолиса", 	НомерПолиса);
	КонецЕсли;	
	//НомерПолисаБезИзменений = НомерПолиса;
	//НомерПолиса = СокрЛП(НомерПолиса);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	БСО.СерияПолиса,
	//|	БСО.НачНомерПолиса,
	//|	БСО.КонНомерПолиса,
	//|	БСО.СуффиксПолиса
	//|ИЗ
	//|	Документ.уб_ПоступлениеБСО.БСО КАК БСО
	//|ГДЕ
	//|	БСО.НачНомерПолиса <> """"
	//|	И БСО.СерияПолиса <> """"
	//|   и БСО.НомерПолиса = &НомерПолиса";
	//Запрос.УстановитьПараметр("НомерПолиса",НомерПолиса);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ФлНайден = Ложь;
	//Пока Выборка.Следующий() Цикл		
	//	СерияПолиса 	= СокрЛП(Выборка.СерияПолиса);
	//	Если СерияПолиса <> Лев(НомерПолисаБезИзменений, СтрДлина(СерияПолиса)) Тогда
	//		Продолжить
	//	КонецЕсли;
	//	КонНомерПолиса	= ?(Выборка.КонНомерПолиса = "", Число(СокрЛП(Выборка.НачНомерПолиса)), Число(СокрЛП(Выборка.КонНомерПолиса)));
	//	НачНомерПолиса	= Число(СокрЛП(Выборка.НачНомерПолиса));
	//	
	//	//Серия равна началу номера с серией убираем ее - оставляем номер (учитывая суффикс полиса)
	//	НомерПолиса = Сред(НомерПолисаБезИзменений, СтрДлина(СерияПолиса) + 1);
	//	//Возможен суффикс полиса
	//	СуффиксПолиса = СокрП(Выборка.СуффиксПолиса);
	//	ДлинаСуффикса = СтрДлина(СуффиксПолиса);
	//	Если ДлинаСуффикса > 0 И Прав(НомерПолиса, ДлинаСуффикса) = СуффиксПолиса Тогда
	//		НомерПолиса = Лев(НомерПолиса, СтрДлина(НомерПолиса) - ДлинаСуффикса);
	//	КонецЕсли;
	//	
	//	Попытка
	//		чНомерПолиса = Число(НомерПолиса);
	//	Исключение
	//		Продолжить
	//	КонецПопытки;
	//	
	//	Если чНомерПолиса >= НачНомерПолиса И чНомерПолиса <= КонНомерПолиса Тогда
	//		Структура.СерияПолиса 	= СерияПолиса;
	//		Структура.НомерПолиса 	= СокрЛП(НомерПолиса);
	//		Структура.СуффиксПолиса	= СокрЛ(СуффиксПолиса);
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Структура;
	
КонецФункции

//получает раздельно данные по типу "Документ.ИмяДокумента.ИмяФормы" в структуре
Функция РазделитьИсточникДействий(Знач Строка) Экспорт
	
	Строка = СокрЛП(Строка);
	Поз = Найти(Строка, ".");
	Если Поз <> 0 Тогда
		Структура = Новый Структура;
		Структура.Вставить("Тип", Лев(Строка, Поз - 1));
		Стр = Сред(Строка, Поз + 1);
		Поз = Найти(Стр, ".");
		//учитывая ОбщиеФормы (например ОбщаяФорма.Форма)
		Структура.Вставить("Имя",	?(Поз <> 0, Лев(Стр, Поз - 1),	Неопределено));
		Структура.Вставить("Форма", ?(Поз <> 0, Сред(Стр, Поз + 1),	Стр));
		//учитывая имя поля (например Отчет.уб_Отчет.ФормаДокумента.ДатаНачала
		Стр = Сред(Строка, Поз + 1);
		Поз = Найти(Стр, ".");
		Если Поз <> 0 Тогда
			Структура.Вставить("Поле", Сред(Стр, Поз + 1));
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

//получает остатки номерных БСО.
Функция ПолучитьОстаткиБСО(Знач СК, Знач ВидБСО) Экспорт
	
	Если ЗначениеНеЗаполнено(СК) Или ЗначениеНеЗаполнено(ВидБСО) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСО) Тогда
		СписокПоложенийБСО = Новый СписокЗначений;
		СписокПоложенийБСО.Добавить(Перечисления.уб_ПоложенияБСО.ПолученИзСК);
		СписокПоложенийБСО.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенИзСК);
		//СписокПоложенийБСО.Добавить(Перечисления.уб_ПоложенияБСО.ПереданНаТочку);
		СписокПоложенийБСО.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенСТочки);
		
		СписокСостоянийБСО = Новый СписокЗначений;
		СписокСостоянийБСО.Добавить(Перечисления.уб_СостоянияБСО.ПустойБланк);
		СписокСостоянийБСО.Добавить(Перечисления.уб_СостоянияБСО.НеиспользованныйБланк);
		
		СписокАгентыМолПоБСО = ВернутьСписокСотрудниковОУБСО();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ОперОстаткиБСО.Количество
		|ИЗ
		|	РегистрСведений.уб_УпрОстаткиБСО КАК уб_ОперОстаткиБСО
		|ГДЕ
		|	уб_ОперОстаткиБСО.ВидБСО = &ВидБСО";
		Запрос.УстановитьПараметр("ВидБСО",				ВидБСО);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;
		Иначе
			Возврат 0;
		КонецЕсли;	
	ИначеЕсли уб_СЛ.ОпределитьВедетсяКоличественныйУчет(ВидБСО) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_ОстаткиБСООстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.уб_ОстаткиБСО.Остатки КАК уб_ОстаткиБСООстатки
		|ГДЕ
		|	уб_ОстаткиБСООстатки.СК = &СК
		|	И уб_ОстаткиБСООстатки.ВидБСО = &ВидБСО";
		
		Запрос.УстановитьПараметр("СК",		СК);
		Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество
		Иначе
			Возврат 0
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // ПолучитьОстаткиБСО()

//добавляет числа к кодам символов строки
Функция ШифрСтроки(Строка, Зашифровать = Истина) Экспорт
	
	Стр = СокрЛП(Строка);
	Сдвиг = 20;
	Результат = "";
	Для Индекс = 1 По СтрДлина(Стр) Цикл
		Если Сдвиг = 10 Тогда 
			Сдвиг = 20 
		КонецЕсли;
		Код = КодСимвола(Сред(Стр, Индекс, 1));
		Результат = Результат + Символ(Код + ?(Зашифровать, + Сдвиг, - Сдвиг));
		Сдвиг = Сдвиг - 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЗашифроватьСтроку()

//получает значение предопределенного права либо настройки из ПВХ Настройки пользователей для текущего пользователя
Функция ПолучитьПредопределеннуюНастройкуПользователя(Знач Настройка, ЗначениеПоУмолчанию) Экспорт
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат ЗначениеПоУмолчанию
	ИначеЕсли ТипЗнч(Настройка) = Тип("Строка") Тогда
		ЗначениеНастройки = Неопределено;
		Попытка
			Если ПараметрыСеанса.уб_Константы.Свойство(Настройка,ЗначениеНастройки) Тогда
				Возврат ЗначениеНастройки;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Настройка = ПланыВидовХарактеристик.НастройкиПользователей[Настройка]
		Исключение
			Настройка = ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию(Настройка);
			Если Настройка.Пустая() Тогда
				Возврат ЗначениеПоУмолчанию
			КонецЕсли;	
		КонецПопытки;
	КонецЕсли;
	КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
	ЗначениеНастройки = КэшДополнительныхПрав[Настройка];
	Если ЗначениеНастройки <> Неопределено Тогда
		Возврат ЗначениеНастройки
	КонецЕсли;
	ЗапросПредопределеннойНастройки = Новый Запрос;
	ЗапросПредопределеннойНастройки.Текст =
	"ВЫБРАТЬ
	|	НП.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НП
	|ГДЕ
	|	НП.Настройка = &Настройка
	|	И НП.Пользователь = &Пользователь";			
	ЗапросПредопределеннойНастройки.УстановитьПараметр("Настройка",		Настройка);
	ЗапросПредопределеннойНастройки.УстановитьПараметр("Пользователь",	ПолучитьПользователяИлиПрофиль(Настройка.ДобавлятьВПрофили));
	Выборка = ЗапросПредопределеннойНастройки.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Значение;	
	Иначе
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	КэшДополнительныхПрав[Настройка] = Результат;
	//#Если Сервер Тогда
	глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", КэшДополнительныхПрав, Истина);
	//#КонецЕсли
	Возврат Результат;
	
КонецФункции

//сохраняет значение предопределенного права либо настройки из ПВХ Настройки пользователей для текущего пользователя
Процедура СохранитьПредопределеннуюНастройкуПользователя(Настройка, Значение) Экспорт
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.Настройка.Установить(Настройка);
	Запись = Набор.Добавить();
	Запись.Пользователь = Пользователь;
	Запись.Настройка	= Настройка;
	Запись.Значение		= Значение;
	Попытка
		Набор.Записать()
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не записан набор записей регистра сведений настроек пользователей!
		|Пользователь: " + Пользователь + ", Настройка: " + Настройка + ", Значение: " + Значение + "
		|" + ОписаниеОшибки())
	КонецПопытки;
	
КонецПроцедуры

//получает значения полей (непредопределенных) в регистре настроек при открытии формы
//ТекущееЗначение - если параметр заполнен, тогда данные из регистра не берутся (в случаях передачи в реквизит каких-либо параметров)
Функция ПолучитьЗначениеИзНастроекПользователя(
	ИмяПоля, 
	ИмяОбъекта, 
	ЗначениеПоУмолчанию,
	ТекущееЗначение = Неопределено
	) Экспорт
	
	Если ЗначениеНеЗаполнено(ТекущееЗначение) Тогда
		ПолноеИмя	    = ИмяОбъекта + "." + ИмяПоля;
		Пользователь	= ПараметрыСеанса.ТекущийПользователь;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НастройкиПользователей.Ссылка КАК Ссылка
		|		ИЗ
		|			ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
		|		ГДЕ
		|			НастройкиПользователей.Наименование = &Наименование
		|			И НастройкиПользователей.ВидНастройки = &ЗначениеПоля) КАК ВложенныйЗапрос
		|		ПО НастройкиПользователей.Настройка = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка = ВложенныйЗапрос.Ссылка";
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("ЗначениеПоля", Перечисления.уб_ВидыНастроекПользователей.ЗначениеПоля);
		Запрос.УстановитьПараметр("Наименование", ПолноеИмя);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Значение
		Иначе
			Результат = ЗначениеПоУмолчанию
		КонецЕсли;
	Иначе
		Результат = ТекущееЗначение
	КонецЕсли;
	Возврат Результат
	
КонецФункции

//сохраняет значения полей (непредопределенных) в регистре настроек при закрытии формы
Процедура СохранитьЗначениеВНастройкахПользователя(ИмяПоля, ИмяОбъекта, Значение, ОписаниеТипов, ДобавлятьВПрофили = Ложь) Экспорт
	
	ПолноеИмя = ИмяОбъекта + "." + ИмяПоля;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//запрос на получение данных из ПВХ из списка полей
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПользователей.Наименование,
	|	НастройкиПользователей.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Наименование = &Наименование
	|	И НастройкиПользователей.ВидНастройки = &ЗначениеПоля";
	Запрос.УстановитьПараметр("ЗначениеПоля",	Перечисления.уб_ВидыНастроекПользователей.ЗначениеПоля);
	Запрос.УстановитьПараметр("Наименование",	ПолноеИмя);
	Выборка = Запрос.Выполнить().Выбрать();	
	ОбъектПолучен = Ложь;
	Если Выборка.Следующий() Тогда
		Если ОписаниеТипов.Типы().Количество() <> 0 Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Если Объект = Неопределено Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_temp.СохранитьЗначениеВНастройкахПользователя(): нет объекта по ссылке" + Выборка.Ссылка, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
				Возврат;
			Иначе
				Попытка
					Объект.ТипЗначения = ОписаниеТипов;
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_temp.СохранитьЗначениеВНастройкахПользователя(): " + ОписаниеОшибки() + ". Полное имя поля: " + ПолноеИмя, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
					Возврат
				КонецПопытки;
				ОбъектПолучен = Истина;
			КонецЕсли;
		Иначе
			Ссылка = Выборка.Ссылка
		КонецЕсли;
	Иначе
		Объект = ПланыВидовХарактеристик.НастройкиПользователей.СоздатьЭлемент();
		Объект.Родитель				= ПланыВидовХарактеристик.НастройкиПользователей.ЗначенияПолей;
		Объект.ВидНастройки			= Перечисления.уб_ВидыНастроекПользователей.ЗначениеПоля;
		Объект.ДобавлятьВПрофили	= ДобавлятьВПрофили;
		Объект.Наименование			= ПолноеИмя;
		ОбъектПолучен = Истина;
	КонецЕсли;
	Если ОбъектПолучен Тогда
		Попытка
			Объект.Записать();
			Ссылка = Объект.Ссылка;
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не записан элемент " + ПолноеИмя + "
			|СохранениеДанныхПолейВНастройках: " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;	
	Запись = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.Настройка	= Ссылка;
	Запись.Значение		= Значение;
	Запись.Записать();
	
КонецПроцедуры



//для получения настройки по пользователю или профилю, получает пользователя либо профиль
Функция ПолучитьПользователяИлиПрофиль(Настройка = Неопределено, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Профиль = ПараметрыСеанса.уб_ТекущийПрофиль;
	ИначеЕсли Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
		Профиль = ПараметрыСеанса.уб_ТекущийПрофиль;
	Иначе
		Профиль = Пользователь.Профиль;
	КонецЕсли;
	ПустойПрофиль = Справочники.уб_ПрофилиНастроекПользователей.ПустаяСсылка();
	
	ТипНастройки = ТипЗнч(Настройка);
	//Если Настройка = Неопределено Тогда
	Если ТипНастройки = Тип("Неопределено") Тогда
		Возврат ?(Профиль <> ПустойПрофиль, Профиль, Пользователь.Ссылка);
	Иначе
		Если ТипНастройки = Тип("Булево") Тогда
			ДобавлятьВПрофили = Настройка;
		ИначеЕсли ТипНастройки = Тип("ПланВидовХарактеристикСсылка.НастройкиПользователей") Тогда
			ДобавлятьВПрофили = Настройка.ДобавлятьВПрофили;
		ИначеЕсли ТипНастройки = Тип("Строка") Тогда
			ДобавлятьВПрофили = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ДобавлятьВПрофили;
		Иначе
			ДобавлятьВПрофили = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ДобавлятьВПрофили Тогда
		Возврат ?(Профиль <> ПустойПрофиль, Профиль, Пользователь.Ссылка);
	Иначе
		Возврат Пользователь.Ссылка;
	КонецЕсли;
	
КонецФункции // ПолучитьПользователяИлиПрофиль()

//
Процедура ПроверитьНезаполненныеКонстанты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уб_Константы.Ссылка,
	|	уб_Константы.ЗначениеКонстанты
	|ИЗ
	|	Справочник.уб_Константы КАК уб_Константы
	|ГДЕ
	|	НЕ уб_Константы.ЭтоГруппа
	|	И уб_Константы.Предопределенный";
	Выборка = Запрос.Выполнить().Выбрать();
	СЗ = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеНеЗаполнено(Выборка.ЗначениеКонстанты) Тогда
			СЗ.Добавить(Выборка.Ссылка)
		КонецЕсли;
	КонецЦикла;
	Если СЗ.Количество() > 0 Тогда
		//открываем форму списка констант с отбором по незаполненным
		ФС = Справочники.уб_Константы.ПолучитьФормуСписка();
		ОтборСсылка = ФС.СправочникСписок.Отбор.Ссылка;
		ОтборСсылка.Использование 	= Истина;
		ОтборСсылка.ВидСравнения	= ВидСравнения.ВСписке;
		ОтборСсылка.Значение		= СЗ;
		ФС.Заголовок = ФС.Заголовок + ": Не заполненные константы";
		ФС.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
		Если Не ФС.Открыта() Тогда
			ФС.Открыть()
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПервоначальныеДанныеСистемы(ПервыйЗапуск) Экспорт
	
	Форма = ПолучитьОбщуюФорму("уб_ФормаКонстантСтраховойБрокер");
	Форма.ПервыйЗапуск = ПервыйЗапуск;
	Форма.Открыть();
	
КонецПроцедуры

//записывает в параметр сеанса флаг об успешности инициализации компоненты падежей
Процедура ИнициализацияКомпонентыПадежей(Сообщить = Ложь) Экспорт
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьКомпонентуСклоненияПадежей = Истина Тогда
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			//Попытка инициализировать на клиенте, иначе на сервере не получится в любом случае
			Попытка
				Компонента = Новый COMОбъект("Padeg.Declension");
				ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована = Истина;
				#Если Клиент Тогда
					Если Сообщить Тогда
						Предупреждение("Компонента падежей инициализирована.")
					КонецЕсли;
				#КонецЕсли
			Исключение
				//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось подключить компоненту склонения для ФИО", ?(Сообщить, "Предупреждение", "НеСообщать"),Истина,,,,"Не удалось подключить компоненту Padeg: " + ОписаниеОшибки());
				ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована = Ложь;
			КонецПопытки;
		Иначе
			//отключаем
			уб_ВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьКомпонентуСклоненияПадежей", Ложь);
			ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована = Ложь;
		КонецЕсли;
	Иначе
		ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована = Ложь
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокПодобныхБСО(СК, ВидБСО, НомерБСО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДБ.НомерБСО
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			,
	|			ВидБСО = &ВидБСО
	|				И НомерБСО ПОДОБНО &НомерБСО
	|				И СК = &СК) КАК ДБ";
	Запрос.УстановитьПараметр("СК",			СК);
	Запрос.УстановитьПараметр("ВидБСО",		ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО",   "%" + НомерБСО + "%");
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерБСО"));
	Возврат Список;
	
КонецФункции // НайтиНомерБСО()

Процедура ПолучитьИнтерфейсы(ОсновнойИнтерфейс = Неопределено) Экспорт
	
	#Если Клиент Тогда
		
		Если ОсновнойИнтерфейс = Неопределено Тогда	
			ОсновнойИнтерфейс = ПользователиИнформационнойБазы.ТекущийПользователь().ОсновнойИнтерфейс;
			Если ОсновнойИнтерфейс = Неопределено Тогда	
				Возврат;
			КонецЕсли;
		КонецЕсли;		
		ИмяОсновнойИнтерфейс 	= ОсновнойИнтерфейс.Имя;	
		ИменаИнтерфейсов 		= ИмяОсновнойИнтерфейс;	
		
		Если ПолучитьПредопределеннуюНастройкуПользователя("ПоказыватьОперации", Ложь) Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ", Операции";
		КонецЕсли;
		
		Если ПолучитьПредопределеннуюНастройкуПользователя("Показывать меню справочники", Ложь) Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ", уб_Справочники";
		КонецЕсли;
		
		
		Если ПолучитьПредопределеннуюНастройкуПользователя("Показывать меню документы", Ложь) Тогда
			Если уб_КЭШируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
				ИменаИнтерфейсов = ИменаИнтерфейсов + ", уб_ДокументыМенеджера";
			Иначе	
				ИменаИнтерфейсов = ИменаИнтерфейсов + ", уб_Документы";
			КонецЕсли;	
		КонецЕсли;
		
		Если ПолучитьПредопределеннуюНастройкуПользователя("Показывать меню отчеты", Ложь) Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ", уб_Отчеты";
		КонецЕсли;
		
		
		//Если ПолучитьПредопределеннуюНастройкуПользователя("ПоказыватьОбработки", Ложь) Тогда
		//	ИменаИнтерфейсов = ИменаИнтерфейсов + ", Обработки";
		//КонецЕсли;
		
		
		
		Если уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ЗП_Ограниченно,уб_Мотивация_ОП";
		Иначе	
			
			
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.УправлениеМотивациейОтделаПродаж, Ложь) Тогда
				ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_Мотивация_ОП";
			КонецЕсли;	
			//Если ПравоДоступа("Использование", Метаданные.Интерфейсы.уб_ЗП_Внешняя) Тогда
			//	ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ЗП_Внешняя";
			//Иначе
				Если ПравоДоступа("Использование", Метаданные.Интерфейсы.уб_ЗП_ВСЕМ) Тогда
				//Если ПараметрыСеанса.уб_Константы.ЭтоМастер Тогда
				//Иначе	
					ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ЗП_ВСЕМ";
				//КонецЕсли;
			КонецЕсли;
			
			
			
			
			//Если ПараметрыСеанса.уб_Константы.ЭтоМастерРуководитель Тогда
			//	Если ПравоДоступа("Использование", Метаданные.Интерфейсы.уб_ЗП_МастерОтчетность) Тогда
			//		ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ЗП_МастерОтчетность";
			//	КонецЕсли;
			//КонецЕсли;
			
			//Если ПараметрыСеанса.уб_Константы.ЭтоМастер Тогда
			//	Если ПравоДоступа("Использование", Метаданные.Интерфейсы.уб_ЗП_Мастер) Тогда
			//		
			//		ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ЗП_Мастер";
			//		
			//	КонецЕсли;
			//КонецЕсли;
 	
			//Если ПравоДоступа("Использование", Метаданные.Интерфейсы.уб_ДопКурьер) И уб_КЭШируемые.ДоступностьРоли("уб_КурьерСПечатью") Тогда
			//	ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ДопКурьер";
			//КонецЕсли;
		КонецЕсли;	
		Если уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.АнализРасчетовСПоставщиками, Ложь) Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ",уб_ВзаиморасчетыСПоставщиками";
		КонецЕсли;
		
		Если ПолучитьПредопределеннуюНастройкуПользователя("ПоказыватьСервис", Ложь) или Строка(ПараметрыСеанса.ТекущийПользователь)="Третьяков Роман" Тогда
			ИменаИнтерфейсов = ИменаИнтерфейсов + ", Сервис";
		КонецЕсли;

		//Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") 
		//	Или (ПравоДоступа("Использование",Метаданные.Интерфейсы.уб_B2B) 
		//	и ПолучитьПредопределеннуюНастройкуПользователя("ПравоНаB2B", Ложь) = Истина) Тогда
		//	ИменаИнтерфейсов = ИменаИнтерфейсов + ", уб_B2B";
		//КонецЕсли;
		
		//для добавления действий куратору выездных специалистов (основная роль - менеджер на точке)
		
		ГлавныйИнтерфейс.ПереключитьИнтерфейс(ИменаИнтерфейсов);
	#КонецЕсли
	
КонецПроцедуры

//получает список оргагентов для поставщика по активным договорам
Функция СписокОргагентовДляПоставщика(Поставщик, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата()
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДК.Организация КАК ОрганизацияАгент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|ГДЕ
	|	ДК.Владелец = &Поставщик
	|	И НЕ ДК.ПометкаУдаления
	|	И ДК.ДатаЗаключенияДоговора >= &Дата
	|	И (ДК.ДатаОкончанияДействияДоговора <= &Дата
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора ЕСТЬ NULL 
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора = &ПустаяДата)";
	Запрос.УстановитьПараметр("Поставщик", 	Поставщик);
	Запрос.УстановитьПараметр("Дата",		Дата);
	Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОрганизацияАгент"));
	Возврат СЗ;
	
КонецФункции // СписокОргагентовДляПоставщика()

//модуль числа
Функция ЧислоПоМодулю(Число) Экспорт
	
	Возврат Макс(Число, - Число);
	
КонецФункции // ЧислоПоМодулю()

//проверяет на битые ссылки измерения "Объект" РС уб_Предоставленные документы 
Процедура ПроверкаПустыхСсылокВПредоставленныхДокументах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уб_ПредоставленныеДокументыСП.Объект,
	|	уб_ПредоставленныеДокументыСП.ВидДокумента
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК уб_ПредоставленныеДокументыСП
	|ГДЕ
	|	(уб_ПредоставленныеДокументыСП.Объект.Ссылка ЕСТЬ NULL
	|			ИЛИ уб_ПредоставленныеДокументыСП.ВидДокумента = ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.ПустаяСсылка))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ЗаписатьОшибкуИСообщить("В регистре сведений уб_ПредоставленныеДокументы у измерения 'Объект' битая ссылка: " + Выборка.Объект, "НеСообщать", Истина);
		МенеджерЗаписи = РегистрыСведений.уб_ПредоставленныеДокументыСП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Выборка.Объект;
		МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////
// ОБЩЕЕ ДЛЯ ТЧ БСО ДОКУМЕНТОВ

#Если Клиент Тогда
	Функция ЕстьСтруктураБСО(СтруктураБСО, Строка) Экспорт
		
		Возврат СтруктураБСО.НомернойУчет И НЕ СтруктураБСО.Существует И СокрЛП(Строка.НомерБСО) <> ""
		
	КонецФункции // ЕстьСтруктураБСО()
	
	Функция ДатаАктуальностиОбъекта(Объект, НаДатуДокумента = Истина) Экспорт
		
		Если НаДатуДокумента Тогда
			Если Объект.ЭтоНовый() Тогда
				Результат = ТекущаяДата()
			Иначе	
				Результат = Объект.МоментВремени().Дата;
			КонецЕсли;
			//Если Ссылка.Пустая() Тогда
			//	Результат = ТекущаяДата()
			//Иначе
			//	Результат = Ссылка.МоментВремени().Дата
			//КонецЕсли;
		Иначе
			Результат = ТекущаяДата()
		КонецЕсли;
		Возврат Результат;
		
	КонецФункции // ДатаАктуальности()
	
	Функция ПолучитьСКДляЗаполнения(
		ИмяДокумента, 
		Поставщик, 
		ВернутьКакСписок 	= Ложь, 
		ПерваяСК 			= Неопределено, 
		НаДату 				= Неопределено
		) Экспорт
		
		//получаем список СК по документам для выбранного поставщика
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СК КАК СК
		|ИЗ
		|	Документ." + ИмяДокумента + ".БСО КАК Док
		|ГДЕ
		|	Док.Ссылка.Поставщик = &Поставщик
		|	И Док.Ссылка.Проведен";
		Запрос.УстановитьПараметр("Поставщик", 	Поставщик);
		Если НаДату <> Неопределено Тогда
			//период актуальности - 1 год от даты документа (или текущей даты)
			Запрос.Текст = Запрос.Текст + "
			|	И Док.Ссылка.Дата > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -12)";
			Запрос.УстановитьПараметр("Дата", НаДату);
		КонецЕсли;
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СК");
		ПерваяСК = ?(Массив.Количество() > 0, Массив[0], Неопределено);
		Если ВернутьКакСписок Тогда
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(Массив);
			Возврат СписокЗначений;	
		Иначе		
			Возврат ПерваяСК;	
		КонецЕсли;	
		
	КонецФункции // ПолучитьСКДляЗаполнения()
	
	Функция ПроверитьНомерБСОНаДубли(БСО, СтруктураПоиска, НомерСтроки) Экспорт
		
		НайденныеСтроки = БСО.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаМ Из НайденныеСтроки Цикл
			Если СтрокаМ.НомерСтроки <> НомерСтроки Тогда
				Возврат Истина
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь
		
	КонецФункции
	
	Процедура СписокВыбораНомерБСО(Форма, Очистить = Ложь) Экспорт
		
		ЭУ = Форма.ТекущийЭлемент.ТекущаяКолонка.ЭлементУправления;
		Если Очистить Тогда
			ЭУ.КнопкаСпискаВыбора = Ложь;
			Возврат;
		КонецЕсли;
		ТекСтрока = Форма.ЭлементыФормы.БСО.ТекущаяСтрока;
		Попытка
			СК = ТекСтрока.СК
		Исключение
			СК = Форма.СК;
			ЭУ.КнопкаСпискаВыбора	= Ложь;
			Возврат;
		КонецПопытки;
		//СК = ?(ТекСтрока.Найти("СК") = Неопределено, Форма.СК, ТекСтрока.СК); 
		Если СК.Пустая() Или ТекСтрока.ВидБСО.Пустая() Или ПустаяСтрока(ТекСтрока.НомерБСО) Тогда
			ЭУ.КнопкаСпискаВыбора = Ложь;
		Иначе
			СписокНомеров = ПолучитьСписокПодобныхБСО(ТекСтрока.СК, ТекСтрока.ВидБСО, ТекСтрока.НомерБСО);
			//TODO заменить 21 на константу
			Если СписокНомеров.Количество() > 0 И СписокНомеров.Количество() < 21 Тогда
				ЭУ.СписокВыбора			= СписокНомеров;
				ЭУ.КнопкаСпискаВыбора 	= Истина;
			Иначе
				ЭУ.КнопкаСпискаВыбора	= Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры
	
	//у страхового полиса - частная процедура обработки активизации ячейки БСО
	Процедура ПриАктивизацииЯчейкиБСО(Форма) Экспорт
		
		ТекЭлемент 		= Форма.ТекущийЭлемент;
		эфБСО   		= Форма.ЭлементыФормы.БСО;
		Если Не Форма.Проведен И ТекЭлемент = эфБСО Тогда
			ТекСтрока 	= эфБСО.ТекущаяСтрока;
			Если ТекСтрока <> Неопределено Тогда
				ТекКолонка 		= эфБСО.ТекущаяКолонка;
				Колонки			= эфБСО.Колонки;
				МетаданныеИмя	= Форма.Ссылка.Метаданные().Имя;
				Если ТекКолонка = Колонки.НомерБСО Тогда
					СтруктураБСО = Форма.ПрочитатьТекущееСостояниеБСО(ТекСтрока); //TODO ПрочитатьТекущееСостояние в общий модуль
					СписокВыбораНомерБСО(Форма, СтруктураБСО = Неопределено Или Не ЕстьСтруктураБСО(СтруктураБСО, ТекСтрока))
				ИначеЕсли ТекКолонка = Колонки.ВидБСО Тогда
					ЭУ = Форма.ТекущийЭлемент.ТекущаяКолонка.ЭлементУправления;
					ЭУ.СписокВыбора = уб_СЛ.ПолучитьСписокВидовБСО(ТекСтрока.СК, Форма.Дата,,,Истина);
					ЭУ.КнопкаСпискаВыбора = ЭУ.СписокВыбора.Количество();
					ЭУ.КнопкаВыбора = Истина;
					ЭУ.ВысотаСпискаВыбора = 20;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура УстановитьАктивностьПоляВКолонке(Колонка, Активность)
		
		Колонка.ТолькоПросмотр = Не Активность;	
		Эу = Колонка.ЭлементУправления;
		Эу.ТолькоПросмотр 	= Не Активность;	
		Эу.Доступность 		= Активность;	
		Эу.КнопкаВыбора 	= Активность;	
		Эу.КнопкаОчистки 	= Активность;
		
	КонецПроцедуры
	
	Процедура ПроверитьОткрытиеИзДругойФормы(Форма, Параметр) Экспорт
		
		БСО = Форма.БСО;
		эфБСО = Форма.ЭлементыФормы.БСО;
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			НайденныеСтроки = БСО.НайтиСтроки(Параметр);
			Если НайденныеСтроки.Количество() = 1 Тогда
				эфБСО.ТекущаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			Параметр = Неопределено;
		КонецЕсли;
		Форма.Активизировать();
	КонецПроцедуры
	
	Процедура УстановитьДоступностьЭлементовФормы2(ЭлементыФормы, Доступность, Общая = Истина) Экспорт
		
		ЭлементыФормы.ДействияФормы.Кнопки.ПодменюДействия.Кнопки.ПодменюУстановитьВремя.Кнопки.дУстановитьВремя.Доступность = Доступность; 
		Если Общая Тогда
			уб_СтраховойБрокер.УстановитьДоступностьЭлементовФормы(ЭлементыФормы, Доступность)
		КонецЕсли;
		
	КонецПроцедуры
	
	
	Процедура ДобавитьСтрокуБСО(Форма, СКДляЗаполнения) Экспорт
		
		ЭлементыФормы = Форма.ЭлементыФормы;
		СтрокаБСО = Форма.БСО.Добавить();
		СтрокаБСО.СК = СКДляЗаполнения;
		ЭлементыФормы.БСО.ТекущаяСтрока 	= СтрокаБСО;
		ЭлементыФормы.БСО.ТекущаяКолонка  	= ?(СКДляЗаполнения = Неопределено, ЭлементыФормы.БСО.Колонки.СК, ЭлементыФормы.БСО.Колонки.ВидБСО);
		
	КонецПроцедуры
	
	Процедура УдалитьСтарыеКнопкиПоУмолчанию(Форма, ОсновныеДействияФормы)
		
		ТабПФ = Форма.ТабПФ;
		КоличествоСтрок = ТабПФ.Количество();
		Для Счетчик = 1 По КоличествоСтрок Цикл
			СтрокаТЗ = ТабПФ[КоличествоСтрок - Счетчик];
			Если СтрокаТЗ.ПоУмолчанию = Истина Или СтрокаТЗ.СсылкаПФ = Неопределено Тогда
				Элемент = ОсновныеДействияФормы.Кнопки.Найти(СтрокаТЗ.КодПФ);
				Если Элемент <> Неопределено Тогда
					ОсновныеДействияФормы.Кнопки.Удалить(Элемент);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
	
	//устанавливает кнопки печати, печати по умолчанию и формирует значения экспортных переменных печати формы
	//Форма 	- ЭтаФорма
	//Ссылка    - устанавливается вручную при использовании ПолучитьСсылкуНового(), например
	//ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля - Истина - при использовании справочника печатных форм с помощью универсального запроса, Ложь - из модуля объекта формы
	Процедура УстановитьКнопкиПечати(
		Форма,
		Ссылка										= Неопределено,
		ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля = Истина,
		УстановитьПодменюПечати                     = Истина,
		УстановитьПечатьПоУмолчанию					= Истина,
		ИмяНадписиАвтор								= "НадписьАвтор",
		ДобавлятьСубагентскиеПФ						= Ложь
		) Экспорт
		
		ОсновныеДействияФормы	= Форма.ЭлементыФормы.ОсновныеДействияФормы;
		Объект					= Форма.ЭтотОбъект;
		Если Ссылка = Неопределено Тогда
			Ссылка = Объект.Ссылка;
		КонецЕсли;
		//+расчет количества кнопок по умолчанию
		ШиринаОсновныхКнопокДокумента = 200;//Ширинка кнопок (Печать|Ок|Записать|Закрыть)
		ШиринаОднойКнопкиПоУмолчанию  = 100;
		ЭлементНадписьАвтор = Форма.ЭлементыФормы.Найти(ИмяНадписиАвтор);
		Если ЭлементНадписьАвтор <> Неопределено Тогда
			ШиринаНадписиАвтора = ЭлементНадписьАвтор.Ширина;
		Иначе
			ШиринаНадписиАвтора = 0;
		КонецЕсли;
		ШиринаДопЭлементов = 0;
		МаксимальноеКоличествоКнопокПоУмолчанию = Цел((Форма.Ширина - ШиринаНадписиАвтора - ШиринаОсновныхКнопокДокумента - ШиринаДопЭлементов) / ШиринаОднойКнопкиПоУмолчанию);
		МаксимальноеКоличествоКнопокПоУмолчанию = Макс(МаксимальноеКоличествоКнопокПоУмолчанию, 1);
		//-расчет количества кнопок по умолчанию
		Если МаксимальноеКоличествоКнопокПоУмолчанию > 1 И Форма.ТабПФ <> Неопределено Тогда
			УдалитьСтарыеКнопкиПоУмолчанию(Форма, ОсновныеДействияФормы);
		КонецЕсли;
		//Форма.ТабПФ = ?(ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля, уб_ПФ.ПолучитьСтруктуруПечатныхФорм(Объект), Форма.ПолучитьСтруктуруПечатныхФорм());
		Если ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля Тогда
			Форма.ТабПФ = уб_ПФ.ПолучитьСтруктуруПечатныхФорм(Объект,, ДобавлятьСубагентскиеПФ);
		Иначе
			Форма.ТабПФ = Форма.ПолучитьСтруктуруПечатныхФорм();
		КонецЕсли;
		Форма.мДеревоМакетов = РаботаСДиалогами.ПолучитьДеревоМакетовПечати(Ссылка, Форма.ТабПФ, Новый Действие("ОсновныеДействияФормыПечать"), Новый Действие("ОсновныеДействияФормыУстановитьПечатьПоУмолчанию"), Не МаксимальноеКоличествоКнопокПоУмолчанию > 1);
		Для каждого СтрокаДерева из Форма.мДеревоМакетов.Строки Цикл
			Если СтрокаДерева.ТипКнопки = ТипКнопкиКоманднойПанели.Действие Тогда
				Если Форма.ТабПФ.НайтиСтроки(Новый Структура("КодПФ",СтрокаДерева.Имя)).Количество() = 0 Тогда
					 //СтрТабПФ = Форма.ТабПФ.Добавить();
					 //СтрТабПФ.КодПФ			= СтрокаДерева.Имя;
					 //СтрТабПФ.Наименование	= СтрокаДерева.Текст;
					 //СтрТабПФ.ПоУмолчанию = Истина;
					 //СтрТабПФ.Действовала = Ложь;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
		Если УстановитьПодменюПечати Тогда
			//проверяем есть ли уже созданная кнопка печати по умолчанию для правильного расположения подменю и печати по умолчанию
			РаботаСДиалогами.УстановитьПодменюПечати(Форма.мПодменюПечати, ОсновныеДействияФормы, Форма.мДеревоМакетов.Строки.Количество() > 0);
			Если Форма.мПодменюПечати <> Неопределено Тогда
				РаботаСДиалогами.СформироватьПодменю(Форма.мДеревоМакетов, Форма.мПодменюПечати, Истина, Истина, Не МаксимальноеКоличествоКнопокПоУмолчанию > 1);
			КонецЕсли;
		Иначе
			//удаляем подменю если есть
			Кнопки = ОсновныеДействияФормы.Кнопки;
			Кнопка = КнопкаПечатиИзКнопокКП(Кнопки, "Подменю");
			Если Кнопка <> Неопределено Тогда
				Индекс = Кнопки.Индекс(Кнопка);
				Кнопки.Удалить(Индекс);
				//удаляем связанный разделитель
				Если Кнопки[Индекс].ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель Тогда
					Кнопки.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
			Форма.мПодменюПечати = Неопределено;
		КонецЕсли;
		Если УстановитьПечатьПоУмолчанию Тогда
			Если МаксимальноеКоличествоКнопокПоУмолчанию > 1 Тогда
				РаботаСДиалогами.УстановитьКнопкиПечатьПоУмолчанию(ОсновныеДействияФормы, Форма.мДеревоМакетов, Объект.Метаданные().Имя, Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию"), МаксимальноеКоличествоКнопокПоУмолчанию, Форма);
			Иначе
				РаботаСДиалогами.УстановитьПечатьПоУмолчанию(Форма.мПечатьПоУмолчанию, ОсновныеДействияФормы, Форма.мДеревоМакетов, Объект.Метаданные().Имя, Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию"));
			КонецЕсли;
		Иначе
			//удаляем печать по умолчанию если есть
			Кнопки = ОсновныеДействияФормы.Кнопки;
			Кнопка = КнопкаПечатиИзКнопокКП(Кнопки, "ПоУмолчанию");
			Если Кнопка <> Неопределено Тогда
				Индекс = Кнопки.Индекс(Кнопка);
				Кнопки.Удалить(Индекс);
				//удаляем связанный разделитель
				Если Кнопки[Индекс].ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель Тогда
					Кнопки.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры
	
//чкн
// подбор номерных БСО

Процедура ПодборНомерныхБСО(Форма, СтрокаТЧ = Неопределено, Параметры) Экспорт
	
	ЭлементыФормы = Форма.ЭлементыФормы;
	ФормаВыбора = ПолучитьОбщуюФорму("уб_ПодборБСО", ЭлементыФормы.БСО);
	ОтображаемыеКолонки = Новый СписокЗначений;
	ОтображаемыеКолонки.Добавить("СостояниеБСО");	
	ОтображаемыеКолонки.Добавить("НомерПолиса");	
	ОтображаемыеКолонки.Добавить("Агент");	
	ОтображаемыеКолонки.Добавить("ПоложениеБСО");	
	ОтображаемыеКолонки.Добавить("Блокировка");	
	ОтображаемыеКолонки.Добавить("Поставщик");	
	ОтображаемыеКолонки.Добавить("ОрганизацияАгент");			
	НаМомент = ЭлементыФормы.Дата;
	СписокПоложений = ПолучитьСписокДоступныхПоложений();
	Параметры.Вставить("НаМомент", НаМомент);
	Параметры.Вставить("ПоложениеБСО", СписокПоложений);
	Если Параметры.Свойство("СостояниеБСО") тогда
		СписокСостояний = СписокДоступныхСостояний();
		Параметры.Вставить("СостояниеБСО", СписокСостояний);
	КонецЕсли;
	Если Параметры.Свойство("Агент") тогда
		Агент = ЭлементыФормы.Агент;
		Параметры.Вставить("Агент", Агент);
	КонецЕсли;	
	
	Если СтрокаТЧ = Неопределено Тогда
		Если ЭлементыФормы.Найти("СКДляЗаполнения") = Неопределено тогда
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ОткрыватьФормуВыбораСКВВПеремещенииБСО", Ложь) Тогда
				ФвСК = ПолучитьОбщуюФорму("уб_ФормаВыбораСК");
				ФвСК.ОткрытьМодально();
				СК = ФвСК.СК;
				Если ЗначениеЗаполнено(СК) Тогда
					Параметры.Вставить("СК", СК);
				КонецЕсли;
			КонецЕсли;
			Параметры.Вставить("МножественныйВыбор", Истина);
		Иначе
			Если Не ЭлементыФормы.СКДляЗаполнения.Пустая() Тогда
				СК = ЭлементыФормы.СКДляЗаполнения
			ИначеЕсли уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ОткрыватьФормуВыбораСКВВПеремещенииБСО", Ложь) Тогда
				ФвСК = ПолучитьОбщуюФорму("уб_ФормаВыбораСК");
				ФвСК.ОткрытьМодально();
				СК = ФвСК.СК;
			КонецЕсли;
			Если ЗначениеЗаполнено(СК) Тогда
				Параметры.Вставить("СК", СК);
			КонецЕсли;
			Параметры.Вставить("МножественныйВыбор", Истина);
		КонецЕсли;
	Иначе
		Параметры.Вставить("СК", СтрокаТЧ.СК);
		ТекКолонка = ЭлементыФормы.БСО.ТекущаяКолонка;
		УстанавливатьПараметрВидБСО = Истина;
		Если ЭлементыФормы.БСО.Колонки.Найти("НомерПолиса") = Неопределено тогда
			Параметры.Вставить("СК", 					СтрокаТЧ.СК);
			Параметры.Вставить("ВидБСО",    			СтрокаТЧ.ВидБСО);
			Параметры.Вставить("ТекНомерБСО",			СтрокаТЧ.НомерБСО);
			Параметры.Вставить("МножественныйВыбор", 	Ложь);
		Иначе
			Если ТекКолонка <> ЭлементыФормы.БСО.Колонки.НомерПолиса Тогда
				Если ПустаяСтрока(СтрокаТЧ.НомерПолиса) Тогда
					ТекНомерБСО = СтрокаТЧ.НомерБСО;
				Иначе
					ТекНомерБСО = СтрокаТЧ.НомерПолиса;
					УстанавливатьПараметрВидБСО = Ложь;
				КонецЕсли;
			Иначе
				ТекНомерБСО = СтрокаТЧ.НомерБСО
			КонецЕсли;
			Если УстанавливатьПараметрВидБСО Тогда
				Параметры.Вставить("ВидБСО", СтрокаТЧ.ВидБСО)
			КонецЕсли;
			Параметры.Вставить("ТекНомерБСО", ТекНомерБСО);
			Параметры.Вставить("МножественныйВыбор", Ложь);
		КонецЕсли;
	КонецЕсли;
	Параметры.Вставить("ОтображаемыеКолонки", ОтображаемыеКолонки);
	ФормаВыбора.Параметры = Параметры;
	ФормаВыбора.Открыть();
		
КонецПроцедуры

Функция ПолучитьСписокДоступныхПоложений() Экспорт 

	СписокПоложений = Новый СписокЗначений;
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПолученИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенСТочки);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.Списан);
	
	//SS DEBUG (на время заполнения документов и востановления ДО)
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПереданНаТочку);
	
	Возврат СписокПоложений;
	
КонецФункции

//возвращает рекомендуемые состояния БСО, которые могут быть перемещены
//TODO сделать запрос и проверить
//также и при возврате
Функция СписокДоступныхСостояний()

	Прч = Перечисления.уб_СостоянияБСО;
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ПустойБланк);
	СЗ.Добавить(Прч.НеиспользованныйБланк);
	Возврат СЗ;

КонецФункции // СписокСостояний()

//чкн
	
#КонецЕсли

Функция ПолучитьТЗСерийПоступленияБСО(СК, Реквизит) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПБ." + Реквизит + " КАК Поле,
	|	ПБ.ВидБСО
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК ПБ
	|ГДЕ
	|	ПБ.Ссылка.Поставщик = &СК
	|	И ПБ." + Реквизит + " <> """"");
	Запрос.УстановитьПараметр("СК", СК);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьСписокСерий()

//функция возвращает последнее движение по виду и номеру БСО регистра сведений Движения БСО
//исключая страховые полисы и приемки оплат (для определения даты актуальности страхового полиса
//и оплаты полисов, чтобы БСО либо квитанция А7 соответственно делали движения корректной датой
Функция ПолучитьДатуПоследнегоДвижения(ВидБСО, НомерБСО,Агент = Неопределено) Экспорт
	
	Если ПустаяСтрока(НомерБСО) Или ВидБСО.Пустая() Тогда
		Возврат Неопределено
	КонецЕсли;
	Запрос = Новый Запрос;
	Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(ВидБСО) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДБ.Период КАК Период,
		|	ДБ.Агент
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПервых(
		|			,
		|			ВидБСО = &ВидБСО
		|				И НомерБСО = &НомерБСО
		|				И Регистратор ССЫЛКА Документ.уб_ПриемкаОплат
		|				) КАК ДБ";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДБ.Период КАК Период,
		|	ДБ.Агент
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
		|			,
		|			ВидБСО = &ВидБСО
		|				И НомерБСО = &НомерБСО
		|				И Регистратор ССЫЛКА Документ.уб_ПеремещениеБСО
		|				) КАК ДБ";
	КонецЕсли;
	Запрос.УстановитьПараметр("НомерБСО", 	НомерБСО);
	Запрос.УстановитьПараметр("ВидБСО",		ВидБСО);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Агент = Выборка.Агент;
		Возврат Выборка.Период
	КонецЕсли;
	
КонецФункции // ДатаДвижения()

////возвращает квитанцию А7 для СК. Если их больше 1, возвращает первую попавшуюся TODO подумат ьесли их больше одной
//Функция КвитанцияА7ПоСК(СК, Знач Дата = Неопределено) Экспорт

//	Результат = Справочники.уб_ВидыБСО.ПустаяСсылка();
//	Если Не СК.Пустая() Тогда
//		Если Дата = Неопределено Тогда
//			Дата = ТекущаяДата();
//		КонецЕсли;
//		Запрос = Новый Запрос(
//		"ВЫБРАТЬ
//		|	ВБ.Ссылка
//		|ИЗ
//		|	Справочник.уб_ВидыБСО КАК ВБ
//		|ГДЕ
//		|	ВБ.Владелец = &СК
//		|	И ВБ.Тип = &КвитанцияА7
//		|	И (ВБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//		|			ИЛИ ВБ.ДатаОкончанияДействия > &Дата)");
//		Запрос.УстановитьПараметр("СК", 			СК);
//		Запрос.УстановитьПараметр("КвитанцияА7",    Перечисления.уб_ТипыБСО.КвитанцияА7);
//		Запрос.УстановитьПараметр("Дата",			Дата);
//		РезультатЗапроса = Запрос.Выполнить();
//		Если Не РезультатЗапроса.Пустой() Тогда
//			Выборка = РезультатЗапроса.Выбрать();
//			Выборка.Следующий();
//			Результат = Выборка.Ссылка;
//			Если Выборка.Следующий() Тогда
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Несколько видов БСО типа 'Квитанция А7' по СК '" + СК + "'", "НеСообщать", Истина);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Результат

//КонецФункции // КвитанцияА7ПоСК()

Функция СписокИменМетаданных(ТипМетаданных) Экспорт
	
	СЗ = Новый СписокЗначений;
	Для Каждого Элемент Из Метаданные[ТипМетаданных] Цикл
		СЗ.Добавить(Элемент.Имя, Элемент.Синоним)
	КонецЦикла;
	Возврат СЗ;
	
КонецФункции // СписокИменМетаданных()

//записываем информацию в лог (при открытии форм с доступной справкой)
Процедура СоздатьЛогПользователя(ИсточникВызова, Запись) Экспорт
	
	//записываем информацию в лог
	Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
		Попытка
			ЗаписьТекста = Новый ЗаписьТекста(КаталогВременныхФайлов() + "loghelp.txt",,, Истина);
			ЗаписьТекста.ЗаписатьСтроку(Строка(ТекущаяДата()) + ", " + СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) + ", " + ИсточникВызова + ", " + ?(Запись, "Запись", "Открытие"));
			ЗаписьТекста.Закрыть();
		Исключение
			Сообщить(ОписаниеОшибки())
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#Если Клиент Тогда
//добавляет или удаляет кнопку командной панели
	//Кнопки - КоманднаяПанель.Кнопки
	//ИмяКнопки - строка
	//СтруктураЗаполнения - структура реквитов кнопки для заполнения нужных свойств.
	//Удалить - удалить кнопку
	//Перезаписывать - если кнопку надо создать и она уже создана и структура реквизитов не совпадает - перезаписать реквизиты
	//ТипУдаленияДоступность - вместо удаления убирает доступность кнопки
Процедура ДобавитьИлиУдалитьКнопкуПанели(
	Кнопки, 
	СтруктураЗаполнения,
	Удалить,
	СРазделителем			= Ложь,
	Перезаписывать 			= Ложь,
	ТипУдаленияДоступность	= Ложь
	) Экспорт
	
	ИмяКнопки = СтруктураЗаполнения.Имя;
	Кнопка = Кнопки.Найти(ИмяКнопки);
	Если Удалить Тогда
		СоздаватьКнопку = Ложь;
		Если Кнопка <> Неопределено Тогда
			Если ТипУдаленияДоступность Тогда
				//если подменю убираем доступность всех вложенных кнопок в иерархии
				ДоступностьКнопкиРекурсивно(Кнопка, Ложь)
			Иначе
				Индекс = Кнопки.Индекс(Кнопка);
				Кнопки.Удалить(Индекс);
				Если СРазделителем И Индекс > 0 Тогда
					//удаляем связанный разделитель
					Разделитель = Кнопки.Получить(Индекс - 1);
					Если Разделитель.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель Тогда
						Кнопки.Удалить(Индекс - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипУдаленияДоступность Тогда
			//создаем кнопку, и снимаем доступность
			СоздаватьКнопку = Истина;
		КонецЕсли;
	Иначе
		СоздаватьКнопку = Истина;
	КонецЕсли;
	Если СоздаватьКнопку Тогда
		Если Кнопка = Неопределено Тогда
			Если СРазделителем Тогда
				Кнопка = Кнопки.Добавить();
				Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Разделитель;
			КонецЕсли;
			Кнопка = Кнопки.Добавить();
			Если СтруктураЗаполнения.Свойство("Действие") И ТипЗнч(СтруктураЗаполнения.Действие) = Тип("Строка") Тогда
				СтруктураЗаполнения.Действие = Новый Действие(СтруктураЗаполнения.Действие);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Кнопка, СтруктураЗаполнения);
			Если ТипУдаленияДоступность И Удалить Тогда
				ДоступностьКнопкиРекурсивно(Кнопка, Ложь);
			КонецЕсли;
			Если СтруктураЗаполнения.Свойство("Кнопки") И ТипЗнч(СтруктураЗаполнения.Кнопки) = Тип("Массив") Тогда
				Для Каждого СтруктураЗаполненияВложеннойКнопки Из СтруктураЗаполнения.Кнопки Цикл
					ДобавитьИлиУдалитьКнопкуПанели(
						Кнопка.Кнопки, 
						СтруктураЗаполненияВложеннойКнопки, 
						Удалить,
						СРазделителем,
						Перезаписывать,
						ТипУдаленияДоступность
					);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если Перезаписывать Тогда
				//TODO для вложенных кнопок
				ЗаполнитьЗначенияСвойств(Кнопка, СтруктураЗаполнения)
			КонецЕсли;
			Если ТипУдаленияДоступность Тогда
				ДоступностьКнопкиРекурсивно(Кнопка, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры//ДобавитьИлиУдалитьКнопкуПанели
	
Процедура ДоступностьКнопкиРекурсивно(Кнопка, Доступность)
	
	Если Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие Тогда
		Кнопка.Доступность = Доступность;
	ИначеЕсли Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю Тогда
		Для Каждого КнопкаПодменю Из Кнопка.Кнопки Цикл
			ДоступностьКнопкиРекурсивно(КнопкаПодменю, Доступность)
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	
#КонецЕсли

//получает список поставщиков по документу поступления БСО
Функция СписокПоставщиков(
	Знач Дата		= Неопределено,
	Знач Период     = Неопределено,
	ТолькоАктивные 	= Истина, 
	КакМассив 		= Ложь
	) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СобственныйКонтрагент", ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент);
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПБ.Поставщик
	|ИЗ
	|	Документ.уб_ПоступлениеБСО КАК ПБ
	|ГДЕ
	|	ПБ.Поставщик <> &СобственныйКонтрагент
	|	И ПБ.Проведен";
	Если ТолькоАктивные Тогда
		ТекстЗапроса = ТекстЗапроса + " И ПБ.Поставщик.Родитель.Наименование <> ""НЕ АКТИВНЫЕ"""
	КонецЕсли;
	Если Дата <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " И ПБ.Дата <= &Дата";
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Дата = ТекущаяДата();
	КонецЕсли;
	Если Период <> Неопределено Тогда
		Период = Дата - (Период * 24 * 60 * 60);
		ТекстЗапроса = ТекстЗапроса + " И ПБ.Дата >= &Период";
		Запрос.УстановитьПараметр("Период", Период);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	ПБ.Поставщик.Наименование";
	Запрос.Текст = ТекстЗапроса;
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Поставщик");
	Если КакМассив Тогда
		Результат = Массив
	Иначе
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(Массив);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // СписокПоставщиков()

//TODO удалить (ииспользовать актуальную в оплате ФормаДокументаНовыйРежим
//Определяет наличие ограничения доступа для пользователя к передаваем ссылкам
//Функция ЕстьДоступПользователяКДанным(Ссылка1,Ссылка2=Неопределено,Ссылка3=Неопределено) Экспорт
//	Если РольДоступна("уб_МенеджерНаТочке") Тогда
//		//Менеджер может видеть только данные со своим участием
//		Если Ссылка1 = ПараметрыСеанса.уб_ТекущееФизЛицо 
//			ИЛИ ((НЕ Ссылка2=Неопределено) И Ссылка2 = ПараметрыСеанса.уб_ТекущееФизЛицо) 
//			ИЛИ ((НЕ Ссылка3=Неопределено) И Ссылка3 = ПараметрыСеанса.уб_ТекущееФизЛицо) 
//			Тогда
//		Иначе
//			Возврат Ложь;
//		КонецЕсли;	
//	ИначеЕсли РольДоступна("уб_СтаршийМенеджерНаТочке")И НЕ РольДоступна("ПолныеПрава")	Тогда
//		//Страший менеджер может видеть только данные с участием себя и своих подчиненных
//		СписокСотрудников = уб_Temp.ПолучитьСписокПодчиненныхРуководителя(ПараметрыСеанса.уб_ТекущееФизЛицо,,Истина);
//		Если СписокСотрудников.Найти(Ссылка1)= Неопределено 
//			И ((НЕ Ссылка2 = Неопределено) И СписокСотрудников.Найти(Ссылка2)= Неопределено )
//			И ((НЕ Ссылка3 = Неопределено) И СписокСотрудников.Найти(Ссылка3)= Неопределено )
//			Тогда
//			Возврат Ложь;
//		КонецЕсли;	
//	КонецЕсли;
//	Возврат Истина
//КонецФункции	

//возвращает Истина если переданный код - цифра или управляющий символ
//Код 		- код символа
//Вернуть19 - Истина - возвращает код символа, если цифра или управляющий символ, иначе - возвращает код 19. Ложь -  возвращает булево
Функция ЭтоЦифраИлиУправляющийСимволПоКоду(Код, Вернуть19 = Истина, Shift = 0, ЭтоВставкаТекста = Ложь) Экспорт
	
	Если Shift = 2 И Код = 86 Или //если нажат ctrl + V
		Shift = 1 И Код = 45 Тогда //если нажат shift + ins
		ЭтоВставкаТекста = Истина;
		Возврат Код;
	ИначеЕсли Shift = 2 И Код = 65 //если нажат ctrl + A
		Или Shift = 2 И Код = 67 Тогда //если нажат ctrl + C
		Возврат Код;
	КонецЕсли;
	
	МассивУправляющихСимволов = Новый Массив;
	МассивУправляющихСимволов.Добавить(8);//backspace
	МассивУправляющихСимволов.Добавить(9);//tab
	МассивУправляющихСимволов.Добавить(13);//enter
	МассивУправляющихСимволов.Добавить(16);//shift
	МассивУправляющихСимволов.Добавить(17);//ctrl
	МассивУправляющихСимволов.Добавить(35);//end
	МассивУправляющихСимволов.Добавить(36);//home
	МассивУправляющихСимволов.Добавить(37);//←
	МассивУправляющихСимволов.Добавить(38);//↑
	МассивУправляющихСимволов.Добавить(39);//→
	МассивУправляющихСимволов.Добавить(40);//↓
	МассивУправляющихСимволов.Добавить(45);//ins
	МассивУправляющихСимволов.Добавить(46);//del
	
	Если МассивУправляющихСимволов.Найти(Код) <> Неопределено Тогда
		Возврат Код;
	КонецЕсли;
	
	ЭтоЦифра = Не ((Код < 48 Или Код > 57) И (Код < 96 Или Код > 105));//И Код <> 8 И Код <> 13 И Код <> 9
	Если Вернуть19 Тогда
		Результат = ?(ЭтоЦифра, Код, 19);
	Иначе
		Результат = ЭтоЦифра;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ЭтоЧислоПоКоду()

//получает подменю печати или кнопку печати по умолчанию
//Кнопки - кнопки командной панели
//ТипРезультата. Неопределено - возвращает структурой, либо определить "Подменю" Или "ПоУмолчанию"
Функция КнопкаПечатиИзКнопокКП(Кнопки, ТипРезультата = Неопределено) Экспорт
	
	Если ТипРезультата = Неопределено Тогда
		ИскатьПодменю 		= Истина;
		ИскатьПоУмолчанию   = Истина;
		КнопкаПоУмолчанию	= Неопределено;
		КнопкаПодменю 		= Неопределено;
	ИначеЕсли ТипРезультата = "Подменю" Тогда
		ИскатьПодменю		= Истина;
		ИскатьПоУмолчанию	= Ложь;
		КнопкаПодменю 		= Неопределено;
	ИначеЕсли ТипРезультата = "ПоУмолчанию" Тогда
		ИскатьПодменю		= Ложь;
		ИскатьПоУмолчанию	= Истина;
		КнопкаПоУмолчанию	= Неопределено;
	КонецЕсли;
	Если ИскатьПодменю Или ИскатьПоУмолчанию Тогда
		Для Каждого Кнопка Из Кнопки Цикл
			Если ИскатьПодменю И Кнопка.Подсказка = "Меню выбора печатных форм" Тогда
				Если КнопкаПодменю = Неопределено Тогда
					КнопкаПодменю = Кнопка
				Иначе
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Дублирование подменю печати", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина)
				КонецЕсли;
				Если Не ИскатьПоУмолчанию Или КнопкаПоУмолчанию <> Неопределено Тогда
					Прервать
				КонецЕсли;
			КонецЕсли;
			Если ИскатьПоУмолчанию И Кнопка.Подсказка = "Печать по умолчанию" Тогда
				Если КнопкаПоУмолчанию = Неопределено Тогда
					КнопкаПоУмолчанию = Кнопка
				Иначе	
					//TODO проверить, сейчас несколько кнопок, и дублирование вполне нормально?	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Дублирование печати по умолчанию", "НеСообщать", Истина)
				КонецЕсли;
				Если Не ИскатьПодменю Или КнопкаПодменю <> Неопределено Тогда
					Прервать
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ТипРезультата = Неопределено Тогда
			//возвращаем структуру
			Результат = Новый Структура("Подменю, ПоУмолчанию", КнопкаПодменю, КнопкаПоУмолчанию)
		ИначеЕсли ТипРезультата = "Подменю" Тогда
			Результат = КнопкаПодменю
		ИначеЕсли ТипРезультата = "ПоУмолчанию" Тогда
			Результат = КнопкаПоУмолчанию
		КонецЕсли
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // КнопкаПечати()



//Процедура ОбработатьНажатиеСтрелок(Элемент, KeyCode, Shift, ЭтаФорма, ВернутьФокусВПоле) Экспорт
//	
//	KeyCodeValue = KeyCode.Value;
//	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
//	Если KeyCodeValue = 40 ИЛИ KeyCodeValue = 38 Тогда
//		//Вниз ИЛИ Вверх
//		Если ВернутьФокусВПоле = Неопределено Тогда
//			ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.СправочникСписок;
//			АвтоПеребросФокусаВвода = Истина;
//			ШелСкрипт = Новый COMОбъект("WScript.Shell");
//			ШелСкрипт.SendKeys(?(KeyCodeValue = 40,"{DOWN}","{UP}"));
//			ВернутьФокусВПоле = Элемент.Имя;
//			KeyCode.Value = 19;//Меняем на всякий случай;
//		Иначе
//			ВернутьФокусВПоле = Неопределено;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры


Процедура УстановкаПараметраСеансаВнешниеСервисы() Экспорт
	
	Структура = Новый Структура("ДоступенШлюзCRM, ДоступенСерверSVS, ДоступенСерверB2B", Ложь, Ложь, Ложь);
	
	Попытка//проверка 1 параметра
		//ЗаголовокHTTP = Новый Соответствие();
		//ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
		Сервер = "www.sluice";
		Порт = 80;
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		HTTP.Получить("", ПолучитьИмяВременногоФайла());
		Структура.ДоступенШлюзCRM = Истина;
	Исключение
	КонецПопытки;
	
	Попытка//проверка 2 параметра
		//Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		//ЗаголовокHTTP = Новый Соответствие();
		//ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary);
		Сервер = ПараметрыСеанса.уб_Константы.СерверB2B;
		Порт = ПараметрыСеанса.уб_Константы.Порт;
		НТТР = Новый HTTPСоединение(Сервер, Порт);
		HTTP.Получить("", ПолучитьИмяВременногоФайла());
		Структура.ДоступенСерверB2B = Истина;
	Исключение
	КонецПопытки;
	
	Попытка//проверка 3 параметра
		Сервер = "svs.local";
		Порт = 80;
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		HTTP.Получить("", ПолучитьИмяВременногоФайла());
		Структура.ДоступенСерверSVS = Истина;
	Исключение
	КонецПопытки;
	
	ПараметрыСеанса.уб_ВнешниеСервисы = Новый ФиксированнаяСтруктура(Структура);
	
КонецПроцедуры





Процедура УдалитьБуквыИзСтроки(Элемент, ДопустимыеСимволы = "0123456789") Экспорт
	
	Цифры = ДопустимыеСимволы;
	Результат = "";
	ЭтоПолеВвода = ?(ТипЗнч(Элемент) = Тип("Строка"),Ложь,Истина);
	Если ЭтоПолеВвода Тогда
		ЭлементЗначение = Элемент.Значение;
	Иначе
		ЭлементЗначение = Элемент;
	КонецЕсли;
	Если ДопустимыеСимволы = "0123456789." Тогда//число с дробной частью
		Текст = СтрЗаменить(ЭлементЗначение,",",".");
		Текст = УдалитьЛишниеТочкиВСтроке(Текст);
	Иначе
		Текст = ЭлементЗначение;
	КонецЕсли;
	ДлинаТекста = СтрДлина(Текст);
	Для Сч = 0 По ДлинаТекста - 1 Цикл
		Символ = Сред(Текст,ДлинаТекста - Сч, 1);
		Если Найти(Цифры, Символ) <> 0 Тогда
			Результат = Символ + Результат;
		КонецЕсли;
	КонецЦикла;
	//Если Элемент.Значение <> Результат Тогда
	Если ЭтоПолеВвода Тогда
		Элемент.Значение = Результат;
	Иначе
		Элемент = Результат;
	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Функция УдалитьЛишниеТочкиВСтроке(Знач Текст)
	
	Позиция = Найти(Текст, ".");
	Если Позиция <> 0 Тогда
		ЛеваяЧасть = Лев(Текст, Позиция);
		ПраваяЧасть = Сред(Текст, Позиция + 1);
		Возврат ЛеваяЧасть + СтрЗаменить(ПраваяЧасть, ".", "");
	Иначе
		Возврат Текст;
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьАбсолютныйЦвет(Red, Green, Blue) Экспорт
	
	Возврат Red + Green * 256 + Blue * 65536
	
КонецФункции // АбсолютныйЦвет()

Функция РазложитьАбсолютныйЦвет(АбсолютныйЦвет) Экспорт
	
	Blue 	= Цел(АбсолютныйЦвет / 65536);
	Цвет 	= АбсолютныйЦвет - Blue * 65536;
	Green   = Цел(Цвет / 256);
	Red		= Цвет - Green * 256;
	Возврат Новый Структура("Красный, Зеленый, Синий", Red, Green, Blue);
	
КонецФункции // РазложитьАбсолютныйЦвет()

//*******************************************************************
//							Помощник								*
//						  	 BEGIN									*
//*******************************************************************
Функция ПолучитьТаблицуВсехДействий(ИмяОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уб_Помощник.ПорядокДействия КАК ПорядокДействия,
	|	уб_Помощник.Действие,
	|	уб_Помощник.ИмяЭлементаФормы,
	|	уб_Помощник.Описание,
	|	уб_Помощник.ОбязательноКВыполнению,
	|	уб_Помощник.СетевойПутьККартинке
	|ИЗ
	|	РегистрСведений.уб_Помощник КАК уб_Помощник
	|ГДЕ
	|	уб_Помощник.Объект.Наименование = &ИмяОбъекта
	|	И НЕ уб_Помощник.Отключено
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДействия";
	Запрос.УстановитьПараметр("ИмяОбъекта",ИмяОбъекта);
	Таблица = Запрос.Выполнить().Выгрузить();	
	Таблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Счетчик = 1;
	Для Каждого Строка Из Таблица Цикл
		Строка.НомерСтроки = Счетчик;		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьДеревоЭлементовФормы(ЭтаФорма, ИмяОбъекта, Таблица) Экспорт
	
	Дерево = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уб_Справка.ДеревоЭлементовФормы
	|ИЗ
	|	Справочник.уб_Справка КАК уб_Справка
	|ГДЕ
	|	уб_Справка.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дерево = Выборка.ДеревоЭлементовФормы.Получить();
		//Дерево.Колонки.Добавить("Видимость", Новый ОписаниеТипов("Булево"));					
	КонецЕсли;
	Если ТипЗнч(Дерево) <> Тип("ДеревоЗначений") Или Дерево.Строки.Количество() = 0 Тогда				
		Дерево=Новый ДеревоЗначений;		
		Дерево.Колонки.Добавить("ИмяЭлемента",Новый ОписаниеТипов("Строка"));
		Дерево.Колонки.Добавить("ПолноеИмя",Новый ОписаниеТипов("Строка"));
		Дерево.Колонки.Добавить("ТипЭлемента");		
		Дерево.Колонки.Добавить("НеУдалятьСтроки", Новый ОписаниеТипов("Булево"));
		Корень=Дерево.Строки.Добавить();	
		Корень.ИмяЭлемента="ЭтаФорма";
		Корень.ПолноеИмя="ЭтаФорма";
		Корень.ТипЭлемента=Тип("Форма");
		Корень.НеУдалятьСтроки = Истина;
	Иначе
		Дерево.Колонки.Добавить("НеУдалятьСтроки", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из Таблица Цикл		
		НайденнаяСтрока = Дерево.Строки.Найти(СтрокаТЗ.ИмяЭлементаФормы, "ИмяЭлемента", Истина);
		Если НайденнаяСтрока <> Неопределено И НайденнаяСтрока.Уровень() > 1 Тогда
			Пока НайденнаяСтрока <> Неопределено Цикл
				НайденнаяСтрока.НеУдалятьСтроки = Истина;
				НайденнаяСтрока = НайденнаяСтрока.Родитель;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	УдалитьЛишниеСтрокиДерева(Дерево.Строки);
	
	//ЗаполнениеКолонкиВидимость(ЭтаФорма.ЭлементыФормы, Дерево.Строки);
	
	Возврат Дерево;
	
Конецфункции	

Функция УстановитьРазмерНадписиПомощника(ЭтаФорма, ПозицияЛевойГраницы, ПозицияВерхнейГраницы,ШиринаНадписиСтатусаДокумента = 185) Экспорт
	#Если Клиент Тогда
		ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
		нПомощник = ЭлементыФормы.Найти("Помощник_НадписьПомощник");
		Если нПомощник = Неопределено Тогда
			нПомощник = ЭлементыФормы.Добавить(Тип("Надпись"), "Помощник_НадписьПомощник");
			нПомощник.Верх = Макс(ПозицияВерхнейГраницы - 2,0);
			нПомощник.Высота	= 24;  
			нПомощник.Лево	= ПозицияЛевойГраницы;
			нПомощник.Ширина = ЭтаФорма.Ширина - нПомощник.Лево - ШиринаНадписиСтатусаДокумента;
			нПомощник.Шрифт	= Новый Шрифт(, 10, Ложь);
			нПомощник.ГоризонтальноеПоложение	= ГоризонтальноеПоложение.Лево;
			нПомощник.ВертикальноеПоложение	= ВертикальноеПоложение.Центр;
			нПомощник.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;		
			нПомощник.УстановитьПривязку(ГраницаЭлементаУправления.Право,	ЭтаФорма.Панель,	ГраницаЭлементаУправления.Право);
			НовоеДействие = Новый Действие("ОбработчикДопКнопокДействийФормы");		                     
			нПомощник.УстановитьДействие("Нажатие", НовоеДействие);			
		Иначе
			нПомощник.Лево = ПозицияЛевойГраницы;
			нПомощник.Ширина = ЭтаФорма.Ширина - нПомощник.Лево - ШиринаНадписиСтатусаДокумента;
		КонецЕсли;
	#КонецЕсли
КонецФункции

Процедура ОбновитьТекстНадписиПомощника(ЭтаФорма) Экспорт	
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	нПомощник = ЭлементыФормы.Найти("Помощник_НадписьПомощник");
	Если нПомощник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаВсехДействий = ЭтаФорма.ДополнительныеСвойства.ТаблицаВсехДействий;
	КоличествоСтрокТаблицыДействий = ЭтаФорма.ДополнительныеСвойства.КоличествоСтрокТаблицыДействий;
	НомерТекущегоДействия = ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия;
	Если НомерТекущегоДействия > КоличествоСтрокТаблицыДействий Тогда
		НомерТекущегоДействия  = КоличествоСтрокТаблицыДействий;
	КонецЕсли;	
	
	Если НомерТекущегоДействия > 0 Тогда			
		ТекСтрТЗ = ТаблицаВсехДействий[НомерТекущегоДействия-1];						
		нПомощник.Картинка = Новый Картинка;
		нПомощник.Заголовок = ТекСтрТЗ.Действие;
		Если ТекСтрТЗ.ОбязательноКВыполнению Тогда
			нПомощник.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Иначе
			нПомощник.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
		КонецЕсли;
		нПомощник.Подсказка = ТекСтрТЗ.Описание;			
		Если ЗначениеЗаполнено(ТекСтрТЗ.ИмяЭлементаФормы) Тогда
			нПомощник.Гиперссылка = Истина;
			Элемент = ЭлементыФормы.Найти(ТекСтрТЗ.ИмяЭлементаФормы);
			Если Элемент <> Неопределено Тогда
				Если Элемент.ТолькоПросмотр 
					Или Не Элемент.Доступность Тогда//Или Не ВидимостьЭлементаФормы(ЭтаФорма,ТекСтрТЗ.ИмяЭлементаФормы)  
					
					КартинкаЗамок = БиблиотекаКартинок.уб_ЗамокЗакрыт;
					Если нПомощник.Картинка <> КартинкаЗамок Тогда
						нПомощник.Картинка = КартинкаЗамок;
					КонецЕсли;	
				КонецЕсли;
			Иначе
				нПомощник.Гиперссылка = Ложь;
				КартинкаЗамок = БиблиотекаКартинок.уб_ЗамокЗакрыт;
				Если нПомощник.Картинка <> КартинкаЗамок Тогда
					нПомощник.Картинка = КартинкаЗамок;
				КонецЕсли;
			КонецЕсли;
		Иначе
			нПомощник.Гиперссылка = Ложь;
		КонецЕсли;				
	ИначеЕсли ЭтаФорма.Модифицированность Или ЭтаФорма.ЭтоНовый() Тогда
		нПомощник.Картинка = Новый Картинка;
		нПомощник.Гиперссылка = Ложь;
		нПомощник.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;			
		нПомощник.Заголовок = "Объект не записан!";
		нПомощник.Подсказка = "Изменения в объекте не записаны!";			
	Иначе	
		нПомощник.Заголовок = "";
		нПомощник.Подсказка = "";
		КартинкаВыполнено = БиблиотекаКартинок.ВыполненоУспешно32;
		Если нПомощник.Картинка <> КартинкаВыполнено Тогда
			нПомощник.Картинка = КартинкаВыполнено;
		КонецЕсли;	
	КонецЕсли;				
КонецПроцедуры

Процедура ПодготовитьПомощника(ЭтаФорма, СтруктураПараметров) Экспорт
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "НеИспользоватьПомощникаЗаполненияОбъектов") Тогда
		Возврат;
	КонецЕсли;	
	ТаблицаВсехДействий = ПолучитьТаблицуВсехДействий(СтруктураПараметров.ИмяОбъекта);
	КоличествоСтрок = ТаблицаВсехДействий.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;		
	ДеревоЭлементовФормы = ПолучитьДеревоЭлементовФормы(ЭтаФорма, СтруктураПараметров.ИмяОбъекта, ТаблицаВсехДействий);
	
	ЭтаФорма.ДополнительныеСвойства.Вставить("ДеревоЭлементовФормы", ДеревоЭлементовФормы);
	ЭтаФорма.ДополнительныеСвойства.Вставить("ТаблицаВсехДействий", ТаблицаВсехДействий);
	ЭтаФорма.ДополнительныеСвойства.Вставить("КоличествоСтрокТаблицыДействий", КоличествоСтрок);
	ЭтаФорма.ДополнительныеСвойства.Вставить("НомерТекущегоДействия", 0);
	ЭтаФорма.ДополнительныеСвойства.Вставить("ИмяОбъекта", СтруктураПараметров.ИмяОбъекта);
	
	УстановитьАвтоотметкиНеЗаполненных(ЭтаФорма, ТаблицаВсехДействий);
	УстановитьРазмерНадписиПомощника(ЭтаФорма, СтруктураПараметров.ПозицияЛевойГраницыНадписиПомощника, СтруктураПараметров.ПозицияВерхнейГраницыКнопкиПомощника,?(СтруктураПараметров.Свойство("ШиринаНадписиСтатусаДокумента"),СтруктураПараметров.ШиринаНадписиСтатусаДокумента,0));
	Следующий = ПолучитьНомерСледующего(ЭтаФорма);
	ОбновитьНомерТекущегоДействия(ЭтаФорма, Истина, Следующий);
	ОбновитьТекстНадписиПомощника(ЭтаФорма);
	ДобавитьКнопкуПомощника(ЭтаФорма, СтруктураПараметров.ПозицияЛевойГраницыКнопкиПомощника, СтруктураПараметров.ПозицияВерхнейГраницыКнопкиПомощника);		
	ЭтаФорма.ПодключитьОбработчикОжидания("АвтоматическоеОбновлениеФормы", СтруктураПараметров.ИнтервалАвтоматическогоОбновления);
КонецПроцедуры	

Процедура УстановитьАвтоотметкиНеЗаполненных(ЭтаФорма, ТаблицаВсехДействий)
	Для Каждого СтрокаТЧ Из ТаблицаВсехДействий Цикл
		Если СтрокаТЧ.ОбязательноКВыполнению И ЗначениеЗаполнено(СтрокаТЧ.ИмяЭлементаФормы) Тогда
			ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
			Элемент = ЭлементыФормы.Найти(СтрокаТЧ.ИмяЭлементаФормы);
			Если Элемент <> Неопределено Тогда
				Если ТипЗнч(Элемент) = Тип("ПолеВвода") Тогда 
					Элемент.АвтоОтметкаНезаполненного = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

Процедура ДобавитьКнопкуПомощника(ЭтаФорма, ПозицияЛевойГраницыКнопкиПомощника, ПозицияВерхнейГраницыКнопкиПомощника)
	#Если Клиент Тогда
		ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
		Кнопка = ЭлементыФормы.Найти("Помощник_ОсновнаяКнопка");
		Если Кнопка = Неопределено Тогда
			Кнопка = ЭлементыФормы.Добавить(Тип("Кнопка"), "Помощник_ОсновнаяКнопка");			
			Кнопка.Картинка = БиблиотекаКартинок.ДобавитьВПраво;
			Кнопка.Лево = ПозицияЛевойГраницыКнопкиПомощника;
			Кнопка.Верх = ПозицияВерхнейГраницыКнопкиПомощника;
			Кнопка.Ширина = 38;
			Кнопка.Высота = 20;
			Кнопка.Подсказка = "Перейти к следующему невыполненному действию";
			
			НовоеДействие = Новый Действие("ОбработчикДопКнопокДействийФормы");		                     
			Кнопка.УстановитьДействие("Нажатие", НовоеДействие);
			
			Кнопка.РежимМеню = ИспользованиеРежимаМеню.ИспользоватьДополнительно;
			НоваяКнопка = Кнопка.Кнопки.Добавить("Помощник_ПерейтиКСледующемуНеВыполненному", ТипКнопкиКоманднойПанели.Действие, "Перейти к следующему",НовоеДействие);
			НоваяКнопка.Картинка = БиблиотекаКартинок.ДобавитьВПраво;
			//НоваяКнопка.Подсказка = "Перейти к следующему обязательному к выполнению, но еще не выполненному действию";
			//НоваяКнопка.Пояснение = "Перейти к следующему обязательному к выполнению, но еще не выполненному действию";
			НоваяКнопка.Подсказка = "Перейти к следующему невыполненному действию";
			НоваяКнопка.Пояснение = "Перейти к следующему невыполненному действию";
			
			НоваяКнопка = Кнопка.Кнопки.Добавить("Помощник_ПоказатьСписокНевыполненных", ТипКнопкиКоманднойПанели.Действие, "Список невыполненных действий",НовоеДействие);
			НоваяКнопка.Картинка = БиблиотекаКартинок.РежимПросмотраСпискаСписок;
			НоваяКнопка.Подсказка = "Открыть список обязательных к выполнению, но еще не выполненных действий";
			НоваяКнопка.Пояснение = "Открыть список обязательных к выполнению, но еще не выполненных действий";
			
			НоваяКнопка = Кнопка.Кнопки.Добавить("Помощник_ОткрытьФормуПомощника", ТипКнопкиКоманднойПанели.Действие, "Открыть форму помощника",НовоеДействие);
			НоваяКнопка.Подсказка = "Открыть форму помощника заполнения";
			НоваяКнопка.Пояснение = "Открыть форму помощника заполнения";
		Иначе
			Кнопка.Лево = ПозицияЛевойГраницыКнопкиПомощника;
			Кнопка.Верх = ПозицияВерхнейГраницыКнопкиПомощника;
		КонецЕсли;
	#КонецЕсли 
КонецПроцедуры	

Процедура АвтоматическонеОбновлениеНомераТекущегоДействия(ЭтаФорма) Экспорт
	
	//Если ЭтаФорма.ДополнительныеСвойства.Свойство("ТаблицаВсехДействий")
	//	И ЭтаФорма.ДополнительныеСвойства.Свойство("НомерТекущегоДействия") Тогда		
	НомерТекущегоДействия = ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия;		
	ТаблицаВсехДействий = ЭтаФорма.ДополнительныеСвойства.ТаблицаВсехДействий;
	
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	//Если НомерТекущегоДействия < 1 Тогда //Или ДействиеВыполнено(ЭтаФорма, ТаблицаВсехДействий[НомерТекущегоДействия-1]) Тогда
	Следующий = ПолучитьНомерСледующего(ЭтаФорма, Истина);				 
	уб_temp.ОбновитьНомерТекущегоДействия(ЭтаФорма, Ложь, Следующий);
	уб_temp.ОбновитьТекстНадписиПомощника(ЭтаФорма);
	//КонецЕсли;              		
	//КонецЕсли;	
	
КонецПроцедуры	

Процедура ОбновитьНомерТекущегоДействия(ЭтаФорма, АктивизироватьНовыйЭлементФормы = Ложь, Знач НомерСтрокиДляПерехода = Неопределено) Экспорт
	
	//Если ЭтаФорма.ДополнительныеСвойства.Свойство("ТаблицаВсехДействий") 
	//	И ЭтаФорма.ДополнительныеСвойства.Свойство("КоличествоСтрокТаблицыДействий") 
	//	И ЭтаФорма.ДополнительныеСвойства.Свойство("НомерТекущегоДействия") Тогда
	ТаблицаВсехДействий = ЭтаФорма.ДополнительныеСвойства.ТаблицаВсехДействий;
	КоличествоСтрокТаблицыДействий = ЭтаФорма.ДополнительныеСвойства.КоличествоСтрокТаблицыДействий;
	НомерТекущегоДействия = ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия;
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	
	Если НомерСтрокиДляПерехода = Неопределено Тогда						
		
		НомерНовойСтрокаДействия = -1;//если нет невыполненных
		//ИндексНовойСтрокиДействия = КоличествоСтрокТаблицыДействий-1;//если нет невыполненных из обязательных, по перейти на последнее действие
		Для Каждого СтрокаТЗ Из ТаблицаВсехДействий Цикл
			//Если СтрокаТЗ.НомерСтроки > НомерТекущегоДействия Тогда//незаполненные ранее в игнорируются
			Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЭлементаФормы) Тогда//И СтрокаТЗ.ОбязательноКВыполнению 				
				
				Если Не ДействиеВыполнено(ЭтаФорма, СтрокаТЗ) Тогда
					НомерНовойСтрокаДействия = СтрокаТЗ.НомерСтроки;						
					ИмяЭлементФормыДляАктивизации = СтрокаТЗ.ИмяЭлементаФормы;
					Прервать;
				КонецЕсли;											
			КонецЕсли;	
			//КонецЕсли;				
		КонецЦикла;
		ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия = НомерНовойСтрокаДействия;	
		Если АктивизироватьНовыйЭлементФормы И ЗначениеЗаполнено(ИмяЭлементФормыДляАктивизации) Тогда
			Элемент = ЭлементыФормы.Найти(ИмяЭлементФормыДляАктивизации);
			Если Элемент <> Неопределено Тогда
				ЭтаФорма.ТекущийЭлемент = Элемент;
			КонецЕсли;
		КонецЕсли;	
	Иначе										
		Если НомерСтрокиДляПерехода > КоличествоСтрокТаблицыДействий Тогда
			НомерСтрокиДляПерехода = КоличествоСтрокТаблицыДействий;
		КонецЕсли;	
		ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия = НомерСтрокиДляПерехода;	
		Если НомерСтрокиДляПерехода > 0 Тогда					
			ИмяЭлементФормыДляАктивизации = ТаблицаВсехДействий[НомерСтрокиДляПерехода-1].ИмяЭлементаФормы;
			Если АктивизироватьНовыйЭлементФормы И ЗначениеЗаполнено(ИмяЭлементФормыДляАктивизации) Тогда
				Элемент = ЭлементыФормы.Найти(ИмяЭлементФормыДляАктивизации);
				Если Элемент <> Неопределено Тогда
					ЭтаФорма.ТекущийЭлемент = Элемент;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	//КонецЕсли;
	
КонецПроцедуры	

Функция ДействиеВыполнено(ЭтаФорма, СтрокаТЗ)
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	Если Не ЗначениеЗаполнено(СтрокаТЗ.ИмяЭлементаФормы) Тогда
		Возврат Ложь;
	КонецЕсли;
	Элемент = ЭлементыФормы.Найти(СтрокаТЗ.ИмяЭлементаФормы);
	Если Элемент <> Неопределено Тогда
		Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Попытка
				Если ЗначениеЗаполнено(Элемент.ТекущаяСтрока)
					Или ЭтаФорма[СтрокаТЗ.ИмяЭлементаФормы].Количество() > 0 
					Или Не ВидимостьЭлементаФормы(ЭтаФорма,СтрокаТЗ.ИмяЭлементаФормы) Тогда						
					Возврат Истина;
				Иначе 	
					Возврат Ложь;
				КонецЕсли;	
			Исключение
				Возврат Ложь;
			КонецПопытки;
		Иначе
			Если ЗначениеЗаполнено(Элемент.Значение) Или Не ВидимостьЭлементаФормы(ЭтаФорма,СтрокаТЗ.ИмяЭлементаФормы) Тогда 
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;		
		КонецЕсли;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьНомерСледующего(ЭтаФорма, ЭтоАвтоматическоеОбновление = Ложь)
	
	Номер = -1;
	
	//Если ЭтаФорма.ДополнительныеСвойства.Свойство("ТаблицаВсехДействий")
	//	И ЭтаФорма.ДополнительныеСвойства.Свойство("НомерТекущегоДействия") 
	//	И ЭтаФорма.ДополнительныеСвойства.Свойство("КоличествоСтрокТаблицыДействий") Тогда
	
	НомерТекущегоДействия = ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия;
	ТаблицаВсехДействий = ЭтаФорма.ДополнительныеСвойства.ТаблицаВсехДействий;		
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	Для Каждого СтрокаТЧ Из ТаблицаВсехДействий Цикл
		Выполнено = ДействиеВыполнено(ЭтаФорма, СтрокаТЧ);
		Если (СтрокаТЧ.ОбязательноКВыполнению И Не Выполнено И (ЭлементДоступенДляРедактирования(ЭтаФорма, СтрокаТЧ.ИмяЭлементаФормы) Или (СтрокаТЧ.НомерСтроки > НомерТекущегоДействия И Не ЭтоАвтоматическоеОбновление)))
			Или (Не СтрокаТЧ.ОбязательноКВыполнению И Не Выполнено И СтрокаТЧ.НомерСтроки > НомерТекущегоДействия) 
			Или (ЭтоАвтоматическоеОбновление И СтрокаТЧ.НомерСтроки = НомерТекущегоДействия И Не Выполнено) Тогда
			
			Возврат СтрокаТЧ.НомерСтроки;
			
		КонецЕсли;	
	КонецЦикла;
	Если Номер = - 1 Тогда
		Для Каждого СтрокаТЧ Из ТаблицаВсехДействий Цикл
			Если Не ДействиеВыполнено(ЭтаФорма, СтрокаТЧ) Тогда//И Не ЭтоАвтоматическоеОбновление 
				
				Возврат СтрокаТЧ.НомерСтроки;
				
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
	//КонецЕсли;
	
	Возврат Номер;
	
КонецФункции	

Функция ЭлементДоступенДляРедактирования(ЭтаФорма, ИмяЭлементаФормы)
	
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	Элемент = ЭлементыФормы.Найти(ИмяЭлементаФормы);
	Если Элемент <> Неопределено Тогда
		Если Элемент.ТолькоПросмотр Или Не Элемент.Доступность Тогда//Или Не ВидимостьЭлементаФормы(ЭтаФорма,ИмяЭлементаФормы)
			Возврат Ложь;                                                                                              
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Процедура ОбработатьНажатиеКнопкиПомощника(Элемент, ЭтаФорма) Экспорт
	#Если Клиент Тогда		
		//Если ЭтаФорма.ДополнительныеСвойства.Свойство("ТаблицаВсехДействий")
		//	И ЭтаФорма.ДополнительныеСвойства.Свойство("ИмяОбъекта") 
		//	И ЭтаФорма.ДополнительныеСвойства.Свойство("НомерТекущегоДействия")
		//	И ЭтаФорма.ДополнительныеСвойства.Свойство("КоличествоСтрокТаблицыДействий") Тогда
		
		ТаблицаВсехДействий = ЭтаФорма.ДополнительныеСвойства.ТаблицаВсехДействий;			
		Если Элемент.Имя = "Помощник_ПерейтиКСледующемуНеВыполненному" Или Элемент.Имя = "Помощник_ОсновнаяКнопка" Тогда
			Следующий = ПолучитьНомерСледующего(ЭтаФорма);
			ОбновитьНомерТекущегоДействия(ЭтаФорма, Истина, Следующий);
			ОбновитьТекстНадписиПомощника(ЭтаФорма);
			//Если ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия = -1 Тогда
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = "Все обязательные действия уже выполнены.";
			//	Сообщение.Сообщить();
			//КонецЕсли;
		ИначеЕсли Элемент.Имя = "Помощник_ПоказатьСписокНевыполненных" Тогда
			ТаблицаНеВыполненных = ПодготовитьТаблицуНеВыполненных(ЭтаФорма,ТаблицаВсехДействий);
			Если ТаблицаНеВыполненных.Количество() > 0 Тогда
				
				//ВыбраннаяСтрока = ТаблицаНеВыполненных.ВыбратьСтроку("Список невыполненных обязательных действий",);
				ФормаВыбораСтроки = ПолучитьОбщуюФорму("уб_ФормаВыбораСтрокиТЗ",ЭтаФорма);
				ФормаВыбораСтроки.Заголовок = "Список обязательных невыполненных действий";
				ФормаВыбораСтроки.ТаблицаЗначений = ТаблицаНеВыполненных;
				ТЗНаФорме = ФормаВыбораСтроки.ЭлементыФормы.ТаблицаЗначений;
				ТЗНаФорме.СоздатьКолонки();					
				Для Каждого Колонка Из ТЗНаФорме.Колонки Цикл											
					Колонка.Ширина = 40;
					Колонка.ВысотаЯчейки = 3;
					Колонка.АвтоВысотаЯчейки = Истина;
					Колонка.ИзменениеРазмера = ИзменениеРазмераКолонки.Изменять;
					Колонка.ЭлементУправления.МногострочныйРежим = Истина;
					Колонка.ЭлементУправления.АвтоПереносСтрок = Истина;					
				КонецЦикла;	
				ТЗНаФорме.ТолькоПросмотр = Истина;					
				
				ВыбраннаяСтрока = ФормаВыбораСтроки.ОткрытьМодально();
				Если ВыбраннаяСтрока <> Неопределено Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Действие",ВыбраннаяСтрока.Действие);
					Отбор.Вставить("Описание",ВыбраннаяСтрока.Описание);
					СтрокиТаблицыДействий = ТаблицаВсехДействий.НайтиСтроки(Отбор);
					Если СтрокиТаблицыДействий.Количество() > 0 Тогда
						ОбновитьНомерТекущегоДействия(ЭтаФорма, Истина, СтрокиТаблицыДействий[0].НомерСтроки);
						ОбновитьТекстНадписиПомощника(ЭтаФорма);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Все обязательные действия уже выполнены.";
				Сообщение.Сообщить();
			КонецЕсли;
		ИначеЕсли Элемент.Имя = "Помощник_ОткрытьФормуПомощника" Тогда
			Фрм = ПолучитьОбщуюФорму("уб_ФормаПомощника",ЭтаФорма);
			Если Фрм.Открыта() Тогда
				Фрм.Свернуто = Ложь;
				Фрм.Активизировать();
			Иначе
				Фрм.РазрешитьСостояниеПрикрепленное=Истина;
				Фрм.РазрешитьСоединятьОкно = Истина;
				Фрм.РазрешитьСостояниеОбычное = Истина;
				Фрм.РазрешитьСостояниеСвободное = Истина;
				Фрм.СоединяемоеОкно = Истина;
				Фрм.СостояниеОкна = ВариантСостоянияОкна.Прикрепленное;
				Фрм.ПоложениеПрикрепленногоОкна = ВариантПрикрепленияОкна.Право;
				Если Фрм.Ширина < 300 Тогда
					Фрм.Ширина = 300;
				КонецЕсли;
				Если Фрм.Высота < 700 Тогда
					Фрм.Высота = 700;
				КонецЕсли;			
				Фрм.ИмяОбъекта = ЭтаФорма.ДополнительныеСвойства.ИмяОбъекта;		
				Фрм.СсылкаНаОбъект = ЭтаФорма.ЭтотОбъект;
				Фрм.Свернуто = Ложь;			
				Фрм.Открыть();
			КонецЕсли;			
		ИначеЕсли Элемент.Имя = "Помощник_НадписьПомощник" Тогда
			ОбновитьНомерТекущегоДействия(ЭтаФорма, Истина, ЭтаФорма.ДополнительныеСвойства.НомерТекущегоДействия);
		КонецЕсли;	
		
		//КонецЕсли;
	#КонецЕсли
КонецПроцедуры	

Функция ПодготовитьТаблицуНеВыполненных(ЭтаФорма, Таблица)
	
	ТЗ = Таблица.СкопироватьКолонки("Действие, Описание");
	Для Каждого СтрокаТЧ Из Таблица Цикл 
		Если СтрокаТЧ.ОбязательноКВыполнению И Не ДействиеВыполнено(ЭтаФорма, СтрокаТЧ) И ЭлементДоступенДляРедактирования(ЭтаФорма, СтрокаТЧ.ИмяЭлементаФормы) Тогда
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЕсли;					
	КонецЦикла;	
	Возврат ТЗ;
	
КонецФункции	

Процедура УдалитьЛишниеСтрокиДерева(Строки)
	
	КоличествоСтрок = Строки.Количество();
	Если КоличествоСтрок > 0 Тогда
		Для Счетчик = 1 По КоличествоСтрок Цикл //Для Каждого Строка из Строки Цикл     					
			Если Строки[КоличествоСтрок - Счетчик].НеУдалятьСтроки Тогда			
				УдалитьЛишниеСтрокиДерева(Строки[КоличествоСтрок - Счетчик].Строки);
			Иначе
				Строки.Удалить(КоличествоСтрок - Счетчик);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

Функция ВидимостьЭлементаФормы(ЭтаФорма,ИмяЭлементаФормы)
	
	ДеревоЭлементовФормы = ЭтаФорма.ДополнительныеСвойства.ДеревоЭлементовФормы;	
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	Элемент = ЭлементыФормы.Найти(ИмяЭлементаФормы);
	Если Элемент <> Неопределено Тогда		
		ТекВидимость = Элемент.Видимость;
		Если ТекВидимость Тогда		
			ТекВидимость = ВидимостьЭлементаВДеревеЭлементов(ЭлементыФормы, ДеревоЭлементовФормы.Строки, ИмяЭлементаФормы);			
		КонецЕсли;	
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	Возврат ТекВидимость;
	
КонецФункции

Функция ВидимостьЭлементаВДеревеЭлементов(ЭлементыФормы, Строки, ИмяЭлементаФормы,Панель = Неопределено)
	
	Результат = Истина;
	НайденнаяСтрока = Строки.Найти(ИмяЭлементаФормы, "ИмяЭлемента", Истина);		
	Пока НайденнаяСтрока <> Неопределено Цикл		
		Если НайденнаяСтрока.ТипЭлемента = Тип("СтраницаПанели") Тогда
			Результат = ЭлементыФормы[НайденнаяСтрока.Родитель.ИмяЭлемента].Страницы.Найти(НайденнаяСтрока.ИмяЭлемента).Видимость;
		ИначеЕсли НайденнаяСтрока.ТипЭлемента <> Тип("Форма") Тогда		
			Результат = ЭлементыФормы[НайденнаяСтрока.ИмяЭлемента].Видимость;
		КонецЕсли;
		Если Не Результат Тогда
			Возврат Результат;
		КонецЕсли;	
		НайденнаяСтрока = НайденнаяСтрока.Родитель;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции	

//Процедура ЗаполнениеКолонкиВидимость(ЭлементыФормы, Строки, Панель = Неопределено)
//	Для Каждого Строка из Строки Цикл     		
//		Если Строка.ТипЭлемента <> Тип("Форма") Тогда
//			Если Строка.ТипЭлемента = Тип("СтраницаПанели") Тогда				
//				Элемент = Панель.Страницы.Найти(Строка.ИмяЭлемента);													
//			Иначе	
//				Элемент = ЭлементыФормы[Строка.ИмяЭлемента];
//			КонецЕсли;
//			Строка.Видимость = Элемент.Видимость;
//			Если Строка.ТипЭлемента = Тип("Панель") Тогда
//				ЗаполнениеКолонкиВидимость(ЭлементыФормы,Строка.Строки, ЭлементыФормы[Строка.ИмяЭлемента]);//если панель, то передаем ее для поиска на ней страниц
//			Иначе
//				ЗаполнениеКолонкиВидимость(ЭлементыФормы,Строка.Строки, Неопределено);
//			КонецЕсли;	
//		Иначе
//			Строка.Видимость = Истина;
//			ЗаполнениеКолонкиВидимость(ЭлементыФормы,Строка.Строки);
//		КонецЕсли;		
//	КонецЦикла; 
//КонецПроцедуры
//*******************************************************************
//							  END									*
//							Помощник								*
//*******************************************************************


Процедура ДополнитьСписокСотрудниковПредшественниками(СписокИлиМассив) Экспорт
	
	//ЗапросДополненияПреемниками = Новый Запрос;
	//ЗапросДополненияПреемниками.Текст = 
	//"ВЫБРАТЬ
	//|	ФЛ.Ссылка,
	//|	ФЛ.Наименование,
	//|	ФЛ.Преемник
	//|ИЗ
	//|	Справочник.ФизическиеЛица КАК ФЛ
	//|ГДЕ
	//|	ФЛ.Ссылка <> ФЛ.Преемник
	//|	И НЕ ФЛ.ПометкаУдаления
	//|	И НЕ ФЛ.Преемник.ПометкаУдаления";
	//Выборка = ЗапросДополненияПреемниками.Выполнить().Выгрузить();//Выбрать();
	Выборка = уб_КЭШируемые.Приемники();
	МассивПроверенныхЭлементов = Новый Массив;
	//МассивЭлементов = СписокЗначений.ВыгрузитьЗначения();
	ЭтоСЗ = ТипЗнч(СписокИлиМассив) = Тип("СписокЗначений");
	Для Каждого ЭлементСпискаИлиМассива Из СписокИлиМассив Цикл
		ПредшественникиРекурсивно(?(ЭтоСЗ, ЭлементСпискаИлиМассива.Значение, ЭлементСпискаИлиМассива), СписокИлиМассив, Выборка, МассивПроверенныхЭлементов, ЭтоСЗ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПредшественникиРекурсивно(Знач Предшественник, СписокИлиМассив, Выборка, МассивПроверенныхЭлементов, ЭтоСЗ)
	
	Если МассивПроверенныхЭлементов.Найти(Предшественник) = Неопределено Тогда
		МассивПроверенныхЭлементов.Добавить(Предшественник);
	Иначе
		Возврат;
	КонецЕсли;
	// если параметр Предшественник не Знач, то значение параметра Предшественник сбрасывается при сбросе выборки
	//Выборка.Сбросить();
	СтруктураПоиска = Новый Структура("Преемник", Предшественник);
	//Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
	//Пока Выборка.СледующийПоЗначениюПоля()
	Для каждого Строка из Выборка.НайтиСтроки(СтруктураПоиска) Цикл
		Если ЭтоСЗ Тогда
			Если СписокИлиМассив.НайтиПоЗначению(Строка.Ссылка) = Неопределено Тогда
				СписокИлиМассив.Добавить(Строка.Ссылка, Строка.Наименование);
			КонецЕсли;
		Иначе
			Если СписокИлиМассив.Найти(Строка.Ссылка) = Неопределено Тогда
				СписокИлиМассив.Добавить(Строка.Ссылка);
			КонецЕсли;
		КонецЕсли;
		ПредшественникиРекурсивно(Строка.Ссылка, СписокИлиМассив, Выборка, МассивПроверенныхЭлементов, ЭтоСЗ);
	КонецЦикла;
	
КонецПроцедуры

//Источник - Таблица значений или физ. лицо.
//Если источник - таблица, то параметр МассивИменКолонокСотрудников - строка или массив имен колонок, в которых заменить физ. лицо на преемника


Функция ПолучитьПреемникаСотрудника(
	Источник, 
	МассивИменКолонокСотрудников 	= Неопределено, 
	ВыборкаПреемников 				= Неопределено,
	КэшРекурсии 					= Неопределено,	//Это цепочка преемников от изначального до текущего/пополняется
	СоответcтвиеСотрудников 		= Неопределено 	//Это соответствие всех сотрудников конечному преемнику, для ускорения перебора в таблице с повторениями сотрудников/Пополняется при проверки "ЭтоФизлицо"
	) Экспорт
	
	//|ВЫБРАТЬ
	//|ФизическиеЛицаОсновная.Ссылка,
	//|ФизическиеЛицаОсновная.Преемник,
	//|ФизическиеЛицаПреемник.Преемник КАК ПреемникПреемник
	//|ИЗ
	//|Справочник.ФизическиеЛица КАК ФизическиеЛицаОсновная
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛицаПреемник
	//|ПО ФизическиеЛицаОсновная.Преемник = ФизическиеЛицаПреемник.Ссылка
	ТипИсточника = ТипЗнч(Источник);
	ЭтоФизЛицо = ТипИсточника = Тип("СправочникСсылка.ФизическиеЛица");
	Если Не ЭтоФизЛицо Тогда
		ЭтоТаблицаЗначений = ТипИсточника = Тип("ТаблицаЗначений");
	Иначе
		ЭтоТаблицаЗначений = Ложь;
	КонецЕсли;
	Если СоответcтвиеСотрудников = Неопределено Тогда
		СоответcтвиеСотрудников = Новый Соответствие;
	КонецЕсли;	
	Если ЭтоФизЛицо Или ЭтоТаблицаЗначений Тогда
		Если ВыборкаПреемников = Неопределено Тогда
			ЗапросПоПреемникам = Новый Запрос;
			ЗапросПоПреемникам.Текст = "ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка,
			|	ФизическиеЛица.Преемник
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	НЕ ФизическиеЛица.Преемник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|	И ФизическиеЛица.Ссылка <> ФизическиеЛица.Преемник";
			ВыборкаПреемников = ЗапросПоПреемникам.Выполнить().Выбрать();
		КонецЕсли;
		Если КэшРекурсии = Неопределено Тогда
			КэшРекурсии = Новый Массив;
		КонецЕсли;	
		СтруктураПоиска = Новый Структура("Ссылка");
		
		Если ЭтоФизЛицо Тогда
			
			ИзУжеПроверенных = СоответcтвиеСотрудников.Получить(Источник);
			Если ИзУжеПроверенных = Неопределено Тогда
				//Для этого сотрудника преемника еще не искали
				СтруктураПоиска.Ссылка = Источник;
				ВыборкаПреемников.Сбросить();
				Если ВыборкаПреемников.НайтиСледующий(СтруктураПоиска) И Не Источник = Null И Не Источник = Неопределено Тогда
					ТекПреемник = ВыборкаПреемников.Преемник.Ссылка;
					Если КэшРекурсии.Найти(ТекПреемник)= Неопределено Тогда
						//Раскручиваем дальше
						КэшРекурсии.Добавить(ТекПреемник);
						Преемник = ПолучитьПреемникаСотрудника(ВыборкаПреемников.Преемник.Ссылка,,ВыборкаПреемников,КэшРекурсии,СоответcтвиеСотрудников);
					Иначе
						//Зацикливание
						Преемник = Источник;	
						ДополнитьПреемниковПоКэшу(СоответcтвиеСотрудников,КэшРекурсии,Преемник);
					КонецЕсли;	
				Иначе 
					//Нет преемника
					Преемник = Источник;
					КэшРекурсии.Добавить(Преемник);
					ДополнитьПреемниковПоКэшу(СоответcтвиеСотрудников,КэшРекурсии,Преемник);
				КонецЕсли;
			Иначе
				//Уже нашли
				Преемник = ИзУжеПроверенных;
			КонецЕсли;
			
			//Источник = Преемник;
			Возврат Преемник;
		Иначе //Если ЭтоТаблицаЗначений Тогда
			Если ТипЗнч(МассивИменКолонокСотрудников) = Тип("Строка") Тогда
				Массив = Новый Массив;
				Массив.Добавить(МассивИменКолонокСотрудников);
				МассивИменКолонокСотрудников = Массив;
			КонецЕсли;
			ЕстьКолонкаТипПодразделения = Источник.Колонки.Найти("ТипПодразделения") <> Неопределено;
			Для Каждого СтрокаТЗ Из Источник Цикл
				ТЗ = Новый ТаблицаЗначений;
				Если ЕстьКолонкаТипПодразделения И СтрокаТЗ.ТипПодразделения = Перечисления.уб_ТипыПодразделений.Курьеры Тогда
					Продолжить;
				КонецЕсли;	
				Для Каждого ИмяКолонкиСотрудника Из МассивИменКолонокСотрудников Цикл
					ТекСотрудник = СтрокаТЗ[ИмяКолонкиСотрудника];
					СтрокаТЗ[ИмяКолонкиСотрудника] = ПолучитьПреемникаСотрудника(ТекСотрудник,, ВыборкаПреемников, КэшРекурсии, СоответcтвиеСотрудников);
					КэшРекурсии = Неопределено;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	Иначе
		// любой другой тип
		Возврат Источник;
	КонецЕсли;
	
КонецФункции

Процедура ДополнитьПреемниковПоКэшу(СоответcтвиеСотрудников,КэшРекурсии, КонечныйПреемник);
	//
	Для каждого Элемент из КэшРекурсии Цикл
		СоответcтвиеСотрудников.Вставить(Элемент,КонечныйПреемник);
	КонецЦикла;	
Конецпроцедуры	


//рекурсивно ищет документ-основание определенного типа
Функция ДокументОснованиеПоТипуРекурсивно(Ссылка, Тип) Экспорт
	
	ДокументОснование = Ссылка.СозданНаОсновании;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ТипЗнч(ДокументОснование) <> Тип Тогда
			ДокументОснование = ДокументОснованиеПоТипуРекурсивно(ДокументОснование, Тип)
		КонецЕсли;
		Возврат ДокументОснование;
	КонецЕсли;
	
КонецФункции // ДокументОснованиеПоТипуРекурсивно()

Функция СтруктураБлокировкиДокумента(Ссылка) Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Ссылка);
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		ОтчетСсылка = Ссылка.ОтчетПоставщику;
		МассивОбъектов.Добавить(ОтчетСсылка);
	Иначе
		ОтчетСсылка = Ссылка;
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("ЕстьПравоРазблокировки", ПолучитьПредопределеннуюНастройкуПользователя("ПравоРедактированияЗаблокированных", Ложь));
	Если ЗначениеЗаполнено(ОтчетСсылка) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСТИНА КАК НеПустой
		|ИЗ
		|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ВЗ
		|ГДЕ
		|	ВЗ.ОтчетПоставщику = &Ссылка
		|	И ВЗ.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)");
		Запрос.УстановитьПараметр("Ссылка", 				ОтчетСсылка);
		Запрос.УстановитьПараметр("ЕстьПравоРазблокировки", Структура.ЕстьПравоРазблокировки);
		Результат = Запрос.Выполнить();
		Структура.Вставить("ЕстьПеречисление", 	Не Результат.Пустой());
		Структура.Вставить("Заблокирован",		Структура.ЕстьПеречисление И Не Структура.ЕстьПравоРазблокировки И РегистрыСведений.уб_РазблокировкаОбъектов.СостояниеБлокировки(МассивОбъектов));
	Иначе
		Структура.Вставить("ЕстьПеречисление", 	Ложь);
		Структура.Вставить("Заблокирован",		Ложь);
	КонецЕсли;
	Возврат Структура;
	
КонецФункции



Функция ПричиныНеВключенияВОП() Экспорт
	
	Причины = Новый  СписокЗначений;
	
	Причины.Добавить("Есть замененный полис, вошел в отчет поставщику");
	Причины.Добавить("Не верно оформлен, будет переписан");
	Причины.Добавить("Замена квитанции");
	Причины.Добавить("В конверте");
	Причины.Добавить("Не наша квитанция");
	Причины.Добавить("","Другой вариант");
	
	Возврат Причины;
	
КонецФункции

Функция РуководительПодразделенияПоАгенту(Агент, Дата = Неопределено, Знач ТипРезультата = "структура") Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата()
	КонецЕсли;
	ТипРезультата = Лев(НРег(ТипРезультата), 3);
	Если ТипРезультата = "стр" Тогда
		Результат = Новый Структура;
		Результат.Вставить("Руководитель", 	Справочники.ФизическиеЛица.ПустаяСсылка());
		Результат.Вставить("Заместитель", 	Справочники.ФизическиеЛица.ПустаяСсылка());
	Иначе
		Результат = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДФЛ.Подразделение
	|ПОМЕСТИТЬ ВТПодразделение
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Период, Агент = &Агент) КАК ДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РП.Сотрудник,
	|	РП.Заместитель
	|ИЗ
	|	ВТПодразделение КАК ВТПодразделение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Период, &УсловиеВТ) КАК РП
	|		ПО (РП.Подразделение = ВТПодразделение.Подразделение)
	|ГДЕ
	|	НЕ РП.Уход";
	Если ТипРезультата = "стр" Тогда
		СтрокаЗаменыВТ = "ИСТИНА"
	ИначеЕсли ТипРезультата = "зам" Тогда
		СтрокаЗаменыВТ = "Заместитель"
	Иначе
		СтрокаЗаменыВТ = "НЕ Заместитель"
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", СтрокаЗаменыВТ);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Агент",	Агент);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипРезультата = "стр" Тогда
				Если Выборка.Заместитель Тогда
					Результат.Заместитель 	= Выборка.Сотрудник
				Иначе
					Результат.Руководитель  = Выборка.Сотрудник
				КонецЕсли;
			Иначе
				Результат = Выборка.Сотрудник
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // РуководительПодразделенияПоАгенту()

Функция КонтактнаяИнформация(Объект, ВидКИ, Знач Период = Неопределено, Предупреждать = Ложь, ВключаяУволенных = Ложь) Экспорт
	
	Рез = "";
	КИНезаполнено = Ложь;
	Если ЗначениеЗаполнено(Объект) И ЗначениеЗаполнено(ВидКИ) Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса = "";
		ЭтоФизЛицо = ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") И Не ВключаяУволенных;
		Если ЭтоФизЛицо Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент,
			|	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие КАК Выбытие
			|ПОМЕСТИТЬ ДвижениеФизлиц
			|ИЗ
			|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Период, Агент = &Объект) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Представление,
			|	ДвижениеФизлиц.Выбытие
			|ИЗ
			|	ДвижениеФизлиц КАК ДвижениеФизлиц
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|		ПО (КонтактнаяИнформация.Объект = ДвижениеФизлиц.Агент)
			|			И (КонтактнаяИнформация.Тип = &ВидКИ)";
			Если Период = Неопределено Тогда
				Период = ТекущаяДата()
			КонецЕсли;
			Запрос.УстановитьПараметр("Период", Период);
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И КонтактнаяИнформация.Тип = &ВидКИ";
		КонецЕсли;
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("ВидКИ",	ВидКИ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЭтоФизЛицо И Выборка.Выбытие Тогда
				Если Предупреждать Тогда
					#Если Клиент Тогда
						Предупреждение(Строка(Объект) + " не работает на дату " + ТекущаяДата());
					#КонецЕсли
				КонецЕсли;
			ИначеЕсли ПустаяСтрока(Выборка.Представление) Тогда
				КИНезаполнено = Истина
			Иначе
				Рез = Выборка.Представление;
			КонецЕсли;
		Иначе
			Если Не ЭтоФизЛицо Тогда
				КИНезаполнено = Истина
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	#Если Клиент Тогда
		Если Предупреждать И КИНезаполнено Тогда
			Заг = "Необходимо указать " + ВидКИ;
			СОО = "Не найден """ + ВидКИ + """ для '" + Объект + "'
			|
			|Зайдите в справочник объекта и внесите необходимые данные.
			|
			|Открыть форму?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Форма = Объект.ПолучитьФорму();
				//параметры, обрабатываемые самой формой для выделения поля с видом КИ при открытии
				Параметры = Новый Структура("ВыделитьКИ", ВидКИ);
				Форма.Параметры = Параметры;
				Форма.ОткрытьМодально();
				Рез = КонтактнаяИнформация(Объект, ВидКИ,, Ложь, ВключаяУволенных);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	Возврат Рез;
	
КонецФункции // КонтактнаяИнформацияФизлицаПоФизлицуИлиПользователю()

Функция СтруктураПараметровДобавленияКнопокДействийПоУмолчанию() Экспорт
	
	Возврат Новый Структура("КнопкаРазблокировки, КнопкаСкрытыеРеквизиты", Ложь, Истина);
	
КонецФункции // СтруктураПараметровДобавленияКнопокДействийПоУмолчанию()

Процедура ВыделитьКонтактнуюИнформацию(Форма, ИмяПанели, ИмяСтраницы = "КонтактнаяИнформация", ИмяЭлементаФормы = "КонтактнаяИнформация", ИмяКолонки = "Представление") Экспорт
	
	ЭлементыФормы = Форма.ЭлементыФормы;
	Панель = ЭлементыФормы[ИмяПанели];
	Панель.ТекущаяСтраница = Панель.Страницы[ИмяСтраницы];
	ТекущийЭлемент = Форма.ТекущийЭлемент;
	ТекущийЭлемент = ЭлементыФормы[ИмяЭлементаФормы];
	ТекущийЭлемент.ТекущаяКолонка = ТекущийЭлемент.Колонки[ИмяКолонки];
	
КонецПроцедуры

Функция ПроверитьНаличиеНомераПолиса(Период, СК, ВидБСО, НомерПолиса, УбратьЭтотПараметр = Истина) Экспорт
	
	//Возврат Истина;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Вложенный.НомерПолиса,
	|	МАКСИМУМ(Вложенный.ЕстьСвободныйНомер) КАК ЕстьСвободныйНомер,
	|	МАКСИМУМ(Вложенный.ЕстьВРегистреДвижений) КАК ЕстьВРегистреДвижений,
	|	ЕСТЬNULL(уб_ВидыБСО.Ссылка, &ВидБСО) КАК ВидБСО,
	|	ЕСТЬNULL(уб_ВидыБСО.Тип, ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис)) КАК Тип,
	|	ЕСТЬNULL(уб_ВидыБСО.ТипУчетаБСО, ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную)) КАК ТипУчетаБСО,
	|	ЕСТЬNULL(уб_ВидыБСО.УниверсальноеБСО, ЛОЖЬ) КАК УниверсальноеБСО
	|ИЗ
	|	(ВЫБРАТЬ
	|		"""" КАК ВидБСО,
	|		уб_СвободныеНомераПолисов.НомерПолиса КАК НомерПолиса,
	|		ИСТИНА КАК ЕстьСвободныйНомер,
	|		ЛОЖЬ КАК ЕстьВРегистреДвижений
	|	ИЗ
	|		РегистрСведений.уб_СвободныеНомераПолисов КАК уб_СвободныеНомераПолисов
	|	ГДЕ
	|		уб_СвободныеНомераПолисов.Период < &Дата
	|		И уб_СвободныеНомераПолисов.НомерПолиса = &НомерПолиса
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		уб_ДвиженияБСО.ВидБСО,
	|		уб_ДвиженияБСО.НомерПолиса,
	|		ЛОЖЬ,
	|		ИСТИНА
	|	ИЗ
	|		РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	|	ГДЕ
	|		уб_ДвиженияБСО.ВидБСО = &ВидБСО
	|		И уб_ДвиженияБСО.НомерПолиса = &НомерПолиса
	|		И уб_ДвиженияБСО.Период < &Дата) КАК Вложенный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК уб_ВидыБСО
	|		ПО (уб_ВидыБСО.Ссылка = Вложенный.ВидБСО)
	|
	|СГРУППИРОВАТЬ ПО
	|	Вложенный.НомерПолиса,
	|	уб_ВидыБСО.Ссылка,
	|	ЕСТЬNULL(уб_ВидыБСО.Тип, ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис)),
	|	ЕСТЬNULL(уб_ВидыБСО.ТипУчетаБСО, ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную)),
	|	ЕСТЬNULL(уб_ВидыБСО.УниверсальноеБСО, ЛОЖЬ)");
	Запрос.УстановитьПараметр("Дата", 		Период);
	Запрос.УстановитьПараметр("ВидБСО",		ВидБСО);
	Запрос.УстановитьПараметр("НомерПолиса",НомерПолиса);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура("ЕстьСвободныйНомер, ЕстьВРегистреДвижений", Ложь, Ложь);
	Результат.Вставить("Тип");
	Результат.Вставить("ТипУчетаБСО");
	Результат.Вставить("УниверсальноеБСО", Ложь);
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ТипУчетаБСО = Выборка.ТипУчетаБСО;
	КонецЕсли;
	Если ТипУчетаБСО = Неопределено 
		и ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		ТипУчетаБСО = ВидБСО.ТипУчетаБСО
	Иначе
		Результат.Вставить("НомерНеТребуется",ЛОЖЬ);
		Возврат Результат;
	КонецЕсли;
	Результат.Вставить("НомерНеТребуется", 	ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.КоличественныйПолисВручную 
	Или ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.НомернойПолисВручную
	Или ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную);	
	Возврат Результат;
	
КонецФункции



//проверка на наличие данных элементов основных форм документов в конфигурации (пока только они глючат)

// Функция переводит десятичное число в шестнадцатеричное
// Параметры:  _Число                - Число                - Десятичное число
// Возвращаемое значение:  Строка - Шестнадцатеричное число
Функция DecToHex(Знач _Число) Экспорт
	
	База = 16;
	Результат = "";
	Пока _Число <> 0 Цикл
		Поз =_Число % База;
		Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
		_Число = Цел(_Число / База);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции // DecToHex()

// Функция переводит шестнадцатеричное число в десятичное
// Параметры: _Hex     - Строка              - Шестнадцатеричное число
// Возвращаемое значение: Число   - Десятичное число
Функция HexToDec(Знач _Hex) Экспорт
	
	База = 16;
	_Hex = СокрЛП(_Hex);
	СтаршаяСтепень = СтрДлина(_Hex) - 1;
	Результат = 0;
	счСимволов = 1;
	Пока СтаршаяСтепень >= 0 Цикл
		_HexСимвол 		= Сред(_Hex, счСимволов, 1);
		Представление 	= Найти("0123456789ABCDEF", _HexСимвол) - 1;
		Результат 		= Результат + Представление * ВозвестиВСтепень(База, СтаршаяСтепень);
		СтаршаяСтепень 	= СтаршаяСтепень - 1;
		СчСимволов 		= СчСимволов + 1;
	КонецЦикла;   
	Возврат Результат;
	
КонецФункции // HexToDec()

Функция ВозвестиВСтепень(Число, Степень) Экспорт
	
	Результат = 1;
	Для Индекс = 1 по Степень Цикл
		Результат = Результат * Число;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ИмяПеречисления(ЗначениеПеречисления) Экспорт
	
	Мета = ЗначениеПеречисления.Метаданные();
	ИмяМенеджера = Мета.Имя;
	Возврат Мета.ЗначенияПеречисления.Получить(Перечисления[ИмяМенеджера].Индекс(ЗначениеПеречисления)).Имя
	
КонецФункции // ИмяПеречисления()

Процедура ПроверитьУникальностьНомеров() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Справочники");
	Массив.Добавить("ПланыВидовХарактеристик");
	Для Каждого Элемент Из Массив Цикл
		Для Каждого ОбъектМетаданных Из Метаданные[Элемент] Цикл
			ПроверитьУникальностьНомеровОбъектаМетаданных(ОбъектМетаданных, Элемент)
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУникальностьНомеровОбъектаМетаданных(ОбъектМетаданных, ТипМетаданных)
	
	СоотТипов = СоответствиеСтрокТиповМетаданных();
	Тип = СоотТипов.Получить(ТипМетаданных);
	Если ОбъектМетаданных.ДлинаКода > 0 Тогда 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Объект.Код
		|ПОМЕСТИТЬ ВТ_Кодов
		|ИЗ
		|	" + Тип + "." + ОбъектМетаданных.Имя + " КАК Объект
		|ГДЕ
		|	Объект.Предопределенный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Объект.Ссылка,
		|	Объект.Код
		|ИЗ
		|	" + Тип + "." + ОбъектМетаданных.Имя + " КАК Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Кодов КАК ВТ_Кодов
		|		ПО Объект.Код = ВТ_Кодов.Код
		|ГДЕ
		|	НЕ Объект.Предопределенный");
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.УстановитьНовыйКод();
				Попытка
					Объект.Записать()
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка записи ПроверитьУникальностьНомеровОбъектаМетаданных(): " + ОбъектМетаданных + ", Описание: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина)
				КонецПопытки;
				#Если Клиент Тогда
					Сообщить(Строка(Выборка.Ссылка) + ", Старый код: " + Выборка.Код + ", Новый код: " + Объект.Код)
				#КонецЕсли
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

//убирает из строки символы, запрещенные в именовании файлов
//инфо из википедии
//Многие операционные системы запрещают использование некоторых служебных символов. Запрещенные символы Windows:
// \ - разделитель подкаталогов
// / - разделитель ключей командного интерпретатора
// : - отделяет букву диска или имя альтернативного потока данных
// * - заменяющий символ (маска "любое количество любых символов")
// ? - заменяющий символ (маска "один любой символ")
// " - используется для указания путей, содержащих пробелы
// < - перенаправление ввода
// > - перенаправление вывода
// | - обозначает конвейер
//
//TODO специальные символы
Функция УбратьЗапрещенныеСимволыИзИмениФайла(Знач Строка) Экспорт
	
	Строка = СтрЗаменить(Строка, "\", "");
	Строка = СтрЗаменить(Строка, "/", "");
	Строка = СтрЗаменить(Строка, ":", "");
	Строка = СтрЗаменить(Строка, "*", "");
	Строка = СтрЗаменить(Строка, "?", "");
	Строка = СтрЗаменить(Строка, """", "");
	Строка = СтрЗаменить(Строка, "<", "");
	Строка = СтрЗаменить(Строка, ">", "");
	Строка = СтрЗаменить(Строка, "|", "");
	Возврат Строка;
	
КонецФункции // УбратьЗапрещенныеСимволыИзИмениФайла()

Функция СтруктураНастроекДвиженийДокументов(Имя) Экспорт
	
	Результат = Новый Структура;
	//проверки
	Структура = Новый Структура;
	Стр = Новый Структура;
	Стр.Вставить("Использование", 	Истина);
	Стр.Вставить("Текст",			"ВТ_ТЧ.Номерной И ВТ_ТЧ.НомерБСО = """"");
	Стр.Вставить("Ошибка",			"Не указан &СОО");
	Структура.Вставить("НеУказанНомерБСО", Стр);
	Стр = Новый Структура;
	Стр.Вставить("Использование", 	Истина);
	Стр.Вставить("Текст",			"ВТ_ТЧ.Поставщик <> ДБ.Поставщик");
	Стр.Вставить("Ошибка",			" поступало от поставщика '&РСПоставщик'. В документе указан другой поставщик: '&Поставщик'.");
	Структура.Вставить("НесоответствиеПоставщиков",	Стр);
	Стр = Новый Структура;
	Стр.Вставить("Использование", 	Истина);
	Стр.Вставить("Текст",			"ВТ_ТЧ.ОрганизацияАгент <> ДБ.ОрганизацияАгент");
	Стр.Вставить("Ошибка",			" поступало от ОргАгент '&РСОргАгент'. В документе указан другой ОргАгент: '&ОргАгент'.");
	Структура.Вставить("НесоответствиеОргАгентов", Стр);
	Стр = Новый Структура;
	Стр.Вставить("Использование", 	Истина);
	Стр.Вставить("Текст",			"ДБ.Период ЕСТЬ NULL");
	Стр.Вставить("Ошибка",			"&СОО не поступало!");
	Структура.Вставить("НеПоступало", Стр);
	Стр = Новый Структура;
	Стр.Вставить("Использование", 	Истина);
	Стр.Вставить("Текст",			"ДБ.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданВСК)");
	Стр.Вставить("Ошибка",			"&СОО имеет положение: '&РСПоложение'.");
	Структура.Вставить("НеверноеПоложение",	Стр);
	Результат.Вставить("СтруктураЗапроса", 	Структура);
	ТЗПолей = Новый ТаблицаЗначений;
	ТЗПолей.Колонки.Добавить("Реквизит");
	ТЗПолей.Колонки.Добавить("Источник");
	ТЗПолей.Колонки.Добавить("Значение");
	ТЗПолей.Колонки.Добавить("ЧастныйКод");
	//соответствие полей
	//TODO расположить в соответствии количества записей регистра движений
	Если Имя = "уб_СписаниеБСО" Тогда
		СтруктураЗапроса = Результат.СтруктураЗапроса;
		СтруктураЗапроса.НеверноеПоложение.Использование = Ложь;
		//поля
		СтрокаТЗ = ТЗПолей.Добавить();
		СтрокаТЗ.Реквизит = "Период";
		СтрокаТЗ.Источник = "Объект";
		СтрокаТЗ.Значение = "Дата";
		СтрокаТЗ = ТЗПолей.Добавить();
		СтрокаТЗ.Реквизит = "ВидБСО";
		СтрокаТЗ.Источник = "ТЧ";
		СтрокаТЗ.Значение = "ВидБСО";
		СтрокаТЗ = ТЗПолей.Добавить();
		СтрокаТЗ.Реквизит = "НомерБСО";
		СтрокаТЗ.Источник = "ТЧ";
		СтрокаТЗ.Значение = "НомерБСО";
		СтрокаТЗ.ЧастныйКод = "СокрЛП(Значение)";
		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // СтруктураНастроекДвиженийДокументов()

Процедура ДвиженияПоРегистрам3(
	Объект, 
	Отказ,
	Параметры
	) Экспорт
	
	МассивДанныхРС = Новый Массив;
	МассивДанныхРС.Добавить("Измерения");
	МассивДанныхРС.Добавить("Ресурсы");
	МассивДанныхРС.Добавить("Реквизиты");
	//
	Движения = Объект.Движения;
	ИмяДокумента = Объект.Метаданные().Имя;
	НастройкиДокумента = уб_temp.СтруктураНастроекДвиженийДокументов(ИмяДокумента);
	СтруктураЗапроса 	= НастройкиДокумента.СтруктураЗапроса;
	ТЗПолей				= НастройкиДокумента.ТЗПолей;
	Период = Новый Граница(Объект.МоментВремени(), ВидГраницы.Исключая);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЧ.*,
	|	ВЫБОР
	|		КОГДА ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных)
	|				ИЛИ ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную)
	|				ИЛИ ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйНетПолиса)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Номерной,
	|	НЕ(ТЧ.Ссылка.Проведен
	|			И ТЧ.Подтверждено) КАК Инфозапись
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ." + ИмяДокумента + "." + Параметры.ИмяТЧ + " КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И НЕ(ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных)
	|				ИЛИ ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную)
	|				ИЛИ ТЧ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяНетПолиса))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.*,
	|	ДБ.Период КАК ДБПериод,
	|	ДБ.ВидБСО КАК ДБВидБСО,
	|	ДБ.НомерБСО КАК ДБНомерБСО,
	|	ДБ.ДопНомерБСО КАК ДБДопНомерБСО,
	|	ДБ.Подтверждено КАК ДБПодтверждено,
	|	ДБ.СК КАК ДБСК,
	|	ДБ.Поставщик КАК ДБПостащик,
	|	ДБ.ОрганизацияАгент КАК ДБОрганизацияАгент,
	|	ДБ.АгентОтправитель КАК ДБАгентОтправитель,
	|	ДБ.Агент КАК ДБАгент,
	|	ДБ.ПоложениеБСО КАК ДБПоложениеБСО,
	|	ДБ.СостояниеБСО КАК ДБСостояниеБСО,
	|	ДБ.НомерПолиса КАК ДБНомерПолиса,
	|	ДБ.ГодПолиса КАК ДБГодПолиса,
	|	ДБ.СтраховойПолис КАК ДБСтраховойПолис,
	|	ДБ.НаОснованииБумажногоДокумента КАК ДБНаОснованииБумажногоДокумента,
	|	ДБ.ДатаВозврата КАК ДБДатаВозврата,
	|	ДБ.Заявка КАК ДБЗаявка,
	|	ДБ.КодОперации КАК ДБКодОперации,
	|	ДБ.Комментарий КАК ДБКомментарий,
	|	ДБ.Активность КАК ДБАктивность,
	|	ВЫБОР
	|		КОГДА &НеИспользоватьБлокировкиБСО = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ)
	|	КОНЕЦ КАК Блокировка,
	|	&Отказ,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ТЧ.ВидБСО) КАК ВидБСОСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ТЧ.СК) КАК СКСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ТЧ.Поставщик) КАК ПоставщикСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ДБ.Поставщик) КАК ДБПоставщикСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ТЧ.ОрганизацияАгент) КАК ОргАгентСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ДБ.ОрганизацияАгент) КАК ДБОргАгентСтрока
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|				&Период,
	|				Подтверждено
	|					) КАК ДБ
	|		ПО ВТ_ТЧ.ВидБСО = ДБ.ВидБСО
	|			И ВТ_ТЧ.НомерБСО = ДБ.НомерБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(&Период, ) КАК уб_БлокировкаБСОСрезПоследних
	|		ПО ВТ_ТЧ.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
	|			И ВТ_ТЧ.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Отказ УБЫВ,
	|	ВТ_ТЧ.НомерСтроки,
	|	ДБ.Период УБЫВ");
	
	ДопТекстОтказ = "";
	ДопТекст = "";
	Для Каждого КлючИЗначение Из СтруктураЗапроса Цикл
		Значение = КлючИЗначение.Значение;
		Если Значение.Использование Тогда
			Текст = Значение.Текст;
			ДопТекстОтказ = ДопТекстОтказ + "(" + Текст + ") ИЛИ ";
			ДопТекст = ДопТекст +
			"
			|ВЫБОР
			|		КОГДА " + Текст + "
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК " + КлючИЗначение.Ключ + ",";
		КонецЕсли;
	КонецЦикла;
	ДопТекстОтказ = 
	"ВЫБОР 
	|	КОГДА " + Лев(ДопТекстОтказ, СтрДлина(ДопТекстОтказ) - 5) + " ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Отказ,";
	ДопТекст = Лев(ДопТекст, СтрДлина(ДопТекст) - 1);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отказ", ДопТекстОтказ + ДопТекст);
	Запрос.УстановитьПараметр("Период", 						Период);
	Запрос.УстановитьПараметр("Ссылка", 						Объект.Ссылка);
	Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО", 	ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	СообщениеОшибки = Новый СообщениеПользователю;
	Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
		Если Выборка.Отказ Тогда
			Отказ = Истина;
			СОО = "БСО № '" + Выборка.НомерБСО + "' [" + Выборка.ВидБСОСтрока + "], СК: '" + Выборка.СКСтрока + "', Строка: '" + Выборка.НомерСтроки + "' ";
			Для Каждого КлючИЗначение Из СтруктураЗапроса Цикл
				Стр = КлючИЗначение.Значение;
				Если Стр.Использование И Выборка[КлючИЗначение.Ключ] Тогда
					Текст = Стр.Ошибка;
					Текст = СтрЗаменить(Текст, "&СОО", 			СОО);
					Текст = СтрЗаменить(Текст, "&РСПоставщик",	Выборка.ДБПоставщикСтрока);
					Текст = СтрЗаменить(Текст, "&Поставщик",	Выборка.ПоставщикСтрока);
					Текст = СтрЗаменить(Текст, "&РСОргАгент",	Выборка.ДБОргАгентСтрока);
					Текст = СтрЗаменить(Текст, "&ОргАгент",		Выборка.ОргАгентСтрока);
					Текст = СтрЗаменить(Текст, "&РСПоложение",	Выборка.ПоложениеБСО);
					СообщениеОшибки.Текст = СообщениеОшибки.Текст + Текст;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Не Отказ Тогда
			Если Выборка.Номерной Тогда
				Движение = Движения.уб_ДвиженияБСО.Добавить();
				ДобавитьДвижение(Движение, "Период", ТЗПолей, Выборка);
				Для Каждого Элемент Из МассивДанныхРС Цикл
					Для Каждого Реквизит Из Метаданные.РегистрыСведений.уб_ДвиженияБСО[Элемент] Цикл
						ДобавитьДвижение(Движение, Реквизит.Имя, ТЗПолей, Выборка);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не Отказ Тогда
		Движения.уб_ДвиженияБСО.Записать();
	КонецЕсли;
	Если Не ПустаяСтрока(СообщениеОшибки.Текст) Тогда
		СообщениеОшибки.Текст = Параметры.Заголовок + "
		|" + СообщениеОшибки.Текст + "
		|" + Параметры.СооХвост;
		СообщениеОшибки.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДвижение(Движение, Имя, СтруктураПолей, Выборка)
	
	Движение[Имя] = ?(СтруктураПолей.Свойство(Имя), Выборка[СтруктураПолей[Имя]], Выборка[Имя]);
	
КонецПроцедуры

Функция СоответствиеСтрокТиповМетаданных() Экспорт
	
	//TODO добавлять
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Справочники", 				"Справочник");
	Соответствие.Вставить("ПланыВидовХарактеристик",    "ПланВидовХарактеристик");
	Соответствие.Вставить("Документы",    				"Документ");
	Соответствие.Вставить("Перечисления",    			"Перечисление");
	Соответствие.Вставить("РегистрыСведений",			"РегистрСведений");
	Соответствие.Вставить("РегистрыНакопления",    		"РегистрНакопления");
	Возврат Соответствие;
	
КонецФункции // СоответствиеСтрокТиповМетаданных()

//маска X.XX.XX.X либо X.XX.XX.X.XXXX
Функция ПреобразоватьВерсиюКонфигурацииВЧисло(Знач Строка) Экспорт
	
	Строка = СокрЛП(Строка);
	ТекНомер = Лев(Строка, 1);
	//обрабатываем второй номер
	Обрез = Сред(Строка, 3);
	Для Индекс = 1 По 2 Цикл
		Инд = Найти(Обрез, ".");
		Если Инд = 2 Тогда
			ТекНомер = ТекНомер + "0" + Лев(Обрез, 1);
			Обрез = Сред(Обрез, 3);
		Иначе
			ТекНомер = ТекНомер + Лев(Обрез, 2);
			Обрез = Сред(Обрез, 4);
		КонецЕсли;
	КонецЦикла;
	ТекНомер = ТекНомер + Лев(Обрез, 1);
	Если СтрДлина(Обрез) = 6 Тогда
		ТекНомер = ТекНомер + Прав(Обрез, 4)
	КонецЕсли;
	Попытка
		Результат = Число(ТекНомер)
	Исключение
		Результат = 0
	КонецПопытки;
	Возврат Результат
	
КонецФункции // ПреобразоватьВерсиюКонфигурацииВЧисло()

Функция СсылкаСправочникаПоНаименованию(Вид,Наименование,Создать = Истина,Владелец =Неопределено,Свойства = Неопределено) Экспорт
	Попытка
		Если Владелец = Неопределено Тогда
			_Ссылка = Справочники[Вид].НайтиПоНаименованию(Наименование,Истина);
		Иначе
			_Ссылка = Справочники[Вид].НайтиПоНаименованию(Наименование,Истина,,Владелец);
		КонецЕсли;	
		Если _Ссылка.Пустая() Тогда
			Если Создать=Истина Тогда
				_Об =  Справочники[Вид].СоздатьЭлемент();
				_Об.Наименование = Наименование;
				Попытка
					Если Не Владелец =Неопределено Тогда
						_Об.Владелец = Владелец;
					КонецЕсли;
				Исключение
				КонецПопытки;	
				Попытка
					Если НЕ Свойства = Неопределено Тогда
						ЗаполнитьЗначенияСвойств(_Об,Свойства);
					КонецЕсли;	
				Исключение
				КонецПопытки;
				
				Попытка
					_Об.Записать();
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи справочника " + Вид + " " + Наименование + " " + ОписаниеОшибки());
				КонецПопытки;
				_Ссылка = _Об.Ссылка;
			Иначе
				_Ссылка = Справочники[Вид].ПустаяСсылка;
			КонецЕсли;
			
		КонецЕсли;	
		Возврат _Ссылка;
	Исключение
	КонецПопытки;	
	
КонецФункции	

Процедура ПриНачалеРаботыСистемыОбщее() Экспорт
	
	//{{ДОБАВЛЕНИЕ...............................................................................
	ПараметрыСеанса.уб_ЭтоМенеджер = Ложь;
	Если уб_КЭШируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
		сРоль = " (Менеджер На Точке)";
		ПараметрыСеанса.уб_ЭтоМенеджер = Истина;
	Иначе
		ПараметрыСеанса.уб_ЭтоМенеджер = Ложь;
		Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
			сРоль = " (Полные Права)";
		ИначеЕсли уб_КЭШируемые.ДоступностьРоли("уб_СотрудникОтделаБСО") Тогда
			сРоль = " (Сотрудник Отдела БСО)";
		Иначе
			сРоль = " (@)";
		КонецЕсли;
	КонецЕсли;
	ИмяБазыДанных = уб_temp.ПолучитьИмяБазыДанных();
	#Если Клиент Тогда
		Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
			сСЛ = " [без СЛ для полных прав]";
		Иначе
			//Если НЕ уз_СистемаЛицензирования.Инициализировать() Тогда
			//	сСЛ = " [**]";
			//	Если НЕ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("уб_УполномоченныйСотрудник") Тогда
			//		ПрекратитьРаботуСистемы();
			//		Возврат;
			//	КонецЕсли;
			//Иначе
			//	Если НЕ глСистемаЛицензирования.Свойство("ОсновнаяПоставка") Тогда
			//		сСЛ = " [* СЛ в режиме отладки]";
			//	Иначе
			//		глСЛЗапущена = Истина;
			//		сСЛ = "";
			//	КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
		НовыйЗаголовок = "Управление Страховым Брокером <" + ПолноеИмяПользователя() + ">" + сРоль;
		УстановитьЗаголовокСистемы(НовыйЗаголовок + сСЛ + " База данных: " + ИмяБазыДанных);
	#КонецЕсли
	НРегИмяБазыДанных = НРег(ИмяБазыДанных);
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") И (Найти(НРегИмяБазыДанных, "temp") Или Найти(НРегИмяБазыДанных, "ib_for"))
		И Справочники.уб_Константы.ЭтоРабочаяБаза.ЗначениеКонстанты = Истина
		Тогда
		Объект = Справочники.уб_Константы.ЭтоРабочаяБаза.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка 	= Истина;
		Объект.ЗначениеКонстанты		= Ложь;
		Попытка
			Объект.Записать();
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина)
		КонецПопытки;
	КонецЕсли;
	//уб_temp.УстановитьПараметрыСеансаКонстант();
	
КонецПроцедуры

Функция СистемаХ86() Экспорт
	Результат = Ложь;
	Попытка
		Locator = Новый COMОбъект("WbemScripting.SWbemLocator");
		ServicesSet = Locator.ConnectServer(".", "root\cimv2",,);
		Items = ServicesSet.ExecQuery("Select * from Win32_ComputerSystem");
		Для Каждого Item Из Items Цикл
			Результат = Найти(Item.SystemType, "x64") = 0;
		КонецЦикла;
	Исключение
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция ДобавитьРабочиеДни(Дата, КоличествоДней) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ " + КоличествоДней + "
	|	ПК.ДатаКалендаря КАК ДатаКалендаря
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК ПК
	|ГДЕ
	|	ПК.Пятидневка = 1
	|	И ПК.ДатаКалендаря > &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаКалендаря");
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		//прогоняем до конца
	КонецЦикла;
	Время = Дата - НачалоДня(Дата);
	Возврат Выборка.ДатаКалендаря + Время;
	
КонецФункции // ДобавитьРабочиеДни()





Функция ДоступКДанным(Данные, МассивИменПолей = Неопределено
	//, Параметры = Неопределено !неиспользуется
	) Экспорт
	
	Результат = Истина;
	Если ПараметрыСеанса.уб_ЭтоМенеджер
		И Не уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПросмотрВсехПолисовИЗаявок, Ложь) 
		Тогда
		Результат = Ложь;
		//Если Параметры = Неопределено Тогда
		//	Параметры = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		//	Параметры.ВключаяВыбывших	= Истина;
		//	Параметры.ТолькоТочкиПродаж	= Истина;
		//	уб_СС.ПодчиненныеРуководителя(,, Параметры);
		//	уб_temp.ДополнитьСписокСотрудниковПредшественниками(Параметры.СписокСотрудников);
		//КонецЕсли;
		//Параметры.ПодразделенияПоДокументу = Новый СписокЗначений;
		//Единый алгоритм со списком
		ТекущееФизЛицо = ПараметрыСеанса.уб_ТекущееФизЛицо;
		Подчиненные  = уб_КЭШируемые.Подчиненные(ТекущееФизЛицо);//;уб_СтраховойБрокер.Подчиненные(ПараметрыСеанса.уб_ТекущееФизЛицо)
		Если ТипЗнч(Данные) = Тип("ДокументОбъект.уб_ОплатаПолисов") Тогда
			Подчиненные2 = уб_КЭШируемые.Подчиненные(ТекущееФизЛицо,Данные.Зарплатныйпериод);//;уб_СтраховойБрокер.Подчиненные(ПараметрыСеанса.уб_ТекущееФизЛицо)
			Для каждого ТекСотрудник из Подчиненные2 Цикл
				Если Подчиненные.Найти(ТекСотрудник) = Неопределено Тогда
					Подчиненные.Добавить(ТекСотрудник);
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		Если МассивИменПолей = Неопределено Тогда
			МассивИменПолей = уб_temp.МассивИменПроверяемыхПолей(Данные.Ссылка);
		КонецЕсли;
		Для Каждого ЭлементМассива Из МассивИменПолей Цикл
			Если НЕ Подчиненные.Найти(Данные[ЭлементМассива]) = Неопределено Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
			//СтрокаТЗ = Параметры.ТЗ.Найти(Данные[ЭлементМассива], "Сотрудник");
			//Если СтрокаТЗ <> Неопределено Тогда
			//	Результат = Истина;
			//  Зачем-то накапливаем подразделения - это не используется
			//	Если Параметры.ПодразделенияПоДокументу.НайтиПоЗначению(СтрокаТЗ.Подразделение) = Неопределено Тогда
			//		Параметры.ПодразделенияПоДокументу.Добавить(СтрокаТЗ.Подразделение, СтрокаТЗ.ПодразделениеСтрока);
			//	КонецЕсли;
			//Иначе
			//	Если Параметры.СписокСотрудников.НайтиПоЗначению(Данные[ЭлементМассива]) <> Неопределено Тогда//предшественник
			//		Результат = Истина;
			//	КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ТекущееФизЛицо) Тогда
			//проверка: если менеджер назначен для пролонгации, то разрешить
			Если ТипЗнч(Данные) = Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
				ТекстЗапроса = "ВЫБРАТЬ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
				|ИЗ
				|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				|ГДЕ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Данные
				|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация)
				|	И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер = &ТекФизЛицо
				|			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора.Агент = &ТекФизЛицо)";
			ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.уб_СтраховойПолис") Тогда
				ТекстЗапроса = "ВЫБРАТЬ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
				|ИЗ
				|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				|ГДЕ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация)
				|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора = &Данные
				|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер = &ТекФизЛицо";
			КонецЕсли;
			Если ТекстЗапроса <> Неопределено Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("Данные", Данные.Ссылка);
				Запрос.УстановитьПараметр("ТекФизЛицо", ТекущееФизЛицо);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ДоступКДанным()

Функция МассивИменПроверяемыхПолей(Знач Тип) Экспорт
	
	МассивИменПолей = Новый Массив;
	Если ТипЗнч(Тип) <> Тип("Тип") Тогда
		Тип = ТипЗнч(Тип)
	КонецЕсли;
	Если Тип = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		МассивИменПолей.Добавить("Менеджер");
		// из-за добавления курьера руководитель СВС считается руководителем по любой заявке
		// и имеет право менять флаг ТребуетсяПроверкаРуководителем
		//МассивИменПолей.Добавить("Курьер");
	ИначеЕсли Тип = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		МассивИменПолей.Добавить("Агент");
	ИначеЕсли Тип = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		МассивИменПолей.Добавить("Агент");
		МассивИменПолей.Добавить("АгентКуда");
	ИначеЕсли Тип = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		МассивИменПолей.Добавить("Агент");
	КонецЕсли;
	Возврат МассивИменПолей;
	
КонецФункции // МассивИменПроверяемыхПолей()

Процедура Пауза(ИнтервалОжидания) Экспорт
	
	ИмяФайла = "sleep.js";
	Если Не ФайлСуществует(КаталогВременныхФайлов(), ИмяФайла) Тогда
		Если ПравоДоступа("Вывод", Метаданные) Тогда
			Скрипт = Новый ТекстовыйДокумент();
			Скрипт.УстановитьТекст
			(
			"if (WScript.Arguments.Count()==0)
			|    WScript.Quit();
			|else
			|    if (isNaN(parseInt(WScript.Arguments(0))))
			|        WScript.Quit();
			|WScript.Sleep(WScript.Arguments(0));"
			);
			Путь = КаталогВременныхФайлов() + ИмяФайла;
			Скрипт.Записать(Путь, КодировкаТекста.ANSI);
		Иначе
			КаталогВнешнихКомпонент = ПараметрыСеанса.уб_Константы.КаталогВнешнихКомпонент;
			Если ТипЗнч(КаталогВнешнихКомпонент) = Тип("Строка") Тогда
				КаталогВнешнихКомпонент = СокрЛП(КаталогВнешнихКомпонент);
				Если Прав(КаталогВнешнихКомпонент, 1) <> "\" Тогда
					КаталогВнешнихКомпонент = КаталогВнешнихКомпонент + "\"
				КонецЕсли;
				Если ФайлСуществует(КаталогВнешнихКомпонент, ИмяФайла) Тогда
					Путь = КаталогВнешнихКомпонент + ИмяФайла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Путь = КаталогВременныхФайлов() + ИмяФайла;
	КонецЕсли;
	Если Путь <> Неопределено Тогда
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run("WScript.exe """ + Путь + """ " + Формат(ИнтервалОжидания, "ЧГ=0"), 0, -1);
	КонецЕсли;
	
КонецПроцедуры // Пауза

Функция ФайлСуществует(ПутьКПапке, ИмяФайла) Экспорт
	
	objShellApp = Новый COMОбъект("Shell.Application");
	objFolder = objShellApp.NameSpace(ПутьКПапке);
	objItem = objFolder.ParseName(ИмяФайла);
	Если objItem = Неопределено Тогда
		Возврат Ложь;
	Иначе
		objItem = Неопределено;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьФайлНаКлиенте(ИмяФайла, СтруктураФайла = Неопределено) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	СтруктураФайла = Новый Структура("Расширение, Размер, ВремяИзменения");
	Если Файл.Существует() Тогда
		СтруктураФайла.Расширение = Файл.Расширение;
		Если НЕ Файл.ЭтоКаталог() Тогда
			СтруктураФайла.Размер = Файл.Размер();
			СтруктураФайла.ВремяИзменения = Файл.ПолучитьВремяИзменения();
		КонецЕсли;
		Файл = Неопределено;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДоговорПоВидуБСО(ВидБСО, Знач Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПБ.Ссылка.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Поставщик
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК ПБ
	|ГДЕ
	|	ПБ.Ссылка.Проведен
	|	И ПБ.ВидБСО = &ВидБСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СП.ВидБСО,
	|	СП.Ссылка.Вид
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
	|ГДЕ
	|	НЕ СП.Ссылка.ПометкаУдаления
	|	И СП.ВидБСО = &ВидБСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДК.Ссылка,
	|	ДК.Владелец КАК Владелец,
	|	ДК.ВидСП,
	|	ДК.ДатаЗаключенияДоговора,
	|	ДК.Наименование
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поставщик КАК ВТ_Поставщик
	|		ПО ДК.Владелец = ВТ_Поставщик.Поставщик
	|ГДЕ
	|	(ДК.ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора > &Дата)
	|	И ДК.ДатаЗаключенияДоговора <= &Дата
	|	И ДК.РасширениеНазвания <> ""---""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДК.ВидСП
	|ИТОГИ ПО
	|	Владелец");
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("Дата",	Дата);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Результат = "";
	Если Выборка.Количество() = 1 Тогда
		ВыборкаВидСП = Пакет[1].Выбрать();
		Если ВыборкаВидСП.Количество() = 1 Тогда
			ВыборкаВидСП.Следующий();
			ТекущийВидСП = ВыборкаВидСП.Вид;
		КонецЕсли;
		Выборка.Следующий();
		Выборка = Выборка.Выбрать();
		Если ТекущийВидСП <> Неопределено Тогда
			//ищем по виду сп
			Пока Выборка.Следующий() Цикл
				Если Выборка.ВидСП = ТекущийВидСП Тогда
					Результат = Выборка.Наименование + ?(ЗначениеЗаполнено(Выборка.ДатаЗаключенияДоговора), " от " + Формат(Выборка.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy"), "");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Результат = "" Тогда
			//берем первый пустой
			Выборка.Сбросить();
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат
	
КонецФункции

//Обновление сводки HTML для заявки
Функция СводкаПоЗаявке(Заявка, ТекстШапки = "", ЦветФона = "", СкрытьКонтакты = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	З.Менеджер КАК Менеджер,
	|	З.Страхователь КАК Страхователь,
	|	З.Тип КАК Тип,
	|	З.ПриоритетЗадачи КАК ПриоритетЗадачи,
	|	З.МестоВстречи КАК МестоВстречи,
	|	З.Дата КАК Дата,
	|	З.Контакты КАК Контакты,
	|	З.Банк КАК Банк,
	|	З.Комментарий КАК Комментарий,
	|	З.БСО.(
	|		НомерСтроки КАК НомерСтроки,
	|		НомерБСО КАК НомерБСО,
	|		СК КАК СК
	|	) КАК БСО,
	|	З.ЦельВыезда КАК ЦельВыезда,
	|	З.Город КАК Город,
	|	З.СтанцияМетро.Наименование КАК СтанцияМетроСтрока,
	|	З.Курьер КАК Курьер,
	|	З.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
	|ГДЕ
	|	З.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Текст = //"<div align='center'><b><font size='5'>Информация по заявке</font></b></div>
		//Добавим в заголовок внутреннее значение заявки, для провреки необходимости переформирования
		"<head>
		|<title>" + ЗначениеВСтрокуВнутр(Заявка) + "
		|</title>
		|<style>
		|table{
		| border-collapse:collapse;
		|}
		|td {
		|  font-family: Arial, Times, sans-serif; /* Гарнитура текста */
		|  font-size: 8pt;
		|  ms-filter:'progid:DXImageTransform.Microsoft.Alpha(opacity=99)';
		|  filter:progid:DXImageTransform.Microsoft.Alpha(opacity=99);
		|
		|  border: 1px solid RGB(203,210,214);
		|  padding:5px;
		|  }
		|  .c1 {
		|  color: RGB(0,0,255);
		|  text-align: center;
		|  }
		|.c3{
		|  color: RGB(0,0,255);
		|  text-align: center;
		|  font-weight:bold;
		|  font-size: 9pt;
		|  letter-spacing: 3px;
		|  }
		|.c4{
		|  font-weight:bold;
		|  font-size: 9pt;
		|  letter-spacing: 3px;
		|  }
		|</style>
		|</head><body" + ?(ПустаяСтрока(ЦветФона), "", " bgcolor = """ + ЦветФона + """") + ">" + ТекстШапки + "
		|<table width='100%'>
		|<col width='130'> <col >"
		+ ДобавитьСтроку("Менеджер:",			Выборка.Менеджер,, "c3", "c4")
		+ ДобавитьСтроку("Страхователь:",		Выборка.Страхователь)
		+ ДобавитьСтроку("Курьер:",			    Выборка.Курьер,, "c3", "c4")
		+ ДобавитьСтроку("Тип выезда:",			Выборка.Тип)
		+ ДобавитьСтроку("Приоритет:",			Выборка.ПриоритетЗадачи)
		+ ДобавитьСтроку("Место встречи:",		?(ПустаяСтрока(Выборка.Город), "", Выборка.Город + " ") + ?(ПустаяСтрока(Выборка.СтанцияМетроСтрока), "", "м. " + Выборка.СтанцияМетроСтрока + " ") + Выборка.МестоВстречи)
		+ ДобавитьСтроку("Дата/время встречи:",	Формат(Выборка.Дата,"ДФ='dd.MM.yyyy <b>HH:mm</b>'"))
		+ ?(СкрытьКонтакты=Истина,"",ДобавитьСтроку("Контакты:",			Выборка.Контакты))           
		+ ДобавитьСтроку("Банк:",				Выборка.Банк)
		+ ДобавитьСтроку("Цель выезда:",		Выборка.ЦельВыезда);
		Массив = Выборка.Ссылка.БСО.Выгрузить();
		КоличествоСтрок = Массив.Количество();
		НомерБСО ="";
		Для каждого БСО из Массив Цикл
			//Если Не ПустаяСтрока(БСО.НомерБСО) Тогда
				НомерБСО = ?(НомерБСО="","",", ")+СокрЛП(БСО.СК)+"("+СокрЛП(БСО.НомерБСО)+")";
			//КонецЕсли;	
		КонецЦикла;	
		Текст = Текст
		+ ДобавитьСтроку("Кол-во строк заявки:",КоличествоСтрок, Ложь)
		+ ДобавитьСтроку("БСО: ",НомерБСО, Ложь)
		+ ДобавитьСтроку("Комментарий:",		Выборка.Комментарий)
		+ "</table></body>";
	Иначе
		Текст = ""
	КонецЕсли;
	Возврат Текст
	
КонецФункции

//Добавление строки таблицы в сводку
Функция ДобавитьСтроку(Поле1, Поле2, СПроверкой = Истина, ИмяКласса1 = "c1", ИмяКласса2 = "c2")
	
	Если СПроверкой И Не ЗначениеЗаполнено(Поле2) Тогда
		Результат = "";
	Иначе
		Результат = 
		"<tr>
		|  <td align='right'><span class='" + ИмяКласса1 + "'>" + Поле1 + "</span></td>
		|  <td ><span class='" + ИмяКласса2 + "'>" + Поле2 + "</span></td>
		|"
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция СозданиеОписанияТиповПоТипу(Знач Тип) Экспорт
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		Тип = Тип(Тип)
	КонецЕсли;
	Массив = Новый Массив;
	Массив.Добавить(Тип);
	Возврат Новый ОписаниеТипов(Массив);
	
КонецФункции // СозданиеОписанияТиповПоТипу()

Функция ПолучитьСписокЗначенийСвойства(ЭлементСправочника, ИмяСвойства = "", ВключаяНеИспользуемые = Ложь, ТипЗначенияРезультата = "СписокЗначений",ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА СпрТЧ.Ссылка.ЕстьЗначения
	               |			ТОГДА СпрТЧ.Значение
	               |		ИНАЧЕ СпрТЧ.ИмяСвойства
	               |	КОНЕЦ КАК Значение,
	               |	СпрТЧ.НомерСтроки КАК НомерСтроки,
	               |	СпрТЧ.Ссылка,
	               |	СпрТЧ.Ссылка.ЗначениеПоУмолчанию как ЗначениеПоУмолчанию,
	               |	СпрТЧ.ИмяСвойства
	               |ИЗ
	               |	Справочник.уб_СвойстваИЗначения.ЗначенияСвойств КАК СпрТЧ
	               |ГДЕ
	               |	(СпрТЧ.Используется = ИСТИНА
	               |			ИЛИ &ВключаяНеИспользуемые = ИСТИНА)
	               |	И &ТекстУсловия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("ВключаяНеИспользуемые", ВключаяНеИспользуемые);
	
	Если ТипЗнч(ЭлементСправочника) = Тип("Строка") Тогда
		Запрос.УстановитьПараметр("Наименование", ЭлементСправочника);
		ТекстУсловия = "СпрТЧ.Ссылка.Наименование = &Наименование";
	Иначе
		Запрос.УстановитьПараметр("Ссылка", ЭлементСправочника);
		ТекстУсловия = "СпрТЧ.Ссылка = &Ссылка";
	КонецЕсли;
	
	Если Не ИмяСвойства = "" Тогда
		ТекстУсловия = ТекстУсловия + " И СпрТЧ.ИмяСвойства = &ИмяСвойства";
		Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловия", ТекстУсловия);
	
	//ЭтоСписок = ТипЗначенияРезультата = "СписокЗначений";
	//Если ЭтоСписок Тогда
	Если ТипЗначенияРезультата = "СписокЗначений" Тогда
		Результат = Новый СписокЗначений;
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗначенияРезультата = "СписокЗначений" Тогда
			Результат.Добавить(Выборка.Значение, Выборка.ИмяСвойства);
		Иначе
		    Результат.Добавить(Выборка.Значение);
		КонецЕсли;	
	КонецЦикла;
	Выборка.Сбросить();
	Пока выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.ЗначениеПоУмолчанию) Тогда
			Прервать;
		КонецЕсли;	
		Если Выборка.ЗначениеПоУмолчанию = 	Выборка.ИмяСвойства Тогда
			ЗначениеПоУмолчанию =  Выборка.Значение;
			Прервать
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыйСимволДляСтрок(Символ, ВключаяСимволыUID = Ложь)

	Код = КодСимвола(Символ);
	Возврат (ВключаяСимволыUID И ((Код >= 32 И Код <= 64) Или (Код >= 123 И Код <= 126)))
		Или (Код >= 48 		И Код <= 57) 	// цифры
		Или (Код >= 65 		И Код <= 90) 	// заглавные английские
		Или (Код >= 97 		И Код <= 122) 	// строчные английские
		Или (Код >= 1040 	И Код <= 1103) 	// кириллица

КонецФункции // ДопустимыйСимволДляСтрок()
	
Функция УбратьНедопустимыеСимволыДляСтрок(Знач Строка, ВключаяСимволыUID = Ложь) Экспорт

	Рез = "";
	Строка = СокрЛП(Строка);
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Индекс, 1);
		Если ДопустимыйСимволДляСтрок(Символ, ВключаяСимволыUID) Тогда
			Рез = Рез + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;

КонецФункции // УбратьНедопустимыеСимволыДляСтрок()

#Если Клиент Тогда
Процедура НастройкаСкрытьПоказатьПоля(Параметры) Экспорт

	ЕстьОшибка = Ложь;
	МассивОшибок = Новый Массив;
	
	
	// кнопку не создаем, блокируем все поля из списка
	Для Каждого СтрокаСЗ Из Параметры.Подменю Цикл
		СтруктураЭлемента = СтрокаСЗ.Значение;
		Если СтруктураЭлемента.УсловиеЗапрета = Истина Тогда
			Поле = Параметры.ЭлементыФормы.Найти(СтруктураЭлемента.Элемент);
			Если Поле = Неопределено Тогда
				МассивОшибок.Добавить("Не найден элемент формы " + СтруктураЭлемента.Элемент);
			Иначе
				Поле.Видимость = Ложь;
			КонецЕсли;
		Иначе
			Действие = Новый Действие("ОбработчикДопКнопокДействийФормы");
			// общая кнопка
			Подменю = Параметры.ЭлементыФормы.Найти("СкрытьПоказатьВсе");
			Если Подменю = Неопределено Тогда
				Подменю = Параметры.ЭлементыФормы.Добавить(Тип("Кнопка"), "СкрытьПоказатьВсе", Истина);
				Подменю.УстановитьДействие("Нажатие", Действие);
				Подменю.Заголовок 	= "Скрыть поля";
				Подменю.Верх		= Параметры.ПозицияВерх;
				Подменю.Лево		= Параметры.ПозицияЛево;
				Подменю.Ширина		= Параметры.ШиринаКнопки;
				Подменю.Высота		= Параметры.ВысотаКнопки;
				Подменю.Картинка	= Параметры.КартинкаСкрытьВсе;
				Подменю.РежимМеню 	= ИспользованиеРежимаМеню.ИспользоватьДополнительно;
			КонецЕсли;
			
			//Для Каждого СтрокаСЗ Из Параметры.Подменю Цикл
				Если Не СтрокаСЗ.Пометка Тогда
					Кнопка = Подменю.Кнопки.Добавить();
					Кнопка.ТипКнопки 	= ТипКнопкиКоманднойПанели.Действие;
					Кнопка.Имя			= "СкрытьПоказать" + СтруктураЭлемента.Элемент;
					Кнопка.Действие		= Действие;
					Кнопка.Текст 		= "Скрыть " + СтрокаСЗ.Представление;
					Кнопка.Пометка		= Ложь;
					Кнопка.Картинка		= Параметры.КартинкаСкрыть;
				КонецЕсли;
			//КонецЦикла;		
		КонецЕсли;	
	КонецЦикла;
	
	

	
	//Если Параметры.УсловиеЗапрета Тогда
	//	// кнопку не создаем, блокируем все поля из списка
	//	Для Каждого СтрокаСЗ Из Параметры.Подменю Цикл
	//		Поле = Параметры.ЭлементыФормы.Найти(СтрокаСЗ.Значение);
	//		Если Поле = Неопределено Тогда
	//			МассивОшибок.Добавить("Не найден элемент формы " + СтрокаСЗ.Значение);
	//		Иначе
	//			Поле.Видимость = Ложь;
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	Действие = Новый Действие("ОбработчикДопКнопокДействийФормы");
	//	// общая кнопка
	//	Подменю = Параметры.ЭлементыФормы.Найти("СкрытьПоказатьВсе");
	//	Если Подменю = Неопределено Тогда
	//		Подменю = Параметры.ЭлементыФормы.Добавить(Тип("Кнопка"), "СкрытьПоказатьВсе", Истина);
	//		Подменю.УстановитьДействие("Нажатие", Действие);
	//		Подменю.Заголовок 	= "Скрыть поля";
	//		Подменю.Верх		= Параметры.ПозицияВерх;
	//		Подменю.Лево		= Параметры.ПозицияЛево;
	//		Подменю.Ширина		= Параметры.ШиринаКнопки;
	//		Подменю.Высота		= Параметры.ВысотаКнопки;
	//		Подменю.Картинка	= Параметры.КартинкаСкрытьВсе;
	//		Подменю.РежимМеню 	= ИспользованиеРежимаМеню.ИспользоватьДополнительно;
	//	КонецЕсли;
	//	
	//	Для Каждого СтрокаСЗ Из Параметры.Подменю Цикл
	//		Если Не СтрокаСЗ.Пометка Тогда
	//			Кнопка = Подменю.Кнопки.Добавить();
	//			Кнопка.ТипКнопки 	= ТипКнопкиКоманднойПанели.Действие;
	//			Кнопка.Имя			= "СкрытьПоказать" + СтрокаСЗ.Значение;
	//			Кнопка.Действие		= Действие;
	//			Кнопка.Текст 		= "Скрыть " + СтрокаСЗ.Представление;
	//			Кнопка.Пометка		= Ложь;
	//			Кнопка.Картинка		= Параметры.КартинкаСкрыть;
	//		КонецЕсли;
	//	КонецЦикла;
	//	// подменю
	//КонецЕсли;
	ТекстОшибки = МассивОшибокВСтроку(МассивОшибок, "НастройкаСкрытьПоказатьПоля():"); 
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
	    уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки, ПараметрыСеанса.уб_РежимОтладки > 4, Истина);
	КонецЕсли;

КонецПроцедуры

Функция ПараметрыСкрытьПоказатьПоля() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("ЭлементыФормы");
	Структура.Вставить("ПозицияЛево",		0);
	Структура.Вставить("ПозицияВерх",		0);
	//Структура.Вставить("УсловиеЗапрета",    ПараметрыСеанса.уб_ЭтоМенеджер);
	// содержит список значений:
	//	Значение: Структура "Элемент,УсловиеЗапрета" имя поля формы
	//	Представление: текст кнопки типа "поле КВ". Потом добавляется "Скрыть" или "Убрать"
	//	Пометка: если Ложь, добавляется в подменю кнопки, иначе нет (регулировать видимость можно только общей кнопкой)
	//	Картинка: не используется
	Структура.Вставить("Подменю", Новый СписокЗначений);  
	// содержит значение кнопки СкрытьПоказатьВсе, при изменении которой устанавливаются значения для всего подменю
	Структура.Вставить("ПринудительныйФлаг",    Ложь);
	// картинки главной кнопки
	Структура.Вставить("КартинкаСкрытьВсе",		БиблиотекаКартинок.ПользовательСАутентификацией);
	Структура.Вставить("КартинкаПоказатьВсе",	БиблиотекаКартинок.Пользователь);
	Структура.Вставить("ШиринаКнопки",			120);
	Структура.Вставить("ВысотаКнопки",			19);
	// картинки кнопок подменю
	Структура.Вставить("КартинкаСкрыть",	Новый Картинка);
	Структура.Вставить("КартинкаПоказать",	БиблиотекаКартинок.ПоказатьДанные);
	Возврат Структура;

КонецФункции

Процедура СкрытьПоказатьПоля(Кнопка, Форма)

	Параметры = Форма.ПараметрыСкрытьПоказатьПоля;
	Если Кнопка.Имя = "СкрытьПоказатьВсе" Тогда
		Подменю = Кнопка;
		Параметры.ПринудительныйФлаг = Не Параметры.ПринудительныйФлаг;
		Если Параметры.ПринудительныйФлаг Тогда
			Кнопка.Картинка = Параметры.КартинкаПоказатьВсе;
			ДопТекст		= "Показать";
		Иначе
			Кнопка.Картинка = Параметры.КартинкаСкрытьВсе;
			ДопТекст		= "Скрыть";
		КонецЕсли;
		Список = Новый СписокЗначений;
		Для Каждого СтрокаПодменю Из Параметры.Подменю Цикл
			СтрокаПодменю.Пометка = Параметры.ПринудительныйФлаг;
			СтрокаСЗ = Список.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСЗ, СтрокаПодменю);
			СтрокаСЗ.Представление  = ДопТекст + " " + СтрокаПодменю.Представление;
			КнопкаПодменю = Кнопка.Кнопки.Найти("СкрытьПоказать" + СтрокаПодменю.Значение.Элемент);
			Если КнопкаПодменю <> Неопределено Тогда
				КнопкаПодменю.Текст 	= СтрокаСЗ.Представление;
				КнопкаПодменю.Картинка 	= ?(СтрокаПодменю.Пометка, Параметры.КартинкаПоказать, Параметры.КартинкаСкрыть);
			КонецЕсли;
		КонецЦикла;
		Кнопка.Заголовок = ?(Параметры.ПринудительныйФлаг, "Показать поля", "Скрыть поля");
	Иначе
		Подменю = Форма.ЭлементыФормы.Найти("СкрытьПоказатьВсе");
		СтрокаСЗ = Неопределено;
		ИмяЭлемента = СтрЗаменить(Кнопка.Имя, "СкрытьПоказать", "");
		Для каждого ЭлементСписка Из Параметры.Подменю Цикл
			Если ЭлементСписка.Значение.Элемент = ИмяЭлемента Тогда
				СтрокаСЗ = ЭлементСписка;
			КонецЕсли;	
		КонецЦикла;
		
		Если СтрокаСЗ = Неопределено Тогда
			Возврат
		Иначе
			СтрокаСЗ.Пометка = Не СтрокаСЗ.Пометка
		КонецЕсли;
		Кнопка.Текст 	= ?(СтрокаСЗ.Пометка, "Показать", "Скрыть") + " " + СтрокаСЗ.Представление;
		Кнопка.Картинка = ?(СтрокаСЗ.Пометка, Параметры.КартинкаПоказать, Параметры.КартинкаСкрыть);
		Список = Новый СписокЗначений;
		Список.Добавить(СтрокаСЗ.Значение,, СтрокаСЗ.Пометка);
	КонецЕсли;
	Для Каждого СтрокаСЗ Из Список Цикл
		Поле = Форма.ЭлементыФормы.Найти(СтрокаСЗ.Значение.Элемент);
		Если Поле <> Неопределено Тогда
			Поле.Видимость = (Не СтрокаСЗ.Пометка) и СтрокаСЗ.Значение.УсловиеЗапрета = ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
#КонецЕсли

Функция МассивОшибокВСтроку(Массив, Заголовок = "") Экспорт

	Результат = "";
	Для Каждого Строка Из Массив Цикл
		Результат = Результат + Строка + Символы.ПС;
	КонецЦикла;
	Результат = СокрП(Результат);
	Если Не ПустаяСтрока(Заголовок) И Не ПустаяСтрока(Результат) Тогда
		Результат = Заголовок + Символы.ПС + Результат;
	КонецЕсли;
	Возврат Результат;

КонецФункции // МассивОшибокВСтроку()

//чкн
// возвращает фильтр допустимых расщирений файлов
Функция ПолучитьФильтрФайлов(ЭтоМассив = ЛОЖЬ) Экспорт 
	
	Если ЭтоМассив Тогда 
		Массив = Новый СписокЗначений;
		Массив.Добавить("*.bmp");
		Массив.Добавить("*.dib");
		Массив.Добавить("*.rle");
		Массив.Добавить("*.jpg");
		Массив.Добавить("*.jpeg");
		Массив.Добавить("*.jfif");
		Массив.Добавить("*.tif");
		Массив.Добавить("*.gif");
		Массив.Добавить("*.png");
		Массив.Добавить("*.ico");
		Массив.Добавить("*.wmf");
		Массив.Добавить("*.emf");
		Массив.Добавить("*.doc");
		Массив.Добавить("*.docx");
		Массив.Добавить("*.dot");
		Массив.Добавить("*.dotx");
		Массив.Добавить("*.docm");
		Массив.Добавить("*.xls");
		Массив.Добавить("*.xlsx");
		Массив.Добавить("*.xlsm");
		Массив.Добавить("*.xlt");
		Массив.Добавить("*.xltm");
		Массив.Добавить("*.xltx");
		Массив.Добавить("*.xlw");
		Массив.Добавить("*.pdf");
		Массив.Добавить("*.rtf");
		
		Возврат Массив;
	Иначе	
		Возврат "(*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.jfif;*.webp;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf;*.doc;*.docx;*.dot;*.dotx;*.docm;*.xls;*.xlsx;*.xlsm;*.xlt;*.xltm;*.xltx;*.xlw;*.pdf;*.rtf)"
		+ "|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.jfif;*.webp;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf;*.doc;*.docx;*.dot;*.dotx;*.docm;*.xls;*.xlsx;*.xlsm;*.xlt;*.xltm;*.xltx;*.xlw;*.pdf;*.rtf|";
	КонецЕсли;

КонецФункции

Функция ПолучитьФильтрКартинок(ЭтоМассив = ЛОЖЬ) Экспорт 
	
	Если ЭтоМассив Тогда 
		Массив = Новый СписокЗначений;
		Массив.Добавить("*.bmp");
		Массив.Добавить("*.dib");
		Массив.Добавить("*.rle");
		Массив.Добавить("*.jpg");
		Массив.Добавить("*.jpeg");
		Массив.Добавить("*.jfif");
		Массив.Добавить("*.tif");
		Массив.Добавить("*.gif");
		Массив.Добавить("*.png");
		Массив.Добавить("*.ico");
		Массив.Добавить("*.wmf");
		Массив.Добавить("*.emf");
		
		Возврат Массив;
	Иначе	
		Возврат "(*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.jfif;*.webp;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf"
		+ "|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.jfif;*.webp;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|";
	КонецЕсли;

КонецФункции


//чкн

#Если Клиент Тогда
Функция ВыборФайлаРасчетчика(МножественныйВыбор = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = ПолучитьФильтрФайлов();
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор  = МножественныйВыбор;
	ОбщийПуть = "\\ALPHA\Common\USERS";
	КаталогПользователя = Новый Файл(ОбщийПуть + "\" + ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если КаталогПользователя.Существует() Тогда
		Каталог = КаталогПользователя
	Иначе
		Каталог = ОбщийПуть
	КонецЕсли;
	Диалог.Каталог = Каталог;
	//Диалог.Каталог = "C:\Users\Igor\Desktop\ВО\Документы\Заявка на выезд";
	//Диалог.ПолноеИмяФайла = Элемент.Значение;
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.ИндексФильтра = 0;
	Если Диалог.Выбрать() Тогда
		Если Диалог.МножественныйВыбор = ЛОЖЬ Тогда
			Возврат Диалог.ПолноеИмяФайла;	
		Иначе
			Возврат Диалог.ВыбранныеФайлы;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции
#КонецЕсли

 Функция ОпределитьЭтоДоговор(ВидБСО) Экспорт
	
	Если ТипЗнч(ВидБСО) = Тип("Строка") Тогда
		ТекНаименованиеБСО = ВидБСО;
	Иначе
		ТекНаименованиеБСО = ВидБСО.Наименование;		
	КонецЕсли;
	
	Если Найти(Нрег(ТекНаименованиеБСО),"договор (без скидки)") <> 0 Или Найти(Нрег(ТекНаименованиеБСО),"договор (со скидкой)") <> 0  Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//ППС 29-07-2014                                                         
Функция ПолучитьРискиПоСтраховомуПродукту(СтраховойПродукт, КакМассив = Ложь) Экспорт
	
	
	Если ЗначениеЗаполнено(СтраховойПродукт) Тогда
		Если ТипЗнч(СтраховойПродукт) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
			МассивРисков = Новый Массив;
			МассивРисков.Добавить(СтраховойПродукт);
		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уб_СтраховыеПродуктыТипыОбъектовИРиски.Риск КАК Ссылка
			|ИЗ
			|	Справочник.уб_СтраховыеПродукты.ТипыОбъектовИРиски КАК уб_СтраховыеПродуктыТипыОбъектовИРиски
			|ГДЕ
			|	уб_СтраховыеПродуктыТипыОбъектовИРиски.Ссылка = &СтраховойПродукт
			|
			|УПОРЯДОЧИТЬ ПО
			|	уб_СтраховыеПродуктыТипыОбъектовИРиски.Риск.Наименование";
			
			Запрос.УстановитьПараметр("СтраховойПродукт", СтраховойПродукт);
			
			МассивРисков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
	Иначе
		МассивРисков = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивРисков;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивРисков);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//ППС 29-07-2014


Функция ПолучитьКоординатыОшибкиВКоде(Знач СтрОшибки)	
	
	Результат = Новый Структура("НомерСтроки, НомерСимвола", 0, 0);
	
	// создаем объект для работы с регулярными выражениями
	RegExp = Новый COMОбъект("VBScript.RegExp");    
	
	//Параметры:
	RegExp.MultiLine  = Ложь; // Истина — текст многострочный,  Ложь — одна строка
	RegExp.Global     = Ложь; // Истина — поиск по всей строке, Ложь — до первого совпадения
	RegExp.IgnoreCase = Ложь; // Истина — игнорировать регистр строки при поиске
	
	RegExp.Pattern = "\{\(\d{1,}\,{0,1}\d{1,}\)\}";
    Код = RegExp.Execute (СтрОшибки);
	
	Если Код.Count = 1 Тогда
		Код = Код.Item(0).Value;
	Иначе
		Код = "";
	КонецЕсли;
	
	RegExp = Неопределено;
	
	Если Не ПустаяСтрока(Код) Тогда
		ПозицияЗапятой = Найти(Код, ",");
		Если ПозицияЗапятой > 3 Тогда
			НомерСтроки  = 0; 
			НомерСимвола = 0;			
			
			Стр = Сред(Код, 3, ПозицияЗапятой - 3);
			Попытка
				НомерСтроки = Число(Стр);
			Исключение
				НомерСтроки = 0;
			КонецПопытки;
			
			Стр = Сред(Код, ПозицияЗапятой + 1, СтрДлина(Код) - ПозицияЗапятой - 2);
			Попытка
				НомерСимвола = Число(Стр);
			Исключение
				НомерСимвола = 0;
			КонецПопытки;
			
			Результат.НомерСтроки  = НомерСтроки;
			Результат.НомерСимвола = НомерСимвола;
		Иначе
			ПозицияЗапятой = Найти(Код, ")}");
			Если ПозицияЗапятой > 3 Тогда
				НомерСтроки = 0; 
				
				Стр = Сред(Код, 3, ПозицияЗапятой - 3);
				Попытка
					НомерСтроки = Число(Стр);
				Исключение
					НомерСтроки = 0;
				КонецПопытки;
				
				Результат.НомерСтроки = НомерСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//ППС 31-07-2014



Функция  ОшибкаПоИсходномуКоду(ИсходныйКод, СообщениеОшибки) Экспорт
	СтрокаОшибки     = "";
	КоординатыОшибки = ПолучитьКоординатыОшибкиВКоде(СообщениеОшибки);
	
	Если КоординатыОшибки.НомерСтроки > 0 Тогда
		
		Если СтрЧислоСтрок(ИсходныйКод) >= КоординатыОшибки.НомерСтроки Тогда
			
			СтрокаОшибки = СтрПолучитьСтроку(ИсходныйКод, КоординатыОшибки.НомерСтроки);
			
			Если КоординатыОшибки.НомерСимвола > 0 Тогда
				
				СтрокаОшибки = Лев(СтрокаОшибки, КоординатыОшибки.НомерСимвола - 1) + 
				               "<<?>>" +
				               Прав(СтрокаОшибки, СтрДлина(СтрокаОшибки) - КоординатыОшибки.НомерСимвола + 1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Возврат "Описание ошибки: '" + СообщениеОшибки + "'" + Символы.ПС +  
	            ?(Не КоординатыОшибки.НомерСтроки  = 0, "Номер строки = "  + КоординатыОшибки.НомерСтроки  + "" + Символы.ПС, "") + 
	            ?(Не КоординатыОшибки.НомерСимвола = 0, "Номер позиции = " + КоординатыОшибки.НомерСимвола + "" + Символы.ПС, "") + 
	            ?(Не ПустаяСтрока(СтрокаОшибки), "Исходная строка: '" + СтрокаОшибки + "'" + Символы.ПС, "") + "";
	 
КонецФункции	
&НаКлиенте
Функция ПодобратьДискПользователяВТерминале()  Экспорт
	Файл = Новый Файл("\\tsclient\c");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Файл = Новый Файл("\\tsclient\c");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Файл = Новый Файл("\\tsclient\d");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Файл = Новый Файл("\\tsclient\e");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Файл = Новый Файл("\\tsclient\f");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Файл = Новый Файл("\\tsclient\g");
	Если Файл.Существует() Тогда
		Возврат Файл.Путь;
	КонецЕсли;	
	Возврат "\\tsclient\c";
КонецФункции	

Функция СписокМенеджеров(Знач Дата1 =  Неопределено,Знач  Дата2 =  Неопределено,КакМассив = Ложь) Экспорт
	
	Запрос = Новый Запрос();
	
	Если НЕ ЗначениеЗаполнено(Дата2) Тогда
		Дата2 = ТекущаяДата();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Дата1) Тогда
		Дата1 = Дата2-30*25*3600;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &Дата1
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &Дата2
	               |	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.Наименование";
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",Дата2);
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");
	Если КакМассив = Истина Тогда
		Результат = Массив;
	Иначе
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(Массив);			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура  ЗаполнитьФормыОплаты(_ФормаОплатыСтрока) Экспорт
	_ФормаОплатыСтрока.Очистить();
	_ФормаОплатыСтрока.Добавить(Перечисления.уб_ФормыОплаты.Касса);
	_ФормаОплатыСтрока.Добавить(Перечисления.уб_ФормыОплаты.Безнал);
	_ФормаОплатыСтрока.Добавить(Перечисления.уб_ФормыОплаты.Поставщику);
	_ФормаОплатыСтрока.Добавить(Перечисления.уб_ФормыОплаты.Терминал);
	_ФормаОплатыСтрока.Добавить(Перечисления.уб_ФормыОплаты.НаКарту);
КонецПроцедуры	

Функция ПолучитьСписокАктуальныхПодразделений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияОрганизаций.Ссылка
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |ГДЕ
	               |	ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодразделенияОрганизаций.Наименование";
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат Список;
КонецФункции	
// Проверка загрузки конфигурации из файлов навыком 1C (onec.py load), 2026-10-11T11:11:41+03:00
