
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Параметры.ФормаОткрытаИзФормыФизлица И Запись.Выбытие Тогда
	//	
	//	Элементы.Подразделение.Доступность = Ложь;
	//КонецЕсли;
	//Элементы.Агент.Доступность = НЕ Параметры.ФормаОткрытаИзФормыФизлица;
	//Элементы.Выбытие.Доступность = НЕ Параметры.ФормаОткрытаИзФормыФизлица;
	//Элементы.Выбытие.Видимость = (НЕ Параметры.ФормаОткрытаИзФормыФизлица) ИЛИ Запись.Выбытие;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.Организация) = Ложь Тогда
		ТекущийОбъект.Организация = уб_ВызовСервера.ПолучитьЗначениеКонстанты("ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//уб_СС.ВыборСотрудника(Элемент, СтандартнаяОбработка);
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Запись.Выбытие Тогда
		Оповестить("ВыбытиеСотрудника",Запись.Агент);
	КонецЕсли;
КонецПроцедуры


