&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("МодельТС",МодельТС);
	Параметры.Свойство("МаркаТС",МаркаТС);
	Параметры.Свойство("Vin",Vin);
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.РежимВыбора = Истина тогда
		ТД = Элементы.Список.ТекущиеДанные;
		ОповеститьОвыборе(Новый Структура("Объект,ИдентификационныйНомер,МаркаТС,МодельТС",Элементы.Список.ТекущаяСтрока,ТД.ИдентификационныйНомер,ТД.МаркаТС,ТД.МодельТС));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаркаТС1ПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура МодельТС1ПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура vinПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаСервере
Процедура Фильтр()
	СтруктурыФильтра = Новый Массив;
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","МодельТС",        МодельТС,      Неопределено, НЕ МодельТС.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","МаркаТС",       МаркаТС,        Неопределено, НЕ МодельТС.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","ИдентификационныйНомер",        Vin,        ВидСравненияКомпоновкиДанных.Содержит, НЕ ПустаяСтрока(Vin)));
	
	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра);
КонецПроцедуры

