Функция СписокВидовСтраховыхПродуктов() Экспорт
	Результат = Новый Массив;
	Для каждого Значение из Метаданные.Перечисления.уб_ВидыСтраховыхПродуктов.ЗначенияПеречисления Цикл
		НовоеЗначение = Перечисления.уб_ВидыСтраховыхПродуктов[Значение.Имя];
		Результат.Добавить(НовоеЗначение);
	КонецЦикла;	
	Возврат Результат;
КонецФункции


Функция СписокДоступныхОрганизаций() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	Организации.Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ЭтоГруппа = ЛОЖЬ
	               |	И (Организации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ Организации.ДатаОкончанияДействия > &ТекущаяДата)
	               |	И Организации.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организации.Наименование";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Функция СписокВидовСП(Поставщик,Организации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	КонтрагентыВидыСП.ВидСП,
	               |	КонтрагентыВидыСП.Организация
	               |ИЗ
	               |	Справочник.Контрагенты.ВидыСП КАК КонтрагентыВидыСП
	               |ГДЕ
	               |	КонтрагентыВидыСП.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтрагентыВидыСП.ВидСП";
	Запрос.УстановитьПараметр("Ссылка",Поставщик);
	НастройкиСП = Запрос.Выполнить().Выгрузить();
	СписокВидовСП = Новый Массив;
	Если НастройкиСП.Количество() = 0 Тогда
		//Полный список
		Возврат СписокВидовСтраховыхПродуктов();
	КонецЕсли;
	
	Список = Новый СписокЗначений;
	Для каждого Настройка из НастройкиСП Цикл
		Если Настройка.Организация.Пустая() Тогда
			Если Список.НайтиПоЗначению(Настройка.ВидСП) = Неопределено Тогда
				Список.Добавить(Настройка.ВидСП,Строка(Настройка.ВидСП));
			КонецЕсли 
		ИначеЕсли НЕ Организации.Найти(Настройка.Организация) = Неопределено Тогда
			Если Список.НайтиПоЗначению(Настройка.ВидСП) = Неопределено Тогда
				Список.Добавить(Настройка.ВидСП,Строка(Настройка.ВидСП));
			КонецЕсли 
		КонецЕсли;	
	КонецЦикла;	
	Список.СортироватьПоПредставлению();
	Возврат Список.ВыгрузитьЗначения();
КонецФункции	


//-------------------------------------------------------
//  Учет БСО - функции проверки назначения Вида БСО
//-------------------------------------------------------

// Определяет, Является ли БСО - полисом
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - БСО является полисом, Ложь - нет
//
Функция ОпределитьЭтоПолис(ВидБСО,Тип = Неопределено) Экспорт     //TODO Проверить, где вызывается , если возможно задействовать 2 параметр
	
	Если ВидБСО <> Неопределено Тогда
		П = Перечисления.уб_ТипыБСО;	
		Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
			Т = П.Полис;
		Иначе	
			Т = ?(Тип = Неопределено, ВидБСО.Тип, Тип);
		КонецЕсли;	
		
		Если 
			Т = П.Полис
			Или Т = П.ПолисОсаго
			Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьЭтоКвитанцияА7(ВидБСО,Тип = Неопределено) Экспорт //TODO Проверить, где вызывается , если возможно задействовать 2 параметр
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Т = Перечисления.уб_ТипыБСО.Полис;
	Иначе	
		Т = ?(Тип=Неопределено,ВидБСО.Тип,Тип);
	КонецЕсли;	
	
	Возврат Т = Перечисления.уб_ТипыБСО.КвитанцияА7;
КонецФункции

// Определяет, ведется ли номерной учет
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - ведется номерной учет, Ложь - нет
//
Функция ОпределитьВедетсяНомернойУчет(ВидБСО,ТУ = Неопределено) Экспорт  //TODO Проверить, где вызывается , если возможно задействовать 2 параметр
	
	П = Перечисления.уб_ТипыУчетаБСО;
	//ТУ = ?(ТУ = Неопределено,ВидБСО.ТипУчетаБСО,ТУ);
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(ВидБСО)  = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ВидБСО)  = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		Если ТУ = Неопределено Тогда
			ТУ = ВидБСО.ТипУчетаБСО;
		КонецЕсли;	
		Если 
			ТУ = П.НомернойЕстьПолис
			ИЛИ ТУ = П.НомернойПолисСоответствуетНомеруБСО
			ИЛИ ТУ = П.НомернойНетПолиса
			ИЛИ ТУ = П.НомернойПолисИзСвободных
			ИЛИ ТУ = П.НомернойПолисВручную
			ИЛИ ТУ = П.УчетНеВедетсяПолисВручную
			
			//ИЛИ ТУ = П.но
			Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//если учет номерной - Истина
//если количественный - Ложь
//иначе неопределено
//TODO перенести в кэшируемые?
Функция ОпределитьУчетБСОНомерной(ВидБСОИлиТип) Экспорт

	П 	= Перечисления.уб_ТипыУчетаБСО;
	ТУ  = ?(ТипЗнч(ВидБСОИлиТип) = Тип("СправочникСсылка.уб_ВидыБСО"), ВидБСОИлиТип.ТипУчетаБСО, ВидБСОИлиТип);
	Если ТУ = П.НомернойЕстьПолис
		Или ТУ = П.НомернойПолисСоответствуетНомеруБСО
		Или ТУ = П.НомернойНетПолиса
		Или ТУ = П.НомернойПолисИзСвободных
		Или ТУ = П.НомернойПолисВручную
		Тогда
		Возврат Истина
	ИначеЕсли ТУ = П.КоличественныйПолисИзСвободных
		Или ТУ = П.КоличественныйПолисВручную
		Или ТУ = П.КоличественныйНетПолиса
		Тогда
		Возврат Ложь
	КонецЕсли;

КонецФункции // ОпределитьУчетБСО()

// Определяет, куда была оплата
//
// Параметры
//  ФормаОплаты - ссылка на элемент перечисления уб_ФормыОплаты
//
// Возвращаемое значение
//  Истина - оплата в брокер, Ложь - оплата в СК
//
Функция ОплаченоВБрокер(ФормаОплаты) Экспорт 
	
	// (вызовов нет)	
	П = Перечисления.уб_ФормыОплаты;
	Если 
			ФормаОплаты = П.Касса
		ИЛИ ФормаОплаты = П.Безнал
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Определяет, ведется ли количественный учет
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - ведется количественный учет, Ложь - нет
//
Функция ОпределитьВедетсяКоличественныйУчет(ВидБСО,ТУ = Неопределено) Экспорт    //TODO Проверить, где вызывается , если возможно задействовать 2 параметр
	
	П = Перечисления.уб_ТипыУчетаБСО;
	//ТУ = ?(ТУ = Неопределено,ВидБСО.ТипУчетаБСО,ТУ);
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат ЛОЖЬ;
		ТУ = П.НомернойЕстьПолис;
	ИначеЕсли ЗначениеЗаполнено(ВидБСО)  = ЛОЖЬ Тогда	
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если ТУ = Неопределено Тогда
		ТУ = ВидБСО.ТипУчетаБСО;
	КонецЕсли;	
	Если 
			ТУ = П.КоличественныйПолисИзСвободных
		ИЛИ ТУ = П.КоличественныйПолисВручную
		ИЛИ ТУ = П.КоличественныйНетПолиса
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Определяет, ведется ли учет "без учета"
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - ведется учет "без учета", Ложь - нет
//
Функция ОпределитьУчетНеВедется(ВидБСО,ТУ = Неопределено) Экспорт 
	П = Перечисления.уб_ТипыУчетаБСО;
	П = Перечисления.уб_ТипыУчетаБСО;
	//ТУ = ?(ТУ = Неопределено,ВидБСО.ТипУчетаБСО,ТУ);
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат ЛОЖЬ;
		ТУ = П.НомернойЕстьПолис;
	ИначеЕсли ЗначениеЗаполнено(ВидБСО)  = ЛОЖЬ Тогда	
		Возврат ЛОЖЬ;	
	КонецЕсли;
	Если ТУ = Неопределено Тогда
		ТУ = ВидБСО.ТипУчетаБСО;
	КонецЕсли;
	Если 
			ТУ = П.УчетНеВедетсяПолисИзСвободных
		ИЛИ ТУ = П.УчетНеВедетсяПолисВручную
		ИЛИ ТУ = П.УчетНеВедетсяНетПолиса
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Определяет, используется ли для вида БСО учет свободных номеров полисов
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - используется учет свободных номеров, Ложь - нет
//
Функция ОпределитьИспользуютсяСвободныеНомераПолисов(ВидБСО,ТУ = Неопределено) Экспорт 
	П = Перечисления.уб_ТипыУчетаБСО;
	//ТУ = ?(ТУ = Неопределено,ВидБСО.ТипУчетаБСО,ТУ);
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		ТУ = П.НомернойЕстьПолис;
	КонецЕсли;
	Если ТУ = Неопределено Тогда
		ТУ = ВидБСО.ТипУчетаБСО;
	КонецЕсли;
	Если 
			ТУ = П.НомернойПолисИзСвободных
		ИЛИ ТУ = П.КоличественныйПолисИзСвободных
		ИЛИ ТУ = П.УчетНеВедетсяПолисИзСвободных
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Определяет, используется ли для вида БСО номера полисов
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - используется номер полиса, Ложь - нет
//
Функция ЕстьНомерПолиса(ВидБСО, Знач ТУ = Неопределено) Экспорт 
	
	Если ВидБСО <> Неопределено Тогда
		П 	= Перечисления.уб_ТипыУчетаБСО;
		Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
			ТУ = П.НомернойЕстьПолис;
		КонецЕсли;	
		Если ТУ = Неопределено Тогда
			ТУ = ВидБСО.ТипУчетаБСО;
		КонецЕсли;	
		
		Если ТУ = П.НомернойЕстьПолис
			Или ТУ = П.НомернойПолисСоответствуетНомеруБСО
			Или ТУ = П.НомернойПолисИзСвободных
			Или ТУ = П.НомернойПолисВручную
			Или ТУ = П.КоличественныйПолисИзСвободных
			Или ТУ = П.КоличественныйПолисВручную
			Или ТУ = П.УчетНеВедетсяПолисИзСвободных
			Или ТУ = П.УчетНеВедетсяПолисВручную
			Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Определяет, заполняется ли номер полиса при поступлении
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - заполняется номер полиса при поступлении, Ложь - нет
//
Функция НомерПолисаЗаполняетсяПриПоступлении(ВидБСО,ТУ = Неопределено) Экспорт 
	П = Перечисления.уб_ТипыУчетаБСО;
	//ТУ = ?(ТУ = Неопределено,ВидБСО.ТипУчетаБСО,ТУ);
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат ЛОЖЬ
	КонецЕсли;
	Если ТУ = Неопределено Тогда
		ТУ = ВидБСО.ТипУчетаБСО;
	КонецЕсли;
	Если 
			ТУ = П.НомернойЕстьПолис
		ИЛИ ТУ = П.НомернойПолисСоответствуетНомеруБСО
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Определяет, заполняется ли номер полиса вручную
//
// Параметры
//  ВидБСО - ссылка на элемент справочника ВидыБСО
//
// Возвращаемое значение
//  Истина - номер полиса заполняется вручную, Ложь - нет
//
Функция НомерПолисаЗаполняетсяВручную(ВидБСО,ТУ = Неопределено) Экспорт 
	
	П = Перечисления.уб_ТипыУчетаБСО;
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат Истина
	КонецЕсли;
	Если ТУ = Неопределено Тогда
		ТУ = ВидБСО.ТипУчетаБСО;
	КонецЕсли;
	Если 
			ТУ = П.НомернойПолисВручную
		ИЛИ ТУ = П.КоличественныйПолисВручную
		ИЛИ ТУ = П.УчетНеВедетсяПолисВручную
    Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоУниверсальноеБСОДляВидаСтраховогоПродукта(ВидБСО,ВидСП) Экспорт 
	Если ТипЗнч(ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.ВидСП
	               |ИЗ
	               |	Справочник.уб_ВидыБСО.ВидыСтраховыхПродуктовДляУниверсальногоБСО КАК Т
	               |ГДЕ
	               |	Т.Ссылка.УниверсальноеБСО = ИСТИНА
	               |	И Т.ВидСП = &ВидСП
	               |	И Т.Ссылка = &ВидБСО";
                          
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("ВидСП", ВидСП);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

Функция ОпределитьЭтоДокДвиженийНомерногоБСО(Док) Экспорт
	ЭтоДок = Неопределено;
	ОписаниеТиповДокументы = Документы.ТипВсеСсылки();
	
	Если Док <> Неопределено И ОписаниеТиповДокументы.СодержитТип(ТипЗнч(Док)) Тогда
		Двж = Док.Метаданные().Движения;
		МРС =  Метаданные.РегистрыСведений;
		ЭтоДок = Двж.Содержит(МРС.уб_ДвиженияБСО) ИЛИ Двж.Содержит(МРС.уб_СвободныеНомераПолисов);
	Иначе
		//Это - вообще не документ 	
		ЭтоДок = Ложь;
	КонецЕсли;
	
	Возврат ЭтоДок;
	
КонецФункции

// Создает служебную структуру для БСО
//
// Параметры
//  нет
//
// Возвращаемое значение
//  Структура
//TODO БСО
Функция ПолучитьСтруктуруБСО() Экспорт  
	
	СтруктураБСО = Новый Структура("Существует, Период, Регистратор, СК, ВидБСО, НомерБСО,ДопНомерБСО, Поставщик, ОрганизацияАгент, Подтверждено, ДокПроведен, Активность, АгентОтправитель, Агент, АгентПредставление, ПоложениеБСО, СостояниеБСО, Блокировка, НомерПолиса, ГодПолиса, СтраховойПолис, НаОснованииБумажногоДокумента, ДатаВозврата,Заявка,Тип,ТипУчетаБСО",Истина);
	Возврат СтруктураБСО;
КонецФункции

// Возвращает список коэффициентов бонус-малус
//
// Параметры
//  нет
//
// Возвращаемое значение
//  Список значений
//
Функция ПолучитьСписокКБМ() Экспорт 
	СписокКБМ = Новый СписокЗначений;
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_М);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_0);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_1);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_2);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_3);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_4);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_5);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_6);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_7);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_8);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_9);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_10);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_11);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_12);
	СписокКБМ.Добавить(Перечисления.уб_КлассыВодителей.класс_13);
	Возврат СписокКБМ;
КонецФункции

// Получает список страховых компаний, по заданной в константе группе СК
//
// Параметры
//  нет
//
// Возвращаемое значение
//  Список значений
//
Функция ПолучитьСписокСК(ДобавлятьТоп = 0, ПоказыватьНеактивные = Ложь) Экспорт 
	
	СписокСК = Новый СписокЗначений;
	Запрос = Новый Запрос;	
	Если ДобавлятьТоп > 0 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Д.СК КАК Ссылка,
		|	Д.СК.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(*) КАК КОЛ
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО КАК Д
		|ГДЕ
		|	Д.Регистратор ССЫЛКА Документ.уб_СтраховойПолис
		|	И Д.Период МЕЖДУ &ДатаН И &ДатаК
		|	И Д.СК <> &СобственныйКонтрагент
		|	И НЕ Д.СК.ПометкаУдаления
		|	И НЕ Д.СК = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Д.СК,
		|	Д.СК.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	КОЛ УБЫВ";
	    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + ДобавлятьТоп);
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаН", 					ТекущаяДата() - 60 * 60 * 24 * 30);
		Запрос.УстановитьПараметр("ДатаК", 					ТекущаяДата());
		Запрос.УстановитьПараметр("СобственныйКонтрагент", 	ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокСК.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;
		СписокСК.Добавить(Справочники.Контрагенты.ПустаяСсылка(), "===================");
	КонецЕсли;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	К.Ссылка КАК Ссылка,
	|	К.Наименование КАК Наименование,
	|	К.ЭтоГруппа
	|ИЗ
	|	Справочник.Контрагенты КАК К
	|ГДЕ
	|	К.Родитель = &РодительСсылка
	|	И НЕ К.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";                          
	Запрос.УстановитьПараметр("РодительСсылка", ПараметрыСеанса.уб_Константы.уб_ГруппаСК);
	Выборка = Запрос.Выполнить().Выбрать();
	ГруппаНеАктивных = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда
			СписокСК.Добавить(Выборка.Ссылка, Выборка.Наименование);
		Иначе
			Если Выборка.Наименование = "НЕ АКТИВНЫЕ" Тогда
				ГруппаНеАктивных = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ПоказыватьНеактивные И ГруппаНеАктивных <> Неопределено Тогда
		СписокСК.Добавить(Справочники.Контрагенты.ПустаяСсылка(), "===== НЕ АКТИВНЫЕ ====");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	К.Ссылка КАК Ссылка,
		|	К.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК К
		|ГДЕ
		|	К.Родитель.Ссылка = &РодительСсылка
		|	И НЕ К.ЭтоГруппа
		|	И НЕ К.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		Запрос.УстановитьПараметр("РодительСсылка", ГруппаНеАктивных);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокСК.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;
	КонецЕсли;
	Возврат СписокСК;
	
КонецФункции

Функция ПолучитьСписокОрганизаций() Экспорт 
	
	СписокСК = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	              |	Организации.Ссылка
	              |ИЗ
	              |	Справочник.Организации КАК Организации
	              |ГДЕ
	              |	Организации.ПометкаУдаления = ЛОЖЬ
	              |	И (Организации.ДатаОкончанияДействия > &Дата
	              |			ИЛИ Организации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Организации.Наименование";
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	СписокСК.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СписокСК;
	
КонецФункции



Функция ДайВыборкуДоговоровДляПоставщика(Поставщик
	, ОрганизацияАгент = 0
	, НаДату = Неопределено
	, ВключаяНеДействующиеОрганизации = Ложь
	, ВключаяНеДействующиеДоговора = Ложь
	, Предупреждать = Истина
	, Различные = Ложь
	) Экспорт 
	
	Если  НаДату = Неопределено Тогда
		НаДАту = ТекущаяДата();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ДоговорПриоритет = "";
	Упорядочить = "";
	Если НЕ Различные Тогда
		ДоговорПриоритет = " ДК.Ссылка КАК Договор,
	             |	ВЫБОР
	             |		КОГДА ДК.Ссылка = ДК.Владелец.ОсновнойДоговорКонтрагента
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК Приоритет,";
		Упорядочить = " УПОРЯДОЧИТЬ ПО
	               |	Приоритет УБЫВ,
	               |	ДК.ДатаЗаключенияДоговора УБЫВ,
	               |	ДК.ДатаОкончанияДействияДоговора";		 
	КонецЕсли;			   
		
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ " + ДоговорПриоритет +"
				   //|	ДК.Ссылка КАК Договор,
				   //|	ВЫБОР
				   //|		КОГДА ДК.Ссылка = ДК.Владелец.ОсновнойДоговорКонтрагента
				   //|			ТОГДА 1
				   //|		ИНАЧЕ 0
				   //|	КОНЕЦ КАК Приоритет,
				   |    ДК.Владелец как Контрагент,
	               |	ДК.Организация.Наименование КАК НаименованиеОрганизации,
	               |	ДК.Организация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДК
	               |ГДЕ
	               |	(ДК.Владелец = &Поставщик ИЛИ ДК.Владелец.ГоловнойКонтрагент = &Поставщик)   //TODO Добавить вложенность
				   |	И (&ОрганизацияАгент=0 ИЛИ ДК.Организация = &ОрганизацияАгент)
				   |	И Не ДК.ПометкаУдаления
				   |	И ДК.ДатаЗаключенияДоговора <= &НаДату
	               |	И (ДК.ДатаОкончанияДействияДоговора >= &НаДату
	               |			ИЛИ ДК.ДатаОкончанияДействияДоговора ЕСТЬ NULL 
	               |			ИЛИ ДК.ДатаОкончанияДействияДоговора = &НульДАта
	               |			ИЛИ &ВключаяНеДействующиеДоговора)
	               |	И ((ДК.Организация.ДатаРегистрации <= &НаДату
	               |				ИЛИ ДК.Организация.ДатаРегистрации = &НульДАта
	               |				ИЛИ ДК.Организация.ДатаРегистрации ЕСТЬ NULL )
	               |				И (ДК.Организация.ДатаОкончанияДействия >= &НаДату
	               |					ИЛИ ДК.Организация.ДатаОкончанияДействия = &НульДАта
	               |					ИЛИ ДК.Организация.ДатаОкончанияДействия ЕСТЬ NULL )
	               |			ИЛИ &ВключаяНеДействующиеОрганизации) 
	               |" + Упорядочить;
				   //|УПОРЯДОЧИТЬ ПО
				   //|	Приоритет УБЫВ,
				   //|	ДК.ДатаЗаключенияДоговора УБЫВ,
				   //|	ДК.ДатаОкончанияДействияДоговора";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ОрганизацияАгент", ОрганизацияАгент);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("НульДАта", Дата("00010101000000"));
	Запрос.УстановитьПараметр("ВключаяНеДействующиеОрганизации", ВключаяНеДействующиеОрганизации);
	Запрос.УстановитьПараметр("ВключаяНеДействующиеДоговора", ВключаяНеДействующиеДоговора);

	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	#Если Клиент Тогда
		Попытка
			Если Выборка.Количество() = 0 и Предупреждать  Тогда
				Фрм = Поставщик.ПолучитьФорму();
				Если Предупреждать И НЕ Фрм.Открыта() Тогда
					Заг = "Необходимо указать данные договора!";
					СОО = "Не найден действующий договор с действующей организацией для поставщика " + Строка(Поставщик) + " на дату: " + НаДату + "
					|
					|Зайдите в справочник Контрагентов и внесите данные договора!
					|(дополнительно проверьте, не окончилось ли действие организации, с которой заключен договор)
					|
					|Открыть форму Контрагента-Поставщика для внесения изменений?";
					
					Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						Фрм.ЭлементыФормы.Панель.ТекущаяСтраница = Фрм.ЭлементыФормы.Панель.Страницы.СчетаИДоговоры;	
						Фрм.ОткрытьМодально();
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Исключение
			//внешнее задание?
		КонецПопытки;
	#КонецЕсли		
	Возврат Выборка;
КонецФункции

// Получает список Организаций, действующих на дату
Функция ДайСписокОрганизаций(НаДату = Неопределено, Поставщик = Неопределено, ЕдинственнаяОрганизация = Неопределено, Предупреждать = Истина) Экспорт 
	Если ЗначениеНеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	СписокОрганизаций = Новый СписокЗначений;
	Если ЗначениеНеЗаполнено(Поставщик) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	О.Ссылка,
		               |	О.Наименование
		               |ИЗ
		               |	Справочник.Организации КАК О
		               |ГДЕ
		               |	(О.ДатаРегистрации <= &НаДату
		               |			ИЛИ О.ДатаРегистрации = &Пусто
		               |			ИЛИ О.ДатаРегистрации ЕСТЬ NULL )
		               |	И (О.ДатаОкончанияДействия >= &НаДату
		               |			ИЛИ О.ДатаОкончанияДействия = &Пусто
		               |			ИЛИ О.ДатаОкончанияДействия ЕСТЬ NULL )";
							  
		Запрос.УстановитьПараметр("НаДату", НаДату);
		Запрос.УстановитьПараметр("Пусто", Дата("00010101000000"));
		
		Рез = Запрос.Выполнить();
		Выборка = Рез.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокОрганизаций.Добавить(Выборка.Ссылка,Выборка.Наименование);
		КонецЦикла;
		Возврат СписокОрганизаций;
	КонецЕсли;
	
	ВключаяНеДействующиеОрганизации = Ложь;
	ВключаяНеДействующиеДоговора = Ложь;
	
	//предупреждаем об отсутствии договоров только отдел БСО
	Если Предупреждать Тогда
		Предупреждать = ПараметрыСеанса.уб_ОсновноеПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО
	КонецЕсли;
	Выборка = ДайВыборкуДоговоровДляПоставщика(Поставщик, ,НаДату, ВключаяНеДействующиеОрганизации, ВключаяНеДействующиеДоговора, Предупреждать, Истина);
	
	Если Выборка.Количество() = 0 Тогда
		ВключаяНеДействующиеОрганизации = Истина;
		Выборка = ДайВыборкуДоговоровДляПоставщика(Поставщик, , НаДату, ВключаяНеДействующиеОрганизации, ВключаяНеДействующиеДоговора, Ложь, Истина);
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		ВключаяНеДействующиеДоговора = Истина;
		Выборка = ДайВыборкуДоговоровДляПоставщика(Поставщик, , НаДату, ВключаяНеДействующиеОрганизации, ВключаяНеДействующиеДоговора, Ложь, Истина);
	КонецЕсли;
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		СписокОрганизаций.Добавить(Выборка.Организация,Выборка.НаименованиеОрганизации);
		ЕдинственнаяОрганизация = Выборка.Организация;
	ИначеЕсли Выборка.Количество() > 1 Тогда
		
		Пока Выборка.Следующий() Цикл
			СписокОрганизаций.Добавить(Выборка.Организация,Выборка.НаименованиеОрганизации);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокОрганизаций;
КонецФункции

Функция ПолучитьСписокВидовБСО(СК, НаДату = Неопределено, ДобавлятьТоп = 0, ТолькоПолисы = Ложь, ИсключатьНедействующие = Ложь) Экспорт 
	
	
	//НаДату - будет использоваться, когда введется параметр окончания действия БСО
	Если ЗначениеНеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	ОграничениеПоТипу = "";	
	ОграничениеПоТипу2 = "";	
	Если ТолькоПолисы Тогда
		СписокТиповПолисов = Новый СписокЗначений;
		СписокТиповПолисов.Добавить(Перечисления.уб_ТипыБСО.Полис);
		СписокТиповПолисов.Добавить(Перечисления.уб_ТипыБСО.ПолисОсаго);
		ОграничениеПоТипу = " И Д.ВидБСО.Тип В (&СписокТиповПолисов) ";	
		ОграничениеПоТипу2 = " И Т.Тип В (&СписокТиповПолисов) ";	
	КонецЕсли;
	
	ОграничениеДействия = "";
	Если ИсключатьНедействующие Тогда
	    ОграничениеДействия = " И (Т.ДатаОкончанияДействия = &ПустаяДата
	               |			ИЛИ Т.ДатаОкончанияДействия >= &ТекущаяДата) "
	КонецЕсли; 
	
	СписокВидовБСО = Новый СписокЗначений;
	
	Если СК.ВидыСп.Количество()>0 Тогда
		
		Для каждого СтрокаВида из СК.ВидыСп Цикл
			СписокВидовБСО.Добавить(СтрокаВида.ВидСП);
		КонецЦикла;	
		Возврат СписокВидовБСО;
	КонецЕсли;	
	
	Если ДобавлятьТоп > 0 Тогда
		Запрос = Новый Запрос;    
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + ДобавлятьТоп + "
		               |	Д.ВидБСО КАК Ссылка,
		               |	Д.ВидБСО.Наименование КАК Наименование,
		               |	КОЛИЧЕСТВО(*) КАК КОЛ
		               |ИЗ
		               |	РегистрСведений.уб_ДвиженияБСО КАК Д
		               |ГДЕ
		              // |	Д.ВидБСО.Владелец = &СК
					   |	Д.СК = &СК
		               |	И Д.СК <> &СобственныйКонтрагент
					   |	И Д.Регистратор ССЫЛКА Документ.уб_СтраховойПолис
		               |	И Д.Период МЕЖДУ &ДатаН И &ДатаК" + ОграничениеПоТипу + "
					   |СГРУППИРОВАТЬ ПО
		               |	Д.ВидБСО,
		               |	Д.ВидБСО.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КОЛ УБЫВ";
	                          
		Запрос.УстановитьПараметр("СК", СК);
		Запрос.УстановитьПараметр("ДатаН", ТекущаяДата() - 60*60*24*30);
		Запрос.УстановитьПараметр("ДатаК", ТекущаяДата());
		Запрос.УстановитьПараметр("СобственныйКонтрагент", ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент);
		Если ТолькоПолисы Тогда
			Запрос.УстановитьПараметр("СписокТиповПолисов", СписокТиповПолисов);
		КонецЕсли;
		
		
		Рез = Запрос.Выполнить();
		Выборка = Рез.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокВидовБСО.Добавить(Выборка.Ссылка,Выборка.Наименование);
		КонецЦикла;
		Если СписокВидовБСО.Количество() > 0 Тогда
			СписокВидовБСО.Добавить(Справочники.уб_ВидыБСО.ПустаяСсылка(),"===================");
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Значение из Метаданные.Перечисления.уб_ВидыСтраховыхПродуктов.ЗначенияПеречисления Цикл
		НовоеЗначение = Перечисления.уб_ВидыСтраховыхПродуктов[Значение.Имя];
		Если СписокВидовБСО.НайтиПоЗначению(НовоеЗначение) = Неопределено Тогда
			СписокВидовБСО.Добавить(НовоеЗначение);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокВидовБСО;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Ссылка КАК Ссылка,
	               |	Т.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.уб_ВидыБСО КАК Т
	               |ГДЕ
	               |	Т.Владелец = &СК
	               |	И Т.ПометкаУдаления = ЛОЖЬ
	               |	               " + ОграничениеДействия + ОграничениеПоТипу2+" 
				   |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	Запрос.УстановитьПараметр("СК", СК);
	Если ИсключатьНедействующие Тогда
	    Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101000000"));
		Запрос.УстановитьПараметр("ТекущаяДата", НаДату);
	КонецЕсли; 
	Если ТолькоПолисы Тогда
		Запрос.УстановитьПараметр("СписокТиповПолисов", СписокТиповПолисов);
	КонецЕсли;
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВидовБСО.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	Возврат СписокВидовБСО;
КонецФункции

Функция ПолучитьСписокСтрахПродуктов(СК, НаДату = Неопределено, ДопустимыйВидБСО = Неопределено, ИсключатьНедействующие = Истина) Экспорт 
	
	Возврат ПолучитьСписокВидовБСО(СК,НаДату);
	Если ЗначениеНеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СП.Ссылка
	               |ИЗ
	               |	Справочник.уб_СтраховыеПродукты КАК СП
	               |ГДЕ
	               |	СП.Владелец.Ссылка = &СК и ПометкаУдаления = ЛОЖЬ ";
	
	Запрос.УстановитьПараметр("СК", СК);
	
	Если ИсключатьНедействующие Тогда
	    ТекстЗапроса = ТекстЗапроса + " И (СП.ДатаОкончанияДействия = &ПустаяДата
	               |			ИЛИ СП.ДатаОкончанияДействия >= &ТекущаяДата) ";
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101000000"));
		Запрос.УстановитьПараметр("ТекущаяДата", НаДату);
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(ДопустимыйВидБСО) Тогда
	    ТекстЗапроса = ТекстЗапроса + " И (СП.ВидыБСО.ВидБСО = &ДопустимыйВидБСО или СП.Наименование =&Наименование)";
		Запрос.УстановитьПараметр("ДопустимыйВидБСО", ДопустимыйВидБСО);
		Запрос.УстановитьПараметр("Наименование", ""+ДопустимыйВидБСО);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	СЗ = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат СЗ;
КонецФункции

//TODO БСО
// Читает состояние БСО
//
// Параметры
//  СтруктураНомера - структура
//
Процедура ПрочитатьСостояниеБСО(СтруктураБСО,Вариант = 2) Экспорт
	
	Если Вариант = 1 Тогда
		//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО, Подтверждено, ДокПроведен" 
		//, СтруктураБСО.СК
		//, СтруктураБСО.ВидБСО
		//, СтруктураБСО.НомерБСО
		//, Истина
		//, Истина);		
		Запрос = Новый Запрос;
		Если СтруктураБСО.Период = Неопределено Тогда
			СтруктураБСО.Период = Новый Граница(ТекущаяДата(), ВидГраницы.Исключая);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураБСО.Поставщик) Тогда
			//СтруктураОтбора.Вставить("Поставщик", СтруктураБСО.Поставщик);
			Запрос.УстановитьПараметр("Поставщик",СтруктураБСО.Поставщик);
		Иначе
			Запрос.УстановитьПараметр("Поставщик",Неопределено);
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтруктураБСО.ОрганизацияАгент) Тогда
			//СтруктураОтбора.Вставить("ОрганизацияАгент", СтруктураБСО.ОрганизацияАгент);
			Запрос.УстановитьПараметр("ОрганизацияАгент",СтруктураБСО.ОрганизацияАгент);
		Иначе
			Запрос.УстановитьПараметр("ОрганизацияАгент",Неопределено);
		КонецЕсли;	
		
		//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(СтруктураБСО.Период, СтруктураОтбора);
		НеИспользоватьБлокировкиБСО = ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина;
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ДвиженияБСОСрезПоследних.*,
		|	ВЫБОР
		|		КОГДА &НеИспользоватьБлокировкиБСО = ИСТИНА
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ)
		|	КОНЕЦ КАК Блокировка,
		|	уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип как Тип,
		|	уб_ДвиженияБСОСрезПоследних.Агент.Представление как АгентПредставление,
		|	уб_ДвиженияБСОСрезПоследних.ВидБСО.ТипУчетаБСО как ТипУчетаБСО
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
		|			&НаМомент,
		|			ВидБСО = &ВидБСО
		|				И НомерБСО = &НомерБСО
		|				И СК = &СК
		|				И Подтверждено = &Подтверждено
		//|				И ВЫБОР
		//|					КОГДА &Поставщик = НЕОПРЕДЕЛЕНО
		//|						ТОГДА ИСТИНА
		//|					ИНАЧЕ Поставщик = &Поставщик
		//|				КОНЕЦ
		//|				И ВЫБОР
		//|					КОГДА &ОрганизацияАгент = НЕОПРЕДЕЛЕНО
		//|						ТОГДА ИСТИНА
		//|					ИНАЧЕ ОрганизацияАгент = &ОрганизацияАгент
		//|				КОНЕЦ
		|				) КАК уб_ДвиженияБСОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
		|				&НаМомент,
		|				ВидБСО = &ВидБСО
		|					И СК = &СК
		|					И НомерБСО = &НомерБСО) КАК уб_БлокировкаБСОСрезПоследних
		|		ПО уб_ДвиженияБСОСрезПоследних.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
		|			И уб_ДвиженияБСОСрезПоследних.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО
		|			И уб_ДвиженияБСОСрезПоследних.СК = уб_БлокировкаБСОСрезПоследних.СК
		|ГДЕ 
		|				ВЫБОР
		|					КОГДА &Поставщик = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ уб_ДвиженияБСОСрезПоследних.Поставщик = &Поставщик
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОрганизацияАгент = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент = &ОрганизацияАгент
		|				КОНЕЦ";
		
		Запрос.УстановитьПараметр("СК",СтруктураБСО.СК);
		Запрос.УстановитьПараметр("ВидБСО",СтруктураБСО.ВидБСО);
		Запрос.УстановитьПараметр("НомерБСО",СтруктураБСО.НомерБСО);
		Запрос.УстановитьПараметр("Подтверждено",Истина);
		//Запрос.УстановитьПараметр("ДокПроведен",Истина);
		Запрос.УстановитьПараметр("НаМомент",СтруктураБСО.Период);
		Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО",НеИспользоватьБлокировкиБСО);
		тзРег = Запрос.Выполнить().Выгрузить();
		
		Если тзРег.Количество() < 1 Тогда
			СтруктураБСО.Существует = Ложь;
		Иначе
			тз = тзРег[0];
			ЗаполнитьЗначенияСвойств(СтруктураБСО,тз);
			СтруктураБСО.Существует = Истина;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Если СтруктураБСО.Период = Неопределено Тогда
			СтруктураБСО.Период = Новый Граница(ТекущаяДата(), ВидГраницы.Исключая);
		КонецЕсли;							  
		Запрос.УстановитьПараметр("Период",		СтруктураБСО.Период);
		Запрос.УстановитьПараметр("СК",			СтруктураБСО.СК);
		Запрос.УстановитьПараметр("ВидБСО",		СтруктураБСО.ВидБСО);
		Запрос.УстановитьПараметр("НомерБСО",	СокрЛП(СтруктураБСО.НомерБСО));
		УсловиеГДЕ = "ИСТИНА";
		Если ЗначениеЗаполнено(СтруктураБСО.Поставщик) Тогда
			Запрос.УстановитьПараметр("Поставщик",СтруктураБСО.Поставщик);
			УсловиеГДЕ = УсловиеГДЕ + " И Поставщик = &Поставщик";
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтруктураБСО.ОрганизацияАгент) Тогда
			Запрос.УстановитьПараметр("ОрганизацияАгент", СтруктураБСО.ОрганизацияАгент);
			УсловиеГДЕ = УсловиеГДЕ + " И ОрганизацияАгент = &ОрганизацияАгент";
		КонецЕсли;	
		НеИспользоватьБлокировкиБСО = ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина;
		Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО", НеИспользоватьБлокировкиБСО);
		Текст = 
		"ВЫБРАТЬ
		|	Выбор Когда &НеИспользоватьБлокировкиБСО = Истина Тогда Ложь Иначе ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ) Конец КАК Блокировка,
		|	уб_ДвиженияБСОСрезПоследних.*,
		|	уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип КАК Тип,
		|	уб_ДвиженияБСОСрезПоследних.Агент.Представление КАК АгентПредставление,
		|	уб_ДвиженияБСОСрезПоследних.ВидБСО.ТипУчетаБСО КАК ТипУчетаБСО
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&Период, (ВидБСО = &ВидБСО или ТИПЗНАЧЕНИЯ(&ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов)) И НомерБСО = &НомерБСО И СК = &СК И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
		|				&Период,
		|				(ВидБСО = &ВидБСО или ТИПЗНАЧЕНИЯ(&ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов))
		|					И СК = &СК
		|					И НомерБСО = &НомерБСО) КАК уб_БлокировкаБСОСрезПоследних
		|		ПО уб_ДвиженияБСОСрезПоследних.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
		|			И уб_ДвиженияБСОСрезПоследних.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО
		|			И уб_ДвиженияБСОСрезПоследних.СК = уб_БлокировкаБСОСрезПоследних.СК
		|ГДЕ &УсловиеГде
		|УПОРЯДОЧИТЬ ПО
		|	уб_ДвиженияБСОСрезПоследних.Период УБЫВ";	
		Текст = СтрЗаменить(Текст, "&УсловиеГде", УсловиеГДЕ);
		Запрос.Текст = Текст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураБСО, Выборка);
			СтруктураБСО.Существует = Истина;
		Иначе
			СтруктураБСО.Существует = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Получает остатки количественных БСО по структуре
//
// Параметры
//  СтруктураОтбора - структура
//
// Возвращаемое значение
//  Таблица значений
//
Функция ПолучитьОстаткиБСО(СтруктураБСО) Экспорт  
	
	тПоставщик = СтруктураБСО.Поставщик;
	тОрганизацияАгент = СтруктураБСО.ОрганизацияАгент;
	тСК = СтруктураБСО.СК;
	тВидБСО = СтруктураБСО.ВидБСО;
	тАгент = СтруктураБСО.Агент;	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ ";
	Если ЗначениеЗаполнено(тПоставщик) Тогда
		ТекстЗапроса = ТекстЗапроса + " СП.Поставщик,";
		ТекстЗапроса = ТекстЗапроса + " СП.Поставщик.Представление Как ПоставщикПредставление,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " NULL КАК Поставщик,";
		ТекстЗапроса = ТекстЗапроса + " NULL Как ПоставщикПредставление,";
	КонецЕсли;
	Если ЗначениеЗаполнено(тОрганизацияАгент) Тогда
		ТекстЗапроса = ТекстЗапроса + " СП.ОрганизацияАгент,";                
		ТекстЗапроса = ТекстЗапроса + " СП.ОрганизацияАгент.Представление Как ОрганизацияАгентПредставление,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " NULL КАК ОрганизацияАгент,";
		ТекстЗапроса = ТекстЗапроса + " NULL КАК ОрганизацияАгентПредставление,";
	КонецЕсли;
	Если ЗначениеЗаполнено(тСК) Тогда
		ТекстЗапроса = ТекстЗапроса + " СП.СК,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " NULL КАК СК,";
	КонецЕсли;
	Если ЗначениеЗаполнено(тВидБСО) Тогда
		ТекстЗапроса = ТекстЗапроса + " СП.ВидБСО,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " NULL КАК ВидБСО,";
	КонецЕсли;
	Если ЗначениеЗаполнено(тАгент) Тогда
		ТекстЗапроса = ТекстЗапроса + " СП.Агент,";
		ТекстЗапроса = ТекстЗапроса + " СП.Агент.Представление Как АгентПредставление,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " NULL КАК Агент,";
		ТекстЗапроса = ТекстЗапроса + " NULL КАК АгентПредставление,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "	СП.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.уб_ОстаткиБСО.Остатки(&Период, ИСТИНА ";
	Запрос.УстановитьПараметр("Период", ?(СтруктураБСО.Период = Неопределено, ТекущаяДата(), СтруктураБСО.Период));
	Если ЗначениеЗаполнено(тПоставщик) Тогда
		ТекстЗапроса = ТекстЗапроса + " И Поставщик = &Поставщик";
		Запрос.УстановитьПараметр("Поставщик", тПоставщик);
	КонецЕсли;
	Если ЗначениеЗаполнено(тОрганизацияАгент) Тогда
		ТекстЗапроса = ТекстЗапроса + " И ОрганизацияАгент = &ОрганизацияАгент";
		Запрос.УстановитьПараметр("ОрганизацияАгент", тОрганизацияАгент);
	КонецЕсли;
	Если ЗначениеЗаполнено(тСК) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СК = &СК";
		Запрос.УстановитьПараметр("СК", тСК);
	КонецЕсли;
	Если ЗначениеЗаполнено(тВидБСО) Тогда
		ТекстЗапроса = ТекстЗапроса + " И ВидБСО = &ВидБСО";
		Запрос.УстановитьПараметр("ВидБСО", тВидБСО);
	КонецЕсли;
	Если ЗначениеЗАполнено(тАгент) Тогда
		ТекстЗапроса = ТекстЗапроса + "	И Агент = &Агент";
		Запрос.УстановитьПараметр("Агент", тАгент);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " ) КАК СП";
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	тзРег = РезультатЗапроса.Выгрузить();
	Возврат тзРег;
	
КонецФункции//ПолучитьОстаткиБСО

Функция ДайНомерБСОДляКоличУчета(Номер) Экспорт
	
	Возврат "б/н " + ДайНомерПолисаБезПометкиАннулирования(Номер);
	
КонецФункции

Функция ДайНомерПолисаСУчетомСостояния(Знач Номер, СостояниеПолиса) Экспорт
	
	Номер = ДайНомерПолисаБезПометкиАннулирования(Номер);
	Возврат ?(Номер = "","",?(ПолисАннулирован(СостояниеПолиса),Номер + "'",Номер));
	
КонецФункции

Функция ПолисАннулирован(СостояниеПолиса) Экспорт
	
	Прч = Перечисления.уб_СостоянияПолиса;
	Возврат (СостояниеПолиса = Прч.АннулированВыписанНовый ИЛИ СостояниеПолиса = Прч.АннулированЗаменаБланка ИЛИ СостояниеПолиса = Прч.АннулированПолностью);
	
КонецФункции

Функция ПолисАннулированСЗаменой(СостояниеПолиса) Экспорт
	
	Прч = Перечисления.уб_СостоянияПолиса;
	Возврат (СостояниеПолиса = Прч.АннулированВыписанНовый ИЛИ СостояниеПолиса = Прч.АннулированЗаменаБланка);
	
КонецФункции

Функция СостояниеПолисаТребуетДатуАннулирования(СостояниеПолиса) Экспорт
	
	Прч = Перечисления.уб_СостоянияПолиса;
	Возврат (СостояниеПолиса = Прч.АннулированВыписанНовый 
	Или СостояниеПолиса = Прч.АннулированЗаменаБланка 
	Или СостояниеПолиса = Прч.АннулированПолностью
	Или СостояниеПолиса = Прч.ПрекращенДосрочно
	);
	
КонецФункции

Функция ДайНомерПолисаБезПометкиАннулирования(Номер) Экспорт
	
	Возврат СтрЗаменить(СокрЛП(Номер), "'", "");
	
КонецФункции

Функция ПолучитьСписокДопРасчетовСПоставщиком(ЭтоШтраф, СК) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДопРасчеты.Код,
	|	ДопРасчеты.Представление КАК Представление
	|ИЗ
	|	Справочник.уб_СтатьиДопРасчетовСПоставщиком КАК ДопРасчеты
	|ГДЕ
	|	ДопРасчеты.Владелец = &ВладелецСсылка
	|	И ДопРасчеты.ЭтоШтраф = &ЭтоШтраф
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДопРасчеты.Код
	|АВТОУПОРЯДОЧИВАНИЕ";                          
	Запрос.УстановитьПараметр("ВладелецСсылка", СК);
	Запрос.УстановитьПараметр("ЭтоШтраф", ЭтоШтраф);	
	СписокДопРасчетов = Новый СписокЗначений;	
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		Код = Строка(Выборка.Код);
		Код = ?(Код = "","",Код);
		СписокДопРасчетов.Добавить(Код);
	КонецЦикла;
	Возврат СписокДопРасчетов;
	
КонецФункции

Функция ПоставщикПоИНН(ИНН, ОрганизацияАгент = 0) Экспорт
	
	Поставщик = ГоловнойКонтрагентПоИНН(ИНН);	
	ВыборкаДоговоры = уб_СЛ.ДайВыборкуДоговоровДляПоставщика(Поставщик,ОрганизацияАгент,, ЛОЖЬ, ЛОЖЬ, ЛОЖЬ, Истина);
	Пока ВыборкаДоговоры.Следующий() Цикл
		Если ВыборкаДоговоры.Количество()>1 Тогда
			Сообщить("Несколько действующих договоров для ОргАгента "+ОрганизацияАгент  + " поставщика "+Поставщик+" выбран Первый");
		КонецЕсли;	
		Поставщик = ВыборкаДоговоры.Контрагент;	
		Прервать;
	КонецЦикла;		
	Возврат Поставщик;
	
КонецФункции

Функция ГоловнойКонтрагентПоИНН(ИНН) Экспорт
	
	ФактИНН = СокрЛП(ИНН);		
	ПозСлеш = Найти(ФактИНН,"\");
	Если ПозСлеш > 0 Тогда
		ФактИНН = Лев(ФактИНН,ПозСлеш-1);
		ФактИНН = СокрП(ФактИНН);	
	Иначе	
		ПозСлеш = Найти(ФактИНН,"/");
		Если ПозСлеш > 0 Тогда
			ФактИНН = Лев(ФактИНН,ПозСлеш-1);
			ФактИНН = СокрП(ФактИНН);	
		КонецЕсли;	
	КонецЕсли;		
	Если ПустаяСтрока(ФактИНН) Тогда
		Возврат Справочники.Контрагенты.ПустаяСК;
	Иначе	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.ГоловнойКонтрагент КАК Ссылка,
		|	Контрагенты.ГоловнойКонтрагент.КодБух
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагенты.ГоловнойКонтрагент.КодБух УБЫВ");
		Запрос.УстановитьПараметр("ИНН",ФактИНН);
		Выборка = Запрос.Выполнить().Выбрать();
		колВыборка = Выборка.Количество();
		Если колВыборка = 0 Тогда
			Возврат Справочники.Контрагенты.ПустаяСК;
		Иначе
			#Если Клиент Тогда
				Если колВыборка>1 Тогда
					Сообщить("Несколько головных контрагентов с ИНН "+ФактИНН);
				КонецЕсли;	
			#КонецЕсли	
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции//ГоловнойКонтрагентПоИНН

Функция ПустаяСтруктураФильтров() Экспорт

	ОписаниеТипаБулево = ОбщегоНазначения.ПолучитьОписаниеТиповБулево();
	ТЗФильтров = Новый ТаблицаЗначений;
	//имя поля формы
	ТЗФильтров.Колонки.Добавить("ИмяПоля",			ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//данные поля формы
	ТЗФильтров.Колонки.Добавить("Данные",			ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//количество символов для начала обработки фильтра (только для быстрых фильтров)
	ТЗФильтров.Колонки.Добавить("ИндексЗапуска", 	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1));
	ТЗФильтров.Колонки.Добавить("ВидСравнения", 	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(22));
	//в запрос передается параметр с %, также добавляется параметр переведенной строки
	ТЗФильтров.Колонки.Добавить("Подобно",			ОписаниеТипаБулево);
	//для предварительной обработки значения (например нужно в запросе проверять на число, а в быстром фильтре - строка)
	ТЗФильтров.Колонки.Добавить("ЧастныйКод",		ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0));
	ТЗФильтров.Колонки.Добавить("ActiveX",			ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("ЕстьЗапрос", 		ОписаниеТипаБулево);
	//данный фильтр всегда обрабатывается независимо от заполнения
	ТЗФильтров.Колонки.Добавить("ЗаполненВсегда",	ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("ЕстьЧастныйКод",	ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("ЕстьУсловие",		ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("РазрешитьОтборПоЗначению0", ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("Состояние",		ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20));
	ТЗФильтров.Колонки.Добавить("ВидЗначенияОтбора", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(10));
	//хранится немодифицированное значение поля
	ТЗФильтров.Колонки.Добавить("ИсхЗначение");
	//хранится модифицированное значение поля (меняющееся либо с помощью частного кода, либо СокрЛП дял строк
	ТЗФильтров.Колонки.Добавить("Значение");
	//
	ТЗФильтров.Колонки.Добавить("ЕстьСписокЗначений");
	ТЗФильтров.Колонки.Добавить("СписокЗначений");
	//в работе, пока не оптимизировано
	ТЗФильтров.Колонки.Добавить("ЕстьЧастныйЗапрос",ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("ЧастныйЗапрос");
	//данное поле не обрабатывается 
	ТЗФильтров.Колонки.Добавить("НеОбрабатывать",	ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("НеОбрабатыватьПоУсловию",	ОписаниеТипаБулево);
	ТЗФильтров.Колонки.Добавить("КодУсловия",	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(1000));
	//
	ТЗФильтров.Колонки.Добавить("СтруктураДопНастроек");
	//
	//имя справочник для полнотекстового поиска
	ТЗФильтров.Колонки.Добавить("ИмяСправочника",	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//имя списка значений в структуре настроек всплывающего списка
	ТЗФильтров.Колонки.Добавить("ИмяВСтруктуреПараметровВсплывающегоСписка", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//имя списка значений - владельцев в структуре настроек всплывающего списка
	ТЗФильтров.Колонки.Добавить("ИмяСпискаДляОтбораПоВладельцу", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//для ограничения вводимых в поле символов
	ТЗФильтров.Колонки.Добавить("ДопустимыеСимволы",			ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//для обработки события keydown, нажатие клавиши tab
	ТЗФильтров.Колонки.Добавить("ИмяСледующегоЭлементаВПорядкеОбхода",			ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	//для обработки события keydown, нажатие клавиш shift + tab
	ТЗФильтров.Колонки.Добавить("ИмяПредыдущегоЭлементаВПорядкеОбхода",			ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Запрос"));
	ТЗФильтров.Колонки.Добавить("Запрос", Новый ОписаниеТипов(Массив));
	// 
	СтруктураФильтров = Новый Структура;
	СтруктураФильтров.Вставить("ИмяСписка");
	СтруктураФильтров.Вставить("ТЗФильтров",    ТЗФильтров);
	СтруктураФильтров.Вставить("ФильтрПоВсем",	Истина);
	СтруктураФильтров.Вставить("СтруктураПараметровВсплывающегоСписка",	Неопределено);
	СтруктураФильтров.Вставить("ЭтоВставкаТекста", Ложь);
	СтруктураФильтров.Вставить("ВернутьФокусВПоле", Неопределено);
	
	//Имя поля, по которому нужно обновить отбор
	СтруктураФильтров.Вставить("АктуальноеИмяПоля",	Неопределено);
	
	//добавляем цвета фильтров в структуру
	
	Цвета = Новый Структура("ФонЗаполненногоФильтра, ФонНезаполненногоФильтра, СтраховкаНеСостоялась");
	
	ТЗЦветов = уб_КЭШируемые.ЦветаСправочникаЦветов(Цвета);
	ЕстьТЗЦветов = ТЗЦветов <> Неопределено;
	Если ЕстьТЗЦветов Тогда
		СтрокаТЗФонЗаполненногоФильтра		= ТЗЦветов.Найти("ФонЗаполненногоФильтра", "Имя");
		СтрокаТЗФонНезаполненногоФильтра  	= ТЗЦветов.Найти("ФонНезаполненногоФильтра", "Имя");
		СтрокаТЗПустойРезультатФильтра  	= ТЗЦветов.Найти("СтраховкаНеСостоялась", "Имя");
		
		Если СтрокаТЗФонНезаполненногоФильтра <> Неопределено И СтрокаТЗФонЗаполненногоФильтра <> Неопределено И СтрокаТЗПустойРезультатФильтра <> Неопределено Тогда
			Цвета = Новый Структура("ФонЗаполненногоФильтра, ФонНезаполненногоФильтра, ПустойРезультатФильтра", СтрокаТЗФонЗаполненногоФильтра, СтрокаТЗФонНезаполненногоФильтра, СтрокаТЗПустойРезультатФильтра);
			СтруктураФильтров.Вставить("Цвета", Цвета);
		КонецЕсли;
	КонецЕсли;
	//0 - не обрабатывается
	//1 - ожидание отложенной обработки
	//2 - выполнение обработки фильтра
	СтруктураФильтров.Вставить("СостояниеОбработки",0); 
	// для обработки фильтров при открытии формы выбора
	//СтруктураФильтров.Вставить("ЗапускатьПриОткрытии", Ложь);
	Возврат СтруктураФильтров

КонецФункции // ПустаяСтруктураФИльтров()

Процедура ЗаполнитьКолонкиОптимизации(ЭлементыФормы, ТЗФильтров) Экспорт

	Для Каждого СтрокаТЗ Из ТЗФильтров Цикл		
		эф = ЭлементыФормы.Найти(СтрокаТЗ.ИмяПоля);
		Если эф <> Неопределено И ТипЗнч(эф) = Тип("ActiveX") Тогда
			СтрокаТЗ.ActiveX = Истина;
		КонецЕсли;	
		СтрокаТЗ.ЕстьЗапрос 		= Не ПустаяСтрока(СтрокаТЗ.Запрос.Текст);
		СтрокаТЗ.ЕстьЧастныйКод 	= Не ПустаяСтрока(СтрокаТЗ.ЧастныйКод);
		СтрокаТЗ.ЕстьЧастныйЗапрос	= СтрокаТЗ.ЧастныйЗапрос <> Неопределено;
		СтрокаТЗ.Данные				= НРег(СокрЛП(СтрокаТЗ.Данные));
		СтрокаТЗ.ИмяПоля			= НРег(СокрЛП(СтрокаТЗ.ИмяПоля));
	КонецЦикла;

КонецПроцедуры

//используется для заполнения списка значений поля со списком состояний БСО (подбор БСО, отчет остатков БСО)
Процедура СписокВыбораСЗСостояний(СписокВыбора) Экспорт
	
	Прч = Перечисления.уб_СостоянияБСО;
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ПустойБланк);
	СЗ.Добавить(Прч.НеиспользованныйБланк);
	СписокВыбора.Добавить(СЗ, "Не заполненные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.Оформлен);
	СписокВыбора.Добавить(СЗ, "Оформленные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ПустойБланк);
	СЗ.Добавить(Прч.НеиспользованныйБланк);
	СЗ.Добавить(Прч.НеПолностьюОформлен);
	СЗ.Добавить(Прч.НеполныйБланк);
	СЗ.Добавить(Прч.НеПравильноОформлен);
	СписокВыбора.Добавить(СЗ, "Не оформленные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.Испорчен);
	СЗ.Добавить(Прч.Украден);
	СЗ.Добавить(Прч.Уничтожен);
	СЗ.Добавить(Прч.Утрачен);
	СписокВыбора.Добавить(СЗ, "Утраченные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.НедействующийБланк);
	СписокВыбора.Добавить(СЗ, "Не действующие");
	//
	СЗ = Новый СписокЗначений;
	Для Каждого Перечисление Из Прч Цикл
		СЗ.Добавить(Перечисление)
	КонецЦикла;
	СЗ.Добавить(Прч.ПустаяСсылка());
	СписокВыбора.Добавить(СЗ, "Все состояния");

КонецПроцедуры // ПолучитьТЗСостоянийИПоложений()

//используется для заполнения списка значений поля со списком положений БСО (подбор БСО)
Процедура СписокВыбораСЗПоложений(СписокВыбора) Экспорт

	Прч = Перечисления.уб_ПоложенияБСО;
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ОтданБанку);
	СЗ.Добавить(Прч.ОтданКлиенту);
	СписокВыбора.Добавить(СЗ, "Отданные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.Списан);
	СписокВыбора.Добавить(СЗ, "Списанные");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ВозвращенИзСК);
	СЗ.Добавить(Прч.ВозвращенСТочки);
	СЗ.Добавить(Прч.ПолученИзСК);
	СписокВыбора.Добавить(СЗ, "В наличии");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ПереданНаТочку);
	СписокВыбора.Добавить(СЗ, "На руках");
	//
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Прч.ПереданВСК);
	СписокВыбора.Добавить(СЗ, "Переданные в СК");
	//	
	СЗ = Новый СписокЗначений;
	Для Каждого Перечисление Из Прч Цикл
		СЗ.Добавить(Перечисление)
	КонецЦикла;
	СЗ.Добавить(Прч.ПустаяСсылка());
	СписокВыбора.Добавить(СЗ, "Все положения");

КонецПроцедуры // ПолучитьТЗПоложений()

//Объединяет списки значений
Функция ОбъединитьСпискиЗначений(МассивСЗ) Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого СЗ Из МассивСЗ Цикл
		Для Каждого Элемент Из СЗ Цикл
			Результат.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка, Элемент.Картинка);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;

КонецФункции // ОбъединитьСпискиЗначений()

Функция ОбновитьИмяИсходящегоФайла(ИмяФайлаБезРасширения, Расширение)

	Возврат ИмяФайлаБезРасширения + "(1)" + Расширение;

КонецФункции

Функция ПроверитьИмяКаталога(Знач ИмяКаталога, СоздаватьКаталог = Ложь) Экспорт

	ИмяКаталога = СокрЛ(ИмяКаталога);
	Если ИмяКаталога <> "" И Прав(ИмяКаталога, 1) <> "\" Тогда
		Если СоздаватьКаталог Тогда
			СоздатьКаталог(ИмяКаталога);	
		КонецЕсли;
		ИмяКаталога = ИмяКаталога + "\"
	КонецЕсли;
	Возврат ИмяКаталога

КонецФункции // ПолныйПутьКФайлу()

Функция ОпределитьРасширениеФайла(Знач ИмяФайла, СТочкой = Истина, ПеревестиВНижнийРегистр = Истина) Экспорт
	
	ПрерватьЦикл = Ложь;
	Результат = "";
	ИмяФайла = СокрЛП(ИмяФайла);
	Длина = СтрДлина(ИмяФайла);
	Для Счетчик = 0 По Длина - 1 Цикл
		Символ = Сред(ИмяФайла, Длина - Счетчик, 1);
		Если Символ = "." Тогда
			ПрерватьЦикл = Истина;
			Если СТочкой Тогда
				Результат = Символ + Результат;
			КонецЕсли;
		КонецЕсли;
		Если ПрерватьЦикл Тогда
			Прервать;
		КонецЕсли;
		Результат = Символ + Результат;
	КонецЦикла;
	Если ПрерватьЦикл Тогда
		Если ПеревестиВНижнийРегистр Тогда
			Результат = НРег(Результат)
		КонецЕсли;
	Иначе
		Результат = "";
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция СтруктураПараметровКонвертацииФайловПоУмолчанию() Экспорт

	ЭтоРабочаяБаза = ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина;
	Параметры = Новый Структура;
	Параметры.Вставить("КоличествоСтраницПоШирине", 				1);
	Параметры.Вставить("ПутьККаталогуВходящихФайлов",				ПроверитьИмяКаталога(Справочники.уб_ХранилищаФайловБ2Б.ФайлыКЗаявкам.Путь));					
	Параметры.Вставить("ПутьККаталогуИсходящихФайлов", 				Параметры.ПутьККаталогуВходящихФайлов + "temp\");
	Параметры.Вставить("ПовернутьКартинкуЕслиШиринаБольшеВысоты", 	Истина);
	Параметры.Вставить("ПроцентыОтШириныКартинки", 					0);
	Параметры.Вставить("ОбрезкаПолей", 								0);
	Параметры.Вставить("РасширениеКартинки",						".jpeg");
	//удаляет кэшированые файлы, если конвертация была вызвана для строки
	Параметры.Вставить("УдалитьСтарыеФайлы", Ложь);
	Параметры.Вставить("СделатьЗаписьВЖурналПриОшибке",	Истина);
	ЧерезФоновоеЗадание = ПараметрыСеанса.уб_Константы.КонвертацияЧерезФоновоеЗадание = Истина;
	Параметры.Вставить("ЧерезФоновоеЗадание",			ЧерезФоновоеЗадание);	
	Параметры.Вставить("ВремяОжиданияФоновогоЗадания",	15);
	Параметры.Вставить("ВыбраннаяОриентацияСтраницы",	1);
	Параметры.Вставить("ОбязательнаяКонвертацияФайлов",	Ложь);
	//возможно указать двумя способами, что конвертация не прошла успешно:
	//1) указать ВыполненаКонвертацияВсехФайлов = Ложь
	//2) добавить ошибку в ТЗОшибок с Конвертация = Истина
	Параметры.Вставить("ВыполненаКонвертацияВсехФайлов", Истина);
	//флаг требуется ли получать данные из временного хранилища и из xml
	Параметры.Вставить("ИстеклоВремяОжиданияФоновогоЗадания", Ложь);
	//"СООбщить" или "ПРЕдупреждение" (достаточно трех символов, нечувствительно к регистру);
	Параметры.Вставить("ТипСообщенияОшибок", "Сообщить");
	//Истина если есть хотя бы один найденный файл
	Параметры.Вставить("ЕстьНайденныеФайлы", Ложь);
	//заявка
	Параметры.Вставить("СсылкаНаОбъект", Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка());
	//создает автоматически таблицу файлов по заявке
	Параметры.Вставить("СоздаватьТаблицуФайловПоЗаявке", Ложь);
	//автоматически создает имя для реквизита ИмяФайлаСТаблицейФайлов
	Параметры.Вставить("ИспользуетсяИмяФайлаСТаблицейФайлов", Ложь);
	//требуется для возврата таблицы файлов после фоновой конвертации
	Параметры.Вставить("ИмяФайлаСТаблицейФайлов", "");
	//не вызывает сервер, обрабатывает подготовку и постобработку только клиентских процедур
	Параметры.Вставить("ОбработатьНаКлиенте",	Ложь);
	//если хотя бы один файл из таблицы требует конвертации тогда Истина
	Параметры.Вставить("ТребуетсяКонвертация",		Ложь);
	Параметры.Вставить("ТаблицаФайлов",				ПустаяТаблицаФайловДляКонвертации());
	Параметры.Вставить("ОтправлятьНаПочтуОшибки",	ЭтоРабочаяБаза);
	//если Ложь тогда постобработка запускается только для файлов, требующих конвертицию, иначе - для всех
	Параметры.Вставить("ПринудительнаяПоследующаяОбработка", Ложь);
	Параметры.Вставить("КонвертацияExcel", 	Ложь);
	Параметры.Вставить("КонвертацияWord",	Ложь);
	//удалять файлы после конвертации (может потребоваться, если просмотр, картинки помещены во временное хранилище, файлы не нужны)
	Параметры.Вставить("УдалятьФайлыПослеКонвертации", Ложь);
	// префикс, автоматически добавляемый для картинок в кэше
	Параметры.Вставить("ПрефиксФайлаВКэше", "temp_");
	//ТЗОшибок
	//типы ошибок:
	//	Конвертация - этот признак того, что конвертация не была проведена успешно 
	//	при наличии такой ошибки не будет проведена очистка очереди (будет установлен ВыполненаКонвертацияВсехФайлов = Ложь)
	ТЗОшибок = Новый ТаблицаЗначений;
	ТЗОшибок.Колонки.Добавить("Текст", 			Новый ОписаниеТипов("Строка"));
	ТЗОшибок.Колонки.Добавить("Конвертация",	Новый ОписаниеТипов("Булево"));
	Параметры.Вставить("ТЗОшибок", ТЗОшибок);
	// кэшированная строка из ТЗОшибок
	Параметры.Вставить("СтрокаОшибки", "");
	// показывает файлы после конвертации или если конвертация не была осуществлена
	Параметры.Вставить("ПоказыватьФайлы", Ложь);
	// провярять ли файлы в кэш-папке. Если найдено, переконвертировать не будет
	Параметры.Вставить("ПроверятьКэшНаНаличиеФайлов", 	Ложь);
	Параметры.Вставить("HeightКартинки", 				297);
	Параметры.Вставить("WidthКартинки", 				210);
	Параметры.Вставить("ResolutionX", 					200);
	Параметры.Вставить("ResolutionY", 					200);
	Параметры.Вставить("ОбрезкаПолей", 					1);
	Параметры.Вставить("ПроцентМасштаба", 				Ложь);
	Параметры.Вставить("КоличествоСтраницПоШирине", 	1);
	Параметры.Вставить("НомерСтраницыОт", 				0);
	Параметры.Вставить("НомерСтраницыДо", 				0);
	Параметры.Вставить("УголПоворота",					90);
	Параметры.Вставить("МаксимальныйРазмерКартинки",	3000);
	Параметры.Вставить("АдресВоВременномХранилищеДляТекстаОшибки", 	?(Параметры.ЧерезФоновоеЗадание, ПоместитьВоВременноеХранилище(Новый Массив, Новый УникальныйИдентификатор), Неопределено));
	Параметры.Вставить("СтруктураПараметровИсходящегоФайла", 		СтруктураПараметровИсходящегоФайлаДляКонвертации(Параметры.РасширениеКартинки));
	// шаг ожидания завершения работы виртуального принтера в конвертации файлов. Количество попыток определяется параметром ВремяОжиданияФоновогоЗадания
	Параметры.Вставить("ШагОжиданияЗавершенияРаботыПринтера", 0.4); // в секундах
	// максимальное количество страниц для одного файла
	Параметры.Вставить("МаксимальноеКоличествоСтраниц", 100);
	// время ожидания создания файла с помощью процедуры КопироватьФайл()
	Параметры.Вставить("ВремяОжиданияСозданияФайла1С", 100);
	// вызвать запрос проверки имени файла по регистру файлов к полисам на тип (УИД или имя файла) и обновление данных
	// проверяет если только Таблица файлов изначально заполнена
	Параметры.Вставить("ПроверкаИменФайловНаУИД", Истина);
	// для заявки - массив номеров строк ТЧ БСО, по которым требуется распечатка образца вида БСО
	Параметры.Вставить("МассивНомеровСтрокТЧПечататьОбразцы", Новый Массив);
	Возврат Параметры;

КонецФункции // СтруктураПараметровКонвертацииФайловПоУмолчанию()

//TODO неизвестны значения свойств по умолчанию для несвязанных параметров типов jpeg и png.
//Если потребуется png, нужно связать вместе
Функция СтруктураПараметровИсходящегоФайлаДляКонвертации(Знач Тип = "jpeg")
	
	Тип = ВРег(СокрЛП(Тип));
	Структура = Новый Структура;
	Структура.Вставить("КодФормата");
	Структура.Вставить("ИмяФормата");
	Структура.Вставить("ColorSpace", 	24);
	Структура.Вставить("Mode",			0);
	Структура.Вставить("Multipage",		0);
	Структура.Вставить("Quality",		85);
	Структура.Вставить("Smoothing",		0);
	Если Тип = ".JPEG" Тогда
		// Код формата:
		//BMP	0	Формат BMP
		//DCX	5	Формат DCX
		//GIF	1	Формат GIF
		//JPEG	2	Формат JPEG
		//PCX	4	Формат PCX
		//PNG	6	Формат PNG
		//TIFF	3	Формат TIFF
		//PDF	7	Формат PDF
		Структура.КодФормата = 2;
		Структура.ИмяФормата = Тип;
	КонецЕсли;
	Возврат Структура;		
	//JPEG		
	//СтруктураПараметровИсходящегоФайла.Вставить("КодФормата", 2);
	////BMP	0	Формат BMP
	////DCX	5	Формат DCX
	////GIF	1	Формат GIF
	////JPEG	2	Формат JPEG
	////PCX	4	Формат PCX
	////PNG	6	Формат PNG
	////TIFF	3	Формат TIFF
	////PDF	7	Формат PDF
	//СтруктураПараметровИсходящегоФайла.Вставить("ИмяФормата", "JPEG");
	//СтруктураПараметровИсходящегоФайла.Вставить("ColorSpace", 24);
	////CS_BLACKWHITE	1	Черно-белое изображение (1 бит на пиксель)
	////CS_16COLORS	4	Цветное изображение, 16 цветов (4 бита на пиксель)
	////CS_16GRAYSCALE	132	16 оттенков серого (4 бита на пиксель)
	////CS_256COLORS	8	Цветное изображение, 256 цветов (8 бит на пиксель)
	////CS_256GRAYSCALE	136	256 оттенков серого (8 бит на пиксель)
	////CS_TRUECOLOR	24	Полноцветное изображение (24 бита на пиксель)
	//СтруктураПараметровИсходящегоФайла.Вставить("Mode", 0);
	//СтруктураПараметровИсходящегоФайла.Вставить("Multipage", 0);
	//СтруктураПараметровИсходящегоФайла.Вставить("Quality", 85);
	//СтруктураПараметровИсходящегоФайла.Вставить("Smoothing", 0);
	//
	// PNG
	//СтруктураПараметровИсходящегоФайла.Вставить("КодФормата", 6);
	////BMP	0	Формат BMP
	////DCX	5	Формат DCX
	////GIF	1	Формат GIF
	////JPEG	2	Формат JPEG
	////PCX	4	Формат PCX
	////PNG	6	Формат PNG
	////TIFF	3	Формат TIFF
	////PDF	7	Формат PDF
	//СтруктураПараметровИсходящегоФайла.Вставить("ИмяФормата", "PNG");
	//СтруктураПараметровИсходящегоФайла.Вставить("ColorSpace", 24);
	////CS_BLACKWHITE	1	Черно-белое изображение (1 бит на пиксель)
	////CS_16COLORS	4	Цветное изображение, 16 цветов (4 бита на пиксель)
	////CS_16GRAYSCALE	132	16 оттенков серого (4 бита на пиксель)
	////CS_256COLORS	8	Цветное изображение, 256 цветов (8 бит на пиксель)
	////CS_256GRAYSCALE	136	256 оттенков серого (8 бит на пиксель)
	////CS_TRUECOLOR	24	Полноцветное изображение (24 бита на пиксель)
	//СтруктураПараметровИсходящегоФайла.Вставить("Compression", 7);//0..9
	//СтруктураПараметровИсходящегоФайла.Вставить("Smoothing", 0);
	////SM_HQ	1	Включено высококачественное сглаживание, улучшающее качество выходного файла
	////SM_FAST	0	Используется быстрое сглаживание, увеличивающее скорость процесса конвертирования
	
КонецФункции

//должна поддерживать и сервер и клиент
Функция ПустаяТаблицаФайловДляКонвертации() Экспорт

	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяВходящегоФайла", 	Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("ПриложениеВходящегоФайла", 	Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("ИмяИсходящегоФайла", 		Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("Выполнено", 				Новый ОписаниеТипов("Булево"));
	ТаблицаФайлов.Колонки.Добавить("ВходящийФайлНайден", 		Новый ОписаниеТипов("Булево"));
	ТаблицаФайлов.Колонки.Добавить("ПропуститьКонвертацию", 	Новый ОписаниеТипов("Булево"));
	ТаблицаФайлов.Колонки.Добавить("НомерСтраницыОт", 			Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("НомерСтраницыДо", 			Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("СтрокаВТабличнойЧасти", 	Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("ПолеСлева", 				Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("ПолеСверху", 				Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("ПолеСправа", 				Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("ПолеСнизу", 				Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("РасширениеКартинки", 		Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("НомерСтрокиВДокументе", 	Новый ОписаниеТипов("Число"));
	ТаблицаФайлов.Колонки.Добавить("КолонкаВТабличнойЧасти", 	Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяИсходящегоФайла",	Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("АдресВХранилище",			Новый ОписаниеТипов("Строка"));
	//файл на клиенте (к примеру открытие добавленного файла в текущей сессии формы ТЧ заявки)
	//требуется открытие на клиенте, или TODO параметр отправки на сервер для постобработки
	ТаблицаФайлов.Колонки.Добавить("ФайлНаКлиенте",	Новый ОписаниеТипов("Булево"));
	//конвертация требуется для файлов типа Word и Excel
	ТаблицаФайлов.Колонки.Добавить("ТребуетсяКонвертация", Новый ОписаниеТипов("Булево"));
	//признак будет ли добавляться (1) к имени исходящего файла
	ТаблицаФайлов.Колонки.Добавить("ОбновитьИмяФайлаДляСтраниц", Новый ОписаниеТипов("Булево"));
	//имя исходящего файла без нумерации страниц "(*)" и без расширения
	ТаблицаФайлов.Колонки.Добавить("НачальноеИмяИсходящегоФайлаБезРасширения", Новый ОписаниеТипов("Строка"));	
	// хранит УИД регистра файлов к полисам
	ТаблицаФайлов.Колонки.Добавить("УИД", Новый ОписаниеТипов("Строка"));
	//Индивидуальная настройка повоорта файла
	ТаблицаФайлов.Колонки.Добавить("ПовернутьКартинкуЕслиШиринаБольшеВысоты", Новый ОписаниеТипов("Булево"));
	// имя входящего файла. Пока используется только для хранения значения поля для последующей проверки запросом к регистру файлов к полисам
	ТаблицаФайлов.Колонки.Добавить("ИмяВходящегоФайла", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("МассивКонвертации", Новый ОписаниеТипов("Массив"));
	
	Возврат ТаблицаФайлов;

КонецФункции // ПустаяТаблицаФайловДляКонвертации()

//Постобработка, получение показ файлов
Процедура ОкончаниеКонвертацииКлиент(Параметры) Экспорт

	Если Параметры.ПоказыватьФайлы И Параметры.ЕстьНайденныеФайлы И Не Параметры.ИстеклоВремяОжиданияФОновогоЗадания Тогда
		ТаблицаФайлов = Параметры.ТаблицаФайлов;
		Если ТаблицаФайлов.Количество() = 1 Тогда
			СтрокаТЗ = ТаблицаФайлов[0];
			Если СтрокаТЗ.ВходящийФайлНайден И СтрокаТЗ.Выполнено Тогда
				МассивДвоичныхДанных = ПолучитьИзВременногоХранилища(СтрокаТЗ.АдресВХранилище);
				Если ТипЗнч(МассивДвоичныхДанных) = Тип("Массив") Тогда
					Если МассивДвоичныхДанных.Количество() > 0 Тогда
						РасширениеКартинок = уб_СЛ.ОпределитьРасширениеФайла(СтрокаТЗ.ПолноеИмяИсходящегоФайла, Ложь);
						ИмяФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
						ТЗКартинок = Новый ТаблицаЗначений;
						ТЗКартинок.Колонки.Добавить("Картинка", 	уб_temp.СозданиеОписанияТиповПоТипу(Тип("Картинка")));
						ТЗКартинок.Колонки.Добавить("Расширение",	Новый ОписаниеТипов("Строка"));
						ТЗКартинок.Колонки.Добавить("ПолноеИмяВходящегоФайла",	Новый ОписаниеТипов("Строка"));
						Для Каждого ЭлементМассива Из МассивДвоичныхДанных Цикл
							СтрокаТЗ = ТЗКартинок.Добавить();
							СтрокаТЗ.Картинка	= Новый Картинка(ЭлементМассива);
							СтрокаТЗ.Расширение	= РасширениеКартинок;
							СтрокаТЗ.ПолноеИмяВходящегоФайла = ИмяФайла;
						КонецЦикла;
					Иначе
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Конвертация: МассивДвоичныхДанных.Количество() = 0, " + Параметры.СсылкаНаОбъект, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
						#Если Клиент Тогда
							Предупреждение("Ошибка конвертации");
						#КонецЕсли
					КонецЕсли;
				ИначеЕсли СтрокаТЗ.МассивКонвертации.Количество() > 0 тогда
					МассивДанных = СтрокаТЗ.МассивКонвертации;
					ТЗКартинок = Новый ТаблицаЗначений;
					ТЗКартинок.Колонки.Добавить("Картинка", 	уб_temp.СозданиеОписанияТиповПоТипу(Тип("Картинка")));
					ТЗКартинок.Колонки.Добавить("Расширение",	Новый ОписаниеТипов("Строка"));
					ТЗКартинок.Колонки.Добавить("ПолноеИмяВходящегоФайла",	Новый ОписаниеТипов("Строка"));
					Для Каждого ЭлементМассива Из МассивДанных Цикл
						СтрокаТЗ = ТЗКартинок.Добавить();
						СтрокаТЗ.Картинка	= Новый Картинка(ЭлементМассива);
						СтрокаТЗ.Расширение	= Параметры.РасширениеКартинки;
						СтрокаТЗ.ПолноеИмяВходящегоФайла = ЭлементМассива;
					КонецЦикла;
				Иначе					
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Конвертация: МассивДвоичных = Неопределено, " + Параметры.СсылкаНаОбъект, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
					#Если Клиент Тогда
						Предупреждение("Ошибка конвертации");
					#КонецЕсли
				КонецЕсли;
			КонецЕсли;
			Если ТЗКартинок <> Неопределено Тогда
				ПараметрыФормыПросмотра = Новый Структура;
				ПараметрыФормыПросмотра.Вставить("ОтображатьИмяФайла", Ложь);
				//TODO проверить будет ли открываться несколько форм, если несколько строк?
				Форма = ПолучитьОбщуюФорму("уб_ПросмотрКартинки");
				Попытка
					//<v8e:Comment>{ОбщийМодуль.уб_СЛ.Модуль(1386)}: Значение не является значением объектного типа (ПараметрыФормы)</v8e:Comment>
					Форма.ПараметрыФормы			= ПараметрыФормыПросмотра;
					Форма.ТЗКартинок				= ТЗКартинок;
					Форма.ОбщееРасширениеКартинок   = РасширениеКартинок;
					Форма.Открыть();
				Исключение
					//не ошибка конвертации - требуется понять почему не открывается форма
					//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СЛ.КонвертироватьИПоказатьКартинку(): " + ОписаниеОшибки() + ". Тип значения Форма: " + ТипЗнч(Форма));
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка открытия формы просмотра картинки");
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция СтруктураКонвертацииПоИмениФайла(Знач ПутьКФайлу, ПоказыватьФайлы = Истина) Экспорт

	ПутьКФайлу = СокрЛП(ПутьКФайлу);
	Если ПутьКФайлу <> "" Тогда
		Параметры = уб_СЛ.СтруктураПараметровКонвертацииФайловПоУмолчанию();
		Параметры.ПоказыватьФайлы 							= ПоказыватьФайлы;
		Параметры.ПутьККаталогуИсходящихФайлов 				= "";
		Параметры.ВремяОжиданияФоновогоЗадания  			= 20;
		Параметры.ТипСообщенияОшибок						= "Предупреждение";
		Параметры.НомерСтраницыОт							= 1;
		Параметры.НомерСтраницыДо							= 1;
		Параметры.ОбрезкаПолей								= 0;
		Параметры.ПовернутьКартинкуЕслиШиринаБольшеВысоты 	= Ложь;
		Параметры.УдалитьФайлыПослеКонвертации				= Истина;
		ТаблицаФайлов = Параметры.ТаблицаФайлов;
		СтрокаТЗ = Параметры.ТаблицаФайлов.Добавить();
		СтрокаТЗ.АдресВХранилище = ПоместитьВоВременноеХранилище(Новый Массив, Новый УникальныйИдентификатор);
		Если Найти(ПутьКФайлу, "\") <> 0 Тогда
			//файл на клиенте
			Параметры.ОбработатьНаКлиенте		= Истина;
			СтрокаТЗ.ПолноеИмяВходящегоФайла 	= ПутьКФайлу;
			СтрокаТЗ.ФайлНаКлиенте				= Истина;
		Иначе
			СтрокаТЗ.ПолноеИмяВходящегоФайла 	= ПроверитьИмяКаталога(Справочники.уб_ХранилищаФайловБ2Б.ФайлыКЗаявкам.Путь) + ПутьКФайлу;
		КонецЕсли;
		Возврат Параметры;
	КонецЕсли;

КонецФункции // СоздатьТаблицуКонвертацииПоИмениФайла()

Процедура ОтправитьФайлСКлиентаНаСервер(ФайлИсточник, ФайлПриемник = Неопределено, ВКаталогВременныхФайлов = Ложь, УдалитьФайлИсточник = Ложь) Экспорт
	
	Если ФайлПриемник = Неопределено Тогда
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		ВременныйФайл = ПолучитьИмяВременногоФайла(уб_СЛ.ОпределитьРасширениеФайла(ФайлИсточник));
		ФайлПриемник = СтрЗаменить(ВременныйФайл, КаталогВременныхФайлов, "");
	КонецЕсли;
	Картинка = Новый Картинка(ФайлИсточник);
	ДвоичныеДанные = Картинка.ПолучитьДвоичныеДанные();
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	уб_СЕРВЕРные.СохранитьИзВременногоХранилищаНаСервер(АдресВоВременномХранилище, ФайлПриемник, ВКаталогВременныхФайлов);
	Если УдалитьФайлИсточник Тогда
		УдалитьФайлы(ФайлИсточник);
	КонецЕсли;
	
КонецПроцедуры

//TODO добавлять или нет Параметры параметром? В текущем виде не требуется
//Проверка файла, отправка на сервер, вызов конвертации с параметрами, вызов постобработки
Функция ВызовКонвертацииКлиент(Знач ПутьКФайлу, СсылкаНаОбъект = Неопределено, ПоказыватьФайлы = Неопределено) Экспорт

	ПутьКФайлу = СокрЛП(ПутьКФайлу);
	Если ПутьКФайлу <> "" Тогда
		Параметры = уб_СЛ.СтруктураПараметровКонвертацииФайловПоУмолчанию();
		Параметры.ПоказыватьФайлы 							= ПоказыватьФайлы;
		//Параметры.ПутьККаталогуИсходящихФайлов 				= "";
		Параметры.ПроверятьКэшНаНаличиеФайлов = Истина;
		Параметры.ВремяОжиданияФоновогоЗадания  			= 3;
		Параметры.ТипСообщенияОшибок						= "Сообщение";
		Параметры.НомерСтраницыОт							= 1;
		Параметры.НомерСтраницыДо							= 1;
		Параметры.ПовернутьКартинкуЕслиШиринаБольшеВысоты 	= Ложь;
		Параметры.УдалятьФайлыПослеКонвертации				= ЛОЖЬ;
		#Если Клиент Тогда
			уб_Клиент._УстановитьЗначение(Параметры,"ПоказыватьФайлы",	ПоказыватьФайлы);
			уб_Клиент._УстановитьЗначение(Параметры,"СсылкаНаОбъект", 	СсылкаНаОбъект);
		#Иначе	
			уб_вызовСервера._УстановитьЗначение(Параметры,"ПоказыватьФайлы",	ПоказыватьФайлы);
			уб_вызовСервера._УстановитьЗначение(Параметры,"СсылкаНаОбъект", 	СсылкаНаОбъект);
		#КонецЕсли	
		ТаблицаФайлов = Параметры.ТаблицаФайлов;
		СтрокаТЗ = Параметры.ТаблицаФайлов.Добавить();
		СтрокаТЗ.АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
		//Если Найти(ПутьКФайлу, "\") <> 0 Тогда
		//	//файл на клиенте
		//	ПолныйПутьКФайлу = Неопределено;
		//	ОтправитьФайлСКлиентаНаСервер(ПутьКФайлу, ПолныйПутьКФайлу, Истина, Ложь);
		//	СтрокаТЗ.ПолноеИмяВходящегоФайла = ПолныйПутьКФайлу;
		//Иначе
		мФайл = Новый Файл(ПутьКФайлу);
		Если мФайл.Существует() тогда
			СтрокаТЗ.ПолноеИмяВходящегоФайла 	= мФайл.ПолноеИмя;
			СтрокаТЗ.ИмяВходящегоФайла			= мФайл.Имя;
		Иначе
			СтрокаТЗ.ИмяВходящегоФайла			= ПутьКФайлу;
		КонецЕсли;
		//КонецЕсли;
		уб_СЕРВЕРные.ВызовКонвертацииСервер(Параметры);
		ОкончаниеКонвертацииКлиент(Параметры);
		#Если Клиент Тогда
			Если Не ПустаяСтрока(Параметры.СтрокаОшибки) Тогда
				ТипСообщенияОшибок = Лев(НРег(СокрЛП(Параметры.ТипСообщенияОшибок)), 3);
				Если ТипСообщенияОшибок = "соо" Тогда
					Сообщить(Параметры.СтрокаОшибки);
				ИначеЕсли ТипСообщенияОшибок = "пре" Тогда
					Предупреждение(Параметры.СтрокаОшибки);
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		Возврат Параметры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

//с некоторыми типами файлов при обработке поворота и обрезке ошибка:
//{Форма.Форма.Форма(393)}: Ошибка при вызове метода контекста (Apply)
//img = IP.Apply(Картинка);
//по причине:
//Произошла исключительная ситуация (WIA.ImageProcess.1): Неопознанная ошибка
Функция ВозможнаПостобработкаИзображенияПоРасширению(Знач Расширение) Экспорт

	Расширение = СокрЛП(НРег(Расширение));
	Если Лев(Расширение, 1) = "." Тогда
		Расширение = Сред(Расширение, 2);
	КонецЕсли;
	// проверяем на запрещенные
	МассивЗапрещенных = Новый Массив;
	МассивЗапрещенных.Добавить("ico");
	МассивЗапрещенных.Добавить("wmf");
	МассивЗапрещенных.Добавить("emf");
	Если МассивЗапрещенных.Найти(Расширение) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	// проверяем на разрешенные
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить("bmp");
	МассивРазрешенных.Добавить("dib");
	МассивРазрешенных.Добавить("rle");
	МассивРазрешенных.Добавить("jpg");
	МассивРазрешенных.Добавить("jpeg");
	МассивРазрешенных.Добавить("jfif");
	МассивРазрешенных.Добавить("tif");
	МассивРазрешенных.Добавить("gif");
	МассивРазрешенных.Добавить("png");
	Если МассивРазрешенных.Найти(Расширение) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции // ВозможнаПостобработкаИзображенияПоРасширению()

Функция ОбработатьОчередь(Объект,ТипОчереди,Предупредить = Ложь) Экспорт
	Если ТипОчереди = Перечисления.уб_ТипыОчереди.Файлы Тогда
		Если уб_МодульРегламентныхЗаданий.ВыполнитьКонвертациюФайла(Объект) Тогда
			Модифицированность = Ложь;
			//Закрыть();
			#Если Клиент Тогда
			Если Предупредить Тогда
				Оповестить("ОбновитьФормуСпискаРегистраСведенийОчередь");
				Предупреждение("Конвертация файлов выполнена ["+Объект+"]", 2);
			КонецЕсли;	
		#КонецЕсли
		Возврат Истина;
		Иначе
			#Если Клиент Тогда
				Если Предупредить Тогда
					Предупреждение("Конвертация файлов не выполнена ["+Объект+"]");
				КонецЕсли;	
			#КонецЕсли
		КонецЕсли;
	Иначе
		уб_МодульРегламентныхЗаданий.уб_ОбработкаОчереди();
		#Если Клиент Тогда
			Оповестить("ОбновитьФормуСпискаРегистраСведенийОчередь");
		#КонецЕсли
	
		
	КонецЕсли;
КонецФункции	

//чкн
Процедура ОповещениеФормыПросмотра(ПолноеИмяФайла, мФорма, мОбъект)Экспорт 
	
	
	//ТЗКартинок = СконвертироватьОдинФайл(ПолноеИмяФайла);
	//#Если Клиент Тогда
	//	Форма = ПолучитьОбщуюФорму("уб_ПросмотрКартинки", мФорма, мОбъект);
	//	Если Форма.Открыта() тогда
	//		Оповестить("ОбновитьКартинку", ТЗКартинок, мФорма);
	//	Иначе
	//		Форма.ТЗКартинок = ТЗКартинок;
	//		Форма.Открыть();
	//	КонецЕсли;
	//	//Форма.Активизировать();
	//#КонецЕсли

КонецПроцедуры
//чкн

Функция СконвертироватьОдинФайл(ПолноеИмяФайла) Экспорт
	
	
	
	ТЗКартинок = Новый ТаблицаЗначений;
	ТЗКартинок.Колонки.Добавить("Картинка", 	уб_temp.СозданиеОписанияТиповПоТипу(Тип("Картинка")));
	ТЗКартинок.Колонки.Добавить("Расширение",	Новый ОписаниеТипов("Строка"));
	ТЗКартинок.Колонки.Добавить("ПолноеИмяВходящегоФайла",	Новый ОписаниеТипов("Строка"));
	
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьКонвертациюФайлов<>Истина Тогда
		СтрокаТЗ = ТЗКартинок.Добавить();
		
		Если  ВозможнаПостобработкаИзображенияПоРасширению(уб_СЛ.ОпределитьРасширениеФайла(ПолноеИмяФайла)) Тогда
			Попытка
				СтрокаТЗ.Картинка	= Новый Картинка(ПолноеИмяФайла);	
			Исключение
				СтрокаТЗ.Картинка = Новый Картинка;
			КонецПопытки;
		Иначе
			СтрокаТЗ.Картинка = Новый Картинка;
		КонецЕсли;	
		Возврат  ТЗКартинок;
	КонецЕсли;	
	
	Параметры = уб_СЛ.ВызовКонвертацииКлиент(ПолноеИмяФайла, , ЛОЖЬ);
	
	
	
	ТаблицаФайлов = Параметры.ТаблицаФайлов;
	Для Каждого СтрТЗ Из ТаблицаФайлов цикл
		Если СтрТЗ.ТребуетсяКонвертация тогда
			МассивФайлов = СтрТЗ.МассивКонвертации;
			Для Каждого ЭлементМассива Из МассивФайлов Цикл
				СтрокаТЗ = ТЗКартинок.Добавить();
				СтрокаТЗ.Картинка	= Новый Картинка(ЭлементМассива);
				СтрокаТЗ.Расширение	= Параметры.РасширениеКартинки;
				СтрокаТЗ.ПолноеИмяВходящегоФайла = ЭлементМассива;
			КонецЦикла;
		Иначе
			СтрокаТЗ = ТЗКартинок.Добавить();
			Попытка
				СтрокаТЗ.Картинка	= Новый Картинка(СтрТЗ.ПолноеИмяВходящегоФайла);	
			Исключение
				СтрокаТЗ.Картинка = Новый Картинка;
			КонецПопытки;
			
			Если СтрТЗ.РасширениеКартинки = "" Тогда 
				СтрокаТЗ.Расширение = уб_СЛ.ОпределитьРасширениеФайла(СтрТЗ.ПолноеИмяВходящегоФайла);
			Иначе 
				СтрокаТЗ.Расширение	= СтрТЗ.РасширениеКартинки;
			КонецЕсли;
			СтрокаТЗ.ПолноеИмяВходящегоФайла = СтрТЗ.ПолноеИмяВходящегоФайла;
		КонецЕсли;
	КонецЦикла;
	Возврат  ТЗКартинок;
КонецФункции

	


Функция ВывестиСтатистикуКассы(ПолеТД) Экспорт
	//Попытка
	ДанныеРасшифровки = Неопределено;
	//уб_ВызовСервера.
	ВывестиСтатистику(ПолеТД);
	ПолеТД.ПоказатьУровеньГруппировокСтрок(1);
//Исключение
//	КонецПопытки;

КонецФункции
Функция ВывестиСтатистику(ПолеТД = Неопределено) Экспорт
	Если ПолеТД = Неопределено Тогда
		ПолеТД = Новый ТабличныйДокумент;
	КонецЕсли;	
	ДанныеРасшифровки = Неопределено;
	ПолеТД.Очистить();
	Отчет = Отчеты.уб_ПремииЗаПериод.Создать();
	СхемаКомпоновкиДанных = Отчет.СхемаКомпоновкиДанных;
	//Вариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("По формам оплаты");
	Вариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Статистика кассы");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Вариант.Настройки);
	Настройка = Отчет.КомпоновщикНастроек.Настройки;
	//Для каждого Параметр из Настройка.ПараметрыВывода.Элементы Цикл
	//	Если Строка(Параметр.Параметр) = "ВыводитьЗаголовок" или
	//		Строка(Параметр.Параметр) = "Выводитьзаголовок"
	//		Тогда
	//		Параметр.Использование = Ложь;
	//		Прервать;
	//	КонецЕсли;	
	//КонецЦикла;	
	Для каждого  Элемент из Настройка.ПараметрыВывода.Элементы Цикл
		Если Строка(Элемент.Параметр) = "ВыводитьЗаголовок"  Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
			//Элемент.Использование = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ИначеЕсли Строка(Элемент.Параметр) ="ВыводитьПараметрыДанных" Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ИначеЕсли Строка(Элемент.Параметр) ="ВыводитьОтбор" Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КонецЕсли;	
	КонецЦикла;	
	
	Параметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаНач");
	Параметр.Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-6));
	Параметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаКон");
	Параметр.Значение = КонецМесяца(ТекущаяДата());
	
	//
	Менеджер = Параметрысеанса.уб_ТекущееФизЛицо;
	//Менеджер = Справочники.ФизическиеЛица.НайтиПоНаименованию("Слученков Дмитрий",Истина);
	
		ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка.Агент");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		//ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
		ЭлементОтбора.Представление		= Менеджер;
		ЭлементОтбора.ПравоеЗначение	= Менеджер;

	Отчет.СкомпоноватьРезультат(ПолеТД,ДанныеРасшифровки);
    Возврат ПолеТД;
КонецФункции
