Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	// Очистим начальный документ
	ДокументРезультат.Очистить();	
	Макет = ПолучитьМакет("Макет");
	пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;
	//Запрос.УстановитьПараметр("ЛичнаяСтраховка", кЛичнаяЗаявка);
	//Запрос.УстановитьПараметр("Агентская", Перечисления.уб_ВидыЗаявок.Агентская);
	Запрос.УстановитьПараметр("СК", ?(СК.Пустая(),Null,СК));	
	Запрос.УстановитьПараметр("СтраховойПродукт", ?(СтраховойПродукт.Пустая(),Null,СтраховойПродукт));	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ?(ВидСтраховогоПродукта.Пустая(),Null,ВидСтраховогоПродукта));	
	Запрос.УстановитьПараметр("Подразделение", ?(Подразделение.Пустая(),Null,Подразделение));	
	Запрос.УстановитьПараметр("Агент", ?(ЗначениеНеЗаполнено(Агент),Null,Агент));	
	Запрос.УстановитьПараметр("Организация", ?(Организация.Пустая(),Null,Организация));
	Запрос.УстановитьПараметр("ВидКАСКО", пВидКАСКО);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид КАК ВидСтраховогоПродукта,
	|	СУММА(уб_ОплатыПолисов.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	СУММА(уб_ОплатыПолисов.КВСумма) КАК КВСумма,
	|	СУММА(уб_ОплатыПолисов.АВилиСкидкаСумма) КАК АВилиСкидкаСумма,
	|	СУММА(уб_ОплатыПолисов.ВознаграждениеМенеджера) КАК ВознаграждениеМенеджера,
	|	СУММА(уб_ОплатыПолисов.ДоходБрокера) КАК ДоходБрокера,
	|	СУММА(ВЫБОР
	|			КОГДА уб_ОплатыПолисов.Подразделение.БазовоеКВОтДохода = 0
	|				ТОГДА уб_ОплатыПолисов.ВознаграждениеМенеджера
	|			ИНАЧЕ ВЫБОР
	|					КОГДА уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид = &ВидКАСКО
	|						ТОГДА (уб_ОплатыПолисов.КВСумма - уб_ОплатыПолисов.АВилиСкидкаСумма) * уб_ОплатыПолисов.Подразделение.БазовоеКВОтДохода / 100
	|					ИНАЧЕ уб_ОплатыПолисов.ВознаграждениеМенеджера
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВП,
	|	СУММА(уб_ОплатыПолисов.ДоходБрокера - (ВЫБОР
	|			КОГДА уб_ОплатыПолисов.Подразделение.БазовоеКВОтДохода = 0
	|				ТОГДА уб_ОплатыПолисов.ВознаграждениеМенеджера
	|			ИНАЧЕ ВЫБОР
	|					КОГДА уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид = &ВидКАСКО
	|						ТОГДА (уб_ОплатыПолисов.КВСумма - уб_ОплатыПолисов.АВилиСкидкаСумма) * уб_ОплатыПолисов.Подразделение.БазовоеКВОтДохода / 100
	|					ИНАЧЕ уб_ОплатыПолисов.ВознаграждениеМенеджера
	|				КОНЕЦ
	|		КОНЕЦ - уб_ОплатыПолисов.ВознаграждениеМенеджера)) КАК ДоходБрокераРеал
	|ИЗ
	|	РегистрСведений.уб_ОплатыПолисов КАК уб_ОплатыПолисов
	|ГДЕ
	|	уб_ОплатыПолисов.ЗарплатныйПериод МЕЖДУ &ДатаНач И &ДатаКон
	//|	И уб_ОплатыПолисов.СтраховойПолис.НомерЗаявки <> &ЛичнаяСтраховка
	//|	И ИСТИНА
	               
	|	И (уб_ОплатыПолисов.СтраховойПолис.Подразделение = &Подразделение
	|			ИЛИ &Подразделение ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.СК = &СК
	|			ИЛИ &СК ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.Организация = &Организация
	|			ИЛИ &Организация ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.Агент = &Агент
	|			ИЛИ &Агент ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид = &ВидСтраховогоПродукта
	|			ИЛИ &ВидСтраховогоПродукта ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид";
	Обл 									= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтНач 					= Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДтКон 					= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК						= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	Обл.Параметры.ПечВидСтраховогоПродукта	= ?(ЗначениеНеЗаполнено(ВидСтраховогоПродукта),"все страховые продукты",ВидСтраховогоПродукта);
	ДокументРезультат.Вывести(Обл);	
	РезЗапроса 	= Запрос.Выполнить();
	Выборка 	= РезЗапроса.Выбрать();	
	ИтДоход 				= 0;
	ИтОборот 				= 0;
	ИтогоВМ                 = 0;
	ИтогоВП                 = 0;
	ИтогоРазницаВПиВМ       = 0;
	ИтогоКВ                 = 0;
	ИтогоСкидка             = 0;
	ИтогоРазницаКВиСкидка   = 0;
	Ном = 0;
	Обл 			= Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		Ном = 	Ном + 1;
		//
		Обл.Параметры.Ном					= Ном;
		Обл.Параметры.ВидСтраховогоПродукта	= Выборка.ВидСтраховогоПродукта;
		Обл.Параметры.Оборот				= Выборка.НачисленнаяСуммаВзноса;
		Обл.Параметры.Доход					= Выборка.ДоходБрокера;
		Обл.Параметры.ВМ					= Выборка.ВознаграждениеМенеджера;
		Обл.Параметры.ВП					= Выборка.ВП;
		Обл.Параметры.РазницаВПиВМ			= Выборка.ВознаграждениеМенеджера - Выборка.ВП;
		Обл.Параметры.КВ					= Выборка.КВСумма;
		Обл.Параметры.Скидка				= Выборка.АВилиСкидкаСумма;
		Обл.Параметры.РазницаКВиСкидка		= Выборка.КВСумма - Выборка.АВилиСкидкаСумма;
		//
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		//
		ИтОборот 				= ИтОборот + Выборка.НачисленнаяСуммаВзноса;
		ИтДоход 				= ИтДоход + Выборка.ДоходБрокера;		
		ИтогоВМ                 = ИтогоВМ + Выборка.ВознаграждениеМенеджера;
		ИтогоВП                 = ИтогоВП + Выборка.ВП;
		ИтогоРазницаВПиВМ       = ИтогоРазницаВПиВМ + (Выборка.ВознаграждениеМенеджера - Выборка.ВП);
		ИтогоКВ                 = ИтогоКВ + Выборка.КВСумма;
		ИтогоСкидка             = ИтогоСкидка + Выборка.АВилиСкидкаСумма;
		ИтогоРазницаКВиСкидка   = ИтогоРазницаКВиСкидка + (Выборка.КВСумма - Выборка.АВилиСкидкаСумма);
	КонецЦикла;
	
	Обл 								= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтОборот				= ИтОборот;
	Обл.Параметры.ИтДоход				= ИтДоход;
	Обл.Параметры.ИтогоВМ				= ИтогоВМ;
	Обл.Параметры.ИтогоВП				= ИтогоВП;
	Обл.Параметры.ИтогоРазницаВПиВМ		= ИтогоРазницаВПиВМ;
	Обл.Параметры.ИтогоКВ				= ИтогоКВ;
	Обл.Параметры.ИтогоСкидка			= ИтогоСкидка;
	Обл.Параметры.ИтогоРазницаКВиСкидка	= ИтогоРазницаКВиСкидка;
	
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху      = 7;

	ДокументРезультат.Показать("Подведение финансовых итогов");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли 
