
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://1c.ru");
	ПерейтиПоНавигационнойСсылке("https://kupipolis.ru");
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ВыборЗавершение", Новый ОписаниеОповещения("ВложениеВыборЗавершение", ЭтотОбъект));
	//Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	Иначе
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыборЗавершение,"Истина");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НачатьУстановкуРасширенияРаботыСФайлами(ДополнительныеПараметры.ВыборЗавершение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложениеВыборЗавершение(Результат,ДополнительныеПараметры) Экспорт
	//ЗапуститьПриложение("https://kupipolis.ru");
	//ОтключитьБезопа
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ПриЗапускеПриложения",ЭтотОбъект,Новый Структура),"https://kupipolis.ru");
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗапускеПриложения(Результат,Допы) Экспорт
КонецПроцедуры	
//	#Если ВебКлиент Тогда
//		НачатьПодключениеРасширенияРаботыСФайлами(
//   		Новый ОписаниеОповещения( "ПослеПодключения", ЭтотОбъект,Истина));
//	#Иначе	
//		ЗапуститьПриложение("https://kupipolis.ru");
//	#КонецЕсли
//	
//	//Вставить содержимое обработчика.
//	//ПараметрыФормы = Новый Структура("", );
//	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключить(УстановитьЕслиНеПодключено) Экспорт
//   НачатьПодключениеРасширенияРаботыСФайлами(
//   Новый ОписаниеОповещения( "ПослеПодключения", ЭтотОбъект, УстановитьЕслиНеПодключено));
//КонецПроцедуры



//&НаКлиенте
// Процедура  ПослеПодключения(Подключено,УстановитьЕслиНеПодключено) Экспорт
//	Если Подключено Тогда
//		ЗапуститьПриложение("https://kupipolis.ru");
//	ИначеЕсли УстановитьЕслиНеПодключено Тогда
//		НачатьУстановкуРасширенияРаботыСФайлами(
//		Новый ОписаниеОповещения( "Подключить",ЭтотОбъект, Ложь));
//	
//	КонецЕсли;    
//КонецПроцедуры