Перем мНаборыШаблон;

Перем мКэшОбработки;

// Процедура перепроведения документов
//
// Параметры: 
//  ДатаНач - дата, начиная с которой перепроводятся документы
//  ДатаКон - дата, по которою перепроводятся документы
//  Организация - организация, по которой перепроводятся документы
//  СдвигатьГраницуАктуальности - флаг сдвига назад даты актульности по разделам учета при ошибке проведения документа

Процедура ПерепроведениеДокументов(ДатаНач, ДатаКон = '00010101', Организация = Неопределено, СдвигатьГраницуАктуальности = Ложь, ЗаписыватьОшибкиВЖурналРегистрации = Ложь) Экспорт
	
	Перем ФормаПрогрессора;
	
	мНаборыШаблон = Новый Структура;
	
	#Если Клиент Тогда
		ФормаПрогрессора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
		ФормаПрогрессора.НаименованиеОбработкиДанных = "Групповое перепроведение документов";
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Для Каждого ДокументМетаданные ИЗ Метаданные.Документы Цикл
		
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ") + " 
		|""" + ДокументМетаданные.Имя + """ КАК ИмяДокумента, 
		|Представление КАК Представление, 
		|Ссылка КАК Ссылка, 
		|Дата КАК Дата,
		|" + ?(ДокументМетаданные.Реквизиты.Найти("РучнаяКорректировка") <> Неопределено, "РучнаяКорректировка", "Ложь") + " КАК РучнаяКорректировка
		|ИЗ Документ." + ДокументМетаданные.Имя + "
		|ГДЕ Проведен И Дата >= &ДатаНач";
		
		Если ДатаКон <> Дата('00010101') Тогда
			Запрос.Текст = Запрос.Текст + " И Дата <= &ДатаКон";
		КонецЕсли;
		
		Если Организация <> Неопределено И ДокументМетаданные.Реквизиты.Найти("Организация") <> Неопределено Тогда
			Если ТипЗнч(Организация) = Тип("Массив") Тогда
				Запрос.Текст = Запрос.Текст + " И Организация В (&Организация)";
			Иначе
				Запрос.Текст = Запрос.Текст + " И Организация = &Организация";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО Дата, Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Колонки.Добавить("БылаОшибка", Новый ОписаниеТипов("Булево"));
	ВсегоДокументов = ТаблицаДокументов.Количество();
	
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Значение = 0;
		ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов;		
		ФормаПрогрессора.КомментарийОбработкиДанных  = "Удаление движений проведенных документов";		
		ФормаПрогрессора.Открыть();
	КонецЕсли;	
	
	Для Каждого СтрокаДокумента ИЗ ТаблицаДокументов Цикл
		
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
		КонецЕсли;
		
		Регистратор = СтрокаДокумента.Ссылка;
		
		НачатьТранзакцию();
		
		Если СтрокаДокумента.РучнаяКорректировка Тогда
			ОбщегоНазначения.УдалитьДвиженияРегистратора(СтрокаДокумента.Ссылка.ПолучитьОбъект(), Ложь, Истина);
		Иначе					
			КоллекцияДвижений = Метаданные.Документы[СтрокаДокумента.ИмяДокумента].Движения;
			Для Каждого НаборМетаданные ИЗ КоллекцияДвижений Цикл
				Набор = ПолучитьНаборЗаписей(НаборМетаданные);
				Набор.Отбор.Регистратор.Установить(Регистратор);
				
				Попытка
					Набор.Записать();
				Исключение
					Если ОстанавливатьсяПоОшибке Тогда
						Если ФормаПрогрессора <> Неопределено Тогда
							ФормаПрогрессора.Закрыть();
							ВызватьИсключение ОписаниеОшибки();
						КонецЕсли;
					Иначе
						// Продолжаем выполнение для восстановления удаленных движений документов
						ТекстОписанияОшибки = "При удалении движений документа " + Регистратор + " возникла ошибка!" + Символы.ПС + ОписаниеОшибки();
						Если ЗаписыватьОшибкиВЖурналРегистрации Тогда
							//ЗаписьЖурналаРегистрации("Регламентное восстановление даты актуальности", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.УстановкаДатыАктуальностиУчета, , ТекстОписанияОшибки);
						Иначе
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОписанияОшибки,"Сообщить");
							//ОбщегоНазначения.СообщитьОбОшибке(ТекстОписанияОшибки, , "Ошибка удаления движений документа!");
						КонецЕсли;
					КонецЕсли;					
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;	
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Значение = 0;
		ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов;
		ФормаПрогрессора.КомментарийОбработкиДанных  = "Проведение документов";		
		ФормаПрогрессора.Открыть();
	КонецЕсли;		
	
	
	ИндексСтрокиНачалаДаты = Неопределено;
	ТекущаяДатаПроведения = Неопределено;
	
	Для индекс = 0 ПО ВсегоДокументов - 1 Цикл
		СтрокаДокумента = ТаблицаДокументов[индекс];
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
		КонецЕсли;
		
		ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();
		Если ТекущаяДатаПроведения <> ДокументОбъект.Дата Тогда
			ИндексСтрокиНачалаДаты = индекс;
			ТекущаяДатаПроведения = ДокументОбъект.Дата;
		КонецЕсли;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			//Если СдвигатьГраницуАктуальности Тогда
			//					
			//	Если СтрокаДокумента.БылаОшибка Тогда
			//		// для документа уже была ошибка проведения, продолжение не возможно
			//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(),"Сообщить");
			//		//ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
			//		Если ОстанавливатьсяПоОшибке Тогда
			//			Прервать;
			//		КонецЕсли;
			//	КонецЕсли;
			//	
			//	СдвигГраницыАктуалностиПоРазделам(СтрокаДокумента.ИмяДокумента, ДокументОбъект, ЗаписыватьОшибкиВЖурналРегистрации);
			//	СтрокаДокумента.БылаОшибка = Истина;
			//	индекс = ИндексСтрокиНачалаДаты;
			//	
			//Иначе
				
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(),"Сообщить");
				//ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
				Если ОстанавливатьсяПоОшибке Тогда
					Прервать;
				КонецЕсли;				
			//КонецЕсли;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНаборЗаписей(НаборМетаданные)
	
	Если мНаборыШаблон.Свойство(НаборМетаданные.Имя) Тогда
		Возврат мНаборыШаблон[НаборМетаданные.Имя];
		
	Иначе
		Если Метаданные.РегистрыСведений.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыСведений[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыНакопления[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыБухгалтерии[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(НаборМетаданные) Тогда
			Набор = РегистрыРасчета[НаборМетаданные.Имя].СоздатьНаборЗаписей();
			
		КонецЕсли;	
		
		мНаборыШаблон.Вставить(НаборМетаданные.Имя, Набор);
		Возврат Набор;
		
	КонецЕсли;
	
КонецФункции


мКэшОбработки = Новый Структура;
мКэшОбработки.Вставить("МетаданныеОбъектов", Новый Соответствие);
мКэшОбработки.Вставить("АктуальностьРазделовПоОрганизации", Новый Соответствие);