
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
		
		Если НЕ ПустаяСтрока(КоррСчет) Тогда
			Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда
				
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("В составе Корр.счета банка должны быть только цифры!","Сообщить");
				Отказ = Истина;
				
			КонецЕсли;
		КонецЕсли;

		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда

			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("В составе БИК банка должны быть только цифры!","Сообщить");
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

