#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияФормы();
КонецПроцедуры
#КонецОбласти

#Область КомандыСписка
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.СК) КАК СК,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВидБСО) как ВидБСО
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Список)";
				   
	
	_Скидки = Неопределено;
	Ключи = Строки.ПолучитьКлючи();
	Запрос.УстановитьПараметр("Список",Ключи);		
	
	
	СтраховыеКомпании = Запрос.Выполнить().Выгрузить();	
	Ссылки = СтраховыеКомпании.Скопировать();
	Ссылки.Свернуть("Ссылка");
	Для каждого Ссылка из Ссылки Цикл
		СтрокаСписка = Строки[Ссылка.Ссылка];    
		
		Масс = СтраховыеКомпании.НайтиСтроки(Новый Структура("Ссылка",Ссылка.Ссылка));
		СтрокаСК = "";
		СтрокаВидыСП = "";
		Для каждого СтрокаБСО из Масс Цикл
			Если найти(СтрокаСК,СтрокаБСО.СК) = 0 Тогда
				СтрокаСК = СтрокаСК+""+?(СтрокаСК="","",", ")+СтрокаБСО.СК;
			КонецЕсли;	
			Если найти(СтрокаВидыСП,СтрокаБСО.ВидБСО) = 0 Тогда
				СтрокаВидыСП = СтрокаВидыСП+""+?(СтрокаВидыСП="","",", ")+СтрокаБСО.ВидБСО;
			КонецЕсли;	
		КонецЦикла;
		
		СтрокаСписка.Оформление["СК"].УстановитьЗначениеПараметра("Текст",  СтрокаСК);
		СтрокаСписка.Оформление["Город"].УстановитьЗначениеПараметра("Текст",  СтрокаВидыСП);
		//СтрокаСписка.Оформление["Наименование"].УстановитьЗначениеПараметра("ЦветТекста",  Новый Цвет(200,200,200));
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.РежимВыбора = Истина Тогда
		ОповеститьОВыборе(Элементы.Список.ТекущаяСтрока);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Поле.Имя = "ЗаявкаНомер" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(,Заявка(Элементы.Список.ТекущаяСтрока));
	ИначеЕсли Поле.Имя = "РасчетЕсть" Тогда
		СтандартнаяОбработка = Ложь;
		URL = Элементы.Список.ТекущиеДанные.РасчетСсылка;
		Если Элементы.Список.ТекущиеДанные.РасчетЕсть = Истина  Тогда
			Попытка
				ПерейтиПоНавигационнойСсылке(URL);//"https://kupipolis.ru");
			Исключение
				ЗапуститьПриложение(URL);
			КонецПопытки;	
		ИначеЕсли Не ПустаяСтрока(URL)	 Тогда
			ПоказатьЗначение(,URL);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Заявка(Ссылка)
	Возврат Ссылка.Заявка;
КонецФункции	

#КонецОбласти


#Область ФункцииПоиска
&НаКлиенте
Процедура ПриИзмененииФильтра(Элемент)
	Фильтр()
КонецПроцедуры


&НаСервере
Процедура Фильтр()  Экспорт
	СтруктурыФильтра = Новый Массив;
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Агент",        эуПоискМенеджер,      Неопределено, НЕ эуПоискМенеджер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Курьер",       эуПоискКурьер,        Неопределено, НЕ эуПоискКурьер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Номер",        эуНомерПолиса,        ВидСравненияКомпоновкиДанных.Содержит, НЕ ПустаяСтрока(эуНомерПолиса)));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Заявка.Номер", _Число(эуПоискНомер), Неопределено, НЕ ПустаяСтрока(эуПоискНомер)));
	Если ТипЗнч(эуПоискНомерЗаявки) = Тип("Строка") Тогда 
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",_Число(эуПоискНомерЗаявки),Неопределено, НЕ ПустаяСтрока(эуПоискНомерЗаявки)));
	Иначе
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",эуПоискНомерЗаявки,Неопределено, ЗначениеЗаполнено(эуПоискНомерЗаявки)));
	КонецЕсли;	
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СК",эуСК,Неопределено,НЕ эуСК.Пустая()));
	
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","ДатаОкончания",эуПериодОкончания.ДатаНачала,ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ЗначениеЗаполнено(эуПериодОкончания.ДатаНачала),"ДатаОкончанияОт"));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","ДатаОкончания",эуПериодОкончания.ДатаОкончания,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,ЗначениеЗаполнено(эуПериодОкончания.ДатаОкончания),"ДатаОкончанияПо"));
	
	Если СтрДлина(эуПоискСтрахователь)>=3 Тогда
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  уб_ВызовСервера.СтрахователиПоНаименованию(эуПоискСтрахователь),
		                                                                                                            ВидСравненияКомпоновкиДанных.ВСписке, НЕ ПустаяСтрока(эуПоискСтрахователь)));
		//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СтраховательНаименование", эуПоискСтрахователь, ВидСравненияКомпоновкиДанных.Содержит,НЕ ПустаяСтрока(эуПоискСтрахователь)));
	Иначе
		//
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.ВСписке,ЛОЖЬ));
		//Отключаем
		//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СтраховательНаименование",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.Содержит,ЛОЖЬ));
	КонецЕсли;	
	
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","ВидС",эуПоискВидСП,Неопределено,НЕ эуПоискВидСП.Пустая()));
	Если ЗначениеЗаполнено(эуПоискVIN) 
		или ЗначениеЗаполнено(эуМарка) 
		или ЗначениеЗаполнено(эумодель) 
		Тогда
		СписокОбъектов = СписокОбъектов();
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","ОбъектСтрахования",СписокОбъектов,ВидСравненияКомпоновкиДанных.ВСписке,Истина));
	Иначе
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","ОбъектСтрахования",Неопределено,Неопределено,ЛОЖЬ));
	КонецЕсли;	
	
	
	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра);
КонецПроцедуры	

&НаКлиенте
Процедура эуПоискСтраховательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	//Если СтрДлина(Текст)>=4 Тогда
	//	
	//	//СтандартнаяОбработка = Ложь;
	//	Если Не эуПоискСтрахователь = Текст Тогда
	//		эуПоискСтрахователь = Текст;
	//	КонецЕсли;	
	//	//Фильтр();
	//	//ОтключитьОбработчикОжидания("ФильтрКлиент");
	//	//ПодключитьОбработчикОжидания("ФильтрКлиент",0.7,Истина);
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура эуПоискСтраховательИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//Если СтрДлина(Текст)>4 Тогда
	//	
	//	//СтандартнаяОбработка = Ложь;
	//	Если Не эуПоискСтрахователь = Текст Тогда
	//		эуПоискСтрахователь = Текст;
	//		Фильтр();
	//	КонецЕсли;	
	//КонецЕсли;
КонецПроцедуры


//&НаКлиенте
//Процедура ФильтрКлиент()
//	эуПоискСтрахователь = Элементы.эуПоискСтрахователь.ТекстРедактирования;
//	Фильтр();	
//КонецПроцедуры	


&НаКлиенте
Процедура эуСКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
	//TODO Переделать под управляемые формы
	//ПараметрыОткрытия= уб_СС.ПараметрыНачалаВыбора();
	//ПараметрыОткрытия.Вставить("МенюПоТипам",     Новый Структура("Контрагенты",Истина));
	//ПараметрыОткрытия.Вставить("ОтображениеМеню", Новый Структура("Контрагенты",Истина));
	//
	//Если Элемент.Имя = "эуСК" Тогда
	//	ПараметрыОткрытия.Вставить("Значение",эуСК);
	//КонецЕсли;	
	//ПараметрыОткрытия.Вставить("ИмяФормыВыбора","ФормаВыбораУправляемая");
	//уб_СС.ВыборПоставщика(Элемент, СтандартнаяОбработка,,ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура эуПоискМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура эуПоискКурьерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Курьеры"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры


&НаКлиенте
Процедура эуПоискНомерЗаявкиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	эуПоискНомерЗаявки   = "";
	Фильтр();
КонецПроцедуры


&НаСервереБезКонтекста
Функция _Число(Число)
	Если  ПустаяСтрока(Число) Тогда
		Возврат 0
	Иначе
		Попытка
			Возврат Число(Число);
		Исключение
			Возврат 0
		КонецПопытки;	
	КонецЕсли;	
КонецФункции	


#КонецОбласти

#Область Вспомогательные

&НаСервере
Процедура ИнициализацияФормы()
	ОбновитьСпискиВыбора();
	
	Если Параметры.РежимВыбора Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
		//скрываем колонки
		
		//Элементы.ВремяНачало.Видимость		= Ложь;
		//Элементы.ВремяВстречи.Видимость  	= Ложь;
		//Элементы.ВремяОкончания.Видимость   = Ложь;
		//Элементы.СтатусЗаявки.Видимость			= Ложь;
	КонецЕсли;
	Если Параметры.Свойство("Страхователь") Тогда
		эуПоискСтрахователь = СокрЛП(Параметры.Страхователь);
		Фильтр();
	КонецЕсли;	
	
	
НовыйПараметр = Новый ПараметрВыбора("ЭтоСотрудник", Истина);
НовыйМассив = Новый Массив();
НовыйМассив.Добавить(НовыйПараметр);

Элементы.эуПоискМенеджер.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);

КонецПроцедуры	

&НаСервере
Процедура ОбновитьСпискиВыбора()
	
	Запрос  = Новый Запрос;
	РасчетныйПериод = НачалоМесяца(ТекущаяДата())-1;
	Запрос.УстановитьПараметр("ДатаНач",ТекущаяДата()-365*24*3600);					   
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ТекущаяДата()));					   
	
	ЭтоПолныеПрава = Ложь;
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") 
		или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь) 
		или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПросмотрВсехПолисовИЗаявок, Ложь) 
		Тогда
		ЭтоПолныеПрава = Истина;
	Иначе	
		ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		// Разрешенные.ВключаяВыбывших = Истина;
		ПодчиненныеРуководителя = уб_СС.ПодчиненныеРуководителя(,РасчетныйПериод,  ПараметрыПодчиненных);
	КонецЕсли;	
			
	Если ПодчиненныеРуководителя = Неопределено или СокрЛП(ПараметрыПодчиненных.ПодразделениеСотрудника) = "СВС" Тогда
		ПодчиненныеРуководителя = Неопределено;//ДЛя СВС
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ  Разрешенные
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Агент КАК Менеджер
		|ИЗ
		|	Документ.уб_СтраховойПолис КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		|ГДЕ
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
		|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
		|	И (НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Агент.Наименование";
		СписокМенеджеров = Новый СписокЗначений;
		СписокМенеджеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");
	Иначе
		СписокМенеджеров = ПодчиненныеРуководителя.ВыгрузитьЗначения(); 
		//Если ЭтоПолныеПрава = Ложь Тогда
		//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	|	уб_СтраховойПолис.Ссылка КАК Ссылка
		//	|ИЗ
		//	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		//	|ГДЕ
		//	|	(уб_СтраховойПолис.Агент В (&Менеджер)
		//	|    или уб_СтраховойПолис.Агент.Преемник  В(&Менеджер)
		//	|			ИЛИ уб_СтраховойПолис.Курьер В (&Менеджер))";
		//	Запрос.УстановитьПараметр("Менеджер",СписокМенеджеров);
		//	ДоступныеЗаявки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		//	
		//	СтруктурыФильтра = Новый Массив;
		//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Ссылка",ДоступныеЗаявки,ВидСравненияКомпоновкиДанных.ВСписке, Истина));
		//	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра);
		//КонецЕсли;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	ФизическиеЛица.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
				               |ГДЕ
				               |	(ФизическиеЛица.Ссылка В (&Менеджер)
				               |			ИЛИ ФизическиеЛица.Преемник В (&Менеджер))";
		Если ЭтоПолныеПрава = Ложь Тогда
			Запрос.УстановитьПараметр("Менеджер",СписокМенеджеров);
			ДоступныеФизлица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
			СтруктурыФильтра = Новый Массив;
			СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Агент",ДоступныеФизлица,ВидСравненияКомпоновкиДанных.ВСписке, Истина,"Скрытое"));
			СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Курьер",ДоступныеФизлица,ВидСравненияКомпоновкиДанных.ВСписке, Истина,"Скрытое"));
			уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра,Истина);
		КонецЕсли;

	КонецЕсли;
	
	Элементы.эуПоискМенеджер.СписокВыбора.ЗагрузитьЗначения(СписокМенеджеров);
	Элементы.эуПоискМенеджер.ВысотаСпискаВыбора = Мин(30,СписокМенеджеров.Количество());	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ   Разрешенные
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер КАК Курьер
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|ГДЕ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления
	|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд
	|
	|УПОРЯДОЧИТЬ ПО
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование";
	СписокКурьеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Курьер");
	Элементы.эуПоискКурьер.СписокВыбора.ЗагрузитьЗначения(СписокКурьеров);
	Элементы.эуПоискКурьер.ВысотаСпискаВыбора = Мин(30,СписокКурьеров.Количество());	
	
	
	
	
	СписокВыбора =	Элементы.эуСК.СписокВыбора;
	СписокВыбора.Очистить();
	Для каждого ЭлементСписка из уб_СЛ.ПолучитьСписокСК() Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);
	КонецЦикла;	
	Элементы.эуСК.ВысотаСпискаВыбора = Мин(20,СписокВыбора.Количество());
	
	
	СписокВыбора = Новый Массив;
	СписокВыбора.Добавить(Перечисления.уб_ВидыЗаявок.Личная);
	СписокВыбора.Добавить(Перечисления.уб_ВидыЗаявок.Агентская);
	Элементы.эуПоискНомерЗаявки.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	Элементы.эуПоискНомерЗаявки.КнопкаВыпадающегоСписка = Истина;
	эуПоискНомерЗаявки = "";
КонецПроцедуры

&НаСервере
Функция СписокОбъектов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	уб_ТранспортныеСредства.Объект КАК Объект
	               |ИЗ
	               |	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	               |ГДЕ
	               |	1 = 1
	               |	И 2 = 2
				   |	И 3 = 3";
	Если ЗначениеЗаполнено(эуМарка) Тогда
		Запрос.Текст = Стрзаменить(Запрос.Текст,"1 = 1","уб_ТранспортныеСредства.МаркаТС = &МаркаТС");
		Запрос.УстановитьПараметр("МаркаТС",эуМарка);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(эуМодель) Тогда
		Запрос.Текст = Стрзаменить(Запрос.Текст,"3 = 3","уб_ТранспортныеСредства.МодельТС = &МодельТС");
		Запрос.УстановитьПараметр("МодельТС",эуМодель);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(эуПоискVIN) Тогда
		Запрос.Текст = Стрзаменить(Запрос.Текст,"2 = 2","уб_ТранспортныеСредства.ИдентификационныйНомер Подобно &ИдентификационныйНомер");
		Запрос.УстановитьПараметр("ИдентификационныйНомер","%"+СокрЛП(эуПоискVIN)+"%");
	КонецЕсли;	

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");	
		
	
КонецФункции	

&НаКлиенте
Процедура СтараяФорма(Команда)
	ОткрытьФорму("Документ.уб_СтраховойПолис.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Список.
	Элементы.Ссылка.Видимость = Истина;
	Элементы.Комментарий.Видимость = Ложь;
	Элементы.ДатаСоздания.Видимость = Ложь;
	Элементы.ДатаИзменения.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти
