
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	ПараметрыФункции = Неопределено;
	уб_СС.ПодчиненныеРуководителя(, ТекущаяДата(), ПараметрыФункции);
	Если РольДоступна("ПолныеПрава") Тогда
		СписокСотрудников = 	уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(ТекущаяДата());
	Иначе
		СписокСотрудников = ПараметрыФункции.СписокСотрудников;
//		Элементы.НастройкиОтчета.Доступность = Ложь;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если СписокСотрудников.Количество() = 0 Тогда
			СписокСотрудников.Добавить(ПараметрыСеанса.уб_ТекущееФизЛицо);
		КонецЕсли;	
	КонецЕсли;	
	Если СписокСотрудников.Количество() = 1 Тогда
		Объект.Менеджер = СписокСотрудников[0].Значение ;
		Элементы.Менеджер.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(СписокСотрудников.ВыгрузитьЗначения());

	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(уб_temp.ПолучитьСписокАктуальныхПодразделений().ВыгрузитьЗначения());
	ПроцентДоходаБрокера = 100;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	//Если уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") = Ложь Тогда
	//	Объект.СкрыватьКолонкиДСП = Истина;
	//КонецЕсли;		
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод) Тогда
		Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(ТекущаяДата()));
	КонецЕсли;
	// Очистим начальный документ
	ДокументРезультат = ЭтаФорма.Результат;
	ДокументРезультат.Очистить();
	///////////////////////////////////////////////////////////
	// Запрос формируеться на основании Документа уб_ОплатаПолисов
	// является основанием всего отчета. 
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОП.Подразделение.Владелец КАК Организация,
	|	ОП.Агент КАК Агент,
	|	ОП.Ссылка КАК ДокументОплаты,
	|	ОП.Дата КАК Дата,
	|	ОП.ВознаграждениеМенеджера КАК ВознаграждениеМенеджера,
	|	ОП.СтраховойПолис.СК.Наименование КАК СК,
	|	ОП.Видсп КАК ВидСП,
	|	ОП.СтраховойПолис.СтраховойПродукт.Наименование КАК СтраховойПродукт,
	|	ОП.СтраховойПолис.Страхователь.Наименование КАК Страхователь,
	|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
	|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
	|	ОП.НомерКвитанции,
	|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
	|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
	|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
	|	ОП.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
	|	ОП.НомерВзноса,
	|	ОП.ОплаченоФакт,
	|	ОП.НаправлениеПлатежа КАК НаправлениеПлатежа,
	|	ОП.АВилиСкидкаПроцент КАК АВилиСкидкаПроцент,
	|	ОП.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
	|	ОП.ВычетСАгента,
	|	ОП.ВидРасчетаСАгентом,
	|	ОП.СхемаРасчетаСМенеджером,
	|	ОП.КВПроцент,
	|	ОП.КВСумма КАК КВСумма,
	|	ОП.КВПроцентДляОтчета,
	|	ОП.СтраховойПолис,
	|	ОП.ОтчетАгента,
	|	ОП.ОтчетПоставщику,
	|	1 КАК Кол,
	|	ОП.КВПодВопросом,
	|	ОП.Подразделение,
	|	ВЫБОР
	|		КОГДА ОП.Подразделение.БазовоеКВОтДохода = 0
	|			ТОГДА ОП.ВознаграждениеМенеджера
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.Видсп = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|					ТОГДА (ОП.КВСумма - ОП.АВилиСкидкаСумма) * ОП.Подразделение.БазовоеКВОтДохода / 100
	|				ИНАЧЕ ОП.ВознаграждениеМенеджера
	|			КОНЕЦ
	|	КОНЕЦ КАК ВПСумма,
	|	ОП.ВознаграждениеМенеджера КАК ВознагМенеджера,
	|	ОП.КВСумма - ОП.АВилиСкидкаСумма - ОП.ВычетСАгента КАК ДоходБрокера,
	|	ОП.КВСуммаДляАгента КАК КВСуммаДляАгента,
	|	ОП.КВПроцентДляАгента,
	|	ОП.Номер КАК НомерОплаты,
	|	ОП.СкидкаВыплаченаяКлиенту - ЕСТЬNULL(СУММА(Р.Сумма), 0) КАК КВычету,
	|	ВЫБОР
	|		КОГДА ОП.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Безнал), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику))
	|			ТОГДА ОП.ПроверенаЗП
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПроверенаЗП,
	|	ОП.ОтчетПоставщику КАК ОтчетПоставщику1
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК ОП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Р
	|		ПО ((ВЫРАЗИТЬ(Р.ОтчетПоставщику КАК Документ.уб_ОплатаПолисов)) = ОП.Ссылка)
	|			И (Р.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту))
	|ГДЕ
	|	НЕ ОП.ПометкаУдаления
	|	И ОП.ЗарплатныйПериод >= &ДатаНачала
	|	И ОП.ЗарплатныйПериод <= &ДатаКонца
	|	И ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|	И ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ОП.Ссылка,
	|	ОП.Подразделение.Владелец,
	|	ОП.Агент,
	|	ОП.Дата,
	|	ОП.ВознаграждениеМенеджера,
	|	ОП.СтраховойПолис.СК.Наименование,
	|	ОП.Видсп,
	|	ОП.СтраховойПолис.СтраховойПродукт.Наименование,
	|	ОП.СтраховойПолис.Страхователь.Наименование,
	|	ОП.СтраховойПолис.Дата,
	|	ОП.СтраховойПолис.Номер,
	|	ОП.НомерКвитанции,
	|	ОП.СтраховойПолис.НомерЗаявки,
	|	ОП.СтраховойПолис.БонусМенеджеру,
	|	ОП.СтраховойПолис.СтраховаяПремия,
	|	ОП.НачисленнаяСуммаВзноса,
	|	ОП.НомерВзноса,
	|	ОП.ОплаченоФакт,
	|	ОП.НаправлениеПлатежа,
	|	ОП.АВилиСкидкаПроцент,
	|	ОП.АВилиСкидкаСумма,
	|	ОП.ВычетСАгента,
	|	ОП.ВидРасчетаСАгентом,
	|	ОП.СхемаРасчетаСМенеджером,
	|	ОП.КВПроцент,
	|	ОП.КВСумма,
	|	ОП.КВПроцентДляОтчета,
	|	ОП.СтраховойПолис,
	|	ОП.ОтчетАгента,
	|	ОП.ОтчетПоставщику,
	|	ОП.КВПодВопросом,
	|	ОП.Подразделение,
	|	ОП.КВСуммаДляАгента,
	|	ОП.КВПроцентДляАгента,
	|	ОП.Номер,
	|	ВЫБОР
	|		КОГДА ОП.Подразделение.БазовоеКВОтДохода = 0
	|			ТОГДА ОП.ВознаграждениеМенеджера
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|					ТОГДА (ОП.КВСумма - ОП.АВилиСкидкаСумма) * ОП.Подразделение.БазовоеКВОтДохода / 100
	|				ИНАЧЕ ОП.ВознаграждениеМенеджера
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОП.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Безнал), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику))
	|			ТОГДА ОП.ПроверенаЗП
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ОП.ВознаграждениеМенеджера,
	|	ОП.ОтчетПоставщику,
	|	ОП.СкидкаВыплаченаяКлиенту
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроверенаЗП УБЫВ,
	|	Агент,
	|	ВидСП,
	|	Дата
	|ИТОГИ
	|	СУММА(ВознаграждениеМенеджера),
	|	СУММА(НачисленнаяСуммаВзноса),
	|	СРЕДНЕЕ(АВилиСкидкаПроцент),
	|	СУММА(АВилиСкидкаСумма),
	|	СУММА(КВСумма),
	|	СУММА(Кол),
	|	СУММА(ВПСумма),
	|	СУММА(ВознагМенеджера),
	|	СУММА(ДоходБрокера),
	|	СУММА(КВСуммаДляАгента),
	|	СУММА(КВычету)
	|ПО
	|	ПроверенаЗП,
	|	Организация,
	|	Агент,
	|	ВидСП";
	//ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);    // Период береться за месяц тек. даты
	//ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
	//ДатаНачала 		= НачалоМесяца(Период.ДатаНачала);    // Период береться за месяц тек. даты
	//ДатаКонца 		= КонецМесяца(Период.ДатаОкончания);
	ДатаНачала 		= Период.ДатаНачала;    // Период береться за месяц тек. даты
	ДатаКонца 		= Период.ДатаОкончания;

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", 	ДатаКонца);
	ДопУсловие = "";
	ФиксацияСверху = 7;
	// Условие на отбор по менеджеру
	ПоОдномуМенеджеру = Ложь;
	Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
		ФиксацияСверху 		= ФиксацияСверху + 1;
		ПоОдномуМенеджеру 	= Истина;
		ДопУсловие 			= ДопУсловие + " И ОП.Агент = &Менеджер ";
		Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
	КонецЕсли;
	Если не ПолныеПрава() Тогда
		ДопУсловие 			= ДопУсловие + " И ОП.Агент В (&Менеджеры) ";
		Запрос.УстановитьПараметр("Менеджеры", 	Элементы.Менеджер.СписокВыбора.ВыгрузитьЗначения());
	КонецЕсли;	
	// Условие на отбор по подразделению
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ДопУсловие = ДопУсловие + " И (ОП.Подразделение = &Подразделение или ОП.Подразделение В ИЕРАРХИИ (&Подразделение)) ";
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	КонецЕсли;
	ДопУсловие = ДопУсловие + " И ВЫБОР КОГДА ОП.НачисленнаяСуммаВзноса = 0 ТОГДА 0 ИНАЧЕ ВЫРАЗИТЬ ((ОП.КВСумма - ОП.АВилиСкидкаСумма - ОП.ВычетСАгента) * 100 / ОП.НачисленнаяСуммаВзноса КАК ЧИСЛО(15, 2)) КОНЕЦ < &ПроцентДоходаБрокера ";
	Запрос.УстановитьПараметр("ПроцентДоходаБрокера", ПроцентДоходаБрокера);
	// Условие на отбор по Виду СП
	ПоОдномуВидуСП = Ложь;
	Если ЗначениеЗаполнено(Объект.ВидСП) Тогда
		ФиксацияСверху 	= ФиксацияСверху + 1;
		ПоОдномуВидуСП 	= Истина;
		ДопУсловие 		= ДопУсловие + " И ОП.ВидСП = &ВидСП ";
		Запрос.УстановитьПараметр("ВидСП", Объект.ВидСП);
	КонецЕсли;
	
	Если Объект.ТолькоСНепровереннойЗП = Истина Тогда
		//
		ДопУсловие = ДопУсловие + " И ВЫБОР
		|		КОГДА ОП.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Безнал), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику))
		|			ТОГДА ОП.ПроверенаЗП
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ = ЛОЖЬ ";
	КонецЕсли;
	
	Если ТолькоНеотработанные Тогда
		ДопУсловие = ДопУсловие + " И ОП.ОтчетПоставщику <> Значение(Документ.уб_ОтчетПоставщику.ПустаяСсылка) ";
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(СК) Тогда
		ДопУсловие = ДопУсловие + " И ОП.СК = &СК ";
		Запрос.УстановитьПараметр("СК", 		Объект.СК);
	КонецЕсли;	

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ИСТИНА",ДопУсловие);
	//НомерОплатыКАСКО	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса 	= Запрос.Выполнить();
	УсловиеОтбораОплат = "
	               |ГДЕ ИСТИНА ";
	УсловиеОтбораОплат = УсловиеОтбораОплат + "
	               |	И ОП.ЗарплатныйПериод >= &ДатаНачала
			   |	И ОП.ЗарплатныйПериод <= &ДатаКонца ";
			   
	ФильтрПоМенеджеру = ЗначениеЗаполнено(Объект.Менеджер);			   
	Если ФильтрПоМенеджеру Тогда
		УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Агент = &Менеджер ";
	КонецЕсли;
	
	ФильтрПоПодразделению = ЗначениеЗаполнено(Объект.Подразделение);			   
	Если ФильтрПоПодразделению Тогда
		УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Подразделение = &Подразделение ";
	КонецЕсли;
	УсловиеОтбораОплат = УсловиеОтбораОплат + "
	               |	И ОП.СтраховойПолис.Ссылка <> &ПустойПолис
	               |	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	               |	И ОП.СтраховойПолис.НомерЗаявки = ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Личная) ";
	Если ЗначениеЗаполнено(Объект.ВидСП) Тогда
		УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ВидСП = &ВидСП ";
	КонецЕсли;
	Если ТолькоНеотработанные Тогда
		УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ОтчетПоставщику <> Значение(Документ.уб_ОтчетПоставщику.ПустаяСсылка)";
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(СК) Тогда
		УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.СК = &СК ";
		Запрос.УстановитьПараметр("СК", 		Объект.СК);
	КонецЕсли;	
	
	
	///////////////////////////////////////////////////////////
	// Запрос формируется на основании документа уб_ОплатаПолисов
	// является основанием всего отчета. 
	ПустойПолис = Документы.уб_СтраховойПолис.ПустаяСсылка();
	ЗапросД = Новый Запрос;
	ЗапросД.УстановитьПараметр("ДатаНачала", 		ДатаНачала);
	ЗапросД.УстановитьПараметр("ДатаКонца", 		ДатаКонца);
	ЗапросД.УстановитьПараметр("ПустойПолис", 		ПустойПолис);
	ЗапросД.УстановитьПараметр("Менеджер", 			Объект.Менеджер);
	ЗапросД.УстановитьПараметр("Подразделение", 	Объект.Подразделение);
	ЗапросД.УстановитьПараметр("ВидСП",	 			Объект.ВидСП);
	// Если галочка "пересчитывать суммы в оплатах" ИСТИНА
	Если Объект.ПересчитыватьСуммыВОплатах Тогда
		ЗапросД.Текст = 
		"ВЫБРАТЬ
		|	ОП.Ссылка
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП" + УсловиеОтбораОплат;
		РезультатД = ЗапросД.Выполнить();
		ПересчитатьСуммыПоЗП(РезультатД);
	КонецЕсли;
	///// Проверочная выгрузка ////////
	//	ТЗЗ = Результат.Выгрузить(); //
	///////////////////////////////////
	цЖелтенький = Новый Цвет(255, 255, 153);
	Макет 	= Обработки.уб_ОтчетПоЛичнымЗаявкам.ПолучитьМакет("Макет");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	//Если Объект.СкрыватьКолонкиДСП Тогда
	//	Макет.УдалитьОбласть(Макет.Область("ДСП2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	//КонецЕсли;
	////////////////// ШАПКА \\\\\\\\\\\\\\\\\\\
	Обл = Макет.ПолучитьОбласть("Шапка0");
	Обл.Параметры.ЗарплатныйПериод = Формат(Период.ДатаНачала,"ДФ=MM.yyyy")+"-"+Формат(Период.ДатаОкончания,"ДФ=MM.yyyy");
	//Формат(ЗарплатныйПериод,"ДФ='ММMM yyyy'");
	Если Не ЗначениеЗаполнено(Объект.ВидСП) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоВидСП"),Смещать);
	Иначе
		Обл.Параметры.ВидСП	= Объект.ВидСП;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),Смещать);
	Иначе
		Обл.Параметры.Менеджер = Объект.Менеджер;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
	Иначе
		Обл.Параметры.Подразделение = Объект.Подразделение;
	КонецЕсли;
	ДокументРезультат.Вывести(Обл);
	
	ВыборкаВид	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаВид.Следующий() Цикл
		Обл = Макет.ПолучитьОбласть("Шапка1");
		Обл.Параметры.ВидВыплаты  = ?(ВыборкаВид.ПроверенаЗП,"Начислено:","Ожидается:");
		ДокументРезультат.Вывести(Обл);
		ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ВыборкаОрг 	= ВыборкаВид.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	СчНом = 0;
	ЧФ = "ЧЦ=14; ЧДЦ=2";
	//////////////////// ОРГ \\\\\\\\\\\\\\\\\\\\\
	// заполнение строки макета ОРГ
	Пока ВыборкаОрг.Следующий() Цикл
		//ИндикаторИнициализировать(ВыборкаОрг.Кол);
		ОблОрг = Макет.ПолучитьОбласть("Орг");
		ОблОрг.Параметры.Кол			= ВыборкаОрг.Кол;                              
		ОблОрг.Параметры.Организация	= ВыборкаОрг.Организация;
		ОблОрг.Параметры.ВМ				= Формат(ВыборкаОрг.ВознаграждениеМенеджера,	ЧФ);
		ОблОрг.Параметры.КВ				= Формат(ВыборкаОрг.КВСумма,					ЧФ);
		ОблОрг.Параметры.АВ				= Формат(ВыборкаОрг.АВилиСкидкаСумма,			ЧФ);
		ОблОрг.Параметры.КВДляАгента	= Формат(ВыборкаОрг.КВСуммаДляАгента, 			ЧФ);
		ОблОрг.Параметры.КВычету  		= Формат(ВыборкаОрг.КВычету,					ЧФ);
		Если Не Объект.СкрыватьКолонкиДСП Тогда
			ОблОрг.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаОрг.ДоходБрокера,ЧФ);
			ОблОрг.Параметры.ПроцентДоходаБрокера = ?(ВыборкаОрг.НачисленнаяСуммаВзноса=0,"", Формат(ВыборкаОрг.ДоходБрокера*100/ВыборкаОрг.НачисленнаяСуммаВзноса,ЧФ));
		КонецЕсли;
		ОблОрг.Параметры.СуммаВзносов	= Формат(ВыборкаОрг.НачисленнаяСуммаВзноса,ЧФ);
		ДокументРезультат.Вывести(ОблОрг,1,,Истина);
		ВыборкаМенеджер = ВыборкаОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		///////////////// МЕНЕДЖЕР \\\\\\\\\\\\\\\\\
		// заполнение строки макета МЕНЕДЖЕР	
		Пока ВыборкаМенеджер.Следующий() Цикл
			ОблМенеджер = Макет.ПолучитьОбласть("Менеджер");
			ОблМенеджер.Параметры.Кол			= ВыборкаМенеджер.Кол;
			ОблМенеджер.Параметры.Менеджер		= ВыборкаМенеджер.Агент;
			ОблМенеджер.Параметры.ВМ			= Формат(ВыборкаМенеджер.ВознаграждениеМенеджера,	ЧФ);
			ОблМенеджер.Параметры.КВ			= Формат(ВыборкаМенеджер.КВСумма,					ЧФ);
            ОблМенеджер.Параметры.АВ			= Формат(ВыборкаМенеджер.АВилиСкидкаСумма,			ЧФ);
			ОблМенеджер.Параметры.КВДляАгента   = Формат(ВыборкаМенеджер.КВСуммаДляАгента, 			ЧФ);
			ОблМенеджер.Параметры.КВычету  		= Формат(ВыборкаМенеджер.КВычету,					ЧФ);
			ОблМенеджер.Параметры.СуммаВзносов	= Формат(ВыборкаМенеджер.НачисленнаяСуммаВзноса,	ЧФ);
			Если Не Объект.СкрыватьКолонкиДСП Тогда
				ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.ДоходБрокера,ЧФ);
				ОблМенеджер.Параметры.ПроцентДоходаБрокера	= ?(ВыборкаМенеджер.НачисленнаяСуммаВзноса=0,"", Формат(ВыборкаМенеджер.ДоходБрокера*100/ВыборкаМенеджер.НачисленнаяСуммаВзноса,ЧФ));
			КонецЕсли;
			ДокументРезультат.Вывести(ОблМенеджер, 2, Строка(ВыборкаМенеджер.Организация), Истина);
			ВыборкаВидСП = ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			/////////////////// ВидСП \\\\\\\\\\\\\\\\\\\
			// Заполнение строки макета ВидСП
			Пока ВыборкаВидСП.Следующий() Цикл
				ОблВидСП = Макет.ПолучитьОбласть("ВидСП");
				ОблВидСП.Параметры.Кол			= ВыборкаВидСП.Кол;
				ОблВидСП.Параметры.ВидСП		= ВыборкаВидСП.ВидСП;
				ОблВидСП.Параметры.ВМ			= Формат(ВыборкаВидСП.ВознаграждениеМенеджера,	ЧФ);
				ОблВидСП.Параметры.КВ			= Формат(ВыборкаВидСП.КВСумма,					ЧФ);
				ОблВидСП.Параметры.АВ			= Формат(ВыборкаВидСП.АВилиСкидкаСумма,			ЧФ);
				ОблВидСП.Параметры.КВДляАгента	= Формат(ВыборкаВидСП.КВСуммаДляАгента, 		ЧФ);
				ОблВидСП.Параметры.КВычету  	= Формат(ВыборкаВидСП.КВычету,					ЧФ);
				ОблВидСП.Параметры.СуммаВзносов	= Формат(ВыборкаВидСП.НачисленнаяСуммаВзноса,	ЧФ);
				Если НЕ Объект.СкрыватьКолонкиДСП Тогда
					ОблВидСП.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаВидСП.ДоходБрокера, ЧФ);
					ОблВидСП.Параметры.ПроцентДоходаБрокера	= ?(ВыборкаВидСП.НачисленнаяСуммаВзноса=0,"", Формат(ВыборкаВидСП.ДоходБрокера*100/ВыборкаВидСП.НачисленнаяСуммаВзноса,ЧФ));
			    КонецЕсли;
				ДокументРезультат.Вывести(ОблВидСП,3,Строка(ВыборкаМенеджер.Агент),Истина);
				СчВидаСП = 0;
				ВыбСтр 	= ВыборкаВидСП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				////////////////// СТРОКА \\\\\\\\\\\\\\\\\\\\
				// Заполнение строки макета СТРОКА
				Пока ВыбСтр.Следующий() Цикл
					СчНом = СчНом + 1;
					//ИндикаторСтеп();
					СчВидаСП = СчВидаСП + 1;
					Если ТолькоНеотработанные = ЛОЖЬ и ВыбСтр.ПроверенаЗП = Истина или Объект.ЗарплатныйПериод<Дата(2016,1,1) Тогда
						Обл = Макет.ПолучитьОбласть("Строка");
					Иначе
						//
						Если ЗначениеЗаполнено(ВыбСтр.ОтчетПоставщику) Тогда
							УстановитьПривилегированныйРежим(Истина);
							ВыборкаЗадолженность = уб_Взаиморасчеты.ПолучитьСостояниеОтчетаПоставщику(ВыбСтр.ОтчетПоставщику);
							Если ВыборкаЗадолженность.ФактЗадолженность<>0 Тогда
								Обл = Макет.ПолучитьОбласть("Строка1");
							Иначе
								Обл = Макет.ПолучитьОбласть("Строка2");
							КонецЕсли;	
							
							УстановитьПривилегированныйРежим(Ложь);
						Иначе
							Обл = Макет.ПолучитьОбласть("Строка1");
						КонецЕсли;
					КонецЕсли;	
					Обл.Параметры.Ном						= СчНом;
					Обл.Параметры.НомерОплаты				= СчВидаСП;
					Обл.Параметры.ДатаОплаты				= Формат(ВыбСтр.Дата,"ДФ=dd.MM.yy");
					Обл.Параметры.СК						= ВыбСтр.СК;
					Обл.Параметры.СтраховойПродукт			= ВыбСтр.СтраховойПродукт;
					Обл.Параметры.КВПроцент					= ВыбСтр.КВПроцент;
					Обл.Параметры.АВилиСкидкаПроцент		= ВыбСтр.АВилиСкидкаПроцент;
					Обл.Параметры.КВПроцентДляАгента		= ВыбСтр.КВПроцентДляАгента;
					Обл.Параметры.ВМСумма					= Формат(ВыбСтр.ВознаграждениеМенеджера,	ЧФ);
					Обл.Параметры.КВСумма					= Формат(ВыбСтр.КВСумма,					ЧФ);
					Обл.Параметры.КВСуммаДляАгента			= Формат(ВыбСтр.КВСуммаДляАгента, 			ЧФ);
					Обл.Параметры.ПолнаяПремия				= Формат(ВыбСтр.ПолнаяПремия,				ЧФ);
					Обл.Параметры.НачисленнаяСуммаВзноса	= Формат(ВыбСтр.НачисленнаяСуммаВзноса,		ЧФ);
					Обл.Параметры.АВилиСкидкаСумма			= Формат(ВыбСтр.АВилиСкидкаСумма,			ЧФ);
					Обл.Параметры.КВычету  					= Формат(ВыбСтр.КВычету,					ЧФ);
					Обл.Параметры.Страхователь				= ВыбСтр.Страхователь;
					Обл.Параметры.ДатаПолиса				= ВыбСтр.ДатаПолиса;
					Обл.Параметры.НомерПолиса				= СокрЛП(ВыбСтр.НомерПолиса);
					Обл.Параметры.НомерКвитанции			= ?(ПустаяСтрока(ВыбСтр.НомерКвитанции),"Отсутствует",ВыбСтр.НомерКвитанции);
					Обл.Параметры.НомерОплаты = ВыбСтр.НомерОплаты;					
					фО = ?(ВыбСтр.НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.Поставщику, "/" + ВыбСтр.НаправлениеПлатежа, "");
					Если ВыбСтр.НомерВзноса = 1 И ВыбСтр.ПолнаяПремия = ВыбСтр.НачисленнаяСуммаВзноса Тогда
						Обл.Параметры.НомерВзноса = "П" + фО;
					Иначе
						Обл.Параметры.НомерВзноса = Строка(ВыбСтр.НомерВзноса) + " взн." + фО;
					КонецЕсли;
					Если НЕ Объект.СкрыватьКолонкиДСП Тогда
						Обл.Параметры.ДокументОплаты	= ВыбСтр.ДокументОплаты;
						Обл.Параметры.ДоходБрокера		= Формат(ВыбСтр.ДоходБрокера,ЧФ);
						Обл.Параметры.ПроцентДоходаБрокера	= ?(ВыбСтр.НачисленнаяСуммаВзноса=0,"", Формат(ВыбСтр.ДоходБрокера*100/ВыбСтр.НачисленнаяСуммаВзноса,ЧФ));
					КонецЕсли;
					Если ВыбСтр.КВПодВопросом Тогда
						Обл.Области.КВПроцент.ЦветФона = WebЦвета.Желтый;
						Обл.Области.КВПроцент.Примечание.Текст = "КВ под вопросом";
					КонецЕсли;	
					Если ВыбСтр.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме Тогда
						Обл.Область("СтрокаОтчета").ЦветФона = новый Цвет(245,200,150);
						Обл.Область("СтрокаОтчета").Примечание.Текст = "Расчет по схеме";
					КонецЕсли;
					ДокументРезультат.Вывести(Обл, 4, Строка(ВыборкаВидСП.ВидСП) + ", " + Строка(ВыборкаМенеджер.Агент), Истина);
				КонецЦикла;							
			КонецЦикла;
		КонецЦикла;
		//ИндикаторСкрыть();
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	  = ФиксацияСверху;
	ДокументРезультат.ФиксацияСлева		  = 0;
    ДокументРезультат.АвтоМасштаб 		  = Истина;
	ДокументРезультат.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	


КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры


Процедура ПересчитатьСуммыПоЗП(РезультатЗапроса)
	
	ВыборкаОплат = РезультатЗапроса.Выбрать();
	//ИндикаторИнициализировать(ВыборкаОПлат.Количество());
	Пока ВыборкаОПлат.Следующий() Цикл
		//ОбработкаПрерыванияПользователя();
		ДО = ВыборкаОПлат.Ссылка.ПолучитьОбъект(); 
		Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
		уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ДО,,, Параметры);
		Если ДО.Модифицированность() Тогда
			Попытка
				ДО.Записать();	
			Исключение
				Сообщить("Не удалось записать оплату номер: " + ДО.Номер);	
			КонецПопытки;
		КонецЕсли;
		//ИндикаторСтеп();
	КонецЦикла;							
//	ИндикаторСкрыть();
	
КонецПроцедуры

Функция ПолныеПрава() Экспорт
	
	Возврат уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ВидетьВсеЛички, Ложь) ;
	
КонецФункции // ПолныеПрава()
