//====================== Обновление состояния действия полиса  =====================================
Процедура ОбновитьСостоянияПолисов() Экспорт
	
	ВремяНачала = ТекущаяДата();	
	СостояниеДействиеОкончено = Перечисления.уб_СостоянияПолиса.ДействиеОкончено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СП.Ссылка
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК СП
	|ГДЕ
	|	СП.ДатаОкончания < &НачалоСегодняшнегоДня
	|	И СП.СостояниеПолиса = &Действует
	|
	|УПОРЯДОЧИТЬ ПО
	|	СП.Дата";
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Действует", Перечисления.уб_СостоянияПолиса.Действует);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоОбработанных = 0;
	УспешноОбновлены = 0;
	Ошибки = 0;
	СОО = "";
	СоздатьТекстовыйФайл(КаталогВременныхФайлов()+"1С.log\н-" + Формат(ТекущаяДата(),"ДФ=HH.mm.ss") + " " + ".txt","НАЧАЛО");
	Пока Выборка.Следующий() И КоличествоОбработанных < 1000 Цикл
		Попытка
			оСП = Выборка.Ссылка.ПолучитьОбъект();
			оСП.СостояниеПолиса = СостояниеДействиеОкончено;
			оСП.ОбменДанными.Загрузка = Истина;
			оСП.Записать();
			УспешноОбновлены = УспешноОбновлены + 1;
		Исключение
			СОО = СОО + "
			|" + Строка(оСП) + " -- " + ОписаниеОшибки();
			Ошибки = Ошибки + 1;
		КонецПопытки;
		КоличествоОбработанных = КоличествоОбработанных + 1;
	КонецЦикла;
	//теперь отправляет лог, только если были ошибки
	Если Ошибки > 0 Тогда
		ЗатраченноеВремя = ТекущаяДата() - ВремяНачала;
		Инфо = "Обработано полисов: " + КоличествоОбработанных + "
		|	Обновлено: " + УспешноОбновлены + "
		|	Ошибки: " + Ошибки + "
		|	На выполнение регламентного задания затрачено " + ЗатраченноеВремя + " секунд." + СОО;
		СоздатьТекстовыйФайл(КаталогВременныхФайлов()+"1С.log\о-" + Формат(ТекущаяДата(),"ДФ=HH.mm.ss") + ".txt",Инфо);
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Получатели 	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
		Параметры.Тема			= "1С:РЗ: Обновление состояния полисов " + Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH.mm.ss'");
		Параметры.Сообщение		= Инфо;
		уб_ОбменДанными.SendMail(Параметры);
		#Если Клиент тогда
			Сообщить(Инфо);	
		#КонецЕсли
	КонецЕсли;
	УстановкаФлагаПредоставленРегистраПредоставленныхДокументов();
	
КонецПроцедуры


Процедура СинхронизироватьСБухгалтерией() Экспорт
	
	Обработка = Обработки.Синхронизировать1СБазы.Создать();
	Попытка
		Обработка.ИнициализироватьПараметры();	
		Обработка.ВыполнитьОбмен();
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

Процедура ПолучениеИЗагрузкаДанных() Экспорт
	
	//Обработка = Обработки.ЗагрузкаПолисовСоШлюза.Создать();
	//Попытка
	//	Обработка.ИнициализироватьПараметры();	
	//	Обработка.ВыполнитьОбмен();
	//Исключение
	//	
	//КонецПопытки;
	//
	//Обработка = Обработки.ВыгрузитьИзмененияСКВ.Создать();
	//Попытка
	//	Обработка.ИнициализироватьПараметры();	
	//	Обработка.ВыполнитьОбмен();
	//Исключение
	//	
	//КонецПопытки;
	//
	Попытка
		//7 предыдущих дней
	Обработка = Обработки.ГрафикСотрудников.Создать();;
		Обработка.ВыполнитьОбработкуПериода(ТекущаяДата()-7*24*3600,ТекущаяДата());
	Исключение
	КонецПопытки;	

	
КонецПроцедуры



Процедура уб_ПроверкаРаботоспособностиПодсистемы() Экспорт
	
	Обработка = Обработки.ПроверкаРаботоспособностиСистемы.Создать();
	Попытка
		Обработка.ИнициализироватьПараметры();	
		Обработка.ВыполнитьОбработку();
	Исключение
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры


//Процедура получения курса валют с сайта РБК
Функция ВыполнитьОбновлениеКурсовВалют() Экспорт
	
	
	Обработка = Обработки.ЗагрузкаКурсовВалют.Создать();
	Попытка
		Обработка.ИнициализироватьПараметры();	
		Обработка.ВыполнитьОбмен();
	Исключение
	КонецПопытки;
КонецФункции

Процедура уб_ВыгрузкаЖурналаРегистрации() Экспорт
	
	Если ПравоДоступа("Вывод", Метаданные) Тогда
		Тема = "Журнал регистрации" + Формат(ТекущаяДата(), "ДФ = yyMMdd");
		Начало = ТекущаяДата();
		//не отправляем примечания - там ничего интересного не бывает
		ОтправлятьПримечания = Ложь;
		//!!!Переделать
		// Вставить проверку на ошибки, писать в журнал регистрации, Отправлять одним письмом с двумя вложениями!!!
		МассивСообщений = уб_ОбменДанными.ПолучитьПочту();
		Конец = ТекущаяДата();
		Время = Конец - Начало;
		Сообщить(Время);
		ЕстьСообщение = Ложь;
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если Сообщение.Тема = Тема Тогда
				ЕстьСообщение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЕстьСообщение Тогда
			Каталог = Новый Файл(КаталогВременныхФайлов() + "1С.log\");
			Если Не Каталог.Существует() Тогда
				СоздатьКаталог(Каталог.ПолноеИмя);
			КонецЕсли;
			//Формируем ошибки
			ВыходнойФайл1 = Каталог.ПолноеИмя + "_Error_" + Формат(ТекущаяДата(), "ДФ=""ггММдд""") + ".xml";
			СтруктураФильтра  = Новый Структура; 
			СтруктураФильтра.Вставить("ДатаНачала", 	НачалоДня(ТекущаяДата()-86400));
			СтруктураФильтра.Вставить("ДатаОкончания", 	КонецДня(ТекущаяДата()-86400));
			СтруктураФильтра.Вставить("Уровень", 		УровеньЖурналаРегистрации.Ошибка);
			ВыгрузитьЖурналРегистрации(ВыходнойФайл1, СтруктураФильтра, 	,);
			//формируем список получателей, из константы
			Получатели = Новый Массив;
			ТекСтрока = ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
			Пока Найти(ТекСтрока,";") > 0 Цикл
				Получатели.Добавить(Лев(ТекСтрока, Найти(ТекСтрока,";")-1));
				ТекСтрока = СтрЗаменить(ТекСтрока,Лев(ТекСтрока, Найти(ТекСтрока,";")),"");
			КонецЦикла;	
			Пока Найти(ТекСтрока,",") > 0 Цикл
				Получатели.Добавить(Лев(ТекСтрока, Найти(ТекСтрока,",")-1));
				ТекСтрока = СтрЗаменить(ТекСтрока,Лев(ТекСтрока, Найти(ТекСтрока,",")),"");
			КонецЦикла;	
			Получатели.Добавить(ТекСтрока);
			ТекстПисьма = "";
			Если ЕстьСобытияВФайлеXML(ВыходнойФайл1) Тогда
				Файл = Новый ЧтениеТекста(ВыходнойФайл1, КодировкаТекста.UTF8);
				ТекстФайла = Файл.Прочитать();
				ТекстПисьма = "Ошибки в журнале регистрации:
				|
				|" + ТекстФайла;
			КонецЕсли;
			//Формируем информационное сообщение
			Если ОтправлятьПримечания Тогда
				ВыходнойФайл2 = Каталог.ПолноеИмя + "_Info_"+Формат(ТекущаяДата(), "ДФ=""ггММдд""") +".xml";
				СтруктураФильтра  = Новый Структура; 
				СтруктураФильтра.Вставить("ДатаНачала", 	НачалоДня(ТекущаяДата()-86400));
				СтруктураФильтра.Вставить("ДатаОкончания", 	КонецДня(ТекущаяДата()-86400));
				СтруктураФильтра.Вставить("Уровень", 		УровеньЖурналаРегистрации.Примечание);
				ВыгрузитьЖурналРегистрации(ВыходнойФайл2, СтруктураФильтра, 	,);
				Если ЕстьСобытияВФайлеXML(ВыходнойФайл2) Тогда
					Файл = Новый ЧтениеТекста(ВыходнойФайл2, КодировкаТекста.UTF8); 
					ТекстФайла = Файл.Прочитать();
					ТекстПисьма = ТекстПисьма + "
					|Примечания в журнале регистрации:
					|
					|" + ТекстФайла;
				КонецЕсли;
			КонецЕсли;
			Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			Параметры.Получатели 	= Получатели;
			Параметры.Тема			= Тема;
			Параметры.Сообщение		= ТекстПисьма;
			Если ЗначениеЗаполнено(ТекстПисьма) тогда
				уб_ОбменДанными.SendMail(Параметры);
			КонецЕсли;
		КонецЕсли;
		ПроверитьДоговора();
		ПроверитьАктуальностьПериодаПоСрочнымОшибкам();
	КонецЕсли;

КонецПроцедуры


Процедура уб_ЧисткаСессионныхКлючейПользователиB2B(ПользовательB2B=Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_СессионныеКлючиB2B.СрокЖизни,
	|	уб_СессионныеКлючиB2B.ПользовательB2B
	|ИЗ
	|	РегистрСведений.уб_СессионныеКлючиB2B КАК уб_СессионныеКлючиB2B
	|ГДЕ
	|	уб_СессионныеКлючиB2B.СрокЖизни <= &ТекущаяДата");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Если ПользовательB2B <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И уб_СессионныеКлючиB2B.ПользовательB2B = &ПользовательB2B";
		Запрос.УстановитьПараметр("ПользовательB2B", ПользовательB2B);
	КонецЕсли;
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из Результат Цикл 
		МенеджерЗаписи = РегистрыСведений.уб_СессионныеКлючиB2B.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СрокЖизни = Строка.СрокЖизни;
		МенеджерЗаписи.ПользовательB2B = Строка.ПользовательB2B;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;    
	КонецЦикла;
	
//	Процедура ЧисткаСессионныхКлючейПользователиB2B_Старая() Экспорт
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	|	уб_ПользователиB2B.Ссылка КАК ПользовательB2B
//	|ИЗ
//	|	Справочник.уб_ПользователиB2B КАК уб_ПользователиB2B
//	|ГДЕ
//	|	уб_ПользователиB2B.СессионыеКлючи.СрокЖизни <= &ТекущаяДата");
//	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
//	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПользовательB2B");
//	Для Каждого Строка Из Результат Цикл 
//		ПользовательB2B = Строка.ПолучитьОбъект();
//		Индекс = ПользовательB2B.СессионыеКлючи.Количество() - 1;
//		Пока Индекс >= 0 Цикл
//			Если ПользовательB2B.СессионыеКлючи[Индекс]["СрокЖизни"] < ТекущаяДата() Тогда
//				ПользовательB2B.СессионыеКлючи.Удалить(Индекс);
//			КонецЕсли;
//			Индекс = Индекс - 1;
//		КонецЦикла;
//		ПользовательB2B.Записать();
//	КонецЦикла;
//КонецПроцедуры

КонецПроцедуры


Процедура ПроверитьДоговора() Экспорт
	
	Если ПравоДоступа("Вывод", Метаданные) Тогда
		//TODO: каталог сохранения. Нужна константа.
		Путь = КаталогВременныхФайлов();
		ПериодПроверки = 7;
		ТипПериода = "ДЕНЬ";
		ПериодПроверкиДоговоров = ПараметрыСеанса.уб_Константы.ПериодПроверкиДоговоров;
		ТипЗнчПериодПроверкиДоговоров = ТипЗнч(ПериодПроверкиДоговоров);
		Если ТипЗнчПериодПроверкиДоговоров = Тип("Число") Тогда
			ПериодПроверки  = ПериодПроверкиДоговоров;
		ИначеЕсли ТипЗнчПериодПроверкиДоговоров = Тип("Строка") Тогда
			// возможные форматы 3д , 2 месяца (3 дня, 2 месяца)
			ПериодПроверкиДоговоров = СокрЛП(ПериодПроверкиДоговоров);
			ЧислоСтрока = "";
			Для Индекс = 1 По СтрДлина(ПериодПроверкиДоговоров) Цикл
				Символ = Сред(ПериодПроверкиДоговоров, Индекс, 1);
				КодСимвола = КодСимвола(Символ);
				Если КодСимвола >= 48 И КодСимвола <= 57 Тогда
					ЧислоСтрока = ЧислоСтрока + Символ;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(ЧислоСтрока) Тогда
				Отказ = Ложь;
				Попытка
					ПериодПроверки = Число(ЧислоСтрока);
				Исключение
					Отказ = Истина;
				КонецПопытки;
				Если Не Отказ Тогда
					Строка = СокрЛ(Сред(ПериодПроверкиДоговоров, Индекс));
					Если Строка <> "" Тогда
						Символ = НРег(Лев(Строка, 1));
						Если Символ = "м" Тогда
							ТипПериода = "МЕСЯЦ"
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Владелец КАК СК,
		|	ДоговорыКонтрагентов.Организация КАК ОргАгент,
		|	ДоговорыКонтрагентов.Наименование КАК НомерДоговора,
		|	ДоговорыКонтрагентов.ДатаЗаключенияДоговора КАК ДатаЗаключения,
		|	ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора КАК ДатаОкончания,
		|	ДоговорыКонтрагентов.ДопХарактеристика,
		|	РАЗНОСТЬДАТ(&ДатаТек, ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора, ДЕНЬ) КАК Срок,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&ДатаТек, ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора, ДЕНЬ) >= 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоговорДействует
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Наименование <> ""Основной договор""
		|	И ДоговорыКонтрагентов.РасширениеНазвания <> ""---""
		|	И ДоговорыКонтрагентов.Владелец.Родитель.Наименование <> ""НЕ АКТИВНЫЕ""
		|	И РАЗНОСТЬДАТ(&ДатаТек, ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора, " + ТипПериода + ") <= " + ПериодПроверки + "
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Срок УБЫВ
		|ИТОГИ ПО
		|	ДоговорДействует,
		|	СК,
		|	ОргАгент";
		Запрос.УстановитьПараметр("ДатаТек",	ТекущаяДата());
		ГруппаКонтр = ПараметрыСеанса.уб_Константы.уб_НеактивныеКонтрагенты;
		Если ЗначениеЗаполнено(ГруппаКонтр) Тогда
			СтрЗам = " И (Не ДоговорыКонтрагентов.Ссылка В Иерархии(&НеактивКонтр)) ";
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ЗамУсловие",СтрЗам);
			Запрос.УстановитьПараметр("НеактивКонтр",ГруппаКонтр);
		КонецЕсли;
		//Выборка = Запрос.Выполнить().Выбрать();
		Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Макет = ПолучитьОбщийМакет("АктуальностьДоговоров");
		ТабДок = Новый ТабличныйДокумент;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=дд.ММ.yyyy");
		ТабДок.Вывести(Область);
		
		//ДоговорДействует
		
		Для Каждого Строка Из Результат.Строки Цикл
			Область = Макет.ПолучитьОбласть("ДоговорДействует");
			Если Строка.ДоговорДействует Тогда
				Область.Параметры.ДоговорДействует = "Следующие договора прекратят свое действие в течении 7 дней:";
			Иначе
				Область.Параметры.ДоговорДействует = "Действие следующих договоров прекращено, но они находятся в активных:";
			КонецЕсли;
			ТабДок.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ШапкаТаб");
			ТабДок.Вывести(Область);
			//СК
			Для Каждого Строка2 Из Строка.Строки Цикл
				//Область = Макет.ПолучитьОбласть("СК");
				//Область.Параметры.СК = Строка2.СК;
				//ТабДок.Вывести(Область);
				//ОргАгент
				Для Каждого Строка3 Из Строка2.Строки Цикл
					Область = Макет.ПолучитьОбласть("СК");
					Область.Параметры.СК		= Строка2.СК;
					Область.Параметры.ОргАгент 	= Строка3.ОргАгент;
					ТабДок.Вывести(Область);
					//детальные записи
					Для Каждого Строка4 Из Строка3.Строки Цикл
						Область = Макет.ПолучитьОбласть("Договор");
						Область.Параметры.НомерДоговора	= Строка4.НомерДоговора;
						Область.Параметры.ДатаЗаключения= ?(ЗначениеЗаполнено(Строка4.ДатаЗаключения), 	Формат(Строка4.ДатаЗаключения,"ДФ=дд.ММ.yyyy"), "");
						Область.Параметры.ДатаОкончания	= ?(ЗначениеЗаполнено(Строка4.ДатаОкончания),	Формат(Строка4.ДатаОкончания, "ДФ=дд.ММ.yyyy"), "");
						ТабДок.Вывести(Область);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			//вставляем пустую строку
			Если Строка.ДоговорДействует Тогда
				Область = Макет.ПолучитьОбласть("ПустаяСтрока");
				ТабДок.Вывести(Область);
			КонецЕсли;
		КонецЦикла;
		
		//уб_temp.ДобавитьКолонтитулыВТабличныйДокумент(ТабДок);
		
		//ТабДок.Показать();
		Если Результат.Строки.Количество() > 0 Тогда
			ТабДок.ОтображатьЗаголовки = Истина;
			ТабДок.ОтображатьСетку = Ложь;
			ТабДок.ТолькоПросмотр = Ложь;
			ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ТабДок.АвтоМасштаб = Истина;
			ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Области.ШапкаТаб;
			ИмяФайла = Формат(ТекущаяДата(), "ДФ=yyyy_ММ_дд") + ".html";
			ТабДок.Записать(Путь + ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
			ТекстHTML = "";
			Файл = Новый ЧтениеТекста(Путь + ИмяФайла, КодировкаТекста.UTF8);
			СтрокаФайла = Файл.ПрочитатьСтроку();
			Пока СтрокаФайла <> Неопределено Цикл // строки читаются до символа перевода строки
				Если Найти(СтрокаФайла,"Номер&nbsp;договора") <> 0 Тогда //если строка с колонкой номер договора
					Позиция = Найти(СтрокаФайла, ">");
					СтрокаФайла = Лев(СтрокаФайла, Позиция - 1) + " width=""50%""" + Сред(СтрокаФайла, Позиция);//установка ширины колонки
				КонецЕсли;
				ТекстHTML = ТекстHTML + Символы.ПС + СтрокаФайла;
				СтрокаФайла = Файл.ПрочитатьСтроку();
			КонецЦикла;
			Файл.Закрыть();
			Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			Параметры.Получатели	= ПараметрыСеанса.уб_Константы.АдресДоставкиДоговоров;
			Параметры.Тема			= "Список договоров " + Формат(ТекущаяДата(), "ДФ=""ггММдд""");
			Параметры.Сообщение		= "Список договоров";
			Параметры.ТекстHTML		= ТекстHTML;
			уб_ОбменДанными.SendMail(Параметры);
			УдалитьФайлы(Путь,ИмяФайла);
		КонецЕсли;
	КонецЕсли;
//	Процедура ПроверитьДоговора_удалить() Экспорт 
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
//	|	ДоговорыКонтрагентов.Владелец КАК СК,
//	|	ДоговорыКонтрагентов.Организация КАК ОргАгент,
//	|	ДоговорыКонтрагентов.Наименование КАК НомерДоговора,
//	|	ДоговорыКонтрагентов.ДатаЗаключенияДоговора КАК ДатаЗаключения,
//	|	ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора КАК ДатаОкончания,
//	|	ДоговорыКонтрагентов.ДопХарактеристика,
//	|	РАЗНОСТЬДАТ(&ДатаТек, ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора, ДЕНЬ) КАК Срок
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|ГДЕ
//	|	ДоговорыКонтрагентов.Наименование <> """"""Основной договор""""""
//	|	И ДоговорыКонтрагентов.Наименование <> """"""---""""""
//	|	И ДоговорыКонтрагентов.Владелец.Родитель.Наименование <> """"""НЕ АКТИВНЫЕ""""""
//	|	И РАЗНОСТЬДАТ(&ДатаТек, ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора, ДЕНЬ) <= 7
//	|	И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
//	|   //ЗамУсловие
//	|УПОРЯДОЧИТЬ ПО
//	|	Срок УБЫВ";
//	Запрос.УстановитьПараметр("ДатаТек",ТекущаяДата());
//	ГруппаКонтр = ПараметрыСеанса.уб_Константы.уб_НеактивныеКонтрагенты;
//	Если ЗначениеЗаполнено(ГруппаКонтр) Тогда
//		СтрЗам = " И (Не ДоговорыКонтрагентов.Ссылка В Иерархии(&НеактивКонтр)) ";
//		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ЗамУсловие",СтрЗам);
//		Запрос.УстановитьПараметр("НеактивКонтр",ГруппаКонтр);
//	КонецЕсли;	
//	Выборка = Запрос.Выполнить().Выбрать();
//	//ТабДококумент = Новый ТабличныйДокумент;
//	//Макет = Справочники.КонтактныеЛица.ПолучитьМакет("Макет");
//	//ТабДококумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаб"));
//	//ОбластьСК = Макет.ПолучитьОбласть("СК");
//	//ОбластьДог = Макет.ПолучитьОбласть("СтрокаДоговор");
//	//ТабДококумент.НачатьАвтогруппировкуСтрок();
//	Текст = Новый ТекстовыйДокумент;
//	Вывели = Ложь;
//	ВывелиИст = Ложь;
//	Пока Выборка.Следующий() Цикл 
//		//ОбластьСК.Параметры.СК = Строка(Выборка.СК);
//		//Договора = Выборка.Выбрать();
//		//ТабДококумент.Вывести(ОбластьСК, 1, "СК");
//		////Выводим заголовок Договора
//		//ОбластьДоговор = Макет.ПолучитьОбласть("Договор");
//		//ТабДококумент.Вывести(ОбластьДоговор, 2, "Договор");
//		//Пока Договора.Следующий() Цикл
//		//	ЗаполнитьЗначенияСвойств(ОбластьДог.Параметры,Договора);
//		//	ОбластьДог.Параметры.ДатаЗаключения = Формат(Договора.ДатаЗаключения,"ДФ='dd.MM.yyyy'");
//		//	ОбластьДог.Параметры.ДатаОкончания = ?(ЗначениеНеЗаполнено(Договора.ДатаОкончания), "Бессрочный", Формат(Договора.ДатаОкончания,"ДФ='dd.MM.yyyy'"));
//		//	
//		//	ОбластьДог.ТекущаяОбласть.ЦветФона = Новый Цвет(255, 220, 220);	
//		//	
//		//	ТабДококумент.Вывести(ОбластьДог, 3, "СтрокаДоговор", Истина);
//		//КонецЦикла;
//		Если Выборка.Срок>=0 и Не ВывелиИст Тогда
//			Текст.ДобавитьСтроку("Следующие договора прекратят свое действие в течении 7 дней:");
//			ВывелиИст = Истина;
//		КонецЕсли;
//		
//		Если Выборка.Срок<0 и Не Вывели Тогда
//			Текст.ДобавитьСтроку("Действие следующих договоров прекращено, но они находятся в активных:");
//			Вывели = Истина;
//		КонецЕсли;
//		Текст.ДобавитьСтроку("	----> "+СокрЛП(Выборка.СК) + " - " +СокрЛП(Выборка.ОргАгент)+": Договор № "+СокрЛП(Выборка.НомерДоговора)+" "+СокрЛП(Выборка.ДопХарактеристика)+" Период действия: с "+Формат(Выборка.ДатаЗаключения,"ДФ=dd.MM.yyyy")+" по "+Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy"));
//	КонецЦикла;
//	//ИмяФайла = КаталогВременныхФайлов()+"Список_договоров.xls";
//	//ТабДококумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
//	Если Текст.КоличествоСтрок() > 1 Тогда
//		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
//		Параметры.Получатели	= ПараметрыСеанса.уб_Константы.АдресДоставкиДоговоров;
//		Параметры.Тема			= "Список договоров " + Формат(ТекущаяДата(), "ДФ=""ггММдд""");
//		Параметры.Сообщение		= Текст.ПолучитьТекст();
//		уб_ОбменДанными.SendMail(Параметры);
//		//уб_ОбменДанными.SendMail(ПараметрыСеанса.уб_Константы.АдресДоставкиДоговоров, "Список договоров "+Формат(ТекущаяДата(), "ДФ=""ггММдд"""),Текст.ПолучитьТекст());
//		//УдалитьФайлы(ИмяФайла);
//	КонецЕсли;
//	
//КонецПроцедуры
КонецПроцедуры


Процедура ОбработкаФайловКПолису() Экспорт
	
	Справочники.уб_ФайлыКПолисам.ОбработатьФайлыКПолису(НачалоДня(ТекущаяДата()) - 86400, Истина); 
	
КонецПроцедуры

//ДатаНачалаПроверки - не пишутся ошибки с типом "не найден файл" добавленные до даты проверки


Процедура уб_ЗачисткаСтарыхКонтактов() Экспорт
	
	КоличествоЧасов	= ПараметрыСеанса.уб_Константы.ИнтервалЧасовЗачистки;
	Если ТипЗнч(КоличествоЧасов) = Тип("Число") Тогда
		ДатаСравнения = ТекущаяДата() - 60 * 60 * КоличествоЧасов;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	З.Ссылка
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
		|ГДЕ
		|	З.Дата <= &ДатаСравнения
		|	И (ВЫРАЗИТЬ(З.Контакты КАК СТРОКА(1))) <> """"");		
		Запрос.УстановитьПараметр("ДатаСравнения", ДатаСравнения);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл	
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.ОбменДанными.Загрузка = Истина;
			Если ПустаяСтрока(Объект.ПредставлениеСтроки) Тогда
				Объект.ПредставлениеСтроки = уб_temp.ШифрСтроки(Объект.Контакты);
			Иначе
				ТекСтрока = уб_temp.ШифрСтроки(Объект.ПредставлениеСтроки, Ложь);
				Объект.ПредставлениеСтроки = уб_temp.ШифрСтроки(ТекСтрока + ";" + Объект.Контакты);
			КонецЕсли;
			Объект.Контакты = "";
			Попытка
				Объект.Записать();
			Исключение
			КонецПопытки;		
		КонецЦикла;
	Иначе
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_ЗачисткаСтарыхКонтактов(): Некорректный тип значения константы ИнтервалЧасовЗачистки. Контакты не будут зачищены!", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.РезультатПроверки,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	               |	РАЗНОСТЬДАТ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата, &ТекДата, ЧАС) КАК Просрочка
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.РезультатПроверки = ЗНАЧЕНИЕ(Перечисление.уб_РезультатПроверкиЗаявки.ПринятоСДоработкой)
	               |	И НЕ ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась))
	               |	И РАЗНОСТЬДАТ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата, &ТекДата, ЧАС) > 120";
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			уб_УСЗ.УстановитьСтатусЗаявки(Выборка.Ссылка, Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась, "Истек срок выезда заявки на доработке");
		Исключение
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры

Функция ЕстьСобытияВФайлеXML(ИмяФайлаXML) Экспорт 
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(ИмяФайлаXML);	
	Пока Файл.Прочитать() Цикл		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Файл.Имя = "v8e:Event" Тогда				
				Файл.Закрыть();
				Возврат Истина;
			КонецЕсли;						
		КонецЕсли;		
	КонецЦикла;
	Файл.Закрыть();
	Возврат Ложь;
КонецФункции

Процедура уб_СозданиеДереваЭлементовФормы() Экспорт
	Справочники.уб_Справка.СозданиеДереваЭлементовФормы();
КонецПроцедуры

Процедура уб_ОтправкаСообщенийПоНеоплаченнымОтчетамПоставщикам() Экспорт
	Попытка			
		уб_КоличествоДнейОтсрочкиОплатыПоОплатеПоставщику = ПараметрыСеанса.уб_Константы.уб_КоличествоДнейОтсрочкиОплатыПоОплатеПоставщику;
		уб_КоличествоДнейПередПовторнымОтправлениемСообщения = ПараметрыСеанса.уб_Константы.уб_КоличествоДнейПередПовторнымОтправлениемСообщения;
		Если ТипЗнч(уб_КоличествоДнейОтсрочкиОплатыПоОплатеПоставщику) = Тип("Число") И уб_КоличествоДнейОтсрочкиОплатыПоОплатеПоставщику > 0 Тогда
			ДниВСекундахОтсрочки = 86400 * уб_КоличествоДнейОтсрочкиОплатыПоОплатеПоставщику;
			Если ТипЗнч(уб_КоличествоДнейПередПовторнымОтправлениемСообщения) = Тип("Число") И уб_КоличествоДнейПередПовторнымОтправлениемСообщения > 0 Тогда
				ДниВСекундахДляПовтора = 86400 * уб_КоличествоДнейПередПовторнымОтправлениемСообщения;
			Иначе
				ДниВСекундахДляПовтора = 0;
			КонецЕсли;
			ДопустимаяСуммаЗадолженности = 10;
			Документы.уб_ОтчетПоставщику.ОтправкаСообщенияПоОтчетамПоставщикам(ДниВСекундахОтсрочки, ДниВСекундахДляПовтора, ДопустимаяСуммаЗадолженности);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при выполнении процедуры уб_ОтправкаСообщенийПоНеоплаченнымОтчетамПоставщикам",
		УровеньЖурналаРегистрации.Ошибка, , ,
		ОписаниеОшибки());
	КонецПопытки;// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СинхронизироватьОстатки() Экспорт
	РегистрыСведений.уб_УпрОстаткиБСО.СинхронизироватьОстатки();	
КонецПроцедуры	

Процедура уб_ПроверкаРегистраПредоставленныхДокументов() Экспорт
	
	уб_temp.ПроверкаПустыхСсылокВПредоставленныхДокументах();
	
КонецПроцедуры

////////////////////////////////////////
////////////////// ВЗР//////////////////
////////////////////////////////////////
//Процедура ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, Текст, Ошибка = Ложь, ТекстИсточника = "")

//	СтрокаТЗ = ТЗЛог.Добавить();
//	СтрокаТЗ.Текст 			= Текст;
//	СтрокаТЗ.Ошибка			= Ошибка;
//	СтрокаТЗ.ТекстИсточника = ТекстИсточника;

//КонецПроцедуры


//Процедура ПолучениеИЗагрузкаВЗР() Экспорт
//	
//	ЕстьОшибка = Ложь;
//	Попытка
//		ТЗЛог = ТЗЛогВЗР();
//		Макет = ПолучитьОбщийМакет("vzr");
//		ПутьСхемы2 = КаталогВременныхФайлов() + "vzr2.xsd";
//		Макет.Записать(ПутьСхемы2);
//		//
//		Макет = ПолучитьОбщийМакет("site_report");
//		ПутьСхемы = КаталогВременныхФайлов() + "vzr.xsd";
//		Макет.Записать(ПутьСхемы);		
//		//
//		АдресСервераPOP3 	= "pop.mail.ru";
//		Пользователь 		= "itclabs.1c@mail.ru";
//		Пароль 				= "Kf,elfKf,elf";
//		КаталогВыгрузки = "";
//		Если ПустаяСтрока(КаталогВыгрузки) Тогда
//			КаталогВыгрузки = КаталогВременныхФайлов();
//		КонецЕсли;
//		// Подключение к почте
//		Почта = Новый ИнтернетПочта;
//		Профиль = Новый ИнтернетПочтовыйПрофиль;
//		Профиль.АдресСервераPOP3 = АдресСервераPOP3;
//		Профиль.ИспользоватьSSLIMAP = Истина;
//		Профиль.АдресСервераIMAP 	= "imap.mail.ru";
//		Профиль.ПарольIMAP			= Пароль;//Выборка.ПарольIMAP;
//		Профиль.ПортIMAP			= 993;
//		Профиль.ПользовательIMAP	= Пользователь;//Выборка.ПользовательIMAP;
//		Профиль.Пользователь = Пользователь;
//		Профиль.Пароль = Пароль; 
//		#Если Клиент Тогда
//			Состояние("Подключение");
//		#КонецЕсли
//		Попытка
//			Почта.Подключиться(Профиль,?(Профиль.ИспользоватьSSLIMAP=Истина,ПротоколИнтернетПочты.IMAP,ПротоколИнтернетПочты.POP3));
//		Исключение
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = ОписаниеОшибки();
//			Сообщение.Сообщить();
//			ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, Сообщение.Текст, Истина);
//			Перейти ~НаВыход;
//		КонецПопытки;
//		
//		Заголовки = Почта.ПолучитьЗаголовки();//Почта.ПолучитьЗаголовки(Новый Структура("From",	"admin@kupipolis.ru"));	
//		
//		ВсегоЗаголовков = Заголовки.Количество();
//		Для Счетчик = 1 По ВсегоЗаголовков Цикл
//			ТекЗаголовок = Заголовки[ВсегоЗаголовков - Счетчик];
//			Если Найти(ТекЗаголовок.Тема, "[XML]Новые купленные полисы за") = 0  
//				и Найти(ТекЗаголовок.Заголовок, "[XML]Новые купленные полисы за") = 0 //При IMAP  в другом поле тема
//				Тогда
//				Заголовки.Удалить(ВсегоЗаголовков - Счетчик);
//				//ТекЗаголовок.Отправитель.Адрес = "admin@kupipolis.ru")
//			КонецЕсли;	
//		КонецЦикла;	
//		ВсегоЗаголовков = Заголовки.Количество();
//		//МассивФайлов = Новый Массив;
//		ТЗФайлов = Новый ТаблицаЗначений;
//		ТЗФайлов.Колонки.Добавить("ИмяФайла");
//		ТЗФайлов.Колонки.Добавить("ДатаФайла", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
//		//  Загрузка сообщений в массив
//		Если ВсегоЗаголовков > 0 Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "В почтовом ящике " + ВсегоЗаголовков + " сообщений с сайта";
//			ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, Сообщение.Текст);
//			Сообщение.Сообщить();		
//			#Если Клиент Тогда
//				Состояние("Получение Сообщений");	
//			#КонецЕсли	
//			МассивСообщений = Почта.Выбрать(Ложь, Заголовки);
//		 	Для Индекс = 0 По МассивСообщений.Количество()-1 Цикл 				
//				Для Каждого Вложение Из МассивСообщений[Индекс].Вложения Цикл
//					ИмяВложения = ВРег(Вложение.Имя);
//					Если Найти(ИмяВложения, ".XML") > 0 тогда
//						СтрокаТЗ = ТЗФайлов.Добавить();
//						СтрокаТЗ.ИмяФайла 	= КаталогВыгрузки + Вложение.Имя + Индекс; 
//						СтрокаТЗ.ДатаФайла 	= СтрЗаменить(МассивСообщений[Индекс].Тема, "[XML]Новые купленные полисы за ", "");
//						ТекстИсточника 	= "Имя источника: " + СтрокаТЗ.ИмяФайла + ", дата источника: " + СтрокаТЗ.ДатаФайла;
//						Попытка
//							Вложение.Данные.Записать(СтрокаТЗ.ИмяФайла);
//						Исключение
//							ТекстОшибки = "Не удалось записать файл " + СтрокаТЗ.ИмяФайла + " из-за " + ОписаниеОшибки();
//							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки);
//							ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//							ТЗФайлов.Удалить(СтрокаТЗ);
//						КонецПопытки;
//					КонецЕсли;
//				КонецЦикла;
//			КонецЦикла;
//			
//			Для Каждого СтрокаТЗ Из ТЗФайлов Цикл
//				Если ЗагрузитьФайлVZR2(СтрокаТЗ, ПутьСхемы,, ТЗЛог) = Истина 
//					ИЛИ ЗагрузитьФайлVZR(СтрокаТЗ, ПутьСхемы2,, ТЗЛог) = Истина
//					Тогда
//					Попытка
//						УдалитьФайлы(СтрокаТЗ.ИмяФайла);
//					Исключение
//						Сообщить("Ошибка при удалении "+ОписаниеОшибки()+ " "+СтрокаТЗ.ИмяФайла);
//					КонецПопытки;	
//				Иначе
//					ЕстьОшибка = Истина;
//				КонецЕсли;	
//			КонецЦикла;
//		
//		КонецЕсли;
//		// отключение
//		Почта.Отключиться();
//		
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "Непредусмотренная ошибка: " + ОписаниеОшибки(), Истина);
//		ЕстьОшибка = Истина;
//	КонецПопытки;
//	
//	~НаВыход:
//	
//	// обработка ошибок
//	Если ЕстьОшибка Тогда
//		ПараметрыОтбора = Новый Структура("Ошибка", Истина);
//		МассивСтрокТЗ = ТЗЛог.НайтиСтроки(ПараметрыОтбора);
//		Если МассивСтрокТЗ.Количество() > 0 Тогда
//			Индекс = 0;
//			ИмяПапки = "vzrlog";
//			СоздатьКаталог(КаталогВыгрузки + ИмяПапки);
//			ИмяФайлаБезИндекса = КаталогВыгрузки + ИмяПапки + "\vzrlog";
//			Пока Истина Цикл
//				Индекс = Индекс + 1;
//				Файл = Новый Файл(ИмяФайлаБезИндекса + Индекс + ".txt");
//				Если Не Файл.Существует() Тогда
//					ИмяФайла = Файл.ПолноеИмя;
//					Прервать;
//				КонецЕсли;
//				Файл = Неопределено;
//			КонецЦикла;
//			Попытка
//				ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
//			Исключение
//				Сообщить(ОписаниеОшибки());
//			КонецПопытки;
//			Для Каждого СтрокаТЗ Из ТЗЛог Цикл
//				ЗаписьТекста.ЗаписатьСтроку(?(СтрокаТЗ.Ошибка, "! ", "") + СтрокаТЗ.Текст);
//			КонецЦикла;
//			ЗаписьТекста.Закрыть();
//		КонецЕсли;
//	КонецЕсли;
//	
//	//Выгружаем данные по СКВ в базу анкетколлектора
//	ВыгрузитьИзмененияСКВ();
//КонецПроцедуры

//Функция ТЗЛогВЗР()

//	// главное, чтобы создалась приемка. Ошибка создания приемки (кроме уже наличия ее) будет считаться ошибкой
//	ТЗЛог = Новый ТаблицаЗначений();
//	ТЗЛог.Колонки.Добавить("Текст", 			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1024)));
//	ТЗЛог.Колонки.Добавить("Ошибка",    		Новый ОписаниеТипов("Булево"));
//	ТЗЛог.Колонки.Добавить("ТекстИсточника",	Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1024)));
//	Возврат ТЗЛог;

//КонецФункции // СозданиеТЗЛогВЗР()

////Новый формат
//Функция ЗагрузитьФайлVZR2(СтрокаТЗФайлов, ПутьСхемы, Процент = 2.5, ТЗЛог = Неопределено) Экспорт
//	
//	Если ТипЗнч(СтрокаТЗФайлов) = Тип("СтрокаТаблицыЗначений") Тогда
//		ИмяИсточника 	= СтрокаТЗФайлов.ИмяФайла;
//		ТекстИсточника 	= "Имя источника: " + ИмяИсточника + ", дата источника: " + СтрокаТЗФайлов.ДатаФайла;
//	Иначе
//		// строка имени файла
//		ИмяИсточника	= СтрокаТЗФайлов;
//		ТекстИсточника	= "Имя источника: " + ИмяИсточника;
//	КонецЕсли;
//	Если ТЗЛог = Неопределено Тогда
//		ТЗЛог = ТЗЛогВЗР();
//	КонецЕсли;
//	//Схема в макете site_report
//	СхемаXML = Новый СхемаXML;
//	СхемаXML.РасположениеСхемы = ПутьСхемы;	
//	СхемыXML = Новый НаборСхемXML;
//	СхемыXML.Добавить(СхемаXML);
//	Текст = Новый ТекстовыйДокумент;
//	Текст.Прочитать(ИмяИсточника, "UTF-8");
//	Для Счетчик = 1 по Текст.КоличествоСтрок() Цикл
//		Текст.ЗаменитьСтроку(Счетчик,УбратьОписания(Текст.ПолучитьСтроку(Счетчик)));
//	КонецЦикла;	
//	//ИмяИсточника = ИмяИсточника+"1";
//	//Текст.Записать(ИмяИсточника);
//	ЧтениеXML = Новый ЧтениеXML();
//	ЧтениеXML.УстановитьСтроку(Текст.ПолучитьТекст());
//	//ЧтениеXML.ОткрытьФайл(ИмяИсточника);
//	//Пока ЧтениеXML.Прочитать() Цикл		
//	//	Сообщить(ЧтениеXML.Имя);
//	//	Сообщить(ЧтениеXML.Значение);
//	//КонецЦикла;	
//	Фабрика = Новый ФабрикаXDTO(СхемыXML);
//	Данные = Фабрика.ПрочитатьXML(ЧтениеXML);
//	ДатаФайла = Дата(СтрЗаменить(Данные.date,"-",""));	
//	Попытка
//		Если ТипЗнч(Данные.anketa) = Тип("СписокXDTO") Тогда
//			ВсегоОпераций  = Число(Данные.anketa.Количество());
//		Иначе	
//			ВсегоОпераций = 1;
//		КонецЕсли;			
//		Если ВсегоОпераций = 1 Тогда
//			СуммаПоСтрокам 		= Окр(Число(Данные.anketa.InsPrem), 2);
//			//СуммаПоСтрокамНовая = СуммаПоСтрокам - Окр(СуммаПоСтрокам * Процент / 100, 2);
//			СуммаПоСтрокамНовая	= Окр(СуммаПоСтрокам * 0.975, 2);
//		Иначе
//			СуммаПоСтрокам 		= 0;
//			СуммаПоСтрокамНовая	= 0;
//			Для каждого _Операция из Данные.anketa Цикл
//				СуммаСтроки 		= Окр(Число(_Операция.InsPrem), 2);
//				// некорректный расчет, нужно использовать 0.975
//				//СуммаСтрокиНовая	= СуммаСтроки - Окр(СуммаСтроки * Процент / 100, 2);
//				СуммаСтрокиНовая	= Окр(СуммаСтроки * 0.975, 2);
//				СуммаПоСтрокам 		= СуммаПоСтрокам + СуммаСтроки;
//				СуммаПоСтрокамНовая = СуммаПоСтрокамНовая + СуммаСтрокиНовая
//			КонецЦикла;	
//		КонецЕсли;
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR2: Ошибка расчета итоговых сумм. " + ТекстИсточника + ", " + ОписаниеОшибки(), Истина, ТекстИсточника);
//		Возврат Ложь;		
//	КонецПопытки;
//	//не находит приемку из-за несовпадения суммы по строкам (в costRub значение 532.42999(9), в приемке 532.43)
//	СуммаПоСтрокам = Окр(СуммаПоСтрокам, 2);
//	_Приемка = ПолучитьПриемку(ДатаФайла, СуммаПоСтрокамНовая, Ложь);
//	Если _Приемка = Неопределено Тогда
//		_Приемка = ПолучитьПриемку(ДатаФайла, СуммаПоСтрокам);
//	КонецЕсли;	
//	Если ТипЗнч(_Приемка) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR2: " + _Приемка.СсылкаСтрока + " уже существует. " + ТекстИсточника, ТекстИсточника);
//		// убираем флаг ошибки по этому файлу
//		ПараметрыОтбора = Новый Структура("ТекстИсточника, Ошибка", ТекстИсточника, Истина);
//		МассивСтрокТЗ = ТЗЛог.НайтиСтроки(ПараметрыОтбора);
//		Для Каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
//			СтрокаТЗ.Ошибка = Ложь;
//		КонецЦикла;
//		Возврат Ложь; //Уже есть
//	КонецЕсли;		
//	НачатьТранзакцию();	
//	_Полисы = _Приемка.Полисы;	
//	СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
//	Если СистемаТЧПлатежи И _Приемка.Платежи.Количество() = 0 Тогда
//		СтрокаТЧ = _Приемка.Платежи.Добавить();
//		СтрокаТЧ.УИДСтроки		= Новый УникальныйИдентификатор();
//		СтрокаТЧ.ФормаОплаты	= Перечисления.уб_ФормыОплаты.Безнал;
//		СтрокаТЧ.Валюта			= ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//		СтрокаТЧ.Курс			= 1;
//		СтрокаТЧ.ДатаКурса		= _Приемка.Дата;
//		СтрокаТЧ.Кратность		= 1;
//	КонецЕсли;
//	_Приемка.Валюта             = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//	_Приемка.Курс               = 1;
//	_Приемка.ФормаОплаты        = Перечисления.уб_ФормыОплаты.Безнал;
//	_Приемка.ДатаКурса          = _Приемка.Дата;
//	
//	ПараметрыОППересчетСумм = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
//	ПараметрыОППересчетСумм.УстанавливатьКВиАВ 			= Истина;
//	ПараметрыОППересчетСумм.УстанавливатьКВДляАгента 	= Ложь;
//	ОперацияЗагружена = Истина;
//	ПараметрыЗагрузитьОперацию = Новый Структура;
//	ПараметрыЗагрузитьОперацию.Вставить("Сумма",			0);
//	ПараметрыЗагрузитьОперацию.Вставить("Комиссия",			0);
//	ПараметрыЗагрузитьОперацию.Вставить("СуммаСВычетом",    0);
//	ПараметрыЗагрузитьОперацию.Вставить("Процент",			Процент);
//	ТекстОшибки = "";
//	Попытка
//		Если ВсегоОпераций = 1 Тогда
//			ОперацияЗагружена = ЗагрузитьОперацию2(
//				Данные.anketa, 
//				_Приемка, 
//				ПараметрыОППересчетСумм, 
//				ПараметрыЗагрузитьОперацию,
//				ТЗЛог,
//				ТекстИсточника
//			);
//		Иначе
//			Для каждого _Операция из Данные.anketa Цикл
//				ОперацияЗагружена = ЗагрузитьОперацию2(
//					_Операция, 
//					_Приемка, 
//					ПараметрыОППересчетСумм, 
//					ПараметрыЗагрузитьОперацию,
//					ТЗЛог,
//					ТекстИсточника
//				);
//				Если ОперацияЗагружена = Ложь Тогда
//					Прервать;
//				КонецЕсли;	
//			КонецЦикла;	
//		КонецЕсли;
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "Непредвиденная ошибка ЗагрузитьОперацию2. " + ТекстИсточника + ", " + ОписаниеОшибки(), Истина, ТекстИсточника);
//		ОперацияЗагружена  = Ложь;
//	КонецПопытки;
//	Если ОперацияЗагружена  = Ложь Тогда
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Ошибка  при загрузке операции";
//		Сообщение.Сообщить();
//		ОтменитьТранзакцию();
//		Возврат Ложь;
//	КонецЕсли;	
//	_Приемка.СуммаПоСтрокам = _Полисы.Итог("Сумма");
//	_СуммаВВалюте = 0;
//	Для каждого _Строка из _Приемка.Полисы Цикл
//		_СуммаВВалюте =_СуммаВВалюте + Окр(_Строка.Сумма * (100 - Процент) / 100, 2);
//	КонецЦикла;	
//	Если СистемаТЧПлатежи И _Приемка.Платежи.Количество() = 1 Тогда
//		СтрокаТЧ.СуммаВВалюте 	= ПараметрыЗагрузитьОперацию.Сумма;
//		СтрокаТЧ.Сумма			= ПараметрыЗагрузитьОперацию.Сумма;
//		СтрокаТЧКомиссия = _Приемка.Платежи.Добавить();
//		СтрокаТЧКомиссия.УИДСтроки 				= Новый УникальныйИдентификатор();
//		СтрокаТЧКомиссия.ФормаОплаты    		= Перечисления.уб_ФормыОплаты.Безнал;
//		СтрокаТЧКомиссия.Сумма					= - ПараметрыЗагрузитьОперацию.Комиссия;
//		СтрокаТЧКомиссия.СуммаВВалюте			= СтрокаТЧКомиссия.Сумма;
//		СтрокаТЧКомиссия.Валюта         		= ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//		СтрокаТЧКомиссия.Курс					= 1;
//		СтрокаТЧКомиссия.Кратность				= 1;
//		СтрокаТЧКомиссия.ОбоснованиеРазницы 	= "Комиссия за эквайринг";
//		//СтрокаТЧКомиссия.ОтсутствуетВОплатах    = Истина;
//		СтрокаТЧКомиссия.Комментарий			= "2.5%";
//	КонецЕсли;
//	_Приемка.СуммаВВалюте       = _СуммаВВалюте; //Процент удерживается по каждой операции, а не от итоговой суммы
//	_Приемка.Сумма              = _Приемка.СуммаВВалюте;
//	_Приемка.Разница            = _Приемка.Сумма - _Приемка.СуммаПоСтрокам ;
//	_Приемка.СуммыНеРавны       = _Приемка.Сумма <> (_Приемка.СуммаПоСтрокам + _Приемка.Разница);
//	
//	_Приемка.ОбоснованиеРазницы = "Комиссия за эквайринг";
//	_Приемка.Комментарий        = "Создано автоматически по данным сайта/ВЗР";
//	// пока будет считаться ошибкой для отладки, но на самом деле наличие измененной суммы существующей приемки не должно считаться ошибкой
//	// TODO если существующая приемка не делала записей в регистр движений БСО, и в ней была изменена сумма, будет создана приемка дубль.
//	Попытка
//		_Приемка.Записать(РежимЗаписиДокумента.Проведение);
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR2 Ошибка проведения приемки. " + ТекстИсточника + ", " + ОписаниеОшибки(), Истина, ТекстИсточника);
//		ОтменитьТранзакцию();
//		Возврат Ложь;
//	КонецПопытки;
//	_ОК = Документы.уб_ОтчетКассира.СоздатьДокумент();
//	_ОК.Дата = _Приемка.Дата;
//	_ОК.НачОтчетПериод  = _ОК.Дата;
//	_ОК.КонОтчетПериод = КонецДня(_ОК.НачОтчетПериод);
//	_ОК.УстановитьНовыйНомер();
//	_ОК.Ответственный  = ПараметрыСеанса.уб_ТекущееФизЛицо;
//	_ОК.ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
//	
//	_ОК.Подтверждено = Истина;//Безнал не влияет на 1С:Деньги
//	_ОК.ОбменДанными.Загрузка = Истина;
//	_ОК.Записать(РежимЗаписиДокумента.Запись);
//	
//	_Приемка.ОтчетКассира = _ОК.Ссылка;
//	_Приемка.ОбменДанными.Загрузка = Истина;
//	_Приемка.Записать();
//	_ОК.Сумма = _Приемка.ИтогСуммаПлатежи;
//	
//	_ОК.Проведен = Истина;
//	_ОК.Записать(РежимЗаписиДокумента.Запись);
//	
//	//ОтменитьТранзакцию();
//	ЗафиксироватьТранзакцию();
//	ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, Строка(_Приемка) + " успешно записана. " + ТекстИсточника, Ложь, ТекстИсточника);
//	Возврат Истина;

//КонецФункции	
////Старый формат
//Функция ЗагрузитьФайлVZR(СтрокаТЗФайлов, ПутьСхемы, Процент = 2.5, ТЗЛог = Неопределено) Экспорт
//	
//	Если ТипЗнч(СтрокаТЗФайлов) = Тип("СтрокаТаблицыЗначений") Тогда
//		ИмяИсточника 	= СтрокаТЗФайлов.ИмяФайла;
//		ТекстИсточника 	= "Имя источника: " + ИмяИсточника + ", дата источника: " + СтрокаТЗФайлов.ДатаФайла;
//	Иначе
//		// строка имени файла
//		ИмяИсточника	= СтрокаТЗФайлов;
//		ТекстИсточника	= "Имя источника: " + ИмяИсточника;
//	КонецЕсли;
//	Если ТЗЛог = Неопределено Тогда
//		ТЗЛог = ТЗЛогВЗР()
//	КонецЕсли;
//	СхемаXML = Новый СхемаXML;
//	СхемаXML.РасположениеСхемы = ПутьСхемы;	
//	СхемыXML = Новый НаборСхемXML;
//	СхемыXML.Добавить(СхемаXML);
//	Текст = Новый ТекстовыйДокумент;
//	Текст.Прочитать(ИмяИсточника, "UTF-8");
//	Для Счетчик = 1 по Текст.КоличествоСтрок() Цикл
//		Текст.ЗаменитьСтроку(Счетчик,УбратьОписания(Текст.ПолучитьСтроку(Счетчик)));
//	КонецЦикла;	
//	ИмяИсточника = ИмяИсточника+"1";
//	Текст.Записать(ИмяИсточника);
//	ЧтениеXML = Новый ЧтениеXML();
//	ЧтениеXML.ОткрытьФайл(ИмяИсточника);
//	//Пока ЧтениеXML.Прочитать() Цикл		
//	//	Сообщить(ЧтениеXML.Имя);
//	//	Сообщить(ЧтениеXML.Значение);
//	//КонецЦикла;	
//	Фабрика = Новый ФабрикаXDTO(СхемыXML);
//	Данные = Фабрика.ПрочитатьXML(ЧтениеXML);
//	ДатаФайла = Дата(СтрЗаменить(Данные.date, "-", ""));
//	Попытка
//		Если ТипЗнч(Данные.anketa) = Тип("СписокXDTO") Тогда
//			ВсегоОпераций  = Число(Данные.anketa.Количество());
//		Иначе	
//			ВсегоОпераций = 1;
//		КонецЕсли;	
//		Если ВсегоОпераций = 1 Тогда
//			СуммаПоСтрокам 		= Окр(Число(Данные.anketa.costRub), 2);
//			//СуммаПоСтрокамНовая = СуммаПоСтрокам - Окр(СуммаПоСтрокам * Процент / 100, 2);
//			СуммаПоСтрокамНовая	= Окр(СуммаПоСтрокам * 0.975, 2);
//		Иначе
//			СуммаПоСтрокам 		= 0;
//			СуммаПоСтрокамНовая	= 0;
//			Для каждого _Операция из Данные.anketa Цикл
//				СуммаСтроки 		= Окр(Число(_Операция.costRub), 2);
//				//СуммаСтрокиНовая	= СуммаСтроки - Окр(СуммаСтроки * Процент / 100, 2);
//				СуммаСтрокиНовая	= Окр(СуммаСтроки * 0.975, 2);
//				СуммаПоСтрокам 		= СуммаПоСтрокам + СуммаСтроки;
//				СуммаПоСтрокамНовая = СуммаПоСтрокамНовая + СуммаСтрокиНовая;
//			КонецЦикла;	
//		КонецЕсли;
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR: Ошибка расчета итоговых сумм. " + ТекстИсточника + ", " + ОписаниеОшибки(), Истина, ТекстИсточника);
//		Возврат Ложь;
//	КонецПопытки;
//	_Приемка = ПолучитьПриемку(ДатаФайла, СуммаПоСтрокамНовая, Ложь);
//	Если _Приемка = Неопределено Тогда
//		_Приемка = ПолучитьПриемку(ДатаФайла, СуммаПоСтрокам);
//	КонецЕсли;
//	//_Приемка = Документы.уб_ПриемкаОплат.СоздатьДокумент();
//	_СК 		= уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты", "Русский Стандарт");
//	_Поставщик 	= уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты", "Компания Банковского Страхования");
//	Если ТипЗнч(_Приемка) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR2: " + _Приемка.СсылкаСтрока + " уже существует. " + ТекстИсточника, ТекстИсточника);
//		ПараметрыОтбора = Новый Структура("ТекстИсточника, Ошибка", ТекстИсточника, Истина);
//		МассивСтрокТЗ = ТЗЛог.НайтиСтроки(ПараметрыОтбора);
//		Для Каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
//			СтрокаТЗ.Ошибка = Ложь;
//		КонецЦикла;
//		Возврат Ложь; //Уже есть
//	КонецЕсли;	
//	НачатьТранзакцию();
//	_Полисы = _Приемка.Полисы;
//	СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
//	Если СистемаТЧПлатежи И _Приемка.Платежи.Количество() = 0 Тогда
//		СтрокаТЧ = _Приемка.Платежи.Добавить();
//		СтрокаТЧ.УИДСтроки		= Новый УникальныйИдентификатор();
//		СтрокаТЧ.ФормаОплаты	= Перечисления.уб_ФормыОплаты.Безнал;
//		СтрокаТЧ.Валюта			= ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//		СтрокаТЧ.Курс			= 1;
//		СтрокаТЧ.ДатаКурса		= _Приемка.Дата;
//		СтрокаТЧ.Кратность		= 1;
//	КонецЕсли;
//	_Приемка.Валюта             = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//	_Приемка.Курс               = 1;
//	_Приемка.ФормаОплаты        = Перечисления.уб_ФормыОплаты.Безнал;
//	_Приемка.ДатаКурса          = _Приемка.Дата;	
//	ПараметрыОППересчетСумм = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
//	ПараметрыОППересчетСумм.УстанавливатьКВиАВ 			= Истина;
//	ПараметрыОППересчетСумм.УстанавливатьКВДляАгента 	= Ложь;
//	ОперацияЗагружена = Истина;
//	ПараметрыЗагрузитьОперацию = Новый Структура;
//	ПараметрыЗагрузитьОперацию.Вставить("Сумма",			0);
//	ПараметрыЗагрузитьОперацию.Вставить("Комиссия",			0);
//	ПараметрыЗагрузитьОперацию.Вставить("СуммаСВычетом",    0);
//	ПараметрыЗагрузитьОперацию.Вставить("Процент",			Процент);
//	Если ВсегоОпераций = 1 Тогда
//		ОперацияЗагружена = ЗагрузитьОперацию(
//			Данные.anketa, 
//			_Приемка, 
//			_СК, 
//			_Поставщик, 
//			ПараметрыОППересчетСумм, 
//			ПараметрыЗагрузитьОперацию,
//			ТЗЛог,
//			ТекстИсточника
//		);
//	Иначе
//		Для каждого _Операция из Данные.anketa Цикл
//			ОперацияЗагружена = ЗагрузитьОперацию(
//				_Операция, 
//				_Приемка, 
//				_СК, 
//				_Поставщик, 
//				ПараметрыОППересчетСумм, 
//				ПараметрыЗагрузитьОперацию,
//				ТЗЛог,
//				ТекстИсточника
//			);
//			Если ОперацияЗагружена = Ложь Тогда
//				Прервать;
//			КонецЕсли;	
//		КонецЦикла;	
//	КонецЕсли;
//	Если ОперацияЗагружена = Ложь Тогда
//		ОтменитьТранзакцию();		
//		Возврат Ложь;
//	КонецЕсли;	
//	_Приемка.СуммаПоСтрокам = _Полисы.Итог("Сумма");
//	//_Приемка.СуммаВВалюте       = Окр(_Приемка.СуммаПоСтрокам*(100-Процент)/100 ,2); //От итоговой суммы TODO нужен ли функциональность
//	_СуммаВВалюте=0;
//	Для каждого _Строка из _Приемка.Полисы Цикл
//		_СуммаВВалюте =_СуммаВВалюте + Окр(_Строка.Сумма * (100 - Процент) / 100, 2);
//	КонецЦикла;	
//	Если СистемаТЧПлатежи И _Приемка.Платежи.Количество() = 1 Тогда
//		СтрокаТЧ.СуммаВВалюте 	= ПараметрыЗагрузитьОперацию.Сумма;
//		СтрокаТЧ.Сумма			= ПараметрыЗагрузитьОперацию.Сумма;
//		СтрокаТЧКомиссия = _Приемка.Платежи.Добавить();
//		СтрокаТЧКомиссия.УИДСтроки 				= Новый УникальныйИдентификатор();
//		СтрокаТЧКомиссия.ФормаОплаты    		= Перечисления.уб_ФормыОплаты.Безнал;
//		СтрокаТЧКомиссия.Сумма					= - ПараметрыЗагрузитьОперацию.Комиссия;
//		СтрокаТЧКомиссия.СуммаВВалюте			= СтрокаТЧКомиссия.Сумма;
//		СтрокаТЧКомиссия.Валюта         		= ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//		СтрокаТЧКомиссия.Курс					= 1;
//		СтрокаТЧКомиссия.Кратность				= 1;
//		СтрокаТЧКомиссия.ОбоснованиеРазницы 	= "Комиссия за эквайринг";
//		//СтрокаТЧКомиссия.ОтсутствуетВОплатах    = Истина;
//		СтрокаТЧКомиссия.Комментарий			= "2.5%";
//	КонецЕсли;
//	_Приемка.СуммаВВалюте       = _СуммаВВалюте; //Процент удерживается по каждой операции, а не от итоговой суммы
//	_Приемка.Сумма              = _Приемка.СуммаВВалюте;
//	_Приемка.Разница            = _Приемка.Сумма -_Приемка.СуммаПоСтрокам ;
//	_Приемка.СуммыНеРавны       = _Приемка.Сумма <> (_Приемка.СуммаПоСтрокам + _Приемка.Разница);
//	
//	_Приемка.ОбоснованиеРазницы = "Комиссия за эквайринг";
//	_Приемка.Комментарий        = "Создано автоматически по данным сайта/ВЗР";
//	// пока будет считаться ошибкой для отладки, но на самом деле наличие измененной суммы существующей приемки не должно считаться ошибкой
//	// TODO если существующая приемка не делала записей в регистр движений БСО, и в ней была изменена сумма, будет создана приемка дубль.
//	Попытка
//		_Приемка.Записать(РежимЗаписиДокумента.Проведение);
//	Исключение
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, "VZR Ошибка проведения приемки. " + ТекстИсточника + ", " + ОписаниеОшибки(), Истина, ТекстИсточника);
//		ОтменитьТранзакцию();
//		Возврат Ложь;
//	КонецПопытки;
//	
//	_ОК = Документы.уб_ОтчетКассира.СоздатьДокумент();
//	_ОК.Дата = _Приемка.Дата;
//	_ОК.НачОтчетПериод  = _ОК.Дата;
//	_ОК.КонОтчетПериод = КонецДня(_ОК.НачОтчетПериод);
//	_ОК.УстановитьНовыйНомер();
//	_ОК.Ответственный  = ПараметрыСеанса.уб_ТекущееФизЛицо;
//	_ОК.ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
//	
//	_ОК.Подтверждено = Истина;//Безнал не влияет на 1С:Деньги
//	_ОК.ОбменДанными.Загрузка = Истина;
//	_ОК.Записать(РежимЗаписиДокумента.Запись);
//	
//	_Приемка.ОтчетКассира = _ОК.Ссылка;
//	_Приемка.ОбменДанными.Загрузка = Истина;
//	_Приемка.Записать();
//	_ОК.Сумма = _Приемка.ИтогСуммаПлатежи;
//	
//	_ОК.Проведен = Истина;
//	_ОК.Записать(РежимЗаписиДокумента.Запись);
//	
//	ЗафиксироватьТранзакцию();
//	Возврат Истина;

//КонецФункции	

////Находит последнее поступление по заданному номеру и СК выдает данные этой записи
//Функция ПолучитьДанныеБСОПоНомеруИСК (НомерБСО,СК,ГодПолиса = Неопределено) экспорт
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ДБ.Период КАК Период,
//	|	ДБ.Регистратор,
//	|	ДБ.НомерСтроки,
//	|	ДБ.Активность,
//	|	ДБ.ВидБСО,
//	|	ДБ.НомерБСО,
//	|	ДБ.Подтверждено,
//	|	ДБ.Активность КАК Активность,
//	|	ДБ.СК,
//	|	ДБ.Поставщик,
//	|	ДБ.ОрганизацияАгент,
//	|	ДБ.АгентОтправитель,
//	|	ДБ.Агент,
//	|	ДБ.ПоложениеБСО,
//	|	ДБ.СостояниеБСО,
//	|	ДБ.НомерПолиса,
//	|	ДБ.ГодПолиса,
//	|	ДБ.СтраховойПолис,
//	|	ДБ.НаОснованииБумажногоДокумента,
//	|	ДБ.ДатаВозврата,
//	|	ДБ.Заявка,
//	|	ДБ.КодОперации,
//	|	ДБ.Комментарий
//	|ИЗ
//	|	РегистрСведений.уб_ДвиженияБСО КАК ДБ
//	|ГДЕ
//	|	ДБ.НомерБСО = &НомерБСО
//	|	И ДБ.СК = &СК
//	|	И ДБ.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Период УБЫВ");
//	Запрос.УстановитьПараметр("НомерБСО",	НомерБСО);						  
//	Запрос.УстановитьПараметр("СК",			СК);						  
//	//Поставил в первом Пустую ссылку, чтобы не забывали править поставщика у печатных, понаблюдать
//	_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО", Справочники.Контрагенты.ПустаяСсылка(), Справочники.Организации.НайтиПоКоду("000000001"), НомерБСО, Справочники.уб_ВидыБСО.ПустаяСсылка());
//	Выборка = Запрос.Выполнить().Выбрать();					  
//	Если Выборка.Следующий() Тогда
//		ЗаполнитьЗначенияСвойств(_СтруктураБСО, Выборка);
//	Иначе
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Не найдено БСО с параметрами " + СК + "/" + НомерБСО;
//		Сообщение.Сообщить();	
//	КонецЕсли;	
//	Возврат _СтруктураБСО;
//	
//КонецФункции	

////Заполнение строки БСО в приемке
//Функция ДанныеПоБланкуВПриемке(Операция,Строка)
//	 //_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт");
//	//_Поставщик = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Компания Банковского Страхования");
//	Если Операция.Supplier = "In-touch" Тогда
//		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Интач");
//	ИначеЕсли Операция.Supplier = "Русский Стандарт" Тогда	
//		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт");
//	Иначе
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Не известная СК в ВЗР "+Строка;
//		Сообщение.Сообщить();
//		_СК  = СПравочники.Контрагенты.ПустаяСК;
//	КонецЕсли;	
//	Строка.СК = _СК;
//	Если ТипЗнч (Операция.PoliceNumber) = Тип("ОбъектXDTO") Тогда
//		Строка.НомерБСО = "Неизвестный нам номер, вероятно ошибка";
//		Результат = Ложь;
//	Иначе
//		Строка.НомерБСО                    = СтрЗаменить(СтрЗаменить(Операция.PoliceNumber,"TRS № ","")," ","");	
//		Результат = Истина;
//	КонецЕсли;	
//	Строка.НомерБСО                    = СтрЗаменить(СтрЗаменить(Строка.НомерБСО,"TRS № ","")," ","");	
//	_СтруктураБСО = ПолучитьДанныеБСОПоНомеруИСК(Строка.НомерБСО,_СК);
//	Строка.ВидБСО                      = _СтруктураБСО.ВидБСО;//ПолучитьБСОПоНаименованию ("Бланк полиса ВЗР",СК);
//	Строка.ОрганизацияАгент            = _СтруктураБСО.ОрганизацияАгент;
//	Строка.ОрганизацияАгентКвитанции   = Строка.ОрганизацияАгент;//Совпадает
//	Строка.Поставщик                   = _СтруктураБСО.Поставщик;
//	Строка.ПоставщикКвитанции          = _СтруктураБСО.Поставщик;
//	
//	Возврат Результат 
//КонецФункции	

////Новый формат
//Функция ЗагрузитьОперацию2(
//	Операция, 
//	Приемка, 
//	ПараметрыОППересчетСумм = Неопределено, 
//	СтруктураРезультат 		= Неопределено, 
//	ТЗЛог 					= Неопределено,
//	ТекстИсточника			= ""
//	)
//	
//	Если ТЗЛог = Неопределено Тогда
//		ТЗЛог = ТЗЛогВЗР();
//	КонецЕсли;
//	Если СтруктураРезультат = Неопределено Тогда
//		СтруктураРезультат = Новый Структура;
//		СтруктураРезультат.Вставить("Сумма",			0);
//		СтруктураРезультат.Вставить("Комиссия",			0);
//		СтруктураРезультат.Вставить("СуммаСВычетом",    0);
//		СтруктураРезультат.Вставить("Процент",			2.5);
//	КонецЕсли;
//	Полисы = Приемка.Полисы;
//	//Операция.ПолучитьXDTO ("Cost") ;
//	_Строка = Полисы.Добавить();
//	ДанныеПоБланкуВПриемке(Операция,_Строка);
//	БезПолисов = Операция.InsType = "КАСКО";
//	Если _Строка.ВидБСО.Пустая() и НЕ БезПолисов Тогда
//		ТекстОшибки = "ЗагрузитьОперацию2. Вид БСО Пустой " + Операция.InsType + "/" + Операция.PoliceNumber + ". " + ТекстИсточника;
//		ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки,, Истина,,,, "Загрузка ВЗР" );	
//		Возврат Ложь;
//	КонецЕсли;	
//	//Поставщик = ПолучитьСКПоСтроке(Операция);
//	//_Строка.ВидБСО                      = ПолучитьБСОПоНаименованию ("Бланк полиса ВЗР",СК);
//	//_Строка.Заявка                      = //не надо
//	//	_Строка.НомерБСО                    = СтрЗаменить(СтрЗаменить(Операция.numberPolice,"TRS № ","")," ","");
//	//_Строка.НомерКвитанции              = 
//	_Строка.НомерПолиса                 = _Строка.НомерБСО;
//	//_Строка.ОплатаПолисаДляОтчетаАгента = 
//	//_СтруктураБСО = ПолучитьДанныеБСОПоНомеруИСК(_Строка.НомерБСО,СК);
//	//InsType = СтрЗаменить(Операция.InsType,"","");
//	Сумма 			= Окр(Число(Операция.InsPrem), 2);
//	//Комиссия    	= Окр(Сумма * СтруктураРезультат.Процент / 100, 2);
//	//СуммаСВычетом   = Сумма - Комиссия;
//	СуммаСВычетом 	= Окр(Сумма * 0.975, 2);
//	Комиссия		= Сумма - СуммаСВычетом;
//	_Строка.Сумма                       = СуммаСВычетом;
//	_Строка.УИДСтроки                   = Новый УникальныйИдентификатор;
//	_Строка.ЭтоСвободныйНомер           = Ложь;
//	_ВыборкаРС = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.Выбрать(Новый Структура("УИДСтрокиТЧ", _Строка.УИДСтроки)); 
//	Если _ВыборкаРС.Следующий() Тогда
//		МЗ = _ВыборкаРС.ПолучитьМенеджерЗаписи();	
//	Иначе
//		МЗ = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.СоздатьМенеджерЗаписи();	
//		МЗ.УИДСтрокиТЧ		= _Строка.УИДСтроки;
//		МЗ.ПриемОплаты		= Приемка.ПолучитьСсылкуНового();
//		МЗ.ДатаЗаписи		= ТекущаяДата();
//	КонецЕсли;
//	МЗ.НомерЗаявки		= Перечисления.уб_ВидыЗаявок.КоробочнаяПродажа;
//	МЗ.СтраховойПродукт	= ПолучитьСППоНаименованию(Операция.InsType, _Строка.СК);//Сред(Операция.program,2)//Так правильней, но пока кидаем на один СП
//	МЗ.ДатаОформления	= ДатаИзСтроки(Операция.PayTime); 
//	МЗ.ДатаНачала		= ДатаИзСтроки(Операция.InsPeriod.BeginDate,	"Выделить");
//	МЗ.ДатаОкончания	= ДатаИзСтроки(Операция.InsPeriod.EndDate,		"Выделить");
//	МЗ.Страхователь		= уб_temp.СсылкаСправочникаПоНаименованию("ФизическиеЛица", Операция.Insurer.Name);
//	МЗ.ДатаОплаты		= МЗ.ДатаОформления;
//	МЗ.Агент			= уб_temp.СсылкаСправочникаПоНаименованию("ПодразделенияОрганизаций", "Сайт ВЗР");
//	МЗ.Курьер			= Справочники.ФизическиеЛица.ПустаяСсылка();
//	Если Операция.InsType = "ВЗР" Тогда
//		МЗ.НачисленнаяСуммаВзносаВВалюте	= Сумма;
//		МЗ.НачисленнаяСуммаВзноса			= Сумма;
//	Иначе
//		МЗ.НачисленнаяСуммаВзносаВВалюте	= СуммаСВычетом;
//		МЗ.НачисленнаяСуммаВзноса			= СуммаСВычетом;
//	КонецЕсли;
//	МЗ.НомерВзноса				= 1;
//	МЗ.СкидкаВыплаченаяКлиенту 	= 0;
//	МЗ.Записать();
//	Если БезПолисов = ЛОЖЬ Тогда
//		//ПО КАСКО не создаем полисы,  а только приемки
//		_Структ = Документы.уб_ПриемкаОплат.ПолучитьПустуюСтруктуруСтроки();
//		ЗаполнитьЗначенияСвойств(_Структ,_Строка);
//		//Из объекта
//		СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
//		_Структ.Валюта      = Приемка.Валюта;
//		_Структ.Курс        = Приемка.Курс;
//		_Структ.ФормаОплаты = Приемка.ФормаОплаты;
//		Если СистемаТЧПлатежи Тогда
//			Если Приемка.Платежи.Количество() = 0 Тогда
//				ТекстОшибки = "ЗагрузитьОперацию2. В ТЧ платежи в приемке нет строк: " + Приемка + ", " + ТекстИсточника;
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
//				ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//				Возврат Ложь;
//			Иначе
//				СтрокаТЧ = Приемка.Платежи[0];
//				_Структ.Валюта 		= СтрокаТЧ.Валюта;
//				_Структ.Курс		= СтрокаТЧ.Курс;
//				_Структ.ФормаОплаты = СтрокаТЧ.ФормаОплаты;
//			КонецЕсли;
//		КонецЕсли;
//		//Из временных данных
//		ЗаполнитьЗначенияСвойств(_Структ, МЗ);//Дополняем по временным данным
//		_ОбъектСП     = Неопределено;
//		_ОбъектОплата = Неопределено;
//		Приемка.СоздатьПолисИОплату(
//			_Структ, 
//			Неопределено, 
//			_ОбъектСП, 
//			_ОбъектОплата,
//			ПараметрыОППересчетСумм
//		);
//		Если НЕ _ОбъектОплата = Неопределено Тогда
//			_Строка.ОплатаПолисаДляОтчетаАгента = 	_ОбъектОплата.Ссылка;
//			_ОбъектОплата.ПроверенаЗП = Истина;
//			Попытка
//				уб_temp.Пауза(1000);
//				_ОбъектОплата.Записать();
//				уб_temp.Пауза(1000);
//				_ОбъектОплата.Записать(РежимЗаписиДокумента.Проведение);
//			Исключение
//				ТекстОшибки = "ЗагрузитьОперацию2. При записи оплаты ошибка. " + ТекстИсточника + ", " + ОписаниеОшибки();
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки,, Истина,,,,, СтатусСообщения.ОченьВажное);
//				ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки,, ТекстИсточника);
//			КонецПопытки;	
//		КонецЕсли;	
//		Если НЕ _ОбъектСП = Неопределено Тогда
//			Если _ОбъектСП.Платежи.Количество() = 0 Тогда
//				_Платеж = _ОбъектСП.Платежи.Добавить();
//			Иначе
//				_Платеж = _ОбъектСП.Платежи[0];
//			КонецЕсли;
//			_Платеж.Дата  = _Структ.ДатаОплаты;
//			_Платеж.Сумма = Сумма;
//			_ОбъектСП.ПодразделениеОП 	= МЗ.Агент;
//			_ОбъектСП.Подразделение   	= МЗ.Агент;
//			_ОбъектСП.ОбъектСтрахования = уб_temp.СсылкаСправочникаПоНаименованию("уб_ОбъектыСтрахования", Операция.InsType);
//			_ОбъектСП.Ответственный2 	= _ОбъектСП.Ответственный;
//			_ОбъектСП.ДатаДвиженияБСО  	= _ОбъектСП.Дата + 1;
//			_Риск = _ОбъектСП.Риски.Добавить();
//			_Риск.СтраховойРиск   =  уб_temp.СсылкаСправочникаПоНаименованию("уб_СтраховыеРиски", Операция.InsType + " (все риски)");
//			_Риск.СтраховаяСумма  = Число(Операция.InsSum);
//			_Риск.Валюта          = _Структ.Валюта;
//			_Риск.Тариф           = ?(_Риск.СтраховаяСумма = 0, 0, Сумма * 100 / _Риск.СтраховаяСумма);
//			_Риск.СтраховаяПремия = Сумма; 
//			_ОбъектСП.СтраховаяПремия = _Риск.СтраховаяПремия;
//			_ОбъектСП.СтраховаяСумма  = _Риск.СтраховаяСумма;
//			_оЗастрахованные = Операция.insured.person;
//			Если ТипЗнч(_оЗастрахованные) = Тип("СписокXDTO") Тогда
//				_ВсегоЗастрахованных  = Число(_оЗастрахованные.Количество());
//			Иначе	
//				_ВсегоЗастрахованных = 1;
//			КонецЕсли;	
//			Если _ВсегоЗастрахованных = 1 Тогда
//				_Лицо = _ОбъектСП.Застрахованные.Добавить();
//				_Лицо.ФИО = _оЗастрахованные.name;
//				_Лицо.ДатаРождения = ДатаИзСтроки(_оЗастрахованные.birthday,"");
//			Иначе
//				Для каждого _СтрокаЗ из _оЗастрахованные Цикл
//					_Лицо = _ОбъектСП.Застрахованные.Добавить();
//					_Лицо.ФИО = _СтрокаЗ.name;
//					_Лицо.ДатаРождения = ДатаИзСтроки(_СтрокаЗ.birthday,"");
//				КонецЦикла;	
//			КонецЕсли;
//			_ОбъектСП.Комментарий = "Создано автоматически по данным сайта/ВЗР";
//			Попытка
//				_ОбъектСП.Записать(РежимЗаписиДокумента.Запись);
//			Исключение
//				ТекстОшибки = "ЗагрузитьОперацию2. При записи полиса. " + Операция.InsType + "/" + Операция.PoliceNumber + ", " + ТекстИсточника + " -- " + ОписаниеОшибки();
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки, , Истина, , ,,"Загрузка ВЗР" );	
//				ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//				Возврат Ложь;
//			КонецПопытки;	
//			Попытка
//				уб_temp.Пауза(1000);
//				_ОбъектСП.Записать(РежимЗаписиДокумента.Проведение);
//			Исключение
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При проведении полиса ВЗР "+"Ошибка: " + ОписаниеОшибки(),, Истина,,,,,СтатусСообщения.ОченьВажное);
//				ТекстОшибки = "ЗагрузитьОперацию2. При проведении полиса. " + Операция.InsType + "/" + Операция.PoliceNumber + ", " + ТекстИсточника + " -- " + ОписаниеОшибки();
//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки,, Истина,,,,"Загрузка ВЗР");
//				ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//				Возврат Ложь;
//			КонецПопытки;	
//		КонецЕсли;		
//	КонецЕсли;
//	СтруктураРезультат.Сумма 			= СтруктураРезультат.Сумма 			+ Сумма;
//	СтруктураРезультат.Комиссия 		= СтруктураРезультат.Комиссия 		+ Комиссия;
//	СтруктураРезультат.СуммаСВычетом    = СтруктураРезультат.СуммаСВычетом 	+ СуммаСВычетом;
//	Возврат Истина;
//	
//КонецФункции		
////Старый формат
//Функция ЗагрузитьОперацию(
//	Операция, 
//	Приемка, 
//	СК, 
//	Поставщик, 
//	ПараметрыОППересчетСумм = Неопределено, 
//	СтруктураРезультат 		= Неопределено,
//	ТЗЛог					= Неопределено,
//	ТекстИсточника			= ""
//	)
//	
//	Если ТЗЛог = Неопределено Тогда
//		ТЗЛог = ТЗЛогВЗР();
//	КонецЕсли;
//	Если СтруктураРезультат = Неопределено Тогда
//		СтруктураРезультат = Новый Структура;
//		СтруктураРезультат.Вставить("Сумма",			0);
//		СтруктураРезультат.Вставить("Комиссия",			0);
//		СтруктураРезультат.Вставить("СуммаСВычетом",    0);
//		СтруктураРезультат.Вставить("Процент",			2.5);
//	КонецЕсли;
//	Полисы = Приемка.Полисы;
//	Операция.ПолучитьXDTO("Cost");
//	_Строка = Полисы.Добавить();
//	_Строка.ВидБСО                      = ПолучитьБСОПоНаименованию ("Бланк полиса ВЗР",СК);
//	//_Строка.Заявка                      = //не надо
//	_Строка.НомерБСО                    = СтрЗаменить(СтрЗаменить(Операция.numberPolice, "TRS № ",""), " ", "");
//	//_Строка.НомерКвитанции              = 
//	_Строка.НомерПолиса                 = _Строка.НомерБСО;
//	//_Строка.ОплатаПолисаДляОтчетаАгента = 
//	_СтруктураБСО = ПолучитьДанныеБСОПоНомеруИСК(_Строка.НомерБСО,СК);
//	_Строка.ОрганизацияАгент            = _СтруктураБСО.ОрганизацияАгент;
//	_Строка.ОрганизацияАгентКвитанции   = _Строка.ОрганизацияАгент;//Совпадает
//	_Строка.Поставщик                   = Поставщик;
//	_Строка.ПоставщикКвитанции          = Поставщик;
//	_Строка.СК                          = СК;
//	Сумма 			= Окр(Число(Операция.costRub), 2);
//	//Комиссия    	= Окр(Сумма * СтруктураРезультат.Процент / 100, 2);
//	//СуммаСВычетом   = Сумма - Комиссия;
//	СуммаСВычетом 	= Окр(Сумма * 0.975, 2);
//	Комиссия		= Сумма - СуммаСВычетом;
//	_Строка.Сумма                       = СуммаСВычетом;
//	_Строка.УИДСтроки                   = Новый УникальныйИдентификатор;
//	_Строка.ЭтоСвободныйНомер           = Ложь;
//	_ВыборкаРС = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.Выбрать(Новый Структура("УИДСтрокиТЧ", _Строка.УИДСтроки)); 	
//	Если _ВыборкаРС.Следующий() Тогда
//		МЗ = _ВыборкаРС.ПолучитьМенеджерЗаписи();	
//	Иначе
//		МЗ = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.СоздатьМенеджерЗаписи();	
//		МЗ.УИДСтрокиТЧ		= _Строка.УИДСтроки;
//		МЗ.ПриемОплаты		= Приемка.ПолучитьСсылкуНового();
//		МЗ.ДатаЗаписи		= ТекущаяДата();
//	КонецЕсли;
//	МЗ.НомерЗаявки		= Перечисления.уб_ВидыЗаявок.КоробочнаяПродажа;
//	МЗ.СтраховойПродукт	= ПолучитьСППоНаименованию("ВЗР",СК);//Сред(Операция.program,2)//Так правильней, но пока кидаем на один СП
//	МЗ.ДатаОформления	= ДатаИзСтроки(Операция.payDate); 
//	МЗ.ДатаНачала		= ДатаИзСтроки(Операция.insurPeriod.beginDate,"Выделить");
//	МЗ.ДатаОкончания	= ДатаИзСтроки(Операция.insurPeriod.endDate,"Выделить");
//	МЗ.Страхователь		= уб_temp.СсылкаСправочникаПоНаименованию("ФизическиеЛица",Операция.insurerName);
//	МЗ.ДатаОплаты		= МЗ.ДатаОформления;
//	МЗ.Агент			= уб_temp.СсылкаСправочникаПоНаименованию("ПодразделенияОрганизаций","Сайт ВЗР");
//	МЗ.Курьер			= Справочники.ФизическиеЛица.ПустаяСсылка();
//	Если Операция.InsType = "ВЗР" Тогда
//		МЗ.НачисленнаяСуммаВзносаВВалюте	= Сумма;
//		МЗ.НачисленнаяСуммаВзноса			= Сумма;
//	Иначе
//		МЗ.НачисленнаяСуммаВзносаВВалюте	= СуммаСВычетом;
//		МЗ.НачисленнаяСуммаВзноса			= СуммаСВычетом;
//	КонецЕсли;
//	МЗ.НомерВзноса						= 1;
//	МЗ.СкидкаВыплаченаяКлиенту 			= 0;
//	МЗ.Записать();
//	_Структ = Документы.уб_ПриемкаОплат.ПолучитьПустуюСтруктуруСтроки();
//	ЗаполнитьЗначенияСвойств(_Структ,_Строка);
//	//Из объекта
//	_Структ.Валюта      = Приемка.Валюта;
//	_Структ.Курс        = Приемка.Курс;
//	_Структ.ФормаОплаты = Приемка.ФормаОплаты;	
//	//Из временных данных
//	ЗаполнитьЗначенияСвойств(_Структ, МЗ);//Дополняем по временным данным
//	_ОбъектСП     = Неопределено;
//	_ОбъектОплата = Неопределено;
//	Приемка.СоздатьПолисИОплату(
//		_Структ, 
//		Неопределено, 
//		_ОбъектСП, 
//		_ОбъектОплата,
//		ПараметрыОППересчетСумм
//	);
//	Если НЕ _ОбъектОплата = Неопределено Тогда
//		_Строка.ОплатаПолисаДляОтчетаАгента = 	_ОбъектОплата.Ссылка;
//		_ОбъектОплата.ПроверенаЗП = Истина;
//		Попытка
//			уб_temp.Пауза(1000);
//			_ОбъектОплата.Записать();
//			уб_temp.Пауза(1000);
//			_ОбъектОплата.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			ТекстОшибки = "ЗагрузитьОперацию. При записи оплаты ВЗР ошибка. " + ТекстИсточника + ", " + ОписаниеОшибки();
//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки,, Истина,,,,,СтатусСообщения.ОченьВажное);
//			ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Ложь, ТекстИсточника);
//		КонецПопытки;	
//	КонецЕсли;	
//	Если НЕ _ОбъектСП = Неопределено Тогда
//		Если _ОбъектСП.Платежи.Количество() = 0 Тогда
//			_Платеж = _ОбъектСП.Платежи.Добавить();
//		Иначе
//			_Платеж = _ОбъектСП.Платежи[0];
//		КонецЕсли;
//		_Платеж.Дата  = _Структ.ДатаОплаты;
//		_Платеж.Сумма = Сумма;
//		_ОбъектСП.ПодразделениеОП = МЗ.Агент;
//		_ОбъектСП.Подразделение   = МЗ.Агент;
//		_ОбъектСП.ОбъектСтрахования = уб_temp.СсылкаСправочникаПоНаименованию("уб_ОбъектыСтрахования","ВЗР");
//		_ОбъектСП.Ответственный2 = _ОбъектСП.Ответственный;
//		_ОбъектСП.ДатаДвиженияБСО  = _ОбъектСП.Дата+1;
//		_Риск = _ОбъектСП.Риски.Добавить();
//		_Риск.СтраховойРиск   =  уб_temp.СсылкаСправочникаПоНаименованию("уб_СтраховыеРиски", "ВЗР (все риски)");
//		_Риск.СтраховаяСумма  = Число(Операция.programSum);
//		_Риск.Валюта          = _Структ.Валюта;
//		_Риск.Тариф           = ?(_Риск.СтраховаяСумма = 0, 0, Сумма * 100/ _Риск.СтраховаяСумма);
//		_Риск.СтраховаяПремия = Сумма; 			
//		_ОбъектСП.СтраховаяПремия = _Риск.СтраховаяПремия;
//		_ОбъектСП.СтраховаяСумма  = _Риск.СтраховаяСумма;
//		_оЗастрахованные = Операция.insured.person;
//		Если ТипЗнч(_оЗастрахованные) = Тип("СписокXDTO") Тогда
//			_ВсегоЗастрахованных  = Число(_оЗастрахованные.Количество());
//		Иначе	
//			_ВсегоЗастрахованных = 1;
//		КонецЕсли;			
//		Если _ВсегоЗастрахованных = 1 Тогда
//			_Лицо = _ОбъектСП.Застрахованные.Добавить();
//			_Лицо.ФИО = _оЗастрахованные.name;
//			_Лицо.ДатаРождения = ДатаИзСтроки(_оЗастрахованные.birthday,"");
//		Иначе
//			Для каждого _СтрокаЗ из _оЗастрахованные Цикл
//				_Лицо = _ОбъектСП.Застрахованные.Добавить();
//				_Лицо.ФИО = _СтрокаЗ.name;
//				_Лицо.ДатаРождения = ДатаИзСтроки(_СтрокаЗ.birthday,"");	
//			КонецЦикла;	
//		КонецЕсли;
//		_ОбъектСП.Комментарий = "Создано автоматически по данным сайта/ВЗР";
//		Попытка
//			_ОбъектСП.Записать(РежимЗаписиДокумента.Запись);
//		Исключение
//			ТекстОшибки = "ЗагрузитьОперацию. При записи полиса ВЗР. " + ТекстИсточника + ", " + ОписаниеОшибки();
//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки,, Истина,,,,,СтатусСообщения.ОченьВажное);
//			ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//			Возврат Ложь;
//		КонецПопытки;	
//		Попытка
//			уб_temp.Пауза(1000);
//			_ОбъектСП.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			ТекстОшибки = "ЗагрузитьОперацию. При проведении полиса ВЗР. " + ТекстИсточника + ", " + ОписаниеОшибки();
//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При проведении полиса ВЗР. " + "Ошибка: " + ОписаниеОшибки(),, Истина,,,,,СтатусСообщения.ОченьВажное);			
//			ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, ТекстОшибки, Истина, ТекстИсточника);
//			Возврат Ложь;
//		КонецПопытки;	
//	КонецЕсли;	
//	СтруктураРезультат.Сумма 			= СтруктураРезультат.Сумма 			+ Сумма;
//	СтруктураРезультат.Комиссия 		= СтруктураРезультат.Комиссия 		+ Комиссия;
//	СтруктураРезультат.СуммаСВычетом    = СтруктураРезультат.СуммаСВычетом 	+ СуммаСВычетом;
//	Возврат Истина;
//	
//КонецФункции		

////Конвертация строки в дату
//Функция ДатаИзСтроки(дата,Вариант=1)
//	Попытка
//		Если Вариант=1 Тогда
//			Возврат Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(Дата,"-","")," ",""),":",""))
//		Иначе
//			Возврат Дата( Сред (Дата,7,4)+Сред (Дата,4,2)+Сред (Дата,1,2));
//		КонецЕсли;	
//	Исключение
//		Возврат Дата(1,1,1);
//	КонецПопытки;
//КонецФункции	

////Убирает свойстов descripion из исходного файла, поскольку из-за не видится значение тега, возможно есть более простое решение через использование ОбъектаXDTO
//Функция УбратьОписания(Строка)
//	//Описания не дают считывать само значение
//	_СтрокаПоиска = " description=""";
//	_Длина = СтрДлина (_СтрокаПоиска);
//	_Поз= Найти(Строка,_СтрокаПоиска);
//	Пока _Поз>0 Цикл
//		_Сред = Сред(Строка, _Поз+_Длина+1);
//		Строка = Лев(Строка,_Поз-1)+Сред(_Сред,Найти(_Сред,"""")+1);
//		_Поз= Найти(Строка,_СтрокаПоиска);
//	КонецЦикла;	
//	Возврат Строка;
//КонецФункции	

////Поиск и создание приемки по сумме и дате
//Функция ПолучитьПриемку(Дата, СуммаПоСтрокам, СоздаватьДокумент = Истина)
//	
//	// TODO в константу
//	БанкЭквайер = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты", "Филиал N 7711 ВТБ 24 (ЗАО)");
//	// TODO проблема копеек
//	// ранее СуммаСВычетом рассчитвалась так: Сумма - (Сумма * 0.025)
//	// корректно так: Сумма * 0.975. Сумма эквайринга рассчтыватся разницей полной суммы и суммы с вычетом, а не наоборот
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	П.Ссылка,
//	|	РАЗНОСТЬДАТ(П.Дата, &Дата, ДЕНЬ) КАК РазницаДней,
//	|	ПРЕДСТАВЛЕНИЕ(П.Ссылка) КАК СсылкаСтрока
//	|ИЗ
//	|	Документ.уб_ПриемкаОплат КАК П
//	|ГДЕ
//	|	РАЗНОСТЬДАТ(П.Дата, &Дата, ДЕНЬ) >= 0
//	|	И РАЗНОСТЬДАТ(П.Дата, &Дата, ДЕНЬ) < 7
//	|	И П.ПринятоОТ = &ПринятоОТ
//	|	И П.ПометкаУдаления = ЛОЖЬ
//	|	И (П.СуммаПоСтрокам = &СуммаПоСтрокам)");
//	Запрос.УстановитьПараметр("Дата", 			Дата); //Ищется приемка в пределах 7 дней от
//	Запрос.УстановитьПараметр("СуммаПоСтрокам", СуммаПоСтрокам);
//	Запрос.УстановитьПараметр("ПринятоОТ",		БанкЭквайер);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка;
//	ИначеЕсли СоздаватьДокумент Тогда	
//		_Объект = Документы.уб_ПриемкаОплат.СоздатьДокумент();
//		_Объект.ПринятоОТ = Запрос.Параметры.ПринятоОт;
//		_Объект.Дата = Дата;
//		_Объект.УстановитьСсылкуНового(Документы.уб_ПриемкаОплат.ПолучитьСсылку());
//		Возврат _Объект
//	КонецЕсли;
//	
//КонецФункции	

//Поиск вида БСО по наименованию и владельцу? улучшить, унифицировать со следующей
//Функция ПолучитьБСОПоНаименованию (Наименование,СК)
//	Запрос = Новый Запрос ("ВЫБРАТЬ
//						   |	уб_ВидыБСО.Ссылка
//						   |ИЗ
//						   |	Справочник.уб_ВидыБСО КАК уб_ВидыБСО
//						   |ГДЕ
//						   |	уб_ВидыБСО.Наименование = &Наименование
//						   |	И уб_ВидыБСО.Владелец = &Владелец");
//Запрос.УстановитьПараметр("Наименование",Наименование);
//Запрос.УстановитьПараметр("Владелец",СК);
//Выборка = Запрос.Выполнить().Выбрать();
//Если Выборка.Следующий() Тогда
//	//
//	Возврат Выборка.Ссылка;	
//Иначе
//	//
//	Возврат Справочники.уб_ВидыБСО.ПустаяСсылка();
//КонецЕсли;	
//КонецФункции
//улучшить, унифицировать с вышестоящей
//Функция ПолучитьСППоНаименованию (Наименование,СК)
//	Запрос = Новый Запрос ("ВЫБРАТЬ
//						   |	уб_СтраховыеПродукты.Ссылка
//						   |ИЗ
//						   |	Справочник.уб_СтраховыеПродукты КАК уб_СтраховыеПродукты
//						   |ГДЕ
//						   |	уб_СтраховыеПродукты.Наименование = &Наименование
//						   |	И уб_СтраховыеПродукты.Владелец = &Владелец");
//Запрос.УстановитьПараметр("Наименование",Наименование);
//Запрос.УстановитьПараметр("Владелец",СК);
//Выборка = Запрос.Выполнить().Выбрать();
//Если Выборка.Следующий() Тогда
//	//
//	Возврат Выборка.Ссылка;	
//Иначе
//	//
//	Возврат Справочники.уб_ВидыБСО.ПустаяСсылка();
//КонецЕсли;	
//КонецФункции

Процедура уб_ОбработкаОчереди() Экспорт
	
	ВыполнитьОбработкуОчереди(2);
	
КонецПроцедуры //уб_ОбработкаОчереди

Процедура ВыполнитьОбработкуОчереди(КоличествоПопытокВыполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	ПрогнатьСтатусы();

	
Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда	
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |ГДЕ
	               |	(уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |			ИЛИ уб_Очередь.КоличествоПопытокВыполнения = 100)
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.Рассылка)";
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", КоличествоПопытокВыполнения);
	ВсеДокументы = Запрос.Выполнить().Выгрузить();
	ВидыДоков = ВсеДокументы.Скопировать();
	ВидыДоков.Свернуть("ТипДокумента");
	
	Для Каждого ВидДоков из ВидыДоков Цикл
		
		Если ВидДоков.ТипДокумента = Тип("null") Тогда
			Продолжить;
		КонецЕсли;	
		
		ТекДоки = ВсеДокументы.Скопировать(Новый Структура("ТипДокумента",ВидДоков.ТипДокумента));
		
		Если ТекДоки.Количество() >0 Тогда
			ИмяМета = ТекДоки[0].Объект.Метаданные().Имя;
			Попытка
				Документы[ИмяМета].ОбработчикРассылки(ТекДоки.ВыгрузитьКолонку("Объект"));
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Обработчик рассылки."+ИмяМета+"."+ОписаниеОшибки(), "Сообщить", Истина);
				//Сообщить();
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработатьОчередьВыгрузкаВоВнешнююСистему(Запрос);
	//
	ОбработатьОчередьПриемкиКЗаявкам(Запрос);
	
	ОбработатьОчередьСозданиеПолисов(Запрос);
	
	Попытка
		Документы.уб_ВзаиморасчетСПоставщиком.НайтиИОбработатьБезналОтСтрахователя(ТекущаяДата());
	Исключение
	КонецПопытки;
	
	//Проведение
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |ГДЕ
	               |	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.Проведение)";
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 30);
	ВсеДокументы = Запрос.Выполнить().Выгрузить();
	ВидыДоков = ВсеДокументы.Скопировать();
	ВидыДоков.Свернуть("ТипДокумента");
	
	ТипОчереди =  Перечисления.уб_ТипыОчереди.Проведение;
	Для Каждого ТекДокумент из ВсеДокументы Цикл
		
		Если ТекДокумент.ТипДокумента = Тип("null") Тогда
			Продолжить;
		КонецЕсли;	
		
		ТипСсылки = ТекДокумент.ТипДокумента;
		Ссылка = ТекДокумент.Объект;
		Док = Ссылка.ПолучитьОбъект();
		Док.ПометкаУдаления = ЛОЖЬ;
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			ЗакрытьОчередь(Ссылка,ТипОчереди);
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Док + "" + Символы.ПС + "Ошибка: " + ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецПопытки;
		//Если ТипСсылки = Тип("ДокументСсылка.уб_ВыплатаЗП") Тогда
		//	уб_ОбменДанными.ПроверитьСоздатьВыплатуЗПВДеньгах(Ссылка);
		//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда	
		//	уб_ОбменДанными.ПроверитьСоздатьОтчетКассираВДеньгах(Ссылка);
		//КонецЕсли;		
	КонецЦикла;


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Доработка,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ТребуетсяВозвратБСО,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Комментарий,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Период,
	               |	РАЗНОСТЬДАТ(уб_ИсторияСтатусовЗаявокСрезПоследних.Период, &ТекущаяДата, МИНУТА) КАК ВСтатусе,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка.Менеджер КАК Менеджер,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка.Номер КАК Номер,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Автор,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ДатаСоздания,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Модификатор,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ДатаИзменения,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка.Страхователь как Страхователь
	               |ИЗ
	               |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |ГДЕ
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СогласованиеСКлиентом)
	               |	И уб_ИсторияСтатусовЗаявокСрезПоследних.Доработка = ИСТИНА
	               |	И РАЗНОСТЬДАТ(уб_ИсторияСтатусовЗаявокСрезПоследних.Период, &ТекущаяДата, МИНУТА) >= 30
	               |	И РАЗНОСТЬДАТ(уб_ИсторияСтатусовЗаявокСрезПоследних.Период, &ТекущаяДата, МИНУТА) < 120
	               |	И НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Комментарий ПОДОБНО ""%sms%""";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Вставить("ИмяСервиса","www.sluice");
		Параметры.Вставить("ИмяСервиса","smsc.ru");
		Параметры.Вставить("Режим","HTTP");
		Параметры.Вставить("ТолькоОдномуПолучателю", Истина);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			Параметры.Получатели 	= уб_temp.ДайКонтактнуюИнформациюФизлица(Выборка.Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);;
		Иначе
			Параметры.Получатели 	= "+79133616124";
		КонецЕсли;
		
		Параметры.Тема			= "Рассылка СМС";
		Параметры.Сообщение		= "Заявка "+Выборка.Номер+" ("+СокрЛП(Выборка.Страхователь)+") возвращена вам на доработку";
		
		Попытка 
			Ответ = "";
			уб_ОбменДанными.SendSMS(Параметры,Ответ);
			Если Найти (Ответ,"Ложь") = 0 Тогда
				Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("SMS:"+Параметры.Сообщение,Выборка.Менеджер,Выборка.Номер);
				//Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Результат отправки SMS:"+СтрЗаменить(Ответ,"¶",""),Выборка.Менеджер,Выборка.Номер);
				мз = Регистрысведений.уб_ИсторияСтатусовЗаявок.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(мз,Выборка);
				мз.Период = ТекущаяДата();
				мз.Комментарий = "sms: "+мз.Комментарий;
				мз.Записать();
				
			Конецесли;	
		Исключение
			Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Ошибка при отправке SMS",Выборка.Менеджер,Выборка.Номер,Ложь);
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПроверитьИОтправитьСМС(). " + " -- " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина, , ,,"СМС-рассылка.Error.Заявка" );	
		КонецПопытки;

		
	КонецЦикла;	
	
	
	//Проверка Требуется возврат БСО
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ТребуетсяВозвратБСО,
	               |	уб_Очередь.Параметр КАК ТекСтатус
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО уб_Очередь.Объект = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	               |ГДЕ
	               |	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.ТребуетсяВозвратБСО)";
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 30);
	ВсеДокументы = Запрос.Выполнить().Выгрузить();
	ВидыДоков = ВсеДокументы.Скопировать();
	ВидыДоков.Свернуть("ТипДокумента");
	
	Роль = Неопределено;
	
	ТипОчереди =  Перечисления.уб_ТипыОчереди.ТребуетсяВозвратБСО;
	Для Каждого ТекДокумент из ВсеДокументы Цикл
		
		ТипСсылки = ТекДокумент.ТипДокумента;
		Если НЕ ТипСсылки = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗакрытьОчередь(ТекДокумент.Объект,ТипОчереди);;
		
		//Заявка = ТекДокумент.Объект;
		//тзСреза = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних( , Новый Структура("Заявка",Заявка)); 
		//Если тзСреза.Количество() >= 1 Тогда
		//	ТекТребуетсяВозвратБСО = тзСреза[0].ТребуетсяВозвратБСО;
		//	
		//	ТребуетсяВозвратБСО = уб_УСЗ.ПолучитьТаблицуБСОПоЗаявке(Заявка).Количество() > 0;
		//	
		//	Если Не ТекТребуетсяВозвратБСО = ТребуетсяВозвратБСО Тогда
		//		Комментарий = "Проверка БСО";
		//		НовыйСтатус = тзСреза[0].Статус;
		//		Результат = уб_УСЗ.УстановитьСтатусЗаявки(Заявка, тзСреза[0].Статус, Комментарий, тзСреза[0].Доработка,, ТребуетсяВозвратБСО);
		//		//#Если Клиент Тогда
		//		//	Сообщить("ЕСТЬ изменения заявки № " + СтрЗаменить(Заявка.Номер, Символ(160), "") + ": " + ?(ТребуетсяВозвратБСО, "", " не") + " требуется возврат БСО.")
		//		//#КонецЕсли
		//		Если Ссылка.Дата <Дата(2025,6,1) Тогда
		//			ЗакрытьОчередь(Ссылка,ТипОчереди);
		//		КонецЕсли;	
		//	Иначе
		//		ЗакрытьОчередь(Ссылка,ТипОчереди);
		//	КонецЕсли; 
		//Иначе
		//	//ОповеститьДляСервера("Консоль", "Не обнаружен текущий статус по заявке № " + Заявка.Номер);
		//КонецЕсли;
    КонецЦикла;

	
	
	//Проверка Перемещений
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект КАК Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ТребуетсяВозвратБСО,
	               |	уб_Очередь.Параметр КАК ТекСтатус
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО уб_Очередь.Объект = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	               |ГДЕ
	               |	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.ПроверкаПеремещений)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Объект.Дата";
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 11);
	ВсеДокументы = Запрос.Выполнить().Выгрузить();
	ВидыДоков = ВсеДокументы.Скопировать();
	ВидыДоков.Свернуть("ТипДокумента");
	
	Роль = Неопределено;
	
	ТипОчереди =  Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
	Для Каждого ТекДокумент из ВсеДокументы Цикл
		
		ТипСсылки = ТекДокумент.ТипДокумента;
		Если НЕ ТипСсылки = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			Продолжить;
		КонецЕсли;	
		
		
		
		
		Ссылка = ТекДокумент.Объект;
		Сообщить("Попытка обработки перемещения для "+Ссылка);
		Попытка
			Если уб_УСЗ.ПроверитьПеремещения(Ссылка,ТекДокумент.Статус) = Истина Тогда
				ЗакрытьОчередь(Ссылка,ТипОчереди);
			Иначе
				ОшибкаОчереди(Ссылка,ТипОчереди);
			КонецЕсли;	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
			
	КонецЦикла;


	Если ПараметрыСеанса.уб_Константы.ИспользоватьКонвертациюФайлов = Истина Тогда	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_Очередь.Объект,
		|	уб_Очередь.Объект.Представление
		|ИЗ
		|	РегистрСведений.уб_Очередь КАК уб_Очередь
		|ГДЕ
		|	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
		|	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.Файлы)";
		Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", КоличествоПопытокВыполнения);
		
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run("taskkill.exe /F /IM AcroRd32.exe", 0, -1);
		
		ВыборкаГруппировка = Запрос.Выполнить().Выбрать();	
		Пока ВыборкаГруппировка.Следующий() Цикл
			ВыполнитьКонвертациюФайла(ВыборкаГруппировка.Объект);
		КонецЦикла;
	КонецЕсли;
	
	//	//Обмены
	//Выше ОбработатьОчередьВыгрузкаВоВнешнююСистему
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	уб_Очередь.Объект,
	//               |	уб_Очередь.Объект.Представление,
	//               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	//               |ИЗ
	//               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	//               |ГДЕ
	//               |	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	//               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему)";
	//Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 30);
	//ВсеДокументы = Запрос.Выполнить().Выгрузить();
	//ВидыДоков = ВсеДокументы.Скопировать();
	//ВидыДоков.Свернуть("ТипДокумента");
	//
	//Для Каждого ТекДокумент из ВсеДокументы Цикл
	//	
	//	Если ТекДокумент.ТипДокумента = Тип("null") Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	ТипСсылки = ТекДокумент.ТипДокумента;
	//	Ссылка = ТекДокумент.Объект;
	//	Попытка
	//		Если ТипСсылки = Тип("ДокументСсылка.уб_ВыплатаЗП") Тогда
	//			уб_ОбменДанными.ПроверитьСоздатьВыплатуЗПВДеньгах(Ссылка);
	//		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда	
	//			уб_ОбменДанными.ПроверитьСоздатьОтчетКассираВДеньгах(Ссылка);
	//		КонецЕсли;		
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла;

	
	КонецЕсли;
	
		
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //ВыполнитьОбработкуОчереди
Процедура ПрогнатьСтатусы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
		//Движение статусов
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.ТребуетсяВозвратБСО,
	               |	уб_Очередь.Параметр  как УстСтатус
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО уб_Очередь.Объект = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	               |ГДЕ
	               |	уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.ДвижениеСтатусов)";
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 30);
	ВсеДокументы = Запрос.Выполнить().Выгрузить();
	ВидыДоков = ВсеДокументы.Скопировать();
	ВидыДоков.Свернуть("ТипДокумента");
	
	Роль = Неопределено;
	
	ТипОчереди =  Перечисления.уб_ТипыОчереди.ДвижениеСтатусов;
	Для Каждого ТекДокумент из ВсеДокументы Цикл
		
		Если ТекДокумент.ТипДокумента = Тип("null") Тогда
			Продолжить;
		КонецЕсли;	
		
		ТипСсылки = ТекДокумент.ТипДокумента;
		Ссылка = ТекДокумент.Объект;
		//Док = Ссылка.ПолучитьОбъект();
		Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
			Ссылка, 
			ТекДокумент.Статус,
			ТекДокумент.УстСтатус,
			,
			Роль,
			, //ТекстКоманды
			)
			Тогда
			//СписокОбработанныхЗаявок.Добавить(Выборка.ЗаявкаНомер);
			ЗакрытьОчередь(Ссылка,ТипОчереди);
		КонецЕсли;	
		//Попытка
		//	Док.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Док + "" + Символы.ПС + "Ошибка: " + ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
		//	Отказ = Истина;
		//КонецПопытки;
		//Если ТипСсылки = Тип("ДокументСсылка.уб_ВыплатаЗП") Тогда
		//	уб_ОбменДанными.ПроверитьСоздатьВыплатуЗПВДеньгах(Ссылка);
		//ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда	
		//	уб_ОбменДанными.ПроверитьСоздатьОтчетКассираВДеньгах(Ссылка);
		//КонецЕсли;		
	КонецЦикла;
КонецПроцедуры	

Функция ВыполнитьКонвертациюФайла(Объект) Экспорт
	
	Результат = Истина;
	Параметры = уб_СЛ.СтруктураПараметровКонвертацииФайловПоУмолчанию();
	Параметры.СсылкаНаОбъект 						= Объект;
	Параметры.СоздаватьТаблицуФайловПоЗаявке      	= Истина;
	Параметры.ИспользуетсяИмяФайлаСТаблицейФайлов   = Истина;
	Параметры.ЧерезФоновоеЗадание					= ПараметрыСеанса.уб_Константы.КонвертацияЧерезФоновоеЗадание;
	Параметры.ВремяОжиданияФоновогоЗадания			= 60;
	Параметры.ВремяОжиданияСозданияФайла1С			= 200;
	уб_СЕРВЕРные.ВызовКонвертацииСервер(Параметры);
	Возврат Параметры.ВыполненаКонвертацияВсехФайлов;
	
КонецФункции //ВыполнитьКонвертациюФайла

Процедура уб_ПроверкаПролонгации() Экспорт
	//Связываем уже созданные полисы, с полисами прошлых лет
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_СтраховойПолис.Ссылка
	               |ИЗ
	               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	               |		ПО (уб_ЗаданияНаПролонгацию.НовыйПолис = уб_СтраховойПолис.Ссылка)
	               |			И (уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ)
	               |ГДЕ
	               |	уб_СтраховойПолис.ДатаИзменения >= &Дата1
	               |	И уб_СтраховойПолис.ДатаИзменения <= &Дата2
	               |	И уб_СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	               |	И уб_ЗаданияНаПролонгацию.СтраховойПолис ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_СтраховойПолис.ДатаНачала УБЫВ";
	ТекущаяДата = ТекущаяДата();
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата-3*24*3600);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата);
	
	Менеджер = РегистрыСведений.уб_ЗаданияНаПролонгацию;
	Выборка = Запрос.Выполнить().Выбрать();
	Сообщить("Всего полисов без задания "+Выборка.Количество());
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Документ = Менеджер.НайтиПодходящийПолис(Выборка.Ссылка,Истина);
		Если ЗначениеЗаполнено(Документ) Тогда
			Счетчик = Счетчик+1;
		КонецЕсли;	
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;	
	Сообщить("Создано "+Счетчик);

	
	//Старый алгоритм работал заранее
	Возврат;
	//Если Агент  = Неопределено Тогда
		Агент = Справочники.ФизическиеЛица.ПустаяСсылка();
	//КонецЕсли;
	
	СуммаДопустимогоДолга = 10;//не создавать задание на очередную оплату если сумма меньше 10 р.
	КоличествоДней = 21;//Дней до даты окончания полиса для создания задания на пролонгацию
	КоличествоДнейДляПовторногоЗадания = 7;//если прошло 7 дней с последнего движения и задания не закрыто, то создать еще одно задание
	КоличествоДнейДоОчередногоПлатежа = 14;//создавать задания на очередной платеж за 14 дней до запланированной даты
	СтатусВРаботе = Перечисления.уб_СтатусыПролонгирования.ВРаботе;
	ТекДата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_СтраховойПолис.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер, уб_СтраховойПолис.Агент) КАК Агент
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|		ПО уб_СтраховойПолис.Ссылка = уб_ЗаданияНаПролонгацию.СтраховойПолис
	|			И (уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|		ПО уб_СтраховойПолис.Ссылка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен)
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	|ГДЕ
	|	РАЗНОСТЬДАТ(&ТекущаяДата, уб_СтраховойПолис.ДатаОкончания, ДЕНЬ) <= &КоличествоДней
	|	И РАЗНОСТЬДАТ(&ТекущаяДата, уб_СтраховойПолис.ДатаОкончания, ДЕНЬ) >= 0
	|	И уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.Действует)
	|	И уб_ЗаданияНаПролонгацию.СтраховойПолис ЕСТЬ NULL 
	|	И уб_СтраховойПолис.Агент ССЫЛКА Справочник.ФизическиеЛица
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	уб_СтраховойПолис.ДатаОкончания,
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_РуководителиПодразделенийСрезПоследних.Подразделение,
	|	уб_РуководителиПодразделенийСрезПоследних.Сотрудник
	|ИЗ
	|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ТекущаяДата, Заместитель = ЛОЖЬ) КАК уб_РуководителиПодразделенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ПервыйРабочийДень
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачалоДня
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПервыйРабочийДень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора КАК СтарыйСтраховойПолис,
	|	уб_СтраховойПолис.Ссылка КАК НовыйСтраховойПолис
	|ПОМЕСТИТЬ ВТ_ПролонгированныеПолиса
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_СтатусыПролонгации.СрезПоследних(&ТекущаяДата, ТипЗадания = ЛОЖЬ) КАК уб_СтатусыПролонгацииСрезПоследних
	|			ПО уб_ЗаданияНаПролонгацию.СтраховойПолис = уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис
	|				И уб_ЗаданияНаПролонгацию.ТипЗадания = уб_СтатусыПролонгацииСрезПоследних.ТипЗадания
	|				И (НЕ уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован))
	|		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора = уб_ЗаданияНаПролонгацию.СтраховойПолис
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = уб_СтраховойПолис.Заявка
	|			И (&Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|				ИЛИ уб_СтраховойПолис.Агент = &Агент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПролонгированныеПолиса.СтарыйСтраховойПолис,
	|	ВТ_ПролонгированныеПолиса.НовыйСтраховойПолис
	|ИЗ
	|	ВТ_ПролонгированныеПолиса КАК ВТ_ПролонгированныеПолиса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(уб_СтатусыПролонгацииСрезПоследних.Период, &ТекущаяДата, ДЕНЬ) КАК КоличествоДней,
	|	уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис КАК Ссылка,
	|	ЕСТЬNULL(уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис.Агент, ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) КАК Агент,
	|	уб_ЗаданияНаПролонгацию.Ответственный КАК ТекОтветственный,
	|	ВЫБОР
	|		КОГДА уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации = &СтатусВРаботе
	|				И РАЗНОСТЬДАТ(уб_СтатусыПролонгацииСрезПоследних.Период, &ТекущаяДата, ДЕНЬ) >= &КоличествоДнейДляПовторногоЗадания
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоздатьПовторноеЗадание,
	|	уб_СтатусыПролонгацииСрезПоследних.КонтрольнаяДата КАК КонтрольнаяДата,
	|	уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации КАК СтатусПролонгации
	|ИЗ
	|	РегистрСведений.уб_СтатусыПролонгации.СрезПоследних(&ТекущаяДата, ТипЗадания = ЛОЖЬ) КАК уб_СтатусыПролонгацииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|		ПО уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис = уб_ЗаданияНаПролонгацию.СтраховойПолис
	|			И (НЕ уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован))
	|			И (НЕ уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Отказ))
	|			И уб_СтатусыПролонгацииСрезПоследних.ТипЗадания = уб_ЗаданияНаПролонгацию.ТипЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПролонгированныеПолиса КАК ВТ_ПролонгированныеПолиса
	|		ПО уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис = ВТ_ПролонгированныеПолиса.СтарыйСтраховойПолис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|		ПО (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен)
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	|			И уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис = уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерДоговора
	|ГДЕ
	|	ВТ_ПролонгированныеПолиса.СтарыйСтраховойПолис ЕСТЬ NULL 
	//Пусть все|	И РАЗНОСТЬДАТ(уб_СтатусыПролонгацииСрезПоследних.Период, &ТекущаяДата, ДЕНЬ) < 100
	|	И (&Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ ЕСТЬNULL(уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис.Агент, ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) = &Агент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_СтраховойПолисПлатежи.Ссылка КАК СтраховойПолис,
	|	МАКСИМУМ(уб_СтраховойПолисПлатежи.Дата) КАК ДатаСледующегоПлатежа
	|ПОМЕСТИТЬ ВТ_ДатыСледующихПлатежей
	|ИЗ
	|	Документ.уб_СтраховойПолис.Платежи КАК уб_СтраховойПолисПлатежи
	|ГДЕ
	|	уб_СтраховойПолисПлатежи.Ссылка.Проведен
	|	И уб_СтраховойПолисПлатежи.Сумма > 0
	|	И уб_СтраховойПолисПлатежи.Дата МЕЖДУ &НачалоДня И &КонецПериода
	|	И уб_СтраховойПолисПлатежи.Ссылка.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.Действует)
	|	И уб_СтраховойПолисПлатежи.Ссылка.Агент ССЫЛКА Справочник.ФизическиеЛица
	|	И 2 = 2
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_СтраховойПолисПлатежи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыСледующихПлатежей.СтраховойПолис,
	|	МАКСИМУМ(ВТ_ДатыСледующихПлатежей.ДатаСледующегоПлатежа) КАК ДатаСледующегоПлатежа,
	|	СУММА(уб_СтраховойПолисПлатежи.Сумма) КАК ПлановаяСуммаОплат
	|ПОМЕСТИТЬ ВТ_ПлановыеПлатежи
	|ИЗ
	|	ВТ_ДатыСледующихПлатежей КАК ВТ_ДатыСледующихПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.Платежи КАК уб_СтраховойПолисПлатежи
	|		ПО ВТ_ДатыСледующихПлатежей.СтраховойПолис = уб_СтраховойПолисПлатежи.Ссылка
	|			И ВТ_ДатыСледующихПлатежей.ДатаСледующегоПлатежа >= уб_СтраховойПолисПлатежи.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыСледующихПлатежей.СтраховойПолис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлановыеПлатежи.СтраховойПолис,
	|	МАКСИМУМ(ВТ_ПлановыеПлатежи.ДатаСледующегоПлатежа) КАК ДатаСледующегоПлатежа,
	|	МАКСИМУМ(ВТ_ПлановыеПлатежи.ПлановаяСуммаОплат) КАК ПлановаяСуммаОплат,
	|	СУММА(уб_ОплатаПолисов.НачисленнаяСуммаВзноса) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_Оплаты
	|ИЗ
	|	ВТ_ПлановыеПлатежи КАК ВТ_ПлановыеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|		ПО ВТ_ПлановыеПлатежи.СтраховойПолис = уб_ОплатаПолисов.СтраховойПолис
	|			И (уб_ОплатаПолисов.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлановыеПлатежи.СтраховойПолис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оплаты.СтраховойПолис,
	|	ВТ_Оплаты.ДатаСледующегоПлатежа,
	|	ВТ_Оплаты.ПлановаяСуммаОплат - ВТ_Оплаты.Оплачено КАК КОплате,
	|	ВТ_Оплаты.СтраховойПолис.Агент КАК Агент
	|ПОМЕСТИТЬ ВТ_ПолисыСДолгами
	|ИЗ
	|	ВТ_Оплаты КАК ВТ_Оплаты
	|ГДЕ
	|	ВТ_Оплаты.Оплачено < ВТ_Оплаты.ПлановаяСуммаОплат - &СуммаДопустимогоДолга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис,
	|	уб_СтатусыПролонгацииСрезПоследних.Период,
	|	уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации
	|ПОМЕСТИТЬ ВТ_СтраховыеПолисыСНезакрытымиЗаданиями
	|ИЗ
	|	РегистрСведений.уб_СтатусыПролонгации.СрезПоследних(
	|			,
	|			(СтраховойПолис, ТипЗадания) В
	|				(ВЫБРАТЬ
	|					Т.СтраховойПолис,
	|					ИСТИНА КАК ТипЗадания
	|				ИЗ
	|					ВТ_ПолисыСДолгами КАК Т)) КАК уб_СтатусыПролонгацииСрезПоследних
	|ГДЕ
	|	уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован)
	|	И уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Отказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолисыСДолгами.СтраховойПолис,
	|	ВТ_ПолисыСДолгами.ДатаСледующегоПлатежа,
	|	ВТ_ПолисыСДолгами.КОплате,
	|	ВТ_ПолисыСДолгами.Агент КАК Агент
	|ИЗ
	|	ВТ_ПолисыСДолгами КАК ВТ_ПолисыСДолгами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтраховыеПолисыСНезакрытымиЗаданиями КАК ВТ_СтраховыеПолисыСНезакрытымиЗаданиями
	|		ПО ВТ_ПолисыСДолгами.СтраховойПолис = ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.СтраховойПолис
	|ГДЕ
	|	ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.СтраховойПолис ЕСТЬ NULL 
	|	И (&Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ ВТ_ПолисыСДолгами.СтраховойПолис.Агент = &Агент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ЗаданияНаПролонгацию.СтраховойПолис,
	|	уб_ЗаданияНаПролонгацию.ДатаЗакрытия,
	|	уб_ЗаданияНаПролонгацию.Ответственный КАК ТекОтветственный
	|ПОМЕСТИТЬ ВТ_НеЗакрытыеЗаданияОчередногоПлатежа
	|ИЗ
	|	РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|ГДЕ
	|	уб_ЗаданияНаПролонгацию.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован)
	|	И уб_ЗаданияНаПролонгацию.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Отказ)
	|	И уб_ЗаданияНаПролонгацию.ТипЗадания = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис,
	|	СУММА(уб_СтраховойПолисПлатежи.Сумма) КАК ПлановаяСуммаОплат
	|ПОМЕСТИТЬ ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий
	|ИЗ
	|	Документ.уб_СтраховойПолис.Платежи КАК уб_СтраховойПолисПлатежи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеЗакрытыеЗаданияОчередногоПлатежа КАК ВТ_НеЗакрытыеЗаданияОчередногоПлатежа
	|		ПО уб_СтраховойПолисПлатежи.Ссылка = ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис
	|			И (ВЫБОР
	|				КОГДА &ТекущаяДата < ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.ДатаЗакрытия
	|					ТОГДА уб_СтраховойПолисПлатежи.Дата <= ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.ДатаЗакрытия
	|				ИНАЧЕ уб_СтраховойПолисПлатежи.Дата <= &ТекущаяДата
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий.СтраховойПолис,
	|	МАКСИМУМ(ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий.ПлановаяСуммаОплат) КАК ПлановаяСуммаОплат,
	|	СУММА(уб_ОплатаПолисов.НачисленнаяСуммаВзноса) КАК Оплачено
	|ПОМЕСТИТЬ ВТ_ОплатыПоНеЗакрытымЗаданиям
	|ИЗ
	|	ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий КАК ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|		ПО ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий.СтраховойПолис = уб_ОплатаПолисов.СтраховойПолис
	|			И (уб_ОплатаПолисов.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлановаяСуммаОплатНеЗакрытыхЗаданий.СтраховойПолис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОплатыПоНеЗакрытымЗаданиям.СтраховойПолис
	|ПОМЕСТИТЬ ВТ_ЗакрытьЗаданияОчередногоПлатежа
	|ИЗ
	|	ВТ_ОплатыПоНеЗакрытымЗаданиям КАК ВТ_ОплатыПоНеЗакрытымЗаданиям
	|ГДЕ
	|	ВТ_ОплатыПоНеЗакрытымЗаданиям.Оплачено >= ВТ_ОплатыПоНеЗакрытымЗаданиям.ПлановаяСуммаОплат - &СуммаДопустимогоДолга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗакрытьЗаданияОчередногоПлатежа.СтраховойПолис
	|ИЗ
	|	ВТ_ЗакрытьЗаданияОчередногоПлатежа КАК ВТ_ЗакрытьЗаданияОчередногоПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис,
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис.Агент КАК Агент,
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.ТекОтветственный,
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.ДатаЗакрытия,
	|	ВЫБОР
	|		КОГДА ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.СтатусПролонгации = &СтатусВРаботе
	|				И РАЗНОСТЬДАТ(ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.Период, &ТекущаяДата, ДЕНЬ) >= &КоличествоДнейДляПовторногоЗадания
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК неиспСоздатьПовторноеЗадание,
	|	РАЗНОСТЬДАТ(ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.Период, &ТекущаяДата, ДЕНЬ) КАК КоличествоДней,
	|	ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.СтатусПролонгации
	|ИЗ
	|	ВТ_НеЗакрытыеЗаданияОчередногоПлатежа КАК ВТ_НеЗакрытыеЗаданияОчередногоПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакрытьЗаданияОчередногоПлатежа КАК ВТ_ЗакрытьЗаданияОчередногоПлатежа
	|		ПО ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис = ВТ_ЗакрытьЗаданияОчередногоПлатежа.СтраховойПолис
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтраховыеПолисыСНезакрытымиЗаданиями КАК ВТ_СтраховыеПолисыСНезакрытымиЗаданиями
	|		ПО ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис = ВТ_СтраховыеПолисыСНезакрытымиЗаданиями.СтраховойПолис
	|ГДЕ
	|	ВТ_ЗакрытьЗаданияОчередногоПлатежа.СтраховойПолис ЕСТЬ NULL 
	|	И (&Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ ВТ_НеЗакрытыеЗаданияОчередногоПлатежа.СтраховойПолис.Агент = &Агент)";
	Запрос.УстановитьПараметр("Агент", 					Агент);
	Запрос.УстановитьПараметр("КоличествоДней", 					КоличествоДней);
	Запрос.УстановитьПараметр("КоличествоДнейДляПовторногоЗадания", КоличествоДнейДляПовторногоЗадания);
	Запрос.УстановитьПараметр("ТекущаяДата", 						ТекДата);
	Запрос.УстановитьПараметр("НачалоДня", 							НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("КонецПериода", 						КонецДня(НачалоДня(ТекДата) + КоличествоДнейДоОчередногоПлатежа * 86400));
	Запрос.УстановитьПараметр("СтатусВРаботе",	 					СтатусВРаботе);
	Запрос.УстановитьПараметр("СуммаДопустимогоДолга", 				СуммаДопустимогоДолга);	
	//+++не создавать задания по полисам, у которых: номер заявки - личная или вид страхового продукта НС или ДСАГО
	//задания на пролонгацию
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "уб_СтраховойПолис.СтраховойПродукт.Вид <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|И уб_СтраховойПолис.СтраховойПродукт.Вид <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДСАГО)");
	//|И уб_СтраховойПолис.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Личная)
	//|И уб_СтраховойПолис.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Агентская)");
	//задания на очередной платеж
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "уб_СтраховойПолисПлатежи.Ссылка.СтраховойПродукт.Вид <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|И уб_СтраховойПолисПлатежи.Ссылка.СтраховойПродукт.Вид <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДСАГО)");
	//|И уб_СтраховойПолисПлатежи.Ссылка.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Личная)
	//|И уб_СтраховойПолисПлатежи.Ссылка.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Агентская)");
	//---не создавать задания по полисам, у которых: номер заявки - личная или вид страхового продукта НС или ДСАГО
	Пакет = Запрос.ВыполнитьПакет();
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	//добавление новых задания на пролонгацию
	ТаблицаСП = Пакет[0].Выгрузить();
	Поиск = Новый Структура("Подразделение");
	ВыборкаРуководителейПодразделений = Пакет[1].Выбрать();	
	Выборка = Пакет[2].Выбрать();
	Если Выборка.Следующий() Тогда
		ПервыйРабочийДень = Выборка.ПервыйРабочийДень;
	Иначе
		ПервыйРабочийДень = ТекДата;
	КонецЕсли;
	ТаблицаЗаданийДляПовторнойОбработки = Пакет[5].Выгрузить();	
	Если ТаблицаСП.Количество() > 0 Тогда
		уб_temp.ПолучитьПреемникаСотрудника(ТаблицаСП, "Агент");
		Для Каждого СтрокаТЗ Из ТаблицаСП Цикл
			Менеджер = СтрокаТЗ.Агент;
			Уволен = Ложь;
			ПодразделениеМенеджера = уб_СС.ПолучитьПодразделениеАгента(Менеджер, ТекДата, Истина, Уволен);
			Если Уволен Тогда
				Поиск.Подразделение = ПодразделениеМенеджера;
				ВыборкаРуководителейПодразделений.Сбросить();
				Если ВыборкаРуководителейПодразделений.НайтиСледующий(Поиск) Тогда
					Менеджер = ВыборкаРуководителейПодразделений.Сотрудник;
				КонецЕсли;
			КонецЕсли;
			МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.Ссылка;
			МенеджерЗаписи.ТипЗадания = Ложь;
			МенеджерЗаписи.Ответственный = Менеджер;
			МенеджерЗаписи.Автор = ТекПользователь;
			МенеджерЗаписи.Записать();			
			МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекДата;
			МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.Ссылка;
			МенеджерЗаписи.ТипЗадания = Ложь;
			МенеджерЗаписи.Комментарий = "Выставлено менеджеру " + Менеджер;
			МенеджерЗаписи.Автор = ТекПользователь;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
	//закрытие заданий
	ВыборкаЗаданийДляЗакрытия = Пакет[4].Выбрать();
	Пока ВыборкаЗаданийДляЗакрытия.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СтраховойПолис = ВыборкаЗаданийДляЗакрытия.СтарыйСтраховойПолис;
		МенеджерЗаписи.ТипЗадания = Ложь;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Автор = ТекПользователь;
		МенеджерЗаписи.НовыйПолис = ВыборкаЗаданийДляЗакрытия.НовыйСтраховойПолис;
		МенеджерЗаписи.ДатаЗакрытия = ТекДата;
		МенеджерЗаписи.ТекущийСтатус = Перечисления.уб_СтатусыПролонгирования.Пролонгирован;
		МенеджерЗаписи.Записать();		
		МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекДата;
		МенеджерЗаписи.СтраховойПолис = ВыборкаЗаданийДляЗакрытия.СтарыйСтраховойПолис;
		МенеджерЗаписи.ТипЗадания = Ложь;
		МенеджерЗаписи.Комментарий = "Страховой полис пролонгирован";
		МенеджерЗаписи.СтатусПролонгации = Перечисления.уб_СтатусыПролонгирования.Пролонгирован;
		МенеджерЗаписи.Автор = ТекПользователь;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	//проверка ответственных и создание повторных заданий
	Если ТаблицаЗаданийДляПовторнойОбработки.Количество() > 0 Тогда
		уб_temp.ПолучитьПреемникаСотрудника(ТаблицаЗаданийДляПовторнойОбработки, "ТекОтветственный");
		Для Каждого СтрокаТЗ Из ТаблицаЗаданийДляПовторнойОбработки Цикл
			Менеджер = СтрокаТЗ.ТекОтветственный;
			Уволен = Ложь;
			
			ПодразделениеМенеджера = уб_СС.ПолучитьПодразделениеАгента(Менеджер, ТекДата, Истина, Уволен);
			РуководительПодразделения = Неопределено;
			
			Поиск.Подразделение = ПодразделениеМенеджера;
			ВыборкаРуководителейПодразделений.Сбросить();
			Если ВыборкаРуководителейПодразделений.НайтиСледующий(Поиск) Тогда
				РуководительПодразделения = ВыборкаРуководителейПодразделений.Сотрудник;
			КонецЕсли;
			Если Менеджер = РуководительПодразделения Тогда
				// Возможно появился новый преемник
				 ТекПреемник= уб_temp.ПолучитьПреемникаСотрудника(СтрокаТЗ.Агент);
				 
				 ПодразделениеПреемника = уб_СС.ПолучитьПодразделениеАгента(ТекПреемник, ТекДата, Истина, Уволен);
				 Поиск.Подразделение = ПодразделениеПреемника;
				 ВыборкаРуководителейПодразделений.Сбросить();
				 Если ВыборкаРуководителейПодразделений.НайтиСледующий(Поиск) Тогда
					 РуководительПодразделения = ВыборкаРуководителейПодразделений.Сотрудник;
				 КонецЕсли;
				 Если Уволен = Ложь Тогда
					 Менеджер = ТекПреемник;
				 Иначе
					 Менеджер = РуководительПодразделения;
				 КонецЕсли;
			Иначе
				Если Уволен Тогда
				     Менеджер = РуководительПодразделения;
				КонецЕсли;	
			КонецЕсли;
			
			
			
			МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.Ссылка;
			МенеджерЗаписи.ТипЗадания = Ложь;
			МенеджерЗаписи.Прочитать();
			Если Менеджер <> МенеджерЗаписи.Ответственный Тогда
				Комментарий = "Передано с " + МенеджерЗаписи.Ответственный + " " + Менеджер;
				МенеджерЗаписи.Ответственный = Менеджер;
				МенеджерЗаписи.Автор = ТекПользователь;
				МенеджерЗаписи.Записать();
				Запись = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
				Запись.Период				= ТекДата;
				Запись.СтраховойПолис 		= СтрокаТЗ.Ссылка;
				Запись.ТипЗадания			= МенеджерЗаписи.ТипЗадания;
				Запись.СтатусПролонгации    = СтрокаТЗ.СтатусПролонгации;
				Запись.Комментарий			= Комментарий;
				Запись.Автор				= ПараметрыСеанса.ТекущийПользователь;
				Запись.КонтрольнаяДата		= СтрокаТЗ.КонтрольнаяДата;
				Запись.Записать();
			КонецЕсли;
			//Теперь это не используется
			//Если СтрокаТЗ.СоздатьПовторноеЗадание Тогда
			//	МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
			//	МенеджерЗаписи.Период = ПервыйРабочийДень;
			//	МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.Ссылка;
			//	МенеджерЗаписи.ТипЗадания = Ложь;
			//	МенеджерЗаписи.Комментарий = "Прошло " + Строка(СтрокаТЗ.КоличествоДней) + " дней работы по пролонгации";
			//	МенеджерЗаписи.СтатусПролонгации = СтатусВРаботе;
			//	МенеджерЗаписи.Автор = ТекПользователь;
			//	МенеджерЗаписи.Записать();
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//создание заданий очередных оплат
	ТаблицаЗаданийОчередныхОплат = Пакет[11].Выгрузить();
	Если ТаблицаЗаданийОчередныхОплат.Количество() > 0 Тогда
		уб_temp.ПолучитьПреемникаСотрудника(ТаблицаЗаданийОчередныхОплат, "Агент");
		Для Каждого СтрокаТЗ Из ТаблицаЗаданийОчередныхОплат Цикл
			Менеджер = СтрокаТЗ.Агент;
			Уволен = Ложь;
			ПодразделениеМенеджера = уб_СС.ПолучитьПодразделениеАгента(Менеджер, ТекДата, Истина, Уволен);
			Если Уволен Тогда
				Поиск.Подразделение = ПодразделениеМенеджера;
				ВыборкаРуководителейПодразделений.Сбросить();
				Если ВыборкаРуководителейПодразделений.НайтиСледующий(Поиск) Тогда
					Менеджер = ВыборкаРуководителейПодразделений.Сотрудник;
				КонецЕсли;
			КонецЕсли;
			МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтраховойПолис 	= СтрокаТЗ.СтраховойПолис;
			МенеджерЗаписи.ТипЗадания 		= Истина;
			МенеджерЗаписи.Ответственный 	= Менеджер;
			МенеджерЗаписи.Автор 			= ТекПользователь;
			МенеджерЗаписи.ДатаЗакрытия 	= СтрокаТЗ.ДатаСледующегоПлатежа;
			МенеджерЗаписи.Записать();
			МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период 			= ТекДата;
			МенеджерЗаписи.СтраховойПолис 	= СтрокаТЗ.СтраховойПолис;
			МенеджерЗаписи.ТипЗадания 		= Истина;
			МенеджерЗаписи.Автор 			= ТекПользователь;
			МенеджерЗаписи.Комментарий 		= "Выставлено менеджеру";
			МенеджерЗаписи.Записать();		
		КонецЦикла;
	КонецЕсли;
	
	//закрытие заданий очередных оплат
	ВыборкаЗакрытиеЗаданийОчередныхОплат = Пакет[16].Выбрать();
	Пока ВыборкаЗакрытиеЗаданийОчередныхОплат.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекДата;
		МенеджерЗаписи.СтраховойПолис = ВыборкаЗакрытиеЗаданийОчередныхОплат.СтраховойПолис;
		МенеджерЗаписи.ТипЗадания = Истина;
		МенеджерЗаписи.СтатусПролонгации = Перечисления.уб_СтатусыПролонгирования.Пролонгирован;
		МенеджерЗаписи.Автор = ТекПользователь;
		//МенеджерЗаписи.Комментарий = "";
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	//замена ответственных на преемника у заданий очередных платежей и создание повторных заданий
	ТаблицаЗаменаОтветственных = Пакет[17].Выгрузить();
	Если ТаблицаЗаменаОтветственных.Количество() > 0 Тогда
		уб_temp.ПолучитьПреемникаСотрудника(ТаблицаЗаменаОтветственных, "Агент");
		Для Каждого СтрокаТЗ Из ТаблицаЗаменаОтветственных Цикл
			Менеджер = СтрокаТЗ.Агент;
			Уволен = Ложь;
			ПодразделениеМенеджера = уб_СС.ПолучитьПодразделениеАгента(Менеджер, ТекДата, Истина, Уволен);
			Если Уволен Тогда
				Поиск.Подразделение = ПодразделениеМенеджера;
				ВыборкаРуководителейПодразделений.Сбросить();
				Если ВыборкаРуководителейПодразделений.НайтиСледующий(Поиск) Тогда
					Менеджер = ВыборкаРуководителейПодразделений.Сотрудник;
				КонецЕсли;
			КонецЕсли;
			МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.СтраховойПолис;
			МенеджерЗаписи.ТипЗадания = Истина;
			МенеджерЗаписи.Прочитать();
			Если Менеджер <> МенеджерЗаписи.Ответственный Тогда
				Комментарий = "Передано с " + МенеджерЗаписи.Ответственный + " " + Менеджер;
				МенеджерЗаписи.Ответственный = Менеджер;
				МенеджерЗаписи.Автор = ТекПользователь;
				МенеджерЗаписи.Записать();
				Отбор = Новый Структура;
				Отбор.Вставить("СтраховойПолис", СтрокаТЗ.СтраховойПолис);
				Отбор.Вставить("ТипЗадания",	 МенеджерЗаписи.ТипЗадания);
				СтруктураРесурсов = РегистрыСведений.уб_СтатусыПролонгации.ПолучитьПоследнее(ТекДата, Отбор);
				Запись = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
				Запись.Период				= ТекДата;
				Запись.СтраховойПолис 		= СтрокаТЗ.СтраховойПолис;
				Запись.ТипЗадания			= МенеджерЗаписи.ТипЗадания;
				Запись.СтатусПролонгации    = СтрокаТЗ.СтатусПролонгации;
				Запись.Комментарий			= Комментарий;
				Запись.Автор				= ПараметрыСеанса.ТекущийПользователь;
				Запись.КонтрольнаяДата		= СтруктураРесурсов.КонтрольнаяДата;
				Запись.Записать();
			КонецЕсли;
			//Теперь это не используется
			//Если СтрокаТЗ.СоздатьПовторноеЗадание Тогда
			//	МенеджерЗаписи = РегистрыСведений.уб_СтатусыПролонгации.СоздатьМенеджерЗаписи();
			//	МенеджерЗаписи.Период = ПервыйРабочийДень;
			//	МенеджерЗаписи.СтраховойПолис = СтрокаТЗ.СтраховойПолис;
			//	МенеджерЗаписи.ТипЗадания = Истина;
			//	МенеджерЗаписи.Комментарий = "Прошло " + Строка(СтрокаТЗ.КоличествоДней) + " дней работы по заданию получения очередной оплаты";
			//	МенеджерЗаписи.СтатусПролонгации = СтатусВРаботе;
			//	МенеджерЗаписи.Автор = ТекПользователь;
			//	МенеджерЗаписи.Записать();
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАктуальностьПериодаПоСрочнымОшибкам() Экспорт

	РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.ИзменениеАктуальностиПоСрочнымОшибкам();

КонецПроцедуры

Процедура УстановкаФлагаПредоставленРегистраПредоставленныхДокументов() Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПД.ВидДокумента КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА СП.Заявка.СозданНаОсновании <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|			ТОГДА СП.Заявка.СозданНаОсновании
	|		ИНАЧЕ СП.Заявка
	|	КОНЕЦ КАК Заявка,
	|	СП.ОбъектСтрахования
	|ПОМЕСТИТЬ ВТ_Предоставленные
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК СП
	|		ПО ПД.Объект = СП.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СП.Заявка.СозданНаОсновании <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|				ТОГДА СП.Заявка.СозданНаОсновании
	|			ИНАЧЕ СП.Заявка
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|	И НЕ ПД.ВидДокумента.НеСвязанСОбъектомСтрахования
	|
	|СГРУППИРОВАТЬ ПО
	|	ПД.ВидДокумента,
	|	ВЫБОР
	|		КОГДА СП.Заявка.СозданНаОсновании <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|			ТОГДА СП.Заявка.СозданНаОсновании
	|		ИНАЧЕ СП.Заявка
	|	КОНЕЦ,
	|	СП.ОбъектСтрахования
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ПД.Предоставлен) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПД.Объект КАК Объект,
	|	ПД.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК ПД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК СП
	|		ПО ПД.Объект = СП.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Предоставленные КАК ВТ_Предоставленные
	|		ПО (ВТ_Предоставленные.Заявка = ВЫБОР
	|				КОГДА СП.Заявка.СозданНаОсновании <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|					ТОГДА СП.Заявка.СозданНаОсновании
	|				ИНАЧЕ СП.Заявка
	|			КОНЕЦ)
	|			И (ВТ_Предоставленные.ОбъектСтрахования = СП.ОбъектСтрахования)
	|			И ПД.ВидДокумента = ВТ_Предоставленные.ВидДокумента
	|ГДЕ
	|	ПД.Используется
	|	И НЕ ПД.Предоставлен
	|	И НЕ ПД.ВидДокумента.НеСвязанСОбъектомСтрахования");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.уб_ПредоставленныеДокументыСП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.Предоставлен = Истина;
				Если ПустаяСтрока(Запись.Комментарий) Тогда
					Запись.Комментарий	= "Автоматически регламентным заданием";
				КонецЕсли;
				Попытка
					Запись.Записать();
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка записи в регистр сведений предоставленных документов во время регламентного задания УстановкаФлагаПредоставленРегистраПредоставленныхДокументов: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура ЗакрытьОчередь(Ссылка,ТипОчереди) Экспорт
	МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект 		= Ссылка;
	МенеджерЗаписи.ТипОчереди 	= ТипОчереди;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;	
КонецПроцедуры

Процедура ОшибкаОчереди(Ссылка,ТипОчереди) Экспорт
	МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект 		= Ссылка;
	МенеджерЗаписи.ТипОчереди 	= ТипОчереди;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.КоличествоПопытокВыполнения= МенеджерЗаписи.КоличествоПопытокВыполнения+1;
		МенеджерЗаписи.Записать();
	КонецЕсли;	
КонецПроцедуры


Процедура ОбработатьОчередьПриемкиКЗаявкам(Запрос = Неопределено) Экспорт
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	КонецЕсли;	
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 100);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_Очередь.Объект,
	|	уб_Очередь.Объект.Представление,
	|	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	|ИЗ
	|	РегистрСведений.уб_Очередь КАК уб_Очередь
	|ГДЕ
	|	(уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	|			ИЛИ уб_Очередь.КоличествоПопытокВыполнения = 100)
	|	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.СозданиеПриемок)";
	
	ВсеДокументы = Запрос.Выполнить().Выбрать();
	
	КэшПриемок = Новый Соответствие;
	Пока ВсеДокументы.Следующий() Цикл
		Документы.уб_ПриемкаОплат.СоздатьПриемкуКЗаявке(ВсеДокументы.Объект,КэшПриемок);
	КонецЦикла;	
КонецПроцедуры


Процедура ОбработатьОчередьСозданиеПолисов(Запрос = Неопределено) Экспорт
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	КонецЕсли;	
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 100);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.Объект.Представление,
	               |	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |ГДЕ
	               |	(уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	               |			ИЛИ уб_Очередь.КоличествоПопытокВыполнения = 100)
	               |	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.СозданиеПолисов)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ПриемкаОплатПолисы.Ссылка,
	               |	уб_ПриемкаОплатПолисы.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(уб_ПриемкаОплатПолисы.Ссылка)
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
	               |		ПО уб_ПриемкаОплатПолисы.УИДСтроки = уб_КвитовкаОплат.УИДСтрокиТЧ
	               |ГДЕ
	               |	уб_ПриемкаОплатПолисы.Ссылка.ОтчетКассира.Подтверждено = ИСТИНА
	               |	И уб_ПриемкаОплатПолисы.Ссылка.Дата >= &Дата1
	               |	И уб_КвитовкаОплат.ОплатаПолиса ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата()-24*3600*35);
	ВсеДокументы = Запрос.Выполнить().Выбрать();
	
	Пока ВсеДокументы.Следующий() Цикл
		Документы.уб_ПриемкаОплат.СоздатьПолисыКПриемке(ВсеДокументы.Объект);
	КонецЦикла;	
КонецПроцедуры


Процедура ОбработатьОчередьВыгрузкаВоВнешнююСистему(Запрос = Неопределено) Экспорт
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	КонецЕсли;	
	Запрос.УстановитьПараметр("КоличествоПопытокВыполнения", 100);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_Очередь.Объект,
	|	уб_Очередь.Объект.Представление,
	|	ТИПЗНАЧЕНИЯ(уб_Очередь.Объект) КАК ТипДокумента
	|ИЗ
	|	РегистрСведений.уб_Очередь КАК уб_Очередь
	|ГДЕ
	|	(уб_Очередь.КоличествоПопытокВыполнения < &КоличествоПопытокВыполнения
	|			ИЛИ уб_Очередь.КоличествоПопытокВыполнения = 100)
	|	И уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему)";
	
	ВсеДокументы = Запрос.Выполнить().Выбрать();
	
	ОбработкаВыгрузки = Обработки.ВыгрузкаДанныхВоВнешнююСистему.Создать();
	ОбработкаВыгрузки.Инициализировать();
	ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
	Пока ВсеДокументы.Следующий() Цикл
		Если ОбработкаВыгрузки.ОтправитьСсылку(ВсеДокументы.Объект) = Истина Тогда 
			ЗакрытьОчередь(ВсеДокументы.Объект,ТипОчереди);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры


Процедура СоздатьТекстовыйФайл(ИмяФайла,Текст) Экспорт
	
	Попытка
		fso = Новый COMОбъект("Scripting.FileSystemObject");                                                          
		file = fso.CreateTextFile(ИмяФайла, -1, 0); //создать файл, перезаписывая существующий.
		file.Write(Текст); 
		file.Close(); 
	Исключение
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка создания текстового файла: " + ИмяФайла + " Текст ошибки: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина, , , );	
	КонецПопытки;	
	
КонецПроцедуры
