////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	Движения.уб_ДвиженияБСО.Очистить();
	Движения.уб_БлокировкаБСО.Очистить();	
	ГраницаДокумента = Новый Граница(МоментВремени(),ВидГраницы.Исключая);	
	//Признак того, что данное движение должно быть записано КАК ЕСТЬ (только для информации с соответствующими флажками)
	ИнфоЗапись = НЕ Ссылка.Проведен;		
	Для Каждого СтрокаТЧ Из БСО Цикл				
		Если ЗначениеЗаполнено(СокрЛП(СтрокаТЧ.НомерБСО)) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО НОМЕРНОГО УЧЕТА
			// сначала проверим, а есть ли такой БСО в указанном месте
			//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО", СтрокаТЧ.СК, СтрокаТЧ.ВидБСО, СтрокаТЧ.НомерБСО);			
			ЕстьВНаличие = ИнфоЗапись;
			//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(ГраницаДокумента, СтруктураОтбора);			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	*
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
			|			&Период,
			|			ВидБСО = &ВидБСО
			|				И НомерБСО = &НомерБСО
			//|				И СК = &СК
			|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			Запрос.УстановитьПараметр("ВидБСО", 	СтрокаТЧ.ВидБСО);
			Запрос.УстановитьПараметр("НомерБСО", 	СтрокаТЧ.НомерБСО);
			//Запрос.УстановитьПараметр("СК", 		СтрокаТЧ.СК);
			Запрос.УстановитьПараметр("Период", 	ГраницаДокумента);
			//зачем?
			//Если НЕ ИнфоЗапись Тогда
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Подтверждено");
			//КонецЕсли;			
			тзРег = Запрос.Выполнить().Выгрузить();			
			ЗаписьРег = Неопределено;
			Если тзРег.Количество() > 0 Тогда
				//Если тзРег.Количество() > 1 Тогда
				//	тзРег.Сортировать("Период УБЫВ")
				//КонецЕсли;
				ЗаписьРег = тзРег[0];
				Если НЕ ИнфоЗапись Тогда
					//Если ЗаписьРег.Подразделение = Подразделение Тогда
						Если уб_СтраховойБрокер.ПоложениеЕстьВНаличие(ЗаписьРег.ПоложениеБСО) Тогда
							ЕстьВНаличие = Истина;
						Иначе
							СтрокаСообщения = "БСО "+Строка(СтрокаТЧ.ВидБСО)+" с номером `" + СтрокаТЧ.НомерБСО + "` имеет состояние:  "+Строка(ЗаписьРег.ПоложениеБСО)+", "+Строка(ЗаписьРег.СостояниеБСО)+". Перемещение невозможно!";
							ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
							Возврат;
						КонецЕсли; 		
					//КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО = Истина И НЕ ЕстьВНаличие Тогда
				СтрокаСообщения = "БСО с номером `" + СтрокаТЧ.НомерБСО + "` нет в наличии. Перемещение невозможно!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				Возврат;
			КонецЕсли; 
			//Если НЕ ИнфоЗапись И ЗаписьРег.Блокировка = СтрокаТЧ.Блокировка Тогда
			//	// запись в регистр делать не нужно
			//	Продолжить;
			//КонецЕсли;
			Движение = Движения.уб_ДвиженияБСО.Добавить();
			Движение.Период 	= Дата;
			Движение.СК 		= СтрокаТЧ.СК;
			Если ЗаписьРег <> Неопределено Тогда
				Движение.Поставщик		= ЗаписьРег.Поставщик;
				Движение.НомерПолиса	= ЗаписьРег.НомерПолиса;
				Движение.ГодПолиса		= ЗаписьРег.ГодПолиса;
				Движение.ПоложениеБСО	= ЗаписьРег.ПоложениеБСО;
				Движение.СостояниеБСО	= ЗаписьРег.СостояниеБСО;
				Движение.СтраховойПолис	= ЗаписьРег.СтраховойПолис;
				Движение.ДопНомерБСО= ЗаписьРег.ДопНомерБСО;
			КонецЕсли;
			Движение.ВидБСО				= СтрокаТЧ.ВидБСО;
			Движение.НомерБСО 			= СтрокаТЧ.НомерБСО;
			Движение.Агент				= Агент;
			Движение.ОрганизацияАгент 	= ОрганизацияАгент;
			Движение.КодОперации		= Перечисления.уб_КодыОперацийБСО.БлокировкаБСО;
			Движение.Подтверждено   	= Истина;
			Движение.Активность			= Ссылка.Проведен;
			Движение.НаОснованииБумажногоДокумента = Ссылка.НаОсновеБумажногоДокумента;			                                        
		Иначе
			СтрокаСообщения = "Не указан номер БСО " + СтрокаТЧ.ВидБСО + ", строка "+Строка(СтрокаТЧ.НомерСтроки)+" ";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
			Возврат;
		КонецЕсли;		
	КонецЦикла;
	Движения.уб_ДвиженияБСО.Записать();
	//по регистру блокировка БСО
	Если Не Отказ И Не ИнфоЗапись Тогда
		Для Каждого СтрокаТЧ Из БСО Цикл
			Движение = Движения.уб_БлокировкаБСО.Добавить();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение,СтрокаТЧ);
		КонецЦикла;	
	КонецЕсли;
	Движения.уб_БлокировкаБСО.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли
	
	// Вставить содержимое обработчика.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	

КонецПроцедуры