Перем ДействиеСПланом Экспорт;

Процедура ЗаписьВРегистрСведений_уб_ЗП_Схема_ПланПоСКВ_Планы(ДействиеСПланом = Неопределено , ТекущаяЗапись, ТекПериод) Экспорт

	Если ДействиеСПланом = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
		
	НачалоТекущегоМесяца	= НачалоМесяца(ТекПериод);
	КонецТекущегоМесяца		= КонецМесяца(ТекПериод);
	НачалоПрошлогоМесяца	= НачалоМесяца(НачалоМесяца(ТекПериод)-60*60*24*15);
	КонецПрошлогоМесяца		= КонецМесяца(НачалоМесяца(ТекПериод)-60*60*24*15);
	
	СтруктураДляМЗ = Новый Структура("Организация, Подразделение, Агент");
	
	Если ЗначениеЗаполнено(ТекущаяЗапись.Агент) Тогда
		СтруктураДляМЗ.Организация		= Справочники.Организации.ПустаяСсылка();
		СтруктураДляМЗ.Подразделение	= Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		СтруктураДляМЗ.Агент			= ТекущаяЗапись.Агент;
	ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Подразделение) Тогда
		СтруктураДляМЗ.Организация		= Справочники.Организации.ПустаяСсылка();
		СтруктураДляМЗ.Подразделение	= ТекущаяЗапись.Подразделение;
		СтруктураДляМЗ.Агент			= Справочники.ФизическиеЛица.ПустаяСсылка();
	ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Организация) Тогда
		СтруктураДляМЗ.Организация		= ТекущаяЗапись.Организация;
		СтруктураДляМЗ.Подразделение	= Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		СтруктураДляМЗ.Агент			= Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если ДействиеСПланом = "Назначение" Тогда 
		
		//удаляем план, если он на КонецПрошлогоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			Если МЗ.План = ТекущаяЗапись.План 
				И МЗ.Количество = ТекущаяЗапись.Количество 
				И СокрЛП(МЗ.Комментарий) = СокрЛП(ТекущаяЗапись.Комментарий) 
				И МЗ.ПланПролонгация = ТекущаяЗапись.ПланПролонгация 
				И МЗ.ПланНовыйБизнес = ТекущаяЗапись.ПланНовыйБизнес 
				Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.План			= ТекущаяЗапись.План;
		МЗ.ПланПролонгация = ТекущаяЗапись.ПланПролонгация;
		МЗ.ПланНовыйБизнес = ТекущаяЗапись.ПланНовыйБизнес; 
		МЗ.Количество	= ТекущаяЗапись.Количество;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли ДействиеСПланом = "Изменение" Тогда 
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		//МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		//МЗ.Период = НачалоПрошлогоМесяца;
		//МЗ.Прочитать();
		//Если МЗ.Выбран() Тогда
		//	Если МЗ.План = ТекущаяЗапись.План Тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		Срез = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СрезПоследних(НачалоТекущегоМесяца,СтруктураДляМЗ);
		Если Срез.Количество()>0 Тогда
			Если Срез[0].План = ТекущаяЗапись.План 
				и Срез[0].ПланПролонгация = ТекущаяЗапись.ПланПролонгация 
				и Срез[0].ПланНовыйБизнес = ТекущаяЗапись.ПланНовыйБизнес 
				И Срез[0].Количество = ТекущаяЗапись.Количество 
				И СокрЛП(Срез[0].Комментарий) = СокрЛП(ТекущаяЗапись.Комментарий) Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		//перезаписываем/создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.План			= ТекущаяЗапись.План;
		МЗ.ПланПролонгация = ТекущаяЗапись.ПланПролонгация;
		МЗ.ПланНовыйБизнес = ТекущаяЗапись.ПланНовыйБизнес; 
		МЗ.Количество	= ТекущаяЗапись.Количество;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли ДействиеСПланом = "Отключение" Тогда 
		
		//удаляем план, если он на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если на КонецТекущегоМесяца есть отключенная запись, то удаляем ее
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если теперь СрезПоследних на НачалоТекущегоМесяца = недействующий план, то ничего не добавляем
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних.План,
					   |	уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних.НеДействует
		               |ИЗ
		               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СрезПоследних(&Дата, ) КАК уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних
		               |ГДЕ
		               |	(1 = 1)";
		Запрос.УстановитьПараметр("Дата",НачалоТекущегоМесяца);
		Если ЗначениеЗаполнено(ТекущаяЗапись.Агент) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних.Агент=&Агент)";
			Запрос.УстановитьПараметр("Агент", ТекущаяЗапись.Агент);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Подразделение) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних.Подразделение=&Подразделение)";
			Запрос.УстановитьПараметр("Подразделение", ТекущаяЗапись.Подразделение);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Организация) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_ПланыСрезПоследних.Организация=&Организация)";
			Запрос.УстановитьПараметр("Организация", ТекущаяЗапись.Организация);
		КонецЕсли;
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			Если ТЗ[ТЗ.Количество()-1].НеДействует=Истина Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
 		//создаем запись на КонецПрошлогоМесяца с флагом "НеДействует=Истина"
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= КонецПрошлогоМесяца;
		МЗ.План			= 0;
		МЗ.ПланПролонгация			= 0;
		МЗ.ПланНовыйБизнес			= 0;
		МЗ.Количество	= 0;
		МЗ.НеДействует	= Истина;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли ДействиеСПланом = "НазначениеСуперплана" Тогда 
		
		//удаляем план, если он на КонецПрошлогоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			Если МЗ.Суперплан = ТекущаяЗапись.Суперплан Тогда
				Возврат;
			Иначе
				Значение1БП = МЗ.ПерваяБонусПланка;
			КонецЕсли;
		КонецЕсли;
		
		//создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.Суперплан	= ТекущаяЗапись.План;
		МЗ.ПерваяБонусПланка  = Значение1БП;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
	ИначеЕсли ДействиеСПланом = "НазначениеПервойБонусПланки" Тогда 
		
		//удаляем план, если он на КонецПрошлогоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			Если МЗ.ПерваяБонусПланка = ТекущаяЗапись.Суперплан Тогда
				Возврат;
			Иначе
				ЗначениеСП = МЗ.Суперплан;
			КонецЕсли;
		КонецЕсли;
		
		//создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.Суперплан	= ЗначениеСП; //Восстанавливаем значение 2 БП
		МЗ.ПерваяБонусПланка = ТекущаяЗапись.План;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
	
		
	ИначеЕсли ДействиеСПланом = "ИзменениеСуперплана" Тогда 
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		//МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		//МЗ.Период = НачалоПрошлогоМесяца;
		//МЗ.Прочитать();
		//Если МЗ.Выбран() Тогда
		//	Если МЗ.Суперплан = ТекущаяЗапись.План Тогда
		//		Возврат;
		//	Иначе
		//		Значение1БП = МЗ.ПерваяБонусПланка;
		//	КонецЕсли;
		//КонецЕсли;
		Структура =  РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.ПолучитьПоследнее(НачалоТекущегоМесяца,СтруктураДляМЗ);
		Если Структура.Суперплан = ТекущаяЗапись.План Тогда
			Возврат;
		КонецЕсли;	
		
		//перезаписываем/создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.Суперплан	= ТекущаяЗапись.План;
		МЗ.ПерваяБонусПланка = Структура.ПерваяБонусПланка;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
	ИначеЕсли ДействиеСПланом = "ИзменениеПервойБонусПланки" Тогда 
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		//МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		//МЗ.Период = НачалоПрошлогоМесяца;
		//МЗ.Прочитать();
		//Если МЗ.Выбран() Тогда
		//	Если МЗ.ПерваяБонусПланка = ТекущаяЗапись.План Тогда
		//		Возврат;
		//	Иначе
		//		ЗначениеСП = МЗ.Суперплан;
		//	КонецЕсли;
		//КонецЕсли;
		Структура =  РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.ПолучитьПоследнее(НачалоТекущегоМесяца,СтруктураДляМЗ);
		Если Структура.ПерваяБонусПланка = ТекущаяЗапись.План Тогда
			Возврат;
		КонецЕсли;	
		
		//перезаписываем/создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.Суперплан	= Структура.Суперплан;
		МЗ.ПерваяБонусПланка = ТекущаяЗапись.План;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
	
	ИначеЕсли ДействиеСПланом = "ОтключениеСуперплана" Тогда 
		
		//удаляем план, если он на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если на КонецТекущегоМесяца есть отключенная запись, то удаляем ее
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если теперь СрезПоследних на НачалоТекущегоМесяца = недействующий план, то ничего не добавляем
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних.СуперПлан,
					   |	уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних.НеДействует
		               |ИЗ
		               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СрезПоследних(&Дата, ) КАК уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних
		               |ГДЕ
		               |	(1 = 1)";
		Запрос.УстановитьПараметр("Дата",НачалоТекущегоМесяца);
		Если ЗначениеЗаполнено(ТекущаяЗапись.Агент) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних.Агент=&Агент)";
			Запрос.УстановитьПараметр("Агент", ТекущаяЗапись.Агент);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Подразделение) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних.Подразделение=&Подразделение)";
			Запрос.УстановитьПараметр("Подразделение", ТекущаяЗапись.Подразделение);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Организация) Тогда
			Запрос.Текст = Запрос.Текст + "И (уб_ЗП_Схема_ПланПоСКВ_СуперПланыСрезПоследних.Организация=&Организация)";
			Запрос.УстановитьПараметр("Организация", ТекущаяЗапись.Организация);
		КонецЕсли;
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			Если ТЗ[ТЗ.Количество()-1].НеДействует=Истина Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
 		//создаем запись на КонецПрошлогоМесяца с флагом "НеДействует=Истина"
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= КонецПрошлогоМесяца;
		МЗ.Суперплан	     = 0;
		МЗ.ПерваяБонусПланка = 0;
		МЗ.НеДействует	= Истина;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли	ДействиеСПланом = "НазначениеПроцента" Тогда 
		
		//удаляем план, если он на КонецПрошлогоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			Если (МЗ.ПроцентнаяСтавкаДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаДоПлана) И
				 (МЗ.ПроцентнаяСтавкаПослеПлана			= ТекущаяЗапись.ПроцентнаяСтавкаПослеПлана) И
				 (МЗ.ПроцентнаяСтавкаПролонгация			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгация) И
				 (МЗ.ПроцентнаяСтавкаНовыйБизнес			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнес) И
				 (МЗ.ПроцентнаяСтавкаПролонгацияДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгацияДоПлана) И
				 (МЗ.ПроцентнаяСтавкаНовыйБизнесДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнесДоПлана) И
				 (МЗ.ПроцентнаяСтавкаПослеСуперПлана	= ТекущаяЗапись.ПроцентнаяСтавкаПослеСуперПлана) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.ПроцентнаяСтавкаДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаДоПлана;
		МЗ.ПроцентнаяСтавкаПослеПлана		= ТекущаяЗапись.ПроцентнаяСтавкаПослеПлана;
		МЗ.ПроцентнаяСтавкаПослеСуперПлана	= ТекущаяЗапись.ПроцентнаяСтавкаПослеСуперПлана;
		МЗ.ПроцентнаяСтавкаОтПервойБонусПланки = ТекущаяЗапись.СтавкаПослеПервойБонусПланки; 
		МЗ.ПроцентнаяСтавкаПролонгация			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгация;
		МЗ.ПроцентнаяСтавкаНовыйБизнес			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнес;
		МЗ.ПроцентнаяСтавкаПролонгацияДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгацияДоПлана;
		МЗ.ПроцентнаяСтавкаНовыйБизнесДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнесДоПлана;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли	ДействиеСПланом = "ИзменениеПроцента" Тогда 
		
		//если план на НачалоПрошлогоМесяца = план который хотим установить, то ничего не делаем
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоПрошлогоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			//Если (МЗ.ПроцентнаяСтавкаДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаДоПлана) И
			//	 (МЗ.ПроцентнаяСтавкаПослеПлана			= ТекущаяЗапись.ПроцентнаяСтавкаПослеПлана) И
			//	 (МЗ.ПроцентнаяСтавкаПослеСуперПлана	= ТекущаяЗапись.ПроцентнаяСтавкаПослеСуперПлана) 
			//	 И (МЗ.ПроцентнаяСтавкаОтПервойБонусПланки = ТекущаяЗапись.СтавкаПослеПервойБонусПланки)
			//	 Тогда
			//	Возврат;
			//КонецЕсли;
		КонецЕсли;
		
		//перезаписываем/создаем план на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= НачалоТекущегоМесяца;
		МЗ.ПроцентнаяСтавкаДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаДоПлана;
		МЗ.ПроцентнаяСтавкаПослеПлана		= ТекущаяЗапись.ПроцентнаяСтавкаПослеПлана;
		МЗ.ПроцентнаяСтавкаПослеСуперПлана	= ТекущаяЗапись.ПроцентнаяСтавкаПослеСуперПлана;
		МЗ.ПроцентнаяСтавкаОтПервойБонусПланки = ТекущаяЗапись.СтавкаПослеПервойБонусПланки; 
		МЗ.ПроцентнаяСтавкаПролонгация			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгация;
		МЗ.ПроцентнаяСтавкаНовыйБизнес			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнес;
		МЗ.ПроцентнаяСтавкаПролонгацияДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаПролонгацияДоПлана;
		МЗ.ПроцентнаяСтавкаНовыйБизнесДоПлана			= ТекущаяЗапись.ПроцентнаяСтавкаНовыйБизнесДоПлана;
		МЗ.НеДействует	= Ложь;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
		
	ИначеЕсли	ДействиеСПланом = "ОтключениеПроцента" Тогда 
		
		//удаляем план, если он на НачалоТекущегоМесяца
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = НачалоТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
		//если на КонецТекущегоМесяца есть отключенная запись, то удаляем ее
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период = КонецТекущегоМесяца;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.Удалить();
		КонецЕсли;
		
	    //если теперь СрезПоследних на НачалоТекущегоМесяца = недействующий план, то ничего не добавляем
	    Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаДоПлана,
	                   |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеПлана,
	                   |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеСуперПлана,
	                   |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.НеДействует,
	                   |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаОтПервойБонусПланки
	                   |ИЗ
	                   |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СрезПоследних(&Дата, ) КАК уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних
	                   |ГДЕ
	                   |	1 = 1";
	    Запрос.УстановитьПараметр("Дата",НачалоТекущегоМесяца);
	    Если ЗначениеЗаполнено(ТекущаяЗапись.Агент) Тогда
	    	Запрос.Текст = Запрос.Текст + " И (уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Агент=&Агент)";
	    	Запрос.УстановитьПараметр("Агент", ТекущаяЗапись.Агент);
	    ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Подразделение) Тогда
	    	Запрос.Текст = Запрос.Текст + " И (уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Подразделение=&Подразделение)";
	    	Запрос.УстановитьПараметр("Подразделение", ТекущаяЗапись.Подразделение);
	    ИначеЕсли ЗначениеЗаполнено(ТекущаяЗапись.Организация) Тогда
	    	Запрос.Текст = Запрос.Текст + " И (уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Организация=&Организация)";
	    	Запрос.УстановитьПараметр("Организация", ТекущаяЗапись.Организация);
	    КонецЕсли;
	    
	    ТЗ=Запрос.Выполнить().Выгрузить();
	    Если ТЗ.Количество() > 0 Тогда
	    	Если ТЗ[ТЗ.Количество()-1].НеДействует=Истина Тогда
	    		Возврат;
	    	КонецЕсли;
	    КонецЕсли;
		
 		//создаем запись на КонецПрошлогоМесяца с флагом "НеДействует=Истина"
		МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, СтруктураДляМЗ);
		МЗ.Период		= КонецПрошлогоМесяца;
		МЗ.ПроцентнаяСтавкаДоПлана			    = 0;
		МЗ.ПроцентнаяСтавкаПослеПлана		    = 0;
		МЗ.ПроцентнаяСтавкаПослеСуперПлана	    = 0;
		МЗ.ПроцентнаяСтавкаОтПервойБонусПланки	= 0;
		МЗ.ПроцентнаяСтавкаПролонгация			= 0;
		МЗ.ПроцентнаяСтавкаНовыйБизнес			= 0;
		МЗ.ПроцентнаяСтавкаПролонгацияДоПлана = 0;
		МЗ.ПроцентнаяСтавкаНовыйБизнесДоПлана = 0;
		МЗ.НеДействует	= Истина;
		МЗ.Комментарий	= ТекущаяЗапись.Комментарий;
		МЗ.Записать();
	ИначеЕсли	ДействиеСПланом = "ОтключениеПроцентаВсем" Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаДоПлана,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеПлана,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеСуперПлана,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.НеДействует,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаОтПервойБонусПланки,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Агент,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Подразделение,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Организация,
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Период
		               |ИЗ
		               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СрезПоследних(&Дата, ) КАК уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних
		               |ГДЕ
		               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Агент <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		               |	И уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.НеДействует = ЛОЖЬ
		               |	И уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Агент В(&СписокАгентов)";
					   Запрос.УстановитьПараметр("СписокАгентов",ТекущаяЗапись.СписокАгентов);
					   Запрос.УстановитьПараметр("Дата",НачалоТекущегоМесяца);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Период = НачалоТекущегоМесяца Тогда
				//Удаляем на начало Месяца
				МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка);
				МЗ.Период = НачалоТекущегоМесяца;
				МЗ.Прочитать();
				Если МЗ.Выбран() Тогда
					МЗ.Удалить();
				КонецЕсли;
			Иначе	
				//Ставим отключение на конец прошлого
				МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка);
				МЗ.Период = НачалоТекущегоМесяца-1;
				МЗ.ПроцентнаяСтавкаДоПлана			    = 0;
				МЗ.ПроцентнаяСтавкаПослеПлана		    = 0;
				МЗ.ПроцентнаяСтавкаПослеСуперПлана	    = 0;
				МЗ.ПроцентнаяСтавкаОтПервойБонусПланки	= 0;
				МЗ.ПроцентнаяСтавкаПролонгация			= 0;
				МЗ.ПроцентнаяСтавкаНовыйБизнес			= 0;
				МЗ.ПроцентнаяСтавкаПролонгацияДоПлана = 0;
				МЗ.ПроцентнаяСтавкаНовыйБизнесДоПлана = 0;
				МЗ.НеДействует = Истина;
				МЗ.Записать();
			КонецЕсли;	
			//Проверяем на конец текущего месяца и удаляем, если есть
			МЗ = РегистрыСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Период = КонецТекущегоМесяца;
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				МЗ.Удалить();
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры //ЗаписьВРегистрСведений_уб_ЗП_Схема_ПланПоСКВ_Планы()
