
Процедура Пауза(ИнтервалОжидания) Экспорт
	
	ИмяФайла = "sleep.js";
	Если Не ФайлСуществует(КаталогВременныхФайлов(), ИмяФайла) Тогда
		Если ПравоДоступа("Вывод", Метаданные) Тогда
			Скрипт = Новый ТекстовыйДокумент();
			Скрипт.УстановитьТекст
			(
			"if (WScript.Arguments.Count()==0)
			|    WScript.Quit();
			|else
			|    if (isNaN(parseInt(WScript.Arguments(0))))
			|        WScript.Quit();
			|WScript.Sleep(WScript.Arguments(0));"
			);
			Путь = КаталогВременныхФайлов() + ИмяФайла;
			Скрипт.Записать(Путь, КодировкаТекста.ANSI);
		Иначе
			КаталогВнешнихКомпонент = ПараметрыСеанса.уб_Константы.КаталогВнешнихКомпонент;
			Если ТипЗнч(КаталогВнешнихКомпонент) = Тип("Строка") Тогда
				КаталогВнешнихКомпонент = СокрЛП(КаталогВнешнихКомпонент);
				Если Прав(КаталогВнешнихКомпонент, 1) <> "\" Тогда
					КаталогВнешнихКомпонент = КаталогВнешнихКомпонент + "\"
				КонецЕсли;
				Если ФайлСуществует(КаталогВнешнихКомпонент, ИмяФайла) Тогда
					Путь = КаталогВнешнихКомпонент + ИмяФайла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Путь = КаталогВременныхФайлов() + ИмяФайла;
	КонецЕсли;
	Если Путь <> Неопределено Тогда
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run("WScript.exe """ + Путь + """ " + Формат(ИнтервалОжидания, "ЧГ=0"), 0, -1);
	КонецЕсли;
	
КонецПроцедуры // Пауза

///////////// КОНВЕРТАЦИЯ ФАЙЛОВ ////////////////

Процедура ВызовКонвертацииСервер(Параметры) Экспорт

	Отказ = Ложь;
	//Проверка корректности параметров
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Параметры = уб_СЛ.СтруктураПараметровКонвертацииФайловПоУмолчанию();
		ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Некорректный тип структуры параметров", Истина);
		Перейти ~НаВыход;
	КонецЕсли;	
	//Заполнение таблицы конвертации при необходимости
	ТаблицаФайловКоличество = Параметры.ТаблицаФайлов.Количество();
	Если ТаблицаФайловКоличество = 0 Тогда
		Если Не Параметры.СоздаватьТаблицуФайловПоЗаявке Или Параметры.СсылкаНаОбъект.Пустая() Тогда
			//не является ошибкой конвертации. Если нет строк, то и конвертация не требуется
			ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Пустая таблица файлов");
		Иначе
			ПолучитьТаблицуКонвертацииФайлов(Параметры);
			ТаблицаФайловКоличество = Параметры.ТаблицаФайлов.Количество();
		КонецЕсли;
	ИначеЕсли Параметры.ПроверкаИменФайловНаУИД Тогда
		// краткое имя входящего файла может
		// 1: отсутствовать. Тогда полное имя входящего файла должно быть заполнено корректно
		// 2: быть именем файла. Тогда отработает стандартным образом (полное имя входящего файла также должно быть заполнено корректно)
		// 3: быть УИД'ом регистра файлов к полису. Строка таблицы файлов приводится в нужный вид 
		//	(заполнение полного имени входящего файла требуется в случае, когда краткое имя - не УИД регистра
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ИмяВходящегоФайла", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
		Для Каждого СтрокаТЗТаблицыФайлов Из Параметры.ТаблицаФайлов Цикл
			Если СтрЧислоВхождений(СтрокаТЗТаблицыФайлов.ИмяВходящегоФайла,"-")=4 Тогда //Не ПустаяСтрока(СтрокаТЗТаблицыФайлов.ИмяВходящегоФайла) Тогда
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.ИмяВходящегоФайла = СтрокаТЗТаблицыФайлов.ИмяВходящегоФайла;
			КонецЕсли;
		КонецЦикла;
		Если ТЗ.Количество() > 0 Тогда
			// требуется обработать ТЗ по регистру файлов к полисам
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Источник.ИмяВходящегоФайла КАК ИмяВходящегоФайла
			|ПОМЕСТИТЬ ВТ_Источник
			|ИЗ
			|	&Источник КАК Источник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Ф.УИД КАК УИД,
			|	Ф.Хранилище.Путь КАК ХранилищеПуть,
			|	Ф.ФайлИмя КАК ФайлИмя,
			|	Ф.ПутьКПапке КАК ПутьКПапке
			|ИЗ
			|	ВТ_Источник КАК ВТ_Источник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф
			|		ПО ВТ_Источник.ИмяВходящегоФайла = Ф.УИД");
			Запрос.УстановитьПараметр("Источник", ТЗ);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					СтрокаТЗ = Параметры.ТаблицаФайлов.Найти(Выборка.УИД, "ИмяВходящегоФайла");
					Если СтрокаТЗ <> Неопределено Тогда
						СтрокаТЗ.ИмяВходящегоФайла 			= Выборка.ФайлИмя;
						СтрокаТЗ.ПолноеИмяВходящегоФайла 	= уб_СЛ.ПроверитьИмяКаталога(Выборка.ХранилищеПуть) + ?(ПустаяСтрока(Выборка.ПутьКПапке), "", уб_СЛ.ПроверитьИмяКаталога(Выборка.ПутьКПапке)) + Выборка.ФайлИмя;
						СтрокаТЗ.УИД						= Выборка.УИД; // вдруг потом пригодится еще
						Параметры.ЕстьНайденныеФайлы        = ИСТИНА;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//При отсутствии предварительных ошибок
	Если Параметры.ТЗОшибок.Количество() = 0 И ТаблицаФайловКоличество > 0 Тогда
		//md5 = Обработки.уб_MD5.Создать();
		КаталогВременныхФайлов 	= КаталогВременныхФайлов();
		ТаблицаФайлов 			= Параметры.ТаблицаФайлов;
		Если ПустаяСтрока(Параметры.ПутьККаталогуИсходящихФайлов) Тогда
			Параметры.ПутьККаталогуИсходящихФайлов = КаталогВременныхФайлов;
		Иначе
			СоздатьКаталог(Параметры.ПутьККаталогуИсходящихФайлов);
		КонецЕсли;
		//Проверка кэшированных файлов
		Если Параметры.ПроверятьКэшНаНаличиеФайлов Тогда
			Отказ = Истина;
			Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
				
				ЭтоРабочаяБаза = ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина;
				СтрокаТЗ.ТребуетсяКонвертация = ТребуетсяКонвертацияФайла(СтрокаТЗ.ПолноеИмяВходящегоФайла, Неопределено);
				мТребуетсяКонвертация = СтрокаТЗ.ТребуетсяКонвертация;
				Если НЕ ЭтоРабочаяБаза и мТребуетсяКонвертация = Истина тогда
					//отладочная инфа
					Сообщить("Отладочная информация:");
					Сообщить("Имя входящего файла: "+СтрокаТЗ.ПолноеИмяВходящегоФайла);
				КонецЕсли;
				//создаем хэш файла для уникальности
				мПолноеИмяВходящегоФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
				GUID = ОбщегоНазначения.MD5Хэш(мПолноеИмяВходящегоФайла);//md5.РасчетХЭШ(мПолноеИмяВходящегоФайла);
				Маска = "tmp" + GUID + "*" + Параметры.РасширениеКартинки;
				МассивФайлов = НайтиФайлы(Параметры.ПутьККаталогуИсходящихФайлов, Маска);
				ФайлИмя = "tmp" + GUID + "(1)" + Параметры.РасширениеКартинки;
				Если ФайлСуществует(Параметры.ПутьККаталогуИсходящихФайлов, ФайлИмя) Тогда
					СтрокаТЗ.ПропуститьКонвертацию 		= Истина;
					СтрокаТЗ.Выполнено					= Истина;
					СтрокаТЗ.ИмяИсходящегоФайла			= ФайлИмя;
					СтрокаТЗ.ВходящийФайлНайден         = ИСТИНА;
					Параметры.ЕстьНайденныеФайлы        = ИСТИНА;
					//добавим в массив конвертации
					Для Каждого СтрФайл Из МассивФайлов Цикл 
						СтрокаТЗ.МассивКонвертации.Добавить(СтрФайл.ПолноеИмя);
					КонецЦикла;
				ИначеЕсли мТребуетсяКонвертация Тогда 
					Отказ = Ложь;
				Иначе //конвертация не требуется на всякий случай приравниваем исходящий и входящий файлы
					СтрокаТЗ.ПропуститьКонвертацию 		= Истина;
					СтрокаТЗ.Выполнено					= Истина;
					СтрокаТЗ.ИмяИсходящегоФайла			= СтрокаТЗ.ИмяВходящегоФайла;
					СтрокаТЗ.ПолноеИмяИсходящегоФайла   = СтрокаТЗ.ПолноеИмяВходящегоФайла;
					СтрокаТЗ.ВходящийФайлНайден         = ИСТИНА;
					Параметры.ЕстьНайденныеФайлы        = ИСТИНА;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Отказ Тогда
			//не выполняем никакой код, не требуется удаление очереди (результат конвертации неизвестен)
			Возврат
		КонецЕсли;
		//Последовательная проверка наличия файлов их имен
		Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
			//Файл = Новый Файл(СтрокаТЗ.ПолноеИмяВходящегоФайла);
			Если ФайлСуществует(СтрЗаменить(СтрокаТЗ.ПолноеИмяВходящегоФайла, СтрокаТЗ.ИмяВходящегоФайла, ""), СтрокаТЗ.ИмяВходящегоФайла) Тогда
				Файл = Неопределено;
				СтрокаТЗ.ВходящийФайлНайден 	= Истина;
				Параметры.ЕстьНайденныеФайлы 	= Истина;
				ТипФайла = Неопределено;
				Если ТребуетсяКонвертацияФайла(СтрокаТЗ.ПолноеИмяВходящегоФайла, ТипФайла) Тогда
					//создаем хэш файла для уникальности
					мПолноеИмяВходящегоФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
					GUID = ОбщегоНазначения.MD5Хэш(мПолноеИмяВходящегоФайла);//md5.РасчетХЭШ(мПолноеИмяВходящегоФайла);
					СтрокаТЗ.ТребуетсяКонвертация       = ИСТИНА;
					СтрокаТЗ.ПриложениеВходящегоФайла 	= ТипФайла;
					СтрокаТЗ.РасширениеКартинки			= Параметры.РасширениеКартинки;
					СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения = "tmp" + GUID;
					//проверка заполнения имен файлов
					Если ПустаяСтрока(СтрокаТЗ.ИмяИсходящегоФайла) И ПустаяСтрока(СтрокаТЗ.ПолноеИмяИсходящегоФайла) Тогда
						Если Параметры.ПутьККаталогуИсходящихФайлов = КаталогВременныхФайлов Тогда
							СтрокаТЗ.ПолноеИмяИсходящегоФайла = ПолучитьИмяВременногоФайла(Параметры.РасширениеКартинки);
							ИмяВременногоФайла = СтрЗаменить(СтрокаТЗ.ПолноеИмяИсходящегоФайла, КаталогВременныхФайлов, "");
							СтрокаТЗ.ИмяИсходящегоФайла = ИмяВременногоФайла;
						Иначе
							//такой случай не предусмотрен
							//ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Получение временного файла с путем к каталогу НЕ являющимся каталогом временных файлов", Истина);
						КонецЕсли;
					КонецЕсли;
					//не изображения, запускаемые через просмотр
					СтрокаТЗ.ОбновитьИмяФайлаДляСтраниц = Не СтрокаТЗ.ПропуститьКонвертацию;
					Если Не СтрокаТЗ.ПропуститьКонвертацию Тогда
						Параметры.ТребуетсяКонвертация = Истина;
					КонецЕсли;
				Иначе
					СтрокаТЗ.ОбновитьИмяФайлаДляСтраниц = ЛОЖЬ;//СтрокаТЗ.КолонкаВТабличнойЧасти <> "Образец" И Не СтрокаТЗ.ПропуститьКонвертацию И Параметры.ПутьККаталогуИсходящихФайлов <> КаталогВременныхФайлов;
					СтрокаТЗ.РасширениеКартинки = уб_СЛ.ОпределитьРасширениеФайла(СтрокаТЗ.ПолноеИмяВходящегоФайла);
					СтрокаТЗ.ИмяИсходящегоФайла = СтрокаТЗ.ИмяВходящегоФайла;
					СтрокаТЗ.ПолноеИмяИсходящегоФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
				КонецЕсли;
				Если ПустаяСтрока(СтрокаТЗ.ИмяИсходящегоФайла) Тогда
					Если ПустаяСтрока(СтрокаТЗ.ПолноеИмяИсходящегоФайла) Тогда
						//файл не требует конвертации (его данные не заданы)
						Если Параметры.ПутьККаталогуИсходящихФайлов = КаталогВременныхФайлов Тогда
							СтрокаТЗ.ПолноеИмяИсходящегоФайла = ПолучитьИмяВременногоФайла(СтрокаТЗ.РасширениеКартинки);
						Иначе
							//такой случай не предусмотрен
							//ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Получение временного файла с путем к каталогу НЕ являющимся каталогом временных файлов", Истина);
						КонецЕсли;
					КонецЕсли;
					СтрокаТЗ.ИмяИсходящегоФайла = СтрЗаменить(СтрокаТЗ.ПолноеИмяИсходящегоФайла, Параметры.ПутьККаталогуИсходящихФайлов, "")
				ИначеЕсли ПустаяСтрока(СтрокаТЗ.ПолноеИмяИсходящегоФайла) Тогда
					СтрокаТЗ.ПолноеИмяИсходящегоФайла = Параметры.ПутьККаталогуИсходящихФайлов + СтрокаТЗ.ИмяИсходящегоФайла;
				КонецЕсли;
				//СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения = Лев(СтрокаТЗ.ИмяИсходящегоФайла, СтрДлина(СтрокаТЗ.ИмяИсходящегоФайла) - СтрДлина(СтрокаТЗ.РасширениеКартинки));
				Если СтрокаТЗ.ОбновитьИмяФайлаДляСтраниц Тогда
					СтрокаТЗ.ИмяИсходящегоФайла 		= СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(1)" + СтрокаТЗ.РасширениеКартинки;
					СтрокаТЗ.ПолноеИмяИсходящегоФайла 	= Параметры.ПутьККаталогуИсходящихФайлов + СтрокаТЗ.ИмяИсходящегоФайла;
				КонецЕсли;
				Если Параметры.УдалитьСтарыеФайлы И Не СтрокаТЗ.ПропуститьКонвертацию Тогда
					УдалитьКонвертированныеФайлы(СтрокаТЗ, Параметры.ПутьККаталогуИсходящихФайлов);
				КонецЕсли;
			Иначе
				СтрокаТЗ.ВходящийФайлНайден = Ложь;
				ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Входящий файл " + СтрокаТЗ.ПолноеИмяВходящегоФайла + " не найден.", Истина);
			КонецЕсли;
		КонецЦикла;		
		//Вызов конвертации
		Если Параметры.ЕстьНайденныеФайлы Тогда
			Если Параметры.ТребуетсяКонвертация Тогда
				//вызов конвертации
				Если Параметры.ЧерезФоновоеЗадание и ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
					Если Параметры.ИспользуетсяИмяФайлаСТаблицейФайлов И ПустаяСтрока(Параметры.ИмяФайлаСТаблицейФайлов) Тогда
						Параметры.ИмяФайлаСТаблицейФайлов = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
					КонецЕсли;
					ФоноваяКонвертацияФайлов(Параметры);
				Иначе
					уб_СЕРВЕРные.ВыполнитьКонвертациюФайлов(Параметры);
				КонецЕсли;				
			КонецЕсли;
			ОкончаниеКонвертацииСервер(Параметры);
		КонецЕсли;
	КонецЕсли;
	
~НаВыход
	:
	
	//Оповещение об ошибках конвертации
	Если Параметры.ТЗОшибок.Количество() > 0 Тогда
		Параметры.СтрокаОшибки = ТЗОшибокКонвертацииВСтроку(Параметры.ТЗОшибок, Параметры.СсылкаНаОбъект);
		Если Параметры.СделатьЗаписьВЖурналПриОшибке Тогда
			ЗаписьЖурналаРегистрации(
				"Ошибки конвертации файлов", 
				УровеньЖурналаРегистрации.Ошибка,
				Параметры.СсылкаНаОбъект,
				,
				Параметры.СтрокаОшибки
			);
		КонецЕсли;	
		Если Параметры.ВыполненаКонвертацияВсехФайлов Тогда
			МассивСтрок = Параметры.ТЗОшибок.НайтиСтроки(Новый Структура("Конвертация", Истина));
			Если МассивСтрок.Количество() > 0 Тогда
				Параметры.ВыполненаКонвертацияВсехФайлов = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//Обработка регистра очереди
	Если Параметры.СсылкаНаОбъект = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.СсылкаНаОбъект.Пустая() Тогда
		Если Параметры.ВыполненаКонвертацияВсехФайлов Тогда
			МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект 		= Параметры.СсылкаНаОбъект;
			МенеджерЗаписи.ТипОчереди 	= Перечисления.уб_ТипыОчереди.Файлы;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.СсылкаНаОбъект) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			//Требуется проверка на тип объекта или достаточно наличия записи про нему?
			//	измерение Объект регистра Очередь типа Заявка на выезд
			//	СсылкаНаОбъект - любая ссылка:
			//	требуется проверка, искать все подряд не имеет смысла
			МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект 		= Параметры.СсылкаНаОбъект;
			МенеджерЗаписи.ТипОчереди 	= Перечисления.уб_ТипыОчереди.Файлы;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.КоличествоПопытокВыполнения = МенеджерЗаписи.КоличествоПопытокВыполнения + 1;
				Если МенеджерЗаписи.КоличествоПопытокВыполнения > 1
					И Параметры.ТЗОшибок.Количество() > 0
					И Параметры.ОтправлятьНаПочтуОшибки 
					Тогда
					ТемаСообщения = "Ошибки конвертации файлов по " + Параметры.СсылкаНаОбъект;
					ПараметрыСообщения = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
					ПараметрыСообщения.Получатели 	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
					ПараметрыСообщения.Тема			= ТемаСообщения;
					ПараметрыСообщения.Сообщение	= Параметры.СтрокаОшибки;
					уб_ОбменДанными.SendMail(ПараметрыСообщения);	
				КонецЕсли;
				МенеджерЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьКонвертациюФайлов(Параметры) Экспорт
	
	НачалоРаботы = ТекущаяДата();
	МассивОшибокКонвертации = Новый Массив;	
	Принтер = ИнициализацияПрофиляПринтера(Параметры, МассивОшибокКонвертации);
	Если Принтер <> Неопределено Тогда
		Если Принтер.Status.State = 0 Тогда
			ТаблицаФайлов = Параметры.ТаблицаФайлов;
			//принтер готов к работе и есть файлы Excel и Word
			ОбработатьФайлыExcel(Параметры, Принтер, МассивОшибокКонвертации);
			ОбработатьФайлыWord(Параметры, 	Принтер, МассивОшибокКонвертации);
			ОбработатьФайлыPDF(Параметры, 	Принтер, МассивОшибокКонвертации);
			Если Не ПустаяСтрока(Параметры.ИмяФайлаСТаблицейФайлов) Тогда
				ПоместитьВоВременноеХранилище(ТаблицаФайлов, Параметры.ИмяФайлаСТаблицейФайлов);
			КонецЕсли;	
			// ожидание завершения работы виртуального принтера
			// следует ограничить время ожидания завершения работы
			Шаг	= Параметры.ШагОжиданияЗавершенияРаботыПринтера;
			СекундПрошло = ТекущаяДата() - НачалоРаботы;
			ЧислоПопыток = Цел((Макс(Параметры.ВремяОжиданияФоновогоЗадания - СекундПрошло, 0)) * 3 / 4 / Шаг);
			Счетчик = 0;
			// 1 раз принудительное ожидание, иначе возникают ошибки доступа к файлу
			Пока Принтер.Status.State <> 0 Или Счетчик = 0 Цикл
				Счетчик = Счетчик + 1;
				Если Счетчик > ЧислоПопыток Тогда
					МассивОшибокКонвертации.Добавить("Окончилось время ожидания окончания работы виртуального принтера через фоновое задание. Возможно не все картинки записаны на диск");
					Прервать;
				КонецЕсли;
				Пауза(Шаг * 1000);
			КонецЦикла;
		Иначе
			МассивОшибокКонвертации.Добавить("Принтер не готов / Код ошибки: " + Принтер.Status.State);
			//ST_READY	0	Виртуальный принтер готов к работе.
			//ST_RENDERING	1	Идет процесс рендеринга выходного файла.
			//ST_SAVING	2	Идет процесс сохранения выходного файла.
			//ST_POSTPRINT	3	Выполняется постпринт-процесс.
			//ST_PAUSED	4	Работа виртуального принтера приостановлена.
		КонецЕсли;
	КонецЕсли;
	Если МассивОшибокКонвертации.Количество() > 0 Тогда
		Если Параметры.ЧерезФоновоеЗадание Тогда
			Если Не ПустаяСтрока(Параметры.АдресВоВременномХранилищеДляТекстаОшибки) Тогда
				ПоместитьВоВременноеХранилище(МассивОшибокКонвертации, Параметры.АдресВоВременномХранилищеДляТекстаОшибки);
			КонецЕсли;
		Иначе
			Для Каждого ЭлементМассива Из МассивОшибокКонвертации Цикл
				СтрокаТЗОшибок = Параметры.ТЗОшибок.Добавить();
				СтрокаТЗОшибок.Текст 		= ЭлементМассива;
				СтрокаТЗОшибок.Конвертация  = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОкончаниеКонвертацииСервер(Параметры)

	//Получение результата конвертации при фоновом задании
	//проброс ошибок из фонового задания
	Если Параметры.ТребуетсяКонвертация 
		И Параметры.ЧерезФоновоеЗадание 
		И Не Параметры.ИстеклоВремяОжиданияФоновогоЗадания Тогда
		Если Не ПустаяСтрока(Параметры.ИмяФайлаСТаблицейФайлов) Тогда
			ТаблицаФайлов = ПолучитьИзВременногоХранилища(Параметры.ИмяФайлаСТаблицейФайлов);
			Если ТипЗнч(ТаблицаФайлов) = Тип("ТаблицаЗначений") Тогда
				Параметры.ТаблицаФайлов = ТаблицаФайлов
			Иначе
				ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Ошибка получения таблицы файлов из временного хранилища", Истина);
			КонецЕсли;
		КонецЕсли;
		//получение ошибок, возможно произошедших при конвертации
		Если Параметры.АдресВоВременномХранилищеДляТекстаОшибки = Неопределено Тогда
			//TODO через вызов из формы записи очереди пришли без адреса, используется процедура регламентного задания
		Иначе	
			МассивОшибокКонвертации = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилищеДляТекстаОшибки);
			Если ТипЗнч(МассивОшибокКонвертации) = Тип("Массив") Тогда
				Для Каждого ЭлементМассива Из МассивОшибокКонвертации Цикл
					СтрокаТЗОшибок = Параметры.ТЗОшибок.Добавить();
					СтрокаТЗОшибок.Текст 		= ЭлементМассива;
					СтрокаТЗОшибок.Конвертация  = Истина;
				КонецЦикла;
			Иначе
				ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Ошибка получения массива ошибок конвертации из временного хранилища", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТаблицаФайлов = Параметры.ТаблицаФайлов;
	//Пост-обработка Файлов
	Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл		
		Если СтрокаТЗ.ВходящийФайлНайден Тогда
			ВыполненаПостОбработка = Ложь;
			//ТипФайла = Неопределено;
			//ТребуетсяКонвертацияФайла(СтрокаТЗ.ПолноеИмяВходящегоФайла, ТипФайла);
			//применяем фильтр к картинке, к пдф принудительно
			Если (Не СтрокаТЗ.ПропуститьКонвертацию И Не Параметры.ИстеклоВремяОжиданияФоновогоЗадания) Тогда
			//требуется выполнить постобработку, либо скопировать файл из входящего в исходящий, если постобработка по каким либо причинам не вызвана
				Если СтрокаТЗ.ТребуетсяКонвертация 
					Или (Параметры.ПринудительнаяПоследующаяОбработка И уб_СЛ.ВозможнаПостобработкаИзображенияПоРасширению(СтрокаТЗ.РасширениеКартинки)) Тогда
					ПрименитьФильтрыККартинке(Параметры, СтрокаТЗ);
					ВыполненаПостОбработка = Истина;
				Иначе
					//КопироватьФайл(СтрокаТЗ.ПолноеИмяВходящегоФайла, СтрокаТЗ.ПолноеИмяИсходящегоФайла);
				КонецЕсли;
			КонецЕсли;
			Если ВыполненаПостОбработка Тогда
				Файл = Новый Файл(СтрокаТЗ.ПолноеИмяИсходящегоФайла);
				СтрокаТЗ.Выполнено = Файл.Существует();
				Файл = Неопределено;
				Если Не СтрокаТЗ.Выполнено Тогда
					ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Не найден исходящий файл " + СтрокаТЗ.ПолноеИмяИсходящегоФайла, Истина);
				КонецЕсли;
			Иначе
				СтрокаТЗ.Выполнено = ОжидатьСозданиеФайла(СтрокаТЗ.ПолноеИмяИсходящегоФайла);
				Если Не СтрокаТЗ.Выполнено Тогда
					ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Не найден исходящий файл (поиск циклом) " + СтрокаТЗ.ПолноеИмяИсходящегоФайла, Истина);
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаТЗ.Выполнено = Ложь;
			ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Не найден исходящий файл " + СтрокаТЗ.ПолноеИмяИсходящегоФайла, Истина);
		КонецЕсли;
	КонецЦикла;
	//Помещение файлов картинок в хранилище
	Если ТаблицаФайлов.Количество() = 1 Тогда
		СтрокаТЗ = ТаблицаФайлов[0];
		Если СтрокаТЗ.ВходящийФайлНайден И Не ПустаяСтрока(СтрокаТЗ.АдресВХранилище) И СтрокаТЗ.Выполнено Тогда
			МассивКартинок = Новый Массив;
			Если СтрокаТЗ.ОбновитьИмяФайлаДляСтраниц Тогда
				Индекс = 0;
				Пока Индекс < Параметры.МаксимальноеКоличествоСтраниц Цикл
					//TODO паузу
					//Сделать аналогично ОжидатьСозданиеФайла, как вариант параметр от обратного, но обязательно с паузой и ограниченным циклом исполнения
					//Если будет ошибка копирования/либо очень долгое копирование, будет зацикливание
					//
					//	пауза перед получением картинки из временного файла
					//	максимальное число страниц = 100
					Индекс = Индекс + 1;
					ИмяФайла = Параметры.ПутьККаталогуИсходящихФайлов + СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(" + Индекс + ")" + СтрокаТЗ.РасширениеКартинки;
					Файл = Новый Файл(ИмяФайла);
					Если Файл.Существует() Тогда
						ВременныйФайл = ПолучитьИмяВременногоФайла(СтрокаТЗ.РасширениеКартинки);
						КопироватьФайл(ИмяФайла, ВременныйФайл);
						// TODO ошибка совместного доступа к файлу (если без временного файла);
						Пауза(Параметры.ВремяОжиданияСозданияФайла1С);
						Картинка = Новый Картинка(ВременныйФайл);
						МассивКартинок.Добавить(Картинка.ПолучитьДвоичныеДанные());
						//добавим в массив конвертации
						СтрокаТЗ.МассивКонвертации.Добавить(ИмяФайла);
						Файл = Неопределено;
					Иначе
						Файл = Неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Картинка = Новый Картинка(СтрокаТЗ.ПолноеИмяИсходящегоФайла);
				МассивКартинок.Добавить(Картинка.ПолучитьДвоичныеДанные());
				//добавим в массив конвертации
				СтрокаТЗ.МассивКонвертации.Добавить(СтрокаТЗ.ПолноеИмяИсходящегоФайла);
			КонецЕсли;
			ПоместитьВоВременноеХранилище(МассивКартинок, СтрокаТЗ.АдресВХранилище);			
		КонецЕсли;
		МассивКартинок = Неопределено
	КонецЕсли;
	//также удаляются автоматически при завершении сеанса
	Если Параметры.УдалятьФайлыПослеКонвертации Тогда
		УдалитьКонвертированныеФайлы(СтрокаТЗ, Параметры.ПутьККаталогуИсходящихФайлов);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьФайлыWord(Параметры, Принтер, МассивОшибокКонвертации)

	ТаблицаФайлов = Параметры.ТаблицаФайлов;
	Отбор = Новый Структура;
	Отбор.Вставить("ПриложениеВходящегоФайла", 	"Word");
	Отбор.Вставить("ПропуститьКонвертацию",		Ложь);
	Отбор.Вставить("ВходящийФайлНайден",		Истина);
	СтрокиФайлов = ТаблицаФайлов.НайтиСтроки(Отбор);
	Если СтрокиФайлов.Количество() > 0 Тогда
		Попытка
			WordApp = Новый COMОбъект("Word.Application");
			WordApp.Visible 		= Ложь;
			WordApp.ActivePrinter 	= "Universal Document Converter";
			//WordApp.DisplayRecentFiles = Ложь;
			//WordApp.DisplayScrollBars = Ложь;
		Исключение
			МассивОшибокКонвертации.Добавить("Ошибка создания COM-объекта Word");
		КонецПопытки;
		Если WordApp <> Неопределено Тогда		
			ПечатьЗапущена = Ложь;
			Для Каждого СтрокаТЗ Из СтрокиФайлов Цикл
				Попытка
					//http://msdn.microsoft.com/en-us/library/office/bb216319(v=office.12).aspx
					Revert = Ложь;//Controls what happens if FileName is the name of an open document. True to discard any unsaved changes to the open document and reopen the file. False to activate the open document.
					//Контролирует, что происходит, если FileName это имя открытого документа. Истина, чтобы отменить все несохраненные изменения в открытом документе и открыть файл. Ложь - активировать открытый документ.					
					//OpenAndRepair = Истина;//True to repair the document to prevent document corruption.
					////Истина, чтобы восстановить документ, чтобы предотвратить повреждения документа.
					//
					//NoEncodingDialog = Истина;//True to skip displaying the Encoding dialog box that Word displays if the text encoding cannot be recognized. The default value is False.
					////Истина , чтобы пропустить отображения диалоговое окно Кодировка, если кодировка текста не может быть определена. Значение по умолчанию: Ложь.
					//WordFile = WordApp.Documents.Open(СтрокаТЗ.ПолноеИмяВходящегоФайла,Ложь,Истина,Ложь,,,Revert,,,,,,,OpenAndRepair,,NoEncodingDialog);
					WordFile = WordApp.Documents.Open(СтрокаТЗ.ПолноеИмяВходящегоФайла,Ложь,Истина,Ложь,,,Revert);
				Исключение
					МассивОшибокКонвертации.Добавить("Не удалось открыть файл " + СтрокаТЗ.КолонкаВТабличнойЧасти + " " + Строка(СтрокаТЗ.НомерСтрокиВДокументе) + ". Описание ошибки: " + ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
				Попытка
					////WordApp.DisplayAutoCompleteTips = Ложь;
					//WordApp.DisplayScreenTips = Ложь;
					//WordApp.DisplayStatusBar = Ложь;				
					Принтер.Profile.OutputLocation.FileName = СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(&[Page(0)])" + Параметры.РасширениеКартинки;				
					//WordFile.PrintOut(СтрокаТЗ.НомерСтраницыОт, СтрокаТЗ.НомерСтраницыДо, , , "Universal Document Converter");
					Если СтрокаТЗ.НомерСтраницыОт = 0 И СтрокаТЗ.НомерСтраницыДо = 0 Тогда
						WordFile.PrintOut(0);
					Иначе
						НомерСтраницыДо = ?(СтрокаТЗ.НомерСтраницыДо = 0, 999, СтрокаТЗ.НомерСтраницыДо);
						НомерСтраницыОт = ?(СтрокаТЗ.НомерСтраницыОт = 0, 1, СтрокаТЗ.НомерСтраницыОт);
						WordFile.PrintOut(0,,4,,,,,,Строка(НомерСтраницыОт) + "-" + Строка(НомерСтраницыДо));
					КонецЕсли;				
					Попытка
						СтрокаТЗ.ПолеСлева 	= Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.LeftMargin),	2) * 10;
						СтрокаТЗ.ПолеСверху = Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.TopMargin),	2) * 10;
						СтрокаТЗ.ПолеСправа = Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.RightMargin),	2) * 10;
						СтрокаТЗ.ПолеСнизу 	= Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.BottomMargin),	2) * 10;
					Исключение
					КонецПопытки;
					СтрокаТЗ.Выполнено 	= Истина;
					ПечатьЗапущена = Истина;
					WordFile.Close(Ложь);
				Исключение
					Попытка
						WordFile.Close(Ложь);
					Исключение
					КонецПопытки;
					МассивОшибокКонвертации.Добавить("Не удалось конвертировать файл " + СтрокаТЗ.ПолноеИмяВходящегоФайла + ". Описание ошибки: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;		
			Если ПечатьЗапущена Тогда
				//ИмяФайла = Принтер.Profile.OutputLocation.FolderPath + "\" + Принтер.Profile.OutputLocation.FileName;
				//ОжиданиеСозданияПоследнегоФайла(ИмяФайла, 3);
				ОжиданиеСтатусаПринтера(Принтер, 15);
			КонецЕсли;
			Попытка
				WordApp.Quit(Ложь);
				//КомандаСистемы("taskkill /F /IM word.exe");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	WordApp = Неопределено;
	WordFile = Неопределено;
	
КонецПроцедуры

Процедура ОбработатьФайлыExcel(Параметры, Принтер, МассивОшибокКонвертации)

	ТаблицаФайлов = Параметры.ТаблицаФайлов;
	Отбор = Новый Структура;
	Отбор.Вставить("ПриложениеВходящегоФайла", 	"Excel");
	Отбор.Вставить("ПропуститьКонвертацию",		Ложь);
	Отбор.Вставить("ВходящийФайлНайден",		Истина);
	СтрокиФайлов = ТаблицаФайлов.НайтиСтроки(Отбор);
	Если СтрокиФайлов.Количество() > 0 Тогда
		Попытка
			ExcelBook = Новый COMОбъект("Excel.Application");
			ExcelBook.DisplayAlerts 				= Ложь;
			ExcelBook.AskToUpdateLinks 				= Ложь;
			ExcelBook.WarnOnFunctionNameConflict 	= Ложь;
			ExcelBook.Interactive 					= Ложь;
			ExcelBook.EnableEvents 					= Ложь;
			ExcelBook.IgnoreRemoteRequests 			= Истина;
			ExcelBook.ScreenUpdating 				= Ложь;
    		//ExcelBook.DisplayStatusBar 				= Ложь;
		Исключение
			МассивОшибокКонвертации.Добавить("Ошибка создания COM-объекта Excel");
		КонецПопытки;
		Если ExcelBook <> Неопределено Тогда
			ПечатьЗапущена = Ложь;
			Для Каждого СтрокаТЗ Из СтрокиФайлов Цикл
				Попытка
					//ExcelFile = ExcelBook.Workbooks.Open(СтрокаТЗ.ПолноеИмяВходящегоФайла);
					//Open(FileName, UpdateLinks, ReadOnly, Format, Password, WriteResPassword, IgnoreReadOnlyRecommended, Origin, Delimiter, Editable, Notify, Converter, AddToMru, Local, CorruptLoad) 
					ExcelFile = ExcelBook.Workbooks.Open(СтрокаТЗ.ПолноеИмяВходящегоФайла, 2, Истина,,,,Истина,,,,Ложь,,,,0);
					//ExcelBook.Calculation 					= -4135; // xlCalculationManual
					//ExcelBook.ActiveSheet.DisplayPageBreaks = Ложь;
					//http://msdn.microsoft.com/en-us/library/microsoft.office.interop.excel.workbooks.open(v=office.11).aspx
				Исключение
					Если СтрокаТЗ.КолонкаВТабличнойЧасти <> "" Тогда
						ОписаниеФайла = СтрокаТЗ.КолонкаВТабличнойЧасти + " " + Строка(СтрокаТЗ.НомерСтрокиВДокументе);
					Иначе
						ОписаниеФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
					КонецЕсли;
					МассивОшибокКонвертации.Добавить("Не удалось открыть файл " + ОписаниеФайла + ". Описание ошибки: " + ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
				Попытка
					//Принтер.Profile.OutputLocation.FileName = СтрокаТЗ.ИмяИсходящегоФайла;
					Принтер.Profile.OutputLocation.FileName = СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(&[Page(0)])" + Параметры.РасширениеКартинки;
					//проверка, написано, что должно ускорить. Если не улучшилось - убрать
					//ExcelBook.ScreenUpdating 	= Ложь;
					ExcelWorksheet = ExcelBook.ActiveSheet;
					ExcelPageSetup = ExcelWorksheet.PageSetup;
					//ЗначениеПараметра = ?(СтруктураПараметров.Свойство("ВыбраннаяОриентацияСтраницы",ЗначениеПараметра),ЗначениеПараметра,1);
					//ExcelPageSetup.Orientation = ЗначениеПараметра;
					ExcelPageSetup.Orientation = 1;	
					ExcelPageSetup.Zoom = Параметры.ПроцентМасштаба;
					Если ExcelPageSetup.Zoom = Ложь Или ExcelPageSetup.Zoom = 0 Тогда//если не задан масштаб процентом тогда устанавливаем
						ExcelPageSetup.FitToPagesWide = Параметры.КоличествоСтраницПоШирине; //Размешать не более чем на 1 страницу по ширине
					КонецЕсли;
					ExcelPageSetup.FitToPagesTall = Ложь;//Снимаем привязку масштаба к количеству страниц по высоте	
					НомерСтраницыДо = ?(СтрокаТЗ.НомерСтраницыДо = 0, 999, СтрокаТЗ.НомерСтраницыДо);
					НомерСтраницыОт = ?(СтрокаТЗ.НомерСтраницыОт = 0, 1, СтрокаТЗ.НомерСтраницыОт);
					//ExcelBook.ScreenUpdating 	= Истина;
					//ExcelBook.Calculation				= - 4105; //xlCalculationAutomatic
					//ExcelWorksheet.DisplayPageBreaks 	= Истина;
					ExcelWorksheet.PrintOut(НомерСтраницыОт, НомерСтраницыДо, 1, Ложь, "Universal Document Converter");	
					//ExcelPageSetup.BottomMargin = 0;
					//ExcelPageSetup.LeftMargin   = 0;
					//ExcelPageSetup.RightMargin  = 0;
					//ExcelPageSetup.TopMargin    = 0;	
					СтрокаТЗ.ПолеСлева 	= Окр(ExcelPageSetup.LeftMargin / ExcelBook.CentimetersToPoints(1),	 	1) * 10;
					СтрокаТЗ.ПолеСверху = Окр(ExcelPageSetup.TopMargin / ExcelBook.CentimetersToPoints(1), 		1) * 10;
					СтрокаТЗ.ПолеСправа = Окр(ExcelPageSetup.RightMargin / ExcelBook.CentimetersToPoints(1), 	1) * 10;
					СтрокаТЗ.ПолеСнизу 	= Окр(ExcelPageSetup.BottomMargin / ExcelBook.CentimetersToPoints(1), 	1) * 10;	
					СтрокаТЗ.Выполнено = Истина;
					ПечатьЗапущена = Истина;
					ExcelFile.Close(0);
				Исключение
					Попытка
						ExcelFile.Close(0);
					Исключение
					КонецПопытки;
					Если СтрокаТЗ.КолонкаВТабличнойЧасти <> "" Тогда
						ОписаниеФайла = СтрокаТЗ.КолонкаВТабличнойЧасти + " " + Строка(СтрокаТЗ.НомерСтрокиВДокументе);
					Иначе
						ОписаниеФайла = СтрокаТЗ.ПолноеИмяВходящегоФайла;
					КонецЕсли;
					МассивОшибокКонвертации.Добавить("Не удалось конвертировать файл " + ОписаниеФайла + ". Описание ошибки: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;	
			Если ПечатьЗапущена Тогда
				//ИмяФайла = Принтер.Profile.OutputLocation.FolderPath + "\" + Принтер.Profile.OutputLocation.FileName;
				//ОжиданиеСозданияПоследнегоФайла(ИмяФайла, 3);
				ОжиданиеСтатусаПринтера(Принтер, 4);
			КонецЕсли;
			Попытка
				ExcelBook.Quit();
				//КомандаСистемы("taskkill /F /IM excel.exe");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	ExcelBook = Неопределено;
	ExcelFile = Неопределено;
	ExcelWorksheet = Неопределено;
	ExcelPageSetup = Неопределено;
	
КонецПроцедуры

Процедура ОбработатьФайлыPDF(Параметры, Принтер, МассивОшибокКонвертации)

	ТаблицаФайлов = Параметры.ТаблицаФайлов;
	Отбор = Новый Структура;
	Отбор.Вставить("ПриложениеВходящегоФайла", 	"PDF");
	Отбор.Вставить("ПропуститьКонвертацию",		Ложь);
	Отбор.Вставить("ВходящийФайлНайден",		Истина);
	СтрокиФайлов = ТаблицаФайлов.НайтиСтроки(Отбор);
	Если СтрокиФайлов.Количество() > 0 Тогда
		
	ПутьAdobeReader = ПроверкаПутиAdobeReader();
	Если ПутьAdobeReader = "" Тогда 
		МассивОшибокКонвертации.Добавить("Не удалось подключиться к AdobeReader");
		Возврат;
	КонецЕсли;
	
	ИмяПринтера = "Universal Document Converter";
	
	//СтрокаЗапуска = """"+ПутьAdobeReader + """ /N /T """ + Путь +""""+ ?(ЗначениеЗаполнено(ИмяПринтера), " """ + ИмяПринтера+"""", "");
	//Сообщить(СтрокаЗапуска);
	WshShell   = Новый COMОбъект("WScript.Shell");
	
	    Файл = Новый Файл(ПутьAdobeReader);
		Если Файл.Существует() Тогда		
			ПечатьЗапущена = Ложь;
			Для Каждого СтрокаТЗ Из СтрокиФайлов Цикл
				Попытка
					////WordApp.DisplayAutoCompleteTips = Ложь;
					//WordApp.DisplayScreenTips = Ложь;
					//WordApp.DisplayStatusBar = Ложь;				
					СтрокаТЗ.ПовернутьКартинкуЕслиШиринаБольшеВысоты = Истина;
					Принтер.Profile.OutputLocation.FolderPath = Параметры.ПутьККаталогуИсходящихФайлов;
					Принтер.Profile.OutputLocation.FileName = СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(&[Page(0)])" + Параметры.РасширениеКартинки;				
					СтрокаЗапуска = """"+ПутьAdobeReader + """ /N /T """ + СтрокаТЗ.ПолноеИмяВходящегоФайла +""""+ ?(ЗначениеЗаполнено(ИмяПринтера), " """ + ИмяПринтера+"""", "");
					                                                         
					//WshShell.Run(СтрокаЗапуска, 0); 
					//Текст = Новый ТекстовыйДокумент;
					//Текст.ДобавитьСтроку(СтрокаЗапуска);
					//ВремФайл = ПолучитьИмяВременногоФайла("cmd");
					//ВремФайл
					//Текст.Записать(ВремФайл,);
					//КомандаСистемы(ВремФайл);
					//ЗапуститьПриложение("D:\B2B\К заявкам\temp\1.cmd",,Ложь,);
					RetCode = WshShell.Run(СтрокаЗапуска, 0); 
					Сообщить(RetCode);
					//УдалитьФайлы(ВремФайл);
					
					//отладочная информация
					ЭтоРабочаяБаза = ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина;
					Если НЕ ЭтоРабочаяБаза тогда
						Сообщить("Отладочная информация:");
						Сообщить("Путь к каталогу исходящих файлов: "+Параметры.ПутьККаталогуИсходящихФайлов);
						Сообщить("Имя выходного файла: "+СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(&[Page(0)])" + Параметры.РасширениеКартинки);
						Сообщить("Строка запуска: "+СтрокаЗапуска);
					КонецЕсли;
					
					//WordFile.PrintOut(СтрокаТЗ.НомерСтраницыОт, СтрокаТЗ.НомерСтраницыДо, , , "Universal Document Converter");
					//Если СтрокаТЗ.НомерСтраницыОт = 0 И СтрокаТЗ.НомерСтраницыДо = 0 Тогда
					//	WordFile.PrintOut(0);
					//Иначе
					//	НомерСтраницыДо = ?(СтрокаТЗ.НомерСтраницыДо = 0, 999, СтрокаТЗ.НомерСтраницыДо);
					//	НомерСтраницыОт = ?(СтрокаТЗ.НомерСтраницыОт = 0, 1, СтрокаТЗ.НомерСтраницыОт);
					//	WordFile.PrintOut(0,,4,,,,,,Строка(НомерСтраницыОт) + "-" + Строка(НомерСтраницыДо));
					//КонецЕсли;				
					//Попытка
					//	СтрокаТЗ.ПолеСлева 	= Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.LeftMargin),	2) * 10;
					//	СтрокаТЗ.ПолеСверху = Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.TopMargin),	2) * 10;
					//	СтрокаТЗ.ПолеСправа = Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.RightMargin),	2) * 10;
					//	СтрокаТЗ.ПолеСнизу 	= Окр(WordApp.PointsToCentimeters(WordFile.PageSetup.BottomMargin),	2) * 10;
					//Исключение
					//КонецПопытки;
					СтрокаТЗ.Выполнено 	= Истина;
					ПечатьЗапущена = Истина;
					//WordFile.Close(Ложь);
					СтрокаТЗ.ПропуститьКонвертацию = ИСТИНА;
				Исключение
					//Попытка
					//	WordFile.Close(Ложь);
					//Исключение
					//КонецПопытки;
					МассивОшибокКонвертации.Добавить("Не удалось конвертировать файл " + СтрокаТЗ.ПолноеИмяВходящегоФайла + ". Описание ошибки: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;		
			Если ПечатьЗапущена Тогда
				//ИмяФайла = Принтер.Profile.OutputLocation.FolderPath + "\" + Принтер.Profile.OutputLocation.FileName;
				//ОжиданиеСозданияПоследнегоФайла(ИмяФайла, 3);
				ОжиданиеСтатусаПринтера(Принтер, 10);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//чкн
Функция ПроверкаПутиAdobeReader()
	
	ПутьAdobeReader = "";
	
	Если ПроверитьФайлНаСервере("C:\Program Files (x86)\Adobe\Acrobat Reader DC\Reader\AcroRd32.exe") Тогда 
		ПутьAdobeReader = "C:\Program Files (x86)\Adobe\Acrobat Reader DC\Reader\AcroRd32.exe";
	ИначеЕсли ПроверитьФайлНаСервере("C:\Program Files (x86)\Adobe\Reader 11.0\Reader") Тогда 
		ПутьAdobeReader = "C:\Program Files (x86)\Adobe\Reader 11.0\Reader\AcroRd32.exe";
	ИначеЕсли ПроверитьФайлНаСервере("C:\Program Files\Adobe\Reader 11.0\Reader") Тогда
		ПутьAdobeReader = "C:\Program Files\Adobe\Reader 11.0\Reader\AcroRd32.exe";
	ИначеЕсли ПроверитьФайлНаСервере("C:\Program Files (x86)\Adobe\Reader 10.0\Reader") Тогда
		ПутьAdobeReader = "C:\Program Files (x86)\Adobe\Reader 10.0\Reader\AcroRd32.exe";
	Иначе
		Если РольДоступна("уб_ЗП_ПолныйДоступ") Тогда
			Сообщить("Adobe Reader не найден");
		КонецЕсли;	
		ПутьAdobeReader = "C:\Program Files (x86)\Adobe\Reader 9.0\Reader\AcroRd32.exe";
	КонецЕсли;
	
	Возврат ПутьAdobeReader;
	
КонецФункции
//чкн

Процедура УдалитьКонвертированныеФайлы(СтрокаТЗ, ПутьККаталогуИсходящихФайлов)

	Если Не ПустаяСтрока(СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения) И Не ПустаяСтрока(СтрокаТЗ.РасширениеКартинки) Тогда
		Маска = СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "*" + СтрокаТЗ.РасширениеКартинки;
		Попытка
			УдалитьФайлы(ПутьККаталогуИсходящихФайлов, Маска);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуТЗОшибокКонвертации(ТЗОшибок, Текст, Конвертация = Ложь)

	СтрокаТЗ = ТЗОшибок.Добавить();
	СтрокаТЗ.Текст 			= Текст;
	СтрокаТЗ.Конвертация  	= Конвертация;

КонецПроцедуры

Функция ТЗОшибокКонвертацииВСтроку(ТЗОшибок, СсылкаНаОбъект = Неопределено)
	
	СтрокаОшибки = "";
	Если ТЗОшибок.Количество() > 0 Тогда
		Если уб_кэшируемые.ДоступностьРоли("ПолныеПрава") ТОгда
			СтрокаОшибки = "Обнаруженные ошибки при конвертации" + ?(ЗначениеЗаполнено(СсылкаНаОбъект), " " + СсылкаНаОбъект, "") + ":";
			Для Каждого СтрокаТЗ Из ТЗОшибок Цикл
				СтрокаОшибки = СтрокаОшибки + "
				|" + СтрокаТЗ.Текст;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат СтрокаОшибки;

КонецФункции // МассивОшибокКонвертацииВСтроку()

Процедура ФоноваяКонвертацияФайлов(Параметры)

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Параметры);
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("уб_СЕРВЕРные.ВыполнитьКонвертациюФайлов", МассивПараметров);
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Параметры.ВремяОжиданияФоновогоЗадания);
		ФоновоеЗадание.Отменить();
	Исключение
		ТекстСообщения = "Истекло время ожидания завершения фонового задания. " + ФоновоеЗадание.ИнформацияОбОшибке;
		ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, ТекстСообщения, Истина);
		Параметры.ИстеклоВремяОжиданияФоновогоЗадания = Истина;
		//частное оповещение на почту
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина И Не Параметры.ОтправлятьНаПочтуОшибки Тогда
			ТемаСообщения = "Истекло время ожидания завершения фонового задания. " + Параметры.СсылкаНаОбъект;
			ПараметрыСообщения = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			ПараметрыСообщения.Получатели 	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
			ПараметрыСообщения.Тема			= ТемаСообщения;
			ПараметрыСообщения.Сообщение	= ТекстСообщения;
			уб_ОбменДанными.SendMail(ПараметрыСообщения);
		КонецЕсли;
	КонецПопытки;	

КонецПроцедуры

Процедура ПрименитьФильтрыККартинке(Параметры, СтрокаТЗ)
	
	ИмяВходящегоФайла = ?(СтрокаТЗ.ТребуетсяКонвертация, СтрокаТЗ.ПолноеИмяИсходящегоФайла, СтрокаТЗ.ПолноеИмяВходящегоФайла);
	// входящий файл должен существовать (при конвертации возможна задержка создания файла даже после завершения работы виртуального принтера)
	// ожидаем файл.
	ФайлСуществует = ОжидатьСозданиеФайла(ИмяВходящегоФайла);
	Если Не ФайлСуществует Тогда
		ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Не найден входящий файл для постобработки " + ИмяВходящегоФайла, Истина);
	КонецЕсли;
	ИмяИсходящегоФайла  = СтрокаТЗ.ПолноеИмяИсходящегоФайла;
	Счетчик = 2;
	Пока ФайлСуществует Цикл
		ТекстОшибки = "";
		Пауза(Цел(Параметры.ВремяОжиданияСозданияФайла1С / 2));
		ПовернутьКартинкуПоГоризонталиИУменьшениеРазмера(
			ИмяВходящегоФайла,
			ИмяИсходящегоФайла,
			Параметры.МаксимальныйРазмерКартинки,
			?(Параметры.ПовернутьКартинкуЕслиШиринаБольшеВысоты или СтрокаТЗ.ПовернутьКартинкуЕслиШиринаБольшеВысоты = Истина, Параметры.УголПоворота, 0),
			Параметры.ПроцентыОтШириныКартинки,
			ТекстОшибки
		);
		Если ТекстОшибки = "" Тогда
			ИмяФайла = Параметры.ПутьККаталогуИсходящихФайлов + СтрокаТЗ.НачальноеИмяИсходящегоФайлаБезРасширения + "(" + Счетчик + ")" + СтрокаТЗ.РасширениеКартинки;
			Файл = Новый Файл(ИмяФайла);
			Пауза(Цел(Параметры.ВремяОжиданияСозданияФайла1С / 2));
			Если Файл.Существует() Тогда
				ИмяВходящегоФайла 	= ИмяФайла;
				ИмяИсходящегоФайла  = ИмяФайла;
				Счетчик = Счетчик + 1;
			Иначе
				ФайлСуществует = Ложь;
			КонецЕсли;
		Иначе				
			ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, ТекстОшибки, Истина);
			ФайлСуществует = Ложь;
		КонецЕсли;
		Файл = Неопределено;
	КонецЦикла;
	Картинка 	= Неопределено;
	IP 			= Неопределено;
	
КонецПроцедуры

Функция ОжидатьСозданиеФайла(ИмяФайла, ЧислоПопыток = 3, ВремяОжидания = 400)

	Файл = Новый Файл(ИмяФайла);
	ФайлСуществует = Файл.Существует();
	Счетчик = 0;
	Пока Не ФайлСуществует И Счетчик < ЧислоПопыток Цикл
		Пауза(ВремяОжидания);
		ФайлСуществует = Файл.Существует();
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Файл = Неопределено;
	Возврат ФайлСуществует;

КонецФункции // ОжидатьСозданиеФайла()

Процедура ПолучитьТаблицуКонвертацииФайлов(Параметры)
	
	СоответствиеВидовДокументовИмениПоля = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СоответствиеВидовДокументовИмениПоля();
	СчетчикКартинок = Новый Структура;
	СчетчикКартинок.Вставить("Расчетчик", 		1);
	СчетчикКартинок.Вставить("ДопСоглашение",	1);
	СчетчикКартинок.Вставить("ДругиеДокументы",	1);
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	З.Расчетчик,
	//|	З.ДопСоглашение
	//|ИЗ
	//|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
	//|ГДЕ
	//|	З.Ссылка = &Ссылка
	//|	И (З.Расчетчик <> """"
	//|			ИЛИ З.ДопСоглашение <> """")
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	З.НомерСтроки");
	//
	// строк "Расчетчик", "ДопСоглашение" и пр. потом уже не будет. Будет ТЧ и связь по уидам строк.
	// пока идентификация будет производится по значениям элемента справочника видов документов к полисам
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Вложенный.ЗначениеПоля КАК ЗначениеПоля,
	|	Вложенный.ВидДокумента КАК ВидДокумента,
	|	ЕСТЬNULL(Ф.УИД, """") КАК УИД,
	|	ЕСТЬNULL(Ф.ПутьКПапке, """") КАК ПутьКПапке,
	|	ЕСТЬNULL(Х.Путь, """") КАК ХранилищеПуть,
	|	ЕСТЬNULL(Ф.ФайлИмя, """") КАК ФайлИмя,
	|	ВЫБОР
	|		КОГДА Ф.УИД ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьЗапись,
	|	Вложенный.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		З.Расчетчик КАК ЗначениеПоля,
	|		ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.РасчетныйЛист) КАК ВидДокумента,
	|		З.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
	|	ГДЕ
	|		З.Ссылка = &Ссылка
	|		И З.Расчетчик <> """"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		З.ДопСоглашение,
	|		ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.ДопСоглашение),
	|		З.НомерСтроки
	|	ИЗ
	|		Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
	|	ГДЕ
	|		З.Ссылка = &Ссылка
	|		И З.ДопСоглашение <> """"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		З.ДругиеДокументы,
	|		ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.Прочее),
	|		З.НомерСтроки
	|	ИЗ
	|		Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
	|	ГДЕ
	|		З.Ссылка = &Ссылка
	|		И З.ДругиеДокументы <> """") КАК Вложенный
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_ХранилищаФайловБ2Б КАК Х
	|			ПО Ф.Хранилище = Х.Ссылка
	|		ПО Вложенный.ЗначениеПоля = Ф.УИД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", Параметры.СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УИД = "";
			Если Выборка.ЕстьЗапись Тогда
				ИмяФайла 	= Выборка.ФайлИмя;
				УИД			= Выборка.УИД;
			Иначе
				ИмяФайла = Выборка.ЗначениеПоля;
			КонецЕсли;
			СчетчикСтрок = Выборка.НомерСтроки;
			Если Не ПустаяСтрока(ИмяФайла) Тогда
				ИмяПоля = СоответствиеВидовДокументовИмениПоля.Получить(Выборка.ВидДокумента); 
				ОбработатьВнешнийФайл(
					ИмяФайла, 
					ИмяПоля, 
					СчетчикКартинок[ИмяПоля], 
					Параметры, 
					Выборка.НомерСтроки,
					УИД
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Параметры.МассивНомеровСтрокТЧПечататьОбразцы.Количество() > 0 Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВБ.ИмяФайлаОбразца
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК ВБ
		|		ПО З.ВидБСО = ВБ.Ссылка
		|			И (ВБ.ИмяФайлаОбразца <> """")
		|ГДЕ
		|	З.Ссылка = &Ссылка
		|	И З.НомерСтроки В(&МассивНомеровСтрокТЧПечататьОбразцы)");
		Запрос.УстановитьПараметр("Ссылка", 								Параметры.СсылкаНаОбъект);
		Запрос.УстановитьПараметр("МассивНомеровСтрокТЧПечататьОбразцы",	Параметры.МассивНомеровСтрокТЧПечататьОбразцы);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ПутьКХранилищу = уб_СЛ.ПроверитьИмяКаталога(Справочники.уб_ХранилищаФайловБ2Б.ОбразцыВидовБСО.Путь);
			Если Не ПустаяСтрока(ПутьКХранилищу) Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Счетчик = 0;
				Пока Выборка.Следующий() Цикл
					ТипФайла = Неопределено;
					Счетчик = Счетчик + 1;
					СтрокаТЗ = Параметры.ТаблицаФайлов.Добавить();
					СтрокаТЗ.КолонкаВТабличнойЧасти 	= "Образец";
					СтрокаТЗ.НомерСтрокиВДокументе		= Счетчик;
					СтрокаТЗ.ПолноеИмяВходящегоФайла    = ПутьКХранилищу + Выборка.ИмяФайлаОбразца;
					СтрокаТЗ.СтрокаВТабличнойЧасти		= "Образец" + Счетчик;
					// конвертация картинок не требуется
					СтрокаТЗ.Выполнено 			= Истина;
					СтрокаТЗ.РасширениеКартинки = уб_СЛ.ОпределитьРасширениеФайла(Выборка.ИмяФайлаОбразца);
					СтрокаТЗ.ПолноеИмяИсходящегоФайла = ПолучитьИмяВременногоФайла();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВнешнийФайл(Знач ИмяВходящегоФайла, Описание, Счетчик, Параметры, СчетчикСтрок, УИД = "")

	Перем ТипФайла;
	
	ИмяВходящегоФайла = СокрЛП(ИмяВходящегоФайла);
	СтрокаТЗ = Параметры.ТаблицаФайлов.Добавить();
	СтрокаТЗ.КолонкаВТабличнойЧасти 	= Описание;
	СтрокаТЗ.НомерСтрокиВДокументе 		= СчетчикСтрок;
	СтрокаТЗ.ПолноеИмяВходящегоФайла 	= Параметры.ПутьККаталогуВходящихФайлов + ИмяВходящегоФайла;
	Если ТребуетсяКонвертацияФайла(ИмяВходящегоФайла, ТипФайла) Тогда
		СтрокаТЗ.ПриложениеВходящегоФайла 	= ТипФайла;
		//СтрокаТЗ.ИмяИсходящегоФайла 		= Параметры.ПрефиксФайлаВКэше + СтрЗаменить(ИмяВходящегоФайла, ".", "_") + Параметры.РасширениеКартинки;
		СтрокаТЗ.РасширениеКартинки 		= Параметры.РасширениеКартинки;
	Иначе
		СтрокаТЗ.Выполнено = Истина;
		СтрокаТЗ.РасширениеКартинки = уб_СЛ.ОпределитьРасширениеФайла(ИмяВходящегоФайла);
		СтрокаТЗ.ИмяИсходящегоФайла = Параметры.ПрефиксФайлаВКэше + ИмяВходящегоФайла;
	КонецЕсли;
	//СтрокаТЗ.ИмяИсходящегоФайла 	= СтрЗаменить(СтрокаТЗ.ИмяИсходящегоФайла, Символ(160), "");
	СтрокаТЗ.НомерСтраницыОт 		= Параметры.НомерСтраницыОт;
	СтрокаТЗ.НомерСтраницыДо 		= Параметры.НомерСтраницыДо;	
	СтрокаТЗ.СтрокаВТабличнойЧасти 	= Описание + Строка(Счетчик);
	СтрокаТЗ.УИД					= УИД;
	СтрокаТЗ.ИмяВходящегоФайла      = ИмяВходящегоФайла;
	Счетчик = Счетчик + 1;	

КонецПроцедуры

Функция ТребуетсяКонвертацияФайла(Путь, ТипФайла)
	
	ПозицияXLS = Найти(Путь, ".xl");
	Если ПозицияXLS = 0 Тогда
		ПозицияDOC = Найти(Путь, ".doc");
		Если ПозицияDOC = 0 Тогда
			ПозицияDOC = Найти(Путь, ".dot");
			Если ПозицияDOC = 0 Тогда
				ПозицияDOC = Найти(Путь, ".rtf");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПозицияXLS <> 0 Тогда
		ТипФайла = "Excel";
		Возврат Истина;
	ИначеЕсли ПозицияDOC <> 0 Тогда
		ТипФайла = "Word";
		Возврат Истина;
	ИначеЕсли Найти(Путь, ".pdf")<>	0 Тогда
		ТипФайла = "PDF";
		Возврат Истина;
	Иначе
		ТипФайла = "";
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПовернутьКартинкуПоГоризонталиИУменьшениеРазмера(
	ИмяВходящегоФайла, 
	ИмяИсходящегоФайла,
	МаксимальныйРазмер 	= 0,
	УголПоворота		= 0,
	ПроцентыОтШирины	= 0,
	ТекстОшибки			= ""
	)
	
	Попытка
		Картинка = Новый COMОбъект("WIA.ImageFile");
	Исключение
		ТекстОшибки = "Ошибка при создании COM-объекта WIA.ImageFile";
		Возврат Ложь;
	КонецПопытки;
	Попытка
		Картинка.LoadFile(ИмяВходящегоФайла);
		ВыполнитьПоворот	= УголПоворота <> 0 И Картинка.Width - Картинка.Height > Картинка.Height * ПроцентыОтШирины / 100;
		УменьшитьРазмер		= МаксимальныйРазмер > 0 И (Картинка.Width > МаксимальныйРазмер Или Картинка.Height > МаксимальныйРазмер);
		Если ВыполнитьПоворот Или УменьшитьРазмер Тогда
			Попытка
				IP = Новый COMОбъект("WIA.ImageProcess");
			Исключение
				ТекстОшибки = "Ошибка при создании COM-объекта WIA.ImageProcess";
				Возврат Ложь;
			КонецПопытки;
			Счетчик = 1;
			Если УменьшитьРазмер Тогда
				IP.Filters.Add(IP.FilterInfos("Scale").FilterID);
				IP.Filters(Счетчик).Properties("MaximumWidth").Value 	= МаксимальныйРазмер;
				IP.Filters(Счетчик).Properties("MaximumHeight").Value 	= МаксимальныйРазмер;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			Если ВыполнитьПоворот Тогда
				IP.Filters.Add(IP.FilterInfos("RotateFlip").FilterID);
				IP.Filters(Счетчик).Properties("RotationAngle").Value = УголПоворота;
			КонецЕсли;			
			img = IP.Apply(Картинка);
			IP = Неопределено;
			Если ИмяИсходящегоФайла = Неопределено Или ИмяВходящегоФайла = ИмяИсходящегоФайла Тогда
				ВременныйФайл = ПолучитьИмяВременногоФайла();
				img.SaveFile(ВременныйФайл);
				Картинка = Неопределено;
				ПереместитьФайл(ВременныйФайл, ИмяВходящегоФайла);
			Иначе
				Файл = Новый Файл(ИмяИсходящегоФайла);
				Если Файл.Существует() Тогда
					Файл = Неопределено;
					ВременныйФайл = ПолучитьИмяВременногоФайла();
					img.SaveFile(ВременныйФайл);
					Картинка = Неопределено;
					ПереместитьФайл(ВременныйФайл, ИмяИсходящегоФайла);
				Иначе
					img.SaveFile(ИмяИсходящегоФайла);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИмяВходящегоФайла <> ИмяИсходящегоФайла Тогда
			Файл = Новый Файл(ИмяИсходящегоФайла);
			Если Не Файл.Существует() Тогда
				Файл = Неопределено;
				КопироватьФайл(ИмяВходящегоФайла, ИмяИсходящегоФайла);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстОшибки = "Ошибка функции поворота картинки и уменьшения размера. Имя входящего файла: " + ИмяВходящегоФайла + ", имя исходящего файла: " + ИмяИсходящегоФайла + ", описание ошибки: " + ОписаниеОшибки();
		Картинка = Неопределено;
		IP = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	Картинка = Неопределено;
	IP = Неопределено;
	Возврат Истина;
	
КонецФункции

Процедура ВыполнитьОбрезкуПолей(Параметры, СтрокаТЗ, ВремяПаузы = 100, КоличествоПауз = 30)
	
	Лево 		= СтрокаТЗ.ПолеСлева;
	Верх		= СтрокаТЗ.ПолеСверху;
	Право		= СтрокаТЗ.ПолеСправа;
	Низ			= СтрокаТЗ.ПолеСнизу;
	ИмяФайла    = СтрокаТЗ.ПолноеИмяИсходящегоФайла;
	Счетчик = 1;
	Выполнено = Ложь;
	Пока Не Выполнено Цикл
		Выполнено = Crop(Лево, Верх, Право, Низ, ИмяФайла);
		Если Не Выполнено Тогда
			Если Счетчик > КоличествоПауз Тогда
				ДобавитьСтрокуТЗОшибокКонвертации(Параметры.ТЗОшибок, "Ошибка выполнения обрезки полей", Истина);
				Выполнено = Истина;
			Иначе
				Пауза(ВремяПаузы);
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОжиданиеСтатусаПринтера(Принтер, МаксимумВремениОжидания)
	
	Старт = ТекущаяДата();
	Финиш = ТекущаяДата();
	Пока (Финиш - Старт) < МаксимумВремениОжидания Цикл
		Финиш = ТекущаяДата();
		Если Принтер.Status.State = 0 Тогда
			Прервать;
		КонецЕсли;
	Конеццикла;
	
КонецПроцедуры

Функция Crop(
	Лево,
	Верх,
	Право,
	Низ,
	ИмяВходящегоФайла, 
	Знач ИмяИсходящегоФайла = "" 
	)
	
	// функция не используется
	Если ИмяИсходящегоФайла = "" Тогда
		ИмяИсходящегоФайла = ИмяВходящегоФайла
	КонецЕсли;
	Попытка
		//http://msdn.microsoft.com/en-us/library/windows/desktop/ms630819(v=vs.85).aspx
		Картинка = Новый Comobject("WIA.ImageFile");
		Картинка.LoadFile(ИмяВходящегоФайла);		
		IP = Новый Comobject("WIA.ImageProcess");
		IP.Filters.Add(IP.FilterInfos("Crop").FilterID);
		IP.Filters(1).Properties("Left").Value   = Окр(Лево		* Картинка.HorizontalResolution	/ 25.4);
		IP.Filters(1).Properties("Top").Value    = Окр(Верх		* Картинка.VerticalResolution	/ 25.4);
		IP.Filters(1).Properties("Right").Value  = Окр(Право	* Картинка.HorizontalResolution	/ 25.4);
		IP.Filters(1).Properties("Bottom").Value = Окр(Низ		* Картинка.VerticalResolution	/ 25.4);		
		img = IP.Apply(Картинка);
		IP = Неопределено;
		Если ИмяВходящегоФайла = ИмяИсходящегоФайла Тогда
			Если Прав(ИмяВходящегоФайла, 3) = "(1)" Тогда
				ИмяВходящегоФайла = Лев(ИмяВходящегоФайла, СтрДлина(ИмяВходящегоФайла) - 3);
			КонецЕсли;
		КонецЕсли;
		Если ИмяИсходящегоФайла = Неопределено Или ИмяВходящегоФайла = ИмяИсходящегоФайла Тогда //TODO Или ИмяВходящегоФайла = ИмяИсходящегоФайла когда?
			ВременныйФайл = ПолучитьИмяВременногоФайла();
			img.SaveFile(ВременныйФайл);
			img = Неопределено;
			Картинка = Неопределено;
			//Sleep(1);
			ПереместитьФайл(ВременныйФайл, ИмяИсходящегоФайла);
		Иначе
			Файл = Новый Файл(ИмяИсходящегоФайла);
			Если Файл.Существует() Тогда
				Файл = Неопределено;
				ВременныйФайл = ПолучитьИмяВременногоФайла();
				img.SaveFile(ВременныйФайл);
				img = Неопределено;
				Картинка = Неопределено;
				ПереместитьФайл(ВременныйФайл, ИмяИсходящегоФайла);
			Иначе
				img.SaveFile(ИмяИсходящегоФайла);
				img = Неопределено;
				Картинка = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	Возврат Результат;
	
КонецФункции

Функция ИнициализацияПрофиляПринтера(Параметры, МассивОшибокКонвертации)
	
	ПутьККаталогуИсходящихФайлов 		= Параметры.ПутьККаталогуИсходящихФайлов;
	СтруктураПараметровИсходящегоФайла  = Параметры.СтруктураПараметровИсходящегоФайла;
	Попытка
		objUDC = Новый COMОбъект("UDC.APIWrapper");
	Исключение
		МассивОшибокКонвертации.Добавить("Не обнаружен COM-интерфейс принтера Universal Document Converter, в печатную форму добавлены не все прикрепленные к заявке файлы");
	КонецПопытки;	
	Если objUDC <> Неопределено Тогда
		itfPrinter = objUDC.Printers("Universal Document Converter");
		//itfPrinter.Name Свойство содержит имя виртуального принтера Universal Document Converter. Доступно только для чтения.
		//EmptyQueue() Метод удаляет из очереди печати все задания, предназначенные для виртуального принтера программы Universal Document Converter. Для вызова метода EmptyQueue необходимо обладать правами Администратора.
		//Stop() Метод останавливает печать и конвертирование текущего документа. Работает так же, как нажатие на кнопку Cancel в окне программы Universal Document Converter.
		itfProfile = itfPrinter.Profile;
		//' Use Universal Document Converter API to change settings of converterd document
		//itfProfile.PageSetup.FormName    = "A4";
		//itfProfile.PageSetup.ResolutionX = 75;
		//itfProfile.PageSetup.ResolutionY = 75;
		ЗначениеПараметра = ?(Параметры.Свойство("HeightКартинки",	ЗначениеПараметра), ЗначениеПараметра, 297);
		itfProfile.PageSetup.Height = ЗначениеПараметра;
		ЗначениеПараметра = ?(Параметры.Свойство("WidthКартинки",	ЗначениеПараметра), ЗначениеПараметра, 210);
		itfProfile.PageSetup.Width = ЗначениеПараметра;
		ЗначениеПараметра = ?(Параметры.Свойство("ResolutionX",		ЗначениеПараметра), ЗначениеПараметра, 200);
		itfProfile.PageSetup.ResolutionX = ЗначениеПараметра;
		ЗначениеПараметра = ?(Параметры.Свойство("ResolutionY",		ЗначениеПараметра), ЗначениеПараметра, 200);
		itfProfile.PageSetup.ResolutionY = ЗначениеПараметра;
		itfProfile.PageSetup.Orientation = 1;
		//PO_PORTRAIT	0	Книжная ориентация страницы
		//PO_LANDSCAPE	1	Альбомная ориентация страницы
		//
		itfProfile.FileFormat.ActualFormat = СтруктураПараметровИсходящегоФайла.КодФормата;
		ЗаполнитьЗначенияСвойств(itfProfile.FileFormat[СтрЗаменить(СтруктураПараметровИсходящегоФайла.ИмяФормата, ".", "")], СтруктураПараметровИсходящегоФайла);
		//
		ЗначениеПараметра = Параметры.ОбрезкаПолей;
		itfProfile.Adjustments.Crop.Mode = ЗначениеПараметра;
		//RP_NONE	0	Обрезка полей отсутствует
		//CRP_AUTO	1	Программа автоматически определяет поля белого цвета и обрезает их
		//CRP_ADVANCED	2	Программа определяет поля и обрезает только поля заданного с помощью свойства MarginsColor цвета с определенным в свойстве ColorTolerance максимально возможным отклонением
		//
		itfProfile.OutputLocation.Mode = 1;
		//LM_PROMPT	0	Режим работы, при котором при создании каждого выходного файла на экран будет выдаваться стандартный диалог Windows, позволяющий задачть папку и имя файла вручную
		//LM_PREDEFINED	1	Имена выходных файлов и папки, в которых они размещаются, определяются автоматически в соответствии со значениями свойств FileName и FolderPath	
		//   itfProfile.OutputLocation.FolderPath = "C:\Out";
		itfProfile.OutputLocation.FolderPath = ПутьККаталогуИсходящихФайлов;	
		//itfProfile.OutputLocation.FileName = "&[DocName(0)] -- &[Date(0)] -- &[Time(0)].&[ImageType]";
		itfProfile.OutputLocation.FileName = "Файл1"+".&[ImageType]";
		itfProfile.OutputLocation.OverwriteExistingFile = Ложь;
		//IStatus  = itfPrinter.Status;
		//Integer DocsInQueue Свойство определяет количество документов в очереди спулера, ожидающих печати на виртуальном принтере Universal Document Converter. Доступно только для чтения.
		//Integer Progress Свойство показывает прогресс выполнения задачи виртуальным принтером Universal Document Converter в процентах. Доступно только для чтения.	
		itfProfile.PostProcessing.Mode = 0;
		//PP_NONE	0	Пост-обработка отсутствует
		//PP_OPEN_FOLDER	1	После завершения процесса конвертирования будет открыта папка с выходными файлами
		//PP_OPEN_DEF_VIEWER	2	После завершения процесса конвертирования все выходные файлы будут открыты в приложении, которое назначено стандартным для данного формата
		//PP_OPEN_CUSTOM_APP	3	После завершения процесса конвертирования будет запущено приложение, указанное в свойстве CustomAppPath с параметрами, указанными в свойстве CustomAppParameters
		itfProfile.Advanced.ShowProgressWnd = Ложь;//Свойство определяет, будет или нет на экране отображаться окно с прогресс-баром процесса конвертирования. Доступно для чтения и записи.
		Возврат itfPrinter;
	КонецЕсли;		
	
КонецФункции

///////////// КОНЕЦ КОНВЕРТАЦИИ ФАЙЛОВ ////////////////

//Возвращает первое свободное имя файла в папке (итерация цифрового суффикса) 
Функция ПолучитьИмяСледующегоФайла(ЛеваяЧасть, ПраваяЧасть, ПутьКПапке, МассивЗначений) Экспорт
	
	Счетчик = 1;
	Пока Истина Цикл
		ЕстьВМассиве = МассивЗначений.Найти(ЛеваяЧасть + Строка(Счетчик) + ПраваяЧасть) <> Неопределено;
		Если Не ЕстьВМассиве Тогда
			//Файл = Новый Файл(ПутьКПапке + ЛеваяЧасть + Строка(Счетчик) + ПраваяЧасть);
			//Если Не Файл.Существует() Тогда
			Если Не ФайлСуществует(ПутьКПапке, ЛеваяЧасть + Строка(Счетчик) + ПраваяЧасть) Тогда
				Возврат ЛеваяЧасть + Строка(Счетчик) + ПраваяЧасть;
			КонецЕсли;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецФункции

Процедура СохранитьИзВременногоХранилищаНаСервер(АдресВоВременномХранилище, Приемник, ВКаталогВременныхФайлов = Ложь) Экспорт
	
	Если ВКаталогВременныхФайлов Тогда
		Приемник = КаталогВременныхФайлов() + Приемник;
	КонецЕсли;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ДвоичныеДанные.Записать(Приемник);
	
КонецПроцедуры

Функция ПроверитьФайлНаСервере(ИмяФайла, СтруктураФайла = Неопределено) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	СтруктураФайла = Новый Структура("Расширение, Размер", Неопределено, Неопределено);
	Если Файл.Существует() Тогда
		СтруктураФайла.Расширение = Файл.Расширение;
		Если Файл.Расширение <> "" Тогда//не папка
			СтруктураФайла.Размер = Файл.Размер();
		КонецЕсли;
		Файл = Неопределено;
		Возврат Истина;
	Иначе
		Файл = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ФайлСуществует(ПутьКПапке, ИмяФайла) Экспорт
	
	//objShellApp = Новый COMОбъект("Shell.Application");
	//objFolder = objShellApp.NameSpace(ПутьКПапке);
	//Старт = ТекущаяДата();
	//Финиш = ТекущаяДата();
	//Пока (Финиш - Старт) < МаксимумВремениОжидания Цикл
	//	objItem = objFolder.ParseName(ИмяФайла);
	//	Если objItem <> Неопределено Тогда
	//		objItem = Неопределено;
	//		Прервать;
	//	КонецЕсли;
	//	Финиш = ТекущаяДата();
	//КонецЦикла;
	Попытка
		objShellApp = Новый COMОбъект("Shell.Application");
		objFolder = objShellApp.NameSpace(ПутьКПапке);
		objItem = objFolder.ParseName(ИмяФайла);
		Если objItem = Неопределено Тогда
			Возврат Ложь;
		Иначе
			objItem = Неопределено;
			Возврат Истина;
		КонецЕсли;
	Исключение
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда 
			Сообщить(ПутьКПапке);
			Сообщить(ИмяФайла);
			Сообщить(ОписаниеОшибки());
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция РасчетЗП_Быстро (Период,Менеджер) Экспорт
	ЗапросБыстрыйРасчетЗП = Новый Запрос ();
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 200000
	               |	ПланыСКВ.Период КАК Период,
	               |	ПланыСКВ.Организация,
	               |	ПланыСКВ.Подразделение,
	               |	ПланыСКВ.Агент,
	               |	ПланыСКВ.План,
	               |	ПланыСКВ.НеДействует,
	               |	ПланыСКВ.Комментарий,
	               |	ПланыСКВ.Количество
	               |ПОМЕСТИТЬ ПланыПоСКВ
	               |ИЗ
	               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СрезПоследних(&ДатаСреза, ) КАК ПланыСКВ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 200000
	               |	ПланыСКВ.Период КАК Период,
	               |	ПланыСКВ.Организация,
	               |	ПланыСКВ.Подразделение,
	               |	ПланыСКВ.Агент,
	               |	ПланыСКВ.СуперПлан,
	               |	ПланыСКВ.ПерваяБонусПланка,
	               |	ПланыСКВ.НеДействует,
	               |	ПланыСКВ.Комментарий
	               |ПОМЕСТИТЬ СуперПланыПоСКВ
	               |ИЗ
	               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СрезПоследних(&ДатаСреза, ) КАК ПланыСКВ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Период,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Организация,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Подразделение,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Агент,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаДоПлана,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеПлана,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаПослеСуперПлана,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.НеДействует,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.Комментарий,
	               |	уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавкаОтПервойБонусПланки
	               |ПОМЕСТИТЬ СКВ_Проценты
	               |ИЗ
	               |	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СрезПоследних КАК уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавкиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.Период,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.Организация,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.Подразделение,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.Агент,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.ВидСП,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.СхемаРасчета,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.НеДействует,
	               |	уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних.Комментарий
	               |ПОМЕСТИТЬ Схемы
	               |ИЗ
	               |	РегистрСведений.уб_ЗП_СхемыРасчетовСМенеджерами.СрезПоследних(&ДатаСреза, ) КАК уб_ЗП_СхемыРасчетовСМенеджерамиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сотрудники.Агент,
	               |	МАКСИМУМ(Сотрудники.Подразделение) КАК Подразделение,
	               |	Сотрудники.Организация
	               |ПОМЕСТИТЬ сотрудники
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Сотрудники.Агент КАК Агент,
	               |		Сотрудники.Подразделение КАК Подразделение,
	               |		Сотрудники.Организация КАК Организация
	               |	ИЗ
	               |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаСреза, МЕСЯЦ), ) КАК Сотрудники
	               |	ГДЕ
	               |		Сотрудники.Выбытие = ЛОЖЬ
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		Сотрудники.Агент,
	               |		Сотрудники.Подразделение,
	               |		Сотрудники.Организация
	               |	ИЗ
	               |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаСреза, ) КАК Сотрудники
	               |	ГДЕ
	               |		Сотрудники.Выбытие = ЛОЖЬ) КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Агент = &Агент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сотрудники.Агент,
	               |	Сотрудники.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сотрудники.Агент КАК Агент,
	               |	Сотрудники.Подразделение КАК Подразделение,
	               |	Сотрудники.Подразделение.Владелец КАК Организация,
	               |	ИндПланПоАгенту.План КАК ПланАгента,
	               |	ИндПланПоПодразделению.План КАК ПланПодразеделения,
	               |	ИндПланПоОрганизации.План КАК ПланОрганизации,
	               |	ВЫБОР
	               |		КОГДА ИндПланПоАгенту.План ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА ИндПланПоПодразделению.План ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА ИндПланПоОрганизации.План ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ ИндПланПоОрганизации.План
	               |							КОНЕЦ
	               |					ИНАЧЕ ИндПланПоПодразделению.План
	               |				КОНЕЦ
	               |		ИНАЧЕ ИндПланПоАгенту.План
	               |	КОНЕЦ КАК ФактПлан,
	               |	ВЫБОР
	               |		КОГДА ИндПланПоАгенту.Количество ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА ИндПланПоПодразделению.Количество ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА ИндПланПоОрганизации.Количество ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ ИндПланПоОрганизации.Количество
	               |							КОНЕЦ
	               |					ИНАЧЕ ИндПланПоПодразделению.Количество
	               |				КОНЕЦ
	               |		ИНАЧЕ ИндПланПоАгенту.Количество
	               |	КОНЕЦ КАК КоличествоПлан,
	               |	ВЫБОР
	               |		КОГДА ИндСуперПланПоАгенту.СуперПлан ЕСТЬ NULL 
	               |				ИЛИ ИндСуперПланПоАгенту.СуперПлан = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА ИндСуперПланПоПодразделению.СуперПлан ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА ИндСуперПланПоОрганизации.СуперПлан ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ ИндСуперПланПоОрганизации.СуперПлан
	               |							КОНЕЦ
	               |					ИНАЧЕ ИндСуперПланПоПодразделению.СуперПлан
	               |				КОНЕЦ
	               |		ИНАЧЕ ИндСуперПланПоАгенту.СуперПлан
	               |	КОНЕЦ КАК БП2,
	               |	ВЫБОР
	               |		КОГДА ИндСуперПланПоАгенту.ПерваяБонусПланка ЕСТЬ NULL 
	               |				ИЛИ ИндСуперПланПоАгенту.ПерваяБонусПланка = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА ИндСуперПланПоПодразделению.ПерваяБонусПланка ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА ИндСуперПланПоОрганизации.ПерваяБонусПланка ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ ИндСуперПланПоОрганизации.ПерваяБонусПланка
	               |							КОНЕЦ
	               |					ИНАЧЕ ИндСуперПланПоПодразделению.ПерваяБонусПланка
	               |				КОНЕЦ
	               |		ИНАЧЕ ИндСуперПланПоАгенту.ПерваяБонусПланка
	               |	КОНЕЦ КАК БП1,
	               |	ВЫБОР
	               |		КОГДА СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаДоПлана ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаДоПлана ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаДоПлана ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаДоПлана
	               |							КОНЕЦ
	               |					ИНАЧЕ СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаДоПлана
	               |				КОНЕЦ
	               |		ИНАЧЕ СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаДоПлана
	               |	КОНЕЦ КАК ПроцентнаяСтавкаДоПлана,
	               |	ВЫБОР
	               |		КОГДА СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаПослеПлана ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаПослеПлана ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаПослеПлана ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаПослеПлана
	               |							КОНЕЦ
	               |					ИНАЧЕ СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаПослеПлана
	               |				КОНЕЦ
	               |		ИНАЧЕ СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаПослеПлана
	               |	КОНЕЦ КАК ПроцентнаяСтавкаПослеПлана,
	               |	ВЫБОР
	               |		КОГДА СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаПослеСуперПлана ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаПослеСуперПлана ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаПослеСуперПлана ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаПослеСуперПлана
	               |							КОНЕЦ
	               |					ИНАЧЕ СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаПослеСуперПлана
	               |				КОНЕЦ
	               |		ИНАЧЕ СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаПослеСуперПлана
	               |	КОНЕЦ КАК ПроцентнаяСтавкаПослеСуперПлана,
	               |	ВЫБОР
	               |		КОГДА СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаОтПервойБонусПланки ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаОтПервойБонусПланки ЕСТЬ NULL 
	               |						ТОГДА ВЫБОР
	               |								КОГДА СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаОтПервойБонусПланки ЕСТЬ NULL 
	               |									ТОГДА 0
	               |								ИНАЧЕ СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаОтПервойБонусПланки
	               |							КОНЕЦ
	               |					ИНАЧЕ СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаОтПервойБонусПланки
	               |				КОНЕЦ
	               |		ИНАЧЕ СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаОтПервойБонусПланки
	               |	КОНЕЦ КАК ПроцентнаяСтавкаОтПервойБонусПланки,
	               |	ВЫБОР
	               |		КОГДА СхемыАгент.СхемаРасчета ЕСТЬ NULL 
	               |			ТОГДА ВЫБОР
	               |					КОГДА СхемыПодразделение.СхемаРасчета ЕСТЬ NULL 
	               |						ТОГДА СхемыОрганизация.СхемаРасчета
	               |					ИНАЧЕ СхемыПодразделение.СхемаРасчета
	               |				КОНЕЦ
	               |		ИНАЧЕ СхемыАгент.СхемаРасчета
	               |	КОНЕЦ КАК Схема,
	               |	СКВ_ПроцентыПоАгенту.ПроцентнаяСтавкаПослеПлана КАК А,
	               |	СКВ_ПроцентыПоПодразделению.ПроцентнаяСтавкаПослеПлана КАК П,
	               |	СКВ_ПроцентыПоОрганизации.ПроцентнаяСтавкаПослеПлана КАК О,
	               |	Сотрудники.Подразделение.ИспользованиеВМониторинге
	               |ПОМЕСТИТЬ Планы
	               |ИЗ
	               |	сотрудники КАК Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланыПоСКВ КАК ИндПланПоАгенту
	               |		ПО Сотрудники.Агент = ИндПланПоАгенту.Агент
	               |			И (ИндПланПоАгенту.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланыПоСКВ КАК ИндПланПоПодразделению
	               |		ПО Сотрудники.Подразделение = ИндПланПоПодразделению.Подразделение
	               |			И (ИндПланПоПодразделению.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланыПоСКВ КАК ИндПланПоОрганизации
	               |		ПО Сотрудники.Организация = ИндПланПоОрганизации.Организация
	               |			И (ИндПланПоОрганизации.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуперПланыПоСКВ КАК ИндСуперПланПоАгенту
	               |		ПО Сотрудники.Агент = ИндСуперПланПоАгенту.Агент
	               |			И (ИндСуперПланПоАгенту.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуперПланыПоСКВ КАК ИндСуперПланПоПодразделению
	               |		ПО Сотрудники.Подразделение = ИндСуперПланПоПодразделению.Подразделение
	               |			И (ИндСуперПланПоПодразделению.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуперПланыПоСКВ КАК ИндСуперПланПоОрганизации
	               |		ПО Сотрудники.Организация = ИндСуперПланПоОрганизации.Организация
	               |			И (ИндСуперПланПоОрганизации.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СКВ_Проценты КАК СКВ_ПроцентыПоАгенту
	               |		ПО Сотрудники.Агент = СКВ_ПроцентыПоАгенту.Агент
	               |			И (СКВ_ПроцентыПоАгенту.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СКВ_Проценты КАК СКВ_ПроцентыПоПодразделению
	               |		ПО Сотрудники.Подразделение = СКВ_ПроцентыПоПодразделению.Подразделение
	               |			И (СКВ_ПроцентыПоПодразделению.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СКВ_Проценты КАК СКВ_ПроцентыПоОрганизации
	               |		ПО Сотрудники.Организация = СКВ_ПроцентыПоОрганизации.Организация
	               |			И (СКВ_ПроцентыПоОрганизации.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Схемы КАК СхемыАгент
	               |		ПО Сотрудники.Агент = СхемыАгент.Агент
	               |			И (СхемыАгент.НеДействует = ЛОЖЬ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Схемы КАК СхемыПодразделение
	               |		ПО Сотрудники.Подразделение = СхемыПодразделение.Подразделение
	               |			И (СхемыПодразделение.НеДействует = ЛОЖЬ)
	               |			И (СхемыПодразделение.Агент = НЕОПРЕДЕЛЕНО)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Схемы КАК СхемыОрганизация
	               |		ПО Сотрудники.Организация = СхемыОрганизация.Организация
	               |			И (СхемыОрганизация.НеДействует = ЛОЖЬ)
	               |			И (СхемыОрганизация.Агент = НЕОПРЕДЕЛЕНО)
	               |			И (СхемыОрганизация.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
	               |ГДЕ
	               |	Сотрудники.Подразделение.ИспользованиеВМониторинге = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ПланыПоСКВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СуперПланыПоСКВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Схемы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Сотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СКВ_Проценты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОП.Агент,
	               |	ОП.ЭтоКрупнаяСделка,
	               |	ОП.КВСумма,
	               |	ОП.ОплаченоФакт,
	               |	ОП.НомерВзноса,
	               |	ОП.НачисленнаяСуммаВзноса,
	               |	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
	               |	ОП.СкидкаВыплаченаяКлиенту,
	               |	ОП.Подразделение.НеОплачиватьКС КАК НеОплачиватьКС,
	               |	ОП.ВидСП,
	               |	ОП.ВознаграждениеМенеджера,
	               |	ОП.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	               |				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	               |					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	               |				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	               |			КОНЕЦ - (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	               |			ТОГДА 0
	               |		ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	               |				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	               |					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	               |				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	               |			КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	               |	КОНЕЦ * (100-ОП.ПроцентСКВ)/100 КАК СКВ,
	               |	ОП.СтраховойПолис.СК КАК СП_СК,
	               |	ОП.ВидСП КАК СП_ВидСП,
	               |	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
	               |	ОП.СтраховойПолис.Страхователь КАК Страхователь,
	               |	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
	               |	ОП.СтраховойПолис.Номер КАК НомерПолиса,
	               |	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
	               |	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
	               |	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
	               |	ОП.СтраховойПолис.Сделка КАК Сделка,
	               |	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
	               |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
	               |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
	               |	1 КАК ЕД
	               |ПОМЕСТИТЬ Оплаты
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОП
	               |ГДЕ
	               |	ОП.Агент = &Агент
	               |	И НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) = &ДатаСреза
	               |	И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	               |	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	               |	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	               |	И ОП.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ОП.СКВ) КАК СКВ,
	               |	ОП.Агент,
	               |	СУММА(ОП.СКВ * ОП.БонусПроцент / 100) КАК Бонус_КС,
	               |	СУММА(ОП.СКВ * ОП.БонусПроцентРОП / 100) КАК Бонус_КС_РОП
	               |ИЗ
	               |	Оплаты КАК ОП
	               |ГДЕ
	               |	ОП.ЭтоКрупнаяСделка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОП.Агент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОПЛАТЫ.Страхователь,
	               |	СУММА(ОПЛАТЫ.КВСумма) КАК КВСумма,
	               |	СУММА(ОПЛАТЫ.СКВ) КАК СКВ
	               |ПОМЕСТИТЬ АВТО_КС
	               |ИЗ
	               |	Оплаты КАК ОПЛАТЫ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОПЛАТЫ.Страхователь
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ОПЛАТЫ.КВСумма) > 41900
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ВЫБОР
	               |			КОГДА АВТО_КС.СКВ ЕСТЬ NULL 
	               |				ТОГДА ОП.СКВ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СКВ,
	               |	СУММА(ОП.СКВ) КАК СКВ_ПроверкаПлан,
	               |	СУММА(ВЫБОР
	               |			КОГДА АВТО_КС.СКВ ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ ОП.СКВ
	               |		КОНЕЦ) КАК СКВ_КС,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОП.НомерВзноса = 1
	               |					И (ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	               |						ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество))
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоФакт,
	               |	ОП.Агент,
	               |	СУММА(ОП.ВознаграждениеМенеджера) КАК ВознаграждениеМенеджера
	               |ПОМЕСТИТЬ Факт
	               |ИЗ
	               |	Оплаты КАК ОП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ АВТО_КС КАК АВТО_КС
	               |		ПО ОП.Страхователь = АВТО_КС.Страхователь
	               |			И (&ИспользуютсяКС = ИСТИНА)
	               |			И (ОП.НеОплачиватьКС = ЛОЖЬ)
	               |ГДЕ
	               |	ОП.ЭтоКрупнаяСделка = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОП.Агент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Планы.Агент КАК Агент,
	               |	Планы.ПроцентнаяСтавкаДоПлана КАК ПроцентДо,
	               |	Планы.ПроцентнаяСтавкаПослеПлана КАК ПроцентВыполнения,
	               |	ВЫБОР
	               |		КОГДА &Используется2БонусПланки = ИСТИНА
	               |			ТОГДА Планы.ПроцентнаяСтавкаОтПервойБонусПланки
	               |		ИНАЧЕ Планы.ПроцентнаяСтавкаПослеПлана
	               |	КОНЕЦ КАК ПроцентБП1,
	               |	Планы.ПроцентнаяСтавкаПослеСуперПлана КАК ПроцентБП2,
	               |	Планы.ФактПлан КАК План,
	               |	Планы.КоличествоПлан КАК КоличествоПлан,
	               |	Планы.БП1 КАК БП1,
	               |	Планы.БП2 КАК БП2,
	               |	Планы.Подразделение,
	               |	Планы.Схема,
	               |	ВЫБОР
	               |		КОГДА Планы.Схема = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПоСхемеСКВ
	               |ПОМЕСТИТЬ ПоказателиПлана
	               |ИЗ
	               |	Планы КАК Планы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Планы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФАКТ.Агент,
	               |	ФАКТ.СКВ,
	               |	ФАКТ.ВознаграждениеМенеджера,
	               |	ФАКТ.СКВ_КС,
	               |	ПоказателиПлана.ПроцентДо,
	               |	ПоказателиПлана.ПроцентВыполнения,
	               |	ПоказателиПлана.ПроцентБП1,
	               |	ПоказателиПлана.ПроцентБП2,
	               |	ПоказателиПлана.План,
	               |	ПоказателиПлана.БП1,
	               |	ПоказателиПлана.БП2,
	               |	ВЫБОР
	               |		КОГДА ФАКТ.СКВ_ПроверкаПлан >= ПоказателиПлана.План
	               |				И (НЕ &ИспользуетсяКоличественныйПлан = ИСТИНА
	               |					ИЛИ ПоказателиПлана.КоличествоПлан = 0
	               |					ИЛИ ФАКТ.КоличествоФакт >= ПоказателиПлана.КоличествоПлан)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ВыполненПлан,
	               |	ВЫБОР
	               |		КОГДА &ИспользуетсяКоличественныйПлан = ИСТИНА
	               |				И НЕ ПоказателиПлана.КоличествоПлан = 0
	               |				И ФАКТ.КоличествоФакт >= ПоказателиПлана.КоличествоПлан
	               |			ТОГДА 5
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДобавкаКПлану,
	               |	ВЫБОР
	               |		КОГДА ФАКТ.СКВ >= ПоказателиПлана.БП1
	               |				И (НЕ &ИспользуетсяКоличественныйПлан = ИСТИНА
	               |					ИЛИ ПоказателиПлана.КоличествоПлан = 0
	               |					ИЛИ ФАКТ.КоличествоФакт >= ПоказателиПлана.КоличествоПлан)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ВыполненаБП1,
	               |	ВЫБОР
	               |		КОГДА ФАКТ.СКВ >= ПоказателиПлана.БП2
	               |				И (НЕ &ИспользуетсяКоличественныйПлан = ИСТИНА
	               |					ИЛИ ПоказателиПлана.КоличествоПлан = 0
	               |					ИЛИ ФАКТ.КоличествоФакт >= ПоказателиПлана.КоличествоПлан)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ВыполненаБП2,
	               |	ПоказателиПлана.Подразделение,
	               |	ПоказателиПлана.ПоСхемеСКВ
	               |ПОМЕСТИТЬ Предварительная
	               |ИЗ
	               |	Факт КАК ФАКТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиПлана КАК ПоказателиПлана
	               |		ПО ФАКТ.Агент = ПоказателиПлана.Агент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ФАКТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Предварительная.Агент,
	               |	Предварительная.СКВ,
	               |	Предварительная.СКВ_КС,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА Предварительная.ПоСхемеСКВ
	               |					И Предварительная.ВыполненПлан = ИСТИНА
	               |				ТОГДА Предварительная.СКВ_КС * (Предварительная.ПроцентВыполнения + 5) / 100
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Бонус_КС,
	               |	Предварительная.ВознаграждениеМенеджера,
	               |	Предварительная.ПроцентДо + ВЫБОР
	               |		КОГДА Предварительная.ВыполненПлан = ЛОЖЬ
	               |			ТОГДА Предварительная.ДобавкаКПлану
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентДо,
	               |	Предварительная.ПроцентВыполнения,
	               |	Предварительная.ПроцентБП1,
	               |	Предварительная.ПроцентБП2,
	               |	Предварительная.План,
	               |	Предварительная.БП1,
	               |	Предварительная.БП2,
	               |	Предварительная.ВыполненПлан,
	               |	Предварительная.ВыполненаБП1,
	               |	Предварительная.ВыполненаБП2,
	               |	ВЫБОР
	               |		КОГДА Предварительная.ВыполненПлан = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА Предварительная.ВыполненаБП1 = ИСТИНА
	               |						ТОГДА Предварительная.БП1
	               |					ИНАЧЕ Предварительная.СКВ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДОБП1,
	               |	ВЫБОР
	               |		КОГДА Предварительная.ВыполненаБП1
	               |			ТОГДА ВЫБОР
	               |					КОГДА Предварительная.ВыполненаБП2
	               |						ТОГДА Предварительная.БП2 - Предварительная.БП1
	               |					ИНАЧЕ Предварительная.СКВ - Предварительная.БП1
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДОБП2,
	               |	ВЫБОР
	               |		КОГДА Предварительная.ВыполненаБП2
	               |			ТОГДА Предварительная.СКВ - Предварительная.БП2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СвышеБП2,
	               |	Предварительная.Подразделение,
	               |	Предварительная.ПоСхемеСКВ
	               |ПОМЕСТИТЬ ОценкаСумм
	               |ИЗ
	               |	Предварительная КАК Предварительная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Предварительная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Оплаты.Ссылка,
	               |	Оплаты.Агент
	               |ИЗ
	               |	Оплаты КАК Оплаты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АВТО_КС КАК АВТО_КС
	               |		ПО Оплаты.Страхователь = АВТО_КС.Страхователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ОПЛАТЫ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОценкаСумм.Агент КАК Агент,
	               |	ОценкаСумм.СКВ + ВЫБОР
	               |		КОГДА ОценкаСумм.ВыполненПлан = ЛОЖЬ
	               |			ТОГДА ОценкаСумм.СКВ_КС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СКВ,
	               |	ОценкаСумм.СКВ_КС,
	               |	ОценкаСумм.ВознаграждениеМенеджера,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ОценкаСумм.ПоСхемеСКВ
	               |				ТОГДА ВЫБОР
	               |						КОГДА ОценкаСумм.ВыполненПлан = ЛОЖЬ
	               |							ТОГДА (ОценкаСумм.СКВ + ОценкаСумм.СКВ_КС) * ОценкаСумм.ПроцентДо / 100
	               |						ИНАЧЕ ОценкаСумм.ДОБП1 * ОценкаСумм.ПроцентВыполнения / 100 + ОценкаСумм.ДОБП2 * ОценкаСумм.ПроцентБП1 / 100 + ОценкаСумм.СвышеБП2 * ОценкаСумм.ПроцентБП2 / 100
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ЧИСЛО(17, 2)) КАК ЗП_СКВ,
	               |	ОценкаСумм.Бонус_КС,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ОценкаСумм.ВыполненПлан = ЛОЖЬ
	               |				ТОГДА (ОценкаСумм.СКВ + ОценкаСумм.СКВ_КС) * ОценкаСумм.ПроцентДо / 100
	               |			ИНАЧЕ ОценкаСумм.ДОБП1 * ОценкаСумм.ПроцентВыполнения / 100
	               |		КОНЕЦ КАК ЧИСЛО(17, 2)) КАК БазоваяЗП,
	               |	ВЫРАЗИТЬ(ОценкаСумм.ДОБП2 * ОценкаСумм.ПроцентБП1 / 100 КАК ЧИСЛО(17, 2)) КАК ЗПБонус1,
	               |	ВЫРАЗИТЬ(ОценкаСумм.СвышеБП2 * ОценкаСумм.ПроцентБП2 / 100 КАК ЧИСЛО(17, 2)) КАК ЗПБонус2,
	               |	ОценкаСумм.ПроцентДо,
	               |	ОценкаСумм.ПроцентВыполнения,
	               |	ОценкаСумм.ПроцентБП1,
	               |	ОценкаСумм.ПроцентБП2,
	               |	ОценкаСумм.План,
	               |	ОценкаСумм.БП1,
	               |	ОценкаСумм.БП2,
	               |	ОценкаСумм.ВыполненПлан,
	               |	ОценкаСумм.ВыполненаБП1,
	               |	ОценкаСумм.ВыполненаБП2,
	               |	ОценкаСумм.ДОБП1,
	               |	ОценкаСумм.ДОБП2,
	               |	ОценкаСумм.СвышеБП2,
	               |	ОценкаСумм.Подразделение КАК Подразделение
	               |ИЗ
	               |	ОценкаСумм КАК ОценкаСумм
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОценкаСумм.Подразделение.Наименование,
	               |	ОценкаСумм.Агент.Наименование";
	Если Менеджер=Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ОП.Агент = &Агент"+Символы.ПС+Символы.Таб+"И ","");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ГДЕ"+Символы.ПС+Символы.Таб+"Сотрудники.Агент = &Агент","");
	КонецЕсли;
	ЗапросБыстрыйРасчетЗП.Текст = ТекстЗапроса;
	ЗапросБыстрыйРасчетЗП.УстановитьПараметр("Агент",Менеджер);
	ЗапросБыстрыйРасчетЗП.УстановитьПараметр("ДатаСреза",НачалоМесяца(Период));
	ЗапросБыстрыйРасчетЗП.УстановитьПараметр("ИспользуетсяКоличественныйПлан", Период>=Дата(2013, 8,1));//По НС и имуществу
	ЗапросБыстрыйРасчетЗП.УстановитьПараметр("Используется2БонусПланки",       Период>=Дата(2012,12,1));
	ЗапросБыстрыйРасчетЗП.УстановитьПараметр("ИспользуютсяКС",                 Период>=Дата(2012,10,1));//Крупные сделки
	
	Пакеты = ЗапросБыстрыйРасчетЗП.ВыполнитьПакет();
	ВсегоПакетов = Пакеты.Количество();
	КСПоМенеджерам = Пакеты[ВсегоПакетов-3].Выгрузить();
	ПоМенеджерам   = Пакеты[ВсегоПакетов-1].Выгрузить();
	
	ПоМенеджерам.Колонки.Добавить("СписокКС");
	Для каждого Строка Из ПоМенеджерам Цикл
		Строка.СписокКС = Новый Массив;
		Для Каждого Оплата Из КСПоМенеджерам.НайтиСтроки(Новый Структура ("Агент",Строка.Агент)) Цикл
			Строка.СписокКС.Добавить(Оплата.Ссылка);
		КонецЦикла;
	КонецЦикла;
	Возврат ПоМенеджерам;
КонецФункции	

Функция SID() Экспорт
	
	Попытка
		oLocator = Новый COMОбъект("wbemScripting.Swbemlocator");
		ВМИСервис = oLocator.ConnectServer();
		mb  = "";
		Борды = ВМИСервис.ExecQuery("SELECT * FROM Win32_BaseBoard",,48);
		Для Каждого Строка Из Борды Цикл
			mb = Строка.Properties_("SerialNumber").Value;
		КонецЦикла;
		
		UA = ВМИСервис.ExecQuery("Select * from Win32_ComputerSystem",,48);
		str_UA = "";
		Для Каждого Строка2 Из UA Цикл
			//	UA = строка.Qualifiers_("UUID").Value;
			//Сообщить(UA);
			//строка2.Properties_(0).Value;
			str_UA = Строка2.Properties_("UserName").Value;
		КонецЦикла;
		
		
		str_SID = "";
		
		//Пользователи Windows //не работает нет прав?
		//UA = ВМИСервис.ExecQuery("SELECT * FROM Win32_Account");// Where Properties_.Caption="""+str_UA+"""",,48);
		//Для Каждого Строка Из UA Цикл
		//	Если Строка.Properties_("Caption").Value  = str_UA Тогда
		//		str_SID = Строка.Properties_("SID").Value;
		//	КонецЕсли;
		//КонецЦикла;
		
		//Сообщить(str_SID);
		хэшОборудования = Обработки.уб_MD5.Создать().РасчетХЭШ(str_SID + mb);
		//+приведение к виду уникального идентификатора
		Результат = Лев(хэшОборудования,8) + "-" + Сред(хэшОборудования,9,4) + "-" + Сред(хэшОборудования,13,4) + "-" + Сред(хэшОборудования,17,4) + "-" + Сред(хэшОборудования,21);
		хэшОборудования = Нрег(Результат);
		//-
		Возврат хэшОборудования;	
	Исключение
		Сообщить("При получении SID сервера"+ОписаниеОшибки());
		Возврат "86fe95ce-541b-e8ef-ce1a-071c97183942" ;
	КонецПопытки;
	
	
КонецФункции

Функция УбратьТолькоЧтениеФайла(ИмяФайлаИлиМассив, ПроверкаФайла = Истина) Экспорт

	Попытка
		FSO = Новый COMОбъект("Scripting.FileSystemObject");
	Исключение
	КонецПопытки;
	Если FSO <> Неопределено Тогда
		Результат = Истина;
		Если ТипЗнч(ИмяФайлаИлиМассив) = Тип("Строка") Тогда
			МассивИменФайлов = Новый Массив;
			МассивИменФайлов.Добавить(ИмяФайлаИлиМассив);
		Иначе
			МассивИменФайлов = ИмяФайлаИлиМассив;
		КонецЕсли;
	    Для Каждого ИмяФайла Из МассивИменФайлов Цикл
			Если ПроверкаФайла Тогда
				Файл = Новый Файл(ИмяФайла);
				ФайлСуществует = Файл.Существует();
			Иначе
				ФайлСуществует = Истина;
			КонецЕсли;
			Файл = Неопределено;
			Если ФайлСуществует Тогда
				Если ПроверкаФайла Тогда
					ФайлТолькоЧтение = Файл.ПолучитьТолькоЧтение()
				Иначе
					ФайлТолькоЧтение = Истина;
				КонецЕсли;
				Если ФайлТолькоЧтение Тогда
					Попытка
						File = FSO.GetFile(ИмяФайла);
						File.Attributes = File.Attributes - 1;				
					Исключение
						Результат = Ложь;
					КонецПопытки;
				Иначе
					Результат = Ложь;
				КонецЕсли;
			Иначе
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;	

КонецФункции // УбратьТолькоЧтениеУФайла()

//Функция ПроверитьНеобходимостьПоворотаКартинки(ФайлРасширение) Экспорт//, ПутьККартинке, СтруктураКартинки = Неопределено
//	
//	Возврат ФайлРасширение <> ".xls"
//		И ФайлРасширение <> ".xlsx"
//		И ФайлРасширение <> ".xlsm"
//		И ФайлРасширение <> ".xlt"
//		И ФайлРасширение <> ".xltm"
//		И ФайлРасширение <> ".xltx"
//		И ФайлРасширение <> ".xlw"
//		И ФайлРасширение <> ".dot"
//		И ФайлРасширение <> ".dotx"
//		И ФайлРасширение <> ".docm"
//		И ФайлРасширение <> ".doc"
//		И ФайлРасширение <> ".docx";
//	
//КонецФункции

//Для серверного исполнения регламентного задания
Процедура ВыполнитьРегламент(ИмяПроцедуры) Экспорт
	
	Выполнить("уб_МодульРегламентныхЗаданий." + ИмяПроцедуры + "()");
	
КонецПроцедуры

Функция КаталогВременныхФайловНаСервере() Экспорт

	Возврат КаталогВременныхФайлов();

КонецФункции // ВыполнитьНаСервере()

Функция СоздатьПользователя(ИмяПользователя,ПолноеИмяПользователя) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	
	ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();

	ОбъектПользователь.Код          = ИмяПользователя;
	ОбъектПользователь.Наименование = ПолноеИмяПользователя;

	Попытка
		
		ОбъектПользователь.Записать();
		ТекущийПользователь = ОбъектПользователь.Ссылка;
	Исключение
		
		ОписаниеОшибкиОпределенияПользователя = "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
		|" + ОписаниеОшибки();
		Возврат Ложь;
		
	КонецПопытки;
	
	
	Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Отбор.Пользователь.Значение      = ТекущийПользователь;
	
	// Инициализируем признак учета по всем организациям
	Режим = Истина;
	
	// установим пользователю основную организацию
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		Выборка = Запрос.Выполнить().Выбрать();

		КоличествоЗаписейВВыборке = Выборка.Количество();
		
		Если КоличествоЗаписейВВыборке = 1 Тогда

			// выбирать не из чего - запишем значения без лишних вопросов
			Выборка.Следующий();
			ОсновнаяОрганизация = Выборка.Ссылка;
				
		ИначеЕсли КоличествоЗаписейВВыборке > 0 Тогда

			ФормаВыбора = ПолучитьОбщуюФорму("УправлениеУчетомПоОрганизациям");

			СтруктураВозврата = ФормаВыбора.ОткрытьМодально();

			Если (СтруктураВозврата <> Неопределено) Тогда
				Режим               = СтруктураВозврата.Режим;
				ОсновнаяОрганизация = СтруктураВозврата.Организация;
			КонецЕсли;
									
			Если ОсновнаяОрганизация = Неопределено Тогда
				ОсновнаяОрганизация = Справочники.Организации.ПустаяСсылка()
			КонецЕсли;

		КонецЕсли;			

		Запись = Набор.Добавить();

		Запись.Пользователь = ТекущийПользователь;
		Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
		Запись.Значение     = ОсновнаяОрганизация;
		
	КонецЕсли;

	Запись = Набор.Добавить();
	
	Запись.Пользователь = ТекущийПользователь;
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ЗапрашиватьПодтверждениеПриЗакрытии;
	Запись.Значение     = Истина;

	//Запись = Набор.Добавить();
	//
	//Запись.Пользователь = ТекущийПользователь;
	//Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ПоказыватьВДокументахСчетаУчета;
	//Запись.Значение     = Истина;
	
	Запись = Набор.Добавить();

	Запись.Пользователь = ТекущийПользователь;
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.УчетПоВсемОрганизациям;
	Запись.Значение     = Режим;
	
	Запись = Набор.Добавить();

	Запись.Пользователь = ТекущийПользователь;
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный;
	Запись.Значение     = ТекущийПользователь;

	Попытка
		
		Набор.Записать();
		
	Исключение
		
		ОписаниеОшибкиОпределенияПользователя = "Ошибка при записи настроек нового пользователя.
			|" + ОписаниеОшибки();
		Возврат Ложь;
		
	КонецПопытки;
	
	#Если Клиент Тогда
		Если НЕ Константы.НомерВерсииКонфигурации.Получить() = "" Тогда
			Сообщить("Пользователь зарегистрирован в справочнике пользователей.");
		КонецЕсли;
	#КонецЕсли
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции


Функция КаталогДляЗаявки(Параметры) Экспорт
	//Если Параметры.Номер>111023 Тогда
	//	Возврат ПараметрыСеанса.уб_Константы.КаталогСохраненияФайловЗаявок+""+Формат(Параметры.Номер,"ЧГ=")+"-"+уб_temp.УбратьСимволы(Параметры.Страхователь)+"-"+уб_temp.УбратьСимволы(Параметры.Менеджер)
	//	+"\"+Параметры.ВидБСО;
	//Иначе	
		Возврат ПараметрыСеанса.уб_Константы.КаталогСохраненияФайловЗаявок+""+Формат(Параметры.Номер,"ЧГ=")+"-"+уб_temp.УбратьСимволы(Параметры.Страхователь)+"-"+уб_temp.УбратьСимволы(Параметры.Менеджер)
	//КонецЕсли;	
КонецФункции

Функция СинхронизацияФайловЗаявки(Параметры) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Ошибки ="";
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ФайлыКПолисам.ПутьКПапке,
		               |	уб_ФайлыКПолисам.Хранилище.Путь,
		               |	уб_ФайлыКПолисам.ФайлИмя,
		               |	уб_ФайлыКПолисам.Страхователь,
		               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО, """") КАК ВидБСО,
		               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерСтроки,1) как НомерСтроки
		               |ИЗ
		               |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК СписокФайлов
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
		               |			ПО (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &СтраховойПолис)
		               |				И (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки = СписокФайлов.УидСтроки)
		               |		ПО (СписокФайлов.Ссылка = &СтраховойПолис)
		               |			И уб_ФайлыКПолисам.УИД = СписокФайлов.СсылкаСправочника
		               |ГДЕ
		               |	( НЕ СписокФайлов.СсылкаСправочника ЕСТЬ NULL )
		               |	И уб_ФайлыКПолисам.Архив = ЛОЖЬ";
		//Запрос.УстановитьПараметр("Файлы",
		//Параметры.Файлы);
		Запрос.УстановитьПараметр("СтраховойПолис",Параметры.Ссылка);
		//Запрос.УстановитьПараметр("УИД",Параметры.Ссылка.СписокФайлов.Выгрузить().ВыгрузитьКолонку("СсылкаСправочника"));
		
		
		
		ИмяПапки = КаталогДляЗаявки(Параметры);
		
		ВыборкаФайлы = Запрос.Выполнить().Выбрать();
		Если Параметры.Номер<=111023 Тогда
			Если ВыборкаФайлы.Количество()>0 Тогда
				Создатькаталог(ИмяПапки);
			КонецЕсли;	
		КонецЕсли;	
			
		Пока ВыборкаФайлы.Следующий() Цикл
			Если Параметры.Номер>111023 и Не ВыборкаФайлы.ВидБСО ="" Тогда
				КаталогДляЗаявки_ = ИмяПапки+"\"+уб_B2B.УбратьСимволы(ВыборкаФайлы.ВидБСО,"")+?(ВыборкаФайлы.НомерСтроки=1,"",ВыборкаФайлы.НомерСтроки);
			Иначе
				КаталогДляЗаявки_ = ИмяПапки;
			КонецЕсли;	
			Файл = Новый Файл(КаталогДляЗаявки_);
			Если НЕ Файл.Существует() Тогда
				СоздатьКаталог(КаталогДляЗаявки_);
			КонецЕсли;	
				
			ФайлДСП = КаталогДляЗаявки_+"\"+ВыборкаФайлы.ФайлИмя; 		
			ФайлХ = Новый Файл(ФайлДСП);
			Если ФайлХ.Существует() = Ложь Тогда
				ИмяВХранилище = ""+ВыборкаФайлы.ХранилищеПуть+"\"+ВыборкаФайлы.ПутьКПапке+"\"+ВыборкаФайлы.ФайлИмя;
				ФайлХ = Новый Файл(ИмяВХранилище);
				Если ФайлХ.Существует() = Истина Тогда
					Попытка
						КопироватьФайл(ИмяВХранилище,ФайлДСП);
					Исключение
						Ошибки = Ошибки+ ОписаниеОшибки()+Символы.ПС;
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		Если ПустаяСтрока(Ошибки) Тогда
			возврат Истина;
		Иначе
			Возврат Ошибки;
		КонецЕсли;	
	КонецФункции	
	
	Функция _УдалитьФайлы(ИмяФайла)  Экспорт
		Попытка
			УдалитьФайлы(ИмяФайла);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;	
	КонецФункции	
	Функция _КопироватьФайл(ИмяФайла1,ИмяФайла2) Экспорт
		Попытка
			КопироватьФайл(ИмяФайла1,ИмяФайла2);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;	
	КонецФункции	
	
	
Функция _СоздатьКаталог(Имя) Экспорт
		Попытка
			СоздатьКаталог(Имя);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;	
КонецФункции	
	
Функция ВыгрузитьФайлыПоЗаявке(Заявка,пользователь) Экспорт
    УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СписокФайлов.Ссылка.Номер КАК Номер,
	               |	СписокФайлов.Ссылка.НомерЗаявки КАК НомерЗаявки,
	               |	СписокФайлов.Ссылка.Страхователь КАК Страхователь,
	               |	БСО.ВидБСО,
	               |	СписокФайлов.СсылкаСправочника,
	               |	СписокФайлов.УидСтроки,
	               |	уб_ФайлыКПолисам.ФайлИмя,
	               |	уб_ФайлыКПолисам.ПутьКПапке,
	               |	уб_ФайлыКПолисам.Хранилище.Путь КАК путь
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК СписокФайлов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |		ПО (уб_ФайлыКПолисам.УИД = СписокФайлов.СсылкаСправочника)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСО
	               |		ПО (БСО.УидСтроки = СписокФайлов.УидСтроки)
	               |ГДЕ
	               |	СписокФайлов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заявка);	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	//Директория ="D:\!1C\_выгрузка\";
	Директория = Пользователь.ПутьКОбщейПапке;
	Если ПустаяСтрока(Директория)  Тогда
		Сообщить("Не задан путь для сохранения у пользователя, обратитесь к администратору");
		Возврат 0;
	ИначеЕсли СуществуетФайл(Директория)  = Ложь Тогда	
		Сообщить("Отсутствует папка пользователя "+Директория +" или нет прав");
		Возврат 0;
	КонецЕсли;	
	Если Прав(Директория,1)<>"\" тогда
		Директория = Директория+"\";
	КонецЕсли;	
	Счетчик = 0;
	Суффикс ="";
	МассивСозданныхФайлов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик+1;
		#Если Клиент Тогда
			Состояние(""+Окр(100*Счетчик/Всего,2)+"%");
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		//Старый путь
		ИмяФайла1 = Выборка.Путь+"\"+Выборка.ПутьКПапке+"\"+Выборка.ФайлИмя;
		//Если Суффикс = "" Тогда
			Суффикс =Формат(Выборка.Номер,"ЧГ=")+" - "+ уб_temp.УбратьСимволы(Выборка.Страхователь)+"\"+уб_temp.УбратьСимволы(Строка(Выборка.ВидБСО));
		//КонецЕсли;	
		СоздатьКаталог(Директория+Суффикс);
		//Новый путь
		ИмяФайла2 = Директория+Суффикс+"\"+Выборка.ФайлИмя;
		
		
		Если СуществуетФайл(ИмяФайла1) Тогда
			КопироватьФайл(ИмяФайла1,ИмяФайла2);
			МассивСозданныхФайлов.Добавить(ИмяФайла2);
		КонецЕсли;	
	КонецЦикла;
	Текст = Новый ТекстовыйДокумент();
	ИмяФайла = "D:\!1C\_выгрузка\CписокФайлов.txt";
	Если СуществуетФайл(ИмяФайла) Тогда
		Текст.Прочитать(ИмяФайла);
	КонецЕсли;	
	Для каждого Строка из МассивСозданныхФайлов Цикл
		Текст.ДобавитьСтроку(Строка);
	КонецЦикла;	
	Текст.Записать(ИмяФайла);
	Возврат Счетчик;
КонецФункции	

Функция СуществуетФайл(Имя)
	Файл = Новый Файл(Имя);
	Возврат Файл.Существует();
КонецФункции	
	
	
Функция КартыСотрудники() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КошелькиСотрудники.Сотрудник,
	|	КошелькиСотрудники.Ссылка КАК Карта,
	|	Кошельки.Сотрудник КАК Владелец,
	|	Кошельки.НомерТелефона,
	|	Кошельки.НомерКарты
	|ИЗ
	|	Справочник.Кошельки КАК Кошельки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кошельки.Сотрудники КАК КошелькиСотрудники
	|		ПО (КошелькиСотрудники.Ссылка = Кошельки.Ссылка)
	|ГДЕ
	|	Кошельки.Актуальность
	|	И Кошельки.ЭтоКартаСотрудника";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция Карты(Сотрудник,ВыбКарта = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КошелькиСотрудники.Сотрудник КАК Сотрудник,
	               |	КошелькиСотрудники.Ссылка КАК Карта,
	               |	Кошельки.Наименование КАК Наименование,
	               |	Кошельки.Сотрудник КАК Владелец,
	               |	Кошельки.НомерТелефона КАК НомерТелефона,
	               |	Кошельки.НомерКарты КАК НомерКарты,
	               |	ВЫБОР
	               |		КОГДА КошелькиСотрудники.Ссылка = &ВыбКарта
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Приоритетная
	               |ИЗ
	               |	Справочник.Кошельки КАК Кошельки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кошельки.Сотрудники КАК КошелькиСотрудники
	               |		ПО (КошелькиСотрудники.Ссылка = Кошельки.Ссылка)
	               |ГДЕ
	               |	Кошельки.Актуальность
	               |	И Кошельки.ЭтоКартаСотрудника
	               |	И КошелькиСотрудники.Сотрудник = &Сотрудник
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритетная УБЫВ";
	Запрос.УстановитьПараметр("ВыбКарта",ВыбКарта);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	

Функция НомерДоговора(ВидБСО, ОрганизацияАгент, Дата = Неопределено) Экспорт

	Если Не (ЗначениеЗаполнено(ВидБСО) 
		И ЗначениеЗаполнено(ОрганизацияАгент) 
		И ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО")
		И ВидБСО.Тип = Перечисления.уб_ТипыБСО.Полис
		) Тогда
		Возврат ""
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПБ.Ссылка.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Поставщик
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК ПБ
	|ГДЕ
	|	ПБ.ВидБСО = &ВидБСО
	|	И ПБ.Ссылка.ОрганизацияАгент = &ОрганизацияАгент
	|	И ПБ.Ссылка.Дата <= &Дата
	|	И ПБ.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДК.Наименование,
	|	ДК.ДатаЗаключенияДоговора,
	|	ДК.ВидСП КАК ВидСП
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поставщик КАК ВТ_Поставщик
	|		ПО ДК.Владелец = ВТ_Поставщик.Поставщик
	|ГДЕ
	|	ДК.Организация = &ОрганизацияАгент
	|	И НЕ ДК.ПометкаУдаления
	|	И ДК.РасширениеНазвания <> ""---""
	|	И (ДК.ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора > &Дата)
	|	И ДК.ДатаЗаключенияДоговора < &Дата
	|	И ДК.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСП УБЫВ");
	Запрос.УстановитьПараметр("ВидБСО",				ВидБСО);
	Запрос.УстановитьПараметр("ОрганизацияАгент",   ОрганизацияАгент);
	Запрос.УстановитьПараметр("Дата",				Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = ""
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ПустаяСтрока(Выборка.Наименование) Тогда
			Результат = "";
		Иначе
			Результат = Выборка.Наименование + ?(ЗначениеЗаполнено(Выборка.ДатаЗаключенияДоговора), " от " + Формат(Выборка.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy"), "");
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции // НомерДоговора()

Функция ДоговорПоВидуБСО(ВидБСО, Знач Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПБ.Ссылка.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Поставщик
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК ПБ
	|ГДЕ
	|	ПБ.Ссылка.Проведен
	|	И ПБ.ВидБСО = &ВидБСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СП.ВидБСО,
	|	СП.Ссылка.Вид
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
	|ГДЕ
	|	НЕ СП.Ссылка.ПометкаУдаления
	|	И СП.ВидБСО = &ВидБСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДК.Ссылка,
	|	ДК.Владелец КАК Владелец,
	|	ДК.ВидСП,
	|	ДК.ДатаЗаключенияДоговора,
	|	ДК.Наименование
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поставщик КАК ВТ_Поставщик
	|		ПО ДК.Владелец = ВТ_Поставщик.Поставщик
	|ГДЕ
	|	(ДК.ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора > &Дата)
	|	И ДК.ДатаЗаключенияДоговора <= &Дата
	|	И ДК.РасширениеНазвания <> ""---""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДК.ВидСП
	|ИТОГИ ПО
	|	Владелец");
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("Дата",	Дата);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Результат = "";
	Если Выборка.Количество() = 1 Тогда
		ВыборкаВидСП = Пакет[1].Выбрать();
		Если ВыборкаВидСП.Количество() = 1 Тогда
			ВыборкаВидСП.Следующий();
			ТекущийВидСП = ВыборкаВидСП.Вид;
		КонецЕсли;
		Выборка.Следующий();
		Выборка = Выборка.Выбрать();
		Если ТекущийВидСП <> Неопределено Тогда
			//ищем по виду сп
			Пока Выборка.Следующий() Цикл
				Если Выборка.ВидСП = ТекущийВидСП Тогда
					Результат = Выборка.Наименование + ?(ЗначениеЗаполнено(Выборка.ДатаЗаключенияДоговора), " от " + Формат(Выборка.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy"), "");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Результат = "" Тогда
			//берем первый пустой
			Выборка.Сбросить();
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат
	
КонецФункции


Функция ПроверкаДат(ДатаНачала,Аддендум) Экспорт 
	ДнейДо = ?(Аддендум,365,90);
	если (ДатаНачала > (ТекущаяДата()+65*3600*24))
		или (ДатаНачала < (ТекущаяДата()-ДнейДо*3600*24)) Тогда
		Возврат ЛОЖЬ;
	Иначе
		Возврат ИСТИНА;
	КонецЕсли;	
КонецФункции


Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт

   Массив = Новый Массив();
   СтруктураСтрокой = "";
   НужнаЗапятая = Ложь;
   Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
       Если НужнаЗапятая Тогда
           СтруктураСтрокой = СтруктураСтрокой + ",";
       КонецЕсли;
       СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
       НужнаЗапятая = Истина;
   КонецЦикла;
   Для Каждого Строка Из ТаблицаЗначений Цикл
       НоваяСтрока = Новый Структура(СтруктураСтрокой);
       ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
       Массив.Добавить(НоваяСтрока);
   КонецЦикла;
   Возврат Массив;

КонецФункции



#Область РасчетОСАГО
//1
Функция СобратьДанныеДляПродления(Полис) Экспорт
	Данные = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_СтраховойПолис.Ссылка КАК Ссылка,
	               |	уб_СтраховойПолис.Страхователь КАК Страхователь,
	               |	уб_СтраховойПолис.ОбъектСтрахования КАК ОбъектСтрахования,
	               |	уб_СтраховойПолис.СК.Наименование КАК СК,
	               |	уб_СтраховойПолис.Заявка КАК Заявка,
	               |	ЕСТЬNULL(уб_СтраховойПолис.Заявка.Номер,"""") КАК ЗаявкаНомер,
	               |	уб_СтраховойПолис.Страхователь.Наименование КАК СтраховательНаименование,
	               |	уб_СтраховойПолис.Страхователь.ДатаРождения КАК СтраховательДатаРождения,
	               |	уб_СтраховойПолис.Агент.Наименование КАК Агент,
	               |	уб_СтраховойПолис.Агент КАК АгентСсылка,
	               |	уб_СтраховойПолис.Агент.tg_id КАК Агентtg_id,
	               |	уб_СтраховойПолис.СтраховойПродукт КАК СтраховойПродукт,
	               |	уб_СтраховойПолис.ДатаОкончания КАК ДатаОкончания,
	               |	уб_СтраховойПолис.Номер КАК Номер,
	               |	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия, """") КАК ДокументСерия,
	               |	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер, """") КАК ДокументНомер,
	               |	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,ДатаВремя(1,1,1)) КАК ДатаВыдачиПаспорта,
	               |	ЕСТЬNULL(уб_ТранспортныеСредства.МаркаТС.Наименование, """") КАК МаркаТС,
	               |	ЕСТЬNULL(уб_ТранспортныеСредства.МодельТС.Наименование, """") КАК МодельТС,
	               |	ЕСТЬNULL(уб_ТранспортныеСредства.ИдентификационныйНомер, """") КАК ИдентификационныйНомер,
	               |	ЕСТЬNULL(уб_ТранспортныеСредства.РегистрационныйЗнак, """") КАК РегистрационныйЗнак,
	               |	ЕСТЬNULL(уб_ТранспортныеСредства.МощностьДвигателя, 0) КАК МощностьДвигателя,
	               |	ЕСТЬNULL(уб_СтраховойПолис.Агент.Преемник,"""") КАК АгентПреемник,
	               |	ЕСТЬNULL(уб_СтраховойПолис.Агент.Преемник.tg_id,"""") КАК АгентПреемникtg_id,
	               |	ЕСТЬNULL(уб_СтраховойПолис.Агент.Преемник.tg_name,"""") КАК АгентПреемникtg_name,
	               |	ЕСТЬNULL(уб_СтраховойПолис.Страхователь.ИНН,"""") КАК СтраховательИНН
	               |ИЗ
	               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	               |		ПО уб_СтраховойПолис.Страхователь = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	               |		ПО уб_СтраховойПолис.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
	               |ГДЕ
	               |	уб_СтраховойПолис.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Полис);
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные.Вставить("Полис",Полис);
		Данные.Вставить("ЗаявкаСсылка",Выборка.Заявка);
		Данные.Вставить("Заявка",      Выборка.ЗаявкаНомер);
		Данные.Вставить("СК",          Выборка.СК);
		Данные.Вставить("СтраховательСсылка",Выборка.Страхователь);
		Данные.Вставить("ОбъектСтрахования",Выборка.ОбъектСтрахования);
		
		Данные.Вставить("АгентСсылка",Выборка.АгентСсылка);
		ПаспортСтрока = Выборка.ДокументСерия+Выборка.ДокументНомер;
		УидСтрокиСтрахователь = "";
		Если ТипЗнч(Выборка.Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
			Данные.Вставить("Страхователь",Новый Структура("ООО,Наименование,ИНН,УидСтрокиСтрахователь",Истина,Выборка.СтраховательНаименование,Выборка.СтраховательИНН,УидСтрокиСтрахователь));
		Иначе	
			Данные.Вставить("Страхователь",Новый Структура("ООО,ФИО,ДР,Паспорт,ДатаВыдачиПаспорта,УидСтрокиСтрахователь",ЛОЖЬ,Выборка.СтраховательНаименование,Выборка.СтраховательДатаРождения,ПаспортСтрока,Выборка.ДатаВыдачиПаспорта,УидСтрокиСтрахователь));
		КонецЕсли;	
		Если ЗначениеЗаполнено(Выборка.АгентПреемник) Тогда
			Данные.Вставить("Менеджер",?(ПустаяСтрока(Выборка.АгентПреемникtg_name),Строка(Выборка.Агент) ,Выборка.АгентПреемникtg_name ));
			Данные.Вставить("userid",  Выборка.АгентПреемникtg_id);
		Иначе	
			Данные.Вставить("Менеджер",Строка(Выборка.Агент));
			Данные.Вставить("userid",  Выборка.Агентtg_id);
		КонецЕсли;	
		
		ПолныйНомер = СтрЗаменить(СокрЛП(Выборка.Номер),"-","");
		ПолныйНомер = СтрЗаменить(ПолныйНомер,"'","");
		ЭтоСерия = Истина;
		Серия = "";
		Номер = ""; 
		Для Счетчик = 1 по СтрДлина(ПолныйНомер) Цикл
			ТекСимвол = Сред(ПолныйНомер,Счетчик,1);
			
			ЭтоСерия = ЭтоСерия = Истина и Найти("0123456789",ТекСимвол)=0;
			
			Если ЭтоСерия Тогда
				Серия = Серия+ТекСимвол;
			Иначе
				Номер = Номер+ТекСимвол;
			КонецЕсли;
		КонецЦикла;
		
		Данные.Вставить("Вид",           Строка(Выборка.СтраховойПродукт));
		Данные.Вставить("ДатаОкончания", Выборка.ДатаОкончания);
		Данные.Вставить("Серия",         Серия);
		Данные.Вставить("Номер",         Номер);
		Данные.Вставить("МаркаТС",       Выборка.МаркаТС);
		Данные.Вставить("МодельТС",      Выборка.МодельТС);
		Данные.Вставить("VIN",           Выборка.ИдентификационныйНомер);
		Данные.Вставить("ГосНомер",      Выборка.РегистрационныйЗнак);
		Данные.Вставить("Мощность",      Выборка.МощностьДвигателя);
		
	КонецЕсли;	
	
	ПроверитьДаннныеДляПродления(Данные);
	
	Возврат Данные
КонецФункции	

//2
Функция ПроверитьДаннныеДляПродления(Данные) Экспорт
	
	Данные.Вставить("ВозможенРасчет",Истина);
	Если Данные.Страхователь.ООО = ЛОЖЬ Тогда
		Если ЗначениеЗаполнено(Данные.Страхователь.ДР) = ЛОЖЬ Тогда
			Данные.Вставить("ВозможенРасчет",ЛОЖЬ);
			Данные.Вставить("ОшибкаВДР",Истина);
		КонецЕсли;	
		
		//Если ЗначениеЗаполнено(Данные.Страхователь.Паспорт) = ЛОЖЬ Тогда
		//	Данные.Вставить("ОшибкаВПаспорте",Истина);
		//КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.VIN) = ЛОЖЬ Тогда
		Данные.Вставить("ОшибкаVIN",Истина);
		Данные.Вставить("ВозможенРасчет",ЛОЖЬ);
	КонецЕсли;	
	
	Возврат ЛОЖЬ
КонецФункции	

//3
Функция ОтправитьРасчет(Данные) Экспорт 
	Полис = Данные.Полис;
	Данные.Удалить("Полис");
	Данные.Удалить("ЗаявкаСсылка");
	Данные.Удалить("СтраховательСсылка");
	Данные.Удалить("ОбъектСтрахования");
	Данные.Удалить("АгентСсылка");	
	
	Строка = уб_ВызовСервера.JSON(Данные);
	
	
	//https://osago.app/rest/1cprolongation
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый httpСоединение("osago.app",,,,,,ssl);
	httpЗапрос = новый httpЗапрос("/rest/1cprolongation");
	httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
	httpЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	
	Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
	ДанныеОтвет = уб_ВызовСервера.JSONВСтруктуру(ОтветСтрокой);
	Статус = ДанныеОтвет.Получить("status");
	
	Если НЕ Статус = Неопределено  Тогда
		Если Статус = "error" или Ответ.КодСостояния <>200 Тогда
			Сообщить(ОтветСтрокой);
			url = ОтветСтрокой;
		Иначе	
			url = ДанныеОтвет.Получить("link");
			Сообщить(url);
		КонецЕсли;
		МЗ = РегистрыСведений.уб_ПредоставленныеДокументыСП.СоздатьМенеджерЗаписи();
		МЗ.Объект           = Полис;
		МЗ.ВидДокумента     = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(16);
		МЗ.ТипПодразделения = Перечисления.уб_ТипыПодразделений.ОУБСО;
		МЗ.Комментарий      = url;
		МЗ.Предоставлен     = Не Статус = "error";
		МЗ.Записать();
	КонецЕсли;
КонецФункции	

#КонецОбласти

Функция JSON(Данные) Экспорт
ЗаписьJSON = Новый ЗаписьJSON;			
ЗаписьJSON.УстановитьСтроку();
ЗаписатьJSON(ЗаписьJSON,Данные);			
Возврат ЗаписьJSON.Закрыть();
КонецФункции	

#Область Пользователи
Процедура ОбновитьПользователяВТестовойБазе(Пользователь) Экспорт
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Пользователь);
	Если ПользовательИБ = Неопределено Тогда
		Возврат 
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("АутентификацияOpenID",     ПользовательИБ.АутентификацияOpenID);
	Структура.Вставить("АутентификацияОС",         ПользовательИБ.АутентификацияОС);
	Структура.Вставить("АутентификацияСтандартная",ПользовательИБ.АутентификацияСтандартная);
	Структура.Вставить("ЗапрещеноИзменятьПароль",  ПользовательИБ.ЗапрещеноИзменятьПароль);
	Структура.Вставить("ЗащитаОтОпасныхДействий",  ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях);
	Структура.Вставить("Имя",                      ПользовательИБ.Имя);
	Структура.Вставить("ОсновнойИнтерфейс",        ?(ПользовательИБ.ОсновнойИнтерфейс=Неопределено,"уб_Базовый",ПользовательИБ.ОсновнойИнтерфейс.Имя));
	//Структура.Вставить("ОсновнойИнтерфейс",        ПользовательИБ.ОсновнойИнтерфейс.Имя);
	Структура.Вставить("СохраняемоеЗначениеПароля",ПользовательИБ.СохраняемоеЗначениеПароля);
	Структура.Вставить("ПолноеИмя",                ПользовательИБ.ПолноеИмя);                    
	Структура.Вставить("ПользовательОС",           ПользовательИБ.ПользовательОС);
	Структура.Вставить("УникальныйИдентификатор",  Строка(ПользовательИБ.УникальныйИдентификатор));
	Структура.Вставить("Язык",                     ?(ПользовательИБ.Язык =Неопределено,"Русский",ПользовательИБ.Язык.Имя));
	МассивРолей = Новый Массив;
	Для каждого роль из ПользовательИБ.Роли Цикл
		МассивРолей.Добавить(Роль.Имя);
	КонецЦикла;	
	Структура.Вставить("Роли",                     МассивРолей);
	Структура.Вставить("apikey",                     "fce6566b-7754-4764-ade3-ac4fdff9e226");
	Структура.Вставить("command",                     "uu");
	Строка = JSON(Структура);
	Соединение = Новый httpСоединение("work.kupipolis.ru",16789,"робот","тобортобор",,,);
	//http://work.kupipolis.ru:16789/IB83/hs/json/doc
	httpЗапрос = новый httpЗапрос("IBtest/hs/json/doc");
	httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
	
	Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	ТекСтрока = ответ.ПолучитьТелоКакСтроку();
	//Сообщить(ТекСтрока);
	
КонецПроцедуры	

Функция ОбработатьUU(Данные) Экспорт
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Данные.Имя);
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Данные.УникальныйИдентификатор));
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			ПользовательИБ.Имя = Данные.Имя;
			ПользовательИБ.УникальныйИдентификатор = Новый УникальныйИдентификатор(Данные.УникальныйИдентификатор);
		Иначе
			ПользовательИБ.Имя = Данные.Имя;	
		КонецЕсли;	
		
	КонецЕсли; 
	
	ПользовательИБ.АутентификацияOpenID      = Данные.АутентификацияOpenID;
	ПользовательИБ.АутентификацияОС          = Данные.АутентификацияОС;
	ПользовательИБ.АутентификацияСтандартная = Данные.АутентификацияСтандартная;
	ПользовательИБ.ЗапрещеноИзменятьПароль   = Данные.ЗапрещеноИзменятьПароль;
	ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
	ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Данные.ЗащитаОтОпасныхДействий;
	ПользовательИБ.ЗащитаОтОпасныхДействий   = ЗащитаОтОпасныхДействий;
	
	ПользовательИБ.ОсновнойИнтерфейс         = Метаданные.Интерфейсы.Найти( Данные.ОсновнойИнтерфейс);
	ПользовательИБ.СохраняемоеЗначениеПароля = Данные.СохраняемоеЗначениеПароля;
	ПользовательИБ.ПолноеИмя                 = Данные.ПолноеИмя;                    
	ПользовательИБ.ПользовательОС            = Данные.ПользовательОС;
	ПользовательИБ.Язык                      = Метаданные.Языки.Найти (Данные.Язык);
	ПользовательИБ.Роли.Очистить();
	Для каждого роль из Данные.Роли Цикл
		Попытка
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(роль))
		Исключение
		КонецПопытки;	
	КонецЦикла; 
	ПользовательИБ.Записать();
	Возврат Ответ(200,"OK");
КонецФункции	
#КонецОбласти

Процедура ОтправитьСтатус (Заявка,Статус) Экспорт
	
	Если ТипЗнч(Заявка.НомерЗаявки) =  Тип ("Число") Тогда
		Сообщение = Новый Структура;
		Сообщение.Вставить("Заявка",Формат(Заявка.Номер,"ЧГ="));
		Сообщение.Вставить("НомерАМО",Формат(Заявка.НомерЗаявки,"ЧГ="));
		Префикс = Префикс();
		
		Сообщение.Вставить("ref",Префикс+ПолучитьНавигационнуюСсылку(Заявка));
		Сообщение.Вставить("Менеджер",Строка(Заявка.Менеджер));
		Сообщение.Вставить("userid",Строка(Заявка.Менеджер.tg_id));
		Сообщение.Вставить("Статус",Статус);
		
		
		СообщениеСтрокой = уб_СЕРВЕРные.JSON(Сообщение);
		
		//https://kupipolis.ru/amo/main/from_1c.php?change_lead=1
		ssl = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый httpСоединение("kupipolis.ru",,,,,,ssl);
		httpЗапрос = новый httpЗапрос("amo/main/from_1c.php?change_lead=1");
		httpЗапрос.УстановитьТелоИзСтроки(СообщениеСтрокой,КодировкаТекста.UTF8);
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
			Если РольДоступна("уб_ЗП_ПолныйДоступ") Тогда
				Сообщить(Ответ.ПолучитьТелоКакСтроку());
			КонецЕсли;	
		Исключение
			Сообщить("При отправке статуса в АМО: "+ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;
КонецПроцедуры				

Функция Префикс()  Экспорт
	Возврат "https://work.kupipolis.ru:16788/IB/#";	
КонецФункции

Функция Ответ(КодОшибки,Строка= "")
	Ответ = Новый HTTPСервисОтвет(КодОшибки);
	Если Найти(Строка,"{") = Ложь Тогда
		СтрокаОтвет = уб_СЕРВЕРные.JSON(Новый Структура("error",Строка));
	Иначе
		СтрокаОтвет = Строка
	КонецЕсли;	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвет,"UTF-8");
	Возврат Ответ
КонецФункции