
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Уб_ВызовСервера.ЭтоМенеджер() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
	КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Владелец",Объект.Ссылка);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ Объект.Ссылка.ПринадлежитЭлементу(Справочники.Контрагенты.СтраховыеКомпании) Тогда
			Элементы.НаименованиеКраткое.Видимость = ЛОЖЬ;
			Элементы.НаименованиеПолное.Видимость = ЛОЖЬ;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СокрЛП(Объект.Наименование);
	Дубль = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	ЭтоМусор = Ложь;
	Если НЕ уб_ВызовСервера.ПроверитьИНН(Объект.ИНН,Объект.Ссылка,ЭтоМусор) = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ИНН";
		Сообщение.ПутьКДанным = "Объект.ИНН";
		Сообщение.Текст = "Не корректный ИНН "+Объект.ИНН;
		Сообщение.Сообщить();
		Если ЭтоМусор = ЛОЖЬ Тогда
			Отказ = Истина;	
		КонецЕсли;	
	ИначеЕсли НЕ уб_ВызовСервера.ПроверитьДубльИНН(Объект.ИНН,Объект.Ссылка,Дубль) = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ИНН";
		Сообщение.ПутьКДанным = "Объект.ИНН";
		Сообщение.Текст = "Уже есть контрагент с таким ИНН "+Объект.ИНН;
		Сообщение.КлючДанных = Дубль;
		Сообщение.Сообщить();
		Если ЭтоМусор = ЛОЖЬ Тогда
			Отказ = Истина;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
