Перем СтатусСтрока Экспорт;

Процедура ВыполнитьЗапросВебСервиса() Экспорт 
	
	XMLОтвет = queryWinHttp();
	
	РезультатЗапроса.Очистить();
		
	ФайлXML = Новый COMОбъект("MSXML2.DOMDocument");
	ФайлXML.loadXML(XMLОтвет);
	
	СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/ErrorList/ErrorInfo/*";
	ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
	
	//ошибки выполнения всего запроса 
	ДанныеОшибки  = Новый Структура;
	
	Для каждого ХМЛнода из ВыборкаXMLНод Цикл
		ДанныеОшибки.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
	КонецЦикла;
		
	Если ДанныеОшибки.Количество() = 0 тогда
		СтатусСтрока["Заголовок"] = "Не верный ответ сервера или формат ответа";
		СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
		Если Лог тогда
			Сообщить("Результат ответа сервера:");
			Сообщить(XMLОтвет);
		КонецЕсли;
		Возврат;
	Иначе
		Если ДанныеОшибки.Code <> "3" тогда
			СтатусСтрока["Заголовок"] = ДанныеОшибки.Message;
			СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
			Возврат;
		Иначе
			СтатусСтрока["Заголовок"] = ДанныеОшибки.Message;
			СтатусСтрока["ЦветТекста"] = WebЦвета.Зеленый;
		КонецЕсли;
	КонецЕсли;

	Если РежимЗапроса = "ТехОсмотр" тогда
		
		СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/TicketCarResponse/ErrorList/ErrorInfo/*";
		ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
		
		//ошибки выполнения запроса 
		Данные  = Новый Структура;
		
		Для каждого ХМЛнода из ВыборкаXMLНод Цикл
			Данные.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
		КонецЦикла;
		
		Если ДанныеОшибки.Code <> "3" тогда
			НоваяСтрока = РезультатЗапроса.Добавить();
			НоваяСтрока.Параметр = "Запрос";
			НоваяСтрока.Значение = ДанныеОшибки.Message;
		Иначе
			СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/TicketCarResponse/*";
			ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath); //selectSingleNode непосредственно значение
			Для каждого ХМЛнода из ВыборкаXMLНод Цикл
				Данные.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
			КонецЦикла;
		КонецЕсли;
		
		ВывестиРезультат(Данные);

	Иначе				
		СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/CalcKBMResponses/ErrorInfo/*";
		ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
		
		//ошибки выполнения запроса №1 
		Данные  = Новый Структура;
		ХэшОшибок = Новый Структура;
		
		Для каждого ХМЛнода из ВыборкаXMLНод Цикл
			ХэшОшибок.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
		КонецЦикла;
		//
		МассивФизлиц = СписокФизЛиц.НайтиСтроки(Новый Структура("Проверять", Истина));
		Если МассивФизлиц.Количество()=1 Тогда
			ТекФизлицо = МассивФизлиц[0].ФизЛицо;
		Иначе
			ТекФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка(); 
		КонецЕсли;	
		Если ХэшОшибок.Количество() = 0 тогда
			СтатусСтрока["Заголовок"] = "Ошибка обработки запроса №1";
			СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
		Иначе
			
			Если ХэшОшибок.Code = "3" тогда
				СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/PolicyCalc/*";
				ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath); //selectSingleNode непосредственно значение
				Для каждого ХМЛнода из ВыборкаXMLНод Цикл
					Данные.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
				КонецЦикла;
			Иначе
				НоваяСтрока = РезультатЗапроса.Добавить();
				НоваяСтрока.Параметр = "Запрос №1";
				НоваяСтрока.Значение = ХэшОшибок.Message;
				НоваяСтрока.Физлицо = ТекФизлицо;
			КонецЕсли;
			
		КонецЕсли;
	
		СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/CalcKBMResponses/CalcKBMResponse/ErrorInfo/*";
		ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
		
		//ошибки выполнения запроса №2 			
		Для каждого ХМЛнода из ВыборкаXMLНод Цикл
			ХэшОшибок.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
		КонецЦикла;
		
		Если ХэшОшибок.Количество() = 0 тогда
			СтатусСтрока["Заголовок"] = "Ошибка обработки запроса №2";
			СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
		Иначе
			
			Если ХэшОшибок.Code = "3" тогда
				СтрокаXPath = "//S:Envelope/S:Body/ns2:getKbmResponse/response/CalcResponseValue/CalcKBMResponses/CalcKBMResponse/*";
				ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath); //selectSingleNode непосредственно значение
				Для каждого ХМЛнода из ВыборкаXMLНод Цикл
					Данные.Вставить(ХМЛнода.nodeName, ХМЛнода.Text);
				КонецЦикла;
			Иначе
				НоваяСтрока = РезультатЗапроса.Добавить();
				НоваяСтрока.Параметр = "Запрос №2";
				НоваяСтрока.Значение = ХэшОшибок.Message;
				НоваяСтрока.Физлицо = ТекФизлицо;
			КонецЕсли;
		КонецЕсли;
		
		ВывестиРезультат(Данные,ТекФизлицо);
		
	КонецЕсли;
	
	ЗаменитьИмяНаПредставлениеПараметров();
	
	Если Лог тогда
		Сообщить("Результат ответа сервера:");
		Сообщить(XMLОтвет);
	КонецЕсли;
	
КонецПроцедуры

Функция queryWinHttp(СтрокаОшибки="")
	
	request = СформироватьЗапрос();
	
	//request = "<?xml version=""1.0"" encoding=""UTF-8"" ?> 
	//|<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:dkbm=""http://dkbm.rsa.soglasie.ru/"">
	//|<soapenv:Header/>
	//|<soapenv:Body>
	//|   <dkbm:getKbm>
	//|      <!--Optional:-->
	//|      <request ns=""?"">
	//|         <CalcRequestValue>
	//|            <!--Optional:-->
	//|            <TicketCarRequest>
	//|               <!--Optional:-->
	//|               <CarIdent>
	//|                  <!--Optional:-->
	//|                  <VIN>WAUZZZ8P9CA052337</VIN>
	//|                  <!--Optional:-->
	//|               </CarIdent>
	//|               <!--Optional:-->
	//|               <DriversRestriction>true</DriversRestriction>
	//|            </TicketCarRequest>
	//|         </CalcRequestValue>
	//|      </request>
	//|   </dkbm:getKbm>
	//|</soapenv:Body>
	//|</soapenv:Envelope>";
	
	// получить данные авторизации
	Авторизация = Справочники.уб_УчетныеЗаписи.НайтиПоНаименованию("https://b2b.soglasie.ru/RSAProxyEx/dkbm?wsdl");
	Если Авторизация.Пустая() тогда
		СтатусСтрока["Заголовок"] = "Нет данных для авторизации";
		СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
		Возврат "";
	КонецЕсли;
		
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");

	WinHttp.Option(2,"UTF-8");
	WinHttp.Option(4, 13056); //intSslErrorIgnoreFlags
	WinHttp.Open("POST", "https://b2b.soglasie.ru/RSAProxyEx/dkbm?wsdl", 0);
	WinHttp.SetCredentials(Авторизация.POP3User, Авторизация.POP3Password, 0);
	//WinHttp.SetCredentials("test_user","jashgj675237512",0); //параметр 1 или 0 означают прокси, да\нет
	//WinHttp.SetClientCertificate("CURRENT_USER\MY\"+ИмяСертификата);
	
	WinHttp.SetRequestHeader("Accept", "*/*");
	WinHttp.setRequestHeader("Content-Type","text/xml; charset=UTF-8");   
	WinHttp.setRequestHeader("SOAPAction", """http://dkbm.rsa.soglasie.ru"""); 

	Попытка
		WinHttp.Send(request);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

	Попытка
		Статус = WinHttp.Status;
	Исключение
		СтатусСтрока["Заголовок"] = "Превышено время ожидания";
		СтатусСтрока["ЦветТекста"] = WebЦвета.Красный;
	КонецПопытки;
	
	//Проверка ответа и его обработка
	Если WinHttp.Status <> 200 Тогда			//Если не ОК
		СтрокаОшибки = "Статус - "+WinHttp.Status + Символы.ПС + "Статус текст - "+WinHttp.StatusText +Символы.ПС + "Ответ сервера - "+WinHttp.ResponseText;
		Сообщить(СтрокаОшибки);
		WinHttp = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаОтвета = WinHttp.ResponseText;
	СтрокаОшибки = "";
	WinHttp = Неопределено;
	
	Возврат СтрокаОтвета;
	
КонецФункции

Процедура ЗаменитьИмяНаПредставлениеПараметров()
	СтруктураПредставления = Новый Соответствие;
	СтруктураПредставления.Вставить("PolicySerialKey", "Серия полиса");
	СтруктураПредставления.Вставить("PolicyNumberKey", "Номер полиса");
	СтруктураПредставления.Вставить("PolicyKBM", "Класс КБМ");
	СтруктураПредставления.Вставить("PolicyKBMValue", "Коэффицент КБМ");
	СтруктураПредставления.Вставить("InsurerName", "Страховая компания");
	СтруктураПредставления.Вставить("ErrorInfo", "Результат запроса");
	СтруктураПредставления.Вставить("DriverDocument", "Водительское удостоверение");
	СтруктураПредставления.Вставить("KBMFirstLevel", "КБМ текущий класс");
	СтруктураПредставления.Вставить("KBMNextLevel", "КБМ следующий класс");
	СтруктураПредставления.Вставить("KBMValue", "Коэффицент КБМ");
	СтруктураПредставления.Вставить("LossAmount", "Количество ДТП");
	СтруктураПредставления.Вставить("TicketExisted", "ТехОсмотр пройден");
	СтруктураПредставления.Вставить("Number", "Номер диагностической карты");
	СтруктураПредставления.Вставить("DateNextTO", "Дата следующего ТО");
	СтруктураПредставления.Вставить("Message", "Сообщение");
	СтруктураПредставления.Вставить("ErrorList", "Список ошибок");
	
	СтрокаСДатой = РезультатЗапроса.Найти("DateNextTO", "Параметр");
	Если НЕ СтрокаСДатой = Неопределено тогда
		СтрокаДаты = Лев(СтрокаСДатой.Значение, 10);
		СтрокаСДатой.Значение = Дата(СтрЗаменить(СтрокаДаты, "-", ""));
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из РезультатЗапроса цикл
		Если НЕ СтруктураПредставления[СтрокаРезультата.Параметр] = Неопределено тогда
			СтрокаРезультата.Параметр = СтруктураПредставления[СтрокаРезультата.Параметр];
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("Параметр, Значение,Физлицо");
	
КонецПроцедуры

Процедура ВывестиРезультат(СтруктураПараметров,ТекФизлицо = НЕопределено)
	
	НеВыводимыеПоля = Новый СписокЗначений;
	НеВыводимыеПоля.Добавить("ErrorList");
	НеВыводимыеПоля.Добавить("ErrorInfo");
	НеВыводимыеПоля.Добавить("Code");
	НеВыводимыеПоля.Добавить("OrgID");
	НеВыводимыеПоля.Добавить("Hash");
	
	Для Каждого Параметр ИЗ СтруктураПараметров цикл
		Если НеВыводимыеПоля.НайтиПоЗначению(Параметр.Ключ) = Неопределено тогда
			НоваяСтрока = РезультатЗапроса.Добавить();
			НоваяСтрока.Параметр = Параметр.Ключ;
			НоваяСтрока.Значение = Параметр.Значение;
			НоваяСтрока.Физлицо  = ТекФизлицо;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция СформироватьЗапрос()
	Текст = "";
	Текст = "<?xml version=""1.0"" encoding=""UTF-8"" ?> 
	|<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:dkbm=""http://dkbm.rsa.soglasie.ru/"">
	|<soapenv:Header/>
	|<soapenv:Body>
	|   <dkbm:getKbm>
	|      <request ns=""?"">";
	
	// запрос по списку водителей
	Если РежимЗапроса = "Собственник ФизЛицо(с ограничением)" тогда
		Текст = Текст + "<CalcRequestValue>
		|            <CalcKBMRequest>
		|               <CarIdent>";
		Если ЗначениеЗаполнено(РегистрационныйЗнак) тогда
			Текст = Текст + "<LicensePlate>"+РегистрационныйЗнак+"</LicensePlate>";
		КонецЕсли;
		Если ЗначениеЗаполнено(ИдентификационныйНомер) тогда
			Текст = Текст + "<VIN>"+ИдентификационныйНомер+"</VIN>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерКузова) тогда
			Текст = Текст + "<BodyNumber>"+НомерКузова+"</BodyNumber>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерШасси) тогда
			Текст = Текст + "<ChassisNumber>"+НомерШасси+"</ChassisNumber>";
		КонецЕсли;
		Текст = Текст + "</CarIdent>
		|<DriversRestriction>true</DriversRestriction>";
		ДатаРасчета = КонвертацияДаты();
		Текст = Текст + "<DateKBM>"+ДатаРасчета+"</DateKBM>";
		Текст = Текст + "<PhysicalPersons>";
		ОдноЛицо = СписокФизЛиц.Количество() = 1;
		Для Каждого Водитель Из СписокФизЛиц цикл
			Если ОдноЛицо или Водитель.Проверять = Истина Тогда
				УстановитьЗначение(Водитель.Проверять, Истина);
				мДатаРождения = Формат(Водитель.ДатаРождения, "ДФ=""дд-ММ-гггг""");
				Текст = Текст + "<PhysicalPerson>
				|<DriverDocument> 
				|<Serial>"+Водитель.Серия+"</Serial> 
				|<Number>"+Водитель.Номер+"</Number> 
				|</DriverDocument>
				|<PersonNameBirthHash>### "+Строка(Водитель.ФизЛицо)+" "+мДатаРождения+"</PersonNameBirthHash> 
				|</PhysicalPerson>"
			КонецЕсли;
		КонецЦикла;
		Текст = Текст + "</PhysicalPersons>
		|</CalcKBMRequest>
		|</CalcRequestValue>";
	КонецЕсли;
	
	//получение данных ТО
	Если РежимЗапроса = "ТехОсмотр" тогда
		Текст = Текст + "<CalcRequestValue>
		|            <TicketCarRequest>
		|               <CarIdent>";
		Если ЗначениеЗаполнено(РегистрационныйЗнак) тогда
			Текст = Текст + "<LicensePlate>"+РегистрационныйЗнак+"</LicensePlate>";
		КонецЕсли;
		Если ЗначениеЗаполнено(ИдентификационныйНомер) тогда
			Текст = Текст + "<VIN>"+ИдентификационныйНомер+"</VIN>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерКузова) тогда
			Текст = Текст + "<BodyNumber>"+НомерКузова+"</BodyNumber>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерШасси) тогда
			Текст = Текст + "<ChassisNumber>"+НомерШасси+"</ChassisNumber>";
		КонецЕсли;
		Текст = Текст + "</CarIdent>
		|               <DriversRestriction>true</DriversRestriction>
		|            </TicketCarRequest>
		|         </CalcRequestValue>";			
	КонецЕсли;
	
	//запрос без ограничения по собственникам авто: физ или юр лицо
	Если РежимЗапроса = "Собственник ФизЛицо(без ограничения)" ИЛИ РежимЗапроса = "Собственник ЮрЛицо" тогда 
		Текст = Текст + "<CalcRequestValue>
		| <CalcKBMRequest>
		| <CarIdent>";
		Если ЗначениеЗаполнено(РегистрационныйЗнак) тогда
			Текст = Текст + "<LicensePlate>"+РегистрационныйЗнак+"</LicensePlate>";
		КонецЕсли;
		Если ЗначениеЗаполнено(ИдентификационныйНомер) тогда
			Текст = Текст + "<VIN>"+ИдентификационныйНомер+"</VIN>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерКузова) тогда
			Текст = Текст + "<BodyNumber>"+НомерКузова+"</BodyNumber>";
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерШасси) тогда
			Текст = Текст + "<ChassisNumber>"+НомерШасси+"</ChassisNumber>";
		КонецЕсли;
		Текст = Текст + "</CarIdent>
		| <DriversRestriction>false</DriversRestriction>";
		ДатаРасчета = КонвертацияДаты();
		Текст = Текст + "<DateKBM>"+ДатаРасчета+"</DateKBM>";
		
		Если РежимЗапроса = "Собственник ФизЛицо(без ограничения)" тогда
			ТипДокумента = "12";
			мДатаРождения = Формат(ДатаРождения, "ДФ=""дд-ММ-гггг""");
			Текст = Текст + "<PhysicalPersons>
			|<PhysicalPerson>
			|<PersonDocument>
			|<DocPerson>"+ТипДокумента+"</DocPerson> 
			|<Serial>"+Серия+"</Serial> 
			|<Number>"+Номер+"</Number> 
			|</PersonDocument>
			|<PersonNameBirthHash>### "+Строка(ФизЛицо)+" "+мДатаРождения+"</PersonNameBirthHash> 
			|</PhysicalPerson>
			|</PhysicalPersons>";
		КонецЕсли;	
		
		Если РежимЗапроса = "Собственник ЮрЛицо" тогда			
			Текст = Текст + "<JuridicalPerson>
			|<OrgNameINNHash>### "+Строка(Организация)+" "+Строка(ИНН)+"</OrgNameINNHash> 
			|</JuridicalPerson>";		
		КонецЕсли;
		
		Текст = Текст + "</CalcKBMRequest>
		|</CalcRequestValue>";
	КонецЕсли;

	Текст = Текст +"</request>
	|   </dkbm:getKbm>
	|</soapenv:Body>
	|</soapenv:Envelope>";
	
	Если Лог тогда
		Сообщить(Текст);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция КонвертацияДаты()
	
	Результат = Формат(Дата, "ДФ=""гггг-ММ-дд""");
	Результат = Результат + "T00:00:00";
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеФизЛица(ТекущаяСтрока = Неопределено) Экспорт 
	Если ТекущаяСтрока = Неопределено Тогда 
		ЗапросПаспорт = Новый Запрос;
		ЗапросПаспорт.Текст = "ВЫБРАТЬ
		|	ПаспортныеДанныеФизЛиц.ДокументСерия,
		|	ПаспортныеДанныеФизЛиц.ДокументНомер,
		|	ПаспортныеДанныеФизЛиц.ФизЛицо.ДатаРождения
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц
		|ГДЕ
		|	ПаспортныеДанныеФизЛиц.ФизЛицо = &ФизЛицо";
		
		ЗапросПаспорт.УстановитьПараметр("ФизЛицо", ФизЛицо); 
		Данные = ЗапросПаспорт.Выполнить().Выбрать();
		Пока Данные.Следующий() цикл
			Серия = Данные.ДокументСерия;
			Номер = Данные.ДокументНомер;
			ДатаРождения = Данные.ФизЛицоДатаРождения;
		КонецЦикла;
	Иначе 
		Если ТипЗнч(ТекущаяСтрока.ФизЛицо) = Тип("СправочникСсылка.ФизическиеЛица") тогда
			ЗапросФизЛицо = Новый Запрос;
			ЗапросФизЛицо.Текст = "ВЫБРАТЬ
			|	ФизическиеЛица.ДатаРождения,
			|	ФизическиеЛица.ВодительскоеУдостоверениеСерия,
			|	ФизическиеЛица.ВодительскоеУдостоверениеНомер
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка";
			
			ЗапросФизЛицо.УстановитьПараметр("Ссылка", ТекущаяСтрока.ФизЛицо); 
			Данные = ЗапросФизЛицо.Выполнить().Выбрать();
			Пока Данные.Следующий() цикл
				ТекущаяСтрока.Серия = Данные.ВодительскоеУдостоверениеСерия;
				ТекущаяСтрока.Номер = Данные.ВодительскоеУдостоверениеНомер;
				ТекущаяСтрока.ДатаРождения = Данные.ДатаРождения;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

СтатусСтрока = Новый Соответствие;
СтатусСтрока.Вставить("Заголовок", "");
СтатусСтрока.Вставить("ЦветТекста", "");
