Процедура НажатиеСканерШК(Кнопка) Экспорт
		
		Кнопка.Пометка = НЕ Кнопка.Пометка;
		УстановитьСостояниеСканераШК(Кнопка);
		
КонецПроцедуры


Функция ЗапуститьБиблиотекуСканераШтрихкода(Сканер) Экспорт 
	Если Сканер <> 0 Тогда 
		Если Сканер.DeviceEnabled Тогда
			Возврат Истина;
		Иначе	
			Возврат ВключитьСканер(Сканер);
		КонецЕсли;
	КонецЕсли;	
	Попытка
		ЗагрузитьВнешнююКомпоненту("Scaner1C.DLL");
		//Сообщить("Внешняя компонента сканера штрих-кода успешно загружена");
        Попытка
			Сканер = Новый("AddIn.Scaner45");
			Сканер.OldVersion = Ложь; 
			Сканер.AutoDisable = Истина;
			Сканер.DataEventEnabled = Истина;
			Сканер.DeviceEnabled = Истина;
			Возврат ВключитьСканер(Сканер);
		Исключение
			Сообщить("Ошибка: Не удалось создать объект сканера штрих-кода AddIn.Scaner45.",СтатусСообщения.Важное);
			Сканер = 0;
			Возврат Ложь;
		КонецПопытки;
	Исключение
		Сообщить("Ошибка: Внешняя компонента сканера штрих-кода - Scaner1C.DLL не найдена.",СтатусСообщения.Важное);
		Сканер = 0;
		Возврат Ложь;
	КонецПопытки;
	Возврат Сканер <> 0;
КонецФункции

Функция ВключитьСканер(Сканер) Экспорт 
	Сканер.DeviceEnabled = Истина;
	Если Сканер.Результат <> 0 Тогда
		Сообщить("Ошибка при инициализации сканера штрих-кода:
		|	" + Сканер.ОписаниеУстройства + ": " + Сканер.НаименованиеТекущегоУстройства + "
		|	Порт: " + Сканер.ОписаниеПорта + "
		|	Код ошибки: " + Строка(Сканер.Результат) + "
		|	Ошибка: " + Сканер.ОписаниеРезультата + "");	
		Возврат Ложь;
	КонецЕсли;
	Возврат Сканер.DeviceEnabled;
КонецФункции

Процедура ОткрытьНастройки() Экспорт
	ЗапуститьБиблиотекуСканераШтрихкода(gScaner);
	Если gScaner <> 0 Тогда 
		gScaner.ShowProperties();
	КонецЕсли;	
КонецПроцедуры //

Процедура УстановитьСостояниеСканераШК(КнопкаСканерШК, бПриОткрытииФормы = Ложь) Экспорт
	Если бПриОткрытииФормы Тогда
		бВкл = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "АктивизироватьСканерШтрихкодаПриОткрытииФорм") И gScaner <> 0 И gScaner.DeviceEnabled; 
	Иначе
		бВкл = КнопкаСканерШК.Пометка;
	КонецЕсли;
	
	Если бВкл Тогда
		Если gScaner = 0 Или gScaner.DeviceEnabled = 1 Или НЕ gScaner.DeviceEnabled Тогда 
			бВкл = ЗапуститьБиблиотекуСканераШтрихкода(gScaner);
		КонецЕсли;
	КонецЕсли;
	КнопкаСканерШК.Текст = ?(бВкл,"Вы","В") + "ключить сканер ШК";
	КнопкаСканерШК.Подсказка = КнопкаСканерШК.Текст;
	КнопкаСканерШК.Пометка = бВкл;
	КнопкаСканерШК.Картинка = ?(бВкл,БиблиотекаКартинок.уб_СканерШКАктивен,БиблиотекаКартинок.уб_СканерШКнеАктивен);
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////

Функция УдалитьПривязкуШтрихкода(ШК, Сообщать = Истина, ЗаголовокДляОшибки = "Не удалось удалить штрихкод ") Экспорт 
	ВыборкаРС = РегистрыСведений.уб_ШтрихКод.Выбрать(Новый Структура("ШтрихКод",ШК)); 
	Пока ВыборкаРС.Следующий() Цикл
		МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
		Попытка
			МЗ.Удалить();
			Если Сообщать Тогда
				Сообщить("Удален штрихкод '" + ШК + "'");
			КонецЕсли;
		Исключение
			Сообщить(ЗаголовокДляОшибки + "'" + ШК + "', НомерБСО: " + МЗ.НомерБСО 
			+ ", ВидБСО: " +  МЗ.ВидБСО + ", СК: " + МЗ.ВидБСО.Владелец 
			+ ", Дата привязки: " +  МЗ.ДатаПривязки + ". Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			Возврат Ложь;
		КонецПопытки;	
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция УдалитьПривязкуСлояБСОкШтрихкоду(СтруктураБСО, Слой, Сообщать = Истина, ЗаголовокДляОшибки = "Не удалось удалить привязку слоя БСО к штрихкоду ") Экспорт 
	
	Если СокрЛП(СтруктураБСО.НомерБСО) = "" Тогда
		//Для БСО количественного учета эта процедура не имеет смысла
		Возврат Истина;
	КонецЕсли;
	
	ВыборкаРС = РегистрыСведений.уб_ШтрихКод.Выбрать(Новый Структура("НомерБСО",СтруктураБСО.НомерБСО)); 
	Пока ВыборкаРС.Следующий() Цикл
		Если ВыборкаРС.ВидБСО = СтруктураБСО.ВидБСО И ВыборкаРС.Слой = Слой Тогда
			МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
			Попытка
				МЗ.Удалить();
				Если Сообщать Тогда
					Сообщить("Удалена привязка слоя (" + Слой + ") БСО '" + СтруктураБСО.НомерБСО + "' к штрихкоду '" + МЗ.ШтрихКод + "'");
				КонецЕсли;
			Исключение
				Сообщить(ЗаголовокДляОшибки + "'" + МЗ.ШтрихКод + "', НомерБСО: " + МЗ.НомерБСО 
				+ ", ВидБСО: " +  МЗ.ВидБСО + ", СК: " + МЗ.ВидБСО.Владелец + ", слой: " + Слой 
				+ ", Дата привязки: " +  МЗ.ДатаПривязки + ". Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
				Возврат Ложь;
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ДобавитьПривязкуШтрихкода(СтруктураБСО, ШК, Слой = 1) Экспорт 
	ЗаголовокПриОшибке = "Не удалось удалить старую запись о штрихкоде при добавлении ";
	УдалитьПривязкуШтрихкода(ШК, Ложь, ЗаголовокПриОшибке);
	УдалитьПривязкуСлояБСОкШтрихкоду(СтруктураБСО, Слой, Ложь, ЗаголовокПриОшибке);
	МЗ = РегистрыСведений.уб_ШтрихКод.СоздатьМенеджерЗаписи();
	МЗ.ШтрихКод = ШК;
	МЗ.НомерБСО = СтруктураБСО.НомерБСО;
	МЗ.ВидБСО = СтруктураБСО.ВидБСО;
	МЗ.Поставщик = СтруктураБСО.Поставщик;
	МЗ.ОрганизацияАгент = СтруктураБСО.ОрганизацияАгент;
	МЗ.Слой = Слой;
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.ДатаПривязки = ТекущаяДата();
	Попытка
		МЗ.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Не удалось создать привязку штрихкода '" + ШК + "' к БСО: НомерБСО: " + МЗ.НомерБСО 
		+ ", ВидБСО: " +  МЗ.ВидБСО + ", СК: " + МЗ.ВидБСО.Владелец 
		+ ". Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат Ложь;
	КонецПопытки;
КонецФункции 

Функция ПолучитьМЗПривязкиШтрихкода_по_штрихкоду(ШК) Экспорт 
	ВыборкаРС = РегистрыСведений.уб_ШтрихКод.Выбрать(Новый Структура("ШтрихКод",ШК)); 
	Если НЕ ВыборкаРС.Следующий() Тогда
		//Указанного штрихкода нет в Базе
		Возврат Неопределено;
	КонецЕсли;
	
	МЗ_ШК = ВыборкаРС.ПолучитьМенеджерЗаписи();	
	
	Пока ВыборкаРС.Следующий() Цикл
		//Если есть дубли номера штрихкода, удаляем их
		МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
		Попытка
			МЗ.Удалить();
			Сообщить("Удален дубль штрихкода '" + ШК + "'");
		Исключение
			Сообщить("Не удалось удалить дубль штрихкода '" + ШК + "', НомерБСО: " + МЗ.НомерБСО 
			+ ", ВидБСО: " +  МЗ.ВидБСО + ", СК: " + МЗ.ВидБСО.Владелец 
			+ ", Дата привязки: " +  МЗ_ШК.ДатаПривязки + ". Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	
	КонецЦикла;
	Возврат МЗ_ШК;
КонецФункции

Функция ПолучитьДанныеБСОпоШтрихкоду(ШК, бРезультат_Как_МЗ_ШК = Истина, ВозвращатьРезультатВТЗ = Ложь) Экспорт 
	МЗ_ШК = ПолучитьМЗПривязкиШтрихкода_по_штрихкоду(ШК);	
	
	РезТЗ = ОбщегоНазначения.ПолучитьПустуюТаблицуЗначенийДляЗаполенинияПоЗаписиРегистраСведений("уб_ШтрихКод");
	РезТЗ.Колонки.Добавить("СК");
	РезТЗ.Колонки.Добавить("Количество");
	
	Если МЗ_ШК = Неопределено Тогда
		//Указанного штрихкода нет в Базе
		Возврат ?(ВозвращатьРезультатВТЗ,РезТЗ,Неопределено);
	КонецЕсли;

	Если бРезультат_Как_МЗ_ШК ИЛИ (НЕ уб_СЛ.ОпределитьВедетсяНомернойУчет(МЗ_ШК.ВидБСО)) Тогда
		//В случае не номерного учета возвращаем только данные регистра 
		СтрокаТЗ = РезТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, МЗ_ШК);
		РезТЗ[0].СК = РезТЗ[0].ВидБСО.Владелец;
		РезТЗ[0].Количество = 1;
		Возврат ?(ВозвращатьРезультатВТЗ,РезТЗ,РезТЗ[0]);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Д.*,
	               |	1 КАК Количество
	               |ИЗ
	               |	РегистрСведений.уб_ДвиженияБСО.СрезПервых(
	               |			,
	               |			ВидБСО = &ВидБСО
	               |				И НомерБСО = &НомерБСО
				   |				И Подтверждено
				   |				) КАК Д
	               |ГДЕ
	               |	Д.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО ИЛИ Д.Регистратор ССЫЛКА Документ.уб_ВводНачальныхОстатковБСО ";
				   
	Запрос.УстановитьПараметр("ВидБСО", МЗ_ШК.ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", МЗ_ШК.НомерБСО);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//Штрихкод привязан к несуществующему номерному БСО. Удаляем привязку 
		Попытка
			МЗ_ШК.Удалить();
			Сообщить("Удалена привязка штрихкода '" + ШК + "' к несуществующему БСО. НомерБСО: " + МЗ_ШК.НомерБСО 
			+ ", ВидБСО: " +  МЗ_ШК.ВидБСО + ", СК: " + МЗ_ШК.ВидБСО.Владелец);
		Исключение
			Сообщить("Не удалось удалить привязку штрихкода '" + ШК + "' к несуществующему БСО. НомерБСО: " + МЗ_ШК.НомерБСО 
			+ ", ВидБСО: " +  МЗ_ШК.ВидБСО + ", СК: " + МЗ_ШК.ВидБСО.Владелец 
			+ ", Дата привязки: " +  МЗ_ШК.ДатаПривязки + ". Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	
		Возврат ?(ВозвращатьРезультатВТЗ,РезТЗ,Неопределено);
	КонецЕсли;
	РезТЗ = РезультатЗапроса.Выгрузить();
	Возврат ?(ВозвращатьРезультатВТЗ,РезТЗ,РезТЗ[0]);
КонецФункции

Функция ПолучитьЦифровойКод(Сканер) Экспорт
	Попытка
		сШК = Сканер.ScanData;
		ШК = Число(сШК);
	Исключение
		ШК = 0;
	КонецПопытки;
	Возврат ШК
КонецФункции

Процедура ВнешнееСобытиеВФорме(Форма, СчитываниеВключено) Экспорт
	Если Форма.ВводДоступен() И gScaner <> 0 И СчитываниеВключено Тогда
		Попытка
			ШК = gScaner.ScanData;
		Исключение
			ШК = "";
		КонецПопытки;
		Форма.ПослеПолученияКода(ШК);
		gScaner.DeleteEvent();
		gScaner.DataEventEnabled = 1;
	КонецЕсли;
КонецПроцедуры

Процедура РучнойВводШтрихкода(Форма, ПакетныйВводВРучномРежиме = Ложь) Экспорт
	ШК = "";
	Если ВвестиСтроку(ШК, "Введите код со штрихкода:", 25, Ложь) И ШК <> "" Тогда
		Форма.ПослеПолученияКода(ШК);
		Если ПакетныйВводВРучномРежиме Тогда
			РучнойВводШтрихкода(Форма, ПакетныйВводВРучномРежиме);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗ_для_НомерногоБСО(СтруктураБСО) Экспорт 
	Если СокрЛП(СтруктураБСО.НомерБСО) = "" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Ш.ШтрихКод,
	               |	Ш.НомерБСО,
	               |	Ш.ВидБСО,
	               |	Ш.Поставщик,
	               |	Ш.ОрганизацияАгент,
	               |	Ш.Слой,
	               |	Ш.Автор,
	               |	Ш.ДатаПривязки
	               |ИЗ
	               |	РегистрСведений.уб_ШтрихКод КАК Ш
	               |ГДЕ
	               |	Ш.НомерБСО = &НомерБСО
	               |	И Ш.ВидБСО = &ВидБСО";
	Запрос.УстановитьПараметр("ВидБСО", СтруктураБСО.ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", СтруктураБСО.НомерБСО);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

//Функция ПолучитьМЗПривязкиШтрихкода_по_СлоюБСО(СтруктураБСО, Слой) Экспорт 
//	ВыборкаРС = РегистрыСведений.уб_ШтрихКод.Выбрать(Новый Структура("НомерБСО",СтруктураБСО.НомерБСО)); 
//	Если НЕ ВыборкаРС.Следующий() Тогда
//		//Указанного штрихкода нет в Базе
//		Возврат Неопределено;
//	КонецЕсли;
//	МЗ_ШК = ВыборкаРС.ПолучитьМенеджерЗаписи();	
//	Пока ВыборкаРС.Следующий() Цикл
//		//Если есть дубли слоя БСО, удаляем их
//		Если ВыборкаРС.ВидБСО = СтруктураБСО.ВидБСО И ВыборкаРС.Слой = Слой Тогда
//			МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
//			Попытка
//				МЗ.Удалить();
//				Сообщить("Удален дубль привязки слоя (" + Слой + ") БСО '" + СтруктураБСО.НомерБСО + "' к штрихкоду '" + МЗ.ШтрихКод + "'");
//			Исключение
//				Сообщить("Не удалось удалить дубль слоя (" + Слой + ") БСО: НомерБСО: " + МЗ.НомерБСО 
//				+ ", ВидБСО: " +  МЗ.ВидБСО + ", СК: " + МЗ.ВидБСО.Владелец  
//				+ ", Дата привязки: " +  МЗ_ШК.ДатаПривязки + ", ШК: '" + МЗ.ШтрихКод + "'. Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
//			КонецПопытки;	
//		КонецЕсли;
//	КонецЦикла;
//	Возврат МЗ_ШК;
//КонецФункции
Функция ПодключитьВнешнююКомпонентуПечатиШтрихкода() Экспорт
	
	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
	СистемнаяИнформация = Новый СистемнаяИнформация;

	//Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
	//ПолучитьОбщийМакет("КомпонентаПечатиШтрихкодовWindows32");	
	//УстановитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows32");
	//УстановитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows64");
	путь = "ОбщийМакет.КомпонентаПечатиШтрихкодовWindows32";
	ПодключениеВыполнено = ПодключитьВнешнююКомпоненту(Путь, "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("ОбщиеМакеты.КомпонентаПечатиШтрихкодовWindows64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	//
	////ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
	////	ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	////
	////Иначе
	////	ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	////
	//КонецЕсли;

	// Создадим объект внешней компоненты
	Если ПодключениеВыполнено Тогда
		ВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкода.Barcode");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Возврат Неопределено;
	Иначе
		
		// Установим основные параметры компоненты
		
		// Если в системе установлен шрифт Tahoma
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт для формирования картинки
			ВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом для формирования штри-кода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Утановим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 10;
		
		Возврат ВнешняяКомпонента;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, Штрихкод, Ширина, Высота) Экспорт
	
	// Зададим размер картинки
	ВнешняяКомпонента.Ширина =Ширина;
	ВнешняяКомпонента.Высота =Высота;
	
	// Разрешим компоненте самой определять тип кода
	ВнешняяКомпонента.АвтоТип = истина;
	
	// Если код содержит контрольный символ, обязательно указываем
	ВнешняяКомпонента.СодержитКС = СтрДлина(Штрихкод) = 13;
	
	// Если отображать контрольный символ не нужно
	// ВнешняяКомпонента.ВидимостьКС = Ложь;
	
	// Формируем картинку штрихкода
	ВнешняяКомпонента.ЗначениеКода = Штрихкод;
	
	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода
	Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		// Скорректируем ширину
		ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода + 10;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
	
	// Если картинка сформировалась
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции