Функция ТекстЗапроса(ПараметрыЗапроса,ЗаполненныеПоля = 0) Экспорт
	ТекстЗапроса = "";
	уиД = "";
	уД  = " ГДЕ РазностьДат(Д.Период,&ДатаКон,ДЕНЬ) >=&Срок ";
	уиО = "";
	ЗаполненныеПоля = 0;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.СК) Тогда
		уиД = уиД + "И СК = &СК ";
		уиО = уиО + "И СК = &СК ";
		ЗаполненныеПоля = ЗаполненныеПоля + 2;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.ВидБСО) Тогда
		уиД = уиД + "И ВидБСО = &ВидБСО ";
		уиО = уиО + "И ВидБСО = &ВидБСО ";
		ЗаполненныеПоля = ЗаполненныеПоля + 3;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.НомерБСО) Тогда
		уД = уД + "И Д.НомерБСО = &НомерБСО ";
		ЗаполненныеПоля = ЗаполненныеПоля + 100;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Поставщик) Тогда
		уД = уД + "И Д.Поставщик = &Поставщик ";
		уиО = уиО + "И Поставщик = &Поставщик ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.ОрганизацияАгент) Тогда
		уД = уД + "И Д.ОрганизацияАгент = &ОрганизацияАгент ";
		уиО = уиО + "И ОрганизацияАгент = &ОрганизацияАгент ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Агент) Тогда
		уиО = уиО + "И Агент = &Агент ";
		уД  = уД  + "И Агент = &Агент ";
		ЗаполненныеПоля = ЗаполненныеПоля + 5;
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("СписокАгентов") Тогда //ПараметрыСеанса.уб_ЭтоМенеджер И ЭлементыФормы.Агент.СписокВыбора.Количество() > 1 Тогда
		уиО = уиО + " И Агент В (&СписокАгентов) ";
		уД  = уД  + " И Агент В (&СписокАгентов) ";
		ЗаполненныеПоля = ЗаполненныеПоля + 5;
	КонецЕсли;
	Если ПараметрыЗапроса.ПоложениеБСО.Количество() > 0 Тогда
		уД = уД + "И Д.ПоложениеБСО В (&ПоложениеБСО) ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;
	Если ПараметрыЗапроса.СостояниеБСО.Количество() > 0 Тогда
		уД = уД + "И Д.СостояниеБСО В (&СостояниеБСО) ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;
	Если Не ПараметрыЗапроса.ТипБСО.Пустая() Тогда
		уД = уД + "И Д.ВидБСО.Тип =  &ТипБСО ";
		уиО = уиО + "И ВидБСО.Тип =  &ТипБСО ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;
	Если Не ПараметрыЗапроса.ТипУчетаБСО.Количество()= 0 Тогда
		уД = уД + "И Д.ВидБСО.ТипУчетаБСО В (&ТипУчетаБСО) ";
		уиО = уиО + "И ВидБСО.ТипУчетаБСО В (&ТипУчетаБСО) ";
		ЗаполненныеПоля = ЗаполненныеПоля + 1;
	КонецЕсли;	
	
	Если ПараметрыЗапроса.Свойство("Актуальные") и ПараметрыЗапроса.Актуальные = Истина  Тогда
		уД = уД + " И Д.Актуальная = Истина ";
	КонецЕсли;	
	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Д.ОрганизацияАгент КАК ОрганизацияАгент,
		|	Д.Агент КАК Агент,
		|	Д.СК КАК СК,
		|	Д.ВидБСО КАК ВидБСО,
		|	Д.ВидБСО.Наименование КАК НаимВидБСО,
		|   Д.ВидБСО.Тип как Тип,
		|	Д.НомерБСО КАК НомерБСО,
		|	Д.ПоложениеБСО,
		|	Д.СостояниеБСО,
		|	Д.Поставщик КАК Поставщик,
		|	Д.ДатаВозврата,
		|	1 КАК Количество,
		|	Д.Период,
		|	Д.Регистратор,
		|   РазностьДат(Д.Период,&ДатаКон,ДЕНЬ) как Срок, 
		|   Д.Заявка как Заявка,Д.СтраховаяПремия
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
		|			&ДатаКон,
		|			ИСТИНА " + уиД + "
		|				И Подтверждено
		//|				И ДокПроведен
		|			) КАК Д
		|" + уД + "
		|
		//|СГРУППИРОВАТЬ ПО
		//|	Д.ОрганизацияАгент,
		//|	Д.Агент,
		//|	Д.СК,
		//|	Д.ВидБСО,
		//|	Д.ВидБСО.Наименование,
		//|	Д.НомерБСО,
		//|	Д.ПоложениеБСО,
		//|	Д.СостояниеБСО,
		//|	Д.ДатаВозврата,
		//|	Д.ДокПроведен,
		//|	Д.Подтверждено,
		//|	Д.Поставщик,
		//|	Д.Период,
		//|	Д.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ОрганизацияАгент,
		|	ВложенныйЗапрос.Агент,
		|	ВложенныйЗапрос.СК,
		|	ВложенныйЗапрос.ВидБСО,
		|	ВложенныйЗапрос.ВидБСО.Наименование,
		|	ВложенныйЗапрос.ВидБСО.Тип КАК Тип,
		|	""<без номера>"" КАК Поле1,
		|	"""" КАК Поле2,
		|	""<Пустые бланки>"" КАК Поле3,
		|	ВложенныйЗапрос.Поставщик,
		|	0 КАК Поле4,
		|	ВложенныйЗапрос.КоличествоОстаток КАК Количество,
		|	ВложенныйЗапрос.Период КАК Поле5,
		|	ВложенныйЗапрос.Регистратор КАК Поле6,
		|	РазностьДат(ВложенныйЗапрос.Период,&ДатаКон,ДЕНЬ) как Срок,
		|   ВложенныйЗапрос.Заявка,0
		|ИЗ
		|	(ВЫБРАТЬ
		|		Остатки.СК КАК СК,
		|		Остатки.ВидБСО КАК ВидБСО,
		|		Остатки.Агент КАК Агент,
		|		Остатки.ОрганизацияАгент КАК ОрганизацияАгент,
		|		Остатки.Поставщик КАК Поставщик,
		|		Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|		Isnull(ПослДвижение.Регистратор,ПослДвижение2.Регистратор) КАК Регистратор,
		|		Isnull(ПослДвижение.Заявка,ПослДвижение2.Заявка) КАК Заявка,
		|		Isnull(ПослДвижение.Регистратор.Дата,ПослДвижение2.Регистратор.Дата) КАК Период
		|	ИЗ
		|		РегистрНакопления.уб_ОстаткиБСО.Остатки(&ДатаКон, ИСТИНА " + уиО + ") КАК Остатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				МАКСИМУМ(уб_ОстаткиБСО.Регистратор) КАК Регистратор,
		|               МАКСИМУМ(уб_ОстаткиБСО.Заявка) КАК Заявка,
		|				уб_ОстаткиБСО.Поставщик КАК Поставщик,
		|				уб_ОстаткиБСО.ОрганизацияАгент КАК ОрганизацияАгент,
		|				уб_ОстаткиБСО.СК КАК СК,
		|				уб_ОстаткиБСО.ВидБСО КАК ВидБСО,
		|				уб_ОстаткиБСО.Агент КАК Агент
		|			ИЗ
		|				РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
		|	ГДЕ
		|		уб_ОстаткиБСО.ВидДвижения = Значение(ВидДВиженияНакопления.Приход)			
		|			СГРУППИРОВАТЬ ПО
		|				уб_ОстаткиБСО.ОрганизацияАгент,
		|				уб_ОстаткиБСО.СК,
		|				уб_ОстаткиБСО.Поставщик,
		|				уб_ОстаткиБСО.ВидБСО,
		|				уб_ОстаткиБСО.Агент) КАК ПослДвижение
		|			ПО (ПослДвижение.СК = Остатки.СК)
		|				И (ПослДвижение.Поставщик = Остатки.Поставщик)
		|				И (ПослДвижение.ОрганизацияАгент = Остатки.ОрганизацияАгент)
		|				И (ПослДвижение.ВидБСО = Остатки.ВидБСО)
		|				И (ПослДвижение.Агент = Остатки.Агент)
		|          ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				МАКСИМУМ(уб_ОстаткиБСО.Регистратор) КАК Регистратор,
		| 				МАКСИМУМ(уб_ОстаткиБСО.Заявка) КАК Заявка,
		|				уб_ОстаткиБСО.Поставщик КАК Поставщик,
		|				уб_ОстаткиБСО.ОрганизацияАгент КАК ОрганизацияАгент,
		|				уб_ОстаткиБСО.СК КАК СК,
		|				уб_ОстаткиБСО.ВидБСО КАК ВидБСО,
		|				уб_ОстаткиБСО.Агент КАК Агент
		|			ИЗ
		|				РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
		|			СГРУППИРОВАТЬ ПО
		|				уб_ОстаткиБСО.ОрганизацияАгент,
		|				уб_ОстаткиБСО.СК,
		|				уб_ОстаткиБСО.Поставщик,
		|				уб_ОстаткиБСО.ВидБСО,
		|				уб_ОстаткиБСО.Агент) КАК ПослДвижение2
		|			ПО (ПослДвижение2.СК = Остатки.СК)
		|				И (ПослДвижение2.Поставщик = Остатки.Поставщик)
		|				И (ПослДвижение2.ОрганизацияАгент = Остатки.ОрганизацияАгент)
		|				И (ПослДвижение2.ВидБСО = Остатки.ВидБСО)
		|				И (ПослДвижение2.Агент = Остатки.Агент)) КАК ВложенныйЗапрос
		| Где РазностьДат(ВложенныйЗапрос.Период,&ДатаКон,ДЕНЬ) >= &Срок 
		|УПОРЯДОЧИТЬ ПО
		|	Агент,
		|	СК,
		|	Поставщик,
		|	ОрганизацияАгент,
		|	НаимВидБСО,
		|	НомерБСО";	
    Возврат ТекстЗапроса;
КонецФункции	
	
Функция ПараметрыОтчета() Экспорт
	Параметры = Новый Структура; 
	Параметры.Вставить("ДатаКон",         КонецДня(ТекущаяДата()));
	Параметры.Вставить("СК",              Справочники.Контрагенты.ПустаяСсылка());
	Параметры.Вставить("Поставщик",       Справочники.Контрагенты.ПустаяСсылка());
	Параметры.Вставить("ВидБСО",          Справочники.уб_ВидыБСО.ПустаяСсылка());
	Параметры.Вставить("ОрганизацияАгент",Справочники.Организации.ПустаяСсылка());
	Параметры.Вставить("ПоложениеБСО",    УстановитьСостоянияБСО());
	Параметры.Вставить("СостояниеБСО",    УстановитьПоложениеБСО());
	Параметры.Вставить("ТипУчетаБСО",    УстановитьТипУчетаБСО());
	
	Параметры.Вставить("Агент",           Справочники.ФизическиеЛица.ПустаяСсылка());
	Параметры.Вставить("НомерБСО",       NULL);
	Параметры.Вставить("Срок",           0);
	Параметры.Вставить("ТипБСО",         Перечисления.уб_ТипыБСО.ПустаяСсылка() );
	//раметры.Вставить("ТипУчетаБСО",    Перечисления.уб_ТипыУчетаБСО.ПустаяСсылка());
	//Параметры.Вставить("",);
	//Запрос.УстановитьПараметр("ДатаКон", 			ДатаОтчета);
	//Запрос.УстановитьПараметр("СК", 				СК);
	//Запрос.УстановитьПараметр("Поставщик", 			Поставщик);
	//Запрос.УстановитьПараметр("ВидБСО", 			ВидБСО);
	//Запрос.УстановитьПараметр("ОрганизацияАгент", 	ОрганизацияАгент);
	//Запрос.УстановитьПараметр("ПоложениеБСО", 		ПоложениеБСО);
	//Запрос.УстановитьПараметр("СостояниеБСО", 		СостояниеБСО);
	//Запрос.УстановитьПараметр("Агент", 				Агент);
	//Запрос.УстановитьПараметр("НомерБСО", 			?(СокрЛП(НомерБСО)="",NULL,СокрЛП(НомерБСО)));
	//Запрос.УстановитьПараметр("Срок", 				Срок);
	//Запрос.УстановитьПараметр("ТипБСО",ТипБСО);
	//Запрос.УстановитьПараметр("ТипУчетаБСО",ТипУчетаБСО);
	
	Возврат  Параметры;
КонецФункции

Функция УстановитьПараметры(Запрос,ПараметрыОтчета) Экспорт
	Для каждого эл из ПараметрыОтчета Цикл
		Запрос.УстановитьПараметр(Эл.Ключ, Эл.Значение);	
	КонецЦикла;	
	//
	//Если ПараметрыЗапроса.Свойство("СписокАгентов") Тогда 
	//	Запрос.УстановитьПараметр("СписокАгентов", ПараметрыЗапроса.СписокАгентов);
	//КонецЕсли;	
КонецФункции	
	
Функция УстановитьСостоянияБСО() Экспорт

СписокСостояний = Новый СписокЗначений;
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.ПустойБланк);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.НеиспользованныйБланк);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.НеПолностьюОформлен);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.Испорчен);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.НедействующийБланк);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.НеполныйБланк);
СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.НеПравильноОформлен);


СписокСостояний.Добавить(Перечисления.уб_СостоянияБСО.Оформлен);
//
//Если ЭлементыФормы.ВидОтчета.Значение = 0 Тогда
//	СостояниеБСО = СписокСостояний;
//ИначеЕсли ЭлементыФормы.ВидОтчета.Значение = 1 Тогда 
//	СостояниеБСО = СписокСостояний;
//ИначеЕсли ЭлементыФормы.ВидОтчета.Значение = 2 Тогда
//	СостояниеБСО = СписокСостояний;
//ИначеЕсли ЭлементыФормы.ВидОтчета.Значение = 3 Тогда	
//	СостояниеБСО = СписокСостояний;
//Иначе	
СостояниеБСО = СписокСостояний;
//	КонецЕсли; 
Возврат СостояниеБСО;

КонецФункции //

Функция УстановитьПоложениеБСО(Тип = "Все") Экспорт

СписокПоложений = Новый СписокЗначений;
Если Тип = "Все" или Тип = "БСО" Тогда
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПолученИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенСТочки);	
КонецЕсли;

Если Тип = "Все" или Тип = "Агенты" Тогда
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПереданНаТочку);
КонецЕсли;	
ПоложениеБСО = СписокПоложений;
Возврат ПоложениеБСО;

КонецФункции //

Функция УстановитьТипУчетаБСО(Тип = "Все") Экспорт

СписокПоложений = Новый СписокЗначений;
Если Тип = "Все" Тогда
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.НомернойЕстьПолис);
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.НомернойНетПолиса);
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.НомернойПолисВручную);	
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.НомернойПолисИзСвободных);
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.НомернойПолисСоответствуетНомеруБСО);	
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную);
	СписокПоложений.Добавить(Перечисления.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных);	
КонецЕсли;

ПоложениеБСО = СписокПоложений;
Возврат ПоложениеБСО;

КонецФункции //


