
Функция Инициализировать(РежимЗапуска = "Запуск") Экспорт
	//СтруктураПараметровСистемы = Константы.уз_ПараметрыСистемыЛицензирования.Получить().Получить();


	//глСистемаЛицензирования = Новый Структура("Менеджер", Неопределено);


	//Если Не (ТипЗнч(СтруктураПараметровСистемы) = Тип("Структура")) Тогда


	//	Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//ИначеЕсли СтруктураПараметровСистемы.РежимОтладки = Истина И Вопрос("Работать в режиме отладки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда

	//	глСистемаЛицензирования = Новый Структура("Менеджер", "РежимОтладки");
	//	МассивФайлов = НайтиФайлы(СтруктураПараметровСистемы.КаталогОтладки, "*.epf");

	//	Для каждого Файл Из МассивФайлов Цикл

	//		Попытка
	//			ВнешняяОбработка = ВнешниеОбработки.Создать(Файл.ПолноеИмя);
	//			глСистемаЛицензирования.Вставить(ВнешняяОбработка.Метаданные().Имя, ВнешняяОбработка);
	//		Исключение

	//		КонецПопытки;
	//	КонецЦикла;

	//	Возврат Истина;
	//Иначе

	//	ПараметрыЗапуска = Неопределено;

	//	Если ПроверитьИспользованиеМодуляУФС() Тогда
	//		ПараметрыЗапуска = ПолучитьПараметрыЗапуска("МестоСоздания", ПланыОбмена.РБД.ЭтотУзел().ЭлементРБД);
	//	Иначе
	//		МетаданныеПланыОбмена = Метаданные.ПланыОбмена;
	//		Для каждого ПланОбмен Из МетаданныеПланыОбмена Цикл
	//			ПараметрыЗапуска = ПолучитьПараметрыЗапуска("ПланОбмена", ПланыОбмена[ПланОбмен.Имя].ЭтотУзел());
	//			Если Не (ПараметрыЗапуска = Неопределено) Тогда
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;

	//	Если ПараметрыЗапуска = Неопределено Тогда
	//		ПараметрыЗапуска = ПолучитьПараметрыЗапуска("СерийныйНомер", "<по умолчанию>");
	//		Если ПараметрыЗапуска = Неопределено Тогда

	//			Возврат НастроитьСистемуЛицензирования(РежимЗапуска);
	//		КонецЕсли;
	//	КонецЕсли;


	//	КаталогСистемы = КаталогПрограммы() + "orticon";
	//	Каталог = Новый Файл(КаталогСистемы);
	//	Если Не Каталог.Существует() Тогда
	//		Попытка
	//			СоздатьКаталог(КаталогСистемы);
	//		Исключение


	//			СоздатьФайлЛогаОшибкиЗапуска("Ошибка создания каталога размещения системы лицензирования!
	//			|
	//			|Описание ошибки:
	//			|" + ОписаниеОшибки());

	//			Возврат Ложь;
	//		КонецПопытки;
	//	КонецЕсли;



	//	Попытка
	//		ИмяФайлаКомпоненты = ПолучитьЗаписатьФайл(СтруктураПараметровСистемы.Компонента, КаталогСистемы);
	//	Исключение



	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//	КонецПопытки;




	//	Попытка
	//		ИмяФайлаСерииКлючей = ПолучитьЗаписатьФайл(ПараметрыЗапуска.RegInfo, КаталогСистемы);
	//	Исключение



	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//	КонецПопытки;




	//	Попытка
	//		ИмяФайлаДанных = ПолучитьЗаписатьФайл(ПараметрыЗапуска.Datafile, КаталогСистемы);
	//	Исключение



	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//	КонецПопытки;



	//	Попытка
	//		ИмяФайлаПараметров = ПолучитьЗаписатьФайл(ПараметрыЗапуска.Paramfile, КаталогСистемы);
	//	Исключение



	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//	КонецПопытки;


	//	Попытка
	//		ЗагрузитьВнешнююКомпоненту(ИмяФайлаКомпоненты);
	//		МенеджерЛицензий = Новый("AddIn.LicenceManager", Неопределено);

	//		МенеджерЛицензий.ПоказыватьСообщенияОбОшибках = Ложь;
	//	Исключение

	//		СоздатьФайлЛогаОшибкиЗапуска("Ошибка при загрузке компоненты защиты!
	//		|
	//		|Описание ошибки:
	//		|" + ОписаниеОшибки());


	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//	КонецПопытки;


	//	Если Не МенеджерЛицензий.Запуск(ИмяФайлаСерииКлючей, ИмяФайлаДанных, ИмяФайлаПараметров) Тогда

	//		Если Не (МенеджерЛицензий.КодОшибки = 0) Тогда
	//			СоздатьФайлЛогаОшибкиЗапуска("Ошибка(" + МенеджерЛицензий.КодОшибки + ") при запуске менеджера лицензирования!
	//			|
	//			|Описание ошибки:
	//			|" + МенеджерЛицензий.ОписаниеОшибки);


	//			Возврат НастроитьСистемуЛицензирования(РежимЗапуска);

	//		КонецЕсли;
	//	КонецЕсли;


	//	глСистемаЛицензирования = Новый Структура("Менеджер", МенеджерЛицензий);


	//	ОписаниеОшибки = "";
	//	Обработка = СоздатьЗащищеннуюОбработку("ОсновнаяПоставка", ОписаниеОшибки);

	//	Если Обработка = 0 Тогда
	//		СоздатьФайлЛогаОшибкиЗапуска("Ошибка при создании модуля основной поставки!
	//		|
	//		|Описание ошибки:
	//		|" + ОписаниеОшибки);


	//		глСистемаЛицензирования.Менеджер = Неопределено;

	//		Возврат НастроитьСистемуЛицензирования(РежимЗапуска);
	//	Иначе

	//		глСистемаЛицензирования.Вставить("ОсновнаяПоставка", Обработка);
	//	КонецЕсли;


	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Ссылка
	//	|ИЗ
	//	|	Справочник.уз_ДополнительныеМодули
	//	|ГДЕ
	//	|	Предопределенный = ИСТИНА
	//	|";


	//	Выборка = Запрос.Выполнить().Выбрать();

	//	Пока Выборка.Следующий() Цикл
	//		ИмяОбработки = Справочники.уз_ДополнительныеМодули.ПолучитьИмяПредопределенного(Выборка.Ссылка);
	//		Обработка = СоздатьЗащищеннуюОбработку(ИмяОбработки);

	//		Если Не (Обработка = 0) Тогда
	//			глСистемаЛицензирования.Вставить(ИмяОбработки, Обработка);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;

	Возврат Истина;

КонецФункции








Функция НастроитьСистемуЛицензирования(РежимЗапуска = "Запуск") Экспорт
	Если Не (РежимЗапуска = "Запуск") Тогда
		Возврат Ложь;
	КонецЕсли;


	Если Не ПравоДоступа("Администрирование", Метаданные) Тогда
		Предупреждение("Нет прав доступа для настройки системы лицензирования!
		|Обратитесь к системному администратору.");
		Возврат Ложь;
	КонецЕсли;


	//НастройкаСистемы = Обработки.уз_НастройкаСистемыЛицензирования.Создать();

	//ФормаНастройки = НастройкаСистемы.ПолучитьФорму("ФормаНастройки", , "13028006-3b38-45f4-88b3-6cb32df0eb5e");
	//ФормаНастройки.ОткрытьМодально();

	//Возврат НастройкаСистемы.Запущен;

КонецФункции










Функция ПроверитьИспользованиеМодуляУФС() Экспорт
	//Если Метаданные.ПланыОбмена.Найти("РБД") = Неопределено Тогда

	//	Возврат Ложь;
	//Иначе


	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	РБД.Ссылка
	//	|ИЗ
	//	|	ПланОбмена.РБД КАК РБД
	//	|ГДЕ
	//	|	НЕ РБД.Ссылка = &ЭтотУзел
	//	|";


	//	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.РБД.ЭтотУзел());

	//	Возврат Не Запрос.Выполнить().Пустой();

	//КонецЕсли;

КонецФункции








Процедура ОткрытьФормуНастройкиСистемыЛицензирования() Экспорт
	НастроитьСистемуЛицензирования();

КонецПроцедуры
















Функция ПолучитьПараметрыЗапуска(ИмяПоля, Параметр)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр(ИмяПоля, Параметр);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.уз_РегистрацияКлючейЗащиты
	|ГДЕ
	|	" + ИмяПоля + " = &" + ИмяПоля + "
	|";


	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции












Функция СоздатьЗащищеннуюОбработку(ИмяОбработки, ОписаниеОшибки = "")
	Обработка = 0;

	Попытка
		глСистемаЛицензирования.Менеджер.СоздатьОбработку(ИмяОбработки, Обработка);
		Возврат Обработка;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;

КонецФункции












Функция ПолучитьЗаписатьФайл(Хранилище, КаталогСистемы)
	СтруктураХранения = Хранилище.Получить();
	ПолноеИмяФайла = КаталогСистемы + "\" + СтруктураХранения.ИмяФайла;
	Файл = Новый Файл(ПолноеИмяФайла);


	Если Не Файл.Существует() Или Не (Файл.Размер() = СтруктураХранения.Размер) Тогда
		Попытка
			СтруктураХранения.Данные.Записать(ПолноеИмяФайла);
		Исключение

			СоздатьФайлЛогаОшибкиЗапуска("Ошибка создания файла параметра!
			|
			|Описание ошибки:
			|" + ОписаниеОшибки());
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;

	Возврат ПолноеИмяФайла;

КонецФункции







Процедура СоздатьФайлЛогаОшибкиЗапуска(ОписаниеОшибки)
	Лог = Новый ТекстовыйДокумент;
	Лог.УстановитьТекст(ОписаниеОшибки);
	Лог.ВставитьСтроку(1, "===СИСТЕМА ЛИЦЕНЗИРОВАНИЯ===" + Строка(ТекущаяДата()));
	Лог.ВставитьСтроку(2, "==============================================");


	Попытка
		Лог.Записать("C:\license_err.log");

		Предупреждение("Ошибка запуска системы лицензирования
		|Создан лог ошибки c:\license_err.log!", , "СИСТЕМА ЛИЦЕНЗИРОВАНИЯ");
	Исключение


		Предупреждение("Не удалось записать лог файл ошибки системы лицензирования!
		|Данную информацию сообщите Вашему системному администратору:
		|" + ОписаниеОшибки, , "СИСТЕМА ЛИЦЕНЗИРОВАНИЯ");


	КонецПопытки;

КонецПроцедуры