Функция ОбработатьVin(Vin) Экспорт
	_Vin = ""+ВРЕГ(Vin);
	Если _Vin = "<ОТСУТСТВУЕТ>" ТОГДА 
		Возврат _Vin
	КонецЕсли;	
	_Vin = СтрЗаменить(_Vin,"O","0");
	_Vin = СтрЗаменить(_Vin,"О","0");
	_Vin = СтрЗаменить(_Vin,"I","1");
	_Vin = СтрЗаменить(_Vin,"Q","0");
	_Vin = СтрЗаменить(_Vin,"А","A");
	_Vin = СтрЗаменить(_Vin,"В","B");
	_Vin = СтрЗаменить(_Vin,"С","C");
	_Vin = СтрЗаменить(_Vin,"Е","E");
	_Vin = СтрЗаменить(_Vin,"Н","H");
	_Vin = СтрЗаменить(_Vin,"К","K");
	_Vin = СтрЗаменить(_Vin,"М","M");
	_Vin = СтрЗаменить(_Vin,"Р","P");
	_Vin = СтрЗаменить(_Vin,"Т","T");
	_Vin = СтрЗаменить(_Vin,"Х","X");
	_Vin = СтрЗаменить(_Vin,"У","Y");	
	_Vin = СтрЗаменить(_Vin,"З","3");	
	
	Возврат _Vin
КонецФункции	
	
