Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	// Очистим начальный документ
	ДокументРезультат.Очистить();	
	Макет = ПолучитьМакет("Макет");	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	Запрос.УстановитьПараметр("СК", ?(СК.Пустая(),Null,СК));	
	Запрос.УстановитьПараметр("СтраховойПродукт", ?(СтраховойПродукт.Пустая(),Null,СтраховойПродукт));	
	Запрос.УстановитьПараметр("Организация", ?(Организация.Пустая(),Null,Организация));
	Запрос.УстановитьПараметр("Агент", ?(ЗначениеНеЗаполнено(Агент),Null,Агент));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_СтраховойПолисПлатежи.Ссылка КАК Документ,
	|	уб_СтраховойПолисПлатежи.Дата КАК СрокОплаты,
	|	уб_СтраховойПолисПлатежи.Сумма КАК СуммаВзноса,
	|	уб_СтраховойПолисПлатежи.Ссылка.Страхователь КАК Страхователь,
	|	уб_СтраховойПолисПлатежи.Ссылка.Агент КАК Агент,
	|	уб_СтраховойПолисПлатежи.Ссылка.Номер КАК НомерДоговораСтрахования,
	|	уб_СтраховойПолисПлатежи.Ссылка.СтраховойПродукт КАК СтраховойПродукт
	|ИЗ
	|	Документ.уб_СтраховойПолис.Платежи КАК уб_СтраховойПолисПлатежи
	|ГДЕ
	|	уб_СтраховойПолисПлатежи.Дата >= &ДатаНач
	|	И уб_СтраховойПолисПлатежи.Дата <= &ДатаКон
	|	И (уб_СтраховойПолисПлатежи.Ссылка.СК = &СК
	|			ИЛИ &СК ЕСТЬ NULL )
	|	И (уб_СтраховойПолисПлатежи.Ссылка.СтраховойПродукт = &СтраховойПродукт
	|			ИЛИ &СтраховойПродукт ЕСТЬ NULL )
	|	И (уб_СтраховойПолисПлатежи.Ссылка.Организация = &Организация
	|			ИЛИ &Организация ЕСТЬ NULL )
	|	И (уб_СтраховойПолисПлатежи.Ссылка.Агент = &Агент
	|			ИЛИ &Агент ЕСТЬ NULL )";

	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтНач 	= Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДтКон 	= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК		= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	ДокументРезультат.Вывести(Обл);	
	РезЗапроса 	= Запрос.Выполнить();
	Выборка 	= РезЗапроса.Выбрать();	
	ИтСуммаВзноса = 0;
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Ном = 	Ном + 1;
		//
		Страхователь		=Выборка.Страхователь;
		АдресСтрахователя	=УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Страхователь,"Фактический");
		ТелефонСтрахователя	=УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Страхователь);		
		//
		Обл 									= Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном						= Ном;
		Обл.Параметры.Документ					= Выборка.Документ;
		Обл.Параметры.НомерДоговораСтрахования	= Выборка.НомерДоговораСтрахования;
		Обл.Параметры.СтраховойПродукт			= Выборка.СтраховойПродукт;
		Обл.Параметры.Страхователь				= Выборка.Страхователь;
		Обл.Параметры.СрокОплаты				= Выборка.СрокОплаты;
		Обл.Параметры.СуммаВзноса				= Выборка.СуммаВзноса;
		Обл.Параметры.АдресСтрахователя			= АдресСтрахователя;
		Обл.Параметры.ТелефонСтрахователя		= ТелефонСтрахователя;
		//
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		//
		ИтСуммаВзноса = ИтСуммаВзноса + Выборка.СуммаВзноса;
	КонецЦикла;
	
	Обл 						= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтСуммаВзноса	= ИтСуммаВзноса;
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху      = 8;

	ДокументРезультат.Показать("Ожидаемые платежи");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли
