Перем мФорматМесячногоПериода;

#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьФорму();
	ОбновитьСеткуНаСервере();
	ПеречитатьНастройкиКлубаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	Если Параметры.Свойство("Период") Тогда
		РасчетныйПериод = Параметры.Период;
	Иначе	
		Если НЕ ЗначениеЗаполнено(РасчетныйПериод) Тогда
			РасчетныйПериод = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
		Конецесли;	
	Конецесли;	
	
	ПериодЗП = Новый СтандартныйПериод(РасчетныйПериод,КонецМесяца(РасчетныйПериод));
	
	Элементы.Сетка.ТолькоПросмотр = НЕ уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ,ПолныеПрава");
	
	Если Параметры.Свойство("Страница") Тогда
		Попытка
			Этаформа.ТекущийЭлемент = Элементы[Параметры.Страница];
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	
	
КонецПроцедуры	
#КонецОбласти

#Область СобытияШапкиФормы
&НаКлиенте
Процедура ПериодЗППриИзменении(Элемент)
	РасчетныйПериод = НачалоМесяца(ПериодЗП.ДатаНачала);
	ОбновитьСетку(Элемент);
	ПеречитатьНастройкиКлубаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении1(Элемент)
	ОбновитьСетку(Элемент);
КонецПроцедуры

#КонецОбласти

#Область СобытияСетки

&НаСервере
Процедура ОбновитьСеткуНаСервере()
	Сетка.Очистить();
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;	
	
	Данные = ПолучитьСетку(РасчетныйПериод,Подразделение);
	Для каждого СтрокаСетки из Данные Цикл
		НоваяСтрока = Сетка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаСетки);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСетку(Команда)
	ОбновитьСеткуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СеткаСтавкаПролонгацияПриИзменении1(Элемент)
	ТД = Элементы.Сетка.ТекущиеДанные;
	Если Не ТД = Неопределено Тогда
		УстановитьСтавкуРОП(Подразделение,ПредопределенноеЗначение("ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознНовыйБизнес"),РасчетныйПериод,тд.ПроцентОт,тд.СтавкаНБ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СеткаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СеткаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти


#Область СеткаСервисныеПроцедуры
&НаСервереБезКонтекста
Процедура УстановитьСтавкуРОП(_Подразделение,_ВидМотивации,_Период,_ПроцентОт,_СтавкаВознаграждения)
	Мз = РегистрыСведений.уб_ЗП_СтавкиРОП.СоздатьМенеджерЗаписи();	
	Мз.Период        = НачалоМесяца(_Период);
	Мз.Подразделение = _Подразделение;
	Мз.ВидМотивации  = _ВидМотивации;
	Мз.ПроцентОт     = _ПроцентОт;
	Мз.СтавкаВознаграждения =_СтавкаВознаграждения;
	Мз.Записать();
КонецПроцедуры	




&НаСервереБезКонтекста
Функция  ПолучитьСетку(_Период,_Подразделение)
	_Сетка = Новый Массив;
	ТекСтавка = 100;
	Пока ТекСтавка >= 0 Цикл
		_Сетка.Добавить(Новый Структура("ПроцентОт,СтавкаПролонгация,СтавкаНБ",ТекСтавка,0,0));
		ТекСтавка = ТекСтавка-10;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение",_Подразделение);
	Запрос.УстановитьПараметр("Период",_Период);
	Запрос.Текст  = "ВЫБРАТЬ
	|	уб_ЗП_СтавкиРОПСрезПоследних.Период,
	|	уб_ЗП_СтавкиРОПСрезПоследних.Подразделение,
	|	уб_ЗП_СтавкиРОПСрезПоследних.ВидМотивации,
	|	уб_ЗП_СтавкиРОПСрезПоследних.ПроцентОт,
	|	уб_ЗП_СтавкиРОПСрезПоследних.СтавкаВознаграждения
	|ИЗ
	|	РегистрСведений.уб_ЗП_СтавкиРОП.СрезПоследних(&Период,Подразделение = &Подразделение) КАК уб_ЗП_СтавкиРОПСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекСтрока = Неопределено;
		Для каждого СтрокаСетки из _Сетка Цикл
			Если СтрокаСетки.ПроцентОт = Выборка.ПроцентОт Тогда
				ТекСтрока = СтрокаСетки;
			КонецЕсли;
		КонецЦикла;
		Если ТекСтрока = Неопределено Тогда
			Сообщить("Не найден ПроцентОт "+Выборка.ПроцентОт);
			Продолжить
		КонецЕсли;
		Если Выборка.ВидМотивации = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПролонгация Тогда
			ТекСтрока.СтавкаПролонгация = Выборка.СтавкаВознаграждения;
		Иначе
			//Новый бизнес
			ТекСтрока.СтавкаНБ = Выборка.СтавкаВознаграждения;
		КонецЕсли;	
	КонецЦикла;	
	
	
	Возврат _Сетка;
	
КонецФункции	


#КонецОбласти					


#Область Команды_Клуб_30

&НаКлиенте
Процедура СтраховыеКомпанииПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	Если ЗначениеЗаполнено(РасчетныйПериод) = Ложь или РасчетныйПериод<Дата(2024,11,1) Тогда
		ПоказатьПредупреждение(,"Проверьте период, должен быть не ранее 01.11.2024");
		Возврат;
	КонецЕсли;	
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьНастройкиКлуба(Команда)
	Если ЗначениеЗаполнено(РасчетныйПериод) = Ложь или РасчетныйПериод<Дата(2024,11,1) Тогда
		ПоказатьПредупреждение(,"Проверьте период, должен быть не ранее 01.11.2024");
		Возврат;
	КонецЕсли;	
	ПеречитатьНастройкиКлубаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройкиКлубаНаСервере()
	
	СтраховыеКомпании.Очистить();
	//Первая часть - одиночные значения
	Выборка = Выборка_уб_ЗП_ПоказателиРасчетаЗП();
	Если Выборка.Следующий() Тогда
		ЦелевойПроцентКВ = Выборка.СтавкаПроцентаПовышенныйКВ;
		СуммаЗаНБ        = Выборка.СуммаЗаПовышенныйКВ_НБ;
		СуммаЗаПеревод   = Выборка.СуммаЗаПовышенныйКВ_Пролонгация;
	КонецЕсли;	
	
	//Вторая часть - списочные
	РазвернутаяАналитикаКлючейВБазе       = РазвернутаяАналитикаКлючейВБазе(РасчетныйПериод);	
	
	Для каждого СтрокаАналитики из РазвернутаяАналитикаКлючейВБазе Цикл
		НайденаСКиПоставщик = Ложь;
		нСтроки = СтраховыеКомпании.НайтиСтроки(Новый Структура("СтраховаяКомпания,Поставщик,Наименование,Премия",СтрокаАналитики.СК,СтрокаАналитики.Поставщик,СтрокаАналитики.Наименование,СтрокаАналитики.Премия));
		Если нСтроки.Количество() = 0 Тогда
			ТекущаяСтрока = СтраховыеКомпании.Добавить();
			ТекущаяСтрока.СтраховаяКомпания = СтрокаАналитики.СК;
			ТекущаяСтрока.Поставщик         = СтрокаАналитики.Поставщик;
		Иначе 
			ТекущаяСтрока= нСтроки[0];
		КонецЕсли;	
		Если ТекущаяСтрока.ОрганизацияАгент.НайтиПоЗначению(СтрокаАналитики.ОрганизацияАгент) = Неопределено Тогда
			ТекущаяСтрока.ОрганизацияАгент.Добавить(СтрокаАналитики.ОрганизацияАгент);
		КонецЕсли;	
		
		Если ТекущаяСтрока.ВидыСП.НайтиПоЗначению(СтрокаАналитики.ВидСП) = Неопределено Тогда
			ТекущаяСтрока.ВидыСП.Добавить(СтрокаАналитики.ВидСП);
		КонецЕсли;	
		ТекущаяСтрока.Наименование = СтрокаАналитики.Наименование;
		ТекущаяСтрока.Бонус  = СтрокаАналитики.Бонус;
		ТекущаяСтрока.Премия = СтрокаАналитики.Премия;
		
	КонецЦикла;	
	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	#Область ПерваяЧасть //Храниться в уб_ЗП_ПоказателиРасчетаЗП
	
	Выборка = Выборка_уб_ЗП_ПоказателиРасчетаЗП();	
	НадоЗаполнять = Истина;
	Если Выборка.Следующий() Тогда
		//Проверим, может они не изменились, ставки не должны менятся часто, лишние записи не нужны	
		Если Выборка.СуммаЗаПовышенныйКВ_НБ           = СуммаЗаНБ 
			и Выборка.СуммаЗаПовышенныйКВ_Пролонгация = СуммаЗаПеревод
			и Выборка.СтавкаПроцентаПовышенныйКВ      = ЦелевойПроцентКВ
			Тогда
			НадоЗаполнять = Ложь;
		Иначе	
			Мз = РегистрыСведений.уб_ЗП_ПоказателиРасчетаЗП.СоздатьМенеджерЗаписи();	
			//Копируем остальные значения
			ЗаполнитьЗначенияСвойств(Мз,Выборка,,"Период,СуммаЗаПовышенныйКВ_НБ,СуммаЗаПовышенныйКВ_Пролонгация,СтавкаПроцентаПовышенныйКВ");
		КонецЕсли;
	КонецЕсли;	
	
	Если НадоЗаполнять = Истина Тогда
		Мз.Период                          = РасчетныйПериод;
		Мз.СтавкаПроцентаПовышенныйКВ      = ЦелевойПроцентКВ;
		Мз.СуммаЗаПовышенныйКВ_НБ          = СуммаЗаНБ;
		Мз.СуммаЗаПовышенныйКВ_Пролонгация = СуммаЗаПеревод;
		Мз.Записать();
	КонецЕсли;	
	#КонецОбласти
	
	#Область СписочныеДанные
	
	МассивКлючейАналитикиДо = АналитикаКлючейВБазе(РасчетныйПериод);
	МассивКлючейАналитики = Новый Массив;
	Для каждого СтрокаСК из СтраховыеКомпании Цикл
		СписокОрганизации = Новый Массив;
		Для каждого Организация из СтрокаСК.ОрганизацияАгент Цикл
			СписокОрганизации.Добавить(Организация.Значение);
		КонецЦикла;	
		Если СписокОрганизации.Количество() = 0 Тогда
			СписокОрганизации.Добавить(Справочники.Организации.ПустаяСсылка());
		КонецЕсли;
		
		СписокВидыСП = Новый Массив;
		Для каждого ВидСП из СтрокаСК.ВидыСП Цикл
			СписокВидыСП.Добавить(ВидСП.Значение);
		КонецЦикла;	
		Если СписокВидыСП.Количество() = 0 Тогда
			СписокВидыСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка());
		КонецЕсли;
		Для каждого Организация из СписокОрганизации Цикл
			Для каждого ВидСП из СписокВидыСП Цикл
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("ВидСП",ВидСП);
				ПараметрыПоиска.Вставить("Личная",ЛОЖЬ);
				ПараметрыПоиска.Вставить("ОрганизацияАгент",Организация);
				ПараметрыПоиска.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
				ПараметрыПоиска.Вставить("Поставщик",СтрокаСК.Поставщик);
				ПараметрыПоиска.Вставить("СК",СтрокаСК.СтраховаяКомпания);
				ПараметрыПоиска.Вставить("ФормаОплаты",Перечисления.уб_ФормыОплаты.ПустаяСсылка());
				ПараметрыПоиска.Вставить("Наименование",СтрокаСК.Наименование);
				
				Аналитика = ПолучитьАналитику(ПараметрыПоиска);
				МассивКлючейАналитики.Добавить(Новый Структура("Аналитика,Значение,Вид",Аналитика,СтрокаСК.Бонус,"Клуб30"));
				Если СтрокаСК.Премия>0 Тогда
					МассивКлючейАналитики.Добавить(Новый Структура("Аналитика,Значение,Вид",Аналитика,СтрокаСК.Премия,"Премия Клуб30"));
				КонецЕсли;	
				
				ИндексАналитикиДо = МассивКлючейАналитикиДо.Найти(Аналитика);
				Если Не ИндексАналитикиДо = Неопределено Тогда
					МассивКлючейАналитикиДо.Удалить(ИндексАналитикиДо);
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
	Для каждого АналитикаКУдалению из МассивКлючейАналитикиДо Цикл
		ЗаписатьОдиночнуюАналитику(АналитикаКУдалению,РасчетныйПериод,0,"Клуб30");
		ЗаписатьОдиночнуюАналитику(АналитикаКУдалению,РасчетныйПериод,0,"Премия Клуб30");
	КонецЦикла;	
	Для каждого СтруктураАналитики из МассивКлючейАналитики Цикл
		ЗаписатьОдиночнуюАналитику(СтруктураАналитики.Аналитика,РасчетныйПериод,СтруктураАналитики.Значение,СтруктураАналитики.Вид);
	КонецЦикла;	
	#КонецОбласти
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОдиночнуюАналитику(Аналитика,Период,Используется = 1,ВидАналитики ="Клуб30" )
	МЗ = РегистрыСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СоздатьМенеджерЗаписи();
	МЗ.Период            = Период;
	МЗ.Сотрудник         = Аналитика;
	МЗ.ЗначениеПараметра = Используется;
	МЗ.ТипПараметра      = ВидАналитики;
	МЗ.Записать();
КонецПроцедуры	

&НаСервереБезКонтекста
Функция АналитикаКлючейВБазе(Дата,ВидАналитики="Клуб30")
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АналитикаСрез.Сотрудник КАК Аналитика
	|ИЗ
	|	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&Дата, ТипПараметра = &ВидАналитики) КАК АналитикаСрез
	|ГДЕ
	|	АналитикаСрез.ЗначениеПараметра > 0";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ВидАналитики",ВидАналитики);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Аналитика");
	
КонецФункции

&НаСервереБезКонтекста
Функция РазвернутаяАналитикаКлючейВБазе(Дата,ВидАналитики="Клуб30", ВидАналитики2="Премия Клуб30")
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	АналитикаСрез.Сотрудник КАК Аналитика,
	               |	АналитикаУчетаБСО.Наименование,
	               |	АналитикаУчетаБСО.ВидСП,
	               |	АналитикаУчетаБСО.Личная,
	               |	АналитикаУчетаБСО.ОрганизацияАгент,
	               |	АналитикаУчетаБСО.Подразделение,
	               |	АналитикаУчетаБСО.Поставщик,
	               |	АналитикаУчетаБСО.СК,
	               |	АналитикаУчетаБСО.ФормаОплаты,
	               |	АналитикаСрез.ЗначениеПараметра КАК Бонус,
	               |	ЕСТЬNULL(АналитикаСрез2.ЗначениеПараметра, 0) КАК Премия
	               |ИЗ
	               |	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&Дата, ТипПараметра = &ВидАналитики) КАК АналитикаСрез
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&Дата, ТипПараметра = &ВидАналитики2) КАК АналитикаСрез2
	               |		ПО АналитикаСрез.Сотрудник = АналитикаСрез2.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АналитикаУчетаБСО КАК АналитикаУчетаБСО
	               |		ПО АналитикаСрез.Сотрудник = АналитикаУчетаБСО.Ссылка
	               |ГДЕ
	               |	АналитикаСрез.ЗначениеПараметра <> 0
	               |	И АналитикаУчетаБСО.Личная = ЛОЖЬ
	               |	И АналитикаУчетаБСО.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |	И АналитикаУчетаБСО.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ВидАналитики",ВидАналитики);
	Запрос.УстановитьПараметр("ВидАналитики2",ВидАналитики2);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАналитику(ПараметрыПоиска)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АналитикаУчетаБСО.Ссылка,
	|	АналитикаУчетаБСО.ПометкаУдаления,
	|	АналитикаУчетаБСО.Код,
	|	АналитикаУчетаБСО.Наименование,
	|	АналитикаУчетаБСО.ВидСП,
	|	АналитикаУчетаБСО.Личная,
	|	АналитикаУчетаБСО.ОрганизацияАгент,
	|	АналитикаУчетаБСО.Подразделение,
	|	АналитикаУчетаБСО.Поставщик,
	|	АналитикаУчетаБСО.СК,
	|	АналитикаУчетаБСО.ФормаОплаты
	|ИЗ
	|	Справочник.АналитикаУчетаБСО КАК АналитикаУчетаБСО
	|ГДЕ
	|	АналитикаУчетаБСО.ВидСП = &ВидСП
	|	И АналитикаУчетаБСО.Личная = &Личная
	|	И АналитикаУчетаБСО.ОрганизацияАгент = &ОрганизацияАгент
	|	И АналитикаУчетаБСО.Подразделение = &Подразделение
	|	И АналитикаУчетаБСО.Поставщик = &Поставщик
	|	И АналитикаУчетаБСО.СК = &СК
	|	И АналитикаУчетаБСО.ФормаОплаты = &ФормаОплаты
	|	И АналитикаУчетаБСО.Наименование = &Наименование";
	Для каждого Параметр из ПараметрыПоиска Цикл
		Запрос.Параметры.Вставить(Параметр.Ключ,Параметр.Значение);
	КонецЦикла;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка
	Иначе
		Возврат Справочники.АналитикаУчетаБСО.СоздатьАналитику(ПараметрыПоиска);
	КонецЕсли;
КонецФункции	


Функция Выборка_уб_ЗП_ПоказателиРасчетаЗП()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&Период, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.Период","уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.*");
	Запрос.УстановитьПараметр("Период",РасчетныйПериод);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
КонецФункции	

#Область Список_СтраховыеКомпаниия

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаПремированияПроцентаКВ Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.СтраховыеКомпании;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеКомпанииСтраховаяКомпанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
	//TODO Переделать под управляемые формы
	//ПараметрыОткрытия= уб_СС.ПараметрыНачалаВыбора();
	//ПараметрыОткрытия.Вставить("МенюПоТипам",     Новый Структура("Контрагенты",Истина));
	//ПараметрыОткрытия.Вставить("ОтображениеМеню", Новый Структура("Контрагенты",Истина));
	//ТекущиеДанные = Элементы.СтраховыеКомпании.ТекущиеДанные;
	//Если Элемент.Имя = "СтраховыеКомпанииСтраховаяКомпания" Тогда
	//	ПараметрыОткрытия.Вставить("Значение",ТекущиеДанные.СтраховаяКомпания);
	//ИначеЕсли Элемент.Имя = "СтраховыеКомпанииПоставщик" Тогда	
	//	ПараметрыОткрытия.Вставить("Значение",ТекущиеДанные.Поставщик);
	//КонецЕсли;	
	//ПараметрыОткрытия.Вставить("ИмяФормыВыбора","ФормаВыбораУправляемая");
	//уб_СС.ВыборПоставщика(Элемент, СтандартнаяОбработка,,ПараметрыОткрытия);
	
КонецПроцедуры


&НаКлиенте
Процедура СтраховыеКомпанииСтраховаяКомпанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанные.Поставщик.Пустая() Тогда
		ТекущиеДанные.Поставщик = ТекущиеДанные.СтраховаяКомпания;
	КонецЕсли;
	Элементы.СтраховыеКомпании.ТекущийЭлемент = Элементы.СтраховыеКомпанииОрганизацияАгент; 
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеКомпанииОрганизацияАгентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	СписокВсех = уб_СЛ.СписокДоступныхОрганизаций();
	НовыйСписок = Новый СписокЗначений;
	НовыйСписок.ЗагрузитьЗначения(СписокВсех);
	
	ТекущийСписок = Элементы.СтраховыеКомпании.ТекущиеДанные.ОрганизацияАгент;
	Для каждого ТекущийЭлементСписка из ТекущийСписок Цикл
		НайденныйЭлементСписка = НовыйСписок.НайтиПоЗначению(ТекущийЭлементСписка.Значение);
		Если НайденныйЭлементСписка = Неопределено Тогда
			Сообщить("Организация "+ТекущийЭлементСписка.Значение+" удалена из списка доступных");
		Иначе
			НайденныйЭлементСписка.Пометка = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОписаниеВыбораСписка = Новый ОписаниеОповещения("ПослеОтметкиСписка",ЭтаФорма,Новый Структура("Элемент,ИмяПоля",Элемент,"ОрганизацияАгент"));
	НовыйСписок.ПоказатьОтметкуЭлементов(ОписаниеВыбораСписка, "Отметьте брокеров, для которых действует");
	
КонецПроцедуры


&НаКлиенте
Процедура СтраховыеКомпанииВидыСПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	ТекущиеДанные = Элементы.СтраховыеКомпании.ТекущиеДанные;
	
	СписокВсех = уб_СЛ.СписокВидовСП(?(НЕ ТекущиеДанные.Поставщик.Пустая(),ТекущиеДанные.Поставщик,ТекущиеДанные.СтраховаяКомпания),ТекущиеДанные.ОрганизацияАгент.ВыгрузитьЗначения());
	
	НовыйСписок = Новый СписокЗначений;
	НовыйСписок.ЗагрузитьЗначения(СписокВсех);
	
	ТекущийСписок = ТекущиеДанные.ВидыСП;
	Для каждого ТекущийЭлементСписка из ТекущийСписок Цикл
		НайденныйЭлементСписка = НовыйСписок.НайтиПоЗначению(ТекущийЭлементСписка.Значение);
		Если НайденныйЭлементСписка = Неопределено Тогда
			Сообщить("Вид СП "+ТекущийЭлементСписка.Значение+" удален из списка доступных");
		Иначе
			НайденныйЭлементСписка.Пометка = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОписаниеВыбораСписка = Новый ОписаниеОповещения("ПослеОтметкиСписка",ЭтаФорма,Новый Структура("Элемент,ИмяПоля",Элемент,"ВидыСП"));
	НовыйСписок.ПоказатьОтметкуЭлементов(ОписаниеВыбораСписка, "Отметьте виды страховых продуктов, для которых действует");
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеОтметкиСписка(Список,ДополнительныеПараметры) Экспорт
	Если Не Список = Неопределено Тогда
		СписокДляЗаписи = Новый СписокЗначений;
		Для каждого ТекущийЭлементСписка из Список Цикл
			Если ТекущийЭлементСписка.Пометка Тогда
				СписокДляЗаписи.Добавить(ТекущийЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;	
		Элементы.СтраховыеКомпании.ТекущиеДанные[ДополнительныеПараметры.имяПоля] = СписокДляЗаписи;
		Если ДополнительныеПараметры.имяПоля = "ОрганизацияАгент" Тогда
			Элементы.СтраховыеКомпании.ТекущийЭлемент = Элементы.СтраховыеКомпанииВидыСП; 
		ИначеЕсли ДополнительныеПараметры.имяПоля = "ВидыСП" Тогда	
			ТекущийЭлемент = Элементы.Добавить; 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти					
#КонецОбласти					


