Функция ВидыКонтактнойИнформации(ВидОбъектаКонтактнойИнформации,Используется = 1) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыКонтактнойИнформации.Ссылка,
	               |	ВидыКонтактнойИнформации.Наименование,
	               |	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации,
	               |	ВидыКонтактнойИнформации.Представление,
	               |	ВидыКонтактнойИнформации.Тип КАК Тип
	               |ИЗ
	               |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	               |ГДЕ
	               |	ВидыКонтактнойИнформации.Используется <= &Используется
				   |	и ВидыКонтактнойИнформации.Используется <> 0
	               |	И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |			ТОГДА 0
				   |		КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ТОГДА 1
				   |		КОГДА ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |			ТОГДА 2
	               |		ИНАЧЕ 4
	               |	КОНЕЦ";
	Запрос.УстановитьПараметр("Используется",Используется);
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации",ВидОбъектаКонтактнойИнформации);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
КонецФункции	
	

// Функция выполняет "преобразование" строкового представления адреса в структуру
Функция ПолучитьСтруктуруАдресаИзСтроки(Знач СтроковыйАдрес) Экспорт
	
	Если ПустаяСтрока(СтроковыйАдрес) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧислоВхожденийЗапятойВАдрес = СтрЧислоВхождений(СтроковыйАдрес, ","); 
	
	Если ЧислоВхожденийЗапятойВАдрес = 9 Тогда
		
		СтруктураАдреса = РегламентированнаяОтчетность.РазложитьАдрес(СтроковыйАдрес);
		
	ИначеЕсли ЧислоВхожденийЗапятойВАдрес >= 1 Тогда
		
		СтруктураАдреса = Новый Структура;	
		СтруктураАдреса.Вставить("ЗаПределамиРФ", Истина);
		СтруктураАдреса.Вставить("Страна", СокрЛП(Лев(СтроковыйАдрес, Найти(СтроковыйАдрес, ",") - 1)));
		СтруктураАдреса.Вставить("Представление", СтроковыйАдрес);			
		
	Иначе
		// вообще запятых нет в представлении - значит необычный Российский Адрес
		СтруктураАдреса = Новый Структура;	
		СтруктураАдреса.Вставить("ЗаПределамиРФ", Истина);
		СтруктураАдреса.Вставить("Страна", Справочники.КлассификаторСтранМира.Россия.Наименование);
		СтруктураАдреса.Вставить("Представление", СтроковыйАдрес);
		
	КонецЕсли;
		
	Возврат СтруктураАдреса;	
	
КонецФункции


// Функция считывает контактную информацию из ИБ в таблицу значений.
//
// Параметры:
//  Ссылка - Объект, по которому необходимо заполнить КИ
//
Функция ПрочитатьКонтактнуюИнформацию(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
			   
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.Вид КАК Вид,
	               |	ВложенныйЗапрос.Тип КАК Тип,
	               |	ВложенныйЗапрос.Объект КАК Объект,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле1) КАК Поле1,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле2) КАК Поле2,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле3) КАК Поле3,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле4) КАК Поле4,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле5) КАК Поле5,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле6) КАК Поле6,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле7) КАК Поле7,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле8) КАК Поле8,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле9) КАК Поле9,
	               |	МАКСИМУМ(ВложенныйЗапрос.Поле10) КАК Поле10,
	               |	МАКСИМУМ(ВложенныйЗапрос.Представление) КАК Представление,
	               |	МАКСИМУМ(ВложенныйЗапрос.Комментарий) КАК Комментарий,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗначениеПоУмолчанию) КАК ЗначениеПоУмолчанию
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		&Объект КАК Объект,
	               |		ВидыКонтактнойИнформации.Тип КАК Тип,
	               |		ВидыКонтактнойИнформации.Ссылка КАК Вид,
	               |		"""" КАК Представление,
	               |		"""" КАК Поле1,
	               |		"""" КАК Поле2,
	               |		"""" КАК Поле3,
	               |		"""" КАК Поле4,
	               |		"""" КАК Поле5,
	               |		"""" КАК Поле6,
	               |		"""" КАК Поле7,
	               |		"""" КАК Поле8,
	               |		"""" КАК Поле9,
	               |		"""" КАК Поле10,
	               |		"""" КАК Комментарий,
	               |		ЛОЖЬ КАК ЗначениеПоУмолчанию
	               |	ИЗ
	               |		Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	               |	ГДЕ
	               |		НЕ ВидыКонтактнойИнформации.ПометкаУдаления
	               |		И ВидыКонтактнойИнформации.Используется > 0
	               |		И ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		РегистрСведенийКонтактнаяИнформация.Объект,
	               |		РегистрСведенийКонтактнаяИнформация.Тип,
	               |		РегистрСведенийКонтактнаяИнформация.Вид,
	               |		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Представление КАК СТРОКА(1000)),
	               |		РегистрСведенийКонтактнаяИнформация.Поле1,
	               |		РегистрСведенийКонтактнаяИнформация.Поле2,
	               |		РегистрСведенийКонтактнаяИнформация.Поле3,
	               |		РегистрСведенийКонтактнаяИнформация.Поле4,
	               |		РегистрСведенийКонтактнаяИнформация.Поле5,
	               |		РегистрСведенийКонтактнаяИнформация.Поле6,
	               |		РегистрСведенийКонтактнаяИнформация.Поле7,
	               |		РегистрСведенийКонтактнаяИнформация.Поле8,
	               |		РегистрСведенийКонтактнаяИнформация.Поле9,
	               |		РегистрСведенийКонтактнаяИнформация.Поле10,
	               |		ВЫРАЗИТЬ(РегистрСведенийКонтактнаяИнформация.Комментарий КАК СТРОКА(1000)),
	               |		РегистрСведенийКонтактнаяИнформация.ЗначениеПоУмолчанию
	               |	ИЗ
	               |		РегистрСведений.КонтактнаяИнформация КАК РегистрСведенийКонтактнаяИнформация
	               |	ГДЕ
	               |		РегистрСведенийКонтактнаяИнформация.Объект = &Объект) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Вид,
	               |	ВложенныйЗапрос.Тип,
	               |	ВложенныйЗапрос.Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Представление УБЫВ,
	               |	ВложенныйЗапрос.Тип.Порядок,
	               |	Вид";
				 
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКИ(Ссылка));
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из ТабЗн Цикл
		стр.Представление = СокрП(стр.Представление);
		стр.Комментарий   = СокрП(стр.Комментарий);
	КонецЦикла;
	
	Возврат ТабЗн;
	
КонецФункции

// Процедура записывает контактную информацию в ИБ из набора записей регистра сведений.
//
// Параметры:
//  НаборЗаписей - набор записей регистра сведений
//  Ссылка - Объект, по которому необходимо записать КИ
//  Отказ - Булево
//
Процедура ЗаписатьКонтактнуюИнформацию(НаборЗаписей, Ссылка, Отказ) Экспорт

	Индекс = 0;
	Пока 1 = 1 Цикл
		
		Если Индекс > НаборЗаписей.Количество() - 1 Тогда
			Прервать;
		КонецЕсли; 
		
		Запись = НаборЗаписей[Индекс];
		
		Если НЕ ЗначениеЗаполнено(Запись.Представление) Тогда
			НаборЗаписей.Удалить(Запись);
			Продолжить;
		КонецЕсли;
		
		Запись.Объект = Ссылка;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Отбор.Объект.Значение = Ссылка;
	НаборЗаписей.Отбор.Объект.Использование = Истина;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки(),"Сообщить");
		//ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, ("Элемент """ + СокрЛП(Ссылка) + """ не записан. Не записана контактная информация."));
		//Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	//ПрочитатьКонтактнуюИнформацию(НаборЗаписей, Ссылка)
	
КонецПроцедуры

Функция ВидОбъектаКИ(ОбъектСсылка) Экспорт

	Если ОбъектСсылка = Неопределено Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.ПустаяСсылка();
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Организации") Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.Организации;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица;
	Иначе
		Возврат Перечисления.ВидыОбъектовКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции // ВидОбъектаКИ()

