Процедура Печать(ТЗ) Экспорт 
	
	ТабДокумент = ПечатьМакета(ТЗ);
		
КонецПроцедуры	

Функция ПечатьМакета(ТЗРассрочки)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рассрочки_/_Платежи_по_полисам";
	ТабДокумент.ИспользуемоеИмяФайла = "Печать_сетки_КВ";
	
	Макет = ПолучитьМакет("МакетПечати");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	    ОбластьМакета.Параметры.Дата = Формат(ТекущаяДата(),"ДЛФ=ДД");
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Платежы");
		Если ТипПлатежаПоДате = 0 Тогда ТипПлатежа = "Все (и просроченные и предстоящие)";
		ИначеЕсли ТипПлатежаПоДате = 1 Тогда ТипПлатежа = "Только просроченные (до сегодня + 3 дня)";
		ИначеЕсли ТипПлатежаПоДате = 2 Тогда ТипПлатежа = "Только предстоящие (с начала сегодняшнего дня)";
   		КонецЕсли;
		ОбластьМакета.Параметры.ТипПлатежаПоДате = ТипПлатежа;
		ОбластьМакета.Параметры.ВерхняяГраницаДатыПлатежа = ВерхняяГраницаДатыПлатежа;
		
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Действие");
		Если ТолькоДействующиеПолисы Тогда
			Действие = "Только действующие полисы";
		Иначе 	
			Действие = "Дата окончания действия полиса после: "+ЗакончилиДействиеПослеДаты+"";
		КонецЕсли; 
		ОбластьМакета.Параметры.Действие = Действие;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(ДатаОформленияПолисаС) ИЛИ ЗначениеЗаполнено(ДатаОформленияПолисаПО) Тогда
	    ОбластьМакета = Макет.ПолучитьОбласть("Оформлен");
		ОбластьМакета.Параметры.ДатаОформленияПолисаС = ДатаОформленияПолисаС;
		ОбластьМакета.Параметры.ДатаОформленияПолисаПО = ДатаОформленияПолисаПО;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
	    ОбластьМакета = Макет.ПолучитьОбласть("Подразделение");
		ОбластьМакета.Параметры.Подразделение = Подразделение;
		ТабДокумент.Вывести(ОбластьМакета);
 	КонецЕсли;
		
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаб");
	ТабДокумент.Вывести(ОбластьМакета);
	ИтогоСуммаПлатежа = 0;
	ИтогоКолСтрок = 0;
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	Для каждого СТЗ Из ТЗРассрочки Цикл
	    ОбластьМакетаСтрока.Параметры.ДатаПлатежа		= СТЗ.ДатаПлатежа;
		ОбластьМакетаСтрока.Параметры.НомерПлатежа		= СТЗ.НомерПлатежа;
		ОбластьМакетаСтрока.Параметры.СтраховойПолис	= СТЗ.СтраховойПолис;
		ОбластьМакетаСтрока.Параметры.СПНомер			= СТЗ.СПНомер;
		ОбластьМакетаСтрока.Параметры.СПДата			= СТЗ.СПДата;
		ОбластьМакетаСтрока.Параметры.Страхователь		= СТЗ.Страхователь;
		ОбластьМакетаСтрока.Параметры.СуммаПлатежа		= СТЗ.СуммаПлатежа;
		ОбластьМакетаСтрока.Параметры.ПокрытиеПлатежа	= СТЗ.ПокрытиеПлатежа;
		ОбластьМакетаСтрока.Параметры.ОплатитьПоПлатежу	= СТЗ.ОплатитьПоПлатежу;
		ОбластьМакетаСтрока.Параметры.СтраховаяПремия	= СТЗ.СтраховаяПремия;
		ОбластьМакетаСтрока.Параметры.ОплаченоСП		= СТЗ.ОплаченоСП;
		ОбластьМакетаСтрока.Параметры.ОплатитьПоПолису	= СТЗ.ОплатитьПоПолису;
		ОбластьМакетаСтрока.Параметры.Агент				= СТЗ.Агент;
		ОбластьМакетаСтрока.Параметры.Подразделение		= СТЗ.Подразделение;
		ОбластьМакетаСтрока.Параметры.НомерЗаявки		= СТЗ.НомерЗаявки;
		ОбластьМакетаСтрока.Параметры.ВидСП				= СТЗ.СтраховойПолис.СтраховойПродукт;
		ИтогоСуммаПлатежа = ИтогоСуммаПлатежа + СТЗ.СуммаПлатежа;
		ИтогоКолСтрок = ИтогоКолСтрок + 1;
		ТабДокумент.Вывести(ОбластьМакетаСтрока);

	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	    ОбластьМакета.Параметры.СуммаПлатежа	= ИтогоСуммаПлатежа;
		ОбластьМакета.Параметры.КоличествоСтрок	= ИтогоКолСтрок;
	ТабДокумент.Вывести(ОбластьМакета);

	
	ТабДокумент.РазмерКолонтитулаСверху = 6;
	ВКлн = ТабДокумент.ВерхнийКолонтитул;
	ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ВКлн.НачальнаяСтраница = 1;
	ВКлн.Выводить	= Истина;
	ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
	ВКлн.Шрифт = Новый Шрифт(,7);
	
	
	ТабДокумент.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДокумент.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница = 1;
	HКлн.Выводить	= Истина;
	HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия + "." + Формат(ТекущаяДата(),"ДФ=yyMMdd.HHmm");
	HКлн.Шрифт = Новый Шрифт(,7);
	
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Печать Рассрочки / Платежи по полисам");
	
	Возврат ТабДокумент;
	
КонецФункции
