
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если Не Предопределенный Тогда
		Префикс = "н"
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//если настройка - индивидуальна - очищаем регистр от профилей с этой настройкой
	Если Не ЭтоГруппа И Не ДобавлятьВПрофили И (РольДоступна("ПолныеПрава") Или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.НастройкаПолномочийИРолей, Ложь)) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Настройка
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Настройка = &Настройка
		|	И НастройкиПользователей.Пользователь ССЫЛКА Справочник.уб_ПрофилиНастроекПользователей";
		Запрос.УстановитьПараметр("Настройка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
			Набор.Отбор.Пользователь.Установить(Выборка.Пользователь);
			Набор.Отбор.Настройка.Установить(Ссылка);
			Набор.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры




