Перем СоотвКурсы;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	#Если Клиент Тогда
	Если ДатаНач = '00010101000000' Тогда
		Предупреждение("Необходимо установить начальную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ДатаКон = '00010101000000' Тогда
		Предупреждение("Необходимо установить конечную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(СК) Тогда
		Предупреждение("Необходимо выбрать Страховую компанию");
		Возврат;
	КонецЕсли;
	#КонецЕсли 
	
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("СК", СК);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОплатыПолисов.СтраховойПолис.Дата КАК ДатаВыдачи,
	               |	ОплатыПолисов.СтраховойПолис.Номер КАК Номер,
	               |	ОплатыПолисов.СтраховойПолис.СК КАК СК,
	               |	ОплатыПолисов.СтраховойПолис.Страхователь КАК Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.СтраховойПродукт КАК СтраховойПродукт,
	               |	ОплатыПолисов.СтраховойПолис.ОбъектСтрахования КАК ОбъектСтрахования,
	               |	ОплатыПолисов.СтраховойПолис.Ответственный КАК Ответственный,
	               |	ОплатыПолисов.СтраховойПолис.Направление КАК Направление,
	               |	ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид КАК ВидСП,
	               |	ОплатыПолисов.СтраховойПолис.Подразделение КАК Подразделение,
	               |	ОплатыПолисов.СтраховойПолис.КредитныйБанк КАК Банк,
	               |	ОплатыПолисов.СтраховойПолис.ВалютаДокумента КАК ВалютаДокумента,
	               |	ОплатыПолисов.СтраховойПолис.СуммаСкидки КАК СуммаСкидки,
	               |	ОплатыПолисов.СтраховойПолис.Пролонгация КАК Пролонгация,
	               |	ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор КАК Кредитный,
	               |	ОплатыПолисов.СтраховойПолис.ЕстьЛизинговыйДоговор КАК Лизинговый,
	               |	ОплатыПолисов.СтраховойПолис.СтраховаяСумма КАК СтраховаяСумма,
	               |	ОплатыПолисов.СтраховойПолис,
	               |	ОплатыПолисов.ДатаМониторинга КАК ДатаМониторинга,
	               |	ОплатыПолисов.Период КАК ДатаОплаты,
	               |	ОплатыПолисов.НомерВзноса,
	               |	ОплатыПолисов.НачисленнаяСуммаВзноса,
	               |	ОплатыПолисов.КВСумма,
	               |	ОплатыПолисов.ФормаОплаты,
	               |	ОплатыПолисов.Комментарий,
	               |	ОплатыПолисов.Автор,
	               |	ОплатыПолисов.Подразделение КАК ПодразделениеОплаты,
	               |	ТранспортныеСредства.ИдентификационныйНомер КАК VIN,
	               |	ТранспортныеСредства.ГодВыпуска
	               |ИЗ
	               |	РегистрСведений.уб_ОплатыПолисов КАК ОплатыПолисов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК ТранспортныеСредства
	               |		ПО ОплатыПолисов.СтраховойПолис.ОбъектСтрахования = ТранспортныеСредства.Объект
	               |ГДЕ
	               |	ОплатыПолисов.ДатаМониторинга >= &ДатаНач
	               |	И ОплатыПолисов.ДатаМониторинга <= &ДатаКон
	               |	И ОплатыПолисов.СтраховойПолис.СК = &СК
	               |	И ОплатыПолисов.СтраховойПолис.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМониторинга,
	               |	ДатаВыдачи";
	
				   //|	И (НЕ ОплатыПолисов.СтраховойПолис.ЕстьЛизинговыйДоговор)
	
	РезЗапроса 	= Запрос.Выполнить();
	
	//ЗаполнитьКурсыВалют();
	
	Макет       = ПолучитьМакет("Макет");
	
	Обл 		= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДатаНач = Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДатаКон = Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК = СК;
	ДокументРезультат.Вывести(Обл);
	
	//РеглВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	РеглВалюта = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
	ИтНачисленнаяСуммаВзноса = 0;
	ИтКВСумма = 0;
	Ном = 0;
	Выборка = РезЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Обл 		= Макет.ПолучитьОбласть("Строка");
		Ном = Ном + 1;
    //SS TODO KV
		Обл.Параметры.Заполнить(Выборка);
		Обл.Параметры.Ном = Ном;
		Обл.Параметры.ПроцентКомиссии = ?(Выборка.НачисленнаяСуммаВзноса=0,0,Окр(Выборка.КВСумма*100/Выборка.НачисленнаяСуммаВзноса,2));
		Обл.Параметры.Валюта = РеглВалюта;
		Обл.Параметры.Пролонгация = ?(Выборка.Пролонгация,"П","");
		Обл.Параметры.Кредитный = ?(Выборка.Кредитный,"К","");
		Обл.Параметры.Лизинговый = ?(Выборка.Лизинговый,"Л","");
		Обл.Параметры.Очередной = ?(Выборка.НомерВзноса > 1,"О","");
		Обл.Параметры.СтраховаяСумма = Формат(Выборка.СтраховаяСумма,"ЧДЦ=2; ЧН=0") + " "+Выборка.ВалютаДокумента;
		
		//ТекКурс = СоотвКурсы.Получить(Выборка.ДатаМониторинга);
		//НачисленнаяСуммаВзноса = Выборка.НачисленнаяСуммаВзноса;// / ТекКурс;
		//КВСумма = Выборка.КВСумма;// / ТекКурс;
		//Обл.Параметры.НачисленнаяСуммаВзноса = НачисленнаяСуммаВзноса;
		//Обл.Параметры.КВСумма = КВСумма;
    //SS TODO KV
		ИтНачисленнаяСуммаВзноса = ИтНачисленнаяСуммаВзноса + Выборка.НачисленнаяСуммаВзноса;
		ИтКВСумма = ИтКВСумма + Выборка.КВСумма;
		
		Если Выборка.СуммаСкидки<>0 Тогда
			Обл.Параметры.Скидка = Строка(Выборка.СуммаСкидки) + " "+Выборка.ВалютаДокумента;
		Иначе
			Обл.Параметры.Скидка = "";
		КонецЕсли;
		Отбор = Новый Структура();
		Отбор.Вставить("Период", Выборка.ДатаОплаты);
		Отбор.Вставить("Подразделение", Выборка.ПодразделениеОплаты);
		Отбор.Вставить("СтраховойПолис", Выборка.СтраховойПолис);
		КлючЗаписи = РегистрыСведений.уб_ОплатыПолисов.СоздатьКлючЗаписи(Отбор);
		Обл.Параметры.РасшОплата	= КлючЗаписи;
		Обл.Параметры.ЗначРасшифровки = Выборка.СтраховойПолис;
		
		ДокументРезультат.Вывести(Обл);
		
	КонецЦикла;
    //SS TODO KV
	Обл 		= Макет.ПолучитьОбласть("Итого");
	Обл.Параметры.НачисленнаяСуммаВзноса 	= ИтНачисленнаяСуммаВзноса;
	Обл.Параметры.КВСумма = ИтКВСумма;
	ДокументРезультат.Вывести(Обл);
	

	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 6;
	ДокументРезультат.ФиксацияСлева		= 0;

	//ДокументРезультат.Показать("Мониторинг");
	
КонецПроцедуры
