//Служебный обработка для хранения кэша соединений
Перем мСоединения Экспорт;
Перем Strmatch Экспорт;



	// Компонента для нечеткого сравнения строк
///////////////////////////////////////////////////////////////////////////
Функция ИнициализироватьКомпонентуStrMatch(Повторно=ЛОжь,КэшироватьФизлиц=Истина) Экспорт
	Перем КомпонентаИнициализирована;
	
	КомпонентаИнициализирована = НЕ Strmatch = Неопределено;
	Если КомпонентаИнициализирована Тогда
		Если Не Повторно Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
	ИмяКомпоненты = "StrMatch.dll";
	КаталогКомпонент = ПараметрыСеанса.уб_Константы.КаталогВнешнихКомпонент;
	
	Если ЗначениеЗаполнено(КаталогКомпонент) = Истина Тогда
		ИмяКомпоненты = ""+КаталогКомпонент+"\"+ИмяКомпоненты;
		ИмяКомпоненты = СтрЗаменить(ИмяКомпоненты,"\\","\");
	КонецЕсли;
	
	//Первый способ
	Попытка	
		ЗагрузитьВнешнююКомпоненту(ИмяКомпоненты);
		
		Strmatch = Новый ("AddIn.StrMatchExtension");
		
		Ошибка = "";
	Исключение
		Ошибка = ОписаниеОшибки();
		Strmatch = Неопределено;
	КонецПопытки;
	
	//Второй способ
	Если Strmatch = Неопределено Тогда
		Попытка
			ПодключитьВнешнююКомпоненту("StrMatchExtension");
			Strmatch = Новый ("AddIn.StrMatchExtension");
		Исключение	
			Ошибка = ОписаниеОшибки();
			Strmatch = Неопределено;
		КонецПопытки;	
	КонецЕсли;	
	
	КомпонентаИнициализирована = НЕ Strmatch = Неопределено;
	
	Если КомпонентаИнициализирована Тогда
		Если КэшироватьФизлиц  = Истина Тогда
			уб_temp.СоздатьКэшСправочника(222,"ФизическиеЛица");
		КонецЕсли;	
	Иначе	
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При создании объекта AddIn.StrMatchExtension: "+Ошибка);
	КонецЕсли;	
	Возврат КомпонентаИнициализирована;
КонецФункции

	//ПараметрыСеанса.уб_ИнициализированаКомпонентаStrmatch = Ложь;
	//ПроверятьНаименованияФизлицПриЗаписи = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ПроверятьНаименованияФизлицПриЗаписи");
	//
	//Если ПроверятьНаименованияФизлицПриЗаписи Тогда
	//	Попытка	
	//		ЗагрузитьВнешнююКомпоненту("StrMatch.dll");
	//		Strmatch = Новый ("AddIn.StrMatchExtension");
	//		ПараметрыСеанса.уб_ИнициализированаКомпонентаStrmatch = Истина;
	//	Исключение
	//		
	//	КонецПопытки	
	//	Если ПараметрыСеанса.уб_ИнициализированаКомпонентаStrmatch Тогда
	//		уб_temp.СоздатьКэшСправочника(222,"ФизическиеЛица");
	//	КонецЕсли;	
	//КонецЕсли;
//КонецПроцедуры

Функция НечеткийПоиск(
	Подстрока, 
	ВидСправочника		= "Контрагенты",
	НомерКэша			= 111,
	КоличествоВТопЛисте	= 10,
	ВыводитьСообщения	= Ложь,
	ИсключаемыйЭлемент	= Неопределено,
	Соединение			= Неопределено
	) Экспорт
	//ОчиститьСообщения();
	
	Внешнее = НЕ Соединение=Неопределено;
	
	//ЭтоМассив = ТипВозвращаемого ="Массив";
	//Если ЭтоМассив Тогда
		//Если Внешнее Тогда
		//	МассивДублей = Соединение.NewObject("Массив");
		//Иначе	
			МассивДублей = Новый Массив;
//		КонецЕсли;	
	//Иначе
	//	Если Внешнее Тогда
	//		МассивДублей = Соединение.NewObject("СписокЗначений");
	//	Иначе	
	// 		МассивДублей = Новый СписокЗначений;
	//	КонецЕсли;	
	//КонецЕсли;
	ТекстОшибки ="";
	//strmatch = уб_Кэшируемые.strmatch(ТекстОшибки);
	Если  strmatch = Неопределено Тогда
		Возврат МассивДублей;
	Иначе	
		strmatch.СравнитьСКэшем(НомерКэша, Строка(Подстрока), КоличествоВТопЛисте);
	КонецЕсли;	
	
	ВидСправочникаВКоде = ВидСправочника = "";
	ДлинаКода = 9;
	
	Для СчПодбора = 1 по КоличествоВТопЛисте Цикл
		Имя = "";
		КоэффициентСхожести = 0;
		Хэш = Strmatch.ПолучитьИзПодбора(СчПодбора,Имя,КоэффициентСхожести);
		Если ВидСправочникаВКоде Тогда
			ВидСправочника = СокрЛП(Сред(Имя,ДлинаКода+1));
			Код = Лев(Имя,ДлинаКода);
		Иначе	
			Код = Имя;
		КонецЕсли;	
		Если Внешнее Тогда
			Ссылка = Соединение.Справочники[ВидСправочника].НайтиПоКоду(Код);
		Иначе
			Ссылка = Справочники[ВидСправочника].НайтиПоКоду(Код);
		КонецЕсли;	
	
		Если ИсключаемыйЭлемент = Ссылка  Тогда
			Продолжить;
		КонецЕсли;	
		//Если ЭтоМассив Тогда
			Если МассивДублей.Найти(Ссылка) = Неопределено Тогда
				
				Если Ссылка.Пустая() Тогда
				Иначе	
					Если ВыводитьСообщения Тогда
						//ЗаписатьОшибкуИСообщить("" + Ссылка + "(" + КоэффициентСхожести + ")");
					КонецЕсли;
					МассивДублей.Добавить(Ссылка);
				КонецЕсли;
			КонецЕсли;
		//Иначе
		//	//СписокЗначений
		//	Если МассивДублей.НайтиПоЗначению(Ссылка)= Неопределено Тогда
		//		
		//		Если Ссылка.Пустая() Тогда
		//		Иначе	
		//			Если ВыводитьСообщения Тогда
		//				//ЗаписатьОшибкуИСообщить("" + Ссылка + "(" + КоэффициентСхожести + ")");
		//			КонецЕсли;	
		//			МассивДублей.Добавить(Ссылка,Ссылка.Наименование);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	Возврат МассивДублей;
КонецФункции	
мСоединения = Новый Соответствие;
Strmatch = Неопределено;
