
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр уб_РасчетыСПоставщиками Приход
	Если Поставщик.Пустая() Тогда
		Если Не Отказ Тогда 
			Сообщить("Ошибка при проведении "+Ссылка);
		КонецЕсли;
		Сообщить("Не заполнен Поставщик!");
		Отказ = Истина;
	КонецЕсли;	
	
	Если ОрганизацияАгент.Пустая() Тогда
		Если Не Отказ Тогда 
			Сообщить("Ошибка при проведении "+Ссылка);
		КонецЕсли;
		Сообщить("Не заполнена Организация агент!");
		Отказ = Истина;
	КонецЕсли;	
	
	Если ВидОперации.Пустая() Тогда
		Если Не Отказ Тогда 
			Сообщить("Ошибка при проведении "+Ссылка);
		КонецЕсли;
		Сообщить("Не выбран вид операции!");
		Отказ = Истина;
	КонецЕсли;	
	
	Если СуммаДокумента = 0 Тогда
		Если Не Отказ Тогда 
			Сообщить("Ошибка при проведении "+Ссылка);
		КонецЕсли;
		Сообщить("Не заполнена сумма!");
		Отказ = Истина;
	КонецЕсли;	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.уб_РасчетыСПоставщиками.Записывать = Истина;
	Движения.уб_РасчетыСПоставщиками.Очистить();
	
	Движение					= Движения.уб_РасчетыСПоставщиками.Добавить();
	Движение.Активность			= Истина;
	Движение.Период				= Дата;
	Движение.ОрганизацияАгент	= ОрганизацияАгент;
	Движение.Контрагент			= Поставщик;
	//Движение.Валюта
	Движение.Регистратор		= Ссылка;

	//Если оплата штрафа
	Если ВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов.Штраф Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма       = СуммаДокумента;		
		Движение.Описание    = "Поставщиком выставлен штраф";
		Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	ИначеЕсли ВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов.ДВОУ Тогда
		Движение.ВидДвижения = ВидДВиженияНакопления.Приход;
		Движение.СуммаКВ     = СуммаДокумента;
		Движение.Описание    = "Поставщику оказаны дополнительные услуги (ДВОУ)";
		Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	КонецЕсли;
	
КонецПроцедуры
