Перем СоотвИнфоКВМ;
Перем ЧФ, ЧФ000, ЧФ0,КФ;
Перем РазмерКС Экспорт; 
Перем ДатаНачала;



Процедура РассчитатьТаблицы(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски = Неопределено,ТЗИнтервалов=Неопределено) Экспорт
	
	ЭтоВариант20200201 = ЗарплатныйПериод >= Дата(2019,1,1);
	ЭтоВариант20200301 = ЗарплатныйПериод >= Дата(2020,3,1) или НовыйРегламент; //ОП НБ
	ЭтоВариант20200401 = ЗарплатныйПериод >= Дата(2020,4,1) или НовыйРегламентРОП; //РОП НБ
	
	Если  ЭтоВариант20200301 или ЭтоВариант20200401 Тогда
		РассчитатьТаблицы2020(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски,ТЗИнтервалов);
		Возврат;
	КонецЕсли;	
	////////////////////////////////////////////////////////
	//ЭТАП №1. ПОЛУЧЕНИЕ И ЗАДЕНИЕ НАСТРОЕК РАСЧЕТА
	////////////////////////////////////////////////////////
	Если тзАгентовДляРаскраски = Неопределено Тогда
		тзАгентовДляРаскраски = Новый ТаблицаЗначений;
		тзАгентовДляРаскраски.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПолеМенеджера",Новый ОписаниеТипов("Булево"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПлан",Новый ОписаниеТипов("Булево"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьКоличественныйПлан",Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	СоотвИнфоКВМ = Новый Соответствие;
	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
	стрСостояние    = "Расчет ЗП ОП за "+Формат(ЗарплатныйПериод,"ДФ='MMMM yyyy'");
	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
	//кАгентская 	    = Перечисления.уб_ВидыЗаявок.Агентская;	 
	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	СхемаПоАВ       = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
	//пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
	//пВидЕКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО;
	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
	
	ЗапросРасчетВМ = Новый Запрос;
	
	ОписаниеТипаЧисло14_2_но	= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(14, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаПроцент			= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТипаДата			= Новый ОписаниеТипов("Дата",,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТипаБулево			= Новый ОписаниеТипов("Булево");
	ОписаниеТипаСтрока			= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20));
	ОписаниеТипа_ФизЛицо		= Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	ОписаниеТипаЧисло12_0       = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(12, 0));
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	ОписаниеТипа_Подразделение = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеТипа_Организации = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ПеречислениеСсылка.уб_ЗП_СхемыВознагражденияРуководителейОП"));
	ОписаниеТипаСхемВознРукОП = Новый ОписаниеТипов(Массив);
	
	РазмерКС = ?(ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1),уб_РасчетыСменеджерами.РазмерКС(ЗарплатныйПериод),50000);
	
	РасчетДО1БП = уб_РасчетыСменеджерами.РасчетДО1БП(ЗарплатныйПериод);
	
	ЭтоПолныеПрава = ПолныеПрава();
	
	ЭтоВариант20121001 = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
	
	ЭтоВариант20120401 = ЗарплатныйПериод >= Дата(2012,4,1); //У руководителей корректируется ЗП при наличии КС
	
	ЭтоВариант20121201 = ЗарплатныйПериод >= Дата(2012,12,1);//Используются 2 бонус планки
	ЭтоВариант20130301 = ЗарплатныйПериод >= Дата(2013,3,1) ; //Для истории КВ Агента
	
	ЭтоВариант20130801 = ЗарплатныйПериод >= Дата(2013,8,1);//Количественный план
	ЭтоВариант20130901 = ЗарплатныйПериод >= Дата(2013,9,1);//Количественный план РОП
	ЭтоВариант20150401 = ЗарплатныйПериод >= Дата(2015,4,1);//До Суперплана для РОП при неполненном колич, но больших сборах
	ЭтоВариант20150601 = ЗарплатныйПериод >= Дата(2015,6,1);//Штрафной план вычитается из бонуспланок
	ЭтоВариант20150801 = ЗарплатныйПериод >= Дата(2015,8,1);//Структура отбора делается по ПлануСКВ
	ЭтоВариант20150901 = ЗарплатныйПериод >= Дата(2015,10,1) ИЛИ НовыйРегламент;//Структура отбора делается по ПлануСКВ -> замена 9 на 10
	ЭтоВариант20170101 = ЗарплатныйПериод >= Дата(2017,1,1);//Мастер получает ЗП через кассу
	ЭтоВариант20170901 = ЗарплатныйПериод >= Дата(2017,8,1);//Мастер и ведущие в одном отделе
	ДатаНачалаАВиТО = Дата(2016,1,1);
	ЭтоВариант20151001 = ЗарплатныйПериод >= ДатаНачалаАВиТО;//АВ и ТО сдается в кассу
	ЭтоВариант20171001 = ЗарплатныйПериод >= Дата(2017,11,1);//СКВ КС вычиватеся из БАЗЫ РОП
	ЭтоВариант20180701 = ЗарплатныйПериод >= Дата(2018,7,1);//СКВ КС вычиватеся из БАЗЫ РОП
	ЭтоВариант20180801 = ЗарплатныйПериод >= Дата(2018,8,1);//Автоматическое изменние дельты АВ
	ЭтоВариант20181001 = ЗарплатныйПериод >= Дата(2025,2,1);//Сравнение количества клиентов с прошлым годом для оценки выполнения плана
	ЭтоВариант20191001 = ЗарплатныйПериод >= Дата(2025,1,1);//Сравнение количества клиентов с прошлым годом для оценки выполнения плана
	ЭтоВариант20191201 = ЗарплатныйПериод >= Дата(2019,12,1);//ОТДЕЛ 5 так же как мастер
	ЭтоВариант20200801 = ЗарплатныйПериод >= Дата(2020,8,1);
	
	АгенскаяСеть = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Агентская сеть");
	
	ТаблицаПлавающихСтавокРОП = ПолучитьТаблицуПлавающихСтавокРОП();
	////////////////////////////////////////////////////////
	// ПОЛУЧЕНИЕ ДАННЫХ ИЗ ОПЛАТ ЛИБО ИЗ ИСТОРИИ ОПЛАТ
	////////////////////////////////////////////////////////
	
	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
	ФильтрПоПодразделению = ЗначениеЗаполнено(Подразделение) И РежимОтчета = 0 ;			   
	ФильтрПоСП = ЗначениеЗаполнено(ВидСП);
	Этап = Этап + 1;
	ВРеальномВремени  = Не ЗначениеЗаполнено(ДатаСреза);
	//этоКС = НЕ _вм.СписокКС.Найти(ОП.Знч("Ссылка")) = Неопределено;
	//						__ВознаграждениеМенеджера = Окр(?(_вм.ЗП_СКВ=0 ИЛИ _этоКС,0,_вм.ЗП_СКВ*__СКВ/_вм.СКВ)+?(бЗаблокирована,ОП.Знч("ВознаграждениеМенеджера"),_ВознаграждениеМенеджера)+
	//						?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.Бонус_КС*__СКВ/_вм.СКВ_КС),2);
	
	Если ВРеальномВремени Тогда
		//////////////////////////////////////////////////////////////////////////////////////////
		// Запрос формируется на основании Документов уб_ОплатаПолисов по текущему их состоянию //
		//////////////////////////////////////////////////////////////////////////////////////////
		УсловиеОтбораОплат = "
		|ГДЕ ИСТИНА ";		
		УсловиеОтбораОплат = УсловиеОтбораОплат + "
		|	И ОП.ЗарплатныйПериод >= &ДатаНачала
		|	И ОП.ЗарплатныйПериод <= &ДатаКонца ";
		Если ПоказатьТолькоОплатыНеИзЭтогоЗППериода Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И (ОП.Дата < &ДатаНачала ИЛИ ОП.Дата > &ДатаКонца) ";
		КонецЕсли;		
		Если НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ ";
		КонецЕсли;		
		УсловиеОтбораОплат = УсловиеОтбораОплат + "
		|	И ОП.СтраховойПолис.Ссылка <> &ПустойПолис
		|	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
		|   И (ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером)<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ))
		//|    ИЛИ 
		//|      ВЫБОР
		//|      КОГДА ОП.ЗарплатныйПериод >= ДАТАВРЕМЯ(2015, 9, 1)
		//|        ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		//|      ИНАЧЕ 0 //ВЫБОР
		//|            //КОГДА ОП.ОплаченоФакт > 0
		//|            //     И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		//|            //  ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		//|            //ИНАЧЕ 0
		//|            //КОНЕЦ
		//|      КОНЕЦ > 0
		//|     ) //Вместо нижестоящей
		//|	И ОП.СтраховойПолис.НомерЗаявки <> &ЛичнаяСтраховка 
		|   И ОП.ПометкаУдаления = ЛОЖЬ ";		
		Если ФильтрПоСП Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ВидС = &ВидСП ";
		КонецЕсли;		
		//Если ФильтрПоМенеджеру Тогда
		//УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Агент = &Менеджер ";
		//КонецЕсли;		
		//Если ФильтрПоПодразделению Тогда
		//	УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Подразделение = &Подразделение ";
		//КонецЕсли;		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДатаНачала);
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДатаКонца);
		//ЗапросРасчетВМ.УстановитьПараметр("ЛичнаяСтраховка",кЛичнаяЗаявка);
		//ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
		ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
		//ЗапросРасчетВМ.УстановитьПараметр("ВидКАСКО",		пВидКАСКО);
		//ЗапросРасчетВМ.УстановитьПараметр("ВидЕКАСКО",		пВидЕКАСКО);
		ЗапросРасчетВМ.УстановитьПараметр("ПустойПолис",	ПустойПолис);		
		ЗапросРасчетВМ.УстановитьПараметр("Менеджер",		Менеджер);
		ЗапросРасчетВМ.УстановитьПараметр("Подразделение",	Подразделение);
		ЗапросРасчетВМ.УстановитьПараметр("ВидСП",			ВидСП);		
		ЗапросРасчетВМ.УстановитьПараметр("СотрудникиМастера",ЭтоМастер());
		// Если галочка "пересчитывать суммы в оплатах" ИСТИНА
		Если ПересчитыватьСуммыВОплатах Тогда
			ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОП.Ссылка
			|ИЗ
			|	Документ.уб_ОплатаПолисов КАК ОП" + УсловиеОтбораОплат;
			Результат = ЗапросРасчетВМ.Выполнить();			
			ПересчитатьСуммыПоЗП(Результат);
		КонецЕсли;		
		Если ЭтоПолныеПрава Тогда
			УстановитьПривилегированныйРежим(Истина);
			ЗапросНачисления = Новый Запрос;
			ЗапросНачисления.Текст = "ВЫБРАТЬ
			|	МАКСИМУМ(уб_НачислениеЗП.Дата) КАК Дата
			|ИЗ
			|	Документ.уб_НачислениеЗП КАК уб_НачислениеЗП
			|ГДЕ
			|	уб_НачислениеЗП.ПометкаУдаления = Ложь";
			
			
			Попытка
				ВыборкаНачисления = ЗапросНачисления.Выполнить().Выбрать();
				Если ВыборкаНачисления.Следующий() Тогда
					ЭтоПоследнийРасчет = ДатаНачала >= ВыборкаНачисления.Дата;
				Иначе
					ЭтоПоследнийРасчет = Истина;
				КонецЕсли;	
			Исключение
				ЭтоПоследнийРасчет = Ложь;
			КонецПопытки;	
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ПересчетДельтыАВ = ЭтоВариант20180801 и (ЭтоПоследнийРасчет Или ПересчетДельтыКВ); 
			Если ПересчетДельтыАВ Тогда
				ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ОП.Ссылка
				|ИЗ
				|	Документ.уб_ОплатаПолисов КАК ОП" + СтрЗаменить(УсловиеОтбораОплат,"<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)","=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ) и ПроверенаЗП = ЛОЖЬ");
				Результат = ЗапросРасчетВМ.Выполнить();			
				ПересчитатьДельтыКВ(Результат);
			КонецЕсли;	
		КонецЕсли;	
		
		ЗапросРасчетВМ.Текст = "ВЫБРАТЬ
		                       |	СУММА(НачисленияСКВ.СуммаСКВ) КАК СуммаСКВ,
		                       |	СУММА(НачисленияСКВ.СуммаДБ) КАК СуммаДБ,
		                       |	НачисленияСКВ.Ссылка
		                       |ПОМЕСТИТЬ НачисленияСКВ
		                       |ИЗ
		                       |	(ВЫБРАТЬ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер КАК СуммаСКВ,
		                       |		0 КАК СуммаДБ,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка КАК Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		                       |	
		                       |	ОБЪЕДИНИТЬ ВСЕ
		                       |	
		                       |	ВЫБРАТЬ
		                       |		0,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаМенеджеру)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер <> 0) КАК НачисленияСКВ
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	НачисленияСКВ.Ссылка
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	уб_ПараметрыБСОСрезПоследних.ВидБСО,
		                       |	уб_ПараметрыБСОСрезПоследних.Значение
		                       |ПОМЕСТИТЬ ПараметрыБСО
		                       |ИЗ
		                       |	РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&ДатаКонца, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Страховойполис.Страхователь как Страхователь,
		                       //|	МИНИМУМ(полис.ДатаНачала) КАК ДатаНачала
							   |МИНИМУМ(НачалоПериода(полис.ЗарплатныйПериод,МЕСЯЦ)) КАК ДатаНачала
		                       |ПОМЕСТИТЬ ДатыПервыхПолисов
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК полис
		                       |ГДЕ ПометкаУдаления = Ложь и 
		                       |	НЕ Страховойполис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
		                       |	И Страховойполис.СтраховаяПремия > 0
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	Страховойполис.Страхователь
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, ОП.СхемаРасчетаСМенеджером) КАК СхемаРасчетаСМенеджером,
		                       |	ОП.Ссылка,
							   |    Выбор когда &ЭтоВариант20191001 и (ОП.СтраховойПолис.Заявка.Тип = Значение(Перечисление.уб_ТипВыезда.Пролонгация))  Тогда Истина Иначе ЛОжь Конец как ЭтоПролонгация,
							   |	ОП.ВерсияДанных,
		                       |	ОП.ПометкаУдаления,
		                       |	ОП.Номер,
		                       |	ОП.Дата,
		                       |	ОП.Проведен,
		                       |	ОП.АВилиСкидкаПроцент,
		                       |	ОП.АВилиСкидкаСумма,
		                       |	ОП.Агент,
		                       |	ОП.Баланс_Брокер_Поставщик,
		                       |	ОП.Валюта,
		                       |	ОП.ВидРасчетаСАгентом,
		                       |	ОП.ВидС как ВидСП,
		                       |	ОП.ВМпоРезультатамПериодаЗП,
		                       |	ОП.ВознаграждениеМенеджера, 0 как ВознаграждениеДоп,
							   |	ОП.ВознаграждениеМенеджера как ВознаграждениеМенеджера1,
		                       |	ОП.ВычетСАгента,
		                       |	ОП.ДатаМониторинга,
		                       |	ОП.ДатаПроведенияБСО,
		                       |	ОП.ДокументВыгрузкиВУП,
		                       |	ОП.ЕстьКвитанция,
		                       |	ОП.ЗарплатныйПериод,
		                       |	ОП.ИсключенаИзВзаиморасчетов,
		                       |	ОП.ИсключитьИзРасчетаЗП,
		                       |	ОП.КВПодВопросом,
		                       |	ОП.КВПроцент,
		                       |	ОП.КВПроцентДляАгента,
		                       |	ОП.КВПроцентДляОтчета,
		                       |	ОП.КВСумма,
		                       |	ОП.КВСуммаДляАгента,
		                       |	ОП.КВСуммаДляОтчета,
		                       |	ОП.КодКВ,
		                       |	ОП.Комментарий,
		                       |	ОП.КОплатеАгентом,
		                       |	ОП.Курс,
		                       |	ОП.Курьер,
		                       |	ОП.НачисленнаяСуммаВзноса,
		                       |	ОП.НачисленнаяСуммаВзносаВВалюте,
		                       |	ОП.НеВключатьВОтчетыПоставщикам,
		                       |	ОП.НеМенятьАВ,
		                       |	ОП.НеМенятьВК,
		                       |	ОП.НеМенятьКВ,
		                       |	ОП.НомерВзноса,
		                       |	ОП.НомерКвитанции,
		                       |	ОП.НомерРасчетногоСчета,
		                       |	ОП.ОплаченоФакт,
		                       |	ОП.ОрганизацияАгент,
		                       |	ОП.ОтчетАгента,
		                       |	ОП.ОтчетПоКарточкам,
		                       |	ОП.ОтчетПоставщику,
		                       |	ОП.ПересчетКВ,
		                       |	ОП.ПлатежныйДокумент_Дата,
		                       |	ОП.ПлатежныйДокумент_Номер,
		                       |	ОП.Подразделение,
		                       |	ОП.ПолисАннулирован,
		                       |	ОП.ПолнаяСтраховаяПремия,
		                       |	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		                       |	ОП.Поставщик,
		                       |	ОП.Проблемная,
		                       |	ОП.СК,
		                       |	ОП.СкидкаВыплаченаяКлиенту,
		                       |	ОП.СтраховойПолис,
		                       |	ОП.СтраховойПродукт,
		                       |	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		                       |	ОП.СхемаРасчетаСМенеджером КАК СхемаРасчетаСМенеджером1,
		                       |	ОП.Счет,
		                       |	ОП.ФормаОплаты,
		                       |	ОП.ЭтоКрупнаяСделка,
		                       |	ОП.ПричинаИсключенияИзОП,
		                       |	ОП.СписатьСКурьера,
		                       |	ОП.ОкруглятьКВДо2Знаков,
		                       |	ОП.ДБ,
		                       |	ОП.ВМРасчетное,
		                       |	ОП.ПроверенаЗП,
		                       |	ОП.РазрядностьОкругления,
		                       |	ОП.РежимОкругления,
		                       |	ОП.НаправлениеПлатежа,
		                       |	ОП.Риск,
		                       |	ОП.СуммаДоп,
		                       |	ОП.УдержаноСК,
		                       |	ОП.Куратор,
		                       |	ОП.ПроцентСКВ,
		                       |	ОП.Автор,
		                       |	ОП.ДатаСоздания,
		                       |	ОП.Модификатор,
		                       |	ОП.ДатаИзменения,
		                       |	ОП.РасчетыПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		УидСтроки,
		                       |		СуммаКлиент,
		                       |		СуммаМенеджер,
		                       |		СуммаБрокер,
		                       |		СуммаБрокерВС,
		                       |		Уточнение,
		                       |		ВремяРегистрации,
		                       |		Автор
		                       |	),
		                       |	ОП.УслугиПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		Сумма,
		                       |		Себестоимость,
		                       |		УидСтроки,
		                       |		СхемаОплаты,
		                       |		ВМ,
		                       |		СхемаОплатыРОП,
		                       |		ВР
		                       |	),
		                       |	0 КАК ПартнерскоеВознаграждение,
		                       |	ОП.Подразделение.Владелец КАК Организация,
		                       |	ВЫБОР
		                       |		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		                       |				ИЛИ ОП.Агент В (&СотрудникиМастера)
		                       |			ТОГДА ИСТИНА
		                       |		ИНАЧЕ ЛОЖЬ
		                       |	КОНЕЦ КАК НеОплачиватьКС,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		                       |		ИНАЧЕ ВЫБОР
		                       |				КОГДА ОП.ОплаченоФакт > 0
		                       |						И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		                       |					ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ * (100 - ОП.ПроцентСКВ) / 100
		                       |	КОНЕЦ КАК СКВ,
		                       |	ЕСТЬNULL(НачисленияСКВ.СуммаДБ, 0) КАК СуммаДБ,
		                       |	ОП.СтраховойПолис.СК КАК СП_СК,
		                       |	ОП.ВидС КАК СП_ВидСП,
		                       |	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		                       |	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		                       |	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		                       |	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		                       |	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		                       |	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		                       |	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		                       |	ОП.СтраховойПолис.Сделка КАК Сделка,
		                       |	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК Интервалы,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК ИнтервалыРОП,
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		                       |	ВЫБОР
		                       |		КОГДА ОП.НомерВзноса = 1
		                       |				И (ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		                       |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
							   |                    ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека))
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК КоличествоФакт,
		                       |	1 КАК ЕД,
		                       |	ЕСТЬNULL(ВЫРАЗИТЬ(ПараметрыБСО.Значение КАК ЧИСЛО(10, 0)), ВЫБОР
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
		                       |				ТОГДА 0
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
		                       |					И ОП.НачисленнаяСуммаВзноса < 1500
		                       |				ТОГДА 0
		                       |			ИНАЧЕ 1
		                       |		КОНЕЦ) КАК КоэффициентВида,
		                       |	ВЫБОР Когда ОП.Направление = Значение(Перечисление.Уб_Направления.НовыйКлиент) Тогда 1  Когда ОП.Направление = Значение(Перечисление.Уб_Направления.Пролонгация) Тогда 0 
							   //|		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
							   //|			ТОГДА 0
							   //|		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
							   //|				И ОП.НачисленнаяСуммаВзноса < 1500
							   //|			ТОГДА 0
		                       |		КОГДА ОП.НомерВзноса = 1
		                       |				И НачалоПериода(ОП.ЗарплатныйПериод,МЕСЯЦ)=ДатыПервыхПолисов.ДатаНачала//РАЗНОСТЬДАТ(ДатыПервыхПолисов.ДатаНачала, &ДатаКонца, Секунда) < 90*3600*24
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК НовыйКлиент
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК ОП
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		                       |		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПервыхПолисов КАК ДатыПервыхПолисов
		                       |		ПО ОП.СтраховойПолис.Страхователь = ДатыПервыхПолисов.Страхователь
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСКВ КАК НачисленияСКВ
		                       |		ПО (НачисленияСКВ.Ссылка = ОП.Ссылка)" + УсловиеОтбораОплат;
		#Если Клиент Тогда
			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам периода");
		#КонецЕсли
		Если СКВДляДенег Тогда
			ЗапросРасчетВМ.Текст = Стрзаменить(ЗапросРасчетВМ.Текст,"ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО","ЛОЖЬ");//В ТЧ фигурирует только КВСуммаДляАгента, далее подумать, как в 1С деньги переносить разницу
			ЗапросРасчетВМ.Текст = Стрзаменить(ЗапросРасчетВМ.Текст,"КВСуммаДляАгента","КВСумма");
		КонецЕсли;	
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачалаАВиТО",ДатаНачалаАВиТО);
		ЗапросРасчетВМ.УстановитьПараметр("ЭтоВариант20191001",ЭтоВариант20191001);
		
		ТЗ1	= ЗапросРасчетВМ.Выполнить().Выгрузить();
		ТЗ1.Колонки.Добавить("СКВ_Прол", ОписаниеТипаЧисло14_2_но);
		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДобавитьМесяц(ДатаНачала,-12));
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДобавитьМесяц(ДатаКонца,-12));
		
		ТЗ1_ГодНазад	= ЗапросРасчетВМ.Выполнить().Выгрузить();
		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДатаНачала);
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДатаКонца);
		
		//Дополнение остальными схемами
		//АВ безнал и поставщику включаются по флажку проверена ЗП (когда действительно нам перечислят КВ)
		ЗапросРасчетВМ.Текст = "ВЫБРАТЬ
		                       |	СУММА(НачисленияСКВ.СуммаСКВ) КАК СуммаСКВ,
		                       |	СУММА(НачисленияСКВ.СуммаВМ) КАК СуммаВМ,
		                       |	СУММА(НачисленияСКВ.суммаДБ) КАК суммаДБ,
		                       |	НачисленияСКВ.Схема,
		                       |	НачисленияСКВ.Ссылка
		                       |ПОМЕСТИТЬ НачисленияСКВ
		                       |ИЗ
		                       |	(ВЫБРАТЬ
		                       |		СУММА(ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |					ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ) КАК СуммаСКВ,
		                       |		СУММА(ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |					ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ) КАК СуммаВМ,
		                       |		СУММА(0) КАК суммаДБ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
		                       |			ИНАЧЕ ЕСТЬNULL(УслугиПоОплате.СхемаОплаты, РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером)
		                       |		КОНЕЦ КАК Схема,
		                       |		РасчетыПоОплате.Ссылка КАК Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК РасчетыПоОплате
		                       |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов.УслугиПоДокументу КАК УслугиПоОплате
		                       |			ПО РасчетыПоОплате.Ссылка = УслугиПоОплате.Ссылка
		                       |				И РасчетыПоОплате.УидСтроки = УслугиПоОплате.УидСтроки
		                       |	ГДЕ
		                       |		РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Ссылка.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Безнал), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ВКредит))
		                       |					ТОГДА РасчетыПоОплате.Ссылка.ПроверенаЗП
		                       |				ИНАЧЕ ИСТИНА
		                       |			КОНЕЦ
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |	
		                       |	СГРУППИРОВАТЬ ПО
		                       |		РасчетыПоОплате.Ссылка,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
		                       |			ИНАЧЕ ЕСТЬNULL(УслугиПоОплате.СхемаОплаты, РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером)
		                       |		КОНЕЦ
		                       |	
		                       |	ИМЕЮЩИЕ
		                       |		(СУММА(ВЫБОР
		                       |					КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |						ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |					ИНАЧЕ 0
		                       |				КОНЕЦ) <> 0
		                       |			ИЛИ СУММА(ВЫБОР
		                       |					КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |						ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |					ИНАЧЕ 0
		                       |				КОНЕЦ) <> 0
		                       |			ИЛИ МАКСИМУМ(РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером) = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ))
		                       |	
		                       |	ОБЪЕДИНИТЬ ВСЕ
		                       |	
		                       |	ВЫБРАТЬ
		                       |		0,
		                       |		0,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаМенеджеру)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер <> 0) КАК НачисленияСКВ
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	НачисленияСКВ.Схема,
		                       |	НачисленияСКВ.Ссылка
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	уб_ПараметрыБСОСрезПоследних.ВидБСО,
		                       |	уб_ПараметрыБСОСрезПоследних.Значение
		                       |ПОМЕСТИТЬ ПараметрыБСО
		                       |ИЗ
		                       |	РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&ДатаКонца, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, НачисленияСКВ.Схема) КАК СхемаРасчетаСМенеджером,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаВМ, 0)
		                       |		ИНАЧЕ ОП.ВознаграждениеМенеджера
		                       |	КОНЕЦ КАК ВознаграждениеМенеджера, 0 как ВознаграждениеДоп,
		                       |	0 КАК ПартнерскоеВознаграждение,
		                       |	ОП.Ссылка,
		                       |	ОП.ВерсияДанных,
		                       |	ОП.ПометкаУдаления,
		                       |	ОП.Номер,
		                       |	ОП.Дата,
		                       |	ОП.Проведен,
		                       |	ОП.АВилиСкидкаПроцент,
		                       |	ОП.АВилиСкидкаСумма,
		                       |	ОП.Агент,
		                       |	ОП.Куратор,
		                       |	ОП.Баланс_Брокер_Поставщик,
		                       |	ОП.Валюта,
		                       |	ОП.ВидРасчетаСАгентом,
		                       |	ОП.ВидС как ВидСП,
		                       |	ОП.ВМпоРезультатамПериодаЗП,
		                       |	ОП.ВознаграждениеМенеджера КАК ВознаграждениеМенеджера1,
		                       |	ОП.ВычетСАгента,
		                       |	ОП.ДатаМониторинга,
		                       |	ОП.ДатаПроведенияБСО,
		                       |	ОП.ДокументВыгрузкиВУП,
		                       |	ОП.ЕстьКвитанция,
		                       |	ОП.ЗарплатныйПериод,
		                       |	ОП.ИсключенаИзВзаиморасчетов,
		                       |	ОП.ИсключитьИзРасчетаЗП,
		                       |	ОП.КВПодВопросом,
		                       |	ОП.КВПроцент,
		                       |	ОП.КВПроцентДляАгента,
		                       |	ОП.КВПроцентДляОтчета,
		                       |	ОП.КВСумма,
		                       |	ОП.КВСуммаДляАгента,
		                       |	ОП.КВСуммаДляОтчета,
		                       |	ОП.КодКВ,
		                       |	ОП.Комментарий,
		                       |	ОП.КОплатеАгентом,
		                       |	ОП.Курс,
		                       |	ОП.Курьер,
		                       |	ОП.НачисленнаяСуммаВзноса,
		                       |	ОП.НачисленнаяСуммаВзносаВВалюте,
		                       |	ОП.НеВключатьВОтчетыПоставщикам,
		                       |	ОП.НеМенятьАВ,
		                       |	ОП.НеМенятьВК,
		                       |	ОП.НеМенятьКВ,
		                       |	ОП.НомерВзноса,
		                       |	ОП.НомерКвитанции,
		                       |	ОП.НомерРасчетногоСчета,
		                       |	ОП.ОплаченоФакт,
		                       |	ОП.ОрганизацияАгент,
		                       |	ОП.ОтчетАгента,
		                       |	ОП.ОтчетПоКарточкам,
		                       |	ОП.ОтчетПоставщику,
		                       |	ОП.ПересчетКВ,
		                       |	ОП.ПлатежныйДокумент_Дата,
		                       |	ОП.ПлатежныйДокумент_Номер,
		                       |	ОП.Подразделение,
		                       |	ОП.ПолисАннулирован,
		                       |	ОП.ПолнаяСтраховаяПремия,
		                       |	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		                       |	ОП.Поставщик,
		                       |	ОП.Проблемная,
		                       |	ОП.СК,
		                       |	ОП.СкидкаВыплаченаяКлиенту,
		                       |	ОП.СтраховойПолис,
		                       |	ОП.СтраховойПродукт,
		                       |	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		                       |	ОП.СхемаРасчетаСМенеджером КАК СхемаРасчетаСМенеджером1,
		                       |	ОП.Счет,
		                       |	ОП.ФормаОплаты,
		                       |	ОП.ЭтоКрупнаяСделка,
		                       |	ОП.ПричинаИсключенияИзОП,
		                       |	ОП.СписатьСКурьера,
		                       |	ОП.ОкруглятьКВДо2Знаков,
		                       |	ОП.ДБ,
		                       |	ЕСТЬNULL(НачисленияСКВ.суммаДБ, 0) КАК СуммаДБ,
		                       |	ОП.ВМРасчетное,
		                       |	ОП.ПроверенаЗП,
		                       |	ОП.РазрядностьОкругления,
		                       |	ОП.РежимОкругления,
		                       |	ОП.НаправлениеПлатежа,
		                       |	ОП.Риск,
		                       |	ОП.СуммаДоп,
		                       |	ОП.Автор,
		                       |	ОП.ДатаСоздания,
		                       |	ОП.Модификатор,
		                       |	ОП.ДатаИзменения,
		                       |	ОП.РасчетыПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		УидСтроки,
		                       |		СуммаКлиент,
		                       |		СуммаМенеджер,
		                       |		СуммаБрокер,
		                       |		СуммаБрокерВС,
		                       |		Уточнение,
		                       |		ВремяРегистрации,
		                       |		Автор
		                       |	),
		                       |	ОП.УслугиПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		Сумма,
		                       |		Себестоимость,
		                       |		УидСтроки,
		                       |		СхемаОплаты,
		                       |		ВМ
		                       |	),
		                       |	ОП.Подразделение.Владелец КАК Организация,
		                       |	ВЫБОР
		                       |		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		                       |				ИЛИ ОП.Агент В (&СотрудникиМастера)
		                       |			ТОГДА ИСТИНА
		                       |		ИНАЧЕ ЛОЖЬ
		                       |	КОНЕЦ КАК НеОплачиватьКС,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		                       |		ИНАЧЕ ВЫБОР
		                       |				КОГДА ОП.ОплаченоФакт > 0
		                       |						И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		                       |					ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ
		                       |	КОНЕЦ КАК СКВ,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаВМ, 0)
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК СуммаВМ,
		                       |	ОП.СтраховойПолис.СК КАК СП_СК,
		                       |	ОП.ВидС КАК СП_ВидСП,
		                       |	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		                       |	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		                       |	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		                       |	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		                       |	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		                       |	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		                       |	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		                       |	ОП.СтраховойПолис.Сделка КАК Сделка,
		                       |	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК Интервалы,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК ИнтервалыРОП,
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		                       |	ВЫБОР
		                       |		КОГДА ОП.НомерВзноса = 1
		                       |				И (ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		                       |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
							   |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека))
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК КоличествоФакт,
		                       |	1 КАК ЕД,
		                       |	ЕСТЬNULL(Выразить (ПараметрыБСО.Значение как ЧИСЛО(10,0)), ВЫБОР
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
		                       |				ТОГДА 0
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
		                       |					И ОП.НачисленнаяСуммаВзноса < 1500
		                       |				ТОГДА 0
		                       |			ИНАЧЕ 1
		                       |		КОНЕЦ) КАК КоэффициентВида,0 как НовыйКлиент
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК ОП
		                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСКВ КАК НачисленияСКВ
		                       |		ПО (НачисленияСКВ.Ссылка = ОП.Ссылка)
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		                       |		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО";
		ТЗ1Доп = ЗапросРасчетВМ.Выполнить().Выгрузить();					   
		Для каждого СтрокаТЗ1Доп Из ТЗ1Доп Цикл
			СтрокаТЗ1 = ТЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ1,СтрокаТЗ1Доп);
		КонецЦикла;
		
		//Партнерские расчеты
		
		ЗапросПартнерскийСКВ = Новый Запрос;
		ЗапросПартнерскийСКВ.Текст = "ВЫБРАТЬ
		                             |	уб_ОплатаПолисовРасчетыПоДокументу.Уточнение КАК Агент,
		                             |	СУММА(0) КАК СуммаВМ,
		                             |	СУММА(ВЫБОР
		                             |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |				ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		                             |			ИНАЧЕ 0
		                             |		КОНЕЦ) КАК ПартнерскоеВознаграждение,
		                             |	1 КАК КоличествоФакт,
		                             |	1 КАК ед,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру)
		                             |		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентОтСебестоимости)
		                             |	КОНЕЦ КАК СхемаРасчетаСМенеджером,
		                             |	0 КАК СКВ,
		                             |	0 КАК КВСуммаДляАгента,
		                             |	0 КАК АВилиСкидкаСумма,
		                             |	0 КАК ВычетСАгента,
		                             |	0 КАК ОплаченоФакт,
		                             |	0 КАК НачисленнаяСуммаВзноса,
									 |	0 КАК СуммаДБ, 0 как КоэффициентВида,0 как НовыйКлиент,
		                             |	СУММА(ВЫБОР
		                             |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП)
		                             |				ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		                             |			ИНАЧЕ 0
		                             |		КОНЕЦ) КАК ВознаграждениеМенеджера,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(Документ.уб_ОплатаПолисов.ПустаяСсылка)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		                             |	КОНЕЦ КАК Ссылка,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СтраховойПолис.Страхователь
		                             |	КОНЕЦ КАК Страхователь,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Дата
		                             |	КОНЕЦ КАК Дата,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА """"
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Номер
		                             |	КОНЕЦ КАК Номер,
		                             |	СУММА(ВЫБОР
		                             |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |				ТОГДА 0
		                             |			ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер
		                             |		КОНЕЦ) КАК ПолнаяПремия
		                             |ИЗ
		                             |	Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                             |ГДЕ
		                             |	(уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ИЛИ уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП))
		                             |	И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                             |	И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                             |	И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		                             |
		                             |СГРУППИРОВАТЬ ПО
		                             |	уб_ОплатаПолисовРасчетыПоДокументу.Уточнение,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру)
		                             |		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентОтСебестоимости)
		                             |	КОНЕЦ,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(Документ.уб_ОплатаПолисов.ПустаяСсылка)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		                             |	КОНЕЦ,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СтраховойПолис.Страхователь
		                             |	КОНЕЦ,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Дата
		                             |	КОНЕЦ,
		                             |	ВЫБОР
		                             |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |			ТОГДА """"
		                             |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Номер
		                             |	КОНЕЦ
		                             |
		                             |ИМЕЮЩИЕ
		                             |	(СУММА(ВЫБОР
		                             |				КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		                             |					ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		                             |				ИНАЧЕ 0
		                             |			КОНЕЦ) <> 0
		                             |		ИЛИ СУММА(ВЫБОР
		                             |				КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП)
		                             |					ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		                             |				ИНАЧЕ 0
		                             |			КОНЕЦ) <> 0)";
								 		ЗапросПартнерскийСКВ.УстановитьПараметр("ДатаНачала",ДатаНачала);
		ЗапросПартнерскийСКВ.УстановитьПараметр("ДатаКонца",ДатаКонца);
		ТЗ1Партнеры = ЗапросПартнерскийСКВ.Выполнить().Выгрузить();					   
		
		Для каждого СтрокаТЗ1Партнеры Из ТЗ1Партнеры Цикл
			СтрокаТЗ1 = ТЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ1,СтрокаТЗ1Партнеры);
			СтрокаТЗ1.Подразделение = АгенскаяСеть;
		КонецЦикла;						 
		
	Иначе		
		///////////////////////////////////////////////////////////////////
		// Запрос на основе данных из регистра уб_ИсторияРеквизит
		///////////////////////////////////////////////////////////////////
		СоотОрганизацийПодразделениям = ПолучитьСоответствиеОрганизацийПодразделениям();
		//Получаем оплаты из истории
		ЗапросПоОплатамИзИстории = Новый Запрос;
		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата1",ДатаНачала);										
		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата2",ДатаКонца);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("ДатаСреза",ДатаСреза);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("ЭтоВариант20191001",ЭтоВариант20191001);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("СотрудникиМастера",ЭтоМастер());
		ЗапросПоОплатамИзИстории.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.НомерВзноса = 1
		|				И (уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		|					ИЛИ уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
		|                   ИЛИ уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека))
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоФакт,
		|	ВЫРАЗИТЬ(уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК Оплата,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.Агент КАК Агент,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.Подразделение.НеОплачиватьКС КАК НеОплачиватьКС,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидС КАК ВидСП,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидБСОПолиса КАК ВидБСОПолиса,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.СтраховойПолис.Страхователь КАК Страхователь,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
		|   уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ЗарплатныйПериод как ЗарплатныйПериод
		|ПОМЕСТИТЬ ОплатыМесяца
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаСреза,
		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|				И РеквизитОбъекта.Наименование = ""ЗарплатныйПериод"") КАК уб_ИсторияРеквизитСрезПоследних
		|ГДЕ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита >= &Дата1
		|	И уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита <= &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыМесяца.Оплата,
		|   Выбор когда &ЭтоВариант20191001 и (ОП.СтраховойПолис.Заявка.Тип = Значение(Перечисление.уб_ТипВыезда.Пролонгация))  Тогда Истина Иначе ЛОжь Конец как ЭтоПролонгация,
		|	ОплатыМесяца.КоличествоФакт,
		|	ВЫБОР
		|		КОГДА ОплатыМесяца.НеОплачиватьКС = ИСТИНА
		|				ИЛИ ОплатыМесяца.Агент В (&СотрудникиМастера)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеОплачиватьКС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ПараметрыБСО.Значение КАК ЧИСЛО(10, 0)), ВЫБОР
		|			КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ВЗР),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.НС))
		|				ТОГДА 0
		|			КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.Произвольный))
		|					И ОплатыМесяца.НачисленнаяСуммаВзноса < 1500
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоэффициентВида,
		|	ВЫБОР Когда ОП.Направление = Значение(Перечисление.Уб_Направления.НовыйКлиент) Тогда 1  Когда ОП.Направление = Значение(Перечисление.Уб_Направления.Пролонгация) Тогда 0 
		//|		КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
		//|			ТОГДА 0
		//|		КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
		//|				И ОплатыМесяца.НачисленнаяСуммаВзноса < 1500
		//|			ТОГДА 0
		|   КОГДА НачалоПериода(ОплатыМесяца.ЗарплатныйПериод,МЕСЯЦ)=ДатыПервыхПолисов.ДатаНачала
		//|		КОГДА РАЗНОСТЬДАТ(ДатыПервыхПолисов.ДатаНачала, &Дата2, Секунда) < 90*3600*24
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НовыйКлиент
		|ИЗ
		|	ОплатыМесяца КАК ОплатыМесяца
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			уб_ПараметрыБСОСрезПоследних.ВидБСО КАК ВидБСО,
		|			уб_ПараметрыБСОСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&Дата2, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних) КАК ПараметрыБСО
		|		ПО (ПараметрыБСО.ВидБСО = ОплатыМесяца.ВидБСОПолиса)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Страховойполис.Страхователь как Страхователь,
		                       //|	МИНИМУМ(полис.ДатаНачала) КАК ДатаНачала
							   |МИНИМУМ(НачалоПериода(полис.ЗарплатныйПериод,МЕСЯЦ)) КАК ДатаНачала
		|		ИЗ
		|			Документ.уб_ОплатаПолисов КАК полис
		                       |ГДЕ ПометкаУдаления = Ложь и 
		                       |	НЕ Страховойполис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
		                       |	И Страховойполис.СтраховаяПремия > 0
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Страховойполис.Страхователь) КАК ДатыПервыхПолисов
		|		ПО (ДатыПервыхПолисов.Страхователь = ОплатыМесяца.Страхователь)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			Документ.уб_ОплатаПолисов КАК Оп
		|		ПО (ОП.Ссылка = ОплатыМесяца.Оплата)
		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОП.Ссылка,
		|    Выбор когда &ЭтоВариант20191001 и (ОП.СтраховойПолис.Заявка.Тип = Значение(Перечисление.уб_ТипВыезда.Пролонгация))  Тогда Истина Иначе ЛОжь Конец как ЭтоПролонгация,
		|	ОП.ВерсияДанных,
		|	ОП.ПометкаУдаления,
		|	ОП.Номер,
		|	ОП.Дата,
		|	ОП.Проведен,
		|	ОП.АВилиСкидкаПроцент,
		|	ОП.АВилиСкидкаСумма,
		|	ОП.Агент,
		|	ОП.Куратор,
		|	ОП.Баланс_Брокер_Поставщик,
		|	ОП.Валюта,
		|	ОП.ВидРасчетаСАгентом,
		|	ОП.ВидСП,
		|	ОП.ВМпоРезультатамПериодаЗП,
		|	ОП.ВознаграждениеМенеджера, 0 как ВознаграждениеДоп,
		|	0 КАК ПартнерскоеВознаграждение,
		|	ОП.ВычетСАгента,
		|	ОП.ДатаМониторинга,
		|	ОП.ДатаПроведенияБСО,
		|	ОП.ДокументВыгрузкиВУП,
		|	ОП.ЕстьКвитанция,
		|	ОП.ЗарплатныйПериод,
		|	ОП.ИсключенаИзВзаиморасчетов,
		|	ОП.ИсключитьИзРасчетаЗП,
		|	ОП.КВПодВопросом,
		|	ОП.КВПроцент,
		|	ОП.КВПроцентДляАгента,
		|	ОП.КВПроцентДляОтчета,
		|	ОП.КВСумма,
		|	ОП.КВСуммаДляАгента,
		|	ОП.КВСуммаДляОтчета,
		|	ОП.КодКВ,
		|	ОП.Комментарий,
		|	ОП.КОплатеАгентом,
		|	ОП.Курс,
		|	ОП.Курьер,
		|	ОП.НачисленнаяСуммаВзноса,
		|	ОП.НачисленнаяСуммаВзносаВВалюте,
		|	ОП.НеВключатьВОтчетыПоставщикам,
		|	ОП.НеМенятьАВ,
		|	ОП.НеМенятьВК,
		|	ОП.НеМенятьКВ,
		|	ОП.НомерВзноса,
		|	ОП.НомерКвитанции,
		|	ОП.НомерРасчетногоСчета,
		|	ОП.ОплаченоФакт,
		|	ОП.ОрганизацияАгент,
		|	ОП.ОтчетАгента,
		|	ОП.ОтчетПоКарточкам,
		|	ОП.ОтчетПоставщику,
		|	ОП.ПересчетКВ,
		|	ОП.ПлатежныйДокумент_Дата,
		|	ОП.ПлатежныйДокумент_Номер,
		|	ОП.Подразделение,
		|	ОП.ПолисАннулирован,
		|	ОП.ПолнаяСтраховаяПремия,
		|	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		|	ОП.Поставщик,
		|	ОП.Проблемная,
		|	ОП.СК,
		|	ОП.СкидкаВыплаченаяКлиенту,
		|	ОП.СтраховойПолис,
		|	ОП.СтраховойПродукт,
		|	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		|	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, ОП.СхемаРасчетаСМенеджером) КАК СхемаРасчетаСМенеджером,
		|	ОП.Счет,
		|	ОП.НаправлениеПлатежа,
		|	ОП.ЭтоКрупнаяСделка,
		|	ОП.ПричинаИсключенияИзОП,
		|	ОП.СписатьСКурьера,
		|	ОП.ОкруглятьКВДо2Знаков,
		|	ОП.ДБ,
		|	ОП.ВМРасчетное,
		|	ОП.ПроверенаЗП,
		|	ОП.РазрядностьОкругления,
		|	ОП.РежимОкругления,
		|	ОП.Автор,
		|	ОП.ДатаСоздания,
		|	ОП.Модификатор,
		|	ОП.ДатаИзменения,
		|	ОП.Подразделение.Владелец КАК Организация,
		|	ВЫБОР
		|		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		|				ИЛИ ОП.Агент В (&СотрудникиМастера)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеОплачиватьКС,
		|	0 КАК СКВ,
		|	0 КАК суммаДб,
		|	ОП.СтраховойПолис.СК КАК СП_СК,
		|	ОП.ВидС КАК СП_ВидСП,
		|	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		|	ОП.СтраховойПолис.Сделка КАК Сделка,
		|	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК Интервалы,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК ИнтервалыРОП,
		|	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		|	0 КАК КоличествоФакт,
		|	1 КАК ЕД,
		|	ОП.ФормаОплаты,
		|	0 КАК КоэффициентВида,0 как НовыйКлиент
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		//|		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ИР.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК ОбъектИстории,
		|	ИР.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	ИР.ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ИсторияРеквизитовВсехОплат
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаСреза,
		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|				И ОбъектИстории В
		|					(ВЫБРАТЬ
		|						Т.Оплата
		|					ИЗ
		|						ОплатыМесяца КАК Т)
		|				И РеквизитОбъекта <> ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК ИР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсторияРеквизитовВсехОплат.ОбъектИстории КАК ОбъектИстории,
		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита,
		|	ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита
		|ИЗ
		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
		|ИТОГИ ПО
		|	ОбъектИстории
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита КАК Документ.уб_СтраховойПолис) КАК СтраховойПолис
		|ПОМЕСТИТЬ ВТ_ВсеСтраховыеПолисы
		|ИЗ
		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
		|ГДЕ
		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита = ""СтраховойПолис""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_СтраховойПолис.Ссылка КАК СтраховойПолис,
		|	уб_СтраховойПолис.Номер,
		|	уб_СтраховойПолис.Дата,
		|	уб_СтраховойПолис.СтраховойПродукт,
		|	уб_СтраховойПолис.Страхователь,
		|	уб_СтраховойПолис.НомерЗаявки,
		|	уб_СтраховойПолис.БонусМенеджеру,
		|	уб_СтраховойПолис.СК,
		|	уб_СтраховойПолис.СтраховаяПремия,
		|	уб_СтраховойПолис.ПометкаУдаления,
		|	уб_СтраховойПолис.Сделка КАК Сделка,
		|	уб_СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		|	Выбор когда ТипЗначения(уб_СтраховойПолис.СтраховойПродукт) = Тип (Справочник.уб_СтраховыеПродукты) Тогда уб_СтраховойПолис.СтраховойПродукт.Вид иначе уб_СтраховойПолис.СтраховойПродукт Конец КАК Вид
		|ИЗ
		|	ВТ_ВсеСтраховыеПолисы КАК ВТ_ВсеСтраховыеПолисы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|		ПО ВТ_ВсеСтраховыеПолисы.СтраховойПолис = уб_СтраховойПолис.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер) КАК СуммаСКВ,
		|	уб_ОплатаПолисовРасчетыПоДокументу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОплатыМесяца КАК ОплатыМесяца
		|		ПО уб_ОплатаПолисовРасчетыПоДокументу.Ссылка = ОплатыМесяца.Оплата
		|ГДЕ
		|	уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		|	И уб_ОплатаПолисовРасчетыПоДокументу.ВремяРегистрации <= &ДатаСреза
		|	И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_ОплатаПолисовРасчетыПоДокументу.Ссылка";
		#Если Клиент Тогда
			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам из истории");
		#КонецЕсли
		Пакет = ЗапросПоОплатамИзИстории.ВыполнитьПакет();		
		//СписокОплатИзИстории = Пакет[1].Выгрузить().ВыгрузитьКолонку("Оплата");
		ВыборкаОплат = Пакет[1].Выбрать();		
		ТЗ1	= Пакет[2].Выгрузить();//ТЗ1 = СоздатьТаблицу();
		ТЗ1.Колонки.Добавить("СКВ_Прол", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_НБ", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП_Прол", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП_НБ", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("ВознаграждениеДоп", ОписаниеТипаЧисло14_2_но);
		
		ТЗ1.Очистить();		
		ВыборкаИсторияРеквизитовОплат = Пакет[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		ВыборкаСтраховыхПолисов = Пакет[6].Выбрать();		
		ВыборкаНачисленияСКВ = Пакет[7].Выбрать();		
		//ВсегоМассив = СписокОплатИзИстории.Количество();
		ВсегоМассив = ВыборкаОплат.Количество();		
		СпПометкаУдаления = Ложь;
		Этап = Этап + 1;
		СчетчикОплат = 0;
		//Для СчетчикОплат = 0 по ВсегоМассив - 1 Цикл
		Пока ВыборкаОплат.Следующий() Цикл
			#Если Клиент Тогда
				Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + ") - Расчет показателей СКВ из истории");
			#КонецЕсли
			//Оплата = СписокОплатИзИстории[СчетчикОплат];
			Оплата = ВыборкаОплат.Оплата;
			СчетчикОплат = СчетчикОплат + 1;
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			/////////////////////////////////////////////////////////////////////////////////////////////
			//!!! Добавить проверку на удаленные оплаты, подменять некоторые реквизиты или менять представление
			/////////////////////////////////////////////////////////////////////////////////////////////
			Стр = ТЗ1.Добавить();
			Стр.Ссылка = Оплата;//.Ссылка
			Стр.ЕД = 1;
			Стр.ЭтоКрупнаяСделка = Ложь;
			Попытка
				Стр.ЭтоПролонгация   = ВыборкаОплат.ЭтоПролонгация;
			Исключение
				Стр.ЭтоПролонгация = Ложь;
			КонецПопытки;	
			Стр.КоличествоФакт = ВыборкаОплат.КоличествоФакт;			
			Стр.НеОплачиватьКС = ВыборкаОплат.НеОплачиватьКС;
			Стр.КоэффициентВида = ВыборкаОплат.КоэффициентВида;
			Стр.НовыйКлиент = ВыборкаОплат.НовыйКлиент;
			Стр.СуммаДБ = 0;
			//СтруктураИзменений = уб_ИсторияИзмененияОбъектов.ПолучитьДанныеОбъектаНаДату(Стр.Ссылка,ДатаСреза);//!!!Сделать: объединить в один пакет			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ОбъектИстории", Оплата);
			СтруктураИзменений = Новый Структура;
			ВыборкаИсторияРеквизитовОплат.Сбросить();
			Если ВыборкаИсторияРеквизитовОплат.НайтиСледующий(СтруктураПоиска) Тогда
				ДетальныеЗаписи = ВыборкаИсторияРеквизитовОплат.Выбрать();
				
				Пока ДетальныеЗаписи.Следующий() Цикл
					СтруктураИзменений.Вставить(ДетальныеЗаписи.НаименованиеРеквизита, ДетальныеЗаписи.ЗначениеРеквизита);
				КонецЦикла;
			КонецЕсли;		
			флПересчитанСКВ = Ложь;
			Для Каждого ЭлементСтруктуры из СтруктураИзменений Цикл
				КлючЭл = ЭлементСтруктуры.Ключ;
				ЗначениеЭл = ЭлементСтруктуры.Значение;
				
				Попытка
					Стр[КлючЭл]= ЗначениеЭл;
				Исключение
					Сообщить("Ошибка заполнения строки из истории (" + Оплата + " / " + КлючЭл + ")");
					продолжить;
				КонецПопытки;
				Если КлючЭл = "СтраховойПолис" Тогда
					Если ЗначениеЗаполнено (ЗначениеЭл) Тогда
						
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("СтраховойПолис", ЗначениеЭл);
						
						ВыборкаСтраховыхПолисов.Сбросить();
						
						Если ВыборкаСтраховыхПолисов.НайтиСледующий(СтруктураПоиска) Тогда
							ЗначениеЭл = ВыборкаСтраховыхПолисов;
							Стр.СП_СтраховойПродукт = ЗначениеЭл.СтраховойПродукт;
							Если ТипЗнч(ЗначениеЭл.СтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
								Стр.СП_ВидСП = ЗначениеЭл.Вид;
							Иначе
								Стр.СП_ВидСП = ЗначениеЭл.СтраховойПродукт;
							КонецЕсли;	
							Стр.СП_СК = ЗначениеЭл.СК;//Не используется и тормозит
							Стр.Страхователь = ЗначениеЭл.Страхователь;
							Стр.ДатаПолиса = ЗначениеЭл.Дата;
							Стр.НомерПолиса = ЗначениеЭл.Номер;
							Стр.НомерЗаявки = ЗначениеЭл.НомерЗаявки;
							Стр.БонусМенеджеру = ЗначениеЭл.БонусМенеджеру;
							Стр.ПолнаяПремия = ЗначениеЭл.СтраховаяПремия;
							//Если ЭтоВариант20121001 Тогда
							Стр.Сделка = ЗначениеЭл.Сделка;
							Стр.ДатаСделки = ЗначениеЭл.ДатаСделки;
							Стр.БонусПроцент = ЗначениеЭл.БонусПроцент;
							Стр.БонусПроцентРОП = ЗначениеЭл.БонусПроцентРОП;
							//КонецЕсли;	
							
							СпПометкаУдаления = ЗначениеЭл.ПометкаУдаления;
						Конецесли;
					КонецЕсли;	
				ИначеЕсли КлючЭл ="Подразделение" Тогда	
					Стр.Организация = СоотОрганизацийПодразделениям.Получить(ЗначениеЭл);
				ИначеЕсли КлючЭл ="ОплаченоФакт" 
					Или КлючЭл ="НачисленнаяСуммаВзноса" 
					Или КлючЭл ="СкидкаВыплаченаяКлиенту" 
					Или КлючЭл ="ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику" 
					Или КлючЭл ="КВСумма" Тогда		
					
					Если флПересчитанСКВ Тогда
						Продолжить;
					КонецЕсли;  
					Если ЭтоВариант20151001 Тогда
						ВыборкаНачисленияСКВ.Сбросить();
						Если ВыборкаНачисленияСКВ.НайтиСледующий(Новый Структура("Ссылка",Оплата)) Тогда
							Стр.СКВ = ВыборкаНачисленияСКВ.СуммаСКВ;
							флПересчитанСКВ = Истина;
							Продолжить;
						Иначе
							//не найден посчитанный СКВ, посчитаем по старому	
						КонецЕсли;	
					Иначе
						
					КонецЕсли;
					
						
					Если СтруктураИзменений.Свойство("ОплаченоФакт") Тогда
						ОплаченоФакт = СтруктураИзменений.ОплаченоФакт;
						Стр.ОплаченоФакт = ОплаченоФакт;
					Иначе
						ОплаченоФакт = Стр.ОплаченоФакт;
					КонецЕсли;	  
					
					Если СтруктураИзменений.Свойство("НачисленнаяСуммаВзноса") Тогда
						НачисленнаяСуммаВзноса = СтруктураИзменений.НачисленнаяСуммаВзноса;
						Стр.НачисленнаяСуммаВзноса = НачисленнаяСуммаВзноса;
					Иначе
						НачисленнаяСуммаВзноса = Стр.НачисленнаяСуммаВзноса;
					КонецЕсли;
					Если СтруктураИзменений.Свойство("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику") Тогда
						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = СтруктураИзменений.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
						Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
					Иначе
						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
					КонецЕсли;
					
					Если СтруктураИзменений.Свойство("СкидкаВыплаченаяКлиенту") Тогда
						СкидкаВыплаченаяКлиенту = СтруктураИзменений.СкидкаВыплаченаяКлиенту;
						Стр.СкидкаВыплаченаяКлиенту = СкидкаВыплаченаяКлиенту;
					Иначе
						СкидкаВыплаченаяКлиенту = Стр.СкидкаВыплаченаяКлиенту;
					КонецЕсли;
					Если ЭтоВариант20130301 ИЛИ ДатаСреза > Дата(2013,10,7) Тогда
						Если СтруктураИзменений.Свойство("КВСуммаДляАгента") Тогда
							Попытка
								КВСумма = Число(СтруктураИзменений.КВСуммаДляАгента);
							Исключение
								КВСумма = 0;
							КонецПопытки;
							Стр.КВСумма = КВСумма;
							Стр.КВСуммаДляАгента = КВСумма;
						Иначе
							КВСумма = Стр.КВСуммаДляАгента;
						КонецЕсли;
					Иначе	
						Если СтруктураИзменений.Свойство("КВСумма") Тогда
							КВСумма = СтруктураИзменений.КВСумма;
							Стр.КВСумма = КВСумма;
							Стр.КВСуммаДляАгента = КВСумма;
						Иначе
							КВСумма = Стр.КВСумма;
						КонецЕсли;
					КонецЕсли;
					Если (ОплаченоФакт - СкидкаВыплаченаяКлиенту ) < ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса)-КВСумма ТОГДА  
						СКВ = 0;
					Иначе	  
						СКВ = ОплаченоФакт - ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса) - СкидкаВыплаченаяКлиенту + КВСумма;
					КонецЕсли; 
					Стр.СКВ = СКВ;
					флПересчитанСКВ = Истина;
				КонецЕсли;	
			КонецЦикла;	
			
			СтраховойПолис = Стр.СтраховойПолис;
			/////////////////////////////////////////////////////////////////////////////////////////////
			//!!! Добавить проверку на получение полиса из истории?
			/////////////////////////////////////////////////////////////////////////////////////////////
			//Если ФильтрПоМенеджеру И Стр.Агент<>Менеджер Тогда
			////	//
			//	ТЗ1.Удалить(Стр);
			//Иначе
			Если ФильтрПоПодразделению И Стр.Подразделение <> Подразделение Тогда
				////	//
				ТЗ1.Удалить(Стр);
			ИначеЕсли (НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП) И Стр.ИсключитьИзРасчетаЗП Тогда
				ТЗ1.Удалить(Стр);
			ИначеЕсли  СтраховойПолис = ПустойПолис Тогда
				ТЗ1.Удалить(Стр);
			ИначеЕсли  СпПометкаУдаления  Тогда
				//ТЗ1.Удалить(Стр); //Не удалять, т.к. нет истории этого флага 
			ИначеЕсли  Стр.ПометкаУдаления  Тогда
				ТЗ1.Удалить(Стр);
			//ИначеЕсли  Стр.НомерЗаявки = кЛичнаяЗаявка Тогда
			ИначеЕсли  Стр.СхемаРасчетаСМенеджером = СхемаПоАВ Тогда
				ТЗ1.Удалить(Стр);	
			ИначеЕсли ФильтрПоСП И Стр.СП_ВидСП <> ВидСП Тогда	
				ТЗ1.Удалить(Стр);	
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	ТЗ1.Колонки.Добавить("ИнфоКВМ", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0)));
	ТЗ1.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Число"));
	Если СоотвИнфоКВМ.Количество() > 0 Тогда
		Для Каждого Стр ИЗ ТЗ1 Цикл
			ИнфоКВМ = СоотвИнфоКВМ.Получить(Стр.Номер);
			Если ИнфоКВМ <> Неопределено Тогда
				Стр.ИнфоКВМ	= ИнфоКВМ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Создаем список Агентов, по которым есть оплаты 
	//ТЗАгентов = ТЗ1.Скопировать(,"Агент");
	//ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера");
	
	//	Если ФильтрПоменеджеру Тогда
	//СтрокаМенеджера = ТЗАгентов.Добавить();
	//СтрокаМенеджера.Агент = Менеджер;
	//СтрокаМенеджера.ВознаграждениеМенеджера  = 0;
	//	КонецЕсли;	
	//Анализ страхователей
	ТЗ1.Колонки.Добавить("НовыйКлиентСКВ",Новый ОписаниеТипов("Число"));
	ТЗ1.Колонки.Добавить("НовыйКлиентУник",Новый ОписаниеТипов("Число"));
	ПосчитатьСтрахователей(ТЗ1);
	Если ВРеальномВремени Тогда
		ТЗ1_ГодНазад = ТЗ1_ГодНазад.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));
		ТЗ1_ГодНазад.Колонки.Добавить("НовыйКлиентСКВ",Новый ОписаниеТипов("Число"));
		ТЗ1_ГодНазад.Колонки.Добавить("НовыйКлиентУник",Новый ОписаниеТипов("Число"));
		ПосчитатьСтрахователей(ТЗ1_ГодНазад);
	Иначе
		ТЗ1_ГодНазад = ТЗ1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));
	КонецЕсли;	
	
	ТЗ1_ГодНазад.Свернуть("Агент","КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,СКВ");
	
	
	
	//
	//
	ТЗАгентов = ТЗ1.Скопировать(,"Агент,ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,ВычетСАгента,СуммаДБ");
	ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,ВычетСАгента,СуммаДБ");
	ТЗАгентов.Колонки.Добавить("Подразделение", ОписаниеТипа_Подразделение);
	
	ТЗАгентов.Колонки.Добавить("ЕстьОплатыПоАгенту",ОписаниеТипаБулево);
	ТЗАгентов.ЗаполнитьЗначения(Истина, "ЕстьОплатыПоАгенту");
	
	//Подготавливаем ТЗАгентов для обновления подразделений по агентам 
	
	
	//Обновляем подразделения в списке Агентов
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		
		//Сначала пытаемся получить подразделение на конец месяца в режиме возврата пустого подразделения, если не найдено
		Уволен = Ложь;
		НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, КонецМесяца(ЗарплатныйПериод), Истина, Уволен);
		Если НовПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
			НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, НачалоМесяца(ЗарплатныйПериод), Истина, Уволен);
			
			Если НовПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
				НовПодразделение = АгенскаяСеть;
			КонецЕсли;
		
		КонецЕсли;
		//Если Уволен Тогда
		//	Стр.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		//Иначе	
		Стр.Подразделение = НовПодразделение;
		//КонецЕсли;	
		
	КонецЦикла;
	//Получаем список подразделений, в которых были оплаты
	тзПодразделенийСОплатами = ТЗАгентов.Скопировать(,"Подразделение");
	тзПодразделенийСОплатами.Свернуть("Подразделение");
	
	//Получаем список ВСЕХ подразделений, которые могут продавать
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	П.Ссылка,
	               |	П.Наименование
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК П
	               |ГДЕ
	               |	П.ТипПодразделения В(&ТипыПодразделения)";
	
	ТипыПодразделения = Новый СписокЗначений;
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ГоловнойОфис);
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ТочкаПродаж);
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВС);
	
	Запрос.УстановитьПараметр("ТипыПодразделения", ТипыПодразделения);
	
	Если ФильтрПоПодразделению Тогда
		Запрос.Текст = Запрос.Текст + " И П.Ссылка = &Подразделение ";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе	
		//	Если ФильтрПоМенеджеру Тогда
		СпЗн = Новый СписокЗначений;
		Для каждого Стр Из ТЗАгентов Цикл
			СпЗн.Добавить(Стр.Подразделение);
		КонецЦикла; 
		Запрос.Текст = Запрос.Текст + " И П.Ссылка В (&Подразделение) ";
		Запрос.УстановитьПараметр("Подразделение", СпЗн);
		//	КонецЕсли;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	тзПодразделений = Новый ТаблицаЗначений;
	Кол = тзПодразделений.Колонки;
	Кол.Добавить("Подразделение",							ОписаниеТипа_Подразделение);
	Кол.Добавить("НаименованиеПодразделения",				ОписаниеТипаСтрока);
	Кол.Добавить("Руководитель",							ОписаниеТипа_ФизЛицо);
	Кол.Добавить("РуководительПолучаетВознаграждение",		ОписаниеТипаБулево);
	Кол.Добавить("ЗамПолучаетВознаграждение",		ОписаниеТипаБулево);
	Кол.Добавить("СхемаВознагражденияРуководителяОП",		ОписаниеТипаСхемВознРукОП);
	Кол.Добавить("ПроцентнаяСтавкаДоМинимальногоПорога_РОП",ОписаниеТипаПроцент);
	Кол.Добавить("ПоказательМинимальногоПорога_РОП",		ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентнаяСтавкаДоПлана_РОП",				ОписаниеТипаПроцент);
	Кол.Добавить("ПоказательПлана_РОП",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентнаяСтавкаПослеПлана_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("ЕстьОплатыПоПодразделению",				ОписаниеТипаБулево);
	Кол.Добавить("ПроцентКС_РОП",          				    ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаДБ",          				    ОписаниеТипаЧисло14_2_но);
	
	
	
	СписокПодразделенийДляВыборки = Новый СписокЗначений;
	ПрчСхемаВР = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП; 
	Пока Выборка.Следующий() Цикл
		бНетОплатПоПодразделению = (тзПодразделенийСОплатами.Найти(Выборка.Ссылка) = Неопределено) И НЕ ФильтрПоМенеджеру; 
		
		МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Выборка.Ссылка);
		Руководитель = МЗ.Сотрудник;
		МЗ2 = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Выборка.Ссылка,Истина);
		Если МЗ2.Сотрудник.Пустая() ИЛИ МЗ2.Уход Тогда
			Зам = Справочники.ФизическиеЛица.ПустаяСсылка();
			ЗамПолучаетВознаграждение = Ложь;
		Иначе
			Зам = МЗ2.Сотрудник;
			ЗамПолучаетВознаграждение = МЗ2.ПолучаетВознаграждениеЗаРуководство;
		КонецЕсли;	
		//Если не указан руководитель подразделения на данный период
		//Или он не получает вознаграждения
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если (Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() ИЛИ НЕ МЗ.ПолучаетВознаграждениеЗаРуководство)
			И бНетОплатПоПодразделению Тогда
			Продолжить;
		КонецЕсли;
		
		//Далее ищем схему вознаграждения руководителя подразделения
		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСРуководителемОП(НачалоДня(КонецМесяца(ЗарплатныйПериод)),,Выборка.Ссылка);
		
		//Также, если НЕ найдена схема вознаграждения руководителя подразделения 
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если тз.Количество() = 0 И бНетОплатПоПодразделению Тогда
			Продолжить;
		КонецЕсли;
		
		//Также, если найдена схема вознаграждения руководителя подразделения "БезВознаграждения" 
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если тз.Количество() > 0 И бНетОплатПоПодразделению Тогда
			Если тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		//Добавляем подразделение в список 
		НовСтрока = тзПодразделений.Добавить();	
		НовСтрока.Подразделение				= Выборка.Ссылка;
		НовСтрока.НаименованиеПодразделения	= Выборка.Наименование + ?(ЗначениеНеЗаполнено(Руководитель),""," (" + Руководитель.Наименование + ")");
		НовСтрока.Руководитель				= Руководитель;
		НовСтрока.РуководительПолучаетВознаграждение = МЗ.ПолучаетВознаграждениеЗаРуководство;
		НовСтрока.ЗамПолучаетВознаграждение = ЗамПолучаетВознаграждение;
		Если тз.Количество() = 0 ИЛИ тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
			НовСтрока.СхемаВознагражденияРуководителяОП			= ПрчСхемаВР.БезВознаграждения;
			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= 0;
			НовСтрока.ПоказательМинимальногоПорога_РОП			= 0;
			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= 0;
			НовСтрока.ПоказательПлана_РОП						= 0;
			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= 0;
			НовСтрока.ПроцентКС_РОП  = 0 ;
		Иначе	
			Схема = тз[0];
			НовСтрока.СхемаВознагражденияРуководителяОП			= Схема.СхемаВознагражденияРуководителяОП;
			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= Схема.ПроцентнаяСтавкаДоМинимальногоПорога;
			НовСтрока.ПоказательМинимальногоПорога_РОП			= Схема.ПоказательМинимальногоПорога;
			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= Схема.ПроцентнаяСтавкаДоПлана;
			НовСтрока.ПоказательПлана_РОП						= Схема.ПоказательПлана;
			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= Схема.ПроцентнаяСтавкаПослеПлана;			
			НовСтрока.ПроцентКС_РОП                             = Схема.ПроцентКС_РОП;
			//Добавляем подразделение в список для последующей выборки агентов, работающих по схеме ПланПоСКВ
			//Только для случая, когда руководитель получает процент от СКВ необходимо будет собрать в писок
			//всех агентов подразделения, что бы посчитать суммарный план подразделения			
			//В остальных случаях в список агентов подразделения (в отчете) попадут только те агенты, у которых есть оплаты		
			//Так же исключаем случай, когда отчет фильтруется по конкретному менеджеру
			Если //НЕ ФильтрПоМенеджеру И 
				Схема.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ Тогда
				СписокПодразделенийДляВыборки.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;                                                         
		НовСтрока.ЕстьОплатыПоПодразделению = НЕ бНетОплатПоПодразделению;
	КонецЦикла;
	//##добавляем подразделения, где были оплаты в тзПодразделений
	Для каждого Стр Из тзПодразделенийСОплатами Цикл		
		Если тзПодразделений.Найти(Стр.Подразделение,"Подразделение")=Неопределено Тогда
			НовСтрока = тзПодразделений.Добавить();	
			НовСтрока.Подразделение	= Стр.Подразделение;
		КонецЕсли;			
	КонецЦикла; 	
	//Формируем список всех агентов, которые в течение зарплатного периода присутствовали в выбранных подразделениях
	//Если будут найдены агенты, которые не попали в главную выборку оплат (по пичине отсутствия у них оплат в этом периоде)
	//то эти агенты будут добавлены в список	
	//Запрос на получение списка сотрудников, работающих в подразделении в период отчета
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	А.Агент,
	|	А.Подразделение,
	|	А.Период,
	|	А.Организация
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаНач, ) КАК А
	|ГДЕ
	|	А.Подразделение В(&Подразделения)
	|	И (НЕ А.Выбытие)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	А.Агент,
	|	А.Подразделение,
	|	А.Период,
	|	А.Организация
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
	|ГДЕ
	|	А.Подразделение В(&Подразделения)
	|	И (НЕ А.Выбытие)
	|	И А.Период МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонца);	
	Запрос.УстановитьПараметр("Подразделения", СписокПодразделенийДляВыборки);	
	ВыборкаАгентов = Запрос.Выполнить().Выбрать();
	
	//Подготавливаем ТЗАгентов для сравнения дублирующихся записей
	//Возможны случаи, когда агент переходил из подразделения в подразделение в течение месяца
	//Тогда подразделением Агента считается подразделение, в котором он числился позже всего
	
	//Не рассматриваем работу агента в разных подразделениях в течении месяца 
	//По причине того, что придется пропорционально времени работы в подразделениях делить план (в случае работы по схеме план)
	//Учет ведем по последнему подразделению, в котором работал сотрудник в отчетном периоде (даже если он работал всего один последний день)
	
	ТЗАгентов.Колонки.Добавить("ДатаПоступленияВПодразделение",ОписаниеТипаДата);
	
	Пока ВыборкаАгентов.Следующий() Цикл
		НайденныйАгент	= ТЗАгентов.НайтиСтроки(Новый Структура("Агент",ВыборкаАгентов.Агент)); 
		Если НайденныйАгент.Количество()=0 Тогда
			//Добавляем нового агента
			НовАгент								= ТЗАгентов.Добавить();
			НовАгент.Агент							= ВыборкаАгентов.Агент;
			НовАгент.Подразделение					= ВыборкаАгентов.Подразделение.Ссылка;
			НовАгент.ДатаПоступленияВПодразделение	= ВыборкаАгентов.Период;
			НовАгент.ВознаграждениеМенеджера 		= 0;
			НовАгент.ВознаграждениеДоп = 0;
			НовАгент.ПартнерскоеВознаграждение      = 0;
			НовАгент.ВычетСАгента					= 0;
		Иначе
			НайденныйАгент = НайденныйАгент[0];
			Если НайденныйАгент.Подразделение <> ВыборкаАгентов.Подразделение 
				И НайденныйАгент.ДатаПоступленияВПодразделение < ВыборкаАгентов.Период Тогда
				НайденныйАгент.Подразделение = ВыборкаАгентов.Подразделение.Ссылка;
				НайденныйАгент.ДатаПоступленияВПодразделение = ВыборкаАгентов.Период;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Теперь выберем всех агентов, у которых встречаются оплаты по схеме "ПланПоСКВ"
	СтруктураОтбора				= Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	ТЗАгентовПоСхемеПланПоСКВ	= ТЗ1.Скопировать(СтруктураОтбора, "Агент,СхемаРасчетаСМенеджером");
	ТЗАгентовПоСхемеПланПоСКВ.Свернуть("Агент,СхемаРасчетаСМенеджером");
	//Для таких агентов заполним параметры Плана и СуперПлана
	Кол = ТЗАгентов.Колонки;
	Кол.Добавить("План",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ШтрафнойПлан",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("Количество",						ОписаниеТипаЧисло12_0);
	Кол.Добавить("СуперПлан",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПерваяБонусПланка",				ОписаниеТипаЧисло14_2_но);//2012
	Кол.Добавить("ПроцентнаяСтавкаДоПлана",			ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПослеПлана",		ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПослеПервойБонусПланки",	ОписаниеТипаПроцент);//201212
	Кол.Добавить("ПроцентнаяСтавкаПослеСуперПлана",	        ОписаниеТипаПроцент);
	
	Кол.Добавить("ПроцентнаяСтавкаПролонгация",			ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПролонгацияДоПлана",		ОписаниеТипаПроцент);
	
	
	Кол.Добавить("ЕстьПланПоСКВ",					ОписаниеТипаБулево);
	Кол.Добавить("ЭтотАгентЕстьВТЗ1",				ОписаниеТипаБулево);
	Кол.Добавить("УАгентаПланПоСКВ",				ОписаниеТипаБулево);
	Кол.Добавить("ВыполненПланПоСКВ",				ОписаниеТипаБулево);
	//Итоги СКВ по КС
	Кол.Добавить("СКВ_КС",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_Прол",							ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_КС",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("ВыполненПланПоСКВ", ОписаниеТипаБулево);
	тзАгентов.Сортировать("Агент,ДатаПоступленияВПодразделение УБЫВ");
	ТЗАгентов.Индексы.Добавить("Агент");

	//Пробегаем по агентам 
	//И для тех, кто входит в подразделение, с расчетом вознаграждения рауководителя по схеме ПроцентОтСКВ
	//А так же для тех агентов, у кого есть оплаты по схеме "ПланПоСКВ"
	//- заполним параметры Плана и СуперПлана
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		НайденноеПодразделение	=	тзПодразделений.Найти(Стр.Подразделение);
		бСхемаРОП_ПроцентОтСКВ	=	(НайденноеПодразделение <> Неопределено) 
								И НайденноеПодразделение.РуководительПолучаетВознаграждение = Истина 
								и (НайденноеПодразделение.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ);
		бЕстьОплатаПоПлануПоСКВ	=	ТЗАгентовПоСхемеПланПоСКВ.Найти(Стр.Агент) <> Неопределено;
		
		Если бСхемаРОП_ПроцентОтСКВ ИЛИ бЕстьОплатаПоПлануПоСКВ Тогда
			
			ШтрафнойПлан = ПолучитьШтрафнойПлан(Стр.Агент,НачалоДня(КонецМесяца(ЗарплатныйПериод)));
			
			тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
			Если тз.Количество() > 0 Тогда
				Стр.План = тз[0].План+ШтрафнойПлан;
				Стр.ШтрафнойПлан = ШтрафнойПлан;
				Если Стр.План = 0 Тогда
					Стр.Количество = 0;
				Иначе
					Стр.Количество = тз[0].Количество;
				КонецЕсли;
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			
			тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.СуперПлан<>0");
			Если тз.Количество() > 0 Тогда
				Стр.СуперПлан = тз[0].СуперПлан+?(ЭтоВариант20150601=Истина и не ЭтоВариант20200801,ШтрафнойПлан,0);
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдено значение Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			
			Если ЭтоВариант20121201 Тогда
				тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.ПерваяБонусПланка<>0");
				Если тз.Количество() > 0 Тогда
					Стр.ПерваяБонусПланка = тз[0].ПерваяБонусПланка+?(ЭтоВариант20150601=Истина и не ЭтоВариант20200801,ШтрафнойПлан,0);//201212	Стр.СуперПлан = тз[0].СуперПлан;
				Иначе
					Сообщить("ВНИМАНИЕ! Не найдено значение min Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
				КонецЕсли;
			КонецЕсли;
			
			тз = уб_СтраховойБрокер.ПолучитьПроцентныеСтавкиПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
			
			//
			
			//
			Если тз.Количество() > 0 Тогда
				ЕСли ЗарплатныйПериод<Дата(2017,1,1) и ПараметрыСеанса.уб_Константы.ЭтоМастер = Истина и Мастер70=Ложь Тогда
					Стр.ПроцентнаяСтавкаДоПлана			        = 35;
					Стр.ПроцентнаяСтавкаПослеПлана		        = 40;
					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки  = 40;//201212
					Стр.ПроцентнаяСтавкаПослеСуперПлана         = 40;
					
					Стр.ПроцентнаяСтавкаПролонгация = 40;
					Стр.ПроцентнаяСтавкаПролонгацияДоПлана = 35;
				Иначе
					Стр.ПроцентнаяСтавкаДоПлана			 = тз[0].ПроцентнаяСтавкаДоПлана;
					Стр.ПроцентнаяСтавкаПослеПлана		 = тз[0].ПроцентнаяСтавкаПослеПлана;
					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = тз[0].ПроцентнаяСтавкаОтПервойБонусПланки;//201212
					Стр.ПроцентнаяСтавкаПослеСуперПлана  = тз[0].ПроцентнаяСтавкаПослеСуперПлана;
					
					ЭтоСтажер = ЭтоСтажер(Стр.Агент);
					Стр.ПроцентнаяСтавкаПролонгация       = Макс(Стр.ПроцентнаяСтавкаПослеПлана-?(ЭтоСтажер,0,10),0);
					Стр.ПроцентнаяСтавкаПролонгацияДоПлана = Макс(Стр.ПроцентнаяСтавкаДоПлана  -?(ЭтоСтажер,0,10),0);
				КонецЕсли;	
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдена информация по ставкам ПланаПоСКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			Стр.ЕстьПланПоСКВ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	//Теперь В ТЗАгентов Есть все данные для получения общего плана подразделения, работающего по схеме ПланПоСКВ	
	
	//В таблице ТЗ1 есть сведения об СКВ
	//Произведем корректировку значения подразделений для выборки оплат, находящейся в ТЗ1
	ТЗ1.Колонки.Добавить("ЕстьПланПоСКВ",		ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("УАгентаПланПоСКВ",	ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("Пустышка", ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("СКВ_КС", ОписаниеТипаЧисло14_2_но);
	
	ТЗ1.Колонки.Добавить("БОНУС_КС", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("БОНУС_РОП_КС", ОписаниеТипаЧисло14_2_но);
	
//	ТЗ1.Колонки.Добавить("СКВ_Прол", ОписаниеТипаЧисло14_2_но);
	
	СтрокаТЗАгентов = Неопределено;
	Для Каждого Стр ИЗ ТЗ1 Цикл
		Если (СтрокаТЗАгентов = Неопределено) ИЛИ (Стр.Агент<>СтрокаТЗАгентов.Агент) Тогда
			СтрокаТЗАгентов = ТЗАгентов.Найти(Стр.Агент);
		КонецЕсли;
		Если СтрокаТЗАгентов <> Неопределено Тогда
			
			Стр.Подразделение = СтрокаТЗАгентов.Подразделение;
			Стр.ЕстьПланПоСКВ = СтрокаТЗАгентов.ЕстьПланПоСКВ;
			СтрокаТЗАгентов.ЭтотАгентЕстьВТЗ1 = Истина;
		Иначе
			Сообщить("Ошибка: не найден агент из оплаты " + Строка(Стр.Агент) + " в промежуточной таблице агентов");
			продолжить;
		КонецЕсли;
		Если Стр.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
			СтрокаТЗАгентов.УАгентаПланПоСКВ = Истина;
			Стр.УАгентаПланПоСКВ = Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	//+++++++++++ТЕСТЫ++++++++++++
	//ТЗ1.Скопировать(Новый Структура("Агент",Справочники.ФизическиеЛица.НайтиПонаименованию("Митенков"))).Итог("СКВ")
	//+++++++++++ТЕСТЫ++++++++++++
	
	//Добавляем в ТЗ1 пустые строки для Агентов, у которых не было оплат
	
	//ТЗ1.Колонки.Добавить("ВК", ОписаниеТипаЧисло14_2_но);
	
	//ЗапросВК  = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер как Менеджер,
	//						 |	СУММА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера) КАК ОплатитьВКассуЗаВыездКурьера
	//						 |ИЗ
	//						 |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	//						 |ГДЕ
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен
	//						 |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.isConfirmed
	//						 |	И КонецПериода(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,МЕСЯЦ) = &ДатаКонца
	//						 |
	//						 |СГРУППИРОВАТЬ ПО
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер");
	//ЗапросВК.УстановитьПараметр("ДатаКонца",ДатаКонца);						 
	//ВыборкаВК = ЗапросВК.Выполнить().Выбрать();						 
	
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		
		//Добавляем пустышку для вознаграждения курьера
		//ВыборкаВК.Сбросить();
		//СтруктураПоиска = Новый Структура("Менеджер",Стр.Агент);
		//Если ВыборкаВК.НайтиСледующий(СтруктураПоиска) Тогда
		//	НовОплата					= ТЗ1.Добавить();
		//	НовОплата.Агент 			= Стр.Агент;		
		//	НовОплата.Подразделение		= Стр.Подразделение;
		//	НовОплата.Организация 		= Стр.Подразделение.Владелец;
		//	НовОплата.Пустышка			= Истина;
		//	НовОплата.УАгентаПланПоСКВ	= Истина;
		//	Стр.УАгентаПланПоСКВ		= Истина;
		//	тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(ЗарплатныйПериод, , Стр.Подразделение, Стр.Агент);
		//	//НовОплата.ВК =   ВыборкаВК.ОплатитьВКассуЗаВыездКурьера;
		//КонецЕсли;	
		
		//Если НЕ Стр.ЭтотАгентЕстьВТЗ1 Тогда
			 ДобавитьПустышку(тз1,Стр);
		//КонецЕсли;
	КонецЦикла;
	
	//Собираем доходы брокера
	
	//ЗапросДБ =  Новый Запрос;
	//ЗапросДБ.Текст = "";
	
	////////////////////////////////////////////////////////
	//ЭТАП №2. ОБРАБОТКА ПОЛУЧЕННЫХ ДАННЫХ
	////////////////////////////////////////////////////////
	
	Если НЕ ЭтоВариант20150801 Тогда
		СтруктураОтбора 	= Новый Структура("УАгентаПланПоСКВ", Истина);
		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
	Иначе
		//Сверху определена Структура отбора по Схеме, а не по виду 	
		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
	КонецЕсли;
	
	СтруктураОтбора2	= Новый Структура("УАгентаПланПоСКВ", Ложь);  //!!!
	
	СписокПодразделенийИзТЗ1 = ТЗ1.Скопировать(, "Подразделение");	
	СписокПодразделенийИзТЗ1.Свернуть("Подразделение");
	
	ТЗАгентов.Колонки.Добавить("БОНУС_РОП_КС",	ОписаниеТипаЧисло14_2_но);
	Если ЭтоВариант20121001 Тогда
		//
		//Проверка заданных справочником крупных сделок на Порог КС 
		ТЗ1.Индексы.Добавить("ЭтоКрупнаяСделка");
		
		ТЗКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));	
		ТЗКрупныхСделок.Свернуть("Сделка","КВСуммаДляАгента,СКВ");
		//
		Для каждого СтрокаКС из  ТЗКрупныхСделок Цикл
			Сделка = СтрокаКС.Сделка;
			Если Сделка = Справочники.уб_Сделки.ПустаяСсылка() Тогда
				Сообщить("Ошибочно установленный флаг большой сделки у оплаты");
				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
					Сообщить("Оплата "+СтрокаКСТекущейСделки.Номер);
				КонецЦикла;	 
			КонецЕсли;	
			Если СтрокаКС.КВСуммаДляАгента<РазмерКС И уб_РасчетыСМенеджерами.ПолучитьПолноеКВСделки(Сделка)<РазмерКС Тогда
				//Сделка не достигла размера крупной сделки(КС) убираем признак КС
				Если ЗарплатныйПериод<Дата(2016,7,1) Тогда
					//Справочник главнее
					СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
					Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
						СтрокаКСТекущейСделки.ЭтоКрупнаяСделка = Ложь;
					КонецЦикла;	
				КонецЕсли;
			Иначе
				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
					Если ЭтоВариант20150901 и ЭтоВариант20171001 = Ложь Тогда
						СтрокаКСТекущейСделки.БОНУС_РОП_КС = 0;	
					Иначе
						СтрокаКСТекущейСделки.БОНУС_РОП_КС = СтрокаКСТекущейСделки.СКВ * (СтрокаКСТекущейСделки.БонусПроцентРОП)/100;	
					КонецЕсли;
					
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;
		//Автоматическое определение КС
		ТЗПотенцКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером",Ложь,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ),"Страхователь,КВСуммаДляАгента,СКВ,Дата");	
		КопияПотенцКС =  ТЗПотенцКрупныхСделок.Скопировать();//,"Страхователь,КВСуммаДляАгента,СКВ,Дата");
		ТЗПотенцКрупныхСделок.Свернуть("Страхователь","КВСуммаДляАгента,СКВ");
		
		Для каждого СтрокаКС из  ТЗПотенцКрупныхСделок Цикл
			Если СтрокаКС.КВСуммаДляАгента>=РазмерКС Тогда
				//Дополняем явные крупные сделки автоопределенными 
				СтрокиПоСтрахователю = ТЗ1.НайтиСтроки(Новый Структура("ЭтоКрупнаяСделка,Страхователь",Ложь,СтрокаКС.Страхователь));
				//Обпределим дату сделки
				ТаблицаПоСтрахователю = КопияПотенцКС.Скопировать(Новый Структура ("Страхователь",СтрокаКС.Страхователь),"");
				ТаблицаПоСтрахователю.Сортировать("Дата УБЫВ");
				
				Сделка = Справочники.уб_Сделки.ПолучитьСсылку(); //сгенерируем ссылку для сделки
				
				Для каждого СтрокаКССтрахователя из СтрокиПоСтрахователю Цикл
					Если НЕ СтрокаКССтрахователя.НеОплачиватьКС = Истина Тогда
						//Для подразделения может быть укзана настройка, чтобы не оплатить КС
						СтрокаКССтрахователя.Сделка = Сделка;
						СтрокаКССтрахователя.ЭтоКрупнаяСделка = Истина;
						СтрокаКССтрахователя.ДатаСделки      = ТаблицаПоСтрахователю[0].Дата;
						Если СтрокаКССтрахователя.ЭтоПролонгация Тогда
							СтрокаКССтрахователя.БонусПроцент = 5-10;
							СтрокаКССтрахователя.ЭтоПролонгация = Ложь;
							СтрокаКССтрахователя.СКВ_Прол = 0;
						Иначе	
							СтрокаКССтрахователя.БонусПроцент    = 5;
						КонецЕсли;	
							
						
						мСтрок = тзПодразделений.НайтиСтроки(Новый Структура("Подразделение",СтрокаКССтрахователя.Подразделение));
						Если мСтрок.Количество() = 0  Тогда
							СтрокаКССтрахователя.БонусПроцентРОП = 5;
						Иначе
							СтрокаКССтрахователя.БонусПроцентРОП = Число(мСтрок[0].ПроцентКС_РОП);
						КонецЕсли;	
						Если ЭтоВариант20150901 и ЭтоВариант20171001 = Ложь Тогда
							СтрокаКССтрахователя.БОНУС_РОП_КС = 0;
						Иначе
							СтрокаКССтрахователя.БОНУС_РОП_КС = СтрокаКССтрахователя.СКВ * (СтрокаКССтрахователя.БонусПроцентРОП)/100;
						КонецЕсли;
						
					Иначе
						//
						Сделка = Неопределено;
					КонецЕсли;
				КонецЦикла;	
				//КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
		//МассивКС = ТЗ1.НайтиСтроки(СтруктураОтбора);
		//Для каждого СтрокаКС из МассивКС Цикл
		//	СтрокаКС.СКВ_КС       = СтрокаКС.СКВ;
		//	СтрокаКС.БОНУС_КС     = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцент/100;
		//	СтрокаКС.БОНУС_РОП_КС = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцентРОП/100;
		//КонецЦикла;	
		ТЗКрупныхСделок = ТЗ1.Скопировать(СтруктураОтбораКС);	
		ТЗКрупныхСделокДляИтогов = ТЗКрупныхСделок.Скопировать(,"Агент,Подразделение,СКВ");
		ТЗКрупныхСделокДляИтогов.Свернуть("Агент,Подразделение","СКВ");
		Для Каждого СтрокаАгентаКС из ТЗКрупныхСделокДляИтогов Цикл
			СтрокаАгента = ТЗАгентов.Найти(СтрокаАгентаКС.Агент,"Агент");
			Если СтрокаАгента = Неопределено Тогда
				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
			Иначе
				СтрокаАгента.СКВ_КС = СтрокаАгентаКС.СКВ;
			КонецЕсли;	
		КонецЦикла;
		ТЗКрупныхСделокДляИтогов.Свернуть("Подразделение","СКВ");
		Для Каждого СтрокаПодразделенияКС из ТЗКрупныхСделокДляИтогов Цикл
			СтрокаПодразделения = ТЗПодразделений.Найти(СтрокаПодразделенияКС.Подразделение,"Подразделение");
			Если СтрокаПодразделения = Неопределено Тогда
				Сообщить("Не найдена строка подразделения КС, сообщите разработчикам");
			Иначе
				СтрокаПодразделения.СКВ_КС = СтрокаПодразделенияКС.СКВ;
			КонецЕсли;	
		КонецЦикла;
		//Итоги Бонуса РОП по КС
		ТЗИтоговРОП = ТЗ1.Скопировать(,"Агент,Подразделение,БОНУС_РОП_КС");	
		ТЗИтоговРОП.Свернуть("Агент,Подразделение","БОНУС_РОП_КС");
		//
		Для каждого СтрокаИтогов из ТЗИтоговРОП Цикл
			СтрокаАгента = ТЗАгентов.Найти(СтрокаИтогов.Агент,"Агент");
			Если СтрокаАгента = Неопределено Тогда
				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
			Иначе
				СтрокаАгента.БОНУС_РОП_КС = СтрокаИтогов.БОНУС_РОП_КС;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
	//Обработка пролонгаций
	СтруктураОтбораПродление = Новый Структура("ЭтоПролонгация,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	
	нСтроки = тз1.НайтиСтроки(СтруктураОтбораПродление);
	Мастера = ЭтоМастер();
	Для каждого СтрокаРек из нСтроки Цикл
		Если Мастера.Найти(СтрокаРек.Агент) =Неопределено Тогда
			СтрокаРек.СКВ_Прол = СтрокаРек.СКВ;
		Иначе	
			СтрокаРек.СКВ_Прол = 0;
			СтрокаРек.ЭтоПролонгация = Ложь;
		КонецЕсли;	
	КонецЦикла;	
	
	
	тзСхемаРасчетаДляАгентов = ТЗ1.Скопировать(, "Агент,СхемаРасчетаСМенеджером");
	тзСхемаРасчетаДляАгентов.Свернуть("Агент,СхемаРасчетаСМенеджером");
	тзСуммыВМ_ПоПодразделениям = ТЗ1.Скопировать(СтруктураОтбора2, "Организация,Агент,Подразделение,ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,СуммаДБ");
	тзСуммыВМ_ПоПодразделениям.Свернуть("Подразделение","ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,СуммаДБ");
	тзСуммы_ДляПланаПоСКВ_ПоАгентам = ТЗ1.Скопировать(СтруктураОтбора, "Агент,Подразделение,СКВ,СКВ_Прол,НачисленнаяСуммаВзноса, КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	тзСуммы_ДляПланаПоСКВ_ПоАгентам.Свернуть("Агент,Подразделение","СКВ,СКВ_Прол,НачисленнаяСуммаВзноса, КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП = ТЗ1.Скопировать(, "Агент,Подразделение,СКВ,НачисленнаяСуммаВзноса");
	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Свернуть("Агент,Подразделение","СКВ,НачисленнаяСуммаВзноса");
	тзСуммыПлановПоСКВ_ПоПодразделениям = ТЗАгентов.Скопировать(, "Агент,Подразделение,План,ШтрафнойПлан,Количество");//СтруктураОтбора убрал
	тзСуммыПлановПоСКВ_ПоПодразделениям.Свернуть("Подразделение","План,ШтрафнойПлан,Количество");
	тзСуммыСКВ_ПоПодразделениям = ТЗ1.Скопировать(, "Подразделение,СКВ,СКВ_Прол,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Скопировать(,"Агент,Подразделение,СКВ");
	тзСуммыСКВ_ПоПодразделениям.Свернуть("Подразделение","СКВ,СКВ_Прол,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	//Заполняем Фактические параметры для подразделений 
	Кол = тзПодразделений.Колонки;
	Кол.Добавить("СуммаВМ",								ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоПодразделению",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("КоличествоФакт_ПоПодразделению",		ОписаниеТипаЧисло12_0);
	Кол.Добавить("КоэффициентВида_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	Кол.Добавить("НовыйКлиент_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	Кол.Добавить("НовыйКлиентСКВ_ПоПодразделению",		ОписаниеТипаЧисло14_2_но);	
	
	
	Кол.Добавить("КоэффициентВидаГод_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	
	Кол.Добавить("СКВ_ПоПодразделениямДоСП",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ИтогоЗПпоПодразделению",				ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаПлана",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаКоличествоПлан",					ОписаниеТипаЧисло12_0);
	Кол.Добавить("ИтогоЗПОрг",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаПланаОрг",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаКоличествоПланОрг",				ОписаниеТипаЧисло12_0);
	Кол.Добавить("Организация",							ОписаниеТипа_Организации);
	Кол.Добавить("СуммаВознаграждения_РОПОрг",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаВознаграждения_ЗамРОПОрг",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентВыполненияПлана_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("СуммаВознаграждения_РОП",				ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаВознаграждения_ЗамРОП",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ЭтоПодразделениеЕстьВТЗ1", 			ОписаниеТипаБулево);
	Для Каждого Стр ИЗ тзПодразделений Цикл
		Стр.Организация = Стр.Подразделение.Владелец;
		Если СписокПодразделенийИзТЗ1.Найти(Стр.Подразделение,"Подразделение") <> Неопределено Тогда
			Стр.ЭтоПодразделениеЕстьВТЗ1 = Истина;
		КонецЕсли;
		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыПлана <> Неопределено Тогда
			Стр.СуммаПлана = СтрокаСуммыПлана.План-СтрокаСуммыПлана.ШтрафнойПлан;
			Стр.СуммаКоличествоПлан = СтрокаСуммыПлана.Количество;
		КонецЕсли;
		
		СтрокаСуммыСКВ = тзСуммыСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыСКВ <> Неопределено Тогда
			Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению = СтрокаСуммыСКВ.СКВ;
			Стр.КоличествоФакт_ПоПодразделению = СтрокаСуммыСКВ.КоличествоФакт;
			Стр.КоэффициентВида_ПоПодразделению = СтрокаСуммыСКВ.КоэффициентВида;			
			Стр.НовыйКлиент_ПоПодразделению = СтрокаСуммыСКВ.НовыйКлиент;			
			Стр.НовыйКлиентСКВ_ПоПодразделению = СтрокаСуммыСКВ.НовыйКлиентСКВ;			
			
			
		КонецЕсли;
		СтрокаСуммыВМ = тзСуммыВМ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыВМ <> Неопределено Тогда
			Стр.СуммаВМ = СтрокаСуммыВМ.ВознаграждениеМенеджера+СтрокаСуммыВМ.ПартнерскоеВознаграждение;
			Стр.СуммаДБ = СтрокаСуммыВМ.СуммаДБ;
		КонецЕсли;
		бСхПроцентОтСКВ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ;
		бСхПроцентОтВМ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтВМ;
		бСхПроцентОтДБ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтДБ и ЭтоВариант20180701 ;
		Если бСхПроцентОтДБ Тогда
			//Если ЭтоВариант20180701 Тогда  Расчет будет по сотрудникам ниже
			//	Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;	
			//	Стр.СуммаВознаграждения_РОП		= Стр.СуммаДБ * Стр.СтавкаВознаграждения_РОП / 100;	
			//Иначе
				Стр.СтавкаВознаграждения_РОП = 0;
				Стр.СуммаВознаграждения_РОП	 = 0;
			//КонецЕсли;
		ИначеЕсли бСхПроцентОтСКВ Тогда
			колПланРукВыполнен = ЭтоВариант20130901=ЛОЖЬ ИЛИ Стр.СуммаКоличествоПлан=0 ИЛИ Стр.КоличествоФакт_ПоПодразделению>=Стр.СуммаКоличествоПлан;
			Если Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательПлана_РОП / 100 Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП-?(колПланРукВыполнен,0,1);	
			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательМинимальногоПорога_РОП / 100 Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП-?(колПланРукВыполнен,0,1);	
			Иначе
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+?(колПланРукВыполнен и ЭтоВариант20130901 и НЕ ЭтоВариант20191201,1,0);	
			КонецЕсли;
			Если ЭтоВариант20120401  Тогда 
				//В этом случае расчет может быть скорректирован
			ИначеЕсли ЭтоВариант20121001 Тогда
				//
				Стр.СуммаВознаграждения_РОП	= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению) * Стр.СтавкаВознаграждения_РОП / 100;	
				//Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению-Стр.СКВ_КС) * Стр.СтавкаВознаграждения_РОП / 100;	
			Иначе
				Стр.СуммаВознаграждения_РОП	= Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению * Стр.СтавкаВознаграждения_РОП / 100;	
			КонецЕсли;	
			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.СуммаПлана = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.СуммаПлана * 100);	
		ИначеЕсли бСхПроцентОтВМ Тогда	
			//Для схемы вознаграждения руководителя  ПроцентОтВМ значения показателей имеет иной смысл:
			Если Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательПлана_РОП Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП;	
			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательМинимальногоПорога_РОП Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП;	
			Иначе
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;	
			КонецЕсли;
			Стр.СуммаВознаграждения_РОП		= Стр.СуммаВМ * Стр.СтавкаВознаграждения_РОП / 100;	
			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.ПоказательПлана_РОП = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.ПоказательПлана_РОП * 100);	
		
		КонецЕсли;
		Если НЕ Стр.РуководительПолучаетВознаграждение Тогда
			Стр.СуммаВознаграждения_РОП = 0;
		КонецЕсли;	
	КонецЦикла;
	//Добавляем в ТЗ1 пустые строки для Подразделений, у которых небыло оплат
	Для Каждого Стр ИЗ тзПодразделений Цикл
		Если НЕ Стр.ЭтоПодразделениеЕстьВТЗ1 Тогда
			НовОплата				= ТЗ1.Добавить();
			НовОплата.Подразделение	= Стр.Подразделение;		
			НовОплата.Пустышка		= Истина;	
			НовОплата.СКВ = 0;
			НовОплата.КоличествоФакт = 0;
			НовОплата.КоэффициентВида = 0;
			НовОплата.НовыйКлиент = 0;			
			НовОплата.НовыйКлиентСКВ = 0;
			НовОплата.ОплаченоФакт = 0;
			НовОплата.НачисленнаяСуммаВзноса = 0;
			НовОплата.СкидкаВыплаченаяКлиенту = 0;
			НовОплата.КВСумма = 0;
			НовОплата.КВСуммаДляАгента = 0; 
			НовОплата.ВознаграждениеМенеджера = 0;
			НовОплата.ВознаграждениеДоп = 0;
			НовОплата.ПартнерскоеВознаграждение = 0;
			НовОплата.ВычетСАгента = 0;
			НовОплата.АВилиСкидкаСумма  = 0;
			НовОплата.Ед = 0;
			НовОплата.СуммаДБ = 0;
		КонецЕсли;
	КонецЦикла;	
	//Заполняем Фактические параметры для Агентов 
	Кол = ТЗАгентов.Колонки;
	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоАгенту",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("КоличествоФакт_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту
	Кол.Добавить("КоэффициентВида_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("НовыйКлиент_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("НовыйКлиентСКВ_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	
	Кол.Добавить("КоэффициентВидаГод_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("СобраннаяСП",					ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентВыполненияПлана",		ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентВыполненияПланаДляРОП",		ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения",		ОписаниеТипаПроцент);
	Кол.Добавить("СКВдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
	Кол.Добавить("СКВотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
	Кол.Добавить("СКВот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("СКВСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
	Кол.Добавить("ЗПотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
	Кол.Добавить("ЗПот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПотСКВдоСуперПлана",			ОписаниеТипаЧисло14_2_но); //До Первой БП
	Кол.Добавить("ЗПЗаПревышение1БП",	        ОписаниеТипаЧисло14_2_но); //201212
	Кол.Добавить("ЗП_Пролонгация",			ОписаниеТипаЧисло14_2_но); //До Первой БП
	Кол.Добавить("ПревышениеСуперплана",		ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ЗПотЗаПревышениеСуперПлана",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ИтогоЗП",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ВознаграждениеРуководителя",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ВознаграждениеЗамаРуководителя",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентРОП",	                ОписаниеТипаПроцент);
	Кол.Добавить("ДельтаКСРуководитель",	ОписаниеТипаЧисло14_2_но);
	
	Кол.Добавить("БОНУС_КС_",ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("БратьВИтоги",ОписаниеТипаБулево);
	СписокУчтенных = Новый Массив;
	
	ВыборкаМенеджеров = ВыполнениеПланаМенеджерами(ТЗАгентов.ВыгрузитьКолонку("Агент"), ЗарплатныйПериод);
	
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		Если СписокУчтенных.Найти(Стр.Агент) = Неопределено Тогда
			Стр.БратьВИтоги = Истина;
			СписокУчтенных.Добавить(Стр.Агент);
		Иначе
			Стр.БратьВИтоги = Ложь;
		КонецЕсли;	
		СтрокаСумм = тзСуммы_ДляПланаПоСКВ_ПоАгентам.Найти(Стр.Агент,"Агент"); //Тут таблица только по схеме
		ДопПроцент = 0; //За выполнение НС при невыполнении плана по суммам
		Если СтрокаСумм <> Неопределено Тогда
			Стр.СКВ_ДляПланаПоСКВ_ПоАгенту	= СтрокаСумм.СКВ;
			Стр.СКВ_Прол                    = СтрокаСумм.СКВ_Прол;
			Стр.СобраннаяСП					= СтрокаСумм.НачисленнаяСуммаВзноса; 
			Стр.ПроцентВыполненияПлана		= ?(Стр.План = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту / Стр.План * 100); 
			Стр.ПроцентВыполненияПланаДляРОП = ?((Стр.План-Стр.ШтрафнойПлан) = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту / (Стр.План-Стр.ШтрафнойПлан) * 100); 
			
			Стр.КоличествоФакт_ПоАгенту		= СтрокаСумм.КоличествоФакт;
			Стр.КоэффициентВида_ПоАгенту	= СтрокаСумм.КоэффициентВида;
			Стр.НовыйКлиент_ПоАгенту	= СтрокаСумм.НовыйКлиент;
			Стр.НовыйКлиентСКВ_ПоАгенту	= СтрокаСумм.НовыйКлиентСКВ;
			
			
		ИначеЕсли ЭтоВариант20180701 Тогда	
			Стр.СКВ_ДляПланаПоСКВ_ПоАгенту	= 0;
			Стр.СобраннаяСП					= 0; 
			Стр.ПроцентВыполненияПлана		= 0; 
			Стр.ПроцентВыполненияПланаДляРОП = 0; 
			
			Стр.КоличествоФакт_ПоАгенту		= 0;
			Стр.КоэффициентВида_ПоАгенту	= 0;
			Стр.НовыйКлиент_ПоАгенту	= 0;
			Стр.НовыйКлиентСКВ_ПоАгенту	= 0;
			
			
		Иначе
			Продолжить;
		КонецЕсли;	
		
		СтрокаСумм = ТЗ1_ГодНазад.Найти(Стр.Агент,"Агент");
		Если СтрокаСумм <> Неопределено Тогда
			Стр.КоэффициентВидаГод_ПоАгенту	= СтрокаСумм.КоэффициентВида;
		КонецЕсли;	
		
		//ПланВыполнен = уб_РасчетыСМенеджерами.ПланВыполнен(Стр.Агент,ЗарплатныйПериод,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Менеджер", Стр.Агент);
		ВыборкаМенеджеров.Сбросить();
		
		Если ВыборкаМенеджеров.НайтиСледующий(СтруктураПоиска) Тогда
			ПланВыполнен = ВыборкаМенеджеров.ВыполненПлан;
			РаскраситьКоличественныйПлан = Ложь;
			РаскраситьПлан = Ложь;
		ИначеЕсли ЭтоВариант20181001 Тогда
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			ПроцентНовых = ?(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту=0,0,Цел(100*Стр.НовыйКлиентСКВ_ПоАгенту/Стр.СКВ_ДляПланаПоСКВ_ПоАгенту));
			КоличественныйПланВыполнен = ПроцентНовых>=20 или Стр.КоэффициентВида_ПоАгенту>=Стр.КоэффициентВидаГОД_ПоАгенту;
			ПланВыполнен = СуммовойПланВыполнен И КоличественныйПланВыполнен;
			ДопПроцент = 0;//?(КоличественныйПланВыполнен=Истина ,5,0);//
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;		
		ИначеЕсли ЭтоВариант20130801 Тогда
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			//КоличественныйПланВыполнен = Стр.КоэффициентВида >= Стр.КоэффициентВидаГОд;
			КоличественныйПланВыполнен = Стр.КоличествоФакт_ПоАгенту >= Стр.Количество;
			ПланВыполнен = СуммовойПланВыполнен И КоличественныйПланВыполнен;
			ДопПроцент = ?(ПланВыполнен=ЛОЖЬ и КоличественныйПланВыполнен=Истина ,?(ЗарплатныйПериод<Дата(2018,10,1),5,0),0);//За выполнение НС при невыполнении плана по суммам
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;
		Иначе
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			ПланВыполнен = СуммовойПланВыполнен;
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Ложь;
		КонецЕсли;
		РаскраситьПолеМенеджера = Не ПланВыполнен;
		
		Если РаскраситьПолеМенеджера = Истина Или РаскраситьПлан = Истина Или РаскраситьКоличественныйПлан = Истина Тогда
			
			НайденныеСтроки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаМенеджера = НайденныеСтроки[0];
			Иначе
				СтрокаМенеджера = тзАгентовДляРаскраски.Добавить();
				СтрокаМенеджера.Менеджер = Стр.Агент;
				СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь;
				СтрокаМенеджера.РаскраситьПлан = Ложь;
				СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь Тогда
				СтрокаМенеджера.РаскраситьПолеМенеджера = РаскраситьПолеМенеджера;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьПлан = Ложь Тогда
				СтрокаМенеджера.РаскраситьПлан = РаскраситьПлан;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь Тогда
				СтрокаМенеджера.РаскраситьКоличественныйПлан = РаскраситьКоличественныйПлан;
			КонецЕсли;
			
		КонецЕсли;
		
		Стр.ВыполненПланПоСКВ = ПланВыполнен;
		Стр.СтавкаВознаграждения = ?(ПланВыполнен, Стр.ПроцентнаяСтавкаПослеПлана, Стр.ПроцентнаяСтавкаДоПлана+ДопПроцент);
		Бонус_КС  = 0;
		ОстатокПролонгации = 0;
		Если ЭтоВариант20121001 и (ЭтоВариант20150401=Истина ИЛИ ПланВыполнен = Истина) Тогда //Отработка не выполненного плана внутри
			//
			Если ПланВыполнен Тогда
				СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС;//-Стр.СКВ_Прол;
			Иначе	
				//Подменяем ставки, а суммы также будут распределятся по диапазонам, чтобы не влиять на зп руководителей
				Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = Стр.СтавкаВознаграждения; 
				Стр.ПроцентнаяСтавкаПослеСуперПлана        = Стр.СтавкаВознаграждения;
				//КС идут в план бьез бонусов
				СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;//-Стр.СКВ_Прол;
				//= Стр.СКВ_КС-(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка))
				//= 53000 - (248000-(248000-53000)<Стр.ПерваяБонусПланка))
				// = ?((248000-53000)>Стр.ПерваяБонусПланка,0,1);
				// Мин(Стр.ПерваяБонусПланка,500000)- Мин((500000-150000),Стр.ПерваяБонусПланка)
				// Мин(Стр.ПерваяБонусПланка,236000)- Мин((236000-236000),Стр.ПерваяБонусПланка)
				Если ЭтоВариант20150901 Тогда
					ДельтаКСРуководитель = 0; //Дельты нет. т.к. все идет в план
				Иначе
					ДельтаКСРуководитель = Мин(Стр.ПерваяБонусПланка,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту)- Мин((Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС),Стр.ПерваяБонусПланка);
					Если ДельтаКСРуководитель <> 0 Тогда
						Сообщить("Дельта "+ДельтаКСРуководитель 
						//+ "/"+ Стр.Подраздаление
						+"/"+Стр.Агент);
					КонецЕсли;
				КонецЕсли;
				Стр.ДельтаКСРуководитель = ДельтаКСРуководитель;
			КонецЕсли;
			
			
			//+Новые промежуточные расчеты
			Стр.СКВДоПлана = Мин(СКВ_БЕЗ_КС,Стр.План);
			//-
			СКВ_НБ = СКВ_БЕЗ_КС;
			Если ЭтоВариант20121201 Тогда
				//+Новые промежуточные расчеты
				Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) - Стр.План,0);
				Стр.СКВот1БПдо2БП               = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.ПерваяБонусПланка,0);
				Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
				//-
				Если Стр.СКВ_Прол >0 Тогда
					СКВ_НБ = СКВ_БЕЗ_КС-Стр.СКВ_Прол;
					СКВ_Прол = Стр.СКВ_Прол;
					
					Если СКВ_НБ>Стр.ПерваяБонусПланка Тогда
						Стр.ЗПотСКВдоСуперПлана = Стр.ПерваяБонусПланка* Стр.СтавкаВознаграждения / 100; 
					Иначе
						Стр.ЗПотСКВдоСуперПлана = СКВ_НБ* Стр.СтавкаВознаграждения / 100; 
						ОстатокДоБП = Стр.ПерваяБонусПланка-СКВ_НБ;
						Если СКВ_Прол>ОстатокДоБП Тогда
							ОстатокПролонгации = СКВ_Прол-ОстатокДоБП;    //Эта сумма пойдет под 60
							//Стр.СКВ_Прол= Стр.СКВ_Прол-ОстатокПролонгации;//уберем из расчета под 30
						КонецЕсли;	
					КонецЕсли;	
					Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					Стр.ЗП_Пролонгация              = (Стр.СКВ_Прол-ОстатокПролонгации)*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;
					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
				Иначе	
					Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
					//Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)
					//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					Стр.ЗП_Пролонгация              = Стр.СКВ_Прол*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;
				КонецЕсли;
			Иначе	
				//+Новые промежуточные расчеты
				Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.План,0);
				Стр.СКВот1БПдо2БП               = 0;
				Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
				//-
				//Стр.СКВотПланадо1БП = 0;
				Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
				Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
			КонецЕсли;	
			Бонус_КС =0;
			Если ПланВыполнен = Истина Тогда
				СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,Агент,СхемаРасчетаСМенеджером",Истина,Стр.Агент,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
				СтрокиКС = ТЗ1.НайтиСтроки(СтруктураОтбораКС);
				
				Для каждого СтрокаКС из СтрокиКС Цикл
					СтрокаКС.СКВ_КС =  СтрокаКС.СКВ;
					СтрокаКС.БОНУС_КС = СтрокаКС.СКВ_КС * Макс(СтрокаКС.БонусПроцент+Стр.СтавкаВознаграждения,0)/100;
					Бонус_КС = Бонус_КС + СтрокаКС.БОНУС_КС;
				КонецЦикла;	
			КонецЕсли;
		Иначе	
			//+Новые промежуточные расчеты
			Стр.СКВДоПлана       = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.План);
			Стр.СКВотПланадо1БП  = Макс(Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) - Стр.План,0);
			Стр.СКВот1БПдо2БП    = 0;
			Стр.СКВСвыше2БП      = Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
			//-
			//Стр.СКВотПланадо1БП = 0;
			Стр.ЗПотСКВдоСуперПлана		= Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
			Стр.ПревышениеСуперплана	= Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
		КонецЕсли;
		
		//Стр.ЗПотПланадо1БП = Стр.СКВотПланадо1БП*Стр.ПерваяБонусПланка;
		
		КорректировкаЗПСуперПлана = 0;
		СуммаДляРуководителяПоПониженнойСтавке = 0;
		ПроцентКС 		= 5;
		Бонус_КС_РОП 	= 0;
		Бонус     		= 0;
		Если Стр.ПревышениеСуперплана > 0 Тогда 
			Если ЭтоВариант20121001 Тогда
				ПревышениеСуперпланаКРаспределению = Стр.ПревышениеСуперплана;
				Если ПревышениеСуперпланаКРаспределению > 0 Тогда
					БОНУС = ПревышениеСуперпланаКРаспределению * ?(ПланВыполнен,Стр.ПроцентнаяСтавкаПослеСуперПлана,Стр.ПроцентнаяСтавкаДоПлана)/100;
				КонецЕсли;	
				Стр.ЗПотЗаПревышениеСуперПлана = БОНУС;
			Иначе
				СтруктураОтбораОплат = Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
				СКВ_КС = 0;
				//Копируем таблицу по агенту
				ТЗОплатАгентаПоСхемеПланПоСКВ = ТЗ1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером,Агент,Подразделение",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ,Стр.Агент,Стр.Подразделение));
				Для каждого СтрокаТЗ ИЗ ТЗОплатАгентаПоСхемеПланПоСКВ Цикл
					//Сообщить(СтрокаТЗ.Ссылка);
					Если СтрокаТЗ.КВСуммаДляАгента>РазмерКС Тогда
						СКВ_КС = СКВ_КС + СтрокаТЗ.СКВ;
						Если ЭтоВариант20120401 Тогда
							СуммаДляРуководителяПоПониженнойСтавке = СуммаДляРуководителяПоПониженнойСтавке+СтрокаТЗ.СКВ;
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
				Если СКВ_КС>Стр.ПревышениеСуперплана Тогда
					СуммаПоПовышеннойСтавке        = Стр.ПревышениеСуперплана;
					БОНУС_КС                       = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
					Стр.ЗПотЗаПревышениеСуперПлана = БОНУС_КС;
				Иначе
					ФактическоеПревышениеСупера    = Стр.ПревышениеСуперплана - СКВ_КС;
					СуммаПоПовышеннойСтавке        = СКВ_КС;
					БОНУС_КС      = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
					БОНУС         = ФактическоеПревышениеСупера * Стр.ПроцентнаяСтавкаПослеСуперПлана / 100;
					//+Новые промежуточные расчеты
					Стр.СКВСвыше2БП      = ФактическоеПревышениеСупера;
					//-
					Стр.ЗПотЗаПревышениеСуперПлана	= БОНУС + БОНУС_КС;
				КонецЕсли;	
				
				
				НадоВыводитьСообщение = ЭтоПолныеПрава;
				Если НадоВыводитьСообщение И Бонус_КС > 0 Тогда
					Сообщить("По агенту "+Стр.Агент+" начислен бонус за крупную сделку в размере: "+Формат(Бонус_КС,"ЧЦ=15; ЧДЦ=2"));
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;			
		//+Новые промежуточные расчеты
		Стр.ЗПдоПлана      = Мин(Стр.СКВДоПлана,СКВ_НБ) * Стр.СтавкаВознаграждения/100;
		Стр.ЗПотПланадо1БП = (Мин(СКВ_НБ,Стр.ПерваяБонусПланка)-Мин(Стр.СКВДоПлана,СКВ_НБ)) * Стр.СтавкаВознаграждения/100;
		Стр.ЗПот1БПдо2БП   = Стр.СКВот1БПдо2БП * Стр.ПроцентнаяСтавкаПослеПервойБонусПланки/100;
		Стр.ЗПСвыше2БП     = Стр.СКВСвыше2БП * Стр.ПроцентнаяСтавкаПослеСуперПлана/100;
		//-Новые промежуточные расчеты
		
		Если Стр.БратьВИтоги Тогда
			Стр.ИтогоЗП	= Стр.ЗПотСКВдоСуперПлана + Стр.ЗПотЗаПревышениеСуперПлана+Стр.ЗПЗаПревышение1БП
			+ Стр.ЗП_Пролонгация;//+?(ЭтоВариант20121001,БОНУС_КС,0);
			Стр.БОНУС_КС_ = +?(ЭтоВариант20121001,БОНУС_КС,0);
		Иначе
			Стр.ИтогоЗП = 0 ;
		КонецЕсли;	
		СтрокаПодразделения				= тзПодразделений.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаПодразделения <> Неопределено Тогда
			Если СтрокаПодразделения.РуководительПолучаетВознаграждение Тогда					
				//ПроцентнаяСтавкаДоМинимальногоПорога_РОП	5	
				//СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 8
				//Превышен план и есть крупная сделка
				НадоВыводитьСообщение = ЭтоПолныеПрава Или (СтрокаПодразделения.Руководитель = ПараметрыСеанса.уб_ТекущееФизЛицо);
				Если СуммаДляРуководителяПоПониженнойСтавке>0 
					И СтрокаПодразделения.СтавкаВознаграждения_РОП>СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 
					и ЭтоВариант20150901 = ЛОЖЬ
					Тогда //Для старых расчетных периодов так.
					СуммаДляРуководителяПоПолнойСтавке = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-СуммаДляРуководителяПоПониженнойСтавке;
					СуммаДляРуководителяПоПониженнойСтавке = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана,СуммаДляРуководителяПоПониженнойСтавке)-СуммаДляРуководителяПоПолнойСтавке;
					ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана-СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
					//Для руководителя эта часть по пониженной ставке
					ВознаграждениеРуководителя2 = (СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП / 100;
					Если НадоВыводитьСообщение И СтрокаПодразделения.СтавкаВознаграждения_РОП<>СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП Тогда
						Сообщить("Для "+СтрокаПодразделения.Руководитель+" крупная сделка подчиненного на сумму "+Формат(СуммаДляРуководителяПоПониженнойСтавке,"ЧЦ=15; ЧДЦ=2; ДФ=")+" посчитана по "+СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+"%");
					КонецЕсли;	
					Стр.ВознаграждениеРуководителя = ВознаграждениеРуководителя+ВознаграждениеРуководителя2;
					//Корректируем
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
				Иначе							
					Если ЭтоВариант20121001 Тогда
						//TO DO проверить								
					ИначеЕсли ЭтоВариант20120401 Тогда
						//TO DO проверить
						Стр.ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана)* СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
						СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
					Иначе
						Стр.ВознаграждениеРуководителя = Стр.ЗПотСКВдоСуперПлана * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;	
					КонецЕсли;	
					
				КонецЕсли;	
				
				Если ЭтоВариант20150901 = Истина Тогда
					ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
					Если //СтрокаПодразделения.Подразделение.НеПроверятьЛичныеЗаявки = Истина и 
						(ПоказательРасчетРОП>0 или Найти(Стр.Подразделение,"Ведущие")>0) Тогда
						Если ЭтоВариант20170901 Тогда
							Если ЭтоВариант20171001 = Истина Тогда
								//Ставки 4/3/0
								Если Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП=10 Тогда
									ПроцентнаяСтавкаРОП = 0;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП<>10 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=80 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=99 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-?(ЭтоВариант20191201,0,1);
								Иначе
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								КонецЕсли;	
							Иначе	
								Если ПоказательРасчетРОП>10 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)>0 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<СтрокаПодразделения.ПоказательМинимальногоПорога_РОП Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП>=100 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								Иначе
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
								КонецЕсли;	
							КонецЕсли;	
						Иначе	
							ПроцентнаяСтавкаРОП = 1;
						КонецЕсли;	
					Иначе
						Если ЭтоВариант20170101 Тогда
							ПострокаП = Строка(Стр.Подразделение);
							Если Найти(ПострокаП,"М-ОП")>0
								ИЛИ (ЭтоВариант20191201 и 
								Найти(ПострокаП,"ОП-5")>0)
								Тогда
								ПроцентнаяСтавкаРОП = СтрокаПодразделения.СтавкаВознаграждения_РОП;
							Иначе
								ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);			
							КонецЕсли; 
						Иначе
							ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);		
						КонецЕсли;
						
						//Если ЭтоПолныеПрава Тогда
						//	Сообщить("Для "+Стр.Агент+" ставка РОП "+ПроцентнаяСтавкаРОП+"["+Стр.ПроцентВыполненияПлана+"]" );
						//КонецЕсли;	
					КонецЕсли;
					
					Если ЭтоВариант20171001 = Ложь и ЭтоВариант20170901 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("СКВ без бонус планки для РОП",Стр.Агент, ДатаКонца,0)>0 Тогда
						//Костыль для Слученкова
						
						ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
						СКВ_ПоПодразделениямДоСП = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;
						//Если Стр.ПроцентВыполненияПлана<=50 Тогда
						//	ПроцентнаяСтавкаРОП = 0;
						Если Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП=10 Тогда       //Костыль слученкова
							ПроцентнаяСтавкаРОП = 0;
						ИначеЕсли Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП<>10 Тогда //Костыль Короля
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
						ИначеЕсли Стр.ПроцентВыполненияПлана<=80 Тогда
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
						ИначеЕсли Стр.ПроцентВыполненияПлана<=99 Тогда
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-1;
						Иначе
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
						КонецЕсли;	
						
						
						
					Иначе	
						Если ЭтоВариант20171001 Тогда
							СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,//Стр.СКВ_Прол+
							Стр.СКВДоПлана+ ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП=0,Стр.СКВ_КС,0),0)+ Стр.СКВотПланадо1БП);
						Иначе
							Если ЭтоВариант20170901 и  ПоказательРасчетРОП>0 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)=0 Тогда
								СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,Стр.СКВДоПлана+ ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП=0,Стр.СКВ_КС,0),0)+ Стр.СКВотПланадо1БП);
							Иначе	
								СКВ_ПоПодразделениямДоСП = Стр.СКВДоПлана + ?(Стр.ПроцентВыполненияПлана>=100,Стр.СКВ_КС,0)+ Стр.СКВотПланадо1БП;
							КонецЕСли;	
						КонецЕсли;	
					КонецЕсли;	
					Если СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ и ЭтоВариант20180701 тогда
						Попытка
							Если Стр.ВознаграждениеМенеджера>=-100 Тогда
								Стр.ВознаграждениеРуководителя = Окр(Стр.СуммаДБ*СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП/100,2);
							КонецЕсли;	
						Исключение
						КонецПопытки;	
					ИначеЕсли СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ или ЭтоВариант20180701 = Ложь тогда
						Стр.ВознаграждениеРуководителя = Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
						
						Если ЭтоВариант20171001 Тогда
							Если Стр.БОНУС_РОП_КС>0 Тогда
								Если РольДоступна("ПолныеПрава") Тогда
									Сообщить("Вознаграждение руководителю за "+Стр.Агент+" включает Бонус КС = "+ Стр.БОНУС_РОП_КС);
								КонецЕсли;	
								Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+ Стр.БОНУС_РОП_КС;
							КонецЕсли;	
						КонецЕсли;
						
						
					КонецЕсли;
					
					Если ЭтоВариант20170101 Тогда
						Если СтрокаПодразделения.ЗамПолучаетВознаграждение = Истина  Тогда
							Стр.ВознаграждениеЗамаРуководителя = Стр.ВознаграждениеРуководителя;
						КонецЕсли;
						
					Иначе
						Стр.ВознаграждениеЗамаРуководителя = 0;
					КонецЕсли;
					
					Стр.ПроцентРОП = ПроцентнаяСтавкаРОП;
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
					СтрокаПодразделения.СуммаВознаграждения_ЗамРОП =СтрокаПодразделения.СуммаВознаграждения_ЗамРОП+ Стр.ВознаграждениеЗамаРуководителя;
					//Если //НадоВыводитьСообщение И 
					//	Бонус_КС_РОП > 0 Тогда
					//	//Добавляем бонус руководителю за КС
					//	Если НадоВыводитьСообщение Тогда
					//		Сообщить("Для "+СтрокаПодразделения.Руководитель+" начислен бонус за заключение агентом крупной сделки  в размере: "+Формат(Бонус_КС_РОП,"ЧЦ=15; ЧДЦ=2; ДФ=")+"");
					//	КонецЕсли;	
					//	Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+Бонус_КС_РОП;
					//	СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Бонус_КС_РОП;
					//КонецЕсли;	
				Иначе
					Стр.ВознаграждениеЗамаРуководителя = 0;
					//!!!Проверить
					Если //НадоВыводитьСообщение И 
						Бонус_КС_РОП > 0 Тогда
						//Добавляем бонус руководителю за КС
						Если НадоВыводитьСообщение Тогда
							Сообщить("Для "+СтрокаПодразделения.Руководитель+" начислен бонус за заключение агентом крупной сделки  в размере: "+Формат(Бонус_КС_РОП,"ЧЦ=15; ЧДЦ=2; ДФ=")+"");
						КонецЕсли;	
						Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+Бонус_КС_РОП;
						СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Бонус_КС_РОП;
					КонецЕсли;	
				КонецЕсли;
				
				
			Иначе
				Стр.ВознаграждениеРуководителя = 0;
			Конецесли;
		КонецЕсли;
		//КонецЕсли; //СтрокаСумм<>0
		Стр.СКВДоПлана = Мин(Стр.СКВДоПлана,СКВ_НБ);//20191001     для вывода в отчет
		Стр.СКВ_Прол= Стр.СКВ_Прол-ОстатокПролонгации;////20191001 для вывода в отчет
	КонецЦикла;
	
					
	тзСуммыСКВ_ПоПодразделениямДоСП = ТЗАгентов.Скопировать(СтруктураОтбора3, "Агент,Подразделение,СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,КоэффициентВида_ПоАгенту,НовыйКлиент_ПоАгенту,НовыйКлиентСКВ_ПоАгенту,КоэффициентВидаГод_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
	тзСуммыСКВ_ПоПодразделениямДоСП.Свернуть("Подразделение","СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,КоэффициентВида_ПоАгенту,НовыйКлиент_ПоАгенту,НовыйКлиентСКВ_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
	тзПодразделений.Колонки.Добавить("БОНУС_РОП_КС_",ОписаниеТипаЧисло14_2_но);
	Для Каждого Стр ИЗ тзПодразделений Цикл
		тзСКВпоПодДоСП = тзСуммыСКВ_ПоПодразделениямДоСП.Найти(Стр.Подразделение,"Подразделение");
		Если тзСКВпоПодДоСП <> Неопределено Тогда
			//Как считать до чего считать превышение 201212
			Если РасчетДО1БП = Истина Тогда
				Стр.СКВ_ПоПодразделениямДоСП    = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП 
				- ?(ЭтоВариант20150801,тзСКВпоПодДоСП.ДельтаКСРуководитель,0); //20141110 //КС удалится ниже //Дельта КС пойдет как оплата КС
			Иначе	
				Стр.СКВ_ПоПодразделениямДоСП	= тзСКВпоПодДоСП.СКВ_ДляПланаПоСКВ_ПоАгенту - тзСКВпоПодДоСП.ПревышениеСуперплана;
				//Стр.СКВ_ПоПодразделениямДоСП  = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП +тзСКВпоПодДоСП.СКВот1БПдо2БП //20141110 //КС удалится ниже
			КонецЕсли;	
			
			Если ЭтоВариант20121001 Тогда
				Если ЭтоВариант20150901 и Стр.Подразделение.НеПроверятьЛичныеЗаявки = Ложь  Тогда
			//	Если ЭтоВариант20150901 и (уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",Стр.Руководитель, ДатаКонца,0)>0 или Стр.Подразделение.Наименование = "Ведущие менеджеры")  Тогда
					Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП; //КС не вычитается
					//Стр.СуммаВознаграждения_РОП - считается по агентам выше
				Иначе
					Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП-Стр.СКВ_КС;	
					Если ЭтоВариант20170901 и (уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",Стр.Руководитель, ДатаКонца,0)>0 
						или Стр.Подразделение.Код = "000000024" 
						или Стр.Подразделение.Наименование = "Ведущие менеджеры" 
						или Стр.Подразделение.Наименование = "Ведущие специалисты по работе с VIP клиентами") Тогда
						//Процент посчитан выше
					Иначе	
						Если Стр.СхемаВознагражденияРуководителяОП<>Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
							Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ПоПодразделениямДоСП) * Стр.СтавкаВознаграждения_РОП / 100;
							Если ЭтоВариант20171001 = ЛОЖЬ Тогда
								Стр.СуммаВознаграждения_РОП= Стр.СуммаВознаграждения_РОП+тзСКВпоПодДоСП.БОНУС_РОП_КС;
							Иначе
								//Добавлено в строке менеджера в сумме РОП
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				
			ИначеЕсли ЭтоВариант20120401 Тогда
				//Расчет уже скорректирован выше
			Иначе	
				Стр.СуммаВознаграждения_РОП		= Стр.СКВ_ПоПодразделениямДоСП * Стр.СтавкаВознаграждения_РОП / 100;
			Конецесли;	
			Стр.БОНУС_РОП_КС_ = тзСКВпоПодДоСП.БОНУС_РОП_КС;
			Стр.ИтогоЗПпоПодразделению		= тзСКВпоПодДоСП.ИтогоЗП;//!!!Добавить КС?
		КонецЕсли;
		Если  НЕ Стр.РуководительПолучаетВознаграждение Тогда
			Стр.СуммаВознаграждения_РОП = 0;
		Иначе
			Если РольДоступна("ПолныеПрава") и Стр.Руководитель = Менеджер  тогда
				Сообщить("-------------");
				Сообщить(Стр.Подразделение);
				Сообщить("Сборы в план "+Стр.СКВ_ПоПодразделениямДоСП);
				Сообщить("Ставка "+Стр.СтавкаВознаграждения_РОП);
				
				Если Не Стр.БОНУС_РОП_КС_ = 0 Тогда
					Сообщить("Сборы по КС "+Стр.СКВ_КС);
					Сообщить("Бонус КС "+Стр.БОНУС_РОП_КС_);
				КонецЕсли;	
				Сообщить("Итого "+Стр.СуммаВознаграждения_РОП);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	ТЗАгентов.Сортировать("Подразделение,Агент");
	ТЗАгентов.Колонки.БОНУС_РОП_КС.Имя = "БОНУС_РОП_КС_";
	тзСуммыПлановПоСКВ_ПоОрганизации = тзПодразделений.Скопировать(,"Организация,Подразделение,СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП,СуммаВознаграждения_ЗамРОП, СуммаКоличествоПлан");	
	тзСуммыПлановПоСКВ_ПоОрганизации.Свернуть("Организация", "СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП,СуммаВознаграждения_ЗамРОП, СуммаКоличествоПлан");
	
	Для Каждого Стр ИЗ тзПодразделений Цикл
		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоОрганизации.Найти(Стр.Организация,"Организация");
		Если СтрокаСуммыПлана <> Неопределено Тогда
			Стр.СуммаПланаОрг				= СтрокаСуммыПлана.СуммаПлана;
			Стр.СуммаКоличествоПланОрг		= СтрокаСуммыПлана.СуммаКоличествоПлан;
			Стр.ИтогоЗПОрг					= СтрокаСуммыПлана.ИтогоЗПпоПодразделению;
			Стр.СуммаВознаграждения_РОПОрг	= СтрокаСуммыПлана.СуммаВознаграждения_РОП;
			Стр.СуммаВознаграждения_ЗамРОПОрг	= СтрокаСуммыПлана.СуммаВознаграждения_ЗамРОП;
			
		КонецЕсли;
	КонецЦикла;	
	//
	
	Если ФильтрПоМенеджеру Тогда
		Для Каждого Стр из ТЗАгентов Цикл
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			Если Стр.Агент = Менеджер и Стр.ЭтотАгентЕстьВТЗ1 = ЛОЖЬ Тогда
				ДобавитьПустышку(тз1,Стр);
				//НовОплата					= ТЗ1.Добавить();
				//НовОплата.Агент 			= Стр.Агент;		
				//НовОплата.Подразделение		= Стр.Подразделение;
				//НовОплата.Организация 		= Стр.Подразделение.Владелец;
				//НовОплата.Пустышка			= Истина;
				//тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Стр.Подразделение.Владелец, Стр.Подразделение, Стр.Агент);
				//Если тз.Количество() > 0 Тогда
				//	СхемаРасчета = тз[0].СхемаРасчета;
				//Иначе
				//	СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
				//	Сообщить("Ошибка при получении вида расчета с менеджером."+Стр.Агент,СтатусСообщения.ОченьВажное);
				//	//Возврат  ВознаграждениеМенеджера;
				//КонецЕсли;
				//НовОплата.СхемаРасчетаСМенеджером = СхемаРасчета;
				//НовОплата.УАгентаПланПоСКВ	= СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
				//Стр.УАгентаПланПоСКВ		= НовОплата.УАгентаПланПоСКВ;
				//тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
				//Если тз.Количество() > 0 Тогда
				//	Стр.План = тз[0].План;
				//	Если Стр.План = 0 Тогда
				//		Стр.Количество = тз[0].Количество;
				//	КонецЕсли;
				//Иначе
				//	Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
				//КонецЕсли;
				//НовОплата.СКВ = 0;
				//НовОплата.КоличествоФакт = 0;
				//НовОплата.ОплаченоФакт = 0;
				//НовОплата.НачисленнаяСуммаВзноса = 0;
				//НовОплата.СкидкаВыплаченаяКлиенту = 0;
				//НовОплата.КВСумма = 0;
				//НовОплата.КВСуммаДляАгента = 0;
				//НовОплата.ВознаграждениеМенеджера = 0;
				//НовОплата.ВычетСАгента = 0;
				//НовОплата.АВилиСкидкаСумма  = 0;
				//НовОплата.Ед = 0;
			КонецЕсли;
		КонецЦикла;	
		Для каждого СтрокаП  из тзПодразделений Цикл
			Если НЕ СтрокаП.Руководитель = Менеджер Тогда
				//		СтрокаП.Пустышка = Истина
				МассивСтрок = ТЗ1.НайтиСтроки(Новый Структура("Подразделение",СтрокаП.Подразделение));
				Всего = МассивСтрок.Количество();
				Для сч = 0 по Всего-1 Цикл
					Строка1 = МассивСтрок[сч];
					Если Строка1.Агент <> Менеджер Тогда
						//Строка1.НеВыводить = 1;
						Если Строка1.Куратор=Менеджер  Тогда
							
						Иначе
							Строка1.НеВыводить = 1;
							Строка1.СКВ = 0;
							Строка1.КоличествоФакт  = 0;
							Строка1.КоэффициентВида = 0;
							Строка1.НовыйКлиент = 0;							
							Строка1.НовыйКлиентСКВ = 0;							
							
							Строка1.ОплаченоФакт = 0;
							Строка1.НачисленнаяСуммаВзноса = 0;
							Строка1.СкидкаВыплаченаяКлиенту = 0;
							Строка1.КВСумма = 0;
							Строка1.КВСуммаДляАгента = 0;
							Строка1.ВознаграждениеМенеджера = 0;
							Строка1.ВознаграждениеДоп = 0;
							Строка1.ПартнерскоеВознаграждение = 0;
							Строка1.ВычетСАгента = 0;
							Строка1.АВилиСкидкаСумма  = 0;
							//Строка1.ПолнаяПремия = 0;
							Строка1.ВМРасчетное  = 0;
						КонецЕсли;
					Иначе
						
						
						
					КонецЕсли;	
				КонецЦикла;	
			Иначе
				
			КонецЕсли;	
			//		
		КонецЦикла;	
		//Для каждого СтрокаА  из тзАгентов Цикл
		//	Если НЕ СтрокаА.Агент = Менеджер Тогда
		//		СтрокаА.Пустышка = Истина
		//	КонецЕсли;	
		//		
		//КонецЦикла;	
		
		
		//Для каждого Строка1  из тз1 Цикл
		//	Если НЕ Строка1.Агент = Менеджер Тогда
		//		Строка1.НеВыводить = Истина;
		//	КонецЕсли;	
		//КонецЦикла;	
	КонецЕсли;	
	//Корпоративное
	Кол = ТзАгентов.Колонки;
	Кол.Добавить("ВМПоИнтервалам",		ОписаниеТипаЧисло14_2_но);
	
	тзПоИнтерваламСКВ = тз1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ));
	Если тзПоИнтерваламСКВ.Количество()> 0 Тогда
		
		Запрос = Новый Запрос("Выбрать * ПОМЕСТИТЬ Оплаты из &ТЗ как Оплаты
		|;
		|   Выбрать * 
		|   ПОМЕСТИТЬ ДействующиеДипазоны
		|   из РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
		|   ;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|     Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
		|	  Иначе
		|	 	ОПЛАТЫ.Интервалы
		|     Конец как НаборИнтерваловДляМенеджера,
		|	  ОПЛАТЫ.Агент КАК менеджер,
		|	  ОПЛАТЫ.Подразделение КАК Подразделение,
		|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
		|	ПОМЕСТИТЬ ДанныеПоМенеджерам
		|	ИЗ
		|	  Оплаты КАК ОПЛАТЫ
		|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
		|       ПО ИСТИНА
		|	ГДЕ
		|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
		|	СГРУППИРОВАТЬ ПО
		|	  ОПЛАТЫ.Агент,Оплаты.Подразделение,
		|	  Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
		|	  Иначе
		|		ОПЛАТЫ.Интервалы
		|     Конец
		//|	;
		//|	Выбрать * из ДанныеПоМенеджерам//Для Проверки
		|	;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|     Оплаты.Подразделение как Подразделение,
		|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляРОП
		|	  Иначе
		|	 	ОПЛАТЫ.ИнтервалыРОП
		|     Конец КАК НаборИнтерваловРОП,
		|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник КАК РОП,
		|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
		|	ПОМЕСТИТЬ ДанныеПоРОП
		|	ИЗ
		|	  Оплаты КАК ОПЛАТЫ
		|	  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_РуководителиПодразделенийСрезПоследних
		|	  ПО ОПЛАТЫ.Подразделение = уб_РуководителиПодразделенийСрезПоследних.Подразделение
		|	   И (уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство = ИСТИНА)
		|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
		|       ПО ИСТИНА
		|	ГДЕ
		|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
		|	СГРУППИРОВАТЬ ПО
		|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник, Оплаты.Подразделение,
		|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляРОП
		|	  Иначе
		|	 	ОПЛАТЫ.ИнтервалыРОП
		|     Конец
		//|	;
		//|	Выбрать * из ДанныеПоРОП//Для Проверки
		|	;
		|	ВЫБРАТЬ
		|	  уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
		|	  уб_ИнтервалыЗначенийИнтервалы.Начало,
		|	  уб_ИнтервалыЗначенийИнтервалы.Окончание,
		|	  уб_ИнтервалыЗначенийИнтервалы.Значение
		|	ПОМЕСТИТЬ Диапазоны
		|	ИЗ
		|	  Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
		|		
		//|  ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		////|	уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
		//|	уб_ИнтервалыЗначенийИнтервалы.Начало,
		//|	уб_ИнтервалыЗначенийИнтервалы.Окончание,
		//|	уб_ИнтервалыЗначенийИнтервалы.Значение
		//|ПОМЕСТИТЬ ДиапазоныРОП
		//|ИЗ
		//|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
		//|	ПО уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.ИнтервалыДляРОП = уб_ИнтервалыЗначенийИнтервалы.Ссылка
		|;
		
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|	ДанныеПоМенеджерам.Подразделение,
		|	ДанныеПоМенеджерам.менеджер,
		|	ДанныеПоМенеджерам.СКВ,
		|	Диапазоны.Начало,
		|	Диапазоны.Окончание,
		|	Диапазоны.Значение КАК ПроцентИнтервала,
		|	ВЫБОР
		|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
		|	    ТОГДА ВЫБОР
		|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
		|	            И НЕ Диапазоны.Окончание = 0
		|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
		|	    КОНЕЦ * Диапазоны.Значение / 100
		|     ИНАЧЕ 0
		|	КОНЕЦ КАК Доплата,
		|   ВЫБОР
		|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
		|	    ТОГДА ВЫБОР
		|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
		|	            И НЕ Диапазоны.Окончание = 0
		|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
		|	    КОНЕЦ 
		|     ИНАЧЕ 0
		|	КОНЕЦ КАК БАЗА,
		|	ИСТИНА КАК ЭтоВМ
		|	ПОМЕСТИТЬ ПромежуточныеРасчеты
		|	ИЗ
		|	ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
		|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
		|	ПО ДанныеПоМенеджерам.НаборИнтерваловДляМенеджера = Диапазоны.НаборИнтервалов
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	ДанныеПоРОП.Подразделение,
		|	ДанныеПоРОП.РОП,
		|	ДанныеПоРОП.СКВ,
		|	Диапазоны.Начало,
		|	Диапазоны.Окончание,
		|	Диапазоны.Значение,
		|	ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
		|	ТОГДА ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
		|	И НЕ Диапазоны.Окончание = 0
		|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
		|	КОНЕЦ * Диапазоны.Значение / 100
		|ИНАЧЕ 0
		|	КОНЕЦ,
		|ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
		|	ТОГДА ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
		|	И НЕ Диапазоны.Окончание = 0
		|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
		|	КОНЕЦ 
		|ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЛОЖЬ
		|	ИЗ
		|	ДанныеПоРОП КАК ДанныеПоРОП
		|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
		|	ПО ДанныеПоРОП.НаборИнтерваловРОП = Диапазоны.НаборИнтервалов
		|	;
		|   Выбрать * из ПромежуточныеРасчеты 
		|	;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|	   ПромежуточныеРасчеты.менеджер,
		|	   ПромежуточныеРасчеты.Подразделение,
		|	   ВЫБОР
		|	   КОГДА ДанныеПоМенеджерам.СКВ = 0
		|		  ТОГДА 0
		|	   КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
		|				И ПромежуточныеРасчеты.ЭтоВМ
		|		  ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
		|	   ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
		|	   КОНЕЦ КАК ВМ,
		|	   ВЫБОР
		|	     КОГДА ПромежуточныеРасчеты.ЭтоВМ
		|	      ТОГДА ДанныеПоМенеджерам.СКВ
		|      ИНАЧЕ ДанныеПоРОП.СКВ
		|	   КОНЕЦ КАК СКВ,
		|	   ВЫБОР
		|	     КОГДА ДанныеПоМенеджерам.СКВ = 0
		|	       ТОГДА 0
		|        ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|	        КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
		|	           И ПромежуточныеРасчеты.ЭтоВМ
		|	         ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
		|           ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
		|	        КОНЕЦ * 100 / ДанныеПоМенеджерам.СКВ КАК ЧИСЛО(15, 1))
		|	   КОНЕЦ КАК ВМПроцент,
		|	   ВЫРАЗИТЬ(ВЫБОР
		|	               КОГДА ДанныеПоМенеджерам.СКВ = 0
		|	                 ТОГДА 0
		|                  ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ
		|	            КОНЕЦ КАК ЧИСЛО(15, 1)) КАК ВМПроцентБезКоррекции,
		|	    ВЫБОР
		|	      КОГДА ПромежуточныеРасчеты.ЭтоВМ = ИСТИНА
		|	        ТОГДА ""ВМ""
		|         ИНАЧЕ ""РОП""
		|	    КОНЕЦ КАК ВидВознаграждения
		|	ИЗ
		|	ПромежуточныеРасчеты КАК ПромежуточныеРасчеты
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
		|	ПО (ДанныеПоМенеджерам.менеджер = ПромежуточныеРасчеты.менеджер)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоРОП КАК ДанныеПоРОП
		|	ПО (ДанныеПоРОП.РОП = ПромежуточныеРасчеты.менеджер)
		|	
		|	СГРУППИРОВАТЬ ПО
		|	ПромежуточныеРасчеты.менеджер,
		|	ПромежуточныеРасчеты.Подразделение,
		|	ДанныеПоМенеджерам.СКВ,
		|	ДанныеПоРОП.СКВ,
		|	ПромежуточныеРасчеты.ЭтоВМ");
		Если тзПоИнтерваламСКВ.Колонки.Найти("РасчетыПоДокументу")<>Неопределено Тогда
			тзПоИнтерваламСКВ.Колонки.Удалить("РасчетыПоДокументу");
		КонецЕсли;
		
		Если тзПоИнтерваламСКВ.Колонки.Найти("УслугиПоДокументу")<>Неопределено Тогда
			тзПоИнтерваламСКВ.Колонки.Удалить("УслугиПоДокументу");	
		КонецЕсли;
		
		
		Запрос.УстановитьПараметр("тз",тзПоИнтерваламСКВ);
		Запрос.УстановитьПараметр("ЗарплатныйПериод",ЗарплатныйПериод);
		Запрос.УстановитьПараметр("МинПроцент",10);
		
		
		МассивПакетов = Запрос.ВыполнитьПАкет();
		ВсегоЗапросов = МассивПакетов.Количество();
		Выборка = МассивПакетов[ВсегоЗапросов-1].Выбрать();
		//
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Менеджер) Тогда
				Продолжить;
			КонецЕсли;	
			массивСтрок = ТзАгентов.НайтиСтроки(Новый Структура("Агент",Выборка.Менеджер));
			Если массивСтрок.Количество()=0 Тогда
				Если Уб_Кэшируемые.ДоступностьРоли("ПолныеПрава") Тогда
					Сообщить("Не найден менеджер в таблице агентов "+Выборка.Менеджер);
				КонецЕсли;	
			Иначе	
				СтрокаАгента = массивСтрок[0];
				Если Выборка.ВидВознаграждения = "ВМ" Тогда
					СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
					ДобавитьПустышку(тз1,СтрокаАгента,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ);
					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				ИначеЕсли Выборка.ВидВознаграждения = "РОП" Тогда
					//СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
					СтрокаАгента.ВознаграждениеРуководителя = СтрокаАгента.ВознаграждениеРуководителя+Выборка.ВМ;
					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				КонецЕсли;	
			КонецЕсли;		
			Если Выборка.ВидВознаграждения = "РОП" Тогда
				//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				СтрокаПодразделения				= тзПодразделений.Найти(Выборка.Подразделение,"Подразделение");
				Если СтрокаПодразделения <> Неопределено Тогда
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Выборка.ВМ;
					СтрокаПодразделения.СуммаВознаграждения_РОПОрг = СтрокаПодразделения.СуммаВознаграждения_РОПОрг+Выборка.ВМ;
				КонецЕсли;	
			КонецЕсли;			
		КонецЦикла;	
		ТЗИнтервалов = МассивПакетов[ВсегоЗапросов-2].Выгрузить();
	Иначе
		ТЗИнтервалов = Новый  ТаблицаЗначений;
	КонецЕсли;	
	//---Корпоративное
	
	//+++ Прочие виды по ТЧ Начислений в оплате
	Запрос = Новый Запрос;
	//---
	
	
	//Условно
	//Сверка вознаграждения в оплате
	Если ПерезаполнитьВМ И ВРеальномВремени Тогда
		#Если Клиент Тогда
			Состояние(стрСостояние+". Распределение вознаграждения по оплатам");
		#КонецЕсли
		
		
		СчетчикОплат = 0;
		
		ВсегоМассив = тз1.Количество();
		Этап = Этап+1;
		Для каждого Строка1  из тз1 Цикл
			
			#Если Клиент Тогда
				Если СчетчикОплат%5 = 0 Тогда
					Состояние(стрСостояние+". Этап: " + Этап + ". Распределение вознаграждения по оплатам (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + "%)");
				КонецЕсли;
				СчетчикОплат = СчетчикОплат+1;
			#КонецЕсли
			Если НЕ Строка1.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
				Продолжить;
			КонецЕсли;	
			_этоКС = (Строка1.ЭтоКрупнаяСделка = Истина) ;
			__СКВ = Строка1.СКВ;
			_вм = тзАгентов.НайтиСтроки(Новый Структура("Агент",Строка1.Агент))[0];
			_ВознаграждениеМенеджера = ?(Строка1.ВМРасчетное=Неопределено,0,Строка1.ВМРасчетное);
			
			__ВознаграждениеМенеджера = Окр(?(_вм.ИтогоЗП=0 ИЛИ _этоКС ИЛИ (_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС)=0,0,_вм.ИтогоЗП*__СКВ/(_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС))+?(Строка1.ВознаграждениеМенеджера<0,Строка1.ВознаграждениеМенеджера,0)+
			?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.БОНУС_КС_*__СКВ/_вм.СКВ_КС),2);
			//__ВознаграждениеМенеджера = Окр(__ВознаграждениеМенеджера, 2);
			Если _ВознаграждениеМенеджера <> __ВознаграждениеМенеджера Тогда
				__ДоходБрокера = __СКВ - __ВознаграждениеМенеджера; //Удержание за косяки
				ОП = Строка1.Ссылка.ПолучитьОбъект();
				ОП.ДополнительныеСвойства.Вставить("ОтключенКонтрольПериодов",Истина);
				УстановитьЗначение(ОП.ДБ, 			__ДоходБрокера);
				УстановитьЗначение(ОП.ВМРасчетное, 	__ВознаграждениеМенеджера);
				ОП.Записать();
				#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	
КонецПроцедуры


Процедура ВывестиОтчет(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаОтчета, тзАгентовДляРаскраски = Неопределено,ТЗИнтервалов) Экспорт
	ЭтоВариант20200201 = ЗарплатныйПериод >= Дата(2019,1,1);
	ЭтоВариант20200301 = ЗарплатныйПериод >= Дата(2020,3,1) или НовыйРегламент; //ОП НБ
	ЭтоВариант20200401 = ЗарплатныйПериод >= Дата(2020,4,1) или НовыйРегламентРОП; //РОП НБ
	
	Если  ЭтоВариант20200301 или ЭтоВариант20200401 Тогда

		ВывестиОтчет2020(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаОтчета, тзАгентовДляРаскраски,ТЗИнтервалов);
		Возврат;
	КонецЕсли;	
	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	//пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
	//пВидЕКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО;
	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
	ОтображатьКолонкиДляСхемыПланПоСКВ = Истина;//ВСЕГДА ВЫВОДИМ
	ЗапросВыводРасчетаВМ = Новый Запрос;
	//Создаем временные таблицы 
	ЗапросВыводРасчетаВМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТЗ1.Колонки.ЕстьПланПоСКВ.Имя = "АгентРаботаетПоПлануПоСКВ";
	ЭтоПолныеПрава = ПолныеПрава();
	Этап = Этап + 1;
	#Если Клиент Тогда
		Состояние(" Этап: " + Этап + " из " + КоличествоЭтапов + " - Подготовка к расчету итогов");
	#КонецЕсли
	//Необходимо переименовать колонки, которые есть в обеих таблицах, 
	//иначе будут задвоения при объединении таблиц
	ТзАгентов.Колонки.ВознаграждениеМенеджера.Имя = "ВознаграждениеМенеджера_ТАгентов";
	ТзАгентов.Колонки.ВознаграждениеДоп.Имя = "ВознаграждениеДоп_ТАгентов";
	ТзАгентов.Колонки.ВычетСАгента.Имя = "ВычетСАгента_ТАгентов";
	ТЗАгентов.Колонки.Агент.Имя			= "Агент_ТАгентов";
	ТЗАгентов.Колонки.Подразделение.Имя = "Подразделение_ТАгентов";
	ТЗАгентов.Колонки.ЕстьПланПоСКВ.Имя = "РаботаетПоПлануПоСКВ_ТАгентов";
	ТЗАгентов.Колонки.Удалить("СКВ_КС");
	//ТЗАгентов.Колонки.Удалить("СКВ_Прол");
	ТЗАгентов.Колонки.СКВ_Прол.Имя ="СКВ_Прол_Агенты";
	//Для каждого Колонка из ТЗАгентов.Колонки цикл
	//	Если Найти(Колонка.Имя,"_ТАгентов")= 0 Тогда
	//		Сообщить(Колонка.Имя);
	//	КонецЕсли;
	//КонецЦикла;	
	//тзПодразделений.Колонки.Удалить("СКВ_КС");
	тзПодразделений.Колонки.СКВ_КС.Имя ="СКВ_КС_Подразделения";
	тзПодразделений.Колонки.Подразделение.Имя = "Подразделение_ТПодразделений";
	тзПодразделений.Колонки.СуммаДБ.Имя = "СуммаДБПодразделение";
	
	Для каждого СтрокаТЗ1 из ТЗ1 Цикл
		Если ТипЗнч(СтрокаТЗ1.ВознаграждениеДоп)<>Тип("Число") Тогда
			СтрокаТЗ1.ВознаграждениеДоп = 0;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ТолькоПоАгенту и ЗначениеЗаполнено(Менеджер) Тогда
		ТЗТолькоАгент   = ТЗ1.Скопировать(Новый Структура("Агент",Менеджер),"Агент,Куратор,СКВ,СКВ_Прол,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация");
		ТЗТолькоКуратор = ТЗ1.Скопировать(Новый Структура("Куратор",Менеджер),"Агент,Куратор,СКВ,СКВ_Прол,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация");
		Для Каждого СтрокаДляКуратора Из ТЗТолькоКуратор Цикл
			ТЗТолькоАгентДоп = ТЗТолькоАгент.Добавить();
			ЗаполнитьЗначенияСвойств(ТЗТолькоАгент,СтрокаДляКуратора);
		КонецЦикла;
		ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗ",ТЗТолькоАгент);
	Иначе	
		ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗ", ТЗ1.Скопировать(,"Агент,Куратор,СКВ,СКВ_Прол,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация"));
	КонецЕсли;	
	Для каждого СтрокаА из ТЗАгентов Цикл
		Если ТипЗнч(СтрокаА.СуммаДб)<>Тип("Число") Тогда
			СтрокаА.СуммаДб = 0;
		КонецЕсли;	
	КонецЦикла;	
	
	ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗАгентов", ТЗАгентов);
	ЗапросВыводРасчетаВМ.УстановитьПараметр("тзПодразделений", тзПодразделений);
	
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП";
//	ЗапросВыводРасчетаВМ.Выполнить();
	
	ЗапросВыводРасчетаВМ.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП
	|;
	|ВЫБРАТЬ
	//|	IsNull(ТАгентов.План,0) как План,
	//|	IsNull(ТАгентов.Количество,0) как Количество,
	//|	IsNull(ТАгентов.СуперПлан,0) как СуперПлан,
	//|   IsNull(ТАгентов.ПерваяБонусПланка,0) как ПерваяБонусПланка,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаДоПлана,0) как ПроцентнаяСтавкаДоПлана,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеПлана,0) как ПроцентнаяСтавкаПослеПлана,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеПервойБонусПланки,0) как ПроцентнаяСтавкаПослеПервойБонусПланки,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеСуперПлана,0) как ПроцентнаяСтавкаПослеСуперПлана,
	//|	IsNull(ТАгентов.ВыполненПланПоСКВ,0) как ВыполненПланПоСКВ,
	//|	IsNull(ТАгентов.СКВ_ДляПланаПоСКВ_ПоАгенту,0) как СКВ_ДляПланаПоСКВ_ПоАгенту,
	//|	IsNull(ТАгентов.КоличествоФакт_ПоАгенту,0) как КоличествоФакт_ПоАгенту,
	//|	IsNull(ТАгентов.ПроцентВыполненияПлана,0) как ПроцентВыполненияПлана,
	//|	IsNull(ТАгентов.СтавкаВознаграждения,0) как СтавкаВознаграждения,
	//|	IsNull(ТАгентов.СКВдоПлана,0) как СКВдоПлана, //+Новые промежуточные расчеты
	//|	IsNull(ТАгентов.СКВотПланадо1БП,0) как СКВотПланадо1БП,
	//|	IsNull(ТАгентов.СКВот1БПдо2БП,0) как СКВот1БПдо2БП, 
	//|	IsNull(ТАгентов.СКВСвыше2БП,0) как СКВСвыше2БП,  
	//|	IsNull(ТАгентов.ЗПдоПлана,0) как ЗПдоПлана,
	//|	IsNull(ТАгентов.ЗПотПланадо1БП,0) как ЗПотПланадо1БП,
	//|	IsNull(ТАгентов.ЗПот1БПдо2БП,0) как ЗПот1БПдо2БП, 
	//|	IsNull(ТАгентов.ЗПСвыше2БП,0) как ЗПСвыше2БП, //-Новые промежуточные расчеты
	//|	IsNull(ТАгентов.ЗПотСКВдоСуперПлана,0) как ЗПотСКВдоСуперПлана,
	//|	IsNull(ТАгентов.ЗПЗаПревышение1БП,0) как ЗПЗаПревышение1БП,
	//|	IsNull(ТАгентов.ПревышениеСуперплана,0) как ПревышениеСуперплана,
	//|	IsNull(ТАгентов.ЗПотЗаПревышениеСуперПлана,0) как ЗПотЗаПревышениеСуперПлана,
	//|	IsNull(ТАгентов.ИтогоЗП,0) как ИтогоЗП,
	//|	IsNull(ТАгентов.ВознаграждениеРуководителя,0) как ВознаграждениеРуководителя,
	//|	IsNull(ТАгентов.ВМПоИнтервалам,0) как ВМПоИнтервалам,
	|   Выбор КОГДА ТСписокОплатЗаПериод.Пустышка=Истина //и ТСписокОплатЗаПериод.СхемаРасчетаСМенеджером=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ) 
	|         Тогда IsNull(ТАгентов.ИтогоЗП,0) иначе 0 Конец Как ИтогоЗП,
	|   Выбор КОГДА ТСписокОплатЗаПериод.Пустышка=Истина //и ТСписокОплатЗаПериод.СхемаРасчетаСМенеджером=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ) 
	|         Тогда IsNull(ТАгентов.ВМПоИнтервалам,0) иначе 0 Конец Как ВМПоИнтервалам,
	|	ТАгентов.*,
	//|	IsNull(ТПодразделений.ИтогоЗПОрг,0) как ИтогоЗПОрг,
	//|	IsNull(ТПодразделений.СуммаПланаОрг,0) как СуммаПланаОрг,
	//|	IsNull(ТПодразделений.СуммаПлана,0) как СуммаПлана,
	//|	IsNull(ТПодразделений.СуммаКоличествоПланОрг,0) как СуммаКоличествоПланОрг,
	//|	IsNull(ТПодразделений.СуммаКоличествоПлан,0) как СуммаКоличествоПлан,
	|	ТПодразделений.*,
	|	ТСписокОплатЗаПериод.*
	|   
	|ПОМЕСТИТЬ ТСписокОплат
	|ИЗ
	|	ТСписокОплатЗаПериод КАК ТСписокОплатЗаПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТПодразделений КАК ТПодразделений
	|		ПО ТСписокОплатЗаПериод.Подразделение = ТПодразделений.Подразделение_ТПодразделений
	//	   И ТСписокОплатЗаПериод.Пустышка = ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАгентов КАК ТАгентов
	|		ПО ТСписокОплатЗаПериод.Агент = ТАгентов.Агент_ТАгентов
	|          И ТСписокОплатЗаПериод.Пустышка = ИСТИНА
	|;
	|ВЫБРАТЬ * ИЗ ТСписокОплат
	//|СГРУППИРОВАТЬ ПО ТСписокОплат.СхемаРасчетаСМенеджером
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение.Родитель.Наименование,
	|	Подразделение.Наименование,
	|	Агент.Наименование, СхемаРасчетаСМенеджером,
	|	ВидСП, 
	//|   НомерЗаявки
	|	Дата
	|ИТОГИ
	//ИЗ ОПЛАТ
	|	Минимум(Пустышка),
	|	Сумма(НеВыводить),
	|	СУММА(ВознаграждениеМенеджера),
	|	СУММА(ВознаграждениеДоп),	
	|	СУММА(ПартнерскоеВознаграждение),
	|	СУММА(СКВ),
	|	СУММА(СКВ_Прол),
	|	СРЕДНЕЕ(СКВ_Прол_Агенты),
	|	СРЕДНЕЕ(СКВ_КС_Подразделения),
	|	СУММА(СКВ_КС),
	|	СУММА(БОНУС_КС),
	|	СУММА(НачисленнаяСуммаВзноса),
	|	СУММА(ОплаченоФакт),
	|	СУММА(КВСуммаДляАгента),
	|	СУММА(АВилиСкидкаСумма),
	|	СУММА(ЕД),
	|	СУММА(ВычетСАгента),
	//| ИЗ ТЗ АГЕНТОВ
	|	Минимум(План),
	|	Минимум(ШтрафнойПлан),
	|	Сумма(Количество),
	|	Минимум(СуперПлан),
	|	Минимум(ПерваяБонусПланка),
    |	Минимум(ПроцентнаяСтавкаДоПлана),
	|	Минимум(ПроцентнаяСтавкаПослеПлана),
	|	Минимум(ПроцентнаяСтавкаПослеПервойБонусПланки),
	|	Минимум(ПроцентнаяСтавкаПослеСуперПлана),
	|	Минимум(ВыполненПланПоСКВ),
	|	Сумма(СКВ_ДляПланаПоСКВ_ПоАгенту),
	|	Сумма(КоличествоФакт_ПоАгенту),
	|	Сумма(КоэффициентВида_ПоАгенту),	
	|	Сумма(НовыйКлиент_ПоАгенту),		
	|	Сумма(НовыйКлиентСКВ_ПоАгенту),			
	|	Сумма(КоэффициентВидаГод_ПоАгенту),		
    |	Минимум(ПроцентВыполненияПлана),
	|	Минимум(СтавкаВознаграждения),
	|	Сумма(СКВдоПлана), //+Новые промежуточные расчеты
	|	Сумма(СКВотПланадо1БП),
	|	Сумма(СКВот1БПдо2БП), 
	|	Сумма(СКВСвыше2БП),  
    |	Сумма(ЗПдоПлана),
	|	Сумма(ЗПотПланадо1БП),
	|	Сумма(ЗПот1БПдо2БП), 
	|	Сумма(ЗПСвыше2БП), //-Новые промежуточные расчеты
	|	Сумма(ДельтаКСРуководитель),
	|	Сумма(ЗПотСКВдоСуперПлана),
	|	Сумма(ЗП_Пролонгация),
	|	Сумма(ЗПЗаПревышение1БП),
	|	Сумма(ПревышениеСуперплана),
    |	Сумма(ЗПотЗаПревышениеСуперПлана),
	|	Сумма(ИтогоЗП),
	|	Сумма(ВознаграждениеРуководителя),
	|	Максимум(ПроцентРОП),  Максимум(СхемаВознагражденияРуководителяОП),Среднее(СуммаДБ),
	|	Сумма(ВМПоИнтервалам),
	//|	СРЕДНЕЕ(Сумма),
	//| ПОДРАЗДЕЛЕНИЯ 
	|	СРЕДНЕЕ(ИтогоЗПОрг),
	|	СРЕДНЕЕ(ИтогоЗПпоПодразделению),          
	|	СРЕДНЕЕ(СКВ_ПоПодразделениямДоСП),
	|	СРЕДНЕЕ(ПоказательМинимальногоПорога_РОП),
	|	СРЕДНЕЕ(ПоказательПлана_РОП),
	|	Минимум(ПроцентВыполненияПлана_РОП),
	|	Минимум(ПроцентнаяСтавкаДоМинимальногоПорога_РОП),
	|	Минимум(ПроцентнаяСтавкаДоПлана_РОП),
	|	Минимум(ПроцентнаяСтавкаПослеПлана_РОП),
	|	СРЕДНЕЕ(СтавкаВознаграждения_РОП),
	|	Сумма(СуммаВМ),
	|	СРЕДНЕЕ(СуммаВознаграждения_РОП),
	|	СРЕДНЕЕ(СуммаВознаграждения_РОПОрг),
	|	СРЕДНЕЕ(СуммаВознаграждения_ЗамРОП),
	|	СРЕДНЕЕ(СуммаВознаграждения_ЗамРОПОрг),
	|	СРЕДНЕЕ(СКВ_ДляПланаПоСКВ_ПоПодразделению),
	|	СРЕДНЕЕ(КоличествоФакт_ПоПодразделению),
	|	СРЕДНЕЕ(КоэффициентВида_ПоПодразделению),
	|	СРЕДНЕЕ(НовыйКлиент_ПоПодразделению),	
	|	СРЕДНЕЕ(НовыйКлиентСКВ_ПоПодразделению),		
	|	СРЕДНЕЕ(СуммаПлана),
	|	СРЕДНЕЕ(СуммаПланаОрг),
	|	СРЕДНЕЕ(СуммаКоличествоПлан),
	|	СРЕДНЕЕ(СуммаКоличествоПланОрг),
	|	СРЕДНЕЕ(КоличествоФакт),
	|	СРЕДНЕЕ(КоэффициентВида),	
	|	СРЕДНЕЕ(НовыйКлиент),		
	|	СРЕДНЕЕ(НовыйКлиентСКВ),			
	|	Сумма(БОНУС_РОП_КС)
	|ПО
	|	Организация,
	|	Подразделение,
	|	Агент,
	|	СхемаРасчетаСМенеджером,
	|	ВидСП";
	
	Этап=Этап+1;
	#Если Клиент Тогда
		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Расчет итогов");
	#КонецЕсли
	ТЗ2 = ЗапросВыводРасчетаВМ.Выполнить();	
	//Уничтожение временной таблицы
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплатЗаПериод ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТПодразделений ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТАгентов ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплат ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	цЖелтенький = Новый Цвет(255, 255, 153);
	Макет 	= ПолучитьМакет("Новый");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Если НЕ ВыводитьПримечанияКВМВячейки Тогда
		//	Макет.УдалитьОбласть(Макет.Область("СтолбецПримКВМ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	ВыводитьКС = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
	Если НЕ ВыводитьКС Тогда
		//	Макет.УдалитьОбласть(Макет.Область("КС"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	РежимДвухБП = ДатаНачала>=Дата(2012,12,1);
	Если РежимДвухБП Тогда
		//	Макет.УдалитьОбласть(Макет.Область("РасчетЗП"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	Иначе
		//	Макет.УдалитьОбласть(Макет.Область("РасчетЗП201212"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	ДБЕсть = Истина;
	Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДБ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		ДБЕсть = Ложь;
	КонецЕсли;		
	Если НЕ ОтображатьКолонкиДляСхемыПланПоСКВ Тогда
		//	Макет.УдалитьОбласть(Макет.Область("СхемаПлан1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("СхемаПлан"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	Если ОтображатьТолькоФамилии Тогда
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_3"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);		
		Если НЕ СкрыватьКолонкиДСП Тогда
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_4"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_5"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_6"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;		
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_7"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.Область("ЗаголовокВРежимеТолькоФамилии").Объединить();
		//	Макет.Область("ЗаголовокВРежимеТолькоФамилии").Текст = "Организация/Подразделение/Сотрудник";
	КонецЕсли; 
	Если СкрыватьКолонкиДСП Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДСП1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	Если СкрыватьКолонкиДСП ИЛИ ОтображатьТолькоФамилии Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДСП2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	Обл_Шапка = Макет.ПолучитьОбласть("Шапка|Основная");	
	Обл_Шапка_Вознаграждение = Макет.ПолучитьОбласть("Шапка|Вознаграждение");	
	Обл_Шапка_Взносы = Макет.ПолучитьОбласть("Шапка|Взносы");	
	Обл_Шапка_Доход = Макет.ПолучитьОбласть("Шапка|Доход");	
	Обл_Заголовок = Макет.ПолучитьОбласть("Заголовок|Основная");
	Обл_Заголовок_Вознаграждение = Макет.ПолучитьОбласть("Заголовок|Вознаграждение");	
	Обл_Заголовок_Взносы = Макет.ПолучитьОбласть("Заголовок|Взносы");	
	Обл_Заголовок_Доход = Макет.ПолучитьОбласть("Заголовок|Доход");	
	Обл_Заголовок.Параметры.ЗарплатныйПериод 	= Формат(ЗарплатныйПериод,"ДФ='ММMM yyyy'");
	Если РежимОтчета=1 И ДатаОтчета <>ДатаСреза1 Тогда
	Иначе
		ДокументРезультат.Вывести(Обл_Заголовок);
	КонецЕсли;
	Если РежимОтчета = 0  Тогда
		//Не понятно как удаляются области, как будто со смешением В обратном порядке???
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
		//	Обл_Шапка.УдалитьОбласть(Макет.Область("ШапкаВидСП"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
		Иначе
			Обл_Шапка.Параметры.Подразделение = Подразделение;
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(ВидСП) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),Смещать);
		Иначе
			Обл_Шапка.Параметры.ВидСП	= ВидСП;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Менеджер) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),Смещать);
		Иначе
			Обл_Шапка.Параметры.Менеджер = Менеджер;
		КонецЕсли;
	Иначе
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),		Смещать);
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),		Смещать);
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
	КонецЕсли;
	ДокументРезультат.ФиксацияСверху	= Обл_Шапка.ВысотаТаблицы + 1;
	
	Если ЗначениеЗаполнено(ДатаОтчета) Тогда
		ДатаВотчет  = "Состояние расчета ЗП на "+Формат(ДатаОтчета,"ДФ='dd.MM.yyyy HH:mm'");
	Иначе	
		ДатаВотчет = "Состояние расчета ЗП на текущую дату ("+Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm'")+")";
	КонецЕсли;	
	Обл_Шапка.Параметры.ДатаВотчет = ДатаВотчет;
	
	ДокументРезультат.Вывести(Обл_Шапка);
	Если ОтображатьТолькоФамилии = Ложь Тогда
		ДокументРезультат.Присоединить(Обл_Шапка_Вознаграждение);
	КонецЕсли;	
	ДокументРезультат.Присоединить(Обл_Шапка_Взносы);
	Если ДБЕсть Тогда
		ДокументРезультат.Присоединить(Обл_Шапка_Доход);
	КонецЕсли;	
	//ДокументРезультат.ФиксацияСверху = 8;
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	//
	
	ВыборкаОрг 	= ТЗ2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	СчНом = 0;
	ЧФ = "ЧЦ=14; ЧДЦ=2";
	ЧФ0 = "ЧЦ=14; ЧДЦ=2; ЧН=0";
	ЧФ000 = "ЧЦ=14; ЧДЦ=2; ЧН=";
	КФ = "ЧЦ=12; ЧДЦ=0";
	//////////////////// ОРГ \\\\\\\\\\\\\\\\\\\\\
	// заполнение строки макета ОРГ
	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
	ФильтрПоСпискуМенеджеров = СписокМенеджеров.Количество() > 0;
	ЭтоРуководитель = Ложь;
	Если ФильтрПоМенеджеру Тогда
		Уволен = Ложь;
		ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер, КонецМесяца(ЗарплатныйПериод), Истина,Уволен);
		Если ПодразделениеАгента = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
			ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер , НачалоМесяца(ЗарплатныйПериод), Ложь,Уволен);
		КонецЕсли;
		МЗ = тзПодразделений.Найти(ПодразделениеАгента,"Подразделение_ТПодразделений");
		Если МЗ = Неопределено Тогда
			МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), ПодразделениеАгента);
			Руководитель = МЗ.Сотрудник;
		Иначе
			Руководитель = МЗ.Руководитель;
		КонецЕсли;
		ЭтоРуководитель = Руководитель = Менеджер;
	КонецЕсли;
	Этап=Этап+1;
	#Если Клиент Тогда
		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Вывод отчета");
	#КонецЕсли
	
	Пока ВыборкаОрг.Следующий() Цикл
		Если ВыборкаОрг.Пустышка И НЕ ФильтрПоМенеджеру Тогда
			Продолжить;
		//ИначеЕсли ФильтрПоМенеджеру и   Тогда	
			
		КонецЕсли;
		ОблОрг = Макет.ПолучитьОбласть("Орг|Основная");
		ОблОрг_Вознаграждение = Макет.ПолучитьОбласть("Орг|Вознаграждение");	
		ОблОрг_Взносы = Макет.ПолучитьОбласть("Орг|Взносы");	
		ОблОрг_Доход = Макет.ПолучитьОбласть("Орг|Доход");	
		ОблОрг.Параметры.Организация	= "Организация: " + ВыборкаОрг.Организация;
		ЗПОбщееО = УстановитьПараметрыОбласти_Вознаграждение(ОблОрг_Вознаграждение.Параметры,ВыборкаОрг,"ИтогоЗПОрг",Истина);
		ОблОрг.Параметры.ОбщееЗП = ЗПОбщееО;
		ОблОрг.Параметры.СобранаяКВ	   = Формат(ВыборкаОрг.СКВ,ЧФ000);
		ОблОрг.Параметры.КоличествоФакт  = Формат(ВыборкаОрг.КоличествоФакт_ПоАгенту,КФ);
		ОблОрг.Параметры.КоэффициентВида  = Формат(ВыборкаОрг.КоэффициентВида_ПоАгенту,КФ);
		ОблОрг.Параметры.КоэффициентВидаГод  = Формат(ВыборкаОрг.КоэффициентВидаГод_ПоАгенту,КФ);
		ОблОрг.Параметры.НовыйКлиент  = Формат(ВыборкаОрг.НовыйКлиент_ПоАгенту,КФ);
		ОблОрг.Параметры.НовыйКлиентСКВ = "";//Формат(ВыборкаОрг.НовыйКлиентСКВ_ПоАгенту,КФ);
		
		
		
		УстановитьПараметрыОбласти_Взносы(ОблОрг_Взносы.Параметры,ВыборкаОрг,"ИтогоЗПОрг",Истина);
		Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
			ОблОрг.Параметры.План					= Формат(ВыборкаОрг.СуммаПланаОрг,ЧФ000);
			Если ВыборкаОрг.СуммаКоличествоПланОрг  = 0 Тогда
				ОблОрг.Параметры.КоличествоПлан		= "";
			Иначе
				ОблОрг.Параметры.КоличествоПлан		= Формат(ВыборкаОрг.СуммаКоличествоПланОрг,ЧФ000);
			КонецЕсли;
			ОблОрг.Параметры.ПроцентПлана			= Формат(?(ВыборкаОрг.СуммаПланаОрг=0,0,ВыборкаОрг.СКВ/ВыборкаОрг.СуммаПланаОрг*100),ЧФ0);
			
			ОблОрг_Вознаграждение.Параметры.ПроцентРуководителя	= Формат(ВыборкаОрг.СуммаВознаграждения_РОПОрг,ЧФ000);
			
		КонецЕсли;
		Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
			ОблОрг_Доход.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаОрг.СКВ - ЗПОбщееО - ?(ВыборкаОрг.СуммаВознаграждения_РОПОрг = Null, 0, ВыборкаОрг.СуммаВознаграждения_РОПОрг),ЧФ000);
		КонецЕсли;
		Если РольДоступна("уб_ЗП_ПолныйДоступ")= Истина и НЕ Менеджер.Наименование = "Банки.ру" Тогда //Итоги по компании
			ДокументРезультат.Вывести(ОблОрг,1,,Истина);
			Если ОтображатьТолькоФамилии = Ложь Тогда
				ДокументРезультат.Присоединить(ОблОрг_Вознаграждение);
			КонецЕсли;	
			ДокументРезультат.Присоединить(ОблОрг_Взносы);
			Если ДБЕсть Тогда
				ДокументРезультат.Присоединить(ОблОрг_Доход);
			КонецЕсли;	
		КонецЕсли;	
		ВыборкаПодраздел = ВыборкаОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаПодраздел.Следующий() Цикл			
			МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
			Если МЗ = Неопределено Тогда
				МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);
				РуководительПодразделения = МЗ.Сотрудник;
				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.ПолучаетВознаграждениеЗаРуководство;
			Иначе
				РуководительПодразделения = МЗ.Руководитель;
				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.РуководительПолучаетВознаграждение;
			КонецЕсли;
			//Если (ЗначениеЗаполнено(Подразделение) И ВыборкаПодраздел.Подразделение <> Подразделение)
			//	Или (СписокПодразделений <> Неопределено И СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) = Неопределено)
			//	Или (ФильтрПоМенеджеру И ВыборкаПодраздел.Пустышка И РуководительПодразделения <> Менеджер И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение)
			//	Или ВыборкаПодраздел.Пустышка
			//	Тогда
			//	Продолжить
			//КонецЕсли;		
			Если ФильтрПоМенеджеру Тогда
				Если ВыборкаПодраздел.Пустышка 
                     И РуководительПодразделения <> Менеджер 
					 И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение Тогда
					Продолжить;
				КонецЕсли;	
			Иначе
				Если ВыборкаПодраздел.Пустышка Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ВыводимСтрокуПодразделения = (ЭтоПолныеПрава ИЛИ 
										 РуководительПодразделения = ПараметрыСеанса.уб_ТекущееФизЛицо 
										 или (ПараметрыСеанса.уб_Константы.ЭтоМастерРуководитель и Найти(ВыборкаПодраздел.Подразделение,"М-ОП")>0)) и не Менеджер.Наименование = "Банки.ру" ;
			
			Если ВыводимСтрокуПодразделения Тогда
				НаименованиеПодразделения = //"Подразделение: "+
				ВыборкаПодраздел.Подразделение.Наименование + ?(Не ЗначениеЗаполнено(РуководительПодразделения),""," (" + РуководительПодразделения.Наименование + ")");
				ОблПодразделение = Макет.ПолучитьОбласть("Подразделение|Основная");
				ОблПодразделение_Вознаграждение = Макет.ПолучитьОбласть("Подразделение|Вознаграждение");	
				ОблПодразделение_Взносы = Макет.ПолучитьОбласть("Подразделение|Взносы");	
				ОблПодразделение_Доход = Макет.ПолучитьОбласть("Подразделение|Доход");	
				ОблПодразделение.Параметры.Подразделение	= НаименованиеПодразделения;
				Если Не ЭтоПолныеПрава=Истина Тогда
					//скрываем показатели подразделения
					РассчитатьПоказателиПодразделения = СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) <> Неопределено;
				Иначе
					РассчитатьПоказателиПодразделения = Истина
				КонецЕсли;
				Если РассчитатьПоказателиПодразделения Тогда
					
					ЗПОбщееП = УстановитьПараметрыОбласти_Вознаграждение(ОблПодразделение_Вознаграждение.Параметры,ВыборкаПодраздел,"ИтогоЗПпоПодразделению",Истина);
					ОблПодразделение.Параметры.ОбщееЗП = ЗПОбщееП;
					//Если ПолноеСКВ = Ложь Тогда
					//	//ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению,ЧФ000);
					//	ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ000);
					//	
					//Иначе	
					ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ,ЧФ000);
					//КонецЕсли;
					
					ОблПодразделение.Параметры.КоличествоФакт  = Формат(ВыборкаПодраздел.КоличествоФакт_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.КоэффициентВида  = Формат(ВыборкаПодраздел.КоэффициентВида_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.НовыйКлиент  = Формат(ВыборкаПодраздел.НовыйКлиент_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.НовыйКлиентСКВ  = "";//Формат(ВыборкаПодраздел.НовыйКлиентСКВ_ПоПодразделению,КФ);
					
					
					УстановитьПараметрыОбласти_Взносы(ОблПодразделение_Взносы.Параметры,ВыборкаПодраздел,"ИтогоЗПпоПодразделению",Истина);
					Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
						ОблПодразделение.Параметры.План				= Формат(ВыборкаПодраздел.СуммаПлана,ЧФ0);
						Если ВыборкаПодраздел.СуммаКоличествоПлан = 0 Тогда
							ОблПодразделение.Параметры.КоличествоПлан =	"";
						Иначе
							ОблПодразделение.Параметры.КоличествоПлан = Формат(ВыборкаПодраздел.СуммаКоличествоПлан,ЧФ000);
						КонецЕсли;
						ОблПодразделение.Параметры.ПроцентПлана     = Строка(Формат(ВыборкаПодраздел.ПроцентВыполненияПлана_РОП,ЧФ000));
						//!ОблПодразделение.Параметры.СКВдоСП			= Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ0);
						Если ВыводитьКС Тогда
							//!ОблПодразделение.Параметры.СКВ_КС		= Формат(ВыборкаПодраздел.СКВ_КС,ЧФ);
							//!ОблПодразделение.Параметры.БОНУС_РОП_КС = Формат(ВыборкаПодраздел.БОНУС_РОП_КС,ЧФ);
						КонецЕсли;	
						
						//МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
						//Если МЗ = Неопределено Тогда
						//	МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);//.Ссылка
						//КонецЕсли;
						
						ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,ВыборкаПодраздел.СтавкаВознаграждения_РОП,0);
						
						ОблПодразделение_Вознаграждение.Параметры.ПроцентРуководителя	= Формат(ВыборкаПодраздел.СуммаВознаграждения_РОП,ЧФ000);
						
						//!ОблПодразделение.Параметры.ПроцентОтСКВМенеджеру = Формат(ПроцентРуководителя,"");
					КонецЕсли;
					
					Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
						Если ВыборкаПодраздел.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
							ОблПодразделение_Доход.Параметры.СуммаДоходаБрокера = ВыборкаПодраздел.СуммаДБ+?(ЗПОбщееП<0,ЗПОбщееП,0);
						Иначе	
							
							ОблПодразделение_Доход.Параметры.СуммаДоходаБрокера	= Формат(?(ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению = Null, 0, ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению) - ЗПОбщееП - ?(ВыборкаПодраздел.СуммаВознаграждения_РОП = Null, 0, ВыборкаПодраздел.СуммаВознаграждения_РОП),ЧФ000);
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//область подразделения выводим позже
			ОбластьПодразделениеВыведено = Ложь;
			
			///////////////// МЕНЕДЖЕР \\\\\\\\\\\\\\\\\
			// заполнение строки макета МЕНЕДЖЕР	
			ВыборкаМенеджер = ВыборкаПодраздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаМенеджер.Следующий() Цикл
				Если ФильтрПоМенеджеру Тогда
					Если ВыборкаМенеджер.Агент = Менеджер Тогда
					ИначеЕсли ЭтоРуководитель Тогда
						КВыводу = ВыборкаМенеджер.ЕД-ВыборкаМенеджер.НеВыводить;
						Если КВыводу<0 Или (ФильтрПоСпискуМенеджеров=Истина и СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено) Тогда
							Продолжить;
						КонецЕсли;	
					Иначе
						КВыводу = ВыборкаМенеджер.ЕД-ВыборкаМенеджер.НеВыводить;
						Если КВыводу<0 Тогда
							Продолжить;
						КонецЕсли;
						//Продолжить;
					КонецЕсли;	
				ИначеЕсли ФильтрПоСпискуМенеджеров Тогда
					Если СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено Тогда
						Продолжить
					КонецЕсли;
				Иначе
					Если ВыборкаМенеджер.Пустышка И ВыборкаМенеджер.План = 0 Тогда //И НЕ ФильтрПоМенеджеру Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;	
				Если ВыводимСтрокуПодразделения и Не ОбластьПодразделениеВыведено  Тогда
					ДокументРезультат.Вывести(ОблПодразделение,2,,Истина);
					Если ОтображатьТолькоФамилии = Ложь Тогда
						ДокументРезультат.Присоединить(ОблПодразделение_Вознаграждение);
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОблПодразделение_Взносы);
					Если ДБЕсть Тогда
						ДокументРезультат.Присоединить(ОблПодразделение_Доход);
					КонецЕсли;	
					ОбластьПодразделениеВыведено = Истина;
					// расшифровка по руководителю
					УровеньРасшифровки = 3;//+?(ОднаСхема = ЛОЖЬ,1,0);
					Если ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП>0 и НовыйРегламент = ЛОЖЬ  Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ для расчета ЗП (до бонус-планки)";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаПодраздел.СтавкаВознаграждения_РОП;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП*ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП/100,2),ЧФ0); 
						
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;	
						
					КонецЕсли;
					Если (ВыборкаПодраздел.СКВот1БПдо2БП+ВыборкаПодраздел.СКВСвыше2БП)>0  и НовыйРегламент = ЛОЖЬ  Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ выше бонус-планки";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат((ВыборкаПодраздел.СКВот1БПдо2БП+ВыборкаПодраздел.СКВСвыше2БП),ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "0";//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = 0; 
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;		
					КонецЕсли;
					
					//СКВ КС
					Если ВыборкаПодраздел.СКВ_КС_Подразделения>0  и НовыйРегламент = ЛОЖЬ  Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ крупных сделок";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_КС_Подразделения,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = Окр(100*ВыборкаПодраздел.БОНУС_РОП_КС/ВыборкаПодраздел.СКВ_КС_Подразделения,2);//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаПодраздел.БОНУС_РОП_КС,ЧФ0); 
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;		
					КонецЕсли;
					
					Интервал = ?(ТЗинтервалов.Количество()=0,ТЗинтервалов,ТЗинтервалов.Скопировать(Новый Структура("Менеджер,ЭтоВМ",РуководительПодразделения,ЛОЖЬ)));
					Если Интервал.Количество() > 0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						 ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ по интервалам";
						 ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						 ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(-Интервал[0].СКВ,ЧФ0); ;
						 ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(Интервал[0].СКВ>0,Окр(100*Интервал.Итог("Доплата")/Интервал[0].СКВ,2),0);//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						 ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Интервал.Итог("Доплата"),ЧФ0); 
						 ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						 Если ОтображатьТолькоФамилии = Ложь Тогда
							 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						 КонецЕсли;	
						 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						 Если ДБЕсть Тогда
							 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						 КонецЕсли;		
					 КонецЕсли; 
					
					//
				КонецЕсли;
				ОблМенеджер = Макет.ПолучитьОбласть("Менеджер|Основная");
				ОблМенеджер_Вознаграждение = Макет.ПолучитьОбласть("Менеджер|Вознаграждение");	
				ОблМенеджер_Взносы = Макет.ПолучитьОбласть("Менеджер|Взносы");	
				ОблМенеджер_Доход = Макет.ПолучитьОбласть("Менеджер|Доход");	
				ОблМенеджер.Параметры.Менеджер		= ВыборкаМенеджер.Агент;
				
				СтруктураПоискаМенеджера = Новый Структура;
				СтруктураПоискаМенеджера.Вставить("Менеджер", ВыборкаМенеджер.Агент);
				Строки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоискаМенеджера);
				Если Строки.Количество() > 0 Тогда
					НайденнаяСтрокаМенеджера = Строки[0];
					Если НайденнаяСтрокаМенеджера.РаскраситьПолеМенеджера = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[Менеджер]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
					
					Если НайденнаяСтрокаМенеджера.РаскраситьПлан = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[План]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
					
					Если НайденнаяСтрокаМенеджера.РаскраситьКоличественныйПлан = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[КоличествоПлан]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ДоступныДанныеМенеджера = ВыборкаМенеджер.Агент = ПараметрыСеанса.уб_ТекущееФизЛицо ИЛИ ВыводимСтрокуПодразделения или ВыборкаМенеджер.Агент =Менеджер; 
				
				Если ДоступныДанныеМенеджера Тогда
					ЗПОбщее = УстановитьПараметрыОбласти_Вознаграждение(ОблМенеджер_Вознаграждение.Параметры,ВыборкаМенеджер,"ИтогоЗП",Истина);
					ОблМенеджер.Параметры.ОбщееЗП = ЗПОбщее;
					Если ПолноеСКВ = Ложь Тогда
						                                                                              
						ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту,ЧФ000);
					Иначе
						ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ,ЧФ000);
					КонецЕсли;	
					УстановитьПараметрыОбласти_Взносы(ОблМенеджер_Взносы.Параметры,ВыборкаМенеджер,"ИтогоЗП",Истина);
				Иначе
					ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ,ЧФ000);	
				КонецЕсли;
				
				Отбор = Новый Структура();
				Отбор.Вставить("Агент",ВыборкаМенеджер.Агент);
				Строки = тзСхемаРасчетаДляАгентов.НайтиСтроки(Отбор);
				СписокСхем = "";
				Если Строки.Количество() > 0 Тогда
					Для каждого Стр Из Строки Цикл
						СписокСхем = СписокСхем + ?(СписокСхем = "","", ", ") + Строка(Стр.СхемаРасчетаСМенеджером);
					КонецЦикла;
				КонецЕсли;
				//!!!				ОблМенеджер.Параметры.СхемаРасчетаСМенеджером = СписокСхем;
				//ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,?(ВыборкаМенеджер.СтавкаВознаграждения_РОП = Null, 0, ВыборкаМенеджер.СтавкаВознаграждения_РОП),0);
				//ВознаграждениеРук = Число(ВыборкаМенеджер.ВознаграждениеРуководителя);//ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту*ПроцентРуководителя/100;
				
				Если ОтображатьКолонкиДляСхемыПланПоСКВ и ДоступныДанныеМенеджера Тогда
				 
					ОблМенеджер.Параметры.План			= Формат(ВыборкаМенеджер.План,ЧФ0);
					Если ВыборкаМенеджер.Количество = 0 Тогда
						ОблМенеджер.Параметры.КоличествоПлан = "";
					Иначе
						ОблМенеджер.Параметры.КоличествоПлан = Формат(ВыборкаМенеджер.Количество,КФ);
					КонецЕсли;
					ОблМенеджер.Параметры.КоличествоФакт = Формат(ВыборкаМенеджер.КоличествоФакт_ПоАгенту,КФ);
					ОблМенеджер.Параметры.КоэффициентВида = Формат(ВыборкаМенеджер.КоэффициентВида_ПоАгенту,КФ);
					ОблМенеджер.Параметры.НовыйКлиент = Формат(ВыборкаМенеджер.НовыйКлиент_ПоАгенту,КФ);
					ОблМенеджер.Параметры.НовыйКлиентСКВ = Формат(Цел(100*?(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту=0,0,ВыборкаМенеджер.НовыйКлиентСКВ_ПоАгенту/ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту)),КФ);
					
					
					ОблМенеджер.Параметры.КоэффициентВидаГод = Формат(ВыборкаМенеджер.КоэффициентВидаГод_ПоАгенту,ЧФ0);
					
					
					
					ОблМенеджер.Параметры.ПроцентПлана	= Формат(?(ВыборкаМенеджер.План=0,0,ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту/ВыборкаМенеджер.План*100),ЧФ0);
					
					//Если НЕ ТипЗнч(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту)= Тип("Null") Тогда
					//	//!ОблМенеджер.Параметры.ПроцентОтСКВМенеджеру = ВыборкаМенеджер.СтавкаВознаграждения;
					//КонецЕсли;
					//
					//СКВ_БЕЗ_КС = ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту-ВыборкаМенеджер.СКВ_КС;
					//Если РежимДвухБП Тогда
					//	//!ОблМенеджер.Параметры.ПерваяБонусПланка					= Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
					//	//!ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
					//	//!ОблМенеджер.Параметры.СКВдоСП                           = Формат(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.ПерваяБонусПланка),ЧФ);
					//	//!ОблМенеджер.Параметры.СуммаОтСКВ                        = Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
					//	Если ВыборкаМенеджер.ВыполненПланПоСКВ Тогда
					//		//!ОблМенеджер.Параметры.Превышение1БП                     = Формат(Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0),ЧФ);
					//		Если Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0) > 0 Тогда
					//			//!ОблМенеджер.Область("ПроцентПервойБП").Примечание.Текст = "Процентная ставка от суммы превышения min Бонус планки = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеПервойБонусПланки);	
					//		КонецЕсли;
					//	Иначе
					//		//!ОблМенеджер.Параметры.СКВдоСП = СКВ_БЕЗ_КС;//
					//	КонецЕсли;	
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышени1БП           = Формат(ВыборкаМенеджер.ЗПЗаПревышение1БП,ЧФ);
					//	
					//	//-Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
					//	//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					//	//Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					//	//!ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
					//	
					//Иначе	
					//	//!ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
					//	//!ОблМенеджер.Параметры.СуммаОтСКВ						= Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
					//	//!ОблМенеджер.Параметры.СКВдоСП							= Формат(Мин(СКВ_БЕЗ_КС, ВыборкаМенеджер.Суперплан),ЧФ0);
					//	//!ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
					//КонецЕсли;	
					//Если ВыводитьКС Тогда
					//	//!ОблМенеджер.Параметры.Бонус_КС	= Формат(ВыборкаМенеджер.Бонус_КС,ЧФ);
					//	//!ОблМенеджер.Параметры.СКВ_КС	= Формат(ВыборкаМенеджер.СКВ_КС,ЧФ);
					//КонецЕсли;	
					//Если ВыборкаМенеджер.ПревышениеСуперплана > 0 Тогда
					//	Если ВыводитьПримечанияКВМВячейки Тогда
					//		//!ОблМенеджер.Параметры.ПримечаниеКВМ	= "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);
					//	КонецЕсли;
					//	//!ОблМенеджер.Область("ПримечаниеПроцент"+?(РежимДвухБП,"201212","")).Примечание.Текст = "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);	
					//КонецЕсли;
				КонецЕсли;
				//Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
				//	//ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее - ВознаграждениеРук,ЧФ000);
				//	//!ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее,ЧФ000);
				//КонецЕсли;
				
				Если НЕ ОтображатьТолькоФамилии И НЕ СкрыватьКолонкиДСП Тогда
					//!ОблМенеджер.Параметры.Подразделение = ВыборкаМенеджер.Подразделение;//уб_СС.ПолучитьПодразделениеАгента(ВыборкаМенеджер.Агент, КонецМесяца(ЗарплатныйПериод));
				КонецЕсли;
				ДокументРезультат.Вывести(ОблМенеджер,3,Строка(ВыборкаМенеджер.Подразделение),Истина);												
				Если ОтображатьТолькоФамилии = Ложь Тогда
					ДокументРезультат.Присоединить(ОблМенеджер_Вознаграждение);
				КонецЕсли;	
				ДокументРезультат.Присоединить(ОблМенеджер_Взносы);
				Если ДБЕсть Тогда
					
					
					Если ВыборкаПодраздел.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
						ОблМенеджер_Доход.Параметры.СуммаДоходаБрокера = ВыборкаМенеджер.СуммаДБ+?(ЗПОбщее<0,ЗПОбщее,0);
					Иначе	
					КонецЕсли;	
					
					ДокументРезультат.Присоединить(ОблМенеджер_Доход);
				КонецЕсли;	
				
				/////////////////// СХЕМА \\\\\\\\\\\\\\\\\\\
				// Заполнение строки макета ВидСП
				ВыборкаСхема 	= ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				ОднаСхема = ВыборкаСхема.Количество()=1;
				Пока ВыборкаСхема.Следующий() Цикл					
					//Если ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру Тогда
					//	Продолжить;
					//Иначе
 					ЭтоПартнерское     = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру;
					Если //(ВыборкаСхема.Ед = 0 или 
						ЭтоПартнерское=Истина Тогда
						//Сообщить(1);
						ИначеЕсли 						(ВыборкаСхема.ВознаграждениеМенеджера=0 и (ВыборкаСхема.ВознаграждениеРуководителя = 0 или ВыборкаСхема.ВознаграждениеРуководителя = Null) и ВыборкаСхема.СКВ = 0 ) Тогда //и ВыборкаСхема.ВМ=0
						Продолжить;
					КонецЕсли;

					ОблСхема = Макет.ПолучитьОбласть("Схема|Основная");
					ОблСхема_Вознаграждение = Макет.ПолучитьОбласть("Схема|Вознаграждение");	
					ОблСхема_Взносы = Макет.ПолучитьОбласть("Схема|Взносы");	
					ОблСхема_Доход = Макет.ПолучитьОбласть("Схема|Доход");	
					ЭтоПланПоСКВ = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
					ЭтоПоИнтерваламСКВ = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ;
					
					ОблСхема.Параметры.Схема		= ВыборкаСхема.СхемаРасчетаСМенеджером;
					ОблСхема.Параметры.СобранаяКВ	= Формат(ВыборкаСхема.СКВ,ЧФ000);
					Если ДоступныДанныеМенеджера Тогда
						ИмяОбщейЗП = "ИтогоЗП";
						ЗПСхема = ?(ВыборкаСхема[ИмяОбщейЗП] = Null, 0, ВыборкаСхема[ИмяОбщейЗП]) //ВМ по СКВ
						+ ?(ВыборкаСхема.ВознаграждениеМенеджера = Null, 0, ВыборкаСхема.ВознаграждениеМенеджера) //ВМ в оплатах
						- ?(ВыборкаСхема.ВычетСАгента = Null, 0, ВыборкаСхема.ВычетСАгента)     //вычеты  
						+ ?(ВыборкаСхема.Бонус_КС = Null, 0, ВыборкаСхема.Бонус_КС)             //Крупные сделки
						+ ?(ЭтоПоИнтерваламСКВ = Ложь, 0,ВыборкаМенеджер.ВМПоИнтервалам) //По интервалам берем из менеджера
						+ ?(ЭтоПартнерское = Ложь или ВыборкаМенеджер.ПартнерскоеВознаграждение = Null, 0,ВыборкаМенеджер.ПартнерскоеВознаграждение); //По интервалам берем из менеджера
						ОблСхема.Параметры.ВМ           = Формат(ЗПСхема,ЧФ000);//Формат(?(ЭтоПланПоСКВ,ВыборкаСхема.ИтогоЗП,ВыборкаСхема.ВознаграждениеМенеджера),ЧФ000);					
						ВыводитьДанныеПоВознаграждениям = Истина;
						Если  ВыборкаСхема.СхемаРасчетаСМенеджером = Неопределено 
							ИЛИ (ВыборкаСхема.ИтогоЗП = 0 и ВыборкаСхема.ВМПоИнтервалам = 0 и ВыборкаМенеджер.ВМПоИнтервалам = 0  и ЗПСхема = 0) 
							Тогда
							//Продолжить; //TODO разобраться
							ВыводитьДанныеПоВознаграждениям = Ложь;
						КонецЕсли;
					Иначе
						ВыводитьДанныеПоВознаграждениям = Ложь;
					КонецЕсли;
				
					//Если ОднаСхема = ЛОЖЬ Тогда
						Если НЕ ВыборкаСхема.СхемаРасчетаСМенеджером = Неопределено Тогда
							ДокументРезультат.Вывести(ОблСхема,4,Строка(ВыборкаМенеджер.СхемаРасчетаСМенеджером),Истина);												
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСхема_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСхема_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСхема_Доход);
							КонецЕсли;
						КонецЕсли;
					//КонецЕсли;
					Если ВыводитьДанныеПоВознаграждениям = Истина и ЗПСхема>0 Тогда//  и ВыборкаСхема.ЕД> 0 Тогда
					ОблШапкаРасшифровки = Макет.ПолучитьОбласть("ШапкаРасшировки|Основная");
					ОблШапкаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("ШапкаРасшировки|Вознаграждение");	
					ОблШапкаРасшифровки_Взносы = Макет.ПолучитьОбласть("ШапкаРасшировки|Взносы");	
					ОблШапкаРасшифровки_Доход = Макет.ПолучитьОбласть("ШапкаРасшировки|Доход");	
					УровеньРасшифровки = 4+?(ОднаСхема = ЛОЖЬ,1,0);
					ДокументРезультат.Вывести(ОблШапкаРасшифровки,УровеньРасшифровки,"",Истина);												
					Если ОтображатьТолькоФамилии = Ложь Тогда
						ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Вознаграждение);
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Взносы);
					Если ДБЕсть Тогда
						ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Доход);
					КонецЕсли;	
					
					ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
					ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
					ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
			
					//СХЕМА ПЛАН ПО СКВ
					Если ЭтоПланПоСКВ Тогда	
						//+Новые промежуточные расчеты
						//СКВДоПлана
						//СКВотПланадо1БП
						//СКВот1БПдо2БП
						//СКВСвыше2БП
						//ЗПДоПлана
						//ЗПотПланадо1БП
						//ЗПот1БПдо2БП
						//ЗПСвыше2БП
						//ПроцентнаяСтавкаДоПлана
						//ПроцентнаяСтавкаПослеПлана
						//ПроцентнаяСтавкаПослеПервойБонусПланки
						//ПроцентнаяСтавкаПослеСуперПлана
						//План
						//ПерваяБонусПланка
						//СуперПлан
						//-
						///
						Если ВыборкаМенеджер.ЗПдоПлана <> 0 или ВыборкаМенеджер.СКВдоПлана <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВдоПлана,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПдоПлана,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПотПланадо1БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы от "+Формат(ВыборкаМенеджер.План,ЧФ0)+" до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВотПланадо1БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);//ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПотПланадо1БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПот1БПдо2БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы от "+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0)+" до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.СуперПлан,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВот1БПдо2БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентнаяСтавкаПослеПервойБонусПланки;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПот1БПдо2БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПСвыше2БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы свыше";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.СуперПлан,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВСвыше2БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПСвыше2БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						
						//
						Если ВыборкаМенеджер.БОНУС_КС <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За крупные сделки/КВ по страхователю от";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(РазмерКС,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВ_КС,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.СКВ_КС=0,"",Окр(100*ВыборкаМенеджер.БОНУС_КС/ВыборкаМенеджер.СКВ_КС));
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.БОНУС_КС,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						
						Если ВыборкаМенеджер.ЗП_Пролонгация <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За пролонгацию";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВ_Прол_Агенты,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.СКВ_Прол_Агенты=0,"",Окр(100*ВыборкаМенеджер.ЗП_Пролонгация/ВыборкаМенеджер.СКВ_Прол_Агенты));
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗП_Пролонгация,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	

						
						
						//
						Если ВыборкаМенеджер.ВычетСАгента <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "Вычеты по оплатам";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = "<суммарно по всем>"; ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "-";
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ВычетСАгента,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;
						
						БазаРОП = ВыборкаМенеджер.СКВДоПлана + ВыборкаМенеджер.СКВ_КС+ ВыборкаМенеджер.СКВотПланадо1БП;
						Если БазаРОП >0 и НовыйРегламент и (ЭтоПолныеПрава или ЭтоРуководитель) Тогда
							
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "Ставка руководителя за "+ВыборкаМенеджер.ПроцентВыполненияПлана;
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";///Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(БазаРОП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентРОП;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
							ОблСтрокаРасшифровки.Параметры.ВМ                        = "";//Формат(ВыборкаМенеджер.ЗПдоПлана,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;
					//
					Если ЭтоПоИнтерваламСКВ = Истина Тогда
						//
						//СХЕМА ПО ИНТЕРВАЛАМ СКВ
				 		Если ТипЗнч(ТЗинтервалов) = Тип("ТаблицаЗначений") Тогда
							Для каждого Строка из ТЗинтервалов.НайтиСтроки(Новый Структура("Менеджер",ВыборкаМенеджер.Агент)) цикл
								//
								Если (Строка.База<>0) ИЛИ (Строка.Доплата<>0)  Тогда
									ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
									Префикс = ?(Строка.ЭтоВМ = ИСТИНА,"За сборы от ","Руководителю за сборы отдела от ");
									ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = Префикс+Формат(Строка.Начало,ЧФ0)+" до ";
									ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(Строка.Окончание,ЧФ0);
									ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(Строка.База,ЧФ0); ;
									ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = Строка.ПроцентИнтервала;
									ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Строка.Доплата,ЧФ0); 
									ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
									КонецЕсли;	
									ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
									Если ДБЕсть Тогда
										ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
									КонецЕсли;	
								КонецЕсли;	
								
							КонецЦикла;	
						КонецЕсли;	
					КонецЕсли;		
					//
					Если ВыборкаСхема.ВознаграждениеМенеджера <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = ?(ВыборкаСхема.ВознаграждениеМенеджера<0,"Удержание по оплатам","Допуслуги по оплатам");//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = "<суммарно по cхеме>"; ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "-";
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаСхема.ВознаграждениеМенеджера,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
					/////////////////// ВидСП \\\\\\\\\\\\\\\\\\\
					// Заполнение строки макета ВидСП
					Если ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру Тогда
						//Документов там нет
						Продолжить;
					КонецЕсли;
					
					счетчикСп = 0;
					ВыборкаВидСП 	= ВыборкаСхема.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
					Пока ВыборкаВидСП.Следующий() Цикл					
						
						Если РежимОтчета = 1 Тогда
							КВыводу = ВыборкаВидСП.ЕД-ВыборкаВидСП.НеВыводить;
							Если КВыводу<=0 Тогда
								Продолжить;
							КонецЕсли;
						Иначе
							Если ВыборкаВидСП.Пустышка Тогда
								Продолжить;
							Иначе
								КВыводу = ВыборкаВидСП.ЕД-ВыборкаВидСП.НеВыводить;
								Если КВыводу<=0 Тогда
									Продолжить;
								КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;
						счетчикСп = счетчикСп+1;
						#Если Клиент Тогда
							ОбработкаПрерыванияПользователя();
						#КонецЕсли
						ОблВидСП = Макет.ПолучитьОбласть("ВидСП|Основная");
						ОблВидСП_Вознаграждение = Макет.ПолучитьОбласть("ВидСП|Вознаграждение");	
						ОблВидСП_Взносы = Макет.ПолучитьОбласть("ВидСП|Взносы");	
						ОблВидСП_Доход = Макет.ПолучитьОбласть("ВидСП|Доход");	
						ОблВидСП.Параметры.ВидСП		= ВыборкаВидСП.ВидСП;
						ЗПОбщееО =УстановитьПараметрыОбласти_Вознаграждение(ОблВидСП_Вознаграждение.Параметры,ВыборкаВидСП);
						//					ОблВидСп.Параметры.ОбщееЗП = ЗПОбщееО;
						ОблВидСП.Параметры.СобранаяКВ	   = Формат(ВыборкаВидСП.СКВ,ЧФ000);
						УстановитьПараметрыОбласти_Взносы(ОблВидСП_Взносы.Параметры,ВыборкаВидСП,"",Истина);
						Если ВыводитьКС Тогда
							//!ОблВидСП.Параметры.Бонус_КС	= Формат(ВыборкаВидСП.Бонус_КС,ЧФ);
							//!ОблВидСП.Параметры.СКВ_КС	= Формат(ВыборкаВидСП.СКВ_КС,ЧФ);
						КонецЕсли;	
						
						Если Не ОтображатьТолькоФамилии Тогда  
							
							Если Не ЗначениеЗаполнено(Страхователь) Тогда
								Если счетчикСп =1 Тогда
									ДокументРезультат.Вывести(Макет.ПолучитьОбласть("ШапкаОплаты|Основная"),УровеньРасшифровки,Строка(ВыборкаМенеджер.Агент),Истина);
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Вознаграждение"));
									КонецЕсли;	
									ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Взносы"));
									Если ДБЕсть Тогда
										ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Доход"));
									КонецЕсли;	
									//ШапкаОплаты_Вознаграждение = Макет.ПолучитьОбласть("ШапкаОплаты|Вознаграждение");	
								КонецЕсли;	
								ДокументРезультат.Вывести(ОблВидСП,6,Строка(ВыборкаМенеджер.Агент),Истина);
								Если ОтображатьТолькоФамилии = Ложь Тогда
									ДокументРезультат.Присоединить(ОблВидСП_Вознаграждение);
								КонецЕсли;	
								ДокументРезультат.Присоединить(ОблВидСП_Взносы);
								Если ДБЕсть Тогда
									ДокументРезультат.Присоединить(ОблВидСП_Доход);
								КонецЕсли;	
								
							КонецЕсли;
							
						КонецЕсли;				
						СчВидаСП = 0;
						ВыбСтр 	= ВыборкаВидСП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);					
						////////////////// СТРОКА \\\\\\\\\\\\\\\\\\\\
						// Заполнение строки макета СТРОКА
						Пока ВыбСтр.Следующий() Цикл
							#Если Клиент Тогда
								ОбработкаПрерыванияПользователя();
							#КонецЕсли
							ПолисАннулирован = ?(ВыбСтр.ПолисАннулирован = Неопределено, Ложь, ВыбСтр.ПолисАннулирован);
							//при сравнении двух дат с галочкой "отображать только оплаты где изменился СКВ" ПолисАннулирован = Неопределено
							Если Не ОтображатьАннулированныеОплаты И ПолисАннулирован И ВыбСтр.СКВ = 0 И ВыбСтр.ВознаграждениеМенеджера = 0 Тогда
								Продолжить
							КонецЕсли;
							Если РежимОтчета = 1 Тогда
								Если ВыбСтр.НеВыводить=1 Тогда
									Продолжить;
								ИначеЕсли ЗначениеЗаполнено(ВыбСтр.Ссылка)=Ложь Тогда
									Продолжить;
								КонецЕсли;
							Иначе
								Если ВыбСтр.Пустышка или ВыбСтр.НеВыводить = 1 Тогда
									Продолжить;
								КонецЕсли;
							Конецесли;						
							СчНом = СчНом + 1;
							//ИндикаторСтеп();
							СчВидаСП = СчВидаСП + 1;						
							Обл = Макет.ПолучитьОбласть("Строка|Основная");
							Обл_Вознаграждение = Макет.ПолучитьОбласть("Строка|Вознаграждение");	
							Обл_Взносы = Макет.ПолучитьОбласть("Строка|Взносы");	
							Обл_Доход = Макет.ПолучитьОбласть("Строка|Доход");	
							Обл.Параметры.ЗначРасшифровки 			= Новый Структура("Ссылка", ВыбСтр.Ссылка);
							Обл.Параметры.Ном						= Формат(СчНом,"ЧЦ=10; ЧГ=");
							Обл.Параметры.НомерОплаты				= ВыбСтр.Номер; //В запрос
							Обл.Параметры.НомСп				        = СчВидаСП;
							Обл.Параметры.ДатаОплаты				= ВыбСтр.Дата;
							Обл.Параметры.СК						= ВыбСтр.СК;
							Обл.Параметры.СтраховойПродукт			= ВыбСтр.СтраховойПродукт;
							Обл.Параметры.НомерЗаявки				= ВыбСтр.НомерЗаявки;
							Обл.Параметры.ВМ						= Формат(ВыбСтр.ВознаграждениеМенеджера,ЧФ);
							Если ВыводитьКС Тогда
								//!Обл.Параметры.Бонус_КС				= Формат(ВыбСтр.Бонус_КС,ЧФ);
								//!Обл.Параметры.СКВ_КС				= Формат(ВыбСтр.СКВ_КС,ЧФ);
								Если ВыбСтр.СКВ_КС > 0 Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Вознаграждение.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Взносы.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Доход.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									//!Обл.Область("Бонус_КС").Примечание.Текст = " ("+ВыборкаМенеджер.СтавкаВознаграждения+"+"+ВыбСтр.БонусПроцент+")%"+" "+?(ВыбСтр.Сделка.Дата = Дата(1,1,1),"Автоматически определенная крупная сделка",ВыбСтр.Сделка);
								ИначеЕсли ПолисАннулирован Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл
										ЦветАннулированногоПолиса = Новый Цвет(252, 226, 192);
										ПодОбласть.ЦветФона = ЦветАннулированногоПолиса;
									КонецЦикла;
								ИначеЕсли ВыбСтр.ЭтоПролонгация	= Истина Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Вознаграждение.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Взносы.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Доход.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
								КонецЕсли;	
							КонецЕсли;	
							Если НЕ ОтображатьТолькоФамилии Тогда
								//Попытка
								//	Обл_Вознаграждение.Параметры.Страхователь	= уб_СС.ФИОФизлицаСтрокой(ВыбСтр.Страхователь,, Истина, 1, Ложь);
								//Исключение
								 	Обл_Вознаграждение.Параметры.Страхователь	= Лев(ВыбСтр.Страхователь,Найти(ВыбСтр.Страхователь," "));
								//КонецПопытки;	
								Попытка
									Если ВыбСтр.НовыйКлиент >0 Тогда
										//Выделим новых клиентов
										подобласть=Обл_Вознаграждение.Область(1,2,1,3);
										подобласть.ЦветТекста = Новый Цвет(0,130,0);
										подобласть.Шрифт = Новый Шрифт(подобласть.Шрифт,,,Истина);
									КонецЕсли;	
								Исключение
								КонецПопытки;	
								Обл_Вознаграждение.Параметры.НомерПолиса		= СокрЛП(ВыбСтр.НомерПолиса);
								Обл_Вознаграждение.Параметры.НомерКвитанции		= ВыбСтр.НомерКвитанции;
								Обл_Взносы.Параметры.ПолнаяПремия				= Формат(ВыбСтр.ПолнаяПремия,ЧФ0);
								Если ВыбСтр.НомерВзноса <> Неопределено ИЛИ ВыбСтр.НачисленнаяСуммаВзноса <> Неопределено Тогда
									Если ВыбСтр.НомерВзноса = 1 И ВыбСтр.ПолнаяПремия = ВыбСтр.НачисленнаяСуммаВзноса Тогда
										Обл.Параметры.НомерВзноса = "П";
									Иначе
										Обл.Параметры.НомерВзноса = Строка(ВыбСтр.НомерВзноса) + " взн";
									КонецЕсли;
									Обл_Взносы.Параметры.ОплаченоФакт			= Формат(ВыбСтр.ОплаченоФакт,ЧФ000);
									Обл_Взносы.Параметры.АВилиСкидкаПроцент	= ВыбСтр.АВилиСкидкаПроцент;
									Обл_Взносы.Параметры.АВилиСкидкаСумма		= Формат(ВыбСтр.АВилиСкидкаСумма,ЧФ);
									//!Обл.Параметры.Комментарий			= ВыбСтр.Комментарий;        
									//!Обл.Параметры.ДатаПолиса			= ВыбСтр.ДатаПолиса;
								КонецЕсли;
							КонецЕсли; 
							Обл_Взносы.Параметры.НачисленнаяСуммаВзноса	= Формат(ВыбСтр.НачисленнаяСуммаВзноса,ЧФ0);
							Обл.Параметры.СобранаяКВ				= Формат(ВыбСтр.СКВ,ЧФ0);
							Если ВыбСтр.КоличествоФакт = 0 Тогда
								//Обл.Параметры.КоличествоФакт		= "";
							Иначе
								//Обл.Параметры.КоличествоФакт		= Формат(ВыбСтр.КоличествоФакт,ЧФ000);
							КонецЕсли;
							Обл.Параметры.КоэффициентВида = Формат(ВыбСтр.КоэффициентВида,КФ);
							
							
							Обл_Вознаграждение.Параметры.СхемаРасчетаСМенеджером	= ВыбСтр.СхемаРасчетаСМенеджером;
							Попытка
								Обл_Вознаграждение.Параметры.НовыйКлиент = Формат(ВыбСтр.НовыйКлиент,КФ);
							Исключение
							КонецПопытки;	
							Если НЕ СкрыватьКолонкиДСП Тогда
								Если НЕ ОтображатьТолькоФамилии Тогда
									//!Обл.Параметры.Подразделение			= ВыбСтр.Подразделение;
									Обл.Параметры.НаправлениеПлатежа	= ВыбСтр.НаправлениеПлатежа;
									Обл_Взносы.Параметры.КВПроцент				= ВыбСтр.КВПроцент;
									Обл_Взносы.Параметры.КВСумма				= Формат(ВыбСтр.КВСуммаДляАгента,ЧФ);
									Обл_Доход.Параметры.КВПроцентДляОтчета	= ВыбСтр.КВПроцентДляОтчета;        
									//Если ВыбСтр.КВПодВопросом Тогда
									//	Обл_Взносы.Области.КВПроцент.ЦветФона = WebЦвета.Желтый;
									//	Обл_Взносы.Области.КВПроцент.Примечание.Текст = "КВ под вопросом";
									//КонецЕсли;
									//Обл.Параметры.Ссылка				= ВыбСтр.Ссылка;
									//Обл.Параметры.Ссылка_Строка = "Оплата "+ВыбСтр.Номер+ " от "+Формат(ВыбСтр.Дата,"ДФ=dd.MM.yy");
								КонецЕсли;
							КонецЕсли;						
							Если ВыбСтр.ВычетСАгента = Null или ВыбСтр.ВычетСАгента = 0 Тогда
								Обл.Параметры.Разд ="";
								Обл.Параметры.ВычетСАгента = "";
							Иначе	
								Обл.Параметры.Разд ="/";
								Обл.Параметры.ВычетСАгента			= Формат(?(ВыбСтр.ВычетСАгента = Null, 0, -ВыбСтр.ВычетСАгента),ЧФ);;
							КонецЕсли;	
							ИнфоКВМ = СоотвИнфоКВМ.Получить(ВыбСтр.Номер);
							//Если ВыбСтр.ИсключитьИзРасчетаЗП <> Неопределено Тогда
							//	Если ВыбСтр.ИсключитьИзРасчетаЗП Тогда
							//		Обл.Области.ПолеСтроки.Узор = ТипУзораТабличногоДокумента.Узор3;
							//		Обл.Области.ПолеСтроки.ЦветУзора = новый Цвет(255, 50, 50);
							//	КонецЕсли;
							//КонецЕсли;
							Если ИнфоКВМ <> Неопределено Тогда
								//Если ВыводитьПримечанияКВМВячейки Тогда
								//	Обл_Вознаграждение.Параметры.ПримечаниеКВМ	= ИнфоКВМ;
								//Иначе
								//	Обл_Вознаграждение.Область("ПримечаниеКВМ").Примечание.Текст = ИнфоКВМ;
								//КонецЕсли;
							КонецЕсли;
							Если ВыбСтр.БонусМенеджеру <> Неопределено ИЛИ ВыбСтр.ВидРасчетаСАгентом <> Неопределено Тогда
								
								Если ВыбСтр.БонусМенеджеру Тогда
									//Обл_Вознаграждение.Область("ПримечаниеКВМ").ЦветФона = цЖелтенький;
									//Обл_Вознаграждение.Область("ПримечаниеКВМ").Примечание.Текст = "Есть бонус менеджера";
								КонецЕсли;
								
								Если ВыбСтр.ВидРасчетаСАгентом = кРасчетПоАВ Тогда
									//Обл.Область("СтрокаОтчета").ЦветФона = новый Цвет(245,200,150);
									//Обл.Область("СтрокаОтчета").Примечание.Текст = "Расчет по схеме";
								КонецЕсли;
							КонецЕсли;
							
							Если НЕ ОтображатьТолькоФамилии Тогда
								
								Если Не ЗначениеЗаполнено(Страхователь) Или ВыбСтр.Страхователь = Страхователь Тогда
									
									ДокументРезультат.Вывести(Обл,6,Строка(ВыборкаВидСП.ВидСП) + ", " + Строка(ВыборкаМенеджер.Агент),Истина);
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(Обл_Вознаграждение);
									КонецЕсли;	
									ДокументРезультат.Присоединить(Обл_Взносы);
									Если ДБЕсть Тогда
										Попытка
											Если ВыбСтр.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
												Обл_Доход.Параметры.СуммаДоходаБрокера = ВыбСтр.СуммаДБ;
											Иначе	
											КонецЕсли;	
										Исключение
										КонецПопытки;
										ДокументРезультат.Присоединить(Обл_Доход);
									КонецЕсли;	
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;							
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		//ИндикаторСкрыть();
		
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3);
КонецПроцедуры


Процедура РассчитатьТаблицы2020(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски = Неопределено,ТЗИнтервалов=Неопределено) Экспорт
	////////////////////////////////////////////////////////
	//ЭТАП №1. ПОЛУЧЕНИЕ И ЗАДЕНИЕ НАСТРОЕК РАСЧЕТА
	////////////////////////////////////////////////////////
	Если тзАгентовДляРаскраски = Неопределено Тогда
		тзАгентовДляРаскраски = Новый ТаблицаЗначений;
		тзАгентовДляРаскраски.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПолеМенеджера",Новый ОписаниеТипов("Булево"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПлан",Новый ОписаниеТипов("Булево"));
		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьКоличественныйПлан",Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	СоотвИнфоКВМ = Новый Соответствие;
	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
	стрСостояние    = "Расчет ЗП ОП за "+Формат(ЗарплатныйПериод,"ДФ='MMMM yyyy'");
	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
	//кАгентская 	    = Перечисления.уб_ВидыЗаявок.Агентская;	 
	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	СхемаПоАВ       = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
	//пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
	//пВидЕКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО;
	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
	
	ЗапросРасчетВМ = Новый Запрос;
	
	ОписаниеТипаЧисло14_2_но	= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(14, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаПроцент			= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТипаДата			= Новый ОписаниеТипов("Дата",,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТипаБулево			= Новый ОписаниеТипов("Булево");
	ОписаниеТипаСтрока			= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20));
	ОписаниеТипа_ФизЛицо		= Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	ОписаниеТипаЧисло12_0       = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(12, 0));
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	ОписаниеТипа_Подразделение = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Организации"));
	ОписаниеТипа_Организации = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ПеречислениеСсылка.уб_ЗП_СхемыВознагражденияРуководителейОП"));
	ОписаниеТипаСхемВознРукОП = Новый ОписаниеТипов(Массив);
	
	РазмерКС = ?(ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1),уб_РасчетыСменеджерами.РазмерКС(ЗарплатныйПериод),50000);
	
	РасчетДО1БП = уб_РасчетыСменеджерами.РасчетДО1БП(ЗарплатныйПериод);
	
	ЭтоПолныеПрава = ПолныеПрава();
	
	ЭтоВариант20121001 = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
	
	ЭтоВариант20120401 = ЗарплатныйПериод >= Дата(2012,4,1); //У руководителей корректируется ЗП при наличии КС
	
	ЭтоВариант20121201 = ЗарплатныйПериод >= Дата(2012,12,1);//Используются 2 бонус планки
	ЭтоВариант20130301 = ЗарплатныйПериод >= Дата(2013,3,1) ; //Для истории КВ Агента
	
	ЭтоВариант20130801 = ЗарплатныйПериод >= Дата(2013,8,1);//Количественный план
	ЭтоВариант20130901 = ЗарплатныйПериод >= Дата(2013,9,1);//Количественный план РОП
	ЭтоВариант20150401 = ЗарплатныйПериод >= Дата(2015,4,1);//До Суперплана для РОП при неполненном колич, но больших сборах
	ЭтоВариант20150601 = ЗарплатныйПериод >= Дата(2015,6,1);//Штрафной план вычитается из бонуспланок
	ЭтоВариант20150801 = ЗарплатныйПериод >= Дата(2015,8,1);//Структура отбора делается по ПлануСКВ
	ЭтоВариант20150901 = ЗарплатныйПериод >= Дата(2015,10,1);//Структура отбора делается по ПлануСКВ -> замена 9 на 10
	ЭтоВариант20170101 = ЗарплатныйПериод >= Дата(2017,1,1);//Мастер получает ЗП через кассу
	ЭтоВариант20170901 = ЗарплатныйПериод >= Дата(2017,8,1);//Мастер и ведущие в одном отделе
	ДатаНачалаАВиТО = Дата(2016,1,1);
	ЭтоВариант20151001 = ЗарплатныйПериод >= ДатаНачалаАВиТО;//АВ и ТО сдается в кассу
	ЭтоВариант20171001 = ЗарплатныйПериод >= Дата(2017,11,1);//СКВ КС вычиватеся из БАЗЫ РОП
	ЭтоВариант20180701 = ЗарплатныйПериод >= Дата(2018,7,1);//СКВ КС вычиватеся из БАЗЫ РОП
	ЭтоВариант20180801 = ЗарплатныйПериод >= Дата(2018,8,1);//Автоматическое изменние дельты АВ
	ЭтоВариант20181001 = ЗарплатныйПериод >= Дата(2125,2,1);//Сравнение количества клиентов с прошлым годом для оценки выполнения плана
	ЭтоВариант20191001 = ЗарплатныйПериод >= Дата(2125,1,1);//Сравнение количества клиентов с прошлым годом для оценки выполнения плана
	ЭтоВариант20191201 = ЗарплатныйПериод >= Дата(2019,12,1);//ОТДЕЛ 5 так же как мастер
	
	ЭтоВариант20200201 = ЗарплатныйПериод >= Дата(2019,1,1);
	ЭтоВариант20200301 = ЗарплатныйПериод >= Дата(2020,3,1) или НовыйРегламент; //ОП НБ
	ЭтоВариант20200401 = (ЗарплатныйПериод >= Дата(2020,4,1)	
	и Не ЗарплатныйПериод = Дата(2020,6,1)
	и Не ЗарплатныйПериод = Дата(2020,7,1))
	или НовыйРегламентРОП; //РОП НБ
	ЭтоВариант20200801 = ЗарплатныйПериод >= Дата(2020,8,1);
	ЭтоВариант20200901 = ЗарплатныйПериод >= Дата(2020,9,1);
	ЭтоВариант20201001 = ЗарплатныйПериод >= Дата(2020,10,1);
	ЭтоВариант20260101 = ЗарплатныйПериод >= Дата(2026,1,1);
	
	АгенскаяСеть = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Агентская сеть");
	МотивацияПоКаждомуСотруднику = Справочники.ПодразделенияОрганизаций.НайтиПоКоду("000000043");
	МотивацияПоКаждомуСотруднику2 = Справочники.ПодразделенияОрганизаций.НайтиПоКоду("000000039");
	
	Сетка01 = уб_РасчетыСМенеджерами.ПолучитьСетку(ЗарплатныйПериод,МотивацияПоКаждомуСотруднику);
	Сетка02 = уб_РасчетыСМенеджерами.ПолучитьСетку(ЗарплатныйПериод,МотивацияПоКаждомуСотруднику2);
	
	ТаблицаПлавающихСтавокРОП = ПолучитьТаблицуПлавающихСтавокРОП();
	////////////////////////////////////////////////////////
	// ПОЛУЧЕНИЕ ДАННЫХ ИЗ ОПЛАТ ЛИБО ИЗ ИСТОРИИ ОПЛАТ
	////////////////////////////////////////////////////////
	
	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
	ФильтрПоПодразделению = ЗначениеЗаполнено(Подразделение) И РежимОтчета = 0 ;			   
	ФильтрПоСП = ЗначениеЗаполнено(ВидСП);
	Этап = Этап + 1;
	ВРеальномВремени  = Не ЗначениеЗаполнено(ДатаСреза);
	//этоКС = НЕ _вм.СписокКС.Найти(ОП.Знч("Ссылка")) = Неопределено;
	//						__ВознаграждениеМенеджера = Окр(?(_вм.ЗП_СКВ=0 ИЛИ _этоКС,0,_вм.ЗП_СКВ*__СКВ/_вм.СКВ)+?(бЗаблокирована,ОП.Знч("ВознаграждениеМенеджера"),_ВознаграждениеМенеджера)+
	//						?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.Бонус_КС*__СКВ/_вм.СКВ_КС),2);
	
	Если ВРеальномВремени Тогда
		//////////////////////////////////////////////////////////////////////////////////////////
		// Запрос формируется на основании Документов уб_ОплатаПолисов по текущему их состоянию //
		//////////////////////////////////////////////////////////////////////////////////////////
		УсловиеОтбораОплат = "
		|ГДЕ ИСТИНА ";		
		УсловиеОтбораОплат = УсловиеОтбораОплат + "
		|	И ОП.ЗарплатныйПериод >= &ДатаНачала
		|	И ОП.ЗарплатныйПериод <= &ДатаКонца ";
		Если ПоказатьТолькоОплатыНеИзЭтогоЗППериода Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И (ОП.Дата < &ДатаНачала ИЛИ ОП.Дата > &ДатаКонца) ";
		КонецЕсли;		
		Если НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ ";
		КонецЕсли;		
		УсловиеОтбораОплат = УсловиеОтбораОплат + "
		|	И ОП.СтраховойПолис.Ссылка <> &ПустойПолис
		|	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
		|   И (ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером)<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ))
		//|    ИЛИ 
		//|      ВЫБОР
		//|      КОГДА ОП.ЗарплатныйПериод >= ДАТАВРЕМЯ(2015, 9, 1)
		//|        ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		//|      ИНАЧЕ 0 //ВЫБОР
		//|            //КОГДА ОП.ОплаченоФакт > 0
		//|            //     И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		//|            //  ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		//|            //ИНАЧЕ 0
		//|            //КОНЕЦ
		//|      КОНЕЦ > 0
		//|     ) //Вместо нижестоящей
		//|	И ОП.СтраховойПолис.НомерЗаявки <> &ЛичнаяСтраховка 
		|   И ОП.ПометкаУдаления = ЛОЖЬ ";		
		Если ФильтрПоСП Тогда
			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ВидС = &ВидСП ";
		КонецЕсли;		
		//Если ФильтрПоМенеджеру Тогда
		//УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Агент = &Менеджер ";
		//КонецЕсли;		
		//Если ФильтрПоПодразделению Тогда
		//	УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Подразделение = &Подразделение ";
		//КонецЕсли;		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДатаНачала);
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДатаКонца);
		//ЗапросРасчетВМ.УстановитьПараметр("ЛичнаяСтраховка",кЛичнаяЗаявка);
		//ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
		ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
		//ЗапросРасчетВМ.УстановитьПараметр("ВидКАСКО",		пВидКАСКО);
		//ЗапросРасчетВМ.УстановитьПараметр("ВидЕКАСКО",		пВидЕКАСКО);
		ЗапросРасчетВМ.УстановитьПараметр("ПустойПолис",	ПустойПолис);		
		ЗапросРасчетВМ.УстановитьПараметр("Менеджер",		Менеджер);
		ЗапросРасчетВМ.УстановитьПараметр("Подразделение",	Подразделение);
		ЗапросРасчетВМ.УстановитьПараметр("ВидСП",			ВидСП);		
		ЗапросРасчетВМ.УстановитьПараметр("СотрудникиМастера",ЭтоМастер());
		// Если галочка "пересчитывать суммы в оплатах" ИСТИНА
		Если ПересчитыватьСуммыВОплатах Тогда
			УсловиеПересчета= СтрЗаменить(УсловиеОтбораОплат,"(ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером)<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ))"," 5 = 5");
			ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОП.Ссылка
			|ИЗ
			|	Документ.уб_ОплатаПолисов КАК ОП" + УсловиеПересчета;
			Результат = ЗапросРасчетВМ.Выполнить();			
			ПересчитатьСуммыПоЗП(Результат);
		КонецЕсли;		
		Если ЭтоПолныеПрава Тогда
			УстановитьПривилегированныйРежим(Истина);
			ЗапросНачисления = Новый Запрос;
			ЗапросНачисления.Текст = "ВЫБРАТЬ
			|	МАКСИМУМ(уб_НачислениеЗП.Дата) КАК Дата
			|ИЗ
			|	Документ.уб_НачислениеЗП КАК уб_НачислениеЗП
			|ГДЕ
			|	уб_НачислениеЗП.ПометкаУдаления = Ложь";
			
			
			Попытка
				ВыборкаНачисления = ЗапросНачисления.Выполнить().Выбрать();
				Если ВыборкаНачисления.Следующий() Тогда
					ЭтоПоследнийРасчет = ДатаНачала >= ВыборкаНачисления.Дата;
				Иначе
					ЭтоПоследнийРасчет = Истина;
				КонецЕсли;	
			Исключение
				ЭтоПоследнийРасчет = Ложь;
			КонецПопытки;	
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ПересчетДельтыАВ = ЭтоВариант20180801 и (ЭтоПоследнийРасчет Или ПересчетДельтыКВ); 
			Если ПересчетДельтыАВ Тогда
				ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ОП.Ссылка
				|ИЗ
				|	Документ.уб_ОплатаПолисов КАК ОП" + СтрЗаменить(УсловиеОтбораОплат,"<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)","=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)");
				Результат = ЗапросРасчетВМ.Выполнить();			
				ПересчитатьДельтыКВ(Результат);
			КонецЕсли;	
		КонецЕсли;	
		
		ЗапросРасчетВМ.Текст = "ВЫБРАТЬ
		                       |	СУММА(НачисленияСКВ.СуммаСКВ) КАК СуммаСКВ,
		                       |	СУММА(НачисленияСКВ.СуммаДБ) КАК СуммаДБ,
		                       |	СУММА(НачисленияСКВ.СуммаДоп) КАК СуммаДоп,
		                       |	НачисленияСКВ.Ссылка
		                       |ПОМЕСТИТЬ НачисленияСКВ
		                       |ИЗ
		                       |	(ВЫБРАТЬ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер КАК СуммаСКВ,
		                       |		0 КАК СуммаДБ,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка КАК Ссылка,
		                       |		0 КАК СуммаДоп
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		                       |	
		                       |	ОБЪЕДИНИТЬ ВСЕ
		                       |	
		                       |	ВЫБРАТЬ
		                       |		0,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка,
		                       |		ВЫБОР
		                       |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |					И уб_ОплатаПолисовРасчетыПоДокументу.Уточнение ПОДОБНО ""ДК%""
		                       |				ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаМенеджеру)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер <> 0) КАК НачисленияСКВ
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	НачисленияСКВ.Ссылка
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	уб_ПараметрыБСОСрезПоследних.ВидБСО,
		                       |	уб_ПараметрыБСОСрезПоследних.Значение
		                       |ПОМЕСТИТЬ ПараметрыБСО
		                       |ИЗ
		                       |	РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&ДатаКонца, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	полис.СтраховойПолис.Страхователь КАК Страхователь,
		                       |	ВЫБОР
		                       |		КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) >= ДАТАВРЕМЯ(2022, 12, 1)
		                       |			ТОГДА ВЫБОР
		                       |					КОГДА Выбор когда ТипЗначения(полис.СтраховойПолис.СтраховойПродукт) = Тип (Справочник.уб_СтраховыеПродукты) Тогда полис.СтраховойПолис.СтраховойПродукт.Вид иначе полис.СтраховойПолис.СтраховойПродукт Конец В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО))
		                       |						ТОГДА уб_ТранспортныеСредства.ИдентификационныйНомер
		                       |					ИНАЧЕ полис.СтраховойПолис.ОбъектСтрахования
		                       |				КОНЕЦ
		                       |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		                       |	КОНЕЦ КАК ОбъектСтрахования,
		                       |	ВЫБОР
		                       |		КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) >= ДАТАВРЕМЯ(2022, 12, 1)
		                       |			ТОГДА полис.ВидС
		                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уб_видыСтраховыхПродуктов.ПустаяСсылка)
		                       |	КОНЕЦ КАК ВидСП,
		                       |	МИНИМУМ(НАЧАЛОПЕРИОДА(полис.ЗарплатныйПериод, МЕСЯЦ)) КАК ДатаНачала
		                       |ПОМЕСТИТЬ ДатыПервыхПолисов
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК полис
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		                       |		ПО полис.СтраховойПолис.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
		                       |ГДЕ
		                       |	полис.ПометкаУдаления = ЛОЖЬ
		                       |	И полис.ОплаченоФакт > 0
		                       |	И ВЫБОР
		                       |			КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) < ДАТАВРЕМЯ(2022, 12, 1)
		                       |				ТОГДА ИСТИНА
		                       |			КОГДА полис.ЗарплатныйПериод >= ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -15)
		                       |				ТОГДА ИСТИНА
		                       |			ИНАЧЕ ЛОЖЬ
		                       |		КОНЕЦ
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	полис.СтраховойПолис.Страхователь,
		                       |	ВЫБОР
		                       |		КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) >= ДАТАВРЕМЯ(2022, 12, 1)
		                       |			ТОГДА ВЫБОР
		                       |					КОГДА Выбор когда ТипЗначения(полис.СтраховойПолис.СтраховойПродукт) = Тип (Справочник.уб_СтраховыеПродукты) Тогда полис.СтраховойПолис.СтраховойПродукт.Вид иначе полис.СтраховойПолис.СтраховойПродукт Конец В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО))
		                       |						ТОГДА уб_ТранспортныеСредства.ИдентификационныйНомер
		                       |					ИНАЧЕ полис.СтраховойПолис.ОбъектСтрахования
		                       |				КОНЕЦ
		                       |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		                       |	КОНЕЦ,
		                       |	ВЫБОР
		                       |		КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) >= ДАТАВРЕМЯ(2022, 12, 1)
		                       |			ТОГДА полис.ВидС
		                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уб_видыСтраховыхПродуктов.ПустаяСсылка)
		                       |	КОНЕЦ
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	МИНИМУМ(уб_КвитовкаОплат.ПриемОплаты.ДатаСоздания) КАК ДатаПриемки,
		                       |	уб_КвитовкаОплат.ОплатаПолиса
		                       |ПОМЕСТИТЬ ДатыПриемки
		                       |ИЗ
		                       |	РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	уб_КвитовкаОплат.ОплатаПолиса
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, ОП.СхемаРасчетаСМенеджером) КАК СхемаРасчетаСМенеджером,
		                       |	ОП.Ссылка,
		                       |	ВЫБОР
		                       |		КОГДА &ЭтоВариант20191001
		                       |				И ОП.СтраховойПолис.Заявка.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация)
		                       |			ТОГДА ИСТИНА
		                       |		ИНАЧЕ ЛОЖЬ
		                       |	КОНЕЦ КАК ЭтоПролонгация,
		                       |	ОП.ВерсияДанных,
		                       |	ОП.ПометкаУдаления,
		                       |	ОП.Номер,
		                       |	ОП.Дата,
		                       |	ОП.Проведен,
		                       |	ОП.АВилиСкидкаПроцент,
		                       |	ОП.АВилиСкидкаСумма,
		                       |	ОП.Агент,
		                       |	ОП.Баланс_Брокер_Поставщик,
		                       |	ОП.Валюта,
		                       |	ОП.ВидРасчетаСАгентом,
		                       |	Выбор Когда ОП.ВидС = Значение(Перечисление.уб_ВидыСтрахования.КАСКО) Тогда ОП.ВидС Когда ОП.ВидС = Значение(Перечисление.уб_ВидыСтрахования.ОСАГО) Тогда ОП.ВидС Иначе ""Прочие виды"" Конец как ВидСП,
		                       |	ОП.ВМпоРезультатамПериодаЗП,
		                       |	ОП.ВознаграждениеМенеджера,
		                       |	ЕСТЬNULL(НачисленияСКВ.СуммаДоп, 0) КАК ВознаграждениеДоп,
		                       |	ОП.ВычетСАгента,
		                       |	ОП.ДатаМониторинга,
		                       |	ОП.ДатаПроведенияБСО,
		                       |	ОП.ДокументВыгрузкиВУП,
		                       |	ОП.ЕстьКвитанция,
		                       |	ОП.ЗарплатныйПериод,
		                       |	ОП.ИсключенаИзВзаиморасчетов,
		                       |	ОП.ИсключитьИзРасчетаЗП,
		                       |	ОП.КВПодВопросом,
		                       |	ОП.КВПроцент,
		                       |	ОП.КВПроцентДляАгента,
		                       |	ОП.КВПроцентДляОтчета,
		                       |	ОП.КВСумма,
		                       |	ОП.КВСуммаДляАгента,
		                       |	ОП.КВСуммаДляОтчета,
		                       |	ОП.КодКВ,
		                       |	ОП.Комментарий,
		                       |	ОП.КОплатеАгентом,
		                       |	ОП.Курс,
		                       |	ОП.Курьер,
		                       |	ОП.НачисленнаяСуммаВзноса,
		                       |	ОП.НачисленнаяСуммаВзносаВВалюте,
		                       |	ОП.НеВключатьВОтчетыПоставщикам,
		                       |	ОП.НеМенятьАВ,
		                       |	ОП.НеМенятьВК,
		                       |	ОП.НеМенятьКВ,
		                       |	ОП.НомерВзноса,
		                       |	ОП.НомерКвитанции,
		                       |	ОП.НомерРасчетногоСчета,
		                       |	ОП.ОплаченоФакт,
		                       |	ОП.ОрганизацияАгент,
		                       |	ОП.ОтчетАгента,
		                       |	ОП.ОтчетПоКарточкам,
		                       |	ОП.ОтчетПоставщику,
		                       |	ОП.ПересчетКВ,
		                       |	ОП.ПлатежныйДокумент_Дата,
		                       |	ОП.ПлатежныйДокумент_Номер,
		                       |	ОП.Подразделение,
		                       |	ОП.ПолисАннулирован,
		                       |	ОП.ПолнаяСтраховаяПремия,
		                       |	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		                       |	ОП.Поставщик,
		                       |	ОП.Проблемная,
		                       |	ОП.СК,
		                       |	ОП.СкидкаВыплаченаяКлиенту,
		                       |	ОП.СтраховойПолис,
		                       |	ОП.СтраховойПродукт,
		                       |	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		                       |	ОП.СхемаРасчетаСМенеджером КАК СхемаРасчетаСМенеджером1,
		                       |	ОП.Счет,
		                       |	ОП.ФормаОплаты,
		                       |	ОП.ЭтоКрупнаяСделка,
		                       |	ОП.ПричинаИсключенияИзОП,
		                       |	ОП.СписатьСКурьера,
		                       |	ОП.ОкруглятьКВДо2Знаков,
		                       |	ОП.ДБ,
		                       |	ОП.ВМРасчетное,
		                       |	ОП.ПроверенаЗП,
		                       |	ОП.РазрядностьОкругления,
		                       |	ОП.РежимОкругления,
		                       |	ОП.НаправлениеПлатежа,
		                       |	ОП.Риск,
		                       |	ОП.СуммаДоп,
		                       |	ОП.УдержаноСК,
		                       |	ОП.Куратор,
		                       |	ОП.ПроцентСКВ,
		                       |	ОП.Автор,
		                       |	ОП.ДатаСоздания,
		                       |	ОП.Модификатор,
		                       |	ОП.ДатаИзменения,
		                       |	ОП.РасчетыПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		УидСтроки,
		                       |		СуммаКлиент,
		                       |		СуммаМенеджер,
		                       |		СуммаБрокер,
		                       |		СуммаБрокерВС,
		                       |		Уточнение,
		                       |		ВремяРегистрации,
		                       |		Автор
		                       |	),
		                       |	ОП.УслугиПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		Сумма,
		                       |		Себестоимость,
		                       |		УидСтроки,
		                       |		СхемаОплаты,
		                       |		ВМ,
		                       |		СхемаОплатыРОП,
		                       |		ВР
		                       |	),
		                       |	0 КАК ПартнерскоеВознаграждение,
		                       |	ОП.Подразделение.Владелец КАК Организация,
		                       |	ВЫБОР
		                       |		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		                       |				ИЛИ ОП.Агент В (&СотрудникиМастера)
		                       |			ТОГДА ИСТИНА
		                       |		ИНАЧЕ ЛОЖЬ
		                       |	КОНЕЦ КАК НеОплачиватьКС,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		                       |		ИНАЧЕ ВЫБОР
		                       |				КОГДА ОП.ОплаченоФакт > 0
		                       |						И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		                       |					ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ * (100 - ОП.ПроцентСКВ) / 100
		                       |	КОНЕЦ КАК СКВ,
		                       |	ЕСТЬNULL(НачисленияСКВ.СуммаДБ, 0) КАК СуммаДБ,
		                       |	ОП.СтраховойПолис.СК КАК СП_СК,
		                       |	Выбор Когда ОП.ВидС = Значение(Перечисление.уб_ВидыСтрахования.КАСКО) Тогда ОП.ВидС Когда ОП.ВидС = Значение(Перечисление.уб_ВидыСтрахования.ОСАГО) Тогда ОП.ВидС Иначе ""Прочие виды"" Конец КАК СП_ВидСП,
		                       |	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		                       |	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		                       |	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		                       |	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		                       |	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		                       |	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		                       |	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		                       |	ОП.СтраховойПолис.Сделка КАК Сделка,
		                       |	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК Интервалы,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК ИнтервалыРОП,
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		                       |	ВЫБОР
		                       |		КОГДА ОП.НомерВзноса = 1
		                       |				И (ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		                       |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
							   |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека))
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК КоличествоФакт,
		                       |	1 КАК ЕД,
		                       |	ЕСТЬNULL(ВЫРАЗИТЬ(ПараметрыБСО.Значение КАК ЧИСЛО(10, 0)), ВЫБОР
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
		                       |				ТОГДА 0
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
		                       |					И ОП.НачисленнаяСуммаВзноса < 1500
		                       |				ТОГДА 0
		                       |			ИНАЧЕ 1
		                       |		КОНЕЦ) КАК КоэффициентВида,
		                       |	ВЫБОР
		                       |		КОГДА ОП.Направление = ЗНАЧЕНИЕ(Перечисление.Уб_Направления.НовыйКлиент)
		                       |			ТОГДА 1
		                       |		КОГДА ОП.Направление = ЗНАЧЕНИЕ(Перечисление.Уб_Направления.Пролонгация)
		                       |			ТОГДА 0
		                       |		КОГДА НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) = ДатыПервыхПолисов.ДатаНачала
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК НовыйКлиент,
		                       |	ЕСТЬNULL(ДатыПриемки.ДатаПриемки, ОП.ДатаСоздания) КАК ДатаПриемки
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК ОП
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		                       |		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		                       |		ПО ОП.СтраховойПолис.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПервыхПолисов КАК ДатыПервыхПолисов
		                       |		ПО ОП.СтраховойПолис.Страхователь = ДатыПервыхПолисов.Страхователь
		                       |			И (ВЫБОР
		                       |				КОГДА &ДатаНачала < ДАТАВРЕМЯ(2022, 12, 1)
		                       |					ТОГДА ИСТИНА
		                       |				КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.КАСКО))
		                       |						И ДатыПервыхПолисов.ВидСП = ОП.ВидС
		                       |						И уб_ТранспортныеСредства.ИдентификационныйНомер ПОДОБНО ВЫРАЗИТЬ(ДатыПервыхПолисов.ОбъектСтрахования КАК СТРОКА)
		                       |					ТОГДА ИСТИНА
		                       |				КОГДА ОП.СтраховойПолис.ОбъектСтрахования = ДатыПервыхПолисов.ОбъектСтрахования
		                       |						И ДатыПервыхПолисов.ВидСП = ОП.ВидС
		                       |					ТОГДА ИСТИНА
		                       |				ИНАЧЕ ЛОЖЬ
		                       |			КОНЕЦ)
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПриемки КАК ДатыПриемки
		                       |		ПО ОП.Ссылка = ДатыПриемки.ОплатаПолиса
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСКВ КАК НачисленияСКВ
		                       |		ПО (НачисленияСКВ.Ссылка = ОП.Ссылка)" + УсловиеОтбораОплат;
		#Если Клиент Тогда
			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам периода");
		#КонецЕсли
		Если СКВДляДенег Тогда
			ЗапросРасчетВМ.Текст = Стрзаменить(ЗапросРасчетВМ.Текст,"ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО","ЛОЖЬ");//В ТЧ фигурирует только КВСуммаДляАгента, далее подумать, как в 1С деньги переносить разницу
			ЗапросРасчетВМ.Текст = Стрзаменить(ЗапросРасчетВМ.Текст,"КВСуммаДляАгента","КВСумма");
		КонецЕсли;	
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачалаАВиТО",ДатаНачалаАВиТО);
		ЗапросРасчетВМ.УстановитьПараметр("ЭтоВариант20191001",ЭтоВариант20191001);
		
		
		
		
		
		ТЗ1	= ЗапросРасчетВМ.Выполнить().Выгрузить();
		
		ИмяФайла = "D:\!1C\_выгрузка\ТЗ1_"+Формат(ЗарплатныйПериод,"ДФ=yyyy-MM-dd");
		Файл = Новый Файл(ИмяФайла);
		СчеткиОбновлено = 0;
		Если СчитатьНаправления и Файл.Существует() Тогда
			ТзВременная = ЗначениеИзФайла(ИмяФайла);
			
			Для каждого Строкаб из ТЗ1 Цикл
				нСтроки = ТзВременная.НайтиСтроки(Новый Структура("Номер",Строкаб.Номер));
				
				Если нСтроки.Количество()>0 Тогда
					СтрокаФ = нСтроки[0];
					Если НЕ СтрокаФ.НовыйКлиент = СтрокаБ.НовыйКлиент Тогда
						ОбъектОплаты = Документы.уб_ОплатаПолисов.НайтиПоНомеру(СтрокаФ.НОмер);
						Если Не ОбъектОплаты.Пустая() Тогда
							ОбъектОплаты = ОбъектОплаты.ПолучитьОбъект();
							ОбъектОплаты.ОбменДанными.Загрузка = Истина;
							Если СтрокаФ.НовыйКлиент = 1 Тогда
								ОбъектОплаты.Направление = Перечисления.Уб_Направления.НовыйКлиент; 
							Иначе
								ОбъектОплаты.Направление = Перечисления.Уб_Направления.Пролонгация; 
							КонецЕсли;	
							СчеткиОбновлено = СчеткиОбновлено+1;
							ОбъектОплаты.Записать();
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
			Сообщить("Обновлено направлений "+СчеткиОбновлено);
			Возврат;
		КонецЕсли;	
		
		ТЗ1.Колонки.Добавить("СКВ_Прол", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("СКВ_НБ", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("СКВ_БП", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("СКВ_БП_Прол", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("СКВ_БП_НБ", ОписаниеТипаЧисло14_2_но);
	
		//Сообщить(ТЗ1.Количество());
		//Сообщить(ТЗ1.Итог("НовыйКлиент"));
		//Сообщить(ТЗ1.Скопировать(Новый Структура("НовыйКлиент",1)).Итог("СКВ"));
		
		
	//тзСхемаРасчетаДляАгентов = ТЗ1.Скопировать(, "Агент,СхемаРасчетаСМенеджером");
	//тзСхемаРасчетаДляАгентов.Свернуть("Агент,СхемаРасчетаСМенеджером");
	//
	//Если ЭтоВариант20200201 Тогда
	//	ТЗ1.Сортировать("ДатаПриемки,Номер");
	//	
	//	СтруктураОтбораПродление = Новый Структура("СхемаРасчетаСМенеджером", ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	//	
	//	Сообщить(ТЗ1.Количество());
	//	Сообщить(ТЗ1.Итог("НовыйКлиент"));
	//	Для каждого СтрокаАгента из тзСхемаРасчетаДляАгентов.НайтиСтроки(СтруктураОтбораПродление) Цикл
	//		//нСтроки = ТЗАгентов.НайтиСтроки(Новый Структура("Агент",СтрокаАгента.Агент));
	//		//Если нСтроки.Количество() = 0 Тогда
	//		//	Сообщить("Не найден агент "+СтрокаАгента.Агент);
	//		//	Продолжить;
	//		//КонецЕсли;	
	//		
	//		СтруктураОтбораПродление.Вставить("Агент",СтрокаАгента.Агент);
	//		ОбщийСКВ = 0;
	//		СКВ_КС = 0;
	//		ПерваяБонусПланка = 250000;//нСтроки[0].ПерваяБонусПланка;
	//		Для каждого СтрокаТЗ1 из тз1.НайтиСтроки(СтруктураОтбораПродление) Цикл
	//			Если СтрокаТЗ1.СКВ = 0 Тогда
	//				Продолжить;
	//			КонецЕсли;	
	//			Если СтрокаТЗ1.ЭтоКрупнаяСделка =Истина Тогда
	//				СКВ_КС = СКВ_КС+СтрокаТЗ1.СКВ;
	//				СтрокаТЗ1.СКВ_КС = СтрокаТЗ1.СКВ;
	//			Иначе	
	//				Превышение = (ОбщийСКВ +СтрокаТЗ1.СКВ)-ПерваяБонусПланка;
	//				Если Превышение>0 Тогда
	//					//
	//					Если ОбщийСКВ> ПерваяБонусПланка Тогда
	//						//Уже превышен все бонуспланка
	//						СтрокаТЗ1.СКВ_БП   = СтрокаТЗ1.СКВ;
	//					Иначе
	//						//Только превысил
	//						В_СКВ = СтрокаТЗ1.СКВ - Превышение;	
	//						Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
	//							СтрокаТЗ1.СКВ_Прол = 0;
	//							СтрокаТЗ1.СКВ_НБ   = В_СКВ;
	//						Иначе
	//							СтрокаТЗ1.СКВ_Прол = В_СКВ;
	//							СтрокаТЗ1.СКВ_НБ   = 0;
	//						КонецЕсли;
	//						СтрокаТЗ1.СКВ_БП   = Превышение;
	//					КонецЕсли;	
	//				Иначе
	//					Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
	//						СтрокаТЗ1.СКВ_Прол = 0;
	//						СтрокаТЗ1.СКВ_НБ   = СтрокаТЗ1.СКВ;
	//					Иначе
	//						СтрокаТЗ1.СКВ_Прол = СтрокаТЗ1.СКВ;
	//						СтрокаТЗ1.СКВ_НБ   = 0;
	//					КонецЕсли;
	//				КонецЕсли;	
	//				ОбщийСКВ = ОбщийСКВ +СтрокаТЗ1.СКВ;
	//				
	//			КонецЕсли;	
	//			
	//		КонецЦикла;
	//		
	//	КонецЦикла;
	//	Сообщить("СКВ: "+Тз1.Итог("СКВ"));
	//	Сообщить("Пролонгация : "+Тз1.Итог("СКВ_Прол"));
	//	Сообщить("Новый бизнес: "+Тз1.Итог("СКВ_НБ"));
	//	
	//	//Для каждого СтрокаТЗ1 из тз1.НайтиСтроки(СтруктураОтбораПродление) Цикл
	//	//	Если СтрокаТЗ1.НовыйКлиент = Истина Тогда
	//	//		СтрокаТЗ1.СКВ_Прол = 0;
	//	//		СтрокаТЗ1.СКВ_НБ   = СтрокаТЗ1.СКВ;
	//	//	Иначе
	//	//		СтрокаТЗ1.СКВ_Прол = СтрокаТЗ1.СКВ;
	//	//		СтрокаТЗ1.СКВ_НБ   = 0;
	//	//	КонецЕсли;	
	//	//КонецЦикла;	
	//КонецЕсли;	
	

		
		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДобавитьМесяц(ДатаНачала,-12));
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДобавитьМесяц(ДатаКонца,-12));
		
		ТЗ1_ГодНазад	= ЗапросРасчетВМ.Выполнить().Выгрузить();
		
		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДатаНачала);
		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДатаКонца);
		
		//Дополнение остальными схемами
		//АВ безнал и поставщику включаются по флажку проверена ЗП (когда действительно нам перечислят КВ)
		ЗапросРасчетВМ.Текст = "ВЫБРАТЬ
		                       |	СУММА(НачисленияСКВ.СуммаСКВ) КАК СуммаСКВ,
		                       |	СУММА(НачисленияСКВ.СуммаВМ) КАК СуммаВМ,
							   |	СУММА(НачисленияСКВ.СуммаДоп) КАК СуммаДоп,
		                       |	СУММА(НачисленияСКВ.суммаДБ) КАК суммаДБ,
		                       |	НачисленияСКВ.Схема,
		                       |	НачисленияСКВ.Ссылка
		                       |ПОМЕСТИТЬ НачисленияСКВ
		                       |ИЗ
		                       |	(ВЫБРАТЬ
		                       |		СУММА(ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |					ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ) КАК СуммаСКВ,
		                       |		СУММА(ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |					ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ) КАК СуммаВМ, 
							   |		СУММА(ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ) и РасчетыПоОплате.Уточнение Подобно ""ДК%""
		                       |					ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ) КАК СуммаДоп, 
							   |		СУММА(0) КАК суммаДБ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
		                       |			ИНАЧЕ ЕСТЬNULL(УслугиПоОплате.СхемаОплаты, РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером)
		                       |		КОНЕЦ КАК Схема,
		                       |		РасчетыПоОплате.Ссылка КАК Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК РасчетыПоОплате
		                       |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов.УслугиПоДокументу КАК УслугиПоОплате
		                       |			ПО РасчетыПоОплате.Ссылка = УслугиПоОплате.Ссылка
		                       |				И РасчетыПоОплате.УидСтроки = УслугиПоОплате.УидСтроки
		                       |	ГДЕ
		                       |		РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И ВЫБОР
		                       |				КОГДА РасчетыПоОплате.Ссылка.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Безнал), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику), ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ВКредит))
		                       |					ТОГДА РасчетыПоОплате.Ссылка.ПроверенаЗП
		                       |				ИНАЧЕ ИСТИНА
		                       |			КОНЕЦ
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И РасчетыПоОплате.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |	
		                       |	СГРУППИРОВАТЬ ПО
		                       |		РасчетыПоОплате.Ссылка,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ,
		                       |		ВЫБОР
		                       |			КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
		                       |			ИНАЧЕ ЕСТЬNULL(УслугиПоОплате.СхемаОплаты, РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером)
		                       |		КОНЕЦ
		                       |	
		                       |	ИМЕЮЩИЕ
		                       |		(СУММА(ВЫБОР
		                       |					КОГДА РасчетыПоОплате.Вид <> ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |						ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |					ИНАЧЕ 0
		                       |				КОНЕЦ) <> 0
		                       |			ИЛИ СУММА(ВЫБОР
		                       |					КОГДА РасчетыПоОплате.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		                       |						ТОГДА РасчетыПоОплате.СуммаМенеджер
		                       |					ИНАЧЕ 0
		                       |				КОНЕЦ) <> 0
		                       |			ИЛИ МАКСИМУМ(РасчетыПоОплате.Ссылка.СхемаРасчетаСМенеджером) = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ))
		                       |	
		                       |	ОБЪЕДИНИТЬ ВСЕ
		                       |	
		                       |	ВЫБРАТЬ
		                       |		0,
		                       |		0,0,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером,
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		                       |	ИЗ
		                       |		Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		                       |	ГДЕ
		                       |		уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаМенеджеру)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		                       |		И уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер <> 0) КАК НачисленияСКВ
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	НачисленияСКВ.Схема,
		                       |	НачисленияСКВ.Ссылка
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	уб_ПараметрыБСОСрезПоследних.ВидБСО,
		                       |	уб_ПараметрыБСОСрезПоследних.Значение
		                       |ПОМЕСТИТЬ ПараметрыБСО
		                       |ИЗ
		                       |	РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&ДатаКонца, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, НачисленияСКВ.Схема) КАК СхемаРасчетаСМенеджером,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаВМ, 0)
		                       |		ИНАЧЕ ОП.ВознаграждениеМенеджера 
		                       |	КОНЕЦ КАК ВознаграждениеМенеджера,
							   |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= ДатаВремя(2021,2,1)
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаДоп, 0)
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК ВознаграждениеДоп,
		                       |	0 КАК ПартнерскоеВознаграждение,
		                       |	ОП.Ссылка,
		                       |	ОП.ВерсияДанных,
		                       |	ОП.ПометкаУдаления,
		                       |	ОП.Номер,
		                       |	ОП.Дата,
		                       |	ОП.Проведен,
		                       |	ОП.АВилиСкидкаПроцент,
		                       |	ОП.АВилиСкидкаСумма,
		                       |	ОП.Агент,
		                       |	ОП.Куратор,
		                       |	ОП.Баланс_Брокер_Поставщик,
		                       |	ОП.Валюта,
		                       |	ОП.ВидРасчетаСАгентом,
		                       |	ОП.ВидС как ВидСП,
		                       |	ОП.ВМпоРезультатамПериодаЗП,
		                       |	ОП.ВознаграждениеМенеджера КАК ВознаграждениеМенеджера1,
		                       |	ОП.ВычетСАгента,
		                       |	ОП.ДатаМониторинга,
		                       |	ОП.ДатаПроведенияБСО,
		                       |	ОП.ДокументВыгрузкиВУП,
		                       |	ОП.ЕстьКвитанция,
		                       |	ОП.ЗарплатныйПериод,
		                       |	ОП.ИсключенаИзВзаиморасчетов,
		                       |	ОП.ИсключитьИзРасчетаЗП,
		                       |	ОП.КВПодВопросом,
		                       |	ОП.КВПроцент,
		                       |	ОП.КВПроцентДляАгента,
		                       |	ОП.КВПроцентДляОтчета,
		                       |	ОП.КВСумма,
		                       |	ОП.КВСуммаДляАгента,
		                       |	ОП.КВСуммаДляОтчета,
		                       |	ОП.КодКВ,
		                       |	ОП.Комментарий,
		                       |	ОП.КОплатеАгентом,
		                       |	ОП.Курс,
		                       |	ОП.Курьер,
		                       |	ОП.НачисленнаяСуммаВзноса,
		                       |	ОП.НачисленнаяСуммаВзносаВВалюте,
		                       |	ОП.НеВключатьВОтчетыПоставщикам,
		                       |	ОП.НеМенятьАВ,
		                       |	ОП.НеМенятьВК,
		                       |	ОП.НеМенятьКВ,
		                       |	ОП.НомерВзноса,
		                       |	ОП.НомерКвитанции,
		                       |	ОП.НомерРасчетногоСчета,
		                       |	ОП.ОплаченоФакт,
		                       |	ОП.ОрганизацияАгент,
		                       |	ОП.ОтчетАгента,
		                       |	ОП.ОтчетПоКарточкам,
		                       |	ОП.ОтчетПоставщику,
		                       |	ОП.ПересчетКВ,
		                       |	ОП.ПлатежныйДокумент_Дата,
		                       |	ОП.ПлатежныйДокумент_Номер,
		                       |	ОП.Подразделение,
		                       |	ОП.ПолисАннулирован,
		                       |	ОП.ПолнаяСтраховаяПремия,
		                       |	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		                       |	ОП.Поставщик,
		                       |	ОП.Проблемная,
		                       |	ОП.СК,
		                       |	ОП.СкидкаВыплаченаяКлиенту,
		                       |	ОП.СтраховойПолис,
		                       |	ОП.СтраховойПродукт,
		                       |	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		                       |	ОП.СхемаРасчетаСМенеджером КАК СхемаРасчетаСМенеджером1,
		                       |	ОП.Счет,
		                       |	ОП.ФормаОплаты,
		                       |	ОП.ЭтоКрупнаяСделка,
		                       |	ОП.ПричинаИсключенияИзОП,
		                       |	ОП.СписатьСКурьера,
		                       |	ОП.ОкруглятьКВДо2Знаков,
		                       |	ОП.ДБ,
		                       |	ЕСТЬNULL(НачисленияСКВ.суммаДБ, 0) КАК СуммаДБ,
		                       |	ОП.ВМРасчетное,
		                       |	ОП.ПроверенаЗП,
		                       |	ОП.РазрядностьОкругления,
		                       |	ОП.РежимОкругления,
		                       |	ОП.НаправлениеПлатежа,
		                       |	ОП.Риск,
		                       |	ОП.СуммаДоп,
		                       |	ОП.Автор,
		                       |	ОП.ДатаСоздания,
		                       |	ОП.Модификатор,
		                       |	ОП.ДатаИзменения,
		                       |	ОП.РасчетыПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		УидСтроки,
		                       |		СуммаКлиент,
		                       |		СуммаМенеджер,
		                       |		СуммаБрокер,
		                       |		СуммаБрокерВС,
		                       |		Уточнение,
		                       |		ВремяРегистрации,
		                       |		Автор
		                       |	),
		                       |	ОП.УслугиПоДокументу.(
		                       |		Ссылка,
		                       |		НомерСтроки,
		                       |		Вид,
		                       |		Сумма,
		                       |		Себестоимость,
		                       |		УидСтроки,
		                       |		СхемаОплаты,
		                       |		ВМ
		                       |	),
		                       |	ОП.Подразделение.Владелец КАК Организация,
		                       |	ВЫБОР
		                       |		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		                       |				ИЛИ ОП.Агент В (&СотрудникиМастера)
		                       |			ТОГДА ИСТИНА
		                       |		ИНАЧЕ ЛОЖЬ
		                       |	КОНЕЦ КАК НеОплачиватьКС,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаСКВ, 0)
		                       |		ИНАЧЕ ВЫБОР
		                       |				КОГДА ОП.ОплаченоФакт > 0
		                       |						И ОП.КВСуммаДляАгента > ОП.АВилиСкидкаСумма
		                       |					ТОГДА ОП.КВСуммаДляАгента - ОП.АВилиСкидкаСумма
		                       |				ИНАЧЕ 0
		                       |			КОНЕЦ
		                       |	КОНЕЦ КАК СКВ,
		                       |	ВЫБОР
		                       |		КОГДА ОП.ЗарплатныйПериод >= &ДатаНачалаАВиТО
		                       |			ТОГДА ЕСТЬNULL(НачисленияСКВ.СуммаВМ, 0)
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК СуммаВМ,
		                       |	ОП.СтраховойПолис.СК КАК СП_СК,
		                       |	ОП.ВидС КАК СП_ВидСП,
		                       |	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		                       |	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		                       |	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		                       |	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		                       |	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		                       |	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		                       |	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		                       |	ОП.СтраховойПолис.Сделка КАК Сделка,
		                       |	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		                       |	ВЫРАЗИТЬ(ВЫБОР
		                       |			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		                       |			ИНАЧЕ 0
		                       |		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК Интервалы,
		                       |	ВЫБОР
		                       |		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		                       |			ТОГДА НЕОПРЕДЕЛЕНО
		                       |		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		                       |	КОНЕЦ КАК ИнтервалыРОП,
		                       |	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		                       |	ВЫБОР
		                       |		КОГДА ОП.НомерВзноса = 1
		                       |				И (ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		                       |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
							   |					ИЛИ ОП.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека))
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК КоличествоФакт,
		                       |	1 КАК ЕД,
		                       |	ЕСТЬNULL(Выразить (ПараметрыБСО.Значение как ЧИСЛО(10,0)), ВЫБОР
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
		                       |				ТОГДА 0
		                       |			КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
		                       |					И ОП.НачисленнаяСуммаВзноса < 1500
		                       |				ТОГДА 0
		                       |			ИНАЧЕ 1
		                       |		КОНЕЦ) КАК КоэффициентВида,0 как НовыйКлиент
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК ОП
		                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСКВ КАК НачисленияСКВ
		                       |		ПО (НачисленияСКВ.Ссылка = ОП.Ссылка)
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		                       |		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО";
		ТЗ1Доп = ЗапросРасчетВМ.Выполнить().Выгрузить();					   
		Для каждого СтрокаТЗ1Доп Из ТЗ1Доп Цикл
			СтрокаТЗ1 = ТЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ1,СтрокаТЗ1Доп);
		КонецЦикла;
		
		////Партнерские расчеты
		//
		//ЗапросПартнерскийСКВ = Новый Запрос;
		//ЗапросПартнерскийСКВ.Текст = "ВЫБРАТЬ
		//							 |	уб_ОплатаПолисовРасчетыПоДокументу.Уточнение КАК Агент,
		//							 |	СУММА(0) КАК СуммаВМ,
		//							 |	СУММА(ВЫБОР
		//							 |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |				ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		//							 |			ИНАЧЕ 0
		//							 |		КОНЕЦ) КАК ПартнерскоеВознаграждение,
		//							 |	1 КАК КоличествоФакт,
		//							 |	1 КАК ед,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру)
		//							 |		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентОтСебестоимости)
		//							 |	КОНЕЦ КАК СхемаРасчетаСМенеджером,
		//							 |	0 КАК СКВ,
		//							 |	0 КАК КВСуммаДляАгента,
		//							 |	0 КАК АВилиСкидкаСумма,
		//							 |	0 КАК ВычетСАгента,
		//							 |	0 КАК ОплаченоФакт,
		//							 |	0 КАК НачисленнаяСуммаВзноса,
		//							 |	0 КАК СуммаДБ, 0 как КоэффициентВида,0 как НовыйКлиент,
		//							 |	СУММА(ВЫБОР
		//							 |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП)
		//							 |				ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		//							 |			ИНАЧЕ 0
		//							 |		КОНЕЦ) КАК ВознаграждениеМенеджера,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(Документ.уб_ОплатаПолисов.ПустаяСсылка)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		//							 |	КОНЕЦ КАК Ссылка,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СтраховойПолис.Страхователь
		//							 |	КОНЕЦ КАК Страхователь,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Дата
		//							 |	КОНЕЦ КАК Дата,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА """"
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Номер
		//							 |	КОНЕЦ КАК Номер,
		//							 |	СУММА(ВЫБОР
		//							 |			КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |				ТОГДА 0
		//							 |			ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.СуммаБрокер
		//							 |		КОНЕЦ) КАК ПолнаяПремия
		//							 |ИЗ
		//							 |	Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		//							 |ГДЕ
		//							 |	(уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ИЛИ уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП))
		//							 |	И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод >= &ДатаНачала
		//							 |	И уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.ЗарплатныйПериод <= &ДатаКонца
		//							 |	И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		//							 |
		//							 |СГРУППИРОВАТЬ ПО
		//							 |	уб_ОплатаПолисовРасчетыПоДокументу.Уточнение,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру)
		//							 |		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентОтСебестоимости)
		//							 |	КОНЕЦ,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(Документ.уб_ОплатаПолисов.ПустаяСсылка)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка
		//							 |	КОНЕЦ,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.СтраховойПолис.Страхователь
		//							 |	КОНЕЦ,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Дата
		//							 |	КОНЕЦ,
		//							 |	ВЫБОР
		//							 |		КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |			ТОГДА """"
		//							 |		ИНАЧЕ уб_ОплатаПолисовРасчетыПоДокументу.Ссылка.Номер
		//							 |	КОНЕЦ
		//							 |
		//							 |ИМЕЮЩИЕ
		//							 |	(СУММА(ВЫБОР
		//							 |				КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СКВПартнера)
		//							 |					ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		//							 |				ИНАЧЕ 0
		//							 |			КОНЕЦ) <> 0
		//							 |		ИЛИ СУММА(ВЫБОР
		//							 |				КОГДА уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеРОП)
		//							 |					ТОГДА уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер
		//							 |				ИНАЧЕ 0
		//							 |			КОНЕЦ) <> 0)";
		//						 		ЗапросПартнерскийСКВ.УстановитьПараметр("ДатаНачала",ДатаНачала);
		//ЗапросПартнерскийСКВ.УстановитьПараметр("ДатаКонца",ДатаКонца);
		//ТЗ1Партнеры = ЗапросПартнерскийСКВ.Выполнить().Выгрузить();					   
		//
		//Для каждого СтрокаТЗ1Партнеры Из ТЗ1Партнеры Цикл
		//	СтрокаТЗ1 = ТЗ1.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаТЗ1,СтрокаТЗ1Партнеры);
		//	СтрокаТЗ1.Подразделение = АгенскаяСеть;
		//КонецЦикла;						 
		
	Иначе		
		///////////////////////////////////////////////////////////////////
		// Запрос на основе данных из регистра уб_ИсторияРеквизит
		///////////////////////////////////////////////////////////////////
		СоотОрганизацийПодразделениям = ПолучитьСоответствиеОрганизацийПодразделениям();
		//Получаем оплаты из истории
		ЗапросПоОплатамИзИстории = Новый Запрос;
		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата1",ДатаНачала);										
		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата2",ДатаКонца);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("ДатаСреза",ДатаСреза);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("ЭтоВариант20191001",ЭтоВариант20191001);
		ЗапросПоОплатамИзИстории.УстановитьПараметр("СотрудникиМастера",ЭтоМастер());
		ЗапросПоОплатамИзИстории.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.НомерВзноса = 1
		|				И (уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		|					ИЛИ уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)
		|                   ИЛИ уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ИПОТЕКА))
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоФакт,
		|	ВЫРАЗИТЬ(уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК Оплата,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.Агент КАК Агент,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.Подразделение.НеОплачиватьКС КАК НеОплачиватьКС,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидС КАК ВидСП,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидБСОПолиса КАК ВидБСОПолиса,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.СтраховойПолис.Страхователь КАК Страхователь,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса
		|ПОМЕСТИТЬ ОплатыМесяца
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаСреза,
		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|				И РеквизитОбъекта.Наименование = ""ЗарплатныйПериод"") КАК уб_ИсторияРеквизитСрезПоследних
		|ГДЕ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита >= &Дата1
		|	И уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита <= &Дата2
		|;
							   |ВЫБРАТЬ
							   |  МИНИМУМ(уб_КвитовкаОплат.ПриемОплаты.ДатаСоздания) КАК ДатаПриемки,
							   |  уб_КвитовкаОплат.ОплатаПолиса
							   |Поместить ДатыПриемки
							   |ИЗ
							   |РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
							   |//ГДЕ
							   |//	НАЧАЛОПЕРИОДА(уб_КвитовкаОплат.ОплатаПолиса.ЗарплатныйПериод, МЕСЯЦ) = &ЗарплатныйПериод
							   |
							   |СГРУППИРОВАТЬ ПО
							   |уб_КвитовкаОплат.ОплатаПолиса
		                       |;

		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыМесяца.Оплата,
		|   Выбор когда &ЭтоВариант20191001 и (ОП.СтраховойПолис.Заявка.Тип = Значение(Перечисление.уб_ТипВыезда.Пролонгация))  Тогда Истина Иначе ЛОжь Конец как ЭтоПролонгация,
		|	ОплатыМесяца.КоличествоФакт,
		|	ВЫБОР
		|		КОГДА ОплатыМесяца.НеОплачиватьКС = ИСТИНА
		|				ИЛИ ОплатыМесяца.Агент В (&СотрудникиМастера)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеОплачиватьКС,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ПараметрыБСО.Значение КАК ЧИСЛО(10, 0)), ВЫБОР
		|			КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.НС))
		|				ТОГДА 0
		|			КОГДА ОплатыМесяца.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.Произвольный))
		|					И ОплатыМесяца.НачисленнаяСуммаВзноса < 1500
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоэффициентВида,
		|	ВЫБОР        Когда ОП.Направление = Значение(Перечисление.Уб_Направления.НовыйКлиент) Тогда 1  Когда ОП.Направление = Значение(Перечисление.Уб_Направления.Пролонгация) Тогда 0 
							   //|		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
							   //|			ТОГДА 0
							   //|		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
							   //|				И ОП.НачисленнаяСуммаВзноса < 1500
							   //|			ТОГДА 0
		                       |		КОГДА НачалоПериода(ОП.ЗарплатныйПериод,МЕСЯЦ)=ДатыПервыхПолисов.ДатаНачала//РАЗНОСТЬДАТ(ДатыПервыхПолисов.ДатаНачала, &ДатаКонца, Секунда) < 90*3600*24
		                       |			ТОГДА 1
		                       |		ИНАЧЕ 0
		                       |	КОНЕЦ КАК НовыйКлиент, Isnull(ДатыПриемки.ДатаПриемки,ОП.ДатаСоздания) как  ДатаПриемки
		|ИЗ
		|	ОплатыМесяца КАК ОплатыМесяца
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			уб_ПараметрыБСОСрезПоследних.ВидБСО КАК ВидБСО,
		|			уб_ПараметрыБСОСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.уб_ПараметрыБСО.СрезПоследних(&Дата2, Параметр = ""Коэффициент плана"") КАК уб_ПараметрыБСОСрезПоследних) КАК ПараметрыБСО
		|		ПО (ПараметрыБСО.ВидБСО = ОплатыМесяца.ВидБСОПолиса)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                       |	Страховойполис.Страхователь как Страхователь,
		                       //|	МИНИМУМ(полис.ДатаНачала) КАК ДатаНачала
							   |МИНИМУМ(НачалоПериода(полис.ЗарплатныйПериод,МЕСЯЦ)) КАК ДатаНачала
		                       
		                       |ИЗ
		                       |	Документ.уб_ОплатаПолисов КАК полис
		                       |ГДЕ ПометкаУдаления = Ложь и ОплаченоФакт>0
		                       |	//НЕ Страховойполис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
		                       |	//И Страховойполис.СтраховаяПремия > 0
		                       |
		                       |СГРУППИРОВАТЬ ПО
		                       |	Страховойполис.Страхователь) КАК ДатыПервыхПолисов
		|		ПО (ДатыПервыхПолисов.Страхователь = ОплатыМесяца.Страхователь)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			Документ.уб_ОплатаПолисов КАК Оп
		|		ПО (ОП.Ссылка = ОплатыМесяца.Оплата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПриемки КАК ДатыПриемки
        |		ПО ОП.Ссылка = ДатыПриемки.ОплатаПолиса							   
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОП.Ссылка,
		|    Выбор когда &ЭтоВариант20191001 и (ОП.СтраховойПолис.Заявка.Тип = Значение(Перечисление.уб_ТипВыезда.Пролонгация))  Тогда Истина Иначе ЛОжь Конец как ЭтоПролонгация,
		|	ОП.ВерсияДанных,
		|	ОП.ПометкаУдаления,
		|	ОП.Номер,
		|	ОП.Дата,
		|	ОП.Проведен,
		|	ОП.АВилиСкидкаПроцент,
		|	ОП.АВилиСкидкаСумма,
		|	ОП.Агент,
		|	ОП.Куратор,
		|	ОП.Баланс_Брокер_Поставщик,
		|	ОП.Валюта,
		|	ОП.ВидРасчетаСАгентом,
		|	ОП.ВидС как ВидСП,
		|	ОП.ВМпоРезультатамПериодаЗП,
		|	ОП.ВознаграждениеМенеджера,
		|	0 как ВознаграждениеДоп,
		|	0 КАК ПартнерскоеВознаграждение,
		|	ОП.ВычетСАгента,
		|	ОП.ДатаМониторинга,
		|	ОП.ДатаПроведенияБСО,
		|	ОП.ДокументВыгрузкиВУП,
		|	ОП.ЕстьКвитанция,
		|	ОП.ЗарплатныйПериод,
		|	ОП.ИсключенаИзВзаиморасчетов,
		|	ОП.ИсключитьИзРасчетаЗП,
		|	ОП.КВПодВопросом,
		|	ОП.КВПроцент,
		|	ОП.КВПроцентДляАгента,
		|	ОП.КВПроцентДляОтчета,
		|	ОП.КВСумма,
		|	ОП.КВСуммаДляАгента,
		|	ОП.КВСуммаДляОтчета,
		|	ОП.КодКВ,
		|	ОП.Комментарий,
		|	ОП.КОплатеАгентом,
		|	ОП.Курс,
		|	ОП.Курьер,
		|	ОП.НачисленнаяСуммаВзноса,
		|	ОП.НачисленнаяСуммаВзносаВВалюте,
		|	ОП.НеВключатьВОтчетыПоставщикам,
		|	ОП.НеМенятьАВ,
		|	ОП.НеМенятьВК,
		|	ОП.НеМенятьКВ,
		|	ОП.НомерВзноса,
		|	ОП.НомерКвитанции,
		|	ОП.НомерРасчетногоСчета,
		|	ОП.ОплаченоФакт,
		|	ОП.ОрганизацияАгент,
		|	ОП.ОтчетАгента,
		|	ОП.ОтчетПоКарточкам,
		|	ОП.ОтчетПоставщику,
		|	ОП.ПересчетКВ,
		|	ОП.ПлатежныйДокумент_Дата,
		|	ОП.ПлатежныйДокумент_Номер,
		|	ОП.Подразделение,
		|	ОП.ПолисАннулирован,
		|	ОП.ПолнаяСтраховаяПремия,
		|	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		|	ОП.Поставщик,
		|	ОП.Проблемная,
		|	ОП.СК,
		|	ОП.СкидкаВыплаченаяКлиенту,
		|	ОП.СтраховойПолис,
		|	ОП.СтраховойПродукт,
		|	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
		|	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке, ОП.СхемаРасчетаСМенеджером) КАК СхемаРасчетаСМенеджером,
		|	ОП.Счет,
		|	ОП.НаправлениеПлатежа,
		|	ОП.ЭтоКрупнаяСделка,
		|	ОП.ПричинаИсключенияИзОП,
		|	ОП.СписатьСКурьера,
		|	ОП.ОкруглятьКВДо2Знаков,
		|	ОП.ДБ,
		|	ОП.ВМРасчетное,
		|	ОП.ПроверенаЗП,
		|	ОП.РазрядностьОкругления,
		|	ОП.РежимОкругления,
		|	ОП.Автор,
		|	ОП.ДатаСоздания,
		|	ОП.Модификатор,
		|	ОП.ДатаИзменения,
		|	ОП.Подразделение.Владелец КАК Организация,
		|	ВЫБОР
		|		КОГДА ОП.Подразделение.НеОплачиватьКС = ИСТИНА
		|				ИЛИ ОП.Агент В (&СотрудникиМастера)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеОплачиватьКС,
		|	0 КАК СКВ,
		|	0 КАК суммаДб,
		|	ОП.СтраховойПолис.СК КАК СП_СК,
		|	ОП.ВидС КАК СП_ВидСП,
		|	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
		|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
		|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
		|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
		|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
		|	ОП.СтраховойПолис.Сделка КАК Сделка,
		|	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК Интервалы,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК ИнтервалыРОП,
		|	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
		|	0 КАК КоличествоФакт,
		|	1 КАК ЕД,
		|	ОП.ФормаОплаты,
		|	0 КАК КоэффициентВида,0 как НовыйКлиент, ДатаВремя(1,1,1) как  ДатаПриемки
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыБСО КАК ПараметрыБСО
		//|		ПО ОП.ВидБСОПолиса = ПараметрыБСО.ВидБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ИР.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК ОбъектИстории,
		|	ИР.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	ИР.ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ИсторияРеквизитовВсехОплат
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаСреза,
		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|				И ОбъектИстории В
		|					(ВЫБРАТЬ
		|						Т.Оплата
		|					ИЗ
		|						ОплатыМесяца КАК Т)
		|				И РеквизитОбъекта <> ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК ИР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсторияРеквизитовВсехОплат.ОбъектИстории КАК ОбъектИстории,
		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита,
		|	ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита
		|ИЗ
		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
		|ИТОГИ ПО
		|	ОбъектИстории
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита КАК Документ.уб_СтраховойПолис) КАК СтраховойПолис
		|ПОМЕСТИТЬ ВТ_ВсеСтраховыеПолисы
		|ИЗ
		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
		|ГДЕ
		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита = ""СтраховойПолис""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_СтраховойПолис.Ссылка КАК СтраховойПолис,
		|	уб_СтраховойПолис.Номер,
		|	уб_СтраховойПолис.Дата,
		|	уб_СтраховойПолис.СтраховойПродукт,
		|	уб_СтраховойПолис.Страхователь,
		|	уб_СтраховойПолис.НомерЗаявки,
		|	уб_СтраховойПолис.БонусМенеджеру,
		|	уб_СтраховойПолис.СК,
		|	уб_СтраховойПолис.СтраховаяПремия,
		|	уб_СтраховойПолис.ПометкаУдаления,
		|	уб_СтраховойПолис.Сделка КАК Сделка,
		|	уб_СтраховойПолис.Сделка.Дата КАК ДатаСделки,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
		|	Выбор когда ТипЗначения(уб_СтраховойПолис.СтраховойПродукт) = Тип (Справочник.уб_СтраховыеПродукты) Тогда уб_СтраховойПолис.СтраховойПродукт.Вид иначе уб_СтраховойПолис.СтраховойПродукт Конец КАК Вид
		|ИЗ
		|	ВТ_ВсеСтраховыеПолисы КАК ВТ_ВсеСтраховыеПолисы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|		ПО ВТ_ВсеСтраховыеПолисы.СтраховойПолис = уб_СтраховойПолис.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер) КАК СуммаСКВ,
		|	уб_ОплатаПолисовРасчетыПоДокументу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уб_ОплатаПолисов.РасчетыПоДокументу КАК уб_ОплатаПолисовРасчетыПоДокументу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОплатыМесяца КАК ОплатыМесяца
		|		ПО уб_ОплатаПолисовРасчетыПоДокументу.Ссылка = ОплатыМесяца.Оплата
		|ГДЕ
		|	уб_ОплатаПолисовРасчетыПоДокументу.Вид = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСКВ)
		|	И уб_ОплатаПолисовРасчетыПоДокументу.ВремяРегистрации <= &ДатаСреза
		|	И уб_ОплатаПолисовРасчетыПоДокументу.СуммаМенеджер <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_ОплатаПолисовРасчетыПоДокументу.Ссылка";
		#Если Клиент Тогда
			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам из истории");
		#КонецЕсли
		Пакет = ЗапросПоОплатамИзИстории.ВыполнитьПакет();		
		//СписокОплатИзИстории = Пакет[1].Выгрузить().ВыгрузитьКолонку("Оплата");
		ВыборкаОплат = Пакет[2].Выбрать();		
		ТЗ1	= Пакет[3].Выгрузить();//ТЗ1 = СоздатьТаблицу();
		ТЗ1.Колонки.Добавить("СКВ_Прол", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_НБ", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП_Прол", ОписаниеТипаЧисло14_2_но);
		ТЗ1.Колонки.Добавить("СКВ_БП_НБ", ОписаниеТипаЧисло14_2_но);
		
		ТЗ1.Очистить();		
		ВыборкаИсторияРеквизитовОплат = Пакет[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		ВыборкаСтраховыхПолисов = Пакет[7].Выбрать();		
		ВыборкаНачисленияСКВ = Пакет[8].Выбрать();		
		//ВсегоМассив = СписокОплатИзИстории.Количество();
		ВсегоМассив = ВыборкаОплат.Количество();		
		СпПометкаУдаления = Ложь;
		Этап = Этап + 1;
		СчетчикОплат = 0;
		//Для СчетчикОплат = 0 по ВсегоМассив - 1 Цикл
		Пока ВыборкаОплат.Следующий() Цикл
			#Если Клиент Тогда
				Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + ") - Расчет показателей СКВ из истории");
			#КонецЕсли
			//Оплата = СписокОплатИзИстории[СчетчикОплат];
			Оплата = ВыборкаОплат.Оплата;
			СчетчикОплат = СчетчикОплат + 1;
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			/////////////////////////////////////////////////////////////////////////////////////////////
			//!!! Добавить проверку на удаленные оплаты, подменять некоторые реквизиты или менять представление
			/////////////////////////////////////////////////////////////////////////////////////////////
			Стр = ТЗ1.Добавить();
			Стр.Ссылка = Оплата;//.Ссылка
			Стр.ЕД = 1;
			Стр.ЭтоКрупнаяСделка = Ложь;
			Попытка
				Стр.ЭтоПролонгация   = ВыборкаОплат.ЭтоПролонгация;
			Исключение
				Стр.ЭтоПролонгация = Ложь;
			КонецПопытки;	
			Стр.КоличествоФакт = ВыборкаОплат.КоличествоФакт;			
			Стр.НеОплачиватьКС = ВыборкаОплат.НеОплачиватьКС;
			Стр.КоэффициентВида = ВыборкаОплат.КоэффициентВида;
			Стр.НовыйКлиент = ВыборкаОплат.НовыйКлиент;
			Стр.СуммаДБ = 0;
			//СтруктураИзменений = уб_ИсторияИзмененияОбъектов.ПолучитьДанныеОбъектаНаДату(Стр.Ссылка,ДатаСреза);//!!!Сделать: объединить в один пакет			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ОбъектИстории", Оплата);
			СтруктураИзменений = Новый Структура;
			ВыборкаИсторияРеквизитовОплат.Сбросить();
			Если ВыборкаИсторияРеквизитовОплат.НайтиСледующий(СтруктураПоиска) Тогда
				ДетальныеЗаписи = ВыборкаИсторияРеквизитовОплат.Выбрать();
				
				Пока ДетальныеЗаписи.Следующий() Цикл
					СтруктураИзменений.Вставить(ДетальныеЗаписи.НаименованиеРеквизита, ДетальныеЗаписи.ЗначениеРеквизита);
				КонецЦикла;
			КонецЕсли;		
			флПересчитанСКВ = Ложь;
			Для Каждого ЭлементСтруктуры из СтруктураИзменений Цикл
				КлючЭл = ЭлементСтруктуры.Ключ;
				ЗначениеЭл = ЭлементСтруктуры.Значение;
				
				Попытка
					Стр[КлючЭл]= ЗначениеЭл;
				Исключение
					Если РежимОтладки Тогда
						Сообщить("Ошибка заполнения строки из истории (" + Оплата + " / " + КлючЭл + ")");
					КонецЕсли;	
					продолжить;
				КонецПопытки;
				Если КлючЭл = "СтраховойПолис" Тогда
					Если ЗначениеЗаполнено (ЗначениеЭл) Тогда
						
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("СтраховойПолис", ЗначениеЭл);
						
						ВыборкаСтраховыхПолисов.Сбросить();
						
						Если ВыборкаСтраховыхПолисов.НайтиСледующий(СтруктураПоиска) Тогда
							ЗначениеЭл = ВыборкаСтраховыхПолисов;
							Стр.СП_СтраховойПродукт = ЗначениеЭл.СтраховойПродукт;
							Если ТипЗнч(ЗначениеЭл.СтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
								Стр.СП_ВидСП = ЗначениеЭл.Вид;
							Иначе
								Стр.СП_ВидСП = ЗначениеЭл.СтраховойПродукт;
							КонецЕсли;	
							Стр.СП_СК = ЗначениеЭл.СК;//Не используется и тормозит
							Стр.Страхователь = ЗначениеЭл.Страхователь;
							Стр.ДатаПолиса = ЗначениеЭл.Дата;
							Стр.НомерПолиса = ЗначениеЭл.Номер;
							Стр.НомерЗаявки = ЗначениеЭл.НомерЗаявки;
							Стр.БонусМенеджеру = ЗначениеЭл.БонусМенеджеру;
							Стр.ПолнаяПремия = ЗначениеЭл.СтраховаяПремия;
							//Если ЭтоВариант20121001 Тогда
							Стр.Сделка = ЗначениеЭл.Сделка;
							Стр.ДатаСделки = ЗначениеЭл.ДатаСделки;
							Стр.БонусПроцент = ЗначениеЭл.БонусПроцент;
							Стр.БонусПроцентРОП = ЗначениеЭл.БонусПроцентРОП;
							//КонецЕсли;	
							
							СпПометкаУдаления = ЗначениеЭл.ПометкаУдаления;
						Конецесли;
					КонецЕсли;	
				ИначеЕсли КлючЭл ="Подразделение" Тогда	
					Стр.Организация = СоотОрганизацийПодразделениям.Получить(ЗначениеЭл);
				ИначеЕсли КлючЭл ="ОплаченоФакт" 
					Или КлючЭл ="НачисленнаяСуммаВзноса" 
					Или КлючЭл ="СкидкаВыплаченаяКлиенту" 
					Или КлючЭл ="ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику" 
					Или КлючЭл ="КВСумма" Тогда		
					
					Если флПересчитанСКВ Тогда
						Продолжить;
					КонецЕсли;  
					Если ЭтоВариант20151001 Тогда
						ВыборкаНачисленияСКВ.Сбросить();
						Если ВыборкаНачисленияСКВ.НайтиСледующий(Новый Структура("Ссылка",Оплата)) Тогда
							Стр.СКВ = ВыборкаНачисленияСКВ.СуммаСКВ;
							флПересчитанСКВ = Истина;
							Продолжить;
						Иначе
							//не найден посчитанный СКВ, посчитаем по старому	
						КонецЕсли;	
					Иначе
						
					КонецЕсли;
					
						
					Если СтруктураИзменений.Свойство("ОплаченоФакт") Тогда
						ОплаченоФакт = СтруктураИзменений.ОплаченоФакт;
						Стр.ОплаченоФакт = ОплаченоФакт;
					Иначе
						ОплаченоФакт = Стр.ОплаченоФакт;
					КонецЕсли;	  
					
					Если СтруктураИзменений.Свойство("НачисленнаяСуммаВзноса") Тогда
						НачисленнаяСуммаВзноса = СтруктураИзменений.НачисленнаяСуммаВзноса;
						Стр.НачисленнаяСуммаВзноса = НачисленнаяСуммаВзноса;
					Иначе
						НачисленнаяСуммаВзноса = Стр.НачисленнаяСуммаВзноса;
					КонецЕсли;
					Если СтруктураИзменений.Свойство("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику") Тогда
						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = СтруктураИзменений.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
						Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
					Иначе
						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
					КонецЕсли;
					
					Если СтруктураИзменений.Свойство("СкидкаВыплаченаяКлиенту") Тогда
						СкидкаВыплаченаяКлиенту = СтруктураИзменений.СкидкаВыплаченаяКлиенту;
						Стр.СкидкаВыплаченаяКлиенту = СкидкаВыплаченаяКлиенту;
					Иначе
						СкидкаВыплаченаяКлиенту = Стр.СкидкаВыплаченаяКлиенту;
					КонецЕсли;
					Если ЭтоВариант20130301 ИЛИ ДатаСреза > Дата(2013,10,7) Тогда
						Если СтруктураИзменений.Свойство("КВСуммаДляАгента") Тогда
							Попытка
								КВСумма = Число(СтруктураИзменений.КВСуммаДляАгента);
							Исключение
								КВСумма = 0;
							КонецПопытки;
							Стр.КВСумма = КВСумма;
							Стр.КВСуммаДляАгента = КВСумма;
						Иначе
							КВСумма = Стр.КВСуммаДляАгента;
						КонецЕсли;
					Иначе	
						Если СтруктураИзменений.Свойство("КВСумма") Тогда
							КВСумма = СтруктураИзменений.КВСумма;
							Стр.КВСумма = КВСумма;
							Стр.КВСуммаДляАгента = КВСумма;
						Иначе
							КВСумма = Стр.КВСумма;
						КонецЕсли;
					КонецЕсли;
					Если (ОплаченоФакт - СкидкаВыплаченаяКлиенту ) < ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса)-КВСумма ТОГДА  
						СКВ = 0;
					Иначе	  
						СКВ = ОплаченоФакт - ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса) - СкидкаВыплаченаяКлиенту + КВСумма;
					КонецЕсли; 
					Стр.СКВ = СКВ;
					флПересчитанСКВ = Истина;
				КонецЕсли;	
			КонецЦикла;	
			
			СтраховойПолис = Стр.СтраховойПолис;
			/////////////////////////////////////////////////////////////////////////////////////////////
			//!!! Добавить проверку на получение полиса из истории?
			/////////////////////////////////////////////////////////////////////////////////////////////
			//Если ФильтрПоМенеджеру И Стр.Агент<>Менеджер Тогда
			////	//
			//	ТЗ1.Удалить(Стр);
			//Иначе
			Если ФильтрПоПодразделению И Стр.Подразделение <> Подразделение Тогда
				////	//
				ТЗ1.Удалить(Стр);
			ИначеЕсли (НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП) И Стр.ИсключитьИзРасчетаЗП Тогда
				ТЗ1.Удалить(Стр);
			ИначеЕсли  СтраховойПолис = ПустойПолис Тогда
				ТЗ1.Удалить(Стр);
			ИначеЕсли  СпПометкаУдаления  Тогда
				//ТЗ1.Удалить(Стр); //Не удалять, т.к. нет истории этого флага 
			ИначеЕсли  Стр.ПометкаУдаления  Тогда
				ТЗ1.Удалить(Стр);
			//ИначеЕсли  Стр.НомерЗаявки = кЛичнаяЗаявка Тогда
			ИначеЕсли  Стр.СхемаРасчетаСМенеджером = СхемаПоАВ Тогда
				ТЗ1.Удалить(Стр);	
			ИначеЕсли ФильтрПоСП И Стр.СП_ВидСП <> ВидСП Тогда	
				ТЗ1.Удалить(Стр);	
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	ТЗ1.Колонки.Добавить("ИнфоКВМ", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0)));
	ТЗ1.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Число"));
	Если СоотвИнфоКВМ.Количество() > 0 Тогда
		Для Каждого Стр ИЗ ТЗ1 Цикл
			ИнфоКВМ = СоотвИнфоКВМ.Получить(Стр.Номер);
			Если ИнфоКВМ <> Неопределено Тогда
				Стр.ИнфоКВМ	= ИнфоКВМ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Создаем список Агентов, по которым есть оплаты 
	//ТЗАгентов = ТЗ1.Скопировать(,"Агент");
	//ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера");
	
	//	Если ФильтрПоменеджеру Тогда
	//СтрокаМенеджера = ТЗАгентов.Добавить();
	//СтрокаМенеджера.Агент = Менеджер;
	//СтрокаМенеджера.ВознаграждениеМенеджера  = 0;
	//	КонецЕсли;	
	//Анализ страхователей
	ТЗ1.Колонки.Добавить("НовыйКлиентСКВ",Новый ОписаниеТипов("Число"));
	ТЗ1.Колонки.Добавить("НовыйКлиентУник",Новый ОписаниеТипов("Число"));
	ПосчитатьСтрахователей(ТЗ1);
	
	Если ВРеальномВремени Тогда
		ТЗ1_ГодНазад = ТЗ1_ГодНазад.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));
		ТЗ1_ГодНазад.Колонки.Добавить("НовыйКлиентСКВ",Новый ОписаниеТипов("Число"));
		ТЗ1_ГодНазад.Колонки.Добавить("НовыйКлиентУник",Новый ОписаниеТипов("Число"));
		ПосчитатьСтрахователей(ТЗ1_ГодНазад);
	Иначе
		ТЗ1_ГодНазад = ТЗ1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));
	КонецЕсли;	
	
	ТЗ1_ГодНазад.Свернуть("Агент","КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,СКВ");
	
	
	
	//
	//
	ТЗАгентов = ТЗ1.Скопировать(,"Агент,ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,ВычетСАгента,СуммаДБ");
	ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,ВычетСАгента,СуммаДБ");
	ТЗАгентов.Колонки.Добавить("Подразделение", ОписаниеТипа_Подразделение);
	
	ТЗАгентов.Колонки.Добавить("ЕстьОплатыПоАгенту",ОписаниеТипаБулево);
	ТЗАгентов.ЗаполнитьЗначения(Истина, "ЕстьОплатыПоАгенту");
	
	//Подготавливаем ТЗАгентов для обновления подразделений по агентам 
	
	
	//Обновляем подразделения в списке Агентов
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		
		//Сначала пытаемся получить подразделение на конец месяца в режиме возврата пустого подразделения, если не найдено
		Уволен = Ложь;
		НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, КонецМесяца(ЗарплатныйПериод), Истина, Уволен);
		Если НовПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
			НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, НачалоМесяца(ЗарплатныйПериод), Истина, Уволен);
			
			Если НовПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
				НовПодразделение = АгенскаяСеть;
			КонецЕсли;
		
		КонецЕсли;
		//Если Уволен Тогда
		//	Стр.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		//Иначе	
		Стр.Подразделение = НовПодразделение;
		//КонецЕсли;	
		
	КонецЦикла;
	//Получаем список подразделений, в которых были оплаты
	тзПодразделенийСОплатами = ТЗАгентов.Скопировать(,"Подразделение");
	тзПодразделенийСОплатами.Свернуть("Подразделение");
	
	//Получаем список ВСЕХ подразделений, которые могут продавать
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	П.Ссылка,
	               |	П.Наименование
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК П
	               |ГДЕ
	               |	П.ТипПодразделения В(&ТипыПодразделения)";
	
	ТипыПодразделения = Новый СписокЗначений;
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ГоловнойОфис);
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ТочкаПродаж);
	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВС);
	
	Запрос.УстановитьПараметр("ТипыПодразделения", ТипыПодразделения);
	
	Если ФильтрПоПодразделению Тогда
		Запрос.Текст = Запрос.Текст + " И П.Ссылка = &Подразделение ";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе	
		//	Если ФильтрПоМенеджеру Тогда
		СпЗн = Новый СписокЗначений;
		Для каждого Стр Из ТЗАгентов Цикл
			СпЗн.Добавить(Стр.Подразделение);
		КонецЦикла; 
		Запрос.Текст = Запрос.Текст + " И П.Ссылка В (&Подразделение) ";
		Запрос.УстановитьПараметр("Подразделение", СпЗн);
		//	КонецЕсли;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	тзПодразделений = Новый ТаблицаЗначений;
	Кол = тзПодразделений.Колонки;
	Кол.Добавить("Подразделение",							ОписаниеТипа_Подразделение);
	Кол.Добавить("НаименованиеПодразделения",				ОписаниеТипаСтрока);
	Кол.Добавить("Руководитель",							ОписаниеТипа_ФизЛицо);
	Кол.Добавить("РуководительПолучаетВознаграждение",		ОписаниеТипаБулево);
	Кол.Добавить("ЗамПолучаетВознаграждение",		ОписаниеТипаБулево);
	Кол.Добавить("СхемаВознагражденияРуководителяОП",		ОписаниеТипаСхемВознРукОП);
	Кол.Добавить("ПроцентнаяСтавкаДоМинимальногоПорога_РОП",ОписаниеТипаПроцент);
	Кол.Добавить("ПоказательМинимальногоПорога_РОП",		ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентнаяСтавкаДоПлана_РОП",				ОписаниеТипаПроцент);
	Кол.Добавить("ПоказательПлана_РОП",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентнаяСтавкаПослеПлана_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("ЕстьОплатыПоПодразделению",				ОписаниеТипаБулево);
	Кол.Добавить("ПроцентКС_РОП",          				    ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаДБ",          				    ОписаниеТипаЧисло14_2_но);
	
	Кол.Добавить("ПланПролонгация",       				    ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПланНовыйБизнес",       				    ОписаниеТипаЧисло14_2_но);
	
	
	
	
	
	
	СписокПодразделенийДляВыборки = Новый СписокЗначений;
	ПрчСхемаВР = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП; 
	Пока Выборка.Следующий() Цикл
		бНетОплатПоПодразделению = (тзПодразделенийСОплатами.Найти(Выборка.Ссылка) = Неопределено) И НЕ ФильтрПоМенеджеру; 
		
		МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Выборка.Ссылка);
		Руководитель = МЗ.Сотрудник;
		МЗ2 = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Выборка.Ссылка,Истина);
		Если МЗ2.Сотрудник.Пустая() ИЛИ МЗ2.Уход Тогда
			Зам = Справочники.ФизическиеЛица.ПустаяСсылка();
			ЗамПолучаетВознаграждение = Ложь;
		Иначе
			Зам = МЗ2.Сотрудник;
			ЗамПолучаетВознаграждение = МЗ2.ПолучаетВознаграждениеЗаРуководство;
		КонецЕсли;	
		//Если не указан руководитель подразделения на данный период
		//Или он не получает вознаграждения
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если (Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() ИЛИ НЕ МЗ.ПолучаетВознаграждениеЗаРуководство)
			И бНетОплатПоПодразделению Тогда
			Продолжить;
		КонецЕсли;
		
		//Далее ищем схему вознаграждения руководителя подразделения
		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСРуководителемОП(НачалоДня(КонецМесяца(ЗарплатныйПериод)),,Выборка.Ссылка);
		
		//Также, если НЕ найдена схема вознаграждения руководителя подразделения 
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если тз.Количество() = 0 И бНетОплатПоПодразделению Тогда
			Продолжить;
		КонецЕсли;
		
		//Также, если найдена схема вознаграждения руководителя подразделения "БезВознаграждения" 
		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
		Если тз.Количество() > 0 И бНетОплатПоПодразделению Тогда
			Если тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		//Добавляем подразделение в список 
		НовСтрока = тзПодразделений.Добавить();	
		НовСтрока.Подразделение				= Выборка.Ссылка;
		НовСтрока.НаименованиеПодразделения	= Выборка.Наименование + ?(ЗначениеНеЗаполнено(Руководитель),""," (" + Руководитель.Наименование + ")");
		НовСтрока.Руководитель				= Руководитель;
		НовСтрока.РуководительПолучаетВознаграждение = МЗ.ПолучаетВознаграждениеЗаРуководство;
		НовСтрока.ЗамПолучаетВознаграждение = ЗамПолучаетВознаграждение;
		Если тз.Количество() = 0 ИЛИ тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
			НовСтрока.СхемаВознагражденияРуководителяОП			= ПрчСхемаВР.БезВознаграждения;
			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= 0;
			НовСтрока.ПоказательМинимальногоПорога_РОП			= 0;
			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= 0;
			НовСтрока.ПоказательПлана_РОП						= 0;
			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= 0;
			НовСтрока.ПроцентКС_РОП  = 0 ;
		Иначе	
			Схема = тз[0];
			НовСтрока.СхемаВознагражденияРуководителяОП			= Схема.СхемаВознагражденияРуководителяОП;
			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= Схема.ПроцентнаяСтавкаДоМинимальногоПорога;
			НовСтрока.ПоказательМинимальногоПорога_РОП			= Схема.ПоказательМинимальногоПорога;
			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= Схема.ПроцентнаяСтавкаДоПлана;
			НовСтрока.ПоказательПлана_РОП						= Схема.ПоказательПлана;
			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= Схема.ПроцентнаяСтавкаПослеПлана;			
			НовСтрока.ПроцентКС_РОП                             = Схема.ПроцентКС_РОП;
			//Добавляем подразделение в список для последующей выборки агентов, работающих по схеме ПланПоСКВ
			//Только для случая, когда руководитель получает процент от СКВ необходимо будет собрать в писок
			//всех агентов подразделения, что бы посчитать суммарный план подразделения			
			//В остальных случаях в список агентов подразделения (в отчете) попадут только те агенты, у которых есть оплаты		
			//Так же исключаем случай, когда отчет фильтруется по конкретному менеджеру
			Если //НЕ ФильтрПоМенеджеру И 
				Схема.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ Тогда
				СписокПодразделенийДляВыборки.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;                                                         
		НовСтрока.ЕстьОплатыПоПодразделению = НЕ бНетОплатПоПодразделению;
		тзПланПодразделения = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Выборка.Ссылка);
		Если тзПланПодразделения.Количество()>0 Тогда
			НовСтрока.ПланПролонгация = тзПланПодразделения[0].ПланПролонгация;
			НовСтрока.ПланНовыйБизнес = тзПланПодразделения[0].ПланНовыйБизнес;
		КонецЕсли;	
	КонецЦикла;
	//##добавляем подразделения, где были оплаты в тзПодразделений
	Для каждого Стр Из тзПодразделенийСОплатами Цикл		
		Если тзПодразделений.Найти(Стр.Подразделение,"Подразделение")=Неопределено Тогда
			НовСтрока = тзПодразделений.Добавить();	
			НовСтрока.Подразделение	= Стр.Подразделение;
			тзПланПодразделения = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Выборка.Ссылка);
			Если тзПланПодразделения.Количество()>0 Тогда
				НовСтрока.ПланПролонгация = тзПланПодразделения[0].ПланПролонгация;
				НовСтрока.ПланНовыйБизнес = тзПланПодразделения[0].ПланНовыйБизнес;
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла; 	
	//Формируем список всех агентов, которые в течение зарплатного периода присутствовали в выбранных подразделениях
	//Если будут найдены агенты, которые не попали в главную выборку оплат (по пичине отсутствия у них оплат в этом периоде)
	//то эти агенты будут добавлены в список	
	//Запрос на получение списка сотрудников, работающих в подразделении в период отчета
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	А.Агент,
	|	А.Подразделение,
	|	А.Период,
	|	А.Организация
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаНач, ) КАК А
	|ГДЕ
	|	А.Подразделение В(&Подразделения)
	|	И (НЕ А.Выбытие)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	А.Агент,
	|	А.Подразделение,
	|	А.Период,
	|	А.Организация
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
	|ГДЕ
	|	А.Подразделение В(&Подразделения)
	|	И (НЕ А.Выбытие)
	|	И А.Период МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКонца);	
	Запрос.УстановитьПараметр("Подразделения", СписокПодразделенийДляВыборки);	
	ВыборкаАгентов = Запрос.Выполнить().Выбрать();
	
	//Подготавливаем ТЗАгентов для сравнения дублирующихся записей
	//Возможны случаи, когда агент переходил из подразделения в подразделение в течение месяца
	//Тогда подразделением Агента считается подразделение, в котором он числился позже всего
	
	//Не рассматриваем работу агента в разных подразделениях в течении месяца 
	//По причине того, что придется пропорционально времени работы в подразделениях делить план (в случае работы по схеме план)
	//Учет ведем по последнему подразделению, в котором работал сотрудник в отчетном периоде (даже если он работал всего один последний день)
	
	ТЗАгентов.Колонки.Добавить("ДатаПоступленияВПодразделение",ОписаниеТипаДата);
	
	Пока ВыборкаАгентов.Следующий() Цикл
		НайденныйАгент	= ТЗАгентов.НайтиСтроки(Новый Структура("Агент",ВыборкаАгентов.Агент)); 
		Если НайденныйАгент.Количество()=0 Тогда
			//Добавляем нового агента
			НовАгент								= ТЗАгентов.Добавить();
			НовАгент.Агент							= ВыборкаАгентов.Агент;
			НовАгент.Подразделение					= ВыборкаАгентов.Подразделение.Ссылка;
			НовАгент.ДатаПоступленияВПодразделение	= ВыборкаАгентов.Период;
			НовАгент.ВознаграждениеМенеджера 		= 0;
			НовАгент.ВознаграждениеДоп 		= 0;
			НовАгент.ПартнерскоеВознаграждение      = 0;
			НовАгент.ВычетСАгента					= 0;
		Иначе
			НайденныйАгент = НайденныйАгент[0];
			Если НайденныйАгент.Подразделение <> ВыборкаАгентов.Подразделение 
				И НайденныйАгент.ДатаПоступленияВПодразделение < ВыборкаАгентов.Период Тогда
				НайденныйАгент.Подразделение = ВыборкаАгентов.Подразделение.Ссылка;
				НайденныйАгент.ДатаПоступленияВПодразделение = ВыборкаАгентов.Период;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Теперь выберем всех агентов, у которых встречаются оплаты по схеме "ПланПоСКВ"
	СтруктураОтбора				= Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	ТЗАгентовПоСхемеПланПоСКВ	= ТЗ1.Скопировать(СтруктураОтбора, "Агент,СхемаРасчетаСМенеджером");
	ТЗАгентовПоСхемеПланПоСКВ.Свернуть("Агент,СхемаРасчетаСМенеджером");
	//Для таких агентов заполним параметры Плана и СуперПлана
	Кол = ТЗАгентов.Колонки;
	Кол.Добавить("План",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПланПролонгация",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПланНовыйБизнес",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ШтрафнойПлан",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("Количество",						ОписаниеТипаЧисло12_0);
	Кол.Добавить("СуперПлан",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПерваяБонусПланка",				ОписаниеТипаЧисло14_2_но);//2012
	Кол.Добавить("ПроцентнаяСтавкаДоПлана",			ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПослеПлана",		ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПослеПервойБонусПланки",	ОписаниеТипаПроцент);//201212
	Кол.Добавить("ПроцентнаяСтавкаПослеСуперПлана",	        ОписаниеТипаПроцент);
	
	Кол.Добавить("ПроцентнаяСтавкаПролонгация",			ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаПролонгацияДоПлана",		ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаНовыйБизнес",			ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентнаяСтавкаНовыйБизнесДоПлана",		ОписаниеТипаПроцент);
	
	
	Кол.Добавить("ЕстьПланПоСКВ",					ОписаниеТипаБулево);
	Кол.Добавить("ЭтотАгентЕстьВТЗ1",				ОписаниеТипаБулево);
	Кол.Добавить("УАгентаПланПоСКВ",				ОписаниеТипаБулево);
	Кол.Добавить("ВыполненПланПоСКВ",				ОписаниеТипаБулево);
	//Итоги СКВ по КС
	Кол.Добавить("СКВ_КС",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_КС_НБ",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_Прол",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_НБ",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_БП",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_БП_Прол", ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_БП_НБ", ОписаниеТипаЧисло14_2_но);
	
	тзПодразделений.Колонки.Добавить("СКВ_КС",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_КС_НБ",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_Прол",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_НБ",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_БП",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_БП_Прол",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("СКВ_БП_НБ",			ОписаниеТипаЧисло14_2_но);
	тзПодразделений.Колонки.Добавить("ВыполненПланПоСКВ", ОписаниеТипаБулево);
	тзАгентов.Сортировать("Агент,ДатаПоступленияВПодразделение УБЫВ");
	ТЗАгентов.Индексы.Добавить("Агент");

	//Пробегаем по агентам 
	//И для тех, кто входит в подразделение, с расчетом вознаграждения рауководителя по схеме ПроцентОтСКВ
	//А так же для тех агентов, у кого есть оплаты по схеме "ПланПоСКВ"
	//- заполним параметры Плана и СуперПлана
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		НайденноеПодразделение	=	тзПодразделений.Найти(Стр.Подразделение);
		бСхемаРОП_ПроцентОтСКВ	=	(НайденноеПодразделение <> Неопределено) 
								И НайденноеПодразделение.РуководительПолучаетВознаграждение = Истина 
								и (НайденноеПодразделение.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ);
		бЕстьОплатаПоПлануПоСКВ	=	ТЗАгентовПоСхемеПланПоСКВ.Найти(Стр.Агент) <> Неопределено;
		
		Если бСхемаРОП_ПроцентОтСКВ ИЛИ бЕстьОплатаПоПлануПоСКВ Тогда
			
			ШтрафнойПлан = ПолучитьШтрафнойПлан(Стр.Агент,НачалоДня(КонецМесяца(ЗарплатныйПериод)));
			
			тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
			Если тз.Количество() > 0 Тогда
				Стр.План = тз[0].План+ШтрафнойПлан;
				Стр.ШтрафнойПлан = ШтрафнойПлан;
				Стр.ПланПролонгация = тз[0].ПланПролонгация;
				Стр.ПланНовыйБизнес = тз[0].ПланНовыйБизнес;
				Если Стр.План = 0 Тогда
					Стр.Количество = 0;
				Иначе
					Стр.Количество = тз[0].Количество;
				КонецЕсли;
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			
			тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.СуперПлан<>0");
			Если тз.Количество() > 0 Тогда
				Стр.СуперПлан = тз[0].СуперПлан+?(ЭтоВариант20150601=Истина и не ЭтоВариант20200801,ШтрафнойПлан,0);
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдено значение Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			
			Если ЭтоВариант20121201 Тогда
				тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.ПерваяБонусПланка<>0");
				Если тз.Количество() > 0 Тогда
					Стр.ПерваяБонусПланка = тз[0].ПерваяБонусПланка+?(ЭтоВариант20150601=Истина и не ЭтоВариант20200801,ШтрафнойПлан,0);//201212	Стр.СуперПлан = тз[0].СуперПлан;
				Иначе
					Сообщить("ВНИМАНИЕ! Не найдено значение min Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
				КонецЕсли;
			КонецЕсли;
			
			тз = уб_СтраховойБрокер.ПолучитьПроцентныеСтавкиПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
			
			//
			
			//
			Если тз.Количество() > 0 Тогда
				ЕСли ЗарплатныйПериод<Дата(2017,1,1) и ПараметрыСеанса.уб_Константы.ЭтоМастер = Истина и Мастер70=Ложь Тогда
					Стр.ПроцентнаяСтавкаДоПлана			        = 35;
					Стр.ПроцентнаяСтавкаПослеПлана		        = 40;
					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки  = 40;//201212
					Стр.ПроцентнаяСтавкаПослеСуперПлана         = 40;
					
					Стр.ПроцентнаяСтавкаПролонгация = 40;
					Стр.ПроцентнаяСтавкаПролонгацияДоПлана = 35;
				Иначе
					Стр.ПроцентнаяСтавкаДоПлана			 = тз[0].ПроцентнаяСтавкаДоПлана;
					Стр.ПроцентнаяСтавкаПослеПлана		 = тз[0].ПроцентнаяСтавкаПослеПлана;
					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = тз[0].ПроцентнаяСтавкаОтПервойБонусПланки;//201212
					Стр.ПроцентнаяСтавкаПослеСуперПлана  = тз[0].ПроцентнаяСтавкаПослеСуперПлана;
					
					ЭтоСтажер = ЭтоСтажер(Стр.Агент);
					Если ЭтоВариант20200301 Тогда
						Если тз[0].ПроцентнаяСтавкаПролонгация = 0 Тогда
							//Возьмем по подразделению
							тз = уб_СтраховойБрокер.ПолучитьПроцентныеСтавкиПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение);
						КонецЕсли;	
						Стр.ПроцентнаяСтавкаПролонгация        = тз[0].ПроцентнаяСтавкаПролонгация;
						Стр.ПроцентнаяСтавкаПролонгацияДоПлана = тз[0].ПроцентнаяСтавкаПролонгацияДоПлана;
						Стр.ПроцентнаяСтавкаНовыйБизнес        = тз[0].ПроцентнаяСтавкаНовыйБизнес;
						Стр.ПроцентнаяСтавкаНовыйБизнесДоПлана = тз[0].ПроцентнаяСтавкаНовыйБизнесДоПлана;
						
					Иначе	
						Стр.ПроцентнаяСтавкаПролонгация       = Макс(Стр.ПроцентнаяСтавкаПослеПлана-?(ЭтоСтажер,0,10),0);
						Стр.ПроцентнаяСтавкаПролонгацияДоПлана = Макс(Стр.ПроцентнаяСтавкаДоПлана  -?(ЭтоСтажер,0,10),0);
					КонецЕсли;	
				КонецЕсли;	
			Иначе
				Сообщить("ВНИМАНИЕ! Не найдена информация по ставкам ПланаПоСКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
			КонецЕсли;
			Стр.ЕстьПланПоСКВ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	//Теперь В ТЗАгентов Есть все данные для получения общего плана подразделения, работающего по схеме ПланПоСКВ	
	
	//В таблице ТЗ1 есть сведения об СКВ
	//Произведем корректировку значения подразделений для выборки оплат, находящейся в ТЗ1
	ТЗ1.Колонки.Добавить("ЕстьПланПоСКВ",		ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("УАгентаПланПоСКВ",	ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("Пустышка", ОписаниеТипаБулево);
	ТЗ1.Колонки.Добавить("СКВ_КС", ОписаниеТипаЧисло14_2_но);
	
	ТЗ1.Колонки.Добавить("БОНУС_КС", ОписаниеТипаЧисло14_2_но);
	ТЗ1.Колонки.Добавить("БОНУС_РОП_КС", ОписаниеТипаЧисло14_2_но);
	
	СтрокаТЗАгентов = Неопределено;
	Для Каждого Стр ИЗ ТЗ1 Цикл
		Если (СтрокаТЗАгентов = Неопределено) ИЛИ (Стр.Агент<>СтрокаТЗАгентов.Агент) Тогда
			СтрокаТЗАгентов = ТЗАгентов.Найти(Стр.Агент);
		КонецЕсли;
		Если СтрокаТЗАгентов <> Неопределено Тогда
			
			Стр.Подразделение = СтрокаТЗАгентов.Подразделение;
			Стр.ЕстьПланПоСКВ = СтрокаТЗАгентов.ЕстьПланПоСКВ;
			СтрокаТЗАгентов.ЭтотАгентЕстьВТЗ1 = Истина;
		Иначе
			Сообщить("Ошибка: не найден агент из оплаты " + Строка(Стр.Агент) + " в промежуточной таблице агентов");
			продолжить;
		КонецЕсли;
		Если Стр.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
			СтрокаТЗАгентов.УАгентаПланПоСКВ = Истина;
			Стр.УАгентаПланПоСКВ = Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	//+++++++++++ТЕСТЫ++++++++++++
	//ТЗ1.Скопировать(Новый Структура("Агент",Справочники.ФизическиеЛица.НайтиПонаименованию("Митенков"))).Итог("СКВ")
	//+++++++++++ТЕСТЫ++++++++++++
	
	//Добавляем в ТЗ1 пустые строки для Агентов, у которых не было оплат
	
	//ТЗ1.Колонки.Добавить("ВК", ОписаниеТипаЧисло14_2_но);
	
	//ЗапросВК  = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер как Менеджер,
	//						 |	СУММА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера) КАК ОплатитьВКассуЗаВыездКурьера
	//						 |ИЗ
	//						 |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	//						 |ГДЕ
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен
	//						 |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.isConfirmed
	//						 |	И КонецПериода(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,МЕСЯЦ) = &ДатаКонца
	//						 |
	//						 |СГРУППИРОВАТЬ ПО
	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер");
	//ЗапросВК.УстановитьПараметр("ДатаКонца",ДатаКонца);						 
	//ВыборкаВК = ЗапросВК.Выполнить().Выбрать();						 
	
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		
		//Добавляем пустышку для вознаграждения курьера
		//ВыборкаВК.Сбросить();
		//СтруктураПоиска = Новый Структура("Менеджер",Стр.Агент);
		//Если ВыборкаВК.НайтиСледующий(СтруктураПоиска) Тогда
		//	НовОплата					= ТЗ1.Добавить();
		//	НовОплата.Агент 			= Стр.Агент;		
		//	НовОплата.Подразделение		= Стр.Подразделение;
		//	НовОплата.Организация 		= Стр.Подразделение.Владелец;
		//	НовОплата.Пустышка			= Истина;
		//	НовОплата.УАгентаПланПоСКВ	= Истина;
		//	Стр.УАгентаПланПоСКВ		= Истина;
		//	тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(ЗарплатныйПериод, , Стр.Подразделение, Стр.Агент);
		//	//НовОплата.ВК =   ВыборкаВК.ОплатитьВКассуЗаВыездКурьера;
		//КонецЕсли;	
		
		//Если НЕ Стр.ЭтотАгентЕстьВТЗ1 Тогда
			 ДобавитьПустышку(тз1,Стр);
		//КонецЕсли;
	КонецЦикла;
	
	//Собираем доходы брокера
	
	//ЗапросДБ =  Новый Запрос;
	//ЗапросДБ.Текст = "";
	
	////////////////////////////////////////////////////////
	//ЭТАП №2. ОБРАБОТКА ПОЛУЧЕННЫХ ДАННЫХ
	////////////////////////////////////////////////////////
	
	Если НЕ ЭтоВариант20150801 Тогда
		СтруктураОтбора 	= Новый Структура("УАгентаПланПоСКВ", Истина);
		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
	Иначе
		//Сверху определена Структура отбора по Схеме, а не по виду 	
		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
	КонецЕсли;
	
	СтруктураОтбора2	= Новый Структура("УАгентаПланПоСКВ", Ложь);  //!!!
	
	СписокПодразделенийИзТЗ1 = ТЗ1.Скопировать(, "Подразделение");	
	СписокПодразделенийИзТЗ1.Свернуть("Подразделение");
	
	ТЗАгентов.Колонки.Добавить("БОНУС_РОП_КС",	ОписаниеТипаЧисло14_2_но);
	Если ЭтоВариант20121001 Тогда
		//
		//Проверка заданных справочником крупных сделок на Порог КС 
		ТЗ1.Индексы.Добавить("ЭтоКрупнаяСделка");
		
		ТЗКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));	
		ТЗКрупныхСделок.Свернуть("Сделка","КВСуммаДляАгента,СКВ");
		//
		Для каждого СтрокаКС из  ТЗКрупныхСделок Цикл
			Сделка = СтрокаКС.Сделка;
			Если Сделка = Справочники.уб_Сделки.ПустаяСсылка() Тогда
				Сообщить("Ошибочно установленный флаг большой сделки у оплаты");
				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
					Сообщить("Оплата "+СтрокаКСТекущейСделки.Номер);
				КонецЦикла;	 
			КонецЕсли;	
			Если СтрокаКС.КВСуммаДляАгента<РазмерКС И уб_РасчетыСМенеджерами.ПолучитьПолноеКВСделки(Сделка)<РазмерКС Тогда
				//Сделка не достигла размера крупной сделки(КС) убираем признак КС
				Если ЗарплатныйПериод<Дата(2016,7,1) Тогда
					//Справочник главнее
					СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
					Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
						СтрокаКСТекущейСделки.ЭтоКрупнаяСделка = Ложь;
					КонецЦикла;	
				КонецЕсли;
			Иначе
				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
					Если ЭтоВариант20150901 и ЭтоВариант20171001 = Ложь Тогда
						СтрокаКСТекущейСделки.БОНУС_РОП_КС = 0;	
					Иначе
						СтрокаКСТекущейСделки.БОНУС_РОП_КС = СтрокаКСТекущейСделки.СКВ * (СтрокаКСТекущейСделки.БонусПроцентРОП)/100;	
					КонецЕсли;
					
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;
		//Автоматическое определение КС
		ТЗПотенцКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером",Ложь,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ),"Страхователь,КВСуммаДляАгента,СКВ,Дата");	
		КопияПотенцКС =  ТЗПотенцКрупныхСделок.Скопировать();//,"Страхователь,КВСуммаДляАгента,СКВ,Дата");
		ТЗПотенцКрупныхСделок.Свернуть("Страхователь","КВСуммаДляАгента,СКВ");
		
		Для каждого СтрокаКС из  ТЗПотенцКрупныхСделок Цикл
			Если СтрокаКС.КВСуммаДляАгента>=РазмерКС Тогда
				//Дополняем явные крупные сделки автоопределенными 
				СтрокиПоСтрахователю = ТЗ1.НайтиСтроки(Новый Структура("ЭтоКрупнаяСделка,Страхователь",Ложь,СтрокаКС.Страхователь));
				//Обпределим дату сделки
				ТаблицаПоСтрахователю = КопияПотенцКС.Скопировать(Новый Структура ("Страхователь",СтрокаКС.Страхователь),"");
				ТаблицаПоСтрахователю.Сортировать("Дата УБЫВ");
				
				Сделка = Справочники.уб_Сделки.ПолучитьСсылку(); //сгенерируем ссылку для сделки
				
				Для каждого СтрокаКССтрахователя из СтрокиПоСтрахователю Цикл
					Если НЕ СтрокаКССтрахователя.НеОплачиватьКС = Истина Тогда
						//Для подразделения может быть укзана настройка, чтобы не оплатить КС
						СтрокаКССтрахователя.Сделка = Сделка;
						СтрокаКССтрахователя.ЭтоКрупнаяСделка = Истина;
						СтрокаКССтрахователя.ДатаСделки      = ТаблицаПоСтрахователю[0].Дата;
						//Если СтрокаКССтрахователя.ЭтоПролонгация Тогда
						//	СтрокаКССтрахователя.БонусПроцент = 5-10;
						//	СтрокаКССтрахователя.ЭтоПролонгация = Ложь;
						//	СтрокаКССтрахователя.СКВ_Прол = 0;
						//Иначе	
							СтрокаКССтрахователя.БонусПроцент    = 5;
						//КонецЕсли;	
							
						
						мСтрок = тзПодразделений.НайтиСтроки(Новый Структура("Подразделение",СтрокаКССтрахователя.Подразделение));
						Если мСтрок.Количество() = 0  Тогда
							СтрокаКССтрахователя.БонусПроцентРОП = 5;
						Иначе
							СтрокаКССтрахователя.БонусПроцентРОП = Число(мСтрок[0].ПроцентКС_РОП);
						КонецЕсли;	
						Если ЭтоВариант20150901 и ЭтоВариант20171001 = Ложь Тогда
							СтрокаКССтрахователя.БОНУС_РОП_КС = 0;
						Иначе
							СтрокаКССтрахователя.БОНУС_РОП_КС = СтрокаКССтрахователя.СКВ * (СтрокаКССтрахователя.БонусПроцентРОП)/100;
						КонецЕсли;
						
					Иначе
						//
						Сделка = Неопределено;
					КонецЕсли;
				КонецЦикла;	
				//КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
		//МассивКС = ТЗ1.НайтиСтроки(СтруктураОтбора);
		//Для каждого СтрокаКС из МассивКС Цикл
		//	СтрокаКС.СКВ_КС       = СтрокаКС.СКВ;
		//	СтрокаКС.БОНУС_КС     = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцент/100;
		//	СтрокаКС.БОНУС_РОП_КС = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцентРОП/100;
		//КонецЦикла;	
		ТЗКрупныхСделок = ТЗ1.Скопировать(СтруктураОтбораКС);	
		ТЗКрупныхСделокДляИтогов = ТЗКрупныхСделок.Скопировать(,"Агент,Подразделение,СКВ,НовыйКлиент");
		ТЗКрупныхСделокДляИтогов.Свернуть("Агент,Подразделение,НовыйКлиент","СКВ");
		Для Каждого СтрокаАгентаКС из ТЗКрупныхСделокДляИтогов Цикл
			СтрокаАгента = ТЗАгентов.Найти(СтрокаАгентаКС.Агент,"Агент");
			Если СтрокаАгента = Неопределено Тогда
				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
			Иначе
				СтрокаАгента.СКВ_КС = СтрокаАгента.СКВ_КС+СтрокаАгентаКС.СКВ;
				Если СтрокаАгентаКС.НовыйКлиент=1 тогда
					СтрокаАгента.СКВ_КС_НБ = СтрокаАгента.СКВ_КС_НБ+СтрокаАгентаКС.СКВ;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		ТЗКрупныхСделокДляИтогов.Свернуть("Подразделение,НовыйКлиент","СКВ");
		Для Каждого СтрокаПодразделенияКС из ТЗКрупныхСделокДляИтогов Цикл
			СтрокаПодразделения = ТЗПодразделений.Найти(СтрокаПодразделенияКС.Подразделение,"Подразделение");
			Если СтрокаПодразделения = Неопределено Тогда
				Сообщить("Не найдена строка подразделения КС, сообщите разработчикам");
			Иначе
				СтрокаПодразделения.СКВ_КС =СтрокаПодразделения.СКВ_КС+ СтрокаПодразделенияКС.СКВ;
				Если СтрокаПодразделенияКС.НовыйКлиент=1 тогда
					СтрокаПодразделения.СКВ_КС_НБ = СтрокаПодразделения.СКВ_КС_НБ+СтрокаПодразделенияКС.СКВ;
				КонецЕсли;	

			КонецЕсли;	
		КонецЦикла;
		//Итоги Бонуса РОП по КС
		ТЗИтоговРОП = ТЗ1.Скопировать(,"Агент,Подразделение,БОНУС_РОП_КС");	
		ТЗИтоговРОП.Свернуть("Агент,Подразделение","БОНУС_РОП_КС");
		//
		Для каждого СтрокаИтогов из ТЗИтоговРОП Цикл
			СтрокаАгента = ТЗАгентов.Найти(СтрокаИтогов.Агент,"Агент");
			Если СтрокаАгента = Неопределено Тогда
				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
			Иначе
				СтрокаАгента.БОНУС_РОП_КС = СтрокаИтогов.БОНУС_РОП_КС;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
	//Обработка пролонгаций
	СтруктураОтбораПродление = Новый Структура("ЭтоПролонгация,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	
	//нСтроки = тз1.НайтиСтроки(СтруктураОтбораПродление);
	//Мастера = ЭтоМастер();
	//Для каждого СтрокаРек из нСтроки Цикл
	//	Если Мастера.Найти(СтрокаРек.Агент) =Неопределено Тогда
	//		СтрокаРек.СКВ_Прол = СтрокаРек.СКВ;
	//	Иначе	
	//		СтрокаРек.СКВ_Прол = 0;
	//		СтрокаРек.ЭтоПролонгация = Ложь;
	//	КонецЕсли;	
	//КонецЦикла;	
	тзСхемаРасчетаДляАгентов = ТЗ1.Скопировать(, "Агент,СхемаРасчетаСМенеджером");
	тзСхемаРасчетаДляАгентов.Свернуть("Агент,СхемаРасчетаСМенеджером");
	
	Если ЭтоВариант20200201 Тогда
		ТЗ1.Сортировать("ДатаПриемки,Номер");
		
		СтруктураОтбораПродление = Новый Структура("СхемаРасчетаСМенеджером", ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
		
		//Сообщить(ТЗ1.Количество());
		//Сообщить(ТЗ1.Итог("НовыйКлиент"));
		//Сообщить(ТЗ1.Скопировать(Новый Структура("НовыйКлиент,СхемаРасчетаСМенеджером",1,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)).Итог("СКВ"));
		Для каждого СтрокаАгента из тзСхемаРасчетаДляАгентов.НайтиСтроки(СтруктураОтбораПродление) Цикл
			нСтроки = ТЗАгентов.НайтиСтроки(Новый Структура("Агент",СтрокаАгента.Агент));
			Если нСтроки.Количество() = 0 Тогда
				//Сообщить("Не найден агент "+СтрокаАгента.Агент);
				//Продолжить;
				ПерваяБонусПланка = 250000;
			Иначе	
				ПерваяБонусПланка = нСтроки[0].ПерваяБонусПланка;
			КонецЕсли;	
			
			СтруктураОтбораПродление.Вставить("Агент",СтрокаАгента.Агент);
			ОбщийСКВ = 0;
			СКВ_КС = 0;
			//ПерваяБонусПланка = нСтроки[0].ПерваяБонусПланка;
			Для каждого СтрокаТЗ1 из тз1.НайтиСтроки(СтруктураОтбораПродление) Цикл
				Если СтрокаТЗ1.СКВ = 0 Тогда
					Продолжить;
				КонецЕсли;	
				Если СтрокаТЗ1.ЭтоКрупнаяСделка =Истина Тогда
					СКВ_КС = СКВ_КС+СтрокаТЗ1.СКВ;
					СтрокаТЗ1.СКВ_КС = СтрокаТЗ1.СКВ;
				Иначе	
					
					Превышение = (ОбщийСКВ +СтрокаТЗ1.СКВ) - ПерваяБонусПланка;
					Если Превышение>0 Тогда
						//
						Если ОбщийСКВ> ПерваяБонусПланка Тогда
							//Уже превышен, всё бонуспланка
							СтрокаТЗ1.СКВ_БП   = СтрокаТЗ1.СКВ;
							Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
								СтрокаТЗ1.СКВ_БП_Прол = 0;
								СтрокаТЗ1.СКВ_БП_НБ   = СтрокаТЗ1.СКВ;
							Иначе
								СтрокаТЗ1.СКВ_БП_Прол = СтрокаТЗ1.СКВ;
								СтрокаТЗ1.СКВ_БП_НБ   = 0;
							КонецЕсли;

						Иначе
							//Только превысил
							В_СКВ = СтрокаТЗ1.СКВ - Превышение;	
							Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
								СтрокаТЗ1.СКВ_Прол = 0;
								СтрокаТЗ1.СКВ_НБ   = В_СКВ;
							Иначе
								СтрокаТЗ1.СКВ_Прол = В_СКВ;
								СтрокаТЗ1.СКВ_НБ   = 0;
							КонецЕсли;
							СтрокаТЗ1.СКВ_БП   = Превышение;
							Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
								СтрокаТЗ1.СКВ_БП_Прол = 0;
								СтрокаТЗ1.СКВ_БП_НБ   = Превышение;
							Иначе
								СтрокаТЗ1.СКВ_БП_Прол = Превышение;
								СтрокаТЗ1.СКВ_БП_НБ   = 0;
							КонецЕсли;
						КонецЕсли;	
					Иначе
						Если СтрокаТЗ1.НовыйКлиент = 1 Тогда
							СтрокаТЗ1.СКВ_Прол = 0;
							СтрокаТЗ1.СКВ_НБ   = СтрокаТЗ1.СКВ;
						Иначе
							СтрокаТЗ1.СКВ_Прол = СтрокаТЗ1.СКВ;
							СтрокаТЗ1.СКВ_НБ   = 0;
						КонецЕсли;
					КонецЕсли;	
					
					ОбщийСКВ = ОбщийСКВ +СтрокаТЗ1.СКВ;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		//Сообщить("СКВ: "+Тз1.Итог("СКВ"));
		//Сообщить("Пролонгация : "+Тз1.Итог("СКВ_Прол"));
		//Сообщить("Новый бизнес: "+Тз1.Итог("СКВ_НБ"));
		//Сообщить("Сверх: "+Тз1.Итог("СКВ_БП"));
		
		//Для каждого СтрокаТЗ1 из тз1.НайтиСтроки(СтруктураОтбораПродление) Цикл
		//	Если СтрокаТЗ1.НовыйКлиент = Истина Тогда
		//		СтрокаТЗ1.СКВ_Прол = 0;
		//		СтрокаТЗ1.СКВ_НБ   = СтрокаТЗ1.СКВ;
		//	Иначе
		//		СтрокаТЗ1.СКВ_Прол = СтрокаТЗ1.СКВ;
		//		СтрокаТЗ1.СКВ_НБ   = 0;
		//	КонецЕсли;	
		//КонецЦикла;	
	КонецЕсли;	
	
	
	тзСуммыВМ_ПоПодразделениям = ТЗ1.Скопировать(СтруктураОтбора2, "Организация,Агент,Подразделение,ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,СуммаДБ");
	тзСуммыВМ_ПоПодразделениям.Свернуть("Подразделение","ВознаграждениеМенеджера,ВознаграждениеДоп,ПартнерскоеВознаграждение,СуммаДБ");
	тзСуммы_ДляПланаПоСКВ_ПоАгентам = ТЗ1.Скопировать(СтруктураОтбора, "Агент,Подразделение,СКВ,СКВ_Прол,СКВ_НБ,СКВ_КС,СКВ_БП,СКВ_БП_Прол,СКВ_БП_НБ,НачисленнаяСуммаВзноса, КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	тзСуммы_ДляПланаПоСКВ_ПоАгентам.Свернуть("Агент,Подразделение","СКВ,СКВ_Прол,СКВ_НБ,СКВ_КС,СКВ_БП,СКВ_БП_Прол,СКВ_БП_НБ,НачисленнаяСуммаВзноса, КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП = ТЗ1.Скопировать(, "Агент,Подразделение,СКВ,НачисленнаяСуммаВзноса");
	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Свернуть("Агент,Подразделение","СКВ,НачисленнаяСуммаВзноса");
	тзСуммыПлановПоСКВ_ПоПодразделениям = ТЗАгентов.Скопировать(, "Агент,Подразделение,План,ШтрафнойПлан,Количество");//СтруктураОтбора убрал
	тзСуммыПлановПоСКВ_ПоПодразделениям.Свернуть("Подразделение","План,ШтрафнойПлан,Количество");
	тзСуммыСКВ_ПоПодразделениям = ТЗ1.Скопировать(, "Подразделение,СКВ,СКВ_Прол,СКВ_НБ,СКВ_КС,СКВ_БП,СКВ_БП_Прол,СКВ_БП_НБ,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Скопировать(,"Агент,Подразделение,СКВ");
	тзСуммыСКВ_ПоПодразделениям.Свернуть("Подразделение","СКВ,СКВ_Прол,СКВ_НБ,СКВ_КС,СКВ_БП,СКВ_БП_Прол,СКВ_БП_НБ,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	//Заполняем Фактические параметры для подразделений 
	Кол = тзПодразделений.Колонки;
	Кол.Добавить("СуммаВМ",								ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоПодразделению",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("КоличествоФакт_ПоПодразделению",		ОписаниеТипаЧисло12_0);
	Кол.Добавить("КоэффициентВида_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	Кол.Добавить("НовыйКлиент_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	Кол.Добавить("НовыйКлиентСКВ_ПоПодразделению",		ОписаниеТипаЧисло14_2_но);	
	
	
	Кол.Добавить("КоэффициентВидаГод_ПоПодразделению",		ОписаниеТипаЧисло12_0);	
	
	Кол.Добавить("СКВ_ПоПодразделениямДоСП",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ИтогоЗПпоПодразделению",				ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаПлана",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаКоличествоПлан",					ОписаниеТипаЧисло12_0);
	Кол.Добавить("ИтогоЗПОрг",							ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаПланаОрг",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаКоличествоПланОрг",				ОписаниеТипаЧисло12_0);
	Кол.Добавить("Организация",							ОписаниеТипа_Организации);
	Кол.Добавить("СуммаВознаграждения_РОПОрг",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаВознаграждения_ЗамРОПОрг",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентВыполненияПлана_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения_РОП",			ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения_РОП_Прол",			ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения_РОП_НБ",			ОписаниеТипаПроцент);
	Кол.Добавить("СуммаВознаграждения_РОП",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаВознаграждения_РОП_Прол",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("СуммаВознаграждения_РОП_НБ",	ОписаниеТипаЧисло14_2_но);

	Кол.Добавить("СуммаВознаграждения_ЗамРОП",			ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ЭтоПодразделениеЕстьВТЗ1", 			ОписаниеТипаБулево);
	Для Каждого Стр ИЗ тзПодразделений Цикл
		Стр.Организация = Стр.Подразделение.Владелец;
		Если СписокПодразделенийИзТЗ1.Найти(Стр.Подразделение,"Подразделение") <> Неопределено Тогда
			Стр.ЭтоПодразделениеЕстьВТЗ1 = Истина;
		КонецЕсли;
		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыПлана <> Неопределено Тогда
			Стр.СуммаПлана = СтрокаСуммыПлана.План-СтрокаСуммыПлана.ШтрафнойПлан;
			Стр.СуммаКоличествоПлан = СтрокаСуммыПлана.Количество;
		КонецЕсли;
		
		СтрокаСуммыСКВ = тзСуммыСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыСКВ <> Неопределено Тогда
			Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению = СтрокаСуммыСКВ.СКВ;
			Стр.КоличествоФакт_ПоПодразделению = СтрокаСуммыСКВ.КоличествоФакт;
			Стр.КоэффициентВида_ПоПодразделению = СтрокаСуммыСКВ.КоэффициентВида;			
			Стр.НовыйКлиент_ПоПодразделению = СтрокаСуммыСКВ.НовыйКлиент;			
			Стр.НовыйКлиентСКВ_ПоПодразделению = СтрокаСуммыСКВ.НовыйКлиентСКВ;			
			Стр.НовыйКлиент_ПоПодразделению = СтрокаСуммыСКВ.НовыйКлиент;			
			Стр.СКВ_Прол = СтрокаСуммыСКВ.СКВ_Прол;			
			Стр.СКВ_НБ = СтрокаСуммыСКВ.СКВ_НБ;			
			Стр.СКВ_КС = СтрокаСуммыСКВ.СКВ_КС;			
			Стр.СКВ_БП = СтрокаСуммыСКВ.СКВ_БП;			
			Стр.СКВ_БП_Прол = СтрокаСуммыСКВ.СКВ_БП_Прол;			
			Стр.СКВ_БП_НБ = СтрокаСуммыСКВ.СКВ_БП_НБ;
		КонецЕсли;
		
		СтрокаСуммыВМ = тзСуммыВМ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
		Если СтрокаСуммыВМ <> Неопределено Тогда
			Стр.СуммаВМ = СтрокаСуммыВМ.ВознаграждениеМенеджера+СтрокаСуммыВМ.ПартнерскоеВознаграждение;
			Стр.СуммаДБ = СтрокаСуммыВМ.СуммаДБ;
		КонецЕсли;
		бСхПроцентОтСКВ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ;
		бСхПроцентОтВМ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтВМ;
		бСхПроцентОтДБ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтДБ и ЭтоВариант20180701 ;
		Если бСхПроцентОтДБ Тогда
			//Если ЭтоВариант20180701 Тогда  Расчет будет по сотрудникам ниже
			//	Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;	
			//	Стр.СуммаВознаграждения_РОП		= Стр.СуммаДБ * Стр.СтавкаВознаграждения_РОП / 100;	
			//Иначе
				Стр.СтавкаВознаграждения_РОП = 0;
				Стр.СуммаВознаграждения_РОП	 = 0;
			//КонецЕсли;
		ИначеЕсли бСхПроцентОтСКВ Тогда
			колПланРукВыполнен = ЭтоВариант20130901=ЛОЖЬ ИЛИ Стр.СуммаКоличествоПлан=0 ИЛИ Стр.КоличествоФакт_ПоПодразделению>=Стр.СуммаКоличествоПлан;
			Если ЭтоВариант20200401  Тогда 
				Сетка = уб_РасчетыСМенеджерами.ПолучитьСетку(ЗарплатныйПериод,Стр.Подразделение);
				СКВ_КС_НБ   = Стр.СКВ_КС_НБ;
				СКВ_КС_Прол = Стр.СКВ_КС- Стр.СКВ_КС_НБ;
				ПроцентВыполнения_НБ = ?(Стр.ПланНовыйБизнес=0,100,(Стр.СКВ_НБ+СКВ_КС_НБ)*100/Стр.ПланНовыйБизнес);
				
				Для каждого СтрокаСетки из Сетка Цикл
					Если ПроцентВыполнения_НБ>=СтрокаСетки.ПроцентОт Тогда
						Стр.СтавкаВознаграждения_РОП_НБ   = СтрокаСетки.СтавкаНБ;
						Прервать
					КонецЕсли;	
				КонецЦикла;	
				
				ПроцентВыполнения_Прол = ?(Стр.ПланПролонгация=0,100,(Стр.СКВ_Прол+СКВ_КС_Прол)*100/Стр.ПланПролонгация);
				Для каждого СтрокаСетки из Сетка Цикл
					Если ПроцентВыполнения_Прол>=СтрокаСетки.ПроцентОт Тогда
						Стр.СтавкаВознаграждения_РОП_Прол   = СтрокаСетки.СтавкаПролонгация;
						Прервать
					КонецЕсли;	
				КонецЦикла;	
				
				Если ЭтоВариант20200901 и  Стр.Подразделение = МотивацияПоКаждомуСотруднику Тогда 
				ИначеЕсли ЭтоВариант20201001 и  Стр.Подразделение = МотивацияПоКаждомуСотруднику2 Тогда 	
				Иначе
					//Если Найти("ОП-4,ОП-3",СокрЛП(Стр.Подразделение)) = 0 Тогда
					Если Найти("ОП-4,ОП-3,000000038,000000025",СокрЛП(Стр.Подразделение.Код)) = 0 Тогда
						Стр.СуммаВознаграждения_РОП_Прол = Стр.СтавкаВознаграждения_РОП_Прол*Стр.СКВ_Прол/100;
						Стр.СуммаВознаграждения_РОП_НБ = Стр.СтавкаВознаграждения_РОП_НБ*Стр.СКВ_НБ/100;
					Иначе
						Стр.СуммаВознаграждения_РОП_Прол = Стр.СтавкаВознаграждения_РОП_Прол*(Стр.СКВ_Прол+Стр.СКВ_БП_Прол)/100;
						Стр.СуммаВознаграждения_РОП_НБ = Стр.СтавкаВознаграждения_РОП_НБ*(Стр.СКВ_НБ+Стр.СКВ_БП_НБ)/100;
					КонецЕсли;	
					Стр.СуммаВознаграждения_РОП = Стр.СуммаВознаграждения_РОП_Прол+Стр.СуммаВознаграждения_РОП_НБ;
				КонецЕсли;
				//
				Если ЭтоПолныеПрава = Истина или Стр.Руководитель = ПараметрыСеанса.уб_ТекущееФизЛицо Тогда
					Сообщить("------ "+?(ВРеальномВремени = Истина,"На текущий момент","На "+ДатаСреза)+" -----");
					Сообщить(Стр.Руководитель);
					Сообщить("Процент выполнения новый бизнес "+ Окр(ПроцентВыполнения_НБ,5));
					Сообщить("Ставка новый бизнес "+ Стр.СтавкаВознаграждения_РОП_НБ);
					Сообщить("СКВ новый бизнес "+ Стр.СКВ_НБ);
					Сообщить("Процент выполнения пролонгация "+ Окр(ПроцентВыполнения_Прол,5));
					Сообщить("Ставка пролонгация "+ Стр.СтавкаВознаграждения_РОП_Прол);
					Сообщить("СКВ пролонгация "+ Стр.СКВ_Прол);
				КонецЕсли;	
				
			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательПлана_РОП / 100 Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП-?(колПланРукВыполнен,0,1);	
			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательМинимальногоПорога_РОП / 100 Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП-?(колПланРукВыполнен,0,1);	
			Иначе
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+?(колПланРукВыполнен и ЭтоВариант20130901 и НЕ ЭтоВариант20191201,1,0);	
			КонецЕсли;
			Если ЭтоВариант20200401  Тогда 
				//
			ИначеЕсли ЭтоВариант20120401  Тогда 
				//В этом случае расчет может быть скорректирован
			ИначеЕсли ЭтоВариант20121001 Тогда
				//
				Стр.СуммаВознаграждения_РОП	= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению) * Стр.СтавкаВознаграждения_РОП / 100;	
				//Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению-Стр.СКВ_КС) * Стр.СтавкаВознаграждения_РОП / 100;	
			Иначе
				Стр.СуммаВознаграждения_РОП	= Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению * Стр.СтавкаВознаграждения_РОП / 100;	
			КонецЕсли;	
			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.СуммаПлана = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.СуммаПлана * 100);	
		ИначеЕсли бСхПроцентОтВМ Тогда	
			//Для схемы вознаграждения руководителя  ПроцентОтВМ значения показателей имеет иной смысл:
			Если Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательПлана_РОП Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП;	
			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательМинимальногоПорога_РОП Тогда
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП;	
			Иначе
				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;	
			КонецЕсли;
			Стр.СуммаВознаграждения_РОП		= Стр.СуммаВМ * Стр.СтавкаВознаграждения_РОП / 100;	
			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.ПоказательПлана_РОП = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.ПоказательПлана_РОП * 100);	
		
		КонецЕсли;
		Если НЕ Стр.РуководительПолучаетВознаграждение Тогда
			Стр.СуммаВознаграждения_РОП = 0;
		КонецЕсли;	
	КонецЦикла;
	//Добавляем в ТЗ1 пустые строки для Подразделений, у которых небыло оплат
	Для Каждого Стр ИЗ тзПодразделений Цикл
		Если НЕ Стр.ЭтоПодразделениеЕстьВТЗ1 Тогда
			НовОплата				= ТЗ1.Добавить();
			НовОплата.Подразделение	= Стр.Подразделение;		
			НовОплата.Пустышка		= Истина;	
			НовОплата.СКВ = 0;
			НовОплата.КоличествоФакт = 0;
			НовОплата.КоэффициентВида = 0;
			НовОплата.НовыйКлиент = 0;			
			НовОплата.НовыйКлиентСКВ = 0;
			НовОплата.ОплаченоФакт = 0;
			НовОплата.НачисленнаяСуммаВзноса = 0;
			НовОплата.СкидкаВыплаченаяКлиенту = 0;
			НовОплата.КВСумма = 0;
			НовОплата.КВСуммаДляАгента = 0; 
			НовОплата.ВознаграждениеМенеджера = 0;
			НовОплата.ВознаграждениеДоп = 0;
			НовОплата.ПартнерскоеВознаграждение = 0;
			НовОплата.ВычетСАгента = 0;
			НовОплата.АВилиСкидкаСумма  = 0;
			НовОплата.Ед = 0;
			НовОплата.СуммаДБ = 0;
		КонецЕсли;
	КонецЦикла;	
	//Заполняем Фактические параметры для Агентов 
	Кол = ТЗАгентов.Колонки;
	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоАгенту",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("КоличествоФакт_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту
	Кол.Добавить("КоэффициентВида_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("НовыйКлиент_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("НовыйКлиентСКВ_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	
	Кол.Добавить("КоэффициентВидаГод_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту	
	Кол.Добавить("СобраннаяСП",					ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентВыполненияПлана",		ОписаниеТипаПроцент);
	Кол.Добавить("ПроцентВыполненияПланаДляРОП",		ОписаниеТипаПроцент);
	Кол.Добавить("СтавкаВознаграждения",		ОписаниеТипаПроцент);
	Кол.Добавить("СКВдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
	Кол.Добавить("СКВотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
	Кол.Добавить("СКВот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("СКВСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
	Кол.Добавить("ЗПотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
	Кол.Добавить("ЗПот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
	Кол.Добавить("ЗПотСКВдоСуперПлана",			ОписаниеТипаЧисло14_2_но); //До Первой БП
	Кол.Добавить("ЗПЗаПревышение1БП",	        ОписаниеТипаЧисло14_2_но); //201212
	Кол.Добавить("ЗП_Пролонгация",			ОписаниеТипаЧисло14_2_но); //До Первой БП
	Кол.Добавить("ЗП_НовыйБизнес",			ОписаниеТипаЧисло14_2_но); //До Первой БП
	Кол.Добавить("ПревышениеСуперплана",		ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ЗПотЗаПревышениеСуперПлана",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ИтогоЗП",						ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ВознаграждениеРуководителя",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ВознаграждениеЗамаРуководителя",	ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("ПроцентРОП",	                ОписаниеТипаПроцент);
	Кол.Добавить("ДельтаКСРуководитель",	ОписаниеТипаЧисло14_2_но);
	
	Кол.Добавить("БОНУС_КС_",ОписаниеТипаЧисло14_2_но);
	Кол.Добавить("БратьВИтоги",ОписаниеТипаБулево);
	СписокУчтенных = Новый Массив;
	
	ВыборкаМенеджеров = ВыполнениеПланаМенеджерами(ТЗАгентов.ВыгрузитьКолонку("Агент"), ЗарплатныйПериод); ТзАгентов.Сортировать("Подразделение");
	
	Для Каждого Стр ИЗ ТЗАгентов Цикл
		Если СписокУчтенных.Найти(Стр.Агент) = Неопределено Тогда
			Стр.БратьВИтоги = Истина;
			СписокУчтенных.Добавить(Стр.Агент);
		Иначе
			Стр.БратьВИтоги = Ложь;
		КонецЕсли;	
		СтрокаСумм = тзСуммы_ДляПланаПоСКВ_ПоАгентам.Найти(Стр.Агент,"Агент"); //Тут таблица только по схеме
		ДопПроцент = 0; //За выполнение НС при невыполнении плана по суммам
		Если СтрокаСумм <> Неопределено Тогда
			Стр.СКВ_ДляПланаПоСКВ_ПоАгенту = СтрокаСумм.СКВ;
			Стр.СКВ_Прол                   = СтрокаСумм.СКВ_Прол;
			Стр.СКВ_БП                     = СтрокаСумм.СКВ_БП;
			Стр.СКВ_БП_Прол                = СтрокаСумм.СКВ_БП_Прол;			
			Стр.СКВ_БП_НБ                  = СтрокаСумм.СКВ_БП_НБ;
			
			Стр.СКВ_НБ                    = СтрокаСумм.СКВ_НБ;
			Стр.СКВ_КС                    = СтрокаСумм.СКВ_КС;
			
			Стр.СобраннаяСП					= СтрокаСумм.НачисленнаяСуммаВзноса; 
			Стр.ПроцентВыполненияПлана		= ?(Стр.План = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту / Стр.План * 100); 
			Стр.ПроцентВыполненияПланаДляРОП = ?((Стр.План-Стр.ШтрафнойПлан) = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту / (Стр.План-Стр.ШтрафнойПлан) * 100); 
			
			Стр.КоличествоФакт_ПоАгенту		= СтрокаСумм.КоличествоФакт;
			Стр.КоэффициентВида_ПоАгенту	= СтрокаСумм.КоэффициентВида;
			Стр.НовыйКлиент_ПоАгенту	= СтрокаСумм.НовыйКлиент;
			Стр.НовыйКлиентСКВ_ПоАгенту	= СтрокаСумм.НовыйКлиентСКВ;
			
			
		ИначеЕсли ЭтоВариант20180701 Тогда	
			Стр.СКВ_ДляПланаПоСКВ_ПоАгенту	= 0;
			Стр.СобраннаяСП					= 0; 
			Стр.ПроцентВыполненияПлана		= 0; 
			Стр.ПроцентВыполненияПланаДляРОП = 0; 
			
			Стр.КоличествоФакт_ПоАгенту		= 0;
			Стр.КоэффициентВида_ПоАгенту	= 0;
			Стр.НовыйКлиент_ПоАгенту	= 0;
			Стр.НовыйКлиентСКВ_ПоАгенту	= 0;
			
			
		Иначе
			Продолжить;
		КонецЕсли;	
		
		СтрокаСумм = ТЗ1_ГодНазад.Найти(Стр.Агент,"Агент");
		Если СтрокаСумм <> Неопределено Тогда
			Стр.КоэффициентВидаГод_ПоАгенту	= СтрокаСумм.КоэффициентВида;
		КонецЕсли;	
		
		//ПланВыполнен = уб_РасчетыСМенеджерами.ПланВыполнен(Стр.Агент,ЗарплатныйПериод,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Менеджер", Стр.Агент);
		ВыборкаМенеджеров.Сбросить();
		
		Если ВыборкаМенеджеров.НайтиСледующий(СтруктураПоиска) Тогда
			ПланВыполнен = ВыборкаМенеджеров.ВыполненПлан;
			РаскраситьКоличественныйПлан = Ложь;
			РаскраситьПлан = Ложь;
		ИначеЕсли ЭтоВариант20181001 Тогда
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			ПроцентНовых = ?(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту=0,0,Цел(100*Стр.НовыйКлиентСКВ_ПоАгенту/Стр.СКВ_ДляПланаПоСКВ_ПоАгенту));
			КоличественныйПланВыполнен = ПроцентНовых>=20 или Стр.КоэффициентВида_ПоАгенту>=Стр.КоэффициентВидаГОД_ПоАгенту;
			ПланВыполнен = СуммовойПланВыполнен И КоличественныйПланВыполнен;
			ДопПроцент = 0;//?(КоличественныйПланВыполнен=Истина ,5,0);//
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;		
		ИначеЕсли ЭтоВариант20130801 Тогда
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			//КоличественныйПланВыполнен = Стр.КоэффициентВида >= Стр.КоэффициентВидаГОд;
			КоличественныйПланВыполнен = Стр.КоличествоФакт_ПоАгенту >= Стр.Количество;
			ПланВыполнен = СуммовойПланВыполнен И КоличественныйПланВыполнен;
			ДопПроцент = ?(ПланВыполнен=ЛОЖЬ и КоличественныйПланВыполнен=Истина ,?(ЗарплатныйПериод<Дата(2018,10,1),5,0),0);//За выполнение НС при невыполнении плана по суммам
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;
		Иначе
			СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
			ПланВыполнен = СуммовойПланВыполнен;
			РаскраситьПлан = Не СуммовойПланВыполнен;
			РаскраситьКоличественныйПлан = Ложь;
		КонецЕсли;
		РаскраситьПолеМенеджера = Не ПланВыполнен;
		
		Если РаскраситьПолеМенеджера = Истина Или РаскраситьПлан = Истина Или РаскраситьКоличественныйПлан = Истина Тогда
			
			НайденныеСтроки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаМенеджера = НайденныеСтроки[0];
			Иначе
				СтрокаМенеджера = тзАгентовДляРаскраски.Добавить();
				СтрокаМенеджера.Менеджер = Стр.Агент;
				СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь;
				СтрокаМенеджера.РаскраситьПлан = Ложь;
				СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь Тогда
				СтрокаМенеджера.РаскраситьПолеМенеджера = РаскраситьПолеМенеджера;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьПлан = Ложь Тогда
				СтрокаМенеджера.РаскраситьПлан = РаскраситьПлан;
			КонецЕсли;
			
			Если СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь Тогда
				СтрокаМенеджера.РаскраситьКоличественныйПлан = РаскраситьКоличественныйПлан;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоВариант20200301 Тогда
			
			ПолныйПлан = Стр.План+Стр.ШтрафнойПлан;
			СКВ  = Стр.СКВ_Прол+Стр.СКВ_НБ+Стр.СКВ_КС;
			Стр.ВыполненПланПоСКВ = СКВ>=ПолныйПлан;
			
			Стр.СКВотПланадо1БП = СКВ;
			Стр.СКВот1БПдо2БП   = Стр.СКВ_БП;
			
			Стр.СКВСвыше2БП     = 0;
			
			
			Стр.ЗПЗаПревышение1БП   = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
			Стр.ЗПот1БПдо2БП     =Стр.ЗПЗаПревышение1БП;//Дублируется для отчета
			Стр.ЗП_Пролонгация      = Стр.СКВ_Прол*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;		
			Стр.ЗП_НовыйБизнес      = Стр.СКВ_НБ*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаНовыйБизнес,Стр.ПроцентнаяСтавкаНовыйБизнесДоПлана)/100;		
			
			Бонус_КС     = 0;
			БОНУС_РОП_КС = 0;
			СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,Агент,СхемаРасчетаСМенеджером",Истина,Стр.Агент,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
			СтрокиКС = ТЗ1.НайтиСтроки(СтруктураОтбораКС);
			
			Для каждого СтрокаКС из СтрокиКС Цикл
				СтрокаКС.СКВ_КС =  СтрокаКС.СКВ;
				Если СтрокаКС.НовыйКлиент = 1 Тогда
					СтрокаКС.БОНУС_КС = СтрокаКС.СКВ_КС * Макс(?(ПланВыполнен=Истина,СтрокаКС.БонусПроцент+Стр.ПроцентнаяСтавкаНовыйБизнес,Стр.ПроцентнаяСтавкаНовыйБизнесДоПлана),0)/100;
				Иначе	
					СтрокаКС.БОНУС_КС = СтрокаКС.СКВ_КС * Макс(?(ПланВыполнен=Истина,СтрокаКС.БонусПроцент+Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана),0)/100;
				КонецЕсли;	
				Бонус_КС = Бонус_КС + СтрокаКС.БОНУС_КС;
				БОНУС_РОП_КС = БОНУС_РОП_КС+ СтрокаКС.СКВ_КС*СтрокаКС.БонусПроцентРОП/100;
			КонецЦикла;	
			
			//Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) - Стр.План,0);
			//Стр.СКВот1БПдо2БП               = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.ПерваяБонусПланка,0);
			//Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
			//Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
			////Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)
			////Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
			//Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
			//Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
			//Стр.ЗП_Пролонгация              = Стр.СКВ_Прол*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;		
			
			Если Стр.БратьВИтоги Тогда
				Стр.ИтогоЗП	= Стр.ЗПотСКВдоСуперПлана + Стр.ЗПотЗаПревышениеСуперПлана+Стр.ЗПЗаПревышение1БП
				+ Стр.ЗП_Пролонгация
				+ Стр.ЗП_НовыйБизнес;//+?(ЭтоВариант20121001,БОНУС_КС,0);
				Стр.БОНУС_КС_ = ?(ЭтоВариант20121001,БОНУС_КС,0);
				Стр.БОНУС_РОП_КС = ?(ЭтоВариант20121001,БОНУС_РОП_КС,0);
			Иначе
				Стр.ИтогоЗП = 0 ;
			КонецЕсли;	
			
			СтрокаПодразделения				= тзПодразделений.Найти(Стр.Подразделение,"Подразделение");
			Если ЭтоВариант20200401 Тогда
				//вознаграждение руководителя по каждому агенту
				
				Если СтрокаПодразделения <> Неопределено и СтрокаПодразделения.РуководительПолучаетВознаграждение Тогда
					
					Если СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ тогда
						Попытка
							Если Стр.ВознаграждениеМенеджера>=-100 Тогда
								Стр.ВознаграждениеРуководителя = Окр(Стр.СуммаДБ*СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП/100,2);
								СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
							КонецЕсли;	
						Исключение
						КонецПопытки;	
					ИначеЕсли СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ тогда
						
						
						//Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
						
						Если ЭтоВариант20200901 и  Стр.Подразделение = МотивацияПоКаждомуСотруднику  
							ИЛИ ЭтоВариант20201001 и  Стр.Подразделение = МотивацияПоКаждомуСотруднику2 Тогда 	
							
							//++++++ отличие в определении ставки по каждому сотруднику
							СКВ_КС_НБ   = Стр.СКВ_КС_НБ;
							СКВ_КС_Прол = Стр.СКВ_КС- Стр.СКВ_КС_НБ;
							
							//#####
							Если Стр.ПланНовыйБизнес = 0 и Стр.ПланПролонгация = 0 Тогда
								ПроцентВыполнения_НБ = ?(Стр.План=0,100,(Стр.СКВ_НБ+СКВ_КС_НБ+Стр.СКВ_Прол+СКВ_КС_Прол)*100/Стр.План);
								ПроцентВыполнения_Прол = ПроцентВыполнения_НБ;
							//#####	
							
							Иначе	
								ПроцентВыполнения_НБ = ?(Стр.ПланНовыйБизнес=0,100,(Стр.СКВ_НБ+СКВ_КС_НБ)*100/Стр.ПланНовыйБизнес);
								ПроцентВыполнения_Прол = ?(Стр.ПланПролонгация=0,100,(Стр.СКВ_Прол+СКВ_КС_Прол)*100/Стр.ПланПролонгация);
							КонецЕсли;	
							СтавкаВознаграждения_РОП_НБ = 0;
							Для каждого СтрокаСетки из ?(Стр.Подразделение = МотивацияПоКаждомуСотруднику,Сетка01,Сетка02) Цикл
								Если ПроцентВыполнения_НБ>=СтрокаСетки.ПроцентОт Тогда
									СтавкаВознаграждения_РОП_НБ   = СтрокаСетки.СтавкаНБ;
									Прервать
								КонецЕсли;	
							КонецЦикла;	
							
							СтавкаВознаграждения_РОП_Прол  = 0;
							
							Для каждого СтрокаСетки из ?(Стр.Подразделение = МотивацияПоКаждомуСотруднику,Сетка01,Сетка02) Цикл
								Если ПроцентВыполнения_Прол>=СтрокаСетки.ПроцентОт Тогда
									СтавкаВознаграждения_РОП_Прол   = СтрокаСетки.СтавкаПролонгация;
									Прервать
								КонецЕсли;	
							КонецЦикла;	
						
							СуммаВознаграждения_РОП_Прол = Окр(СтавкаВознаграждения_РОП_Прол*Стр.СКВ_Прол/100,2);
							СуммаВознаграждения_РОП_НБ   = Окр(СтавкаВознаграждения_РОП_НБ*Стр.СКВ_НБ/100,2);
							//Если Найти("ОП-4,ОП-3",СокрЛП(Стр.Подразделение)) = 0 Тогда
							Если Найти("ОП-4,ОП-3,000000038,000000025",СокрЛП(Стр.Подразделение.Код)) = 0 Тогда
								СуммаВознаграждения_РОП_Прол = Окр(СтавкаВознаграждения_РОП_Прол*Стр.СКВ_Прол/100,2);
								СуммаВознаграждения_РОП_НБ   = Окр(СтавкаВознаграждения_РОП_НБ*Стр.СКВ_НБ/100,2);
							Иначе
								СуммаВознаграждения_РОП_Прол = Окр(СтавкаВознаграждения_РОП_Прол*(Стр.СКВ_Прол+Стр.СКВ_БП_Прол)/100,2);
								СуммаВознаграждения_РОП_НБ   = Окр(СтавкаВознаграждения_РОП_НБ*(Стр.СКВ_НБ+Стр.СКВ_БП_НБ)/100,2);
							КонецЕсли;
						    //-------
							СтрокаПодразделения.СуммаВознаграждения_РОП_Прол = СтрокаПодразделения.СуммаВознаграждения_РОП_Прол + СуммаВознаграждения_РОП_Прол;
							СтрокаПодразделения.СуммаВознаграждения_РОП_НБ   = СтрокаПодразделения.СуммаВознаграждения_РОП_НБ   + СуммаВознаграждения_РОП_НБ;
							СтрокаПодразделения.СуммаВознаграждения_РОП      = СтрокаПодразделения.СуммаВознаграждения_РОП_Прол+СтрокаПодразделения.СуммаВознаграждения_РОП_НБ;

							
						Иначе
							СуммаВознаграждения_РОП_Прол = Окр(СтрокаПодразделения.СтавкаВознаграждения_РОП_Прол*Стр.СКВ_Прол/100,2);
							СуммаВознаграждения_РОП_НБ   = Окр(СтрокаПодразделения.СтавкаВознаграждения_РОП_НБ*Стр.СКВ_НБ/100,2);
						
						КонецЕсли;
						
						Стр.ВознаграждениеРуководителя = Окр(СуммаВознаграждения_РОП_Прол+СуммаВознаграждения_РОП_НБ,2)+Стр.БОНУС_РОП_КС;						
				
					КонецЕсли;
					
				КонецЕсли;	
			Иначе
				//+++++++++++  переходный период когда менеджеры по новому, а роп по старому
				//ПроцентнаяСтавкаДоМинимальногоПорога_РОП	5	
				//СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 8
				//Превышен план и есть крупная сделка
				НадоВыводитьСообщение = ЭтоПолныеПрава Или (СтрокаПодразделения.Руководитель = ПараметрыСеанса.уб_ТекущееФизЛицо);
				СуммаДляРуководителяПоПониженнойСтавке = 0;
				Если СуммаДляРуководителяПоПониженнойСтавке>0 
					И СтрокаПодразделения.СтавкаВознаграждения_РОП>СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 
					и ЭтоВариант20150901 = ЛОЖЬ
					Тогда //Для старых расчетных периодов так.
					СуммаДляРуководителяПоПолнойСтавке = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-СуммаДляРуководителяПоПониженнойСтавке;
					СуммаДляРуководителяПоПониженнойСтавке = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана,СуммаДляРуководителяПоПониженнойСтавке)-СуммаДляРуководителяПоПолнойСтавке;
					ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана-СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
					//Для руководителя эта часть по пониженной ставке
					ВознаграждениеРуководителя2 = (СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП / 100;
					Если НадоВыводитьСообщение И СтрокаПодразделения.СтавкаВознаграждения_РОП<>СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП Тогда
						Сообщить("Для "+СтрокаПодразделения.Руководитель+" крупная сделка подчиненного на сумму "+Формат(СуммаДляРуководителяПоПониженнойСтавке,"ЧЦ=15; ЧДЦ=2; ДФ=")+" посчитана по "+СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+"%");
					КонецЕсли;	
					Стр.ВознаграждениеРуководителя = ВознаграждениеРуководителя+ВознаграждениеРуководителя2;
					//Корректируем
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
				Иначе							
					Если ЭтоВариант20121001 Тогда
						//TO DO проверить								
					ИначеЕсли ЭтоВариант20120401 Тогда
						//TO DO проверить
						Стр.ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана)* СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
						СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
					Иначе
						Стр.ВознаграждениеРуководителя = Стр.ЗПотСКВдоСуперПлана * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;	
					КонецЕсли;	
					
				КонецЕсли;	
				
				Если ЭтоВариант20150901 = Истина Тогда
					ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
					Если //СтрокаПодразделения.Подразделение.НеПроверятьЛичныеЗаявки = Истина и 
						(ПоказательРасчетРОП>0 или Найти(Стр.Подразделение,"Ведущие")>0) Тогда
						Если ЭтоВариант20170901 Тогда
							Если ЭтоВариант20171001 = Истина Тогда
								//Ставки 4/3/0
								Если Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП=10 Тогда
									ПроцентнаяСтавкаРОП = 0;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП<>10 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=80 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=99 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-?(ЭтоВариант20191201,0,1);
								Иначе
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								КонецЕсли;	
							Иначе	
								Если ПоказательРасчетРОП>10 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)>0 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<СтрокаПодразделения.ПоказательМинимальногоПорога_РОП Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП>=100 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								Иначе
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
								КонецЕсли;	
							КонецЕсли;	
						Иначе	
							ПроцентнаяСтавкаРОП = 1;
						КонецЕсли;	
					Иначе
						Если ЭтоВариант20170101 Тогда
							ПострокаП = Строка(Стр.Подразделение);
							Если Найти(ПострокаП,"М-ОП")>0
								ИЛИ (ЭтоВариант20191201 и 
								Найти(ПострокаП,"ОП-5")>0)
								Тогда
								ПроцентнаяСтавкаРОП = СтрокаПодразделения.СтавкаВознаграждения_РОП;
							Иначе
								ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);			
							КонецЕсли; 
						Иначе
							ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);		
						КонецЕсли;
						
						//Если ЭтоПолныеПрава Тогда
						//	Сообщить("Для "+Стр.Агент+" ставка РОП "+ПроцентнаяСтавкаРОП+"["+Стр.ПроцентВыполненияПлана+"]" );
						//КонецЕсли;	
					КонецЕсли;
					
					Если ЭтоВариант20171001 = Ложь и ЭтоВариант20170901 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("СКВ без бонус планки для РОП",Стр.Агент, ДатаКонца,0)>0 Тогда
						//Костыль для Слученкова
						
						ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
						СКВ_ПоПодразделениямДоСП = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;
						//Если Стр.ПроцентВыполненияПлана<=50 Тогда
						//	ПроцентнаяСтавкаРОП = 0;
						Если Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП=10 Тогда       //Костыль слученкова
							ПроцентнаяСтавкаРОП = 0;
						ИначеЕсли Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП<>10 Тогда //Костыль Короля
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
						ИначеЕсли Стр.ПроцентВыполненияПлана<=80 Тогда
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
						ИначеЕсли Стр.ПроцентВыполненияПлана<=99 Тогда
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-1;
						Иначе
							ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
						КонецЕсли;	
						
						
						
					Иначе	
						Если ЭтоВариант20171001 Тогда
							СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,//Стр.СКВ_Прол+
							Стр.СКВДоПлана
							- ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП>0
							,Стр.СКВ_КС,0),0)
							+ Стр.СКВотПланадо1БП);
						Иначе
							Если ЭтоВариант20170901 и  ПоказательРасчетРОП>0 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)=0 Тогда
								СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,Стр.СКВДоПлана+ ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП=0,Стр.СКВ_КС,0),0)+ Стр.СКВотПланадо1БП);
							Иначе	
								СКВ_ПоПодразделениямДоСП = Стр.СКВДоПлана + ?(Стр.ПроцентВыполненияПлана>=100,Стр.СКВ_КС,0)+ Стр.СКВотПланадо1БП;
							КонецЕСли;	
						КонецЕсли;	
					КонецЕсли;	
					Если СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ и ЭтоВариант20180701 тогда
						Попытка
							Если Стр.ВознаграждениеМенеджера>=-100 Тогда
								Стр.ВознаграждениеРуководителя = Окр(Стр.СуммаДБ*СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП/100,2);
							КонецЕсли;	
						Исключение
						КонецПопытки;	
					ИначеЕсли СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ или ЭтоВариант20180701 = Ложь тогда
						Стр.ВознаграждениеРуководителя = Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
						
						Если ЭтоВариант20171001 Тогда
							Если Стр.БОНУС_РОП_КС>0 Тогда
								Если РольДоступна("ПолныеПрава") Тогда
									Сообщить("Вознаграждение руководителю за "+Стр.Агент+" включает Бонус КС = "+ Стр.БОНУС_РОП_КС);
								КонецЕсли;	
								Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+ Стр.БОНУС_РОП_КС;
							КонецЕсли;	
						КонецЕсли;
						
						
					КонецЕсли;
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
				КонецЕсли;
				//-----------
			КонецЕсли;				
			
		Иначе	
			
			Стр.ВыполненПланПоСКВ = ПланВыполнен;
			Стр.СтавкаВознаграждения = ?(ПланВыполнен, Стр.ПроцентнаяСтавкаПослеПлана, Стр.ПроцентнаяСтавкаДоПлана+ДопПроцент);
			Бонус_КС  = 0;
			//ОстатокПролонгации = 0;
			Если ЭтоВариант20121001 и (ЭтоВариант20150401=Истина ИЛИ ПланВыполнен = Истина) Тогда //Отработка не выполненного плана внутри
				//
				Если ПланВыполнен Тогда
					СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС;//-Стр.СКВ_Прол;
				Иначе	
					//Подменяем ставки, а суммы также будут распределятся по диапазонам, чтобы не влиять на зп руководителей
					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = Стр.СтавкаВознаграждения; 
					Стр.ПроцентнаяСтавкаПослеСуперПлана        = Стр.СтавкаВознаграждения;
					//КС идут в план бьез бонусов
					СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;//-Стр.СКВ_Прол;
					//= Стр.СКВ_КС-(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка))
					//= 53000 - (248000-(248000-53000)<Стр.ПерваяБонусПланка))
					// = ?((248000-53000)>Стр.ПерваяБонусПланка,0,1);
					// Мин(Стр.ПерваяБонусПланка,500000)- Мин((500000-150000),Стр.ПерваяБонусПланка)
					// Мин(Стр.ПерваяБонусПланка,236000)- Мин((236000-236000),Стр.ПерваяБонусПланка)
					Если ЭтоВариант20150901 Тогда
						ДельтаКСРуководитель = 0; //Дельты нет. т.к. все идет в план
					Иначе
						ДельтаКСРуководитель = Мин(Стр.ПерваяБонусПланка,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту)- Мин((Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС),Стр.ПерваяБонусПланка);
						Если ДельтаКСРуководитель <> 0 Тогда
							Сообщить("Дельта "+ДельтаКСРуководитель 
							//+ "/"+ Стр.Подраздаление
							+"/"+Стр.Агент);
						КонецЕсли;
					КонецЕсли;
					Стр.ДельтаКСРуководитель = ДельтаКСРуководитель;
				КонецЕсли;
				
				
				//+Новые промежуточные расчеты
				Стр.СКВДоПлана = Мин(СКВ_БЕЗ_КС,Стр.План);
				//-
				СКВ_НБ = СКВ_БЕЗ_КС;
				Если ЭтоВариант20121201 Тогда
					//+Новые промежуточные расчеты
					Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) - Стр.План,0);
					Стр.СКВот1БПдо2БП               = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.ПерваяБонусПланка,0);
					Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					//-
					//Если Стр.СКВ_Прол >0 Тогда
					//	СКВ_НБ = СКВ_БЕЗ_КС-Стр.СКВ_Прол;
					//	СКВ_Прол = Стр.СКВ_Прол;
					//	
					//	Если СКВ_НБ>Стр.ПерваяБонусПланка Тогда
					//		Стр.ЗПотСКВдоСуперПлана = Стр.ПерваяБонусПланка* Стр.СтавкаВознаграждения / 100; 
					//	Иначе
					//		Стр.ЗПотСКВдоСуперПлана = СКВ_НБ* Стр.СтавкаВознаграждения / 100; 
					//		ОстатокДоБП = Стр.ПерваяБонусПланка-СКВ_НБ;
					//		Если СКВ_Прол>ОстатокДоБП Тогда
					//			ОстатокПролонгации = СКВ_Прол-ОстатокДоБП;    //Эта сумма пойдет под 60
					//			//Стр.СКВ_Прол= Стр.СКВ_Прол-ОстатокПролонгации;//уберем из расчета под 30
					//		КонецЕсли;	
					//	КонецЕсли;	
					//	Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					//	Стр.ЗП_Пролонгация              = (Стр.СКВ_Прол-ОстатокПролонгации)*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;
					//	Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					//Иначе	
					Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
					//Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)
					//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					Стр.ЗП_Пролонгация              = Стр.СКВ_Прол*?(ПланВыполнен=Истина,Стр.ПроцентнаяСтавкаПролонгация,Стр.ПроцентнаяСтавкаПролонгацияДоПлана)/100;
					//КонецЕсли;
				Иначе	
					//+Новые промежуточные расчеты
					Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.План,0);
					Стр.СКВот1БПдо2БП               = 0;
					Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					//-
					//Стр.СКВотПланадо1БП = 0;
					Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
				КонецЕсли;	
				Бонус_КС =0;
				Если ПланВыполнен = Истина Тогда
					СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,Агент,СхемаРасчетаСМенеджером",Истина,Стр.Агент,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
					СтрокиКС = ТЗ1.НайтиСтроки(СтруктураОтбораКС);
					
					Для каждого СтрокаКС из СтрокиКС Цикл
						СтрокаКС.СКВ_КС =  СтрокаКС.СКВ;
						СтрокаКС.БОНУС_КС = СтрокаКС.СКВ_КС * Макс(СтрокаКС.БонусПроцент+Стр.СтавкаВознаграждения,0)/100;
						Бонус_КС = Бонус_КС + СтрокаКС.БОНУС_КС;
					КонецЦикла;	
				КонецЕсли;
			Иначе	
				//+Новые промежуточные расчеты
				Стр.СКВДоПлана       = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.План);
				Стр.СКВотПланадо1БП  = Макс(Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) - Стр.План,0);
				Стр.СКВот1БПдо2БП    = 0;
				Стр.СКВСвыше2БП      = Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
				//-
				//Стр.СКВотПланадо1БП = 0;
				Стр.ЗПотСКВдоСуперПлана		= Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
				Стр.ПревышениеСуперплана	= Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
			КонецЕсли;
			
			//Стр.ЗПотПланадо1БП = Стр.СКВотПланадо1БП*Стр.ПерваяБонусПланка;
			
			КорректировкаЗПСуперПлана = 0;
			СуммаДляРуководителяПоПониженнойСтавке = 0;
			ПроцентКС 		= 5;
			Бонус_КС_РОП 	= 0;
			Бонус     		= 0;
			Если Стр.ПревышениеСуперплана > 0 Тогда 
				Если ЭтоВариант20121001 Тогда
					ПревышениеСуперпланаКРаспределению = Стр.ПревышениеСуперплана;
					Если ПревышениеСуперпланаКРаспределению > 0 Тогда
						БОНУС = ПревышениеСуперпланаКРаспределению * ?(ПланВыполнен,Стр.ПроцентнаяСтавкаПослеСуперПлана,Стр.ПроцентнаяСтавкаДоПлана)/100;
					КонецЕсли;	
					Стр.ЗПотЗаПревышениеСуперПлана = БОНУС;
				Иначе
					СтруктураОтбораОплат = Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
					СКВ_КС = 0;
					//Копируем таблицу по агенту
					ТЗОплатАгентаПоСхемеПланПоСКВ = ТЗ1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером,Агент,Подразделение",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ,Стр.Агент,Стр.Подразделение));
					Для каждого СтрокаТЗ ИЗ ТЗОплатАгентаПоСхемеПланПоСКВ Цикл
						//Сообщить(СтрокаТЗ.Ссылка);
						Если СтрокаТЗ.КВСуммаДляАгента>РазмерКС Тогда
							СКВ_КС = СКВ_КС + СтрокаТЗ.СКВ;
							Если ЭтоВариант20120401 Тогда
								СуммаДляРуководителяПоПониженнойСтавке = СуммаДляРуководителяПоПониженнойСтавке+СтрокаТЗ.СКВ;
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
					Если СКВ_КС>Стр.ПревышениеСуперплана Тогда
						СуммаПоПовышеннойСтавке        = Стр.ПревышениеСуперплана;
						БОНУС_КС                       = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
						Стр.ЗПотЗаПревышениеСуперПлана = БОНУС_КС;
					Иначе
						ФактическоеПревышениеСупера    = Стр.ПревышениеСуперплана - СКВ_КС;
						СуммаПоПовышеннойСтавке        = СКВ_КС;
						БОНУС_КС      = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
						БОНУС         = ФактическоеПревышениеСупера * Стр.ПроцентнаяСтавкаПослеСуперПлана / 100;
						//+Новые промежуточные расчеты
						Стр.СКВСвыше2БП      = ФактическоеПревышениеСупера;
						//-
						Стр.ЗПотЗаПревышениеСуперПлана	= БОНУС + БОНУС_КС;
					КонецЕсли;	
					
					
					НадоВыводитьСообщение = ЭтоПолныеПрава;
					Если НадоВыводитьСообщение И Бонус_КС > 0 Тогда
						Сообщить("По агенту "+Стр.Агент+" начислен бонус за крупную сделку в размере: "+Формат(Бонус_КС,"ЧЦ=15; ЧДЦ=2"));
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;			
			//+Новые промежуточные расчеты
			Стр.ЗПдоПлана      = Мин(Стр.СКВДоПлана,СКВ_НБ) * Стр.СтавкаВознаграждения/100;
			Стр.ЗПотПланадо1БП = (Мин(СКВ_НБ,Стр.ПерваяБонусПланка)-Мин(Стр.СКВДоПлана,СКВ_НБ)) * Стр.СтавкаВознаграждения/100;
			Стр.ЗПот1БПдо2БП   = Стр.СКВот1БПдо2БП * Стр.ПроцентнаяСтавкаПослеПервойБонусПланки/100;
			Стр.ЗПСвыше2БП     = Стр.СКВСвыше2БП * Стр.ПроцентнаяСтавкаПослеСуперПлана/100;
			//-Новые промежуточные расчеты
			
			
			Если Стр.БратьВИтоги Тогда
				Стр.ИтогоЗП	= Стр.ЗПотСКВдоСуперПлана + Стр.ЗПотЗаПревышениеСуперПлана+Стр.ЗПЗаПревышение1БП
				+ Стр.ЗП_Пролонгация;//+?(ЭтоВариант20121001,БОНУС_КС,0);
				Стр.БОНУС_КС_ = ?(ЭтоВариант20121001,БОНУС_КС,0);
			Иначе
				Стр.ИтогоЗП = 0 ;
			КонецЕсли;	
			СтрокаПодразделения				= тзПодразделений.Найти(Стр.Подразделение,"Подразделение");
			Если СтрокаПодразделения <> Неопределено Тогда
				Если СтрокаПодразделения.РуководительПолучаетВознаграждение Тогда					
					Если ЭтоВариант20200401 Тогда
						Если СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ тогда
							Попытка
								Если Стр.ВознаграждениеМенеджера>=-100 Тогда
									Стр.ВознаграждениеРуководителя = Окр(Стр.СуммаДБ*СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП/100,2);
								КонецЕсли;	
							Исключение
							КонецПопытки;	
						ИначеЕсли СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ тогда
							Стр.ВознаграждениеРуководителя = Окр(СтрокаПодразделения.СтавкаВознаграждения_РОП_Прол*Стр.СКВ_Прол/100
							+СтрокаПодразделения.СтавкаВознаграждения_РОП_НБ*Стр.СКВ_НБ/100,2)
							+Стр.БОНУС_РОП_КС;						
							//Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
						КонецЕсли;
					Иначе	
						//ПроцентнаяСтавкаДоМинимальногоПорога_РОП	5	
						//СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 8
						//Превышен план и есть крупная сделка
						НадоВыводитьСообщение = ЭтоПолныеПрава Или (СтрокаПодразделения.Руководитель = ПараметрыСеанса.уб_ТекущееФизЛицо);
						Если СуммаДляРуководителяПоПониженнойСтавке>0 
							И СтрокаПодразделения.СтавкаВознаграждения_РОП>СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 
							и ЭтоВариант20150901 = ЛОЖЬ
							Тогда //Для старых расчетных периодов так.
							СуммаДляРуководителяПоПолнойСтавке = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-СуммаДляРуководителяПоПониженнойСтавке;
							СуммаДляРуководителяПоПониженнойСтавке = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана,СуммаДляРуководителяПоПониженнойСтавке)-СуммаДляРуководителяПоПолнойСтавке;
							ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана-СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
							//Для руководителя эта часть по пониженной ставке
							ВознаграждениеРуководителя2 = (СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП / 100;
							Если НадоВыводитьСообщение И СтрокаПодразделения.СтавкаВознаграждения_РОП<>СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП Тогда
								Сообщить("Для "+СтрокаПодразделения.Руководитель+" крупная сделка подчиненного на сумму "+Формат(СуммаДляРуководителяПоПониженнойСтавке,"ЧЦ=15; ЧДЦ=2; ДФ=")+" посчитана по "+СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+"%");
							КонецЕсли;	
							Стр.ВознаграждениеРуководителя = ВознаграждениеРуководителя+ВознаграждениеРуководителя2;
							//Корректируем
							СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
						Иначе							
							Если ЭтоВариант20121001 Тогда
								//TO DO проверить								
							ИначеЕсли ЭтоВариант20120401 Тогда
								//TO DO проверить
								Стр.ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана)* СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
								СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
							Иначе
								Стр.ВознаграждениеРуководителя = Стр.ЗПотСКВдоСуперПлана * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;	
							КонецЕсли;	
							
						КонецЕсли;	
						
						Если ЭтоВариант20150901 = Истина Тогда
							ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
							Если //СтрокаПодразделения.Подразделение.НеПроверятьЛичныеЗаявки = Истина и 
								(ПоказательРасчетРОП>0 или Найти(Стр.Подразделение,"Ведущие")>0) Тогда
								Если ЭтоВариант20170901 Тогда
									Если ЭтоВариант20171001 = Истина Тогда
										//Ставки 4/3/0
										Если Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП=10 Тогда
											ПроцентнаяСтавкаРОП = 0;
										ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=50 и ПоказательРасчетРОП<>10 Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
										ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=80 Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
										ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<=99 Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-?(ЭтоВариант20191201,0,1);
										Иначе
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
										КонецЕсли;	
									Иначе	
										Если ПоказательРасчетРОП>10 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)>0 Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
										ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП<СтрокаПодразделения.ПоказательМинимальногоПорога_РОП Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;
										ИначеЕсли Стр.ПроцентВыполненияПланаДляРОП>=100 Тогда
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
										Иначе
											ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
										КонецЕсли;	
									КонецЕсли;	
								Иначе	
									ПроцентнаяСтавкаРОП = 1;
								КонецЕсли;	
							Иначе
								Если ЭтоВариант20170101 Тогда
									ПострокаП = Строка(Стр.Подразделение);
									Если Найти(ПострокаП,"М-ОП")>0
										ИЛИ (ЭтоВариант20191201 и 
										Найти(ПострокаП,"ОП-5")>0)
										Тогда
										ПроцентнаяСтавкаРОП = СтрокаПодразделения.СтавкаВознаграждения_РОП;
									Иначе
										ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);			
									КонецЕсли; 
								Иначе
									ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПланаДляРОП);		
								КонецЕсли;
								
								//Если ЭтоПолныеПрава Тогда
								//	Сообщить("Для "+Стр.Агент+" ставка РОП "+ПроцентнаяСтавкаРОП+"["+Стр.ПроцентВыполненияПлана+"]" );
								//КонецЕсли;	
							КонецЕсли;
							
							Если ЭтоВариант20171001 = Ложь и ЭтоВариант20170901 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("СКВ без бонус планки для РОП",Стр.Агент, ДатаКонца,0)>0 Тогда
								//Костыль для Слученкова
								
								ПоказательРасчетРОП = уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",СтрокаПодразделения.Руководитель, ДатаКонца,0);
								СКВ_ПоПодразделениямДоСП = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;
								//Если Стр.ПроцентВыполненияПлана<=50 Тогда
								//	ПроцентнаяСтавкаРОП = 0;
								Если Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП=10 Тогда       //Костыль слученкова
									ПроцентнаяСтавкаРОП = 0;
								ИначеЕсли Стр.ПроцентВыполненияПлана<=50 и ПоказательРасчетРОП<>10 Тогда //Костыль Короля
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;	
								ИначеЕсли Стр.ПроцентВыполненияПлана<=80 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП;
								ИначеЕсли Стр.ПроцентВыполненияПлана<=99 Тогда
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП-1;
								Иначе
									ПроцентнаяСтавкаРОП = СтрокаПодразделения.ПроцентнаяСтавкаПослеПлана_РОП;
								КонецЕсли;	
								
								
								
							Иначе	
								Если ЭтоВариант20171001 Тогда
									СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,//Стр.СКВ_Прол+
									Стр.СКВДоПлана+ ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП=0,Стр.СКВ_КС,0),0)+ Стр.СКВотПланадо1БП);
								Иначе
									Если ЭтоВариант20170901 и  ПоказательРасчетРОП>0 и уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("ЭтоМастер",Стр.Агент, ДатаКонца,0)=0 Тогда
										СКВ_ПоПодразделениямДоСП = Мин(Стр.ПерваяБонусПланка,Стр.СКВДоПлана+ ?(Стр.ПроцентВыполненияПлана>=100,?(ЭтоВариант20170901 и СтрокаПодразделения.ПроцентКС_РОП=0,Стр.СКВ_КС,0),0)+ Стр.СКВотПланадо1БП);
									Иначе	
										СКВ_ПоПодразделениямДоСП = Стр.СКВДоПлана + ?(Стр.ПроцентВыполненияПлана>=100,Стр.СКВ_КС,0)+ Стр.СКВотПланадо1БП;
									КонецЕСли;	
								КонецЕсли;	
							КонецЕсли;	
							Если СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ и ЭтоВариант20180701 тогда
								Попытка
									Если Стр.ВознаграждениеМенеджера>=-100 Тогда
										Стр.ВознаграждениеРуководителя = Окр(Стр.СуммаДБ*СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП/100,2);
									КонецЕсли;	
								Исключение
								КонецПопытки;	
							ИначеЕсли СтрокаПодразделения.СхемаВознагражденияРуководителяОП =  перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ или ЭтоВариант20180701 = Ложь тогда
								Стр.ВознаграждениеРуководителя = Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
								
								Если ЭтоВариант20171001 Тогда
									Если Стр.БОНУС_РОП_КС>0 Тогда
										Если РольДоступна("ПолныеПрава") Тогда
											Сообщить("Вознаграждение руководителю за "+Стр.Агент+" включает Бонус КС = "+ Стр.БОНУС_РОП_КС);
										КонецЕсли;	
										Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+ Стр.БОНУС_РОП_КС;
									КонецЕсли;	
								КонецЕсли;
								
								
							КонецЕсли;
							
							
							Если ЭтоВариант20170101 Тогда
								Если СтрокаПодразделения.ЗамПолучаетВознаграждение = Истина  Тогда
									Стр.ВознаграждениеЗамаРуководителя = Стр.ВознаграждениеРуководителя;
								КонецЕсли;
								
							Иначе
								Стр.ВознаграждениеЗамаРуководителя = 0;
							КонецЕсли;
							
							Стр.ПроцентРОП = ПроцентнаяСтавкаРОП;
							СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
							СтрокаПодразделения.СуммаВознаграждения_ЗамРОП =СтрокаПодразделения.СуммаВознаграждения_ЗамРОП+ Стр.ВознаграждениеЗамаРуководителя;
							//Если //НадоВыводитьСообщение И 
							//	Бонус_КС_РОП > 0 Тогда
							//	//Добавляем бонус руководителю за КС
							//	Если НадоВыводитьСообщение Тогда
							//		Сообщить("Для "+СтрокаПодразделения.Руководитель+" начислен бонус за заключение агентом крупной сделки  в размере: "+Формат(Бонус_КС_РОП,"ЧЦ=15; ЧДЦ=2; ДФ=")+"");
							//	КонецЕсли;	
							//	Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+Бонус_КС_РОП;
							//	СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Бонус_КС_РОП;
							//КонецЕсли;	
						Иначе
							Стр.ВознаграждениеЗамаРуководителя = 0;
							//!!!Проверить
							Если //НадоВыводитьСообщение И 
								Бонус_КС_РОП > 0 Тогда
								//Добавляем бонус руководителю за КС
								Если НадоВыводитьСообщение Тогда
									Сообщить("Для "+СтрокаПодразделения.Руководитель+" начислен бонус за заключение агентом крупной сделки  в размере: "+Формат(Бонус_КС_РОП,"ЧЦ=15; ЧДЦ=2; ДФ=")+"");
								КонецЕсли;	
								Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+Бонус_КС_РОП;
								СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Бонус_КС_РОП;
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					Стр.ВознаграждениеРуководителя = 0;
				Конецесли;
			КонецЕсли;
			//КонецЕсли; //СтрокаСумм<>0
			
			Стр.СКВДоПлана = Мин(Стр.СКВДоПлана,СКВ_НБ);//20191001     для вывода в отчет
			//Стр.СКВ_Прол= Стр.СКВ_Прол-ОстатокПролонгации;////20191001 для вывода в отчет
		КонецЕсли;
	КонецЦикла;
	
					
	тзСуммыСКВ_ПоПодразделениямДоСП = ТЗАгентов.Скопировать(СтруктураОтбора3, "Агент,Подразделение,СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,КоэффициентВида_ПоАгенту,НовыйКлиент_ПоАгенту,НовыйКлиентСКВ_ПоАгенту,КоэффициентВидаГод_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
	тзСуммыСКВ_ПоПодразделениямДоСП.Свернуть("Подразделение","СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,КоэффициентВида_ПоАгенту,НовыйКлиент_ПоАгенту,НовыйКлиентСКВ_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
	тзПодразделений.Колонки.Добавить("БОНУС_РОП_КС_",ОписаниеТипаЧисло14_2_но);
	Для Каждого Стр ИЗ тзПодразделений Цикл
		Если ЭтоВариант20200401 Тогда
			Если  НЕ Стр.РуководительПолучаетВознаграждение Тогда
				Стр.СуммаВознаграждения_РОП = 0;
			ИначеЕсли Стр.СхемаВознагражденияРуководителяОП=Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтСКВ Тогда
				Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_НБ+Стр.СКВ_Прол;
				тзСКВпоПодДоСП = тзСуммыСКВ_ПоПодразделениямДоСП.Найти(Стр.Подразделение,"Подразделение");
				Если тзСКВпоПодДоСП <> Неопределено и тзСКВпоПодДоСП.БОНУС_РОП_КС>0 Тогда
					Стр.БОНУС_РОП_КС_ = тзСКВпоПодДоСП.БОНУС_РОП_КС;
					Стр.СуммаВознаграждения_РОП = Стр.СуммаВознаграждения_РОП+тзСКВпоПодДоСП.БОНУС_РОП_КС;
			    КонецЕсли;
			КонецЕсли; тзСКВпоПодДоСП = тзСуммыСКВ_ПоПодразделениямДоСП.Найти(Стр.Подразделение,"Подразделение");
			Если тзСКВпоПодДоСП <> Неопределено Тогда
			   Стр.ИтогоЗПпоПодразделению		= тзСКВпоПодДоСП.ИтогоЗП;//!!!Добавить КС?
			КонецЕсли;   
		Иначе	
			тзСКВпоПодДоСП = тзСуммыСКВ_ПоПодразделениямДоСП.Найти(Стр.Подразделение,"Подразделение");
			Если тзСКВпоПодДоСП <> Неопределено Тогда
				//Как считать до чего считать превышение 201212
				Если РасчетДО1БП = Истина Тогда
					Стр.СКВ_ПоПодразделениямДоСП    = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП 
					- ?(ЭтоВариант20150801,тзСКВпоПодДоСП.ДельтаКСРуководитель,0); //20141110 //КС удалится ниже //Дельта КС пойдет как оплата КС
				Иначе	
					Стр.СКВ_ПоПодразделениямДоСП	= тзСКВпоПодДоСП.СКВ_ДляПланаПоСКВ_ПоАгенту - тзСКВпоПодДоСП.ПревышениеСуперплана;
					//Стр.СКВ_ПоПодразделениямДоСП  = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП +тзСКВпоПодДоСП.СКВот1БПдо2БП //20141110 //КС удалится ниже
				КонецЕсли;	
				
				Если ЭтоВариант20121001 Тогда
					Если ЭтоВариант20150901 и Стр.Подразделение.НеПроверятьЛичныеЗаявки = Ложь  Тогда
						//	Если ЭтоВариант20150901 и (уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",Стр.Руководитель, ДатаКонца,0)>0 или Стр.Подразделение.Наименование = "Ведущие менеджеры")  Тогда
						Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП; //КС не вычитается
						//Стр.СуммаВознаграждения_РОП - считается по агентам выше
					Иначе
						Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП-Стр.СКВ_КС;	
						Если ЭтоВариант20170901 и (уб_РасчетыСменеджерами.ПолучитьПараметрРасчетаЗП ("Расчет для РОП по менеджерам",Стр.Руководитель, ДатаКонца,0)>0 
							или Стр.Подразделение.Код = "000000024" 
							или Стр.Подразделение.Наименование = "Ведущие специалисты по работе с VIP клиентами") Тогда
							//Процент посчитан выше
						Иначе	
							Если Стр.СхемаВознагражденияРуководителяОП<>Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
								Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ПоПодразделениямДоСП) * Стр.СтавкаВознаграждения_РОП / 100;
								Если ЭтоВариант20171001 = ЛОЖЬ Тогда
									Стр.СуммаВознаграждения_РОП= Стр.СуммаВознаграждения_РОП+тзСКВпоПодДоСП.БОНУС_РОП_КС;
								Иначе
									//Добавлено в строке менеджера в сумме РОП
								КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;
					
				ИначеЕсли ЭтоВариант20120401 Тогда
					//Расчет уже скорректирован выше
				Иначе	
					Стр.СуммаВознаграждения_РОП		= Стр.СКВ_ПоПодразделениямДоСП * Стр.СтавкаВознаграждения_РОП / 100;
				Конецесли;	
				Стр.БОНУС_РОП_КС_ = тзСКВпоПодДоСП.БОНУС_РОП_КС;
				Стр.ИтогоЗПпоПодразделению		= тзСКВпоПодДоСП.ИтогоЗП;//!!!Добавить КС?
			КонецЕсли;
			Если  НЕ Стр.РуководительПолучаетВознаграждение Тогда
				Стр.СуммаВознаграждения_РОП = 0;
			Иначе
				Если РольДоступна("ПолныеПрава") и Стр.Руководитель = Менеджер  тогда
					Сообщить("-------------");
					Сообщить(Стр.Подразделение);
					Сообщить("Сборы в план "+Стр.СКВ_ПоПодразделениямДоСП);
					Сообщить("Ставка "+Стр.СтавкаВознаграждения_РОП);
					
					Если Не Стр.БОНУС_РОП_КС_ = 0 Тогда
						Сообщить("Сборы по КС "+Стр.СКВ_КС);
						Сообщить("Бонус КС "+Стр.БОНУС_РОП_КС_);
					КонецЕсли;	
					Сообщить("Итого "+Стр.СуммаВознаграждения_РОП);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	ТЗАгентов.Сортировать("Подразделение,Агент");
	ТЗАгентов.Колонки.БОНУС_РОП_КС.Имя = "БОНУС_РОП_КС_";
	тзСуммыПлановПоСКВ_ПоОрганизации = тзПодразделений.Скопировать(,"Организация,Подразделение,СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП,СуммаВознаграждения_ЗамРОП, СуммаКоличествоПлан");	
	тзСуммыПлановПоСКВ_ПоОрганизации.Свернуть("Организация", "СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП,СуммаВознаграждения_ЗамРОП, СуммаКоличествоПлан");
	
	Для Каждого Стр ИЗ тзПодразделений Цикл
		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоОрганизации.Найти(Стр.Организация,"Организация");
		Если СтрокаСуммыПлана <> Неопределено Тогда
			Стр.СуммаПланаОрг				= СтрокаСуммыПлана.СуммаПлана;
			Стр.СуммаКоличествоПланОрг		= СтрокаСуммыПлана.СуммаКоличествоПлан;
			Стр.ИтогоЗПОрг					= СтрокаСуммыПлана.ИтогоЗПпоПодразделению;
			Стр.СуммаВознаграждения_РОПОрг	= СтрокаСуммыПлана.СуммаВознаграждения_РОП;
			Стр.СуммаВознаграждения_ЗамРОПОрг	= СтрокаСуммыПлана.СуммаВознаграждения_ЗамРОП;
			
		КонецЕсли;
	КонецЦикла;	
	//
	
	Если ФильтрПоМенеджеру Тогда
		Для Каждого Стр из ТЗАгентов Цикл
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
			#КонецЕсли
			Если Стр.Агент = Менеджер и Стр.ЭтотАгентЕстьВТЗ1 = ЛОЖЬ Тогда
				ДобавитьПустышку(тз1,Стр);
				//НовОплата					= ТЗ1.Добавить();
				//НовОплата.Агент 			= Стр.Агент;		
				//НовОплата.Подразделение		= Стр.Подразделение;
				//НовОплата.Организация 		= Стр.Подразделение.Владелец;
				//НовОплата.Пустышка			= Истина;
				//тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Стр.Подразделение.Владелец, Стр.Подразделение, Стр.Агент);
				//Если тз.Количество() > 0 Тогда
				//	СхемаРасчета = тз[0].СхемаРасчета;
				//Иначе
				//	СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
				//	Сообщить("Ошибка при получении вида расчета с менеджером."+Стр.Агент,СтатусСообщения.ОченьВажное);
				//	//Возврат  ВознаграждениеМенеджера;
				//КонецЕсли;
				//НовОплата.СхемаРасчетаСМенеджером = СхемаРасчета;
				//НовОплата.УАгентаПланПоСКВ	= СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
				//Стр.УАгентаПланПоСКВ		= НовОплата.УАгентаПланПоСКВ;
				//тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
				//Если тз.Количество() > 0 Тогда
				//	Стр.План = тз[0].План;
				//	Если Стр.План = 0 Тогда
				//		Стр.Количество = тз[0].Количество;
				//	КонецЕсли;
				//Иначе
				//	Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
				//КонецЕсли;
				//НовОплата.СКВ = 0;
				//НовОплата.КоличествоФакт = 0;
				//НовОплата.ОплаченоФакт = 0;
				//НовОплата.НачисленнаяСуммаВзноса = 0;
				//НовОплата.СкидкаВыплаченаяКлиенту = 0;
				//НовОплата.КВСумма = 0;
				//НовОплата.КВСуммаДляАгента = 0;
				//НовОплата.ВознаграждениеМенеджера = 0;
				//НовОплата.ВычетСАгента = 0;
				//НовОплата.АВилиСкидкаСумма  = 0;
				//НовОплата.Ед = 0;
			КонецЕсли;
		КонецЦикла;	
		Для каждого СтрокаП  из тзПодразделений Цикл
			Если НЕ СтрокаП.Руководитель = Менеджер Тогда
				//		СтрокаП.Пустышка = Истина
				МассивСтрок = ТЗ1.НайтиСтроки(Новый Структура("Подразделение",СтрокаП.Подразделение));
				Всего = МассивСтрок.Количество();
				Для сч = 0 по Всего-1 Цикл
					Строка1 = МассивСтрок[сч];
					Если Строка1.Агент <> Менеджер Тогда
						//Строка1.НеВыводить = 1;
						Если Строка1.Куратор=Менеджер  Тогда
							
						Иначе
							Строка1.НеВыводить = 1;
							Строка1.СКВ = 0;
							Строка1.КоличествоФакт  = 0;
							Строка1.КоэффициентВида = 0;
							Строка1.НовыйКлиент = 0;							
							Строка1.НовыйКлиентСКВ = 0;							
							
							Строка1.ОплаченоФакт = 0;
							Строка1.НачисленнаяСуммаВзноса = 0;
							Строка1.СкидкаВыплаченаяКлиенту = 0;
							Строка1.КВСумма = 0;
							Строка1.КВСуммаДляАгента = 0;
							Строка1.ВознаграждениеМенеджера = 0;
							Строка1.ВознаграждениеДоп = 0;
							Строка1.ПартнерскоеВознаграждение = 0;
							Строка1.ВычетСАгента = 0;
							Строка1.АВилиСкидкаСумма  = 0;
							//Строка1.ПолнаяПремия = 0;
							Строка1.ВМРасчетное  = 0;
						КонецЕсли;
					Иначе
						
						
						
					КонецЕсли;	
				КонецЦикла;	
			Иначе
				
			КонецЕсли;	
			//		
		КонецЦикла;	
		//Для каждого СтрокаА  из тзАгентов Цикл
		//	Если НЕ СтрокаА.Агент = Менеджер Тогда
		//		СтрокаА.Пустышка = Истина
		//	КонецЕсли;	
		//		
		//КонецЦикла;	
		
		
		//Для каждого Строка1  из тз1 Цикл
		//	Если НЕ Строка1.Агент = Менеджер Тогда
		//		Строка1.НеВыводить = Истина;
		//	КонецЕсли;	
		//КонецЦикла;	
	КонецЕсли;	
	//Корпоративное
	Кол = ТзАгентов.Колонки;
	Кол.Добавить("ВМПоИнтервалам",		ОписаниеТипаЧисло14_2_но);
	
	тзПоИнтерваламСКВ = тз1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ));
	Если тзПоИнтерваламСКВ.Количество()> 0 Тогда
		
		Запрос = Новый Запрос("Выбрать * ПОМЕСТИТЬ Оплаты из &ТЗ как Оплаты
		|;
		|   Выбрать * 
		|   ПОМЕСТИТЬ ДействующиеДипазоны
		|   из РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
		|   ;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|     Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
		|	  Иначе
		|	 	ОПЛАТЫ.Интервалы
		|     Конец как НаборИнтерваловДляМенеджера,
		|	  ОПЛАТЫ.Агент КАК менеджер,
		|	  ОПЛАТЫ.Подразделение КАК Подразделение,
		|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
		|	ПОМЕСТИТЬ ДанныеПоМенеджерам
		|	ИЗ
		|	  Оплаты КАК ОПЛАТЫ
		|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
		|       ПО ИСТИНА
		|	ГДЕ
		|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
		|	СГРУППИРОВАТЬ ПО
		|	  ОПЛАТЫ.Агент,Оплаты.Подразделение,
		|	  Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
		|	  Иначе
		|		ОПЛАТЫ.Интервалы
		|     Конец
		//|	;
		//|	Выбрать * из ДанныеПоМенеджерам//Для Проверки
		|	;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|     Оплаты.Подразделение как Подразделение,
		|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляРОП
		|	  Иначе
		|	 	ОПЛАТЫ.ИнтервалыРОП
		|     Конец КАК НаборИнтерваловРОП,
		|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник КАК РОП,
		|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
		|	ПОМЕСТИТЬ ДанныеПоРОП
		|	ИЗ
		|	  Оплаты КАК ОПЛАТЫ
		|	  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_РуководителиПодразделенийСрезПоследних
		|	  ПО ОПЛАТЫ.Подразделение = уб_РуководителиПодразделенийСрезПоследних.Подразделение
		|	   И (уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство = ИСТИНА)
		|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
		|       ПО ИСТИНА
		|	ГДЕ
		|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
		|	СГРУППИРОВАТЬ ПО
		|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник, Оплаты.Подразделение,
		|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
		|		ДействующиеДипазоны.ИнтервалыДляРОП
		|	  Иначе
		|	 	ОПЛАТЫ.ИнтервалыРОП
		|     Конец
		//|	;
		//|	Выбрать * из ДанныеПоРОП//Для Проверки
		|	;
		|	ВЫБРАТЬ
		|	  уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
		|	  уб_ИнтервалыЗначенийИнтервалы.Начало,
		|	  уб_ИнтервалыЗначенийИнтервалы.Окончание,
		|	  уб_ИнтервалыЗначенийИнтервалы.Значение
		|	ПОМЕСТИТЬ Диапазоны
		|	ИЗ
		|	  Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
		|		
		//|  ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		////|	уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
		//|	уб_ИнтервалыЗначенийИнтервалы.Начало,
		//|	уб_ИнтервалыЗначенийИнтервалы.Окончание,
		//|	уб_ИнтервалыЗначенийИнтервалы.Значение
		//|ПОМЕСТИТЬ ДиапазоныРОП
		//|ИЗ
		//|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
		//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
		//|	ПО уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.ИнтервалыДляРОП = уб_ИнтервалыЗначенийИнтервалы.Ссылка
		|;
		
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|	ДанныеПоМенеджерам.Подразделение,
		|	ДанныеПоМенеджерам.менеджер,
		|	ДанныеПоМенеджерам.СКВ,
		|	Диапазоны.Начало,
		|	Диапазоны.Окончание,
		|	Диапазоны.Значение КАК ПроцентИнтервала,
		|	ВЫБОР
		|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
		|	    ТОГДА ВЫБОР
		|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
		|	            И НЕ Диапазоны.Окончание = 0
		|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
		|	    КОНЕЦ * Диапазоны.Значение / 100
		|     ИНАЧЕ 0
		|	КОНЕЦ КАК Доплата,
		|   ВЫБОР
		|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
		|	    ТОГДА ВЫБОР
		|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
		|	            И НЕ Диапазоны.Окончание = 0
		|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
		|	    КОНЕЦ 
		|     ИНАЧЕ 0
		|	КОНЕЦ КАК БАЗА,
		|	ИСТИНА КАК ЭтоВМ
		|	ПОМЕСТИТЬ ПромежуточныеРасчеты
		|	ИЗ
		|	ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
		|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
		|	ПО ДанныеПоМенеджерам.НаборИнтерваловДляМенеджера = Диапазоны.НаборИнтервалов
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	ДанныеПоРОП.Подразделение,
		|	ДанныеПоРОП.РОП,
		|	ДанныеПоРОП.СКВ,
		|	Диапазоны.Начало,
		|	Диапазоны.Окончание,
		|	Диапазоны.Значение,
		|	ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
		|	ТОГДА ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
		|	И НЕ Диапазоны.Окончание = 0
		|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
		|	КОНЕЦ * Диапазоны.Значение / 100
		|ИНАЧЕ 0
		|	КОНЕЦ,
		|ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
		|	ТОГДА ВЫБОР
		|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
		|	И НЕ Диапазоны.Окончание = 0
		|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
		|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
		|	КОНЕЦ 
		|ИНАЧЕ 0
		|	КОНЕЦ,
		|	ЛОЖЬ
		|	ИЗ
		|	ДанныеПоРОП КАК ДанныеПоРОП
		|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
		|	ПО ДанныеПоРОП.НаборИнтерваловРОП = Диапазоны.НаборИнтервалов
		|	;
		|   Выбрать * из ПромежуточныеРасчеты 
		|	;
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|	   ПромежуточныеРасчеты.менеджер,
		|	   ПромежуточныеРасчеты.Подразделение,
		|	   ВЫБОР
		|	   КОГДА ДанныеПоМенеджерам.СКВ = 0
		|		  ТОГДА 0
		|	   КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
		|				И ПромежуточныеРасчеты.ЭтоВМ
		|		  ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
		|	   ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
		|	   КОНЕЦ КАК ВМ,
		|	   ВЫБОР
		|	     КОГДА ПромежуточныеРасчеты.ЭтоВМ
		|	      ТОГДА ДанныеПоМенеджерам.СКВ
		|      ИНАЧЕ ДанныеПоРОП.СКВ
		|	   КОНЕЦ КАК СКВ,
		|	   ВЫБОР
		|	     КОГДА ДанныеПоМенеджерам.СКВ = 0
		|	       ТОГДА 0
		|        ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
		|	        КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
		|	           И ПромежуточныеРасчеты.ЭтоВМ
		|	         ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
		|           ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
		|	        КОНЕЦ * 100 / ДанныеПоМенеджерам.СКВ КАК ЧИСЛО(15, 1))
		|	   КОНЕЦ КАК ВМПроцент,
		|	   ВЫРАЗИТЬ(ВЫБОР
		|	               КОГДА ДанныеПоМенеджерам.СКВ = 0
		|	                 ТОГДА 0
		|                  ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ
		|	            КОНЕЦ КАК ЧИСЛО(15, 1)) КАК ВМПроцентБезКоррекции,
		|	    ВЫБОР
		|	      КОГДА ПромежуточныеРасчеты.ЭтоВМ = ИСТИНА
		|	        ТОГДА ""ВМ""
		|         ИНАЧЕ ""РОП""
		|	    КОНЕЦ КАК ВидВознаграждения
		|	ИЗ
		|	ПромежуточныеРасчеты КАК ПромежуточныеРасчеты
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
		|	ПО (ДанныеПоМенеджерам.менеджер = ПромежуточныеРасчеты.менеджер)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоРОП КАК ДанныеПоРОП
		|	ПО (ДанныеПоРОП.РОП = ПромежуточныеРасчеты.менеджер)
		|	
		|	СГРУППИРОВАТЬ ПО
		|	ПромежуточныеРасчеты.менеджер,
		|	ПромежуточныеРасчеты.Подразделение,
		|	ДанныеПоМенеджерам.СКВ,
		|	ДанныеПоРОП.СКВ,
		|	ПромежуточныеРасчеты.ЭтоВМ");
		Если тзПоИнтерваламСКВ.Колонки.Найти("РасчетыПоДокументу")<>Неопределено Тогда
			тзПоИнтерваламСКВ.Колонки.Удалить("РасчетыПоДокументу");
		КонецЕсли;
		
		Если тзПоИнтерваламСКВ.Колонки.Найти("УслугиПоДокументу")<>Неопределено Тогда
			тзПоИнтерваламСКВ.Колонки.Удалить("УслугиПоДокументу");	
		КонецЕсли;
		
		
		Запрос.УстановитьПараметр("тз",тзПоИнтерваламСКВ);
		Запрос.УстановитьПараметр("ЗарплатныйПериод",ЗарплатныйПериод);
		Запрос.УстановитьПараметр("МинПроцент",10);
		
		
		МассивПакетов = Запрос.ВыполнитьПАкет();
		ВсегоЗапросов = МассивПакетов.Количество();
		Выборка = МассивПакетов[ВсегоЗапросов-1].Выбрать();
		//
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Менеджер) Тогда
				Продолжить;
			КонецЕсли;	
			массивСтрок = ТзАгентов.НайтиСтроки(Новый Структура("Агент",Выборка.Менеджер));
			Если массивСтрок.Количество()=0 Тогда
				Если Уб_Кэшируемые.ДоступностьРоли("ПолныеПрава") Тогда
					Сообщить("Не найден менеджер в таблице агентов "+Выборка.Менеджер);
				КонецЕсли;	
			Иначе	
				СтрокаАгента = массивСтрок[0];
				Если Выборка.ВидВознаграждения = "ВМ" Тогда
					СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
					ДобавитьПустышку(тз1,СтрокаАгента,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ);
					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				ИначеЕсли Выборка.ВидВознаграждения = "РОП" Тогда
					//СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
					СтрокаАгента.ВознаграждениеРуководителя = СтрокаАгента.ВознаграждениеРуководителя+Выборка.ВМ;
					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				КонецЕсли;	
			КонецЕсли;		
			Если Выборка.ВидВознаграждения = "РОП" Тогда
				//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
				СтрокаПодразделения				= тзПодразделений.Найти(Выборка.Подразделение,"Подразделение");
				Если СтрокаПодразделения <> Неопределено Тогда
					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Выборка.ВМ;
					СтрокаПодразделения.СуммаВознаграждения_РОПОрг = СтрокаПодразделения.СуммаВознаграждения_РОПОрг+Выборка.ВМ;
				КонецЕсли;	
			КонецЕсли;			
		КонецЦикла;	
		ТЗИнтервалов = МассивПакетов[ВсегоЗапросов-2].Выгрузить();
	Иначе
		ТЗИнтервалов = Новый  ТаблицаЗначений;
	КонецЕсли;	
	//---Корпоративное
	
	//+++ Прочие виды по ТЧ Начислений в оплате
	Запрос = Новый Запрос;
	//---
	
	
	//Условно
	//Сверка вознаграждения в оплате
	Если ПерезаполнитьВМ И ВРеальномВремени Тогда
		#Если Клиент Тогда
			Состояние(стрСостояние+". Распределение вознаграждения по оплатам");
		#КонецЕсли
		
		
		СчетчикОплат = 0;
		
		ВсегоМассив = тз1.Количество();
		Этап = Этап+1;
		Для каждого Строка1  из тз1 Цикл
			
			#Если Клиент Тогда
				Если СчетчикОплат%5 = 0 Тогда
					Состояние(стрСостояние+". Этап: " + Этап + ". Распределение вознаграждения по оплатам (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + "%)");
				КонецЕсли;
				СчетчикОплат = СчетчикОплат+1;
			#КонецЕсли
			Если НЕ Строка1.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
				Продолжить;
			КонецЕсли;	
			_этоКС = (Строка1.ЭтоКрупнаяСделка = Истина) ;
			__СКВ = Строка1.СКВ;
			_вм = тзАгентов.НайтиСтроки(Новый Структура("Агент",Строка1.Агент))[0];
			_ВознаграждениеМенеджера = ?(Строка1.ВМРасчетное=Неопределено,0,Строка1.ВМРасчетное);
			
			__ВознаграждениеМенеджера = Окр(?(_вм.ИтогоЗП=0 ИЛИ _этоКС ИЛИ (_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС)=0,0,_вм.ИтогоЗП*__СКВ/(_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС))+?(Строка1.ВознаграждениеМенеджера<0,Строка1.ВознаграждениеМенеджера,0)+
			?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.БОНУС_КС_*__СКВ/_вм.СКВ_КС),2);
			//__ВознаграждениеМенеджера = Окр(__ВознаграждениеМенеджера, 2);
			Если _ВознаграждениеМенеджера <> __ВознаграждениеМенеджера Тогда
				__ДоходБрокера = __СКВ - __ВознаграждениеМенеджера; //Удержание за косяки
				ОП = Строка1.Ссылка.ПолучитьОбъект();
				ОП.ДополнительныеСвойства.Вставить("ОтключенКонтрольПериодов",Истина);
				УстановитьЗначение(ОП.ДБ, 			__ДоходБрокера);
				УстановитьЗначение(ОП.ВМРасчетное, 	__ВознаграждениеМенеджера);
				ОП.Записать();
				#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	
КонецПроцедуры


Процедура ВывестиОтчет2020(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаОтчета, тзАгентовДляРаскраски = Неопределено,ТЗИнтервалов) Экспорт
	
	_СкрыватьКолонкиДСП = СкрыватьКолонкиДСП;
	//Если ЗначениеЗаполнено(Менеджер) Тогда
	//	СкрыватьКолонкиДСП = Истина;
	//КонецЕсли;	
	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	//пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
	//пВидЕКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО;
	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
	ОтображатьКолонкиДляСхемыПланПоСКВ = Истина;//ВСЕГДА ВЫВОДИМ
	ЗапросВыводРасчетаВМ = Новый Запрос;
	//Создаем временные таблицы 
	ЗапросВыводРасчетаВМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТЗ1.Колонки.ЕстьПланПоСКВ.Имя = "АгентРаботаетПоПлануПоСКВ";
	ЭтоПолныеПрава = ПолныеПрава();
	
	СохраняемДанные = ЭтоПолныеПрава и РежимОтчета = 0;
	Этап = Этап + 1;
	#Если Клиент Тогда
		Состояние(" Этап: " + Этап + " из " + КоличествоЭтапов + " - Подготовка к расчету итогов");
	#КонецЕсли
	//Необходимо переименовать колонки, которые есть в обеих таблицах, 
	//иначе будут задвоения при объединении таблиц
	ТзАгентов.Колонки.ВознаграждениеМенеджера.Имя = "ВознаграждениеМенеджера_ТАгентов";
	ТзАгентов.Колонки.ВознаграждениеДоп.Имя = "ВознаграждениеДоп_ТАгентов";
	ТзАгентов.Колонки.ВычетСАгента.Имя = "ВычетСАгента_ТАгентов";
	ТЗАгентов.Колонки.Агент.Имя			= "Агент_ТАгентов";
	ТЗАгентов.Колонки.Подразделение.Имя = "Подразделение_ТАгентов";
	ТЗАгентов.Колонки.ЕстьПланПоСКВ.Имя = "РаботаетПоПлануПоСКВ_ТАгентов";
	ТЗАгентов.Колонки.Удалить("СКВ_КС");
	//ТЗАгентов.Колонки.Удалить("СКВ_Прол");
	ТЗАгентов.Колонки.СКВ_Прол.Имя ="СКВ_Прол_Агенты";
	ТЗАгентов.Колонки.СКВ_НБ.Имя ="СКВ_НБ_Агенты";
	//Для каждого Колонка из ТЗАгентов.Колонки цикл
	//	Если Найти(Колонка.Имя,"_ТАгентов")= 0 Тогда
	//		Сообщить(Колонка.Имя);
	//	КонецЕсли;
	//КонецЦикла;	
	//тзПодразделений.Колонки.Удалить("СКВ_КС");
	тзПодразделений.Колонки.СКВ_КС.Имя ="СКВ_КС_Подразделения";
	тзПодразделений.Колонки.СКВ_Прол.Имя ="СКВ_Прол_Подразделения";
	тзПодразделений.Колонки.СКВ_НБ.Имя ="СКВ_НБ_Подразделения";

	тзПодразделений.Колонки.Подразделение.Имя = "Подразделение_ТПодразделений";
	тзПодразделений.Колонки.СуммаДБ.Имя = "СуммаДБПодразделение";
	
	Для каждого СтрокаТЗ1 из ТЗ1 Цикл
		Если ТипЗнч(СтрокаТЗ1.ВознаграждениеДоп)<>Тип("Число") Тогда
			СтрокаТЗ1.ВознаграждениеДоп = 0;
		КонецЕсли;	
	КонецЦикла;	
	Если ТолькоПоАгенту и ЗначениеЗаполнено(Менеджер) Тогда
		ТЗТолькоАгент   = ТЗ1.Скопировать(Новый Структура("Агент",Менеджер),"Агент,Куратор,СКВ,СКВ_Прол,СКВ_НБ,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВПроцентДляАгента,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация");
		ТЗТолькоКуратор = ТЗ1.Скопировать(Новый Структура("Куратор",Менеджер),"Агент,Куратор,СКВ,СКВ_Прол,СКВ_НБ,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВПроцентДляАгента,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация");
		Для Каждого СтрокаДляКуратора Из ТЗТолькоКуратор Цикл
			ТЗТолькоАгентДоп = ТЗТолькоАгент.Добавить();
			ЗаполнитьЗначенияСвойств(ТЗТолькоАгент,СтрокаДляКуратора);
		КонецЦикла;
		ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗ",ТЗТолькоАгент);
	Иначе	
		ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗ", ТЗ1.Скопировать(,"Агент,Куратор,СКВ,СКВ_Прол,СКВ_НБ,ВидСП,Дата,Пустышка,СхемаРасчетаСМенеджером,Подразделение,Страхователь,ПолисАннулирован,ВознаграждениеМенеджера,ВознаграждениеДоп,Ссылка,НеВыводить,СтраховойПродукт,Номер,СК,НомерЗаявки,СКВ_КС,НомерПолиса,НомерКвитанции,ПолнаяПремия,НачисленнаяСуммаВзноса,НомерВзноса,ОплаченоФакт,АВилиСкидкаПроцент,АВилиСкидкаСумма,КоличествоФакт,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ,НаправлениеПлатежа,КВПроцент,КВПроцентДляАгента,КВСумма,КВСуммаДляАгента,КВПроцентДляОтчета,БонусМенеджеру,ВидРасчетаСАгентом,Бонус_КС,ЕД,ВычетСАгента,БОНУС_РОП_КС,КВПодВопросом,ЭтоПролонгация"));
	КонецЕсли;	
	Для каждого СтрокаА из ТЗАгентов Цикл
		Если ТипЗнч(СтрокаА.СуммаДб)<>Тип("Число") Тогда
			СтрокаА.СуммаДб = 0;
		КонецЕсли;	
	КонецЦикла;	
	

	ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗАгентов", ТЗАгентов);
	ЗапросВыводРасчетаВМ.УстановитьПараметр("тзПодразделений", тзПодразделений);
	
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ";
	//ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП";
//	ЗапросВыводРасчетаВМ.Выполнить();
	
	ЗапросВыводРасчетаВМ.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП
	|;
	|ВЫБРАТЬ
	//|	IsNull(ТАгентов.План,0) как План,
	//|	IsNull(ТАгентов.Количество,0) как Количество,
	//|	IsNull(ТАгентов.СуперПлан,0) как СуперПлан,
	//|   IsNull(ТАгентов.ПерваяБонусПланка,0) как ПерваяБонусПланка,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаДоПлана,0) как ПроцентнаяСтавкаДоПлана,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеПлана,0) как ПроцентнаяСтавкаПослеПлана,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеПервойБонусПланки,0) как ПроцентнаяСтавкаПослеПервойБонусПланки,
	//|	IsNull(ТАгентов.ПроцентнаяСтавкаПослеСуперПлана,0) как ПроцентнаяСтавкаПослеСуперПлана,
	//|	IsNull(ТАгентов.ВыполненПланПоСКВ,0) как ВыполненПланПоСКВ,
	//|	IsNull(ТАгентов.СКВ_ДляПланаПоСКВ_ПоАгенту,0) как СКВ_ДляПланаПоСКВ_ПоАгенту,
	//|	IsNull(ТАгентов.КоличествоФакт_ПоАгенту,0) как КоличествоФакт_ПоАгенту,
	//|	IsNull(ТАгентов.ПроцентВыполненияПлана,0) как ПроцентВыполненияПлана,
	//|	IsNull(ТАгентов.СтавкаВознаграждения,0) как СтавкаВознаграждения,
	//|	IsNull(ТАгентов.СКВдоПлана,0) как СКВдоПлана, //+Новые промежуточные расчеты
	//|	IsNull(ТАгентов.СКВотПланадо1БП,0) как СКВотПланадо1БП,
	//|	IsNull(ТАгентов.СКВот1БПдо2БП,0) как СКВот1БПдо2БП, 
	//|	IsNull(ТАгентов.СКВСвыше2БП,0) как СКВСвыше2БП,  
	//|	IsNull(ТАгентов.ЗПдоПлана,0) как ЗПдоПлана,
	//|	IsNull(ТАгентов.ЗПотПланадо1БП,0) как ЗПотПланадо1БП,
	//|	IsNull(ТАгентов.ЗПот1БПдо2БП,0) как ЗПот1БПдо2БП, 
	//|	IsNull(ТАгентов.ЗПСвыше2БП,0) как ЗПСвыше2БП, //-Новые промежуточные расчеты
	//|	IsNull(ТАгентов.ЗПотСКВдоСуперПлана,0) как ЗПотСКВдоСуперПлана,
	//|	IsNull(ТАгентов.ЗПЗаПревышение1БП,0) как ЗПЗаПревышение1БП,
	//|	IsNull(ТАгентов.ПревышениеСуперплана,0) как ПревышениеСуперплана,
	//|	IsNull(ТАгентов.ЗПотЗаПревышениеСуперПлана,0) как ЗПотЗаПревышениеСуперПлана,
	//|	IsNull(ТАгентов.ИтогоЗП,0) как ИтогоЗП,
	//|	IsNull(ТАгентов.ВознаграждениеРуководителя,0) как ВознаграждениеРуководителя,
	//|	IsNull(ТАгентов.ВМПоИнтервалам,0) как ВМПоИнтервалам,
	|   Выбор КОГДА ТСписокОплатЗаПериод.Пустышка=Истина //и ТСписокОплатЗаПериод.СхемаРасчетаСМенеджером=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ) 
	|         Тогда IsNull(ТАгентов.ИтогоЗП,0) иначе 0 Конец Как ИтогоЗП,
	|   Выбор КОГДА ТСписокОплатЗаПериод.Пустышка=Истина //и ТСписокОплатЗаПериод.СхемаРасчетаСМенеджером=Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ) 
	|         Тогда IsNull(ТАгентов.ВМПоИнтервалам,0) иначе 0 Конец Как ВМПоИнтервалам,
	|	ТАгентов.*,
	//|	IsNull(ТПодразделений.ИтогоЗПОрг,0) как ИтогоЗПОрг,
	//|	IsNull(ТПодразделений.СуммаПланаОрг,0) как СуммаПланаОрг,
	//|	IsNull(ТПодразделений.СуммаПлана,0) как СуммаПлана,
	//|	IsNull(ТПодразделений.СуммаКоличествоПланОрг,0) как СуммаКоличествоПланОрг,
	//|	IsNull(ТПодразделений.СуммаКоличествоПлан,0) как СуммаКоличествоПлан,
	|	ТПодразделений.*,
	|	ТСписокОплатЗаПериод.*
	|   
	|ПОМЕСТИТЬ ТСписокОплат
	|ИЗ
	|	ТСписокОплатЗаПериод КАК ТСписокОплатЗаПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТПодразделений КАК ТПодразделений
	|		ПО ТСписокОплатЗаПериод.Подразделение = ТПодразделений.Подразделение_ТПодразделений
	//	   И ТСписокОплатЗаПериод.Пустышка = ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАгентов КАК ТАгентов
	|		ПО ТСписокОплатЗаПериод.Агент = ТАгентов.Агент_ТАгентов
	|          И ТСписокОплатЗаПериод.Пустышка = ИСТИНА
	|;
	|ВЫБРАТЬ * ИЗ ТСписокОплат
	//|СГРУППИРОВАТЬ ПО ТСписокОплат.СхемаРасчетаСМенеджером
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение.Родитель.Наименование,
	|	Подразделение.Наименование,
	|	Агент.Наименование,
	|	ВидСП, Дата
	|ИТОГИ
	//ИЗ ОПЛАТ
	|	Минимум(Пустышка),
	|	Сумма(НеВыводить),
	|	СУММА(ВознаграждениеМенеджера),
	|	СУММА(ВознаграждениеДоп),	
	|	СУММА(ПартнерскоеВознаграждение),
	|	СУММА(СКВ),
	//|	СУММА(СКВ_Прол),
	//|	СУММА(СКВ_НБ),
	|	СУММА(СКВ_БП),
	|	СУММА(СКВ_БП_Прол),
	|	СУММА(СКВ_БП_НБ),
	|	СРЕДНЕЕ(СКВ_Прол_Агенты),
	|	СРЕДНЕЕ(СКВ_НБ_Агенты),
	|	СРЕДНЕЕ(СКВ_КС_Подразделения),
	|	СРЕДНЕЕ(СКВ_Прол_Подразделения),
	|	СРЕДНЕЕ(СКВ_НБ_Подразделения),
	|	СУММА(СКВ_КС),
	|	СУММА(БОНУС_КС),
	|	СУММА(НачисленнаяСуммаВзноса),
	|	СУММА(ОплаченоФакт),
	|	СУММА(КВСуммаДляАгента),
	|	СУММА(АВилиСкидкаСумма),
	|	СУММА(ЕД),
	|	СУММА(ВычетСАгента),
	//| ИЗ ТЗ АГЕНТОВ
	|	Минимум(План),
	|	Минимум(ШтрафнойПлан),
	|	Сумма(Количество),
	|	Минимум(СуперПлан),
	|	Минимум(ПерваяБонусПланка),
    |	Минимум(ПроцентнаяСтавкаДоПлана),
	|	Минимум(ПроцентнаяСтавкаПослеПлана),
	|	Минимум(ПроцентнаяСтавкаПослеПервойБонусПланки),
	|	Минимум(ПроцентнаяСтавкаПослеСуперПлана),
	|	Минимум(ВыполненПланПоСКВ),
	|	Сумма(СКВ_ДляПланаПоСКВ_ПоАгенту),
	|	Сумма(КоличествоФакт_ПоАгенту),
	|	Сумма(КоэффициентВида_ПоАгенту),	
	|	Сумма(НовыйКлиент_ПоАгенту),		
	|	Сумма(НовыйКлиентСКВ_ПоАгенту),			
	|	Сумма(КоэффициентВидаГод_ПоАгенту),		
    |	Минимум(ПроцентВыполненияПлана),
	|	Минимум(СтавкаВознаграждения),
	|	Сумма(СКВдоПлана), //+Новые промежуточные расчеты
	|	Сумма(СКВотПланадо1БП),
	|	Сумма(СКВот1БПдо2БП), 
	|	Сумма(СКВСвыше2БП),  
    |	Сумма(ЗПдоПлана),
	|	Сумма(ЗПотПланадо1БП),
	|	Сумма(ЗПот1БПдо2БП), 
	|	Сумма(ЗПСвыше2БП), //-Новые промежуточные расчеты
	|	Сумма(ДельтаКСРуководитель),
	|	Сумма(ЗПотСКВдоСуперПлана),
	|	Сумма(ЗП_Пролонгация),
	|	Сумма(ЗП_НовыйБизнес),
	|	Сумма(ЗПЗаПревышение1БП),
	|	Сумма(ПревышениеСуперплана),
    |	Сумма(ЗПотЗаПревышениеСуперПлана),
	|	Сумма(ИтогоЗП),
	|	Сумма(ВознаграждениеРуководителя),
	|	Максимум(ПроцентРОП),  Максимум(СхемаВознагражденияРуководителяОП),Среднее(СуммаДБ),
	|	Сумма(ВМПоИнтервалам),
	//|	СРЕДНЕЕ(Сумма),
	//| ПОДРАЗДЕЛЕНИЯ 
	|	СРЕДНЕЕ(ИтогоЗПОрг),
	|	СРЕДНЕЕ(ИтогоЗПпоПодразделению),          
	|	СРЕДНЕЕ(СКВ_ПоПодразделениямДоСП),
	|	СРЕДНЕЕ(ПоказательМинимальногоПорога_РОП),
	|	СРЕДНЕЕ(ПоказательПлана_РОП),
	|	Минимум(ПроцентВыполненияПлана_РОП),
	|	Минимум(ПроцентнаяСтавкаДоМинимальногоПорога_РОП),
	|	Минимум(ПроцентнаяСтавкаДоПлана_РОП),
	|	Минимум(ПроцентнаяСтавкаПослеПлана_РОП),
	|	СРЕДНЕЕ(СтавкаВознаграждения_РОП),
	|	СРЕДНЕЕ(СтавкаВознаграждения_РОП_Прол),
	|	СРЕДНЕЕ(СтавкаВознаграждения_РОП_НБ),
	|	Сумма(СуммаВМ),
	|	СРЕДНЕЕ(СуммаВознаграждения_РОП),
	|	СРЕДНЕЕ(СуммаВознаграждения_РОПОрг),
	|	СРЕДНЕЕ(СуммаВознаграждения_ЗамРОП),
	|	СРЕДНЕЕ(СуммаВознаграждения_ЗамРОПОрг),
	|	СРЕДНЕЕ(СКВ_ДляПланаПоСКВ_ПоПодразделению),
	|	СРЕДНЕЕ(КоличествоФакт_ПоПодразделению),
	|	СРЕДНЕЕ(КоэффициентВида_ПоПодразделению),
	|	СРЕДНЕЕ(НовыйКлиент_ПоПодразделению),	
	|	СРЕДНЕЕ(НовыйКлиентСКВ_ПоПодразделению),		
	|	СРЕДНЕЕ(СуммаПлана),
	|	СРЕДНЕЕ(СуммаПланаОрг),
	|	СРЕДНЕЕ(СуммаКоличествоПлан),
	|	СРЕДНЕЕ(СуммаКоличествоПланОрг),
	|	СРЕДНЕЕ(КоличествоФакт),
	|	СРЕДНЕЕ(КоэффициентВида),	
	|	СРЕДНЕЕ(НовыйКлиент),		
	|	СРЕДНЕЕ(НовыйКлиентСКВ),			
	|	Сумма(БОНУС_РОП_КС)
	|ПО
	|	Организация,
	|	Подразделение,
	|	Агент,
	|	СхемаРасчетаСМенеджером,
	|	ВидСП";
	
	Если Не ПустаяСтрока(ВидСортировки) Тогда
		ЗапросВыводРасчетаВМ.Текст = СтрЗаменить(ЗапросВыводРасчетаВМ.Текст,"ВидСП, Дата","ВидСП, "+ВидСортировки);
	КонецЕсли;	
	
	Этап=Этап+1;
	#Если Клиент Тогда
		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Расчет итогов");
	#КонецЕсли
	ТЗ2 = ЗапросВыводРасчетаВМ.Выполнить();	
	//Уничтожение временной таблицы
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплатЗаПериод ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТПодразделений ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТАгентов ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплат ";
	ЗапросВыводРасчетаВМ.Выполнить();	
	цЖелтенький = Новый Цвет(255, 255, 153);
	Макет 	= ПолучитьМакет("Новый");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Если НЕ ВыводитьПримечанияКВМВячейки Тогда
		//	Макет.УдалитьОбласть(Макет.Область("СтолбецПримКВМ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	ВыводитьКС = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
	Если НЕ ВыводитьКС Тогда
		//	Макет.УдалитьОбласть(Макет.Область("КС"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	РежимДвухБП = ДатаНачала>=Дата(2012,12,1);
	Если РежимДвухБП Тогда
		//	Макет.УдалитьОбласть(Макет.Область("РасчетЗП"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	Иначе
		//	Макет.УдалитьОбласть(Макет.Область("РасчетЗП201212"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	ДБЕсть = Истина;
	Если ПараметрыСеанса.уб_ЭтоМенеджер или ЗначениеЗаполнено(Менеджер) Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДБ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		ДБЕсть = Ложь;
	КонецЕсли;		
	Если НЕ ОтображатьКолонкиДляСхемыПланПоСКВ Тогда
		//	Макет.УдалитьОбласть(Макет.Область("СхемаПлан1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("СхемаПлан"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	Если ОтображатьТолькоФамилии Тогда
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_3"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);		
		Если НЕ СкрыватьКолонкиДСП Тогда
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_4"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_5"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_6"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;		
		//	Макет.УдалитьОбласть(Макет.Область("БезИтогов_7"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		//	Макет.Область("ЗаголовокВРежимеТолькоФамилии").Объединить();
		//	Макет.Область("ЗаголовокВРежимеТолькоФамилии").Текст = "Организация/Подразделение/Сотрудник";
	КонецЕсли; 
	Если СкрыватьКолонкиДСП Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДСП1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	Если СкрыватьКолонкиДСП ИЛИ ОтображатьТолькоФамилии Тогда
		//	Макет.УдалитьОбласть(Макет.Область("ДСП2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Менеджер) Тогда
		Обл_Шапка = Макет.ПолучитьОбласть("Шапка|Полная");
	Иначе
		Обл_Шапка = Макет.ПолучитьОбласть("Шапка|Основная");

	КонецЕсли;	
	Обл_Шапка_Вознаграждение = Макет.ПолучитьОбласть("Шапка|Вознаграждение");	
	Обл_Шапка_Взносы = Макет.ПолучитьОбласть("Шапка|Взносы");	
	Обл_Шапка_Доход = Макет.ПолучитьОбласть("Шапка|Доход");	
	Обл_Заголовок = Макет.ПолучитьОбласть("Заголовок|Основная");
	Обл_Заголовок_Вознаграждение = Макет.ПолучитьОбласть("Заголовок|Вознаграждение");	
	Обл_Заголовок_Взносы = Макет.ПолучитьОбласть("Заголовок|Взносы");	
	Обл_Заголовок_Доход = Макет.ПолучитьОбласть("Заголовок|Доход");	
	Обл_Заголовок.Параметры.ЗарплатныйПериод 	= Формат(ЗарплатныйПериод,"ДФ='ММMM yyyy'");
	Если РежимОтчета=1 И ДатаОтчета <>ДатаСреза1 Тогда
	Иначе
		ДокументРезультат.Вывести(Обл_Заголовок);
	КонецЕсли;
	Если РежимОтчета = 0  Тогда
		//Не понятно как удаляются области, как будто со смешением В обратном порядке???
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
		//	Обл_Шапка.УдалитьОбласть(Макет.Область("ШапкаВидСП"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
		Иначе
			Обл_Шапка.Параметры.Подразделение = Подразделение;
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(ВидСП) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),Смещать);
		Иначе
			Обл_Шапка.Параметры.ВидСП	= ВидСП;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Менеджер) Тогда
			//	Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),Смещать);
		Иначе
			Обл_Шапка.Параметры.Менеджер = Менеджер;
		КонецЕсли;
	Иначе
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),		Смещать);
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),		Смещать);
		//Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
	//	ДокументРезультат.ФиксацияСверху	= Обл_Шапка.ВысотаТаблицы + 1;
	//КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаОтчета) Тогда
		ДатаВотчет  = "Состояние расчета ЗП на "+Формат(ДатаОтчета,"ДФ='dd.MM.yyyy HH:mm'");
	Иначе	
		ДатаВотчет = "Состояние расчета ЗП на текущую дату ("+Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm'")+")";
	КонецЕсли;	
	Обл_Шапка.Параметры.ДатаВотчет = ДатаВотчет;
	
	//ДокументРезультат.ФиксацияСверху = 8;
	ДокументРезультат.Вывести(Обл_Шапка);
	//ДокументРезультат.Вывести(Обл_Шапка);

	Если НЕ ЗначениеЗаполнено(Менеджер) Тогда
				Если ОтображатьТолькоФамилии = Ложь Тогда
			ДокументРезультат.Присоединить(Обл_Шапка_Вознаграждение);
		КонецЕсли;	
		ДокументРезультат.Присоединить(Обл_Шапка_Взносы);
		Если ДБЕсть Тогда
			ДокументРезультат.Присоединить(Обл_Шапка_Доход);
		КонецЕсли;	
		
		ДокументРезультат.НачатьАвтогруппировкуСтрок();
		Уровень = 1;
	Иначе
		Уровень = 0;
	КонецЕсли;
	//
	
	ВыборкаОрг 	= ТЗ2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	СчНом = 0;
	ЧФ = "ЧЦ=14; ЧДЦ=2";
	ЧФ0 = "ЧЦ=14; ЧДЦ=2; ЧН=0";
	ЧФ000 = "ЧЦ=14; ЧДЦ=2; ЧН=";
	КФ = "ЧЦ=12; ЧДЦ=0";
	//////////////////// ОРГ \\\\\\\\\\\\\\\\\\\\\
	// заполнение строки макета ОРГ
	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
	ФильтрПоСпискуМенеджеров = СписокМенеджеров.Количество() > 0;
	ЭтоРуководитель = Ложь;
	Если ФильтрПоМенеджеру Тогда
		Уволен = Ложь;
		ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер, КонецМесяца(ЗарплатныйПериод), Истина,Уволен);
		Если ПодразделениеАгента = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
			ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер , НачалоМесяца(ЗарплатныйПериод), Ложь,Уволен);
		КонецЕсли;
		МЗ = тзПодразделений.Найти(ПодразделениеАгента,"Подразделение_ТПодразделений");
		Если МЗ = Неопределено Тогда
			МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), ПодразделениеАгента);
			Руководитель = МЗ.Сотрудник;
		Иначе
			Руководитель = МЗ.Руководитель;
		КонецЕсли;
		ЭтоРуководитель = Руководитель = Менеджер;
	КонецЕсли;
	Этап=Этап+1;
	#Если Клиент Тогда
		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Вывод отчета");
	#КонецЕсли
	
	Пока ВыборкаОрг.Следующий() Цикл
		Если ВыборкаОрг.Пустышка И НЕ ФильтрПоМенеджеру Тогда
			Продолжить;
		//ИначеЕсли ФильтрПоМенеджеру и   Тогда	
			
		КонецЕсли;
		ОблОрг = Макет.ПолучитьОбласть("Орг|Основная");
		ОблОрг_Вознаграждение = Макет.ПолучитьОбласть("Орг|Вознаграждение");	
		ОблОрг_Взносы = Макет.ПолучитьОбласть("Орг|Взносы");	
		ОблОрг_Доход = Макет.ПолучитьОбласть("Орг|Доход");	
		ОблОрг.Параметры.Организация	= "По компании";// + ВыборкаОрг.Организация;
		ЗПОбщееО = УстановитьПараметрыОбласти_Вознаграждение(ОблОрг_Вознаграждение.Параметры,ВыборкаОрг,"ИтогоЗПОрг",Истина);
		ОблОрг.Параметры.ОбщееЗП = ЗПОбщееО;
		ОблОрг.Параметры.СобранаяКВ	   = Формат(ВыборкаОрг.СКВ,ЧФ000);
		ОблОрг.Параметры.КоличествоФакт  = Формат(ВыборкаОрг.КоличествоФакт_ПоАгенту,КФ);
		ОблОрг.Параметры.КоэффициентВида  = Формат(ВыборкаОрг.КоэффициентВида_ПоАгенту,КФ);
		ОблОрг.Параметры.КоэффициентВидаГод  = Формат(ВыборкаОрг.КоэффициентВидаГод_ПоАгенту,КФ);
		ОблОрг.Параметры.НовыйКлиент  = Формат(ВыборкаОрг.НовыйКлиент_ПоАгенту,КФ);
		ОблОрг.Параметры.НовыйКлиентСКВ = "";//Формат(ВыборкаОрг.НовыйКлиентСКВ_ПоАгенту,КФ);
		
		
		
		УстановитьПараметрыОбласти_Взносы(ОблОрг_Взносы.Параметры,ВыборкаОрг,"ИтогоЗПОрг",Истина);
		Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
			ОблОрг.Параметры.План					= Формат(ВыборкаОрг.СуммаПланаОрг,ЧФ000);
			Если ВыборкаОрг.СуммаКоличествоПланОрг  = 0 Тогда
				ОблОрг.Параметры.КоличествоПлан		= "";
			Иначе
				ОблОрг.Параметры.КоличествоПлан		= Формат(ВыборкаОрг.СуммаКоличествоПланОрг,ЧФ000);
			КонецЕсли;
			ОблОрг.Параметры.ПроцентПлана			= Формат(?(ВыборкаОрг.СуммаПланаОрг=0,0,ВыборкаОрг.СКВ/ВыборкаОрг.СуммаПланаОрг*100),ЧФ0);
			
			ОблОрг_Вознаграждение.Параметры.ПроцентРуководителя	= Формат(ВыборкаОрг.СуммаВознаграждения_РОПОрг,ЧФ000);
			
		КонецЕсли;
		Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
			ОблОрг_Доход.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаОрг.СКВ - ЗПОбщееО - ?(ВыборкаОрг.СуммаВознаграждения_РОПОрг = Null, 0, ВыборкаОрг.СуммаВознаграждения_РОПОрг),ЧФ000);
		КонецЕсли;
		Если РольДоступна("уб_ЗП_ПолныйДоступ")= Истина 
			и НЕ Менеджер.Наименование = "Банки.ру" 
			И НЕ значениеЗаполнено(Менеджер)
			Тогда //Итоги по компании
			ДокументРезультат.Вывести(ОблОрг,Уровень,,Истина);
			Если ОтображатьТолькоФамилии = Ложь Тогда
				ДокументРезультат.Присоединить(ОблОрг_Вознаграждение);
			КонецЕсли;	
			ДокументРезультат.Присоединить(ОблОрг_Взносы);
			Если ДБЕсть Тогда
				ДокументРезультат.Присоединить(ОблОрг_Доход);
			КонецЕсли;	
		КонецЕсли;	
		ВыборкаПодраздел = ВыборкаОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаПодраздел.Следующий() Цикл			
			МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
			Если МЗ = Неопределено Тогда
				МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);
				РуководительПодразделения = МЗ.Сотрудник;
				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.ПолучаетВознаграждениеЗаРуководство;
			Иначе
				РуководительПодразделения = МЗ.Руководитель;
				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.РуководительПолучаетВознаграждение;
			КонецЕсли;
			
			
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("Скрывать для замов ЗП сотрудников", Ложь) Тогда
				ЗамПодразделения = Справочники.ФизическиеЛица.ПустаяСсылка();
			Иначе
				МЗ2 = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение,Истина);
				ЗамПодразделения = МЗ2.Сотрудник;
			КонецЕсли;	
				
			//Если (ЗначениеЗаполнено(Подразделение) И ВыборкаПодраздел.Подразделение <> Подразделение)
			//	Или (СписокПодразделений <> Неопределено И СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) = Неопределено)
			//	Или (ФильтрПоМенеджеру И ВыборкаПодраздел.Пустышка И РуководительПодразделения <> Менеджер И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение)
			//	Или ВыборкаПодраздел.Пустышка
			//	Тогда
			//	Продолжить
			//КонецЕсли;		
			Если ФильтрПоМенеджеру Тогда
				Если ВыборкаПодраздел.Пустышка 
                     И РуководительПодразделения <> Менеджер 
					 И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение Тогда
					Продолжить;
				КонецЕсли;	
			Иначе
				Если ВыборкаПодраздел.Пустышка Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ВыводимСтрокуПодразделения = (ЭтоПолныеПрава ИЛИ 
										 (РуководительПодразделения = ПараметрыСеанса.уб_ТекущееФизЛицо  или ЗамПодразделения = ПараметрыСеанса.уб_ТекущееФизЛицо)
										 или (ПараметрыСеанса.уб_Константы.ЭтоМастерРуководитель и Найти(ВыборкаПодраздел.Подразделение,"М-ОП")>0)) и не Менеджер.Наименование = "Банки.ру" ;
										 Если ВыводимСтрокуПодразделения и ЗначениеЗаполнено(Менеджер) 
											 и НЕ РуководительПодразделения = Менеджер 
											 и НЕ ЗамПодразделения = Менеджер Тогда
											 ВыводимСтрокуПодразделения = Ложь;
										 КонецЕсли;							 
			Если ВыводимСтрокуПодразделения Тогда
				НаименованиеПодразделения = //"Подразделение: "+
				ВыборкаПодраздел.Подразделение.Наименование + ?(Не ЗначениеЗаполнено(РуководительПодразделения),""," (" + РуководительПодразделения.Наименование + ")");
				ОблПодразделение = Макет.ПолучитьОбласть("Подразделение|Основная");
				ОблПодразделение_Вознаграждение = Макет.ПолучитьОбласть("Подразделение|Вознаграждение");	
				ОблПодразделение_Взносы = Макет.ПолучитьОбласть("Подразделение|Взносы");	
				ОблПодразделение_Доход = Макет.ПолучитьОбласть("Подразделение|Доход");	
				ОблПодразделение.Параметры.Подразделение	= НаименованиеПодразделения;
				Если Не ЭтоПолныеПрава=Истина Тогда
					//скрываем показатели подразделения
					РассчитатьПоказателиПодразделения = СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) <> Неопределено;
				Иначе
					РассчитатьПоказателиПодразделения = Истина
				КонецЕсли;
				Если РассчитатьПоказателиПодразделения Тогда
					
					ЗПОбщееП = УстановитьПараметрыОбласти_Вознаграждение(ОблПодразделение_Вознаграждение.Параметры,ВыборкаПодраздел,"ИтогоЗПпоПодразделению",Истина);
					ОблПодразделение.Параметры.ОбщееЗП = ЗПОбщееП;
					//Если ПолноеСКВ = Ложь Тогда
					//	//ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению,ЧФ000);
					//	ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ000);
					//	
					//Иначе	
					ОблПодразделение.Параметры.СобранаяКВ	   = Формат(ВыборкаПодраздел.СКВ,ЧФ000);
					//КонецЕсли;
					
					ОблПодразделение.Параметры.КоличествоФакт  = Формат(ВыборкаПодраздел.КоличествоФакт_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.КоэффициентВида  = Формат(ВыборкаПодраздел.КоэффициентВида_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.НовыйКлиент  = Формат(ВыборкаПодраздел.НовыйКлиент_ПоПодразделению,КФ);
					ОблПодразделение.Параметры.НовыйКлиентСКВ  = "";//Формат(ВыборкаПодраздел.НовыйКлиентСКВ_ПоПодразделению,КФ);
					
					
					УстановитьПараметрыОбласти_Взносы(ОблПодразделение_Взносы.Параметры,ВыборкаПодраздел,"ИтогоЗПпоПодразделению",Истина);
					Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
						ОблПодразделение.Параметры.План				= Формат(ВыборкаПодраздел.СуммаПлана,ЧФ0);
						Если ВыборкаПодраздел.СуммаКоличествоПлан = 0 Тогда
							ОблПодразделение.Параметры.КоличествоПлан =	"";
						Иначе
							ОблПодразделение.Параметры.КоличествоПлан = Формат(ВыборкаПодраздел.СуммаКоличествоПлан,ЧФ000);
						КонецЕсли;
						ОблПодразделение.Параметры.ПроцентПлана     = Строка(Формат(ВыборкаПодраздел.ПроцентВыполненияПлана_РОП,ЧФ000));
						//!ОблПодразделение.Параметры.СКВдоСП			= Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ0);
						Если ВыводитьКС Тогда
							//!ОблПодразделение.Параметры.СКВ_КС		= Формат(ВыборкаПодраздел.СКВ_КС,ЧФ);
							//!ОблПодразделение.Параметры.БОНУС_РОП_КС = Формат(ВыборкаПодраздел.БОНУС_РОП_КС,ЧФ);
						КонецЕсли;	
						
						//МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
						//Если МЗ = Неопределено Тогда
						//	МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);//.Ссылка
						//КонецЕсли;
						
						ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,ВыборкаПодраздел.СтавкаВознаграждения_РОП,0);
						
						ОблПодразделение_Вознаграждение.Параметры.ПроцентРуководителя	= Формат(ВыборкаПодраздел.СуммаВознаграждения_РОП,ЧФ000);
						Если СохраняемДанные =Истина и не (Строка(РуководительПодразделения) ="Слученков Дмитрий" и Строка(ВыборкаПодраздел.Подразделение) ="ОП-2") Тогда 
							ЗаписатьПараметр("СуммаВознаграждения_РОП",РуководительПодразделения,ВыборкаПодраздел.СуммаВознаграждения_РОП);
						КонецЕсли;	
						//!ОблПодразделение.Параметры.ПроцентОтСКВМенеджеру = Формат(ПроцентРуководителя,"");
					КонецЕсли;
					
					Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
						Если ВыборкаПодраздел.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
							ОблПодразделение_Доход.Параметры.СуммаДоходаБрокера = ?(ВыборкаПодраздел.СуммаДБ = Null,0,ВыборкаПодраздел.СуммаДБ)+?(ЗПОбщееП<0,ЗПОбщееП,0);
						Иначе	
							
							ОблПодразделение_Доход.Параметры.СуммаДоходаБрокера	= Формат(?(ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению = Null, 0, ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению) - ЗПОбщееП - ?(ВыборкаПодраздел.СуммаВознаграждения_РОП = Null, 0, ВыборкаПодраздел.СуммаВознаграждения_РОП),ЧФ000);
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//область подразделения выводим позже
			ОбластьПодразделениеВыведено = Ложь;
			
			///////////////// МЕНЕДЖЕР \\\\\\\\\\\\\\\\\
			// заполнение строки макета МЕНЕДЖЕР	
			ВыборкаМенеджер = ВыборкаПодраздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаМенеджер.Следующий() Цикл
				Если ФильтрПоМенеджеру Тогда
					Если ВыборкаМенеджер.Агент = Менеджер Тогда
					ИначеЕсли ЭтоРуководитель Тогда
						КВыводу = ВыборкаМенеджер.ЕД-ВыборкаМенеджер.НеВыводить;
						Если КВыводу<0 Или (ФильтрПоСпискуМенеджеров=Истина и СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено) Тогда
							Продолжить;
						КонецЕсли;	
					Иначе
						КВыводу = ВыборкаМенеджер.ЕД-ВыборкаМенеджер.НеВыводить;
						Если КВыводу<0 Тогда
							Продолжить;
						КонецЕсли;
						//Продолжить;
					КонецЕсли;	
				ИначеЕсли ФильтрПоСпискуМенеджеров Тогда
					Если СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено Тогда
						Продолжить
					КонецЕсли;
				Иначе
					Если ВыборкаМенеджер.Пустышка И ВыборкаМенеджер.План = 0 Тогда //И НЕ ФильтрПоМенеджеру Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;	
				Если ВыводимСтрокуПодразделения и Не ОбластьПодразделениеВыведено  Тогда
					ДокументРезультат.Вывести(ОблПодразделение,Уровень+1,,Истина);
					Если ОтображатьТолькоФамилии = Ложь Тогда
						ДокументРезультат.Присоединить(ОблПодразделение_Вознаграждение);
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОблПодразделение_Взносы);
					Если ДБЕсть Тогда
						ДокументРезультат.Присоединить(ОблПодразделение_Доход);
					КонецЕсли;	
					ОбластьПодразделениеВыведено = Истина;
					// расшифровка по руководителю
					УровеньРасшифровки = Уровень+2;//+?(ОднаСхема = ЛОЖЬ,1,0);
					Если ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП>0 и ВыборкаПодраздел.СтавкаВознаграждения_РОП>0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ для расчета ЗП (до бонус-планки)";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаПодраздел.СтавкаВознаграждения_РОП;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП*ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП/100,2),ЧФ0); 
						
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;	
						
					КонецЕсли;
					
					Если ВыборкаПодраздел.СКВ_Прол_Подразделения>0 и ВыборкаПодраздел.СтавкаВознаграждения_РОП_Прол>0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ пролонгации РОП";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_Прол_Подразделения,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаПодраздел.СтавкаВознаграждения_РОП_Прол;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						//Если  Найти("ОП-3,ОП-4",ВыборкаПодраздел.Подразделение)>0 Тогда
						Если Найти("ОП-4,ОП-3,000000038,000000025",СокрЛП(ВыборкаПодраздел.Подразделение.Код))>0 Тогда
							
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_Прол_Подразделения+ВыборкаПодраздел.СКВ_БП_Прол,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ВМ = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП_Прол*(ВыборкаПодраздел.СКВ_Прол_Подразделения+ВыборкаПодраздел.СКВ_БП_Прол)/100,2),ЧФ0); 
						Иначе	
							ОблСтрокаРасшифровки.Параметры.ВМ = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП_Прол*ВыборкаПодраздел.СКВ_Прол_Подразделения/100,2),ЧФ0); 
						КонецЕсли;	
						
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;	
						
					КонецЕсли;
					
					Если ВыборкаПодраздел.СКВ_НБ_Подразделения>0 и ВыборкаПодраздел.СтавкаВознаграждения_РОП_НБ>0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ новый бизнес РОП";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_НБ_Подразделения,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаПодраздел.СтавкаВознаграждения_РОП_НБ;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						
						Если  Найти("ОП-3,ОП-4",ВыборкаПодраздел.Подразделение)>0 Тогда
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_НБ_Подразделения+ВыборкаПодраздел.СКВ_БП_НБ,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ВМ = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП_НБ*(ВыборкаПодраздел.СКВ_НБ_Подразделения+ВыборкаПодраздел.СКВ_БП_НБ)/100,2),ЧФ0); 
						Иначе
							ОблСтрокаРасшифровки.Параметры.ВМ = Формат(Окр(ВыборкаПодраздел.СтавкаВознаграждения_РОП_НБ*ВыборкаПодраздел.СКВ_НБ_Подразделения/100,2),ЧФ0); 
						КонецЕсли;	
						
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;	
						
					КонецЕсли;

					
					Если (?(ВыборкаПодраздел.СКВот1БПдо2БП=Null,0,ВыборкаПодраздел.СКВот1БПдо2БП)+?(ВыборкаПодраздел.СКВСвыше2БП= null,0,ВыборкаПодраздел.СКВСвыше2БП))>0
						и Найти("ОП-3,ОП-4",ВыборкаПодраздел.Подразделение)=0
						Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ выше бонус-планки";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат((?(ВыборкаПодраздел.СКВот1БПдо2БП=Null,0,ВыборкаПодраздел.СКВот1БПдо2БП)+?(ВыборкаПодраздел.СКВСвыше2БП= null,0,ВыборкаПодраздел.СКВСвыше2БП)),ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "0";//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = 0; 
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;		
					КонецЕсли;
					
					//СКВ КС
					Если ?(ВыборкаПодраздел.СКВ_КС_Подразделения=Null,0,ВыборкаПодраздел.СКВ_КС_Подразделения)>0 и ?(ВыборкаПодраздел.БОНУС_РОП_КС=Null,0,ВыборкаПодраздел.БОНУС_РОП_КС)>0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						
						ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ крупных сделок";
						ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаПодраздел.СКВ_КС_Подразделения,ЧФ0); ;
						ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = Окр(100*ВыборкаПодраздел.БОНУС_РОП_КС/ВыборкаПодраздел.СКВ_КС_Подразделения,2);//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаПодраздел.БОНУС_РОП_КС,ЧФ0); 
						ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						Если ОтображатьТолькоФамилии = Ложь Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						КонецЕсли;	
						ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						Если ДБЕсть Тогда
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						КонецЕсли;		
					КонецЕсли;
					
					Интервал = ?(ТЗинтервалов.Количество()=0,ТЗинтервалов,ТЗинтервалов.Скопировать(Новый Структура("Менеджер,ЭтоВМ",РуководительПодразделения,ЛОЖЬ)));
					Если Интервал.Количество() > 0 Тогда
						ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
						ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
						ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
						
						 ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "СКВ по интервалам";
						 ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";//Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						 ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(-Интервал[0].СКВ,ЧФ0); ;
						 ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(Интервал[0].СКВ>0,Окр(100*Интервал.Итог("Доплата")/Интервал[0].СКВ,2),0);//ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						 ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Интервал.Итог("Доплата"),ЧФ0); 
						 ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						 Если ОтображатьТолькоФамилии = Ложь Тогда
							 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						 КонецЕсли;	
						 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						 Если ДБЕсть Тогда
							 ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						 КонецЕсли;		
					 КонецЕсли; 
					
					//
				КонецЕсли;
				ОблМенеджер = Макет.ПолучитьОбласть("Менеджер|Основная");
				//ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Менеджер"));//,Уровень+2+?(ВыводимСтрокуПодразделения,0,-1),Строка(ВыборкаМенеджер.Подразделение),Истина);												
				//    Возврат;
				ОблМенеджер_Вознаграждение = Макет.ПолучитьОбласть("Менеджер|Вознаграждение");	
				ОблМенеджер_Взносы = Макет.ПолучитьОбласть("Менеджер|Взносы");	
				ОблМенеджер_Доход = Макет.ПолучитьОбласть("Менеджер|Доход");	
				ОблМенеджер.Параметры.Менеджер		= ВыборкаМенеджер.Агент;
				
				СтруктураПоискаМенеджера = Новый Структура;
				СтруктураПоискаМенеджера.Вставить("Менеджер", ВыборкаМенеджер.Агент);
				Строки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоискаМенеджера);
				Если Строки.Количество() > 0 Тогда
					НайденнаяСтрокаМенеджера = Строки[0];
					Если НайденнаяСтрокаМенеджера.РаскраситьПолеМенеджера = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[Менеджер]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
					
					Если НайденнаяСтрокаМенеджера.РаскраситьПлан = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[План]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
					
					Если НайденнаяСтрокаМенеджера.РаскраситьКоличественныйПлан = Истина Тогда
						Область = ОблМенеджер.НайтиТекст("[КоличествоПлан]");
						Если Область <> Неопределено Тогда
							Область.ЦветТекста = Новый Цвет(255,0,0);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ДоступныДанныеМенеджера = ВыборкаМенеджер.Агент = ПараметрыСеанса.уб_ТекущееФизЛицо ИЛИ ВыводимСтрокуПодразделения или ВыборкаМенеджер.Агент =Менеджер; 
				
				
				Если ДоступныДанныеМенеджера Тогда
					
					ЗПОбщее = УстановитьПараметрыОбласти_Вознаграждение(ОблМенеджер_Вознаграждение.Параметры,ВыборкаМенеджер,"ИтогоЗП",Истина);
					ОблМенеджер.Параметры.ОбщееЗП = ЗПОбщее;
					Если ПолноеСКВ = Ложь Тогда
						                                                                              
						ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту,ЧФ000);
						ЗаписатьПараметр("СКВ",ВыборкаМенеджер.Агент,ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту);
					Иначе
						ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ,ЧФ000);
						ЗаписатьПараметр("СКВ",ВыборкаМенеджер.Агент,ВыборкаМенеджер.СКВ);
					КонецЕсли;	
					ЗаписатьПараметр(ВыборкаПодраздел.Подразделение,ВыборкаМенеджер.Агент,3.14);
					УстановитьПараметрыОбласти_Взносы(ОблМенеджер_Взносы.Параметры,ВыборкаМенеджер,"ИтогоЗП",Истина);
					
					
				Иначе
					ОблМенеджер.Параметры.СобранаяКВ	   = Формат(ВыборкаМенеджер.СКВ,ЧФ000);	
				КонецЕсли;
				
				Отбор = Новый Структура();
				Отбор.Вставить("Агент",ВыборкаМенеджер.Агент);
				Строки = тзСхемаРасчетаДляАгентов.НайтиСтроки(Отбор);
				СписокСхем = "";
				Если Строки.Количество() > 0 Тогда
					Для каждого Стр Из Строки Цикл
						СписокСхем = СписокСхем + ?(СписокСхем = "","", ", ") + Строка(Стр.СхемаРасчетаСМенеджером);
					КонецЦикла;
				КонецЕсли;
				//!!!				ОблМенеджер.Параметры.СхемаРасчетаСМенеджером = СписокСхем;
				//ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,?(ВыборкаМенеджер.СтавкаВознаграждения_РОП = Null, 0, ВыборкаМенеджер.СтавкаВознаграждения_РОП),0);
				//ВознаграждениеРук = Число(ВыборкаМенеджер.ВознаграждениеРуководителя);//ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту*ПроцентРуководителя/100;
				
				Если ОтображатьКолонкиДляСхемыПланПоСКВ и ДоступныДанныеМенеджера Тогда
				 
					ОблМенеджер.Параметры.План			= Формат(ВыборкаМенеджер.План,ЧФ0);
					ЗаписатьПараметр("План",ВыборкаМенеджер.Агент,ВыборкаМенеджер.План);
					Если ВыборкаМенеджер.Количество = 0 Тогда
						ОблМенеджер.Параметры.КоличествоПлан = "";
					Иначе
						ОблМенеджер.Параметры.КоличествоПлан = Формат(ВыборкаМенеджер.Количество,КФ);
					КонецЕсли;
					ОблМенеджер.Параметры.КоличествоФакт = Формат(ВыборкаМенеджер.КоличествоФакт_ПоАгенту,КФ);
					ОблМенеджер.Параметры.КоэффициентВида = Формат(ВыборкаМенеджер.КоэффициентВида_ПоАгенту,КФ);
					ОблМенеджер.Параметры.НовыйКлиент = Формат(ВыборкаМенеджер.НовыйКлиент_ПоАгенту,КФ);
					Попытка
						ОблМенеджер.Параметры.НовыйКлиентСКВ = Формат(Цел(100*?(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту=0 или ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту=Null,0,ВыборкаМенеджер.НовыйКлиентСКВ_ПоАгенту/ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту)),КФ);
						ОблМенеджер.Параметры.КоэффициентВидаГод = Формат(ВыборкаМенеджер.КоэффициентВидаГод_ПоАгенту,ЧФ0);
						
						
						
						ОблМенеджер.Параметры.ПроцентПлана	= Формат(?(ВыборкаМенеджер.План=0,0,ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту/ВыборкаМенеджер.План*100),ЧФ0);
						
					Исключение
					КонецПопытки;	
					
					
										
					//Если НЕ ТипЗнч(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту)= Тип("Null") Тогда
					//	//!ОблМенеджер.Параметры.ПроцентОтСКВМенеджеру = ВыборкаМенеджер.СтавкаВознаграждения;
					//КонецЕсли;
					//
					//СКВ_БЕЗ_КС = ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту-ВыборкаМенеджер.СКВ_КС;
					//Если РежимДвухБП Тогда
					//	//!ОблМенеджер.Параметры.ПерваяБонусПланка					= Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
					//	//!ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
					//	//!ОблМенеджер.Параметры.СКВдоСП                           = Формат(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.ПерваяБонусПланка),ЧФ);
					//	//!ОблМенеджер.Параметры.СуммаОтСКВ                        = Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
					//	Если ВыборкаМенеджер.ВыполненПланПоСКВ Тогда
					//		//!ОблМенеджер.Параметры.Превышение1БП                     = Формат(Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0),ЧФ);
					//		Если Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0) > 0 Тогда
					//			//!ОблМенеджер.Область("ПроцентПервойБП").Примечание.Текст = "Процентная ставка от суммы превышения min Бонус планки = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеПервойБонусПланки);	
					//		КонецЕсли;
					//	Иначе
					//		//!ОблМенеджер.Параметры.СКВдоСП = СКВ_БЕЗ_КС;//
					//	КонецЕсли;	
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышени1БП           = Формат(ВыборкаМенеджер.ЗПЗаПревышение1БП,ЧФ);
					//	
					//	//-Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
					//	//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
					//	//Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
					//	//!ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
					//	
					//Иначе	
					//	//!ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
					//	//!ОблМенеджер.Параметры.СуммаОтСКВ						= Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
					//	//!ОблМенеджер.Параметры.СКВдоСП							= Формат(Мин(СКВ_БЕЗ_КС, ВыборкаМенеджер.Суперплан),ЧФ0);
					//	//!ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
					//	//!ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
					//КонецЕсли;	
					//Если ВыводитьКС Тогда
					//	//!ОблМенеджер.Параметры.Бонус_КС	= Формат(ВыборкаМенеджер.Бонус_КС,ЧФ);
					//	//!ОблМенеджер.Параметры.СКВ_КС	= Формат(ВыборкаМенеджер.СКВ_КС,ЧФ);
					//КонецЕсли;	
					//Если ВыборкаМенеджер.ПревышениеСуперплана > 0 Тогда
					//	Если ВыводитьПримечанияКВМВячейки Тогда
					//		//!ОблМенеджер.Параметры.ПримечаниеКВМ	= "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);
					//	КонецЕсли;
					//	//!ОблМенеджер.Область("ПримечаниеПроцент"+?(РежимДвухБП,"201212","")).Примечание.Текст = "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);	
					//КонецЕсли;
				КонецЕсли;
				//Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
				//	//ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее - ВознаграждениеРук,ЧФ000);
				//	//!ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее,ЧФ000);
				//КонецЕсли;
				
				Если НЕ ОтображатьТолькоФамилии И НЕ СкрыватьКолонкиДСП Тогда
					//!ОблМенеджер.Параметры.Подразделение = ВыборкаМенеджер.Подразделение;//уб_СС.ПолучитьПодразделениеАгента(ВыборкаМенеджер.Агент, КонецМесяца(ЗарплатныйПериод));
				КонецЕсли;
				ДокументРезультат.Вывести(ОблМенеджер,Уровень+2+?(ВыводимСтрокуПодразделения,0,-1),Строка(ВыборкаМенеджер.Подразделение),Истина);												
				Если ОтображатьТолькоФамилии = Ложь Тогда
					ДокументРезультат.Присоединить(ОблМенеджер_Вознаграждение);
				КонецЕсли;	
				ДокументРезультат.Присоединить(ОблМенеджер_Взносы);
				Если ДБЕсть Тогда
					
					
					Если ВыборкаПодраздел.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
						ОблМенеджер_Доход.Параметры.СуммаДоходаБрокера = ВыборкаМенеджер.СуммаДБ+?(ЗПОбщее<0,ЗПОбщее,0);
					Иначе	
					КонецЕсли;	
					
					ДокументРезультат.Присоединить(ОблМенеджер_Доход);
				КонецЕсли;	
				
				/////////////////// СХЕМА \\\\\\\\\\\\\\\\\\\
				// Заполнение строки макета ВидСП
				ВыборкаСхема 	= ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				ОднаСхема = ВыборкаСхема.Количество()=1;
				Пока ВыборкаСхема.Следующий() Цикл					
					//Если ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру Тогда
					//	Продолжить;
					//Иначе
 					ЭтоПартнерское     = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру;
					Если //(ВыборкаСхема.Ед = 0 или 
						ЭтоПартнерское=Истина Тогда
						//Сообщить(1);
					Иначе//Если 						
						//(ВыборкаСхема.ВознаграждениеМенеджера=0 и (ВыборкаСхема.ВознаграждениеРуководителя = 0 или ВыборкаСхема.ВознаграждениеРуководителя = Null) и ВыборкаСхема.СКВ = 0 ) Тогда //и ВыборкаСхема.ВМ=0
						//Продолжить;
					КонецЕсли;

					ОблСхема = Макет.ПолучитьОбласть("Схема|Основная");
					ОблСхема_Вознаграждение = Макет.ПолучитьОбласть("Схема|Вознаграждение");	
					ОблСхема_Взносы = Макет.ПолучитьОбласть("Схема|Взносы");	
					ОблСхема_Доход = Макет.ПолучитьОбласть("Схема|Доход");	
					ЭтоПланПоСКВ = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
					ЭтоПоИнтерваламСКВ = ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ;
					
					ОблСхема.Параметры.Схема		= ВыборкаСхема.СхемаРасчетаСМенеджером;
					ОблСхема.Параметры.СобранаяКВ	= Формат(ВыборкаСхема.СКВ,ЧФ000);
					Если ДоступныДанныеМенеджера Тогда
						ИмяОбщейЗП = "ИтогоЗП";
						ЗПСхема = ?(ВыборкаСхема[ИмяОбщейЗП] = Null, 0, ВыборкаСхема[ИмяОбщейЗП]) //ВМ по СКВ
						+ ?(ВыборкаСхема.ВознаграждениеМенеджера = Null, 0, ВыборкаСхема.ВознаграждениеМенеджера) //ВМ в оплатах
						- ?(ВыборкаСхема.ВычетСАгента = Null, 0, ВыборкаСхема.ВычетСАгента)     //вычеты  
						+ ?(ВыборкаСхема.Бонус_КС = Null, 0, ВыборкаСхема.Бонус_КС)             //Крупные сделки
						+ ?(ЭтоПоИнтерваламСКВ = Ложь, 0,ВыборкаМенеджер.ВМПоИнтервалам) //По интервалам берем из менеджера
						+ ?(ЭтоПартнерское = Ложь или ВыборкаМенеджер.ПартнерскоеВознаграждение = Null, 0,ВыборкаМенеджер.ПартнерскоеВознаграждение); //По интервалам берем из менеджера
						ОблСхема.Параметры.ВМ           = Формат(ЗПСхема,ЧФ000);//Формат(?(ЭтоПланПоСКВ,ВыборкаСхема.ИтогоЗП,ВыборкаСхема.ВознаграждениеМенеджера),ЧФ000);					
						ЗаписатьПараметр(""+ВыборкаСхема.СхемаРасчетаСМенеджером,ВыборкаМенеджер.Агент,ЗПСхема);
						ВыводитьДанныеПоВознаграждениям = Истина;
						Если  ВыборкаСхема.СхемаРасчетаСМенеджером = Неопределено 
							ИЛИ (ВыборкаСхема.ИтогоЗП = 0 и ВыборкаСхема.ВМПоИнтервалам = 0 и ВыборкаМенеджер.ВМПоИнтервалам = 0  и ЗПСхема = 0) 
							Тогда
							//Продолжить; //TODO разобраться
							ВыводитьДанныеПоВознаграждениям = Ложь;
						КонецЕсли;
					Иначе
						ВыводитьДанныеПоВознаграждениям = Ложь;
					КонецЕсли;
				
					//Если ОднаСхема = ЛОЖЬ Тогда
						Если НЕ ВыборкаСхема.СхемаРасчетаСМенеджером = Неопределено Тогда
							ДокументРезультат.Вывести(ОблСхема,Уровень+3+?(ВыводимСтрокуПодразделения,0,-1),Строка(ВыборкаМенеджер.СхемаРасчетаСМенеджером),Истина);												
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСхема_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСхема_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСхема_Доход);
							КонецЕсли;
						КонецЕсли;
					//КонецЕсли;
					Если ВыводитьДанныеПоВознаграждениям = Истина и ЗПСхема>0 Тогда//  и ВыборкаСхема.ЕД> 0 Тогда
					ОблШапкаРасшифровки = Макет.ПолучитьОбласть("ШапкаРасшировки|Основная");
					ОблШапкаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("ШапкаРасшировки|Вознаграждение");	
					ОблШапкаРасшифровки_Взносы = Макет.ПолучитьОбласть("ШапкаРасшировки|Взносы");	
					ОблШапкаРасшифровки_Доход = Макет.ПолучитьОбласть("ШапкаРасшировки|Доход");	
					УровеньРасшифровки = 4+?(ОднаСхема = ЛОЖЬ,1,0)+?(ВыводимСтрокуПодразделения,0,-1);
					ДокументРезультат.Вывести(ОблШапкаРасшифровки,УровеньРасшифровки,"",Истина);												
					Если ОтображатьТолькоФамилии = Ложь Тогда
						ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Вознаграждение);
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Взносы);
					Если ДБЕсть Тогда
						ДокументРезультат.Присоединить(ОблШапкаРасшифровки_Доход);
					КонецЕсли;	
					
					ОблСтрокаРасшифровки_Вознаграждение = Макет.ПолучитьОбласть("СтрокаРасшифровки|Вознаграждение");	
					ОблСтрокаРасшифровки_Взносы = Макет.ПолучитьОбласть("СтрокаРасшифровки|Взносы");	
					ОблСтрокаРасшифровки_Доход = Макет.ПолучитьОбласть("СтрокаРасшифровки|Доход");	
			
					//СХЕМА ПЛАН ПО СКВ
					Если ЭтоПланПоСКВ Тогда	
						//+Новые промежуточные расчеты
						//СКВДоПлана
						//СКВотПланадо1БП
						//СКВот1БПдо2БП
						//СКВСвыше2БП
						//ЗПДоПлана
						//ЗПотПланадо1БП
						//ЗПот1БПдо2БП
						//ЗПСвыше2БП
						//ПроцентнаяСтавкаДоПлана
						//ПроцентнаяСтавкаПослеПлана
						//ПроцентнаяСтавкаПослеПервойБонусПланки
						//ПроцентнаяСтавкаПослеСуперПлана
						//План
						//ПерваяБонусПланка
						//СуперПлан
						//-
						///
						Если ВыборкаМенеджер.ЗПдоПлана <> 0 или ВыборкаМенеджер.СКВдоПлана <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВдоПлана,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.СтавкаВознаграждения;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПдоПлана,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПотПланадо1БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы от "+Формат(ВыборкаМенеджер.План,ЧФ0)+" до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВотПланадо1БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);//ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПотПланадо1БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПот1БПдо2БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы от "+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0)+" до";
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.СуперПлан,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВот1БПдо2БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентнаяСтавкаПослеПервойБонусПланки;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПот1БПдо2БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						//
						Если ВыборкаМенеджер.ЗПСвыше2БП <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За сборы свыше";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(ВыборкаМенеджер.СуперПлан,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВСвыше2БП,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана;
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗПСвыше2БП,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						
						//
						Если ВыборкаМенеджер.БОНУС_КС <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За крупные сделки/КВ по страхователю от";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(РазмерКС,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВ_КС,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.СКВ_КС=0,"",Окр(100*ВыборкаМенеджер.БОНУС_КС/ВыборкаМенеджер.СКВ_КС));
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.БОНУС_КС,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						
						Если ВыборкаМенеджер.ЗП_Пролонгация <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За пролонгацию";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВ_Прол_Агенты,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.СКВ_Прол_Агенты=0,"",Окр(100*ВыборкаМенеджер.ЗП_Пролонгация/ВыборкаМенеджер.СКВ_Прол_Агенты));
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗП_Пролонгация,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	
						
						Если ВыборкаМенеджер.ЗП_НовыйБизнес<> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "За новый бизнес";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(ВыборкаМенеджер.СКВ_НБ_Агенты,ЧФ0); ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ?(ВыборкаМенеджер.СКВ_НБ_Агенты=0,"",Окр(100*ВыборкаМенеджер.ЗП_НовыйБизнес/ВыборкаМенеджер.СКВ_НБ_Агенты));
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ЗП_НовыйБизнес,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;	


						
						
						//
						Если ВыборкаМенеджер.ВычетСАгента <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "Вычеты по оплатам";//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = "<суммарно по всем>"; ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "-";
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаМенеджер.ВычетСАгента,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
						КонецЕсли;
						
						//БазаРОП = ВыборкаМенеджер.СКВДоПлана + ВыборкаМенеджер.СКВ_КС+ ВыборкаМенеджер.СКВотПланадо1БП;
						//Если БазаРОП >0 и (ЭтоПолныеПрава или ЭтоРуководитель) Тогда
						//	
						//	ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
						//	ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = "Ставка руководителя за "+ВыборкаМенеджер.ПроцентВыполненияПлана;
						//	ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";///Формат(ВыборкаМенеджер.План,ЧФ0)+?(ВыборкаМенеджер.ШтрафнойПлан=0,""," (ш."+Формат(ВыборкаМенеджер.ШтрафнойПлан,"ЧЦ=15; ЧДЦ=2; ЧГ=")+")");
						//	ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(БазаРОП,ЧФ0); ;
						//	ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = ВыборкаМенеджер.ПроцентРОП;//?(ВыборкаМенеджер.ВыполненПланПоСКВ,ВыборкаМенеджер.ПроцентнаяСтавкаПослеПлана,ВыборкаМенеджер.ПроцентнаяСтавкаДоПлана);
						//	ОблСтрокаРасшифровки.Параметры.ВМ                        = "";//Формат(ВыборкаМенеджер.ЗПдоПлана,ЧФ0); 
						//	ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
						//	Если ОтображатьТолькоФамилии = Ложь Тогда
						//		ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
						//	КонецЕсли;	
						//	ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
						//	Если ДБЕсть Тогда
						//		ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
						//	КонецЕсли;	
						//КонецЕсли;
					КонецЕсли;
					//
					Если ЭтоПоИнтерваламСКВ = Истина Тогда
						//
						//СХЕМА ПО ИНТЕРВАЛАМ СКВ
				 		Если ТипЗнч(ТЗинтервалов) = Тип("ТаблицаЗначений") Тогда
							Для каждого Строка из ТЗинтервалов.НайтиСтроки(Новый Структура("Менеджер",ВыборкаМенеджер.Агент)) цикл
								//
								Если (Строка.База<>0) ИЛИ (Строка.Доплата<>0)  Тогда
									ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
									Префикс = ?(Строка.ЭтоВМ = ИСТИНА,"За сборы от ","Руководителю за сборы отдела от ");
									ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = Префикс+Формат(Строка.Начало,ЧФ0)+" до ";
									ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = Формат(Строка.Окончание,ЧФ0);
									ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = Формат(Строка.База,ЧФ0); ;
									ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = Строка.ПроцентИнтервала;
									ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(Строка.Доплата,ЧФ0); 
									ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);			
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
									КонецЕсли;	
									ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
									Если ДБЕсть Тогда
										ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
									КонецЕсли;	
								КонецЕсли;	
								
							КонецЦикла;	
						КонецЕсли;	
					КонецЕсли;		
					//
					Если ВыборкаСхема.ВознаграждениеМенеджера <> 0 Тогда
							ОблСтрокаРасшифровки = Макет.ПолучитьОбласть("СтрокаРасшифровки|Основная");
							ОблСтрокаРасшифровки.Параметры.НаименованиеВознаграждения = ?(ВыборкаСхема.ВознаграждениеМенеджера<0,"Удержание по оплатам","Допуслуги по оплатам");//+Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
							ОблСтрокаРасшифровки.Параметры.ПорогВознагражедения      = "";
							ОблСтрокаРасшифровки.Параметры.БазаВознаграждения		 = "<суммарно по cхеме>"; ;
							ОблСтрокаРасшифровки.Параметры.ПроцентВознаграждения     = "-";
							ОблСтрокаРасшифровки.Параметры.ВМ                        = Формат(ВыборкаСхема.ВознаграждениеМенеджера,ЧФ0); 
							ДокументРезультат.Вывести(ОблСтрокаРасшифровки,УровеньРасшифровки,"",Истина);												
							
							Если ОтображатьТолькоФамилии = Ложь Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Вознаграждение);
							КонецЕсли;	
							ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Взносы);
							Если ДБЕсть Тогда
								ДокументРезультат.Присоединить(ОблСтрокаРасшифровки_Доход);
							КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
					/////////////////// ВидСП \\\\\\\\\\\\\\\\\\\
					// Заполнение строки макета ВидСП
					Если ВыборкаСхема.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру Тогда
						//Документов там нет
						Продолжить;
					КонецЕсли;
					
					счетчикСп = 0;
					ВыборкаВидСП 	= ВыборкаСхема.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
					Пока ВыборкаВидСП.Следующий() Цикл					
						
						Если РежимОтчета = 1 Тогда
							КВыводу = ВыборкаВидСП.ЕД-ВыборкаВидСП.НеВыводить;
							Если КВыводу<=0 Тогда
								Продолжить;
							КонецЕсли;
						Иначе
							Если ВыборкаВидСП.Пустышка Тогда
								Продолжить;
							Иначе
								КВыводу = ВыборкаВидСП.ЕД-ВыборкаВидСП.НеВыводить;
								Если КВыводу<=0 Тогда
									Продолжить;
								КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;
						счетчикСп = счетчикСп+1;
						#Если Клиент Тогда
							ОбработкаПрерыванияПользователя();
						#КонецЕсли
						ОблВидСП = Макет.ПолучитьОбласть("ВидСП|Основная");
						ОблВидСП_Вознаграждение = Макет.ПолучитьОбласть("ВидСП|Вознаграждение");	
						ОблВидСП_Взносы = Макет.ПолучитьОбласть("ВидСП|Взносы");	
						ОблВидСП_Доход = Макет.ПолучитьОбласть("ВидСП|Доход");	
						ОблВидСП.Параметры.ВидСП		= ВыборкаВидСП.ВидСП;
						ЗПОбщееО =УстановитьПараметрыОбласти_Вознаграждение(ОблВидСП_Вознаграждение.Параметры,ВыборкаВидСП);
						//					ОблВидСп.Параметры.ОбщееЗП = ЗПОбщееО;
						ОблВидСП.Параметры.СобранаяКВ	   = Формат(ВыборкаВидСП.СКВ,ЧФ000);
						УстановитьПараметрыОбласти_Взносы(ОблВидСП_Взносы.Параметры,ВыборкаВидСП,"",Истина);
						Если ВыводитьКС Тогда
							//!ОблВидСП.Параметры.Бонус_КС	= Формат(ВыборкаВидСП.Бонус_КС,ЧФ);
							//!ОблВидСП.Параметры.СКВ_КС	= Формат(ВыборкаВидСП.СКВ_КС,ЧФ);
						КонецЕсли;	
						
						Если Не ОтображатьТолькоФамилии Тогда  
							
							Если Не ЗначениеЗаполнено(Страхователь) Тогда
								Если счетчикСп =1 Тогда
									ДокументРезультат.Вывести(Макет.ПолучитьОбласть("ШапкаОплаты|Основная"),УровеньРасшифровки,Строка(ВыборкаМенеджер.Агент),Истина);
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Вознаграждение"));
									КонецЕсли;	
									ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Взносы"));
									Если ДБЕсть Тогда
										ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("ШапкаОплаты|Доход"));
									КонецЕсли;	
									//ШапкаОплаты_Вознаграждение = Макет.ПолучитьОбласть("ШапкаОплаты|Вознаграждение");	
								КонецЕсли;	
								ДокументРезультат.Вывести(ОблВидСП,Уровень+5,Строка(ВыборкаМенеджер.Агент),Истина);
								Если ОтображатьТолькоФамилии = Ложь Тогда
									ДокументРезультат.Присоединить(ОблВидСП_Вознаграждение);
								КонецЕсли;	
								ДокументРезультат.Присоединить(ОблВидСП_Взносы);
								Если ДБЕсть Тогда
									ДокументРезультат.Присоединить(ОблВидСП_Доход);
								КонецЕсли;	
								
							КонецЕсли;
							
						КонецЕсли;				
						СчВидаСП = 0;
						ВыбСтр 	= ВыборкаВидСП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);					
						////////////////// СТРОКА \\\\\\\\\\\\\\\\\\\\
						// Заполнение строки макета СТРОКА
						Пока ВыбСтр.Следующий() Цикл
							#Если Клиент Тогда
								ОбработкаПрерыванияПользователя();
							#КонецЕсли
							ПолисАннулирован = ?(ВыбСтр.ПолисАннулирован = Неопределено, Ложь, ВыбСтр.ПолисАннулирован);
							//при сравнении двух дат с галочкой "отображать только оплаты где изменился СКВ" ПолисАннулирован = Неопределено
							Если Не ОтображатьАннулированныеОплаты И ПолисАннулирован И ВыбСтр.СКВ = 0 И ВыбСтр.ВознаграждениеМенеджера = 0 Тогда
								Продолжить
							КонецЕсли;
							Если РежимОтчета = 1 Тогда
								Если ВыбСтр.НеВыводить=1 Тогда
									Продолжить;
								ИначеЕсли ЗначениеЗаполнено(ВыбСтр.Ссылка)=Ложь Тогда
									Продолжить;
								КонецЕсли;
							Иначе
								Если ВыбСтр.Пустышка или ВыбСтр.НеВыводить = 1 Тогда
									Продолжить;
								КонецЕсли;
							Конецесли;						
							СчНом = СчНом + 1;
							//ИндикаторСтеп();
							СчВидаСП = СчВидаСП + 1;						
							Обл = Макет.ПолучитьОбласть("Строка|Основная");
							Обл_Вознаграждение = Макет.ПолучитьОбласть("Строка|Вознаграждение");	
							Обл_Взносы = Макет.ПолучитьОбласть("Строка|Взносы");	
							Обл_Доход = Макет.ПолучитьОбласть("Строка|Доход");	
							Обл.Параметры.ЗначРасшифровки  = Новый Структура("Ссылка",ВыбСтр.Ссылка);
							Обл.Параметры.ЗаРекомендацию   = ВыбСтр.Ссылка.ЗаРекомендацию;
							Обл.Параметры.ЗаКоробку        = ВыбСтр.Ссылка.ЗаКоробку;
							Обл.Параметры.Ном              = Формат(СчНом,"ЧЦ=10; ЧГ=");
							Обл.Параметры.НомерОплаты      = ВыбСтр.Номер; //В запрос
							Обл.Параметры.НомСп            = СчВидаСП;
							Обл.Параметры.ДатаОплаты       = ВыбСтр.Дата;
							Обл.Параметры.СК               = ВыбСтр.СК;
							Обл.Параметры.СтраховойПродукт = ВыбСтр.СтраховойПродукт;
							Обл.Параметры.НомерЗаявки      = ВыбСтр.НомерЗаявки;
							Обл.Параметры.ВМ               = Формат(ВыбСтр.ВознаграждениеМенеджера, ЧФ);

							Если ВыводитьКС Тогда
								//!Обл.Параметры.Бонус_КС				= Формат(ВыбСтр.Бонус_КС,ЧФ);
								//!Обл.Параметры.СКВ_КС				= Формат(ВыбСтр.СКВ_КС,ЧФ);
								Если ВыбСтр.СКВ_КС > 0 Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Вознаграждение.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Взносы.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Доход.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
									КонецЦикла;	 
									//!Обл.Область("Бонус_КС").Примечание.Текст = " ("+ВыборкаМенеджер.СтавкаВознаграждения+"+"+ВыбСтр.БонусПроцент+")%"+" "+?(ВыбСтр.Сделка.Дата = Дата(1,1,1),"Автоматически определенная крупная сделка",ВыбСтр.Сделка);
								ИначеЕсли ПолисАннулирован Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл
										ЦветАннулированногоПолиса = Новый Цвет(252, 226, 192);
										ПодОбласть.ЦветФона = ЦветАннулированногоПолиса;
									КонецЦикла;
								ИначеЕсли ВыбСтр.ЭтоПролонгация	= Истина Тогда
									Для Каждого ПодОбласть Из Обл.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Вознаграждение.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Взносы.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
									Для Каждого ПодОбласть Из Обл_Доход.Области Цикл 
										ПодОбласть.ЦветФона = Новый Цвет(240, 240, 255); // Светло-зеленый
									КонецЦикла;	 
								КонецЕсли;	
							КонецЕсли;	
							Если НЕ ОтображатьТолькоФамилии Тогда
								//Попытка
								//	Обл_Вознаграждение.Параметры.Страхователь	= уб_СС.ФИОФизлицаСтрокой(ВыбСтр.Страхователь,, Истина, 1, Ложь);
								//Исключение
								Если ТипЗНч(ВыбСтр.Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
								 	Обл_Вознаграждение.Параметры.Страхователь	= Лев(ВыбСтр.Страхователь,Найти(ВыбСтр.Страхователь," "));
								Иначе
									Обл_Вознаграждение.Параметры.Страхователь	= ВыбСтр.Страхователь;
								КонецЕсли;	
								//КонецПопытки;	
								Попытка
									Если ВыбСтр.НовыйКлиент >0 Тогда
										//Выделим новых клиентов
										подобласть=Обл_Вознаграждение.Область(1,2,1,3);
										подобласть.ЦветТекста = Новый Цвет(0,130,0);
										подобласть.Шрифт = Новый Шрифт(подобласть.Шрифт,,,Истина);
									КонецЕсли;	
								Исключение
								КонецПопытки;	
								Обл_Вознаграждение.Параметры.НомерПолиса		= СокрЛП(ВыбСтр.НомерПолиса);
								Попытка
									Обл_Вознаграждение.Параметры.НомерКвитанции		= ВыбСтр.НомерКвитанции;
								Исключение КонецПопытки	;
								Обл_Взносы.Параметры.ПолнаяПремия				= Формат(ВыбСтр.ПолнаяПремия,ЧФ0);
								Если ВыбСтр.НомерВзноса <> Неопределено ИЛИ ВыбСтр.НачисленнаяСуммаВзноса <> Неопределено Тогда
									Если ВыбСтр.НомерВзноса = 1 И ВыбСтр.ПолнаяПремия = ВыбСтр.НачисленнаяСуммаВзноса Тогда
										Обл.Параметры.НомерВзноса = "П";
									Иначе
										Обл.Параметры.НомерВзноса = Строка(ВыбСтр.НомерВзноса) + " взн";
									КонецЕсли;
									Обл_Взносы.Параметры.ОплаченоФакт			= Формат(ВыбСтр.ОплаченоФакт,ЧФ000);
									Обл_Взносы.Параметры.АВилиСкидкаПроцент	= ВыбСтр.АВилиСкидкаПроцент;
									Обл_Взносы.Параметры.АВилиСкидкаСумма		= Формат(ВыбСтр.АВилиСкидкаСумма,ЧФ);
									//!Обл.Параметры.Комментарий			= ВыбСтр.Комментарий;        
									//!Обл.Параметры.ДатаПолиса			= ВыбСтр.ДатаПолиса;
								КонецЕсли;
							КонецЕсли; 
							Обл_Взносы.Параметры.НачисленнаяСуммаВзноса	= Формат(ВыбСтр.НачисленнаяСуммаВзноса,ЧФ0);
							Обл.Параметры.СобранаяКВ				= Формат(ВыбСтр.СКВ,ЧФ0);
							Если ВыбСтр.КоличествоФакт = 0 Тогда
								//Обл.Параметры.КоличествоФакт		= "";
							Иначе
								//Обл.Параметры.КоличествоФакт		= Формат(ВыбСтр.КоличествоФакт,ЧФ000);
							КонецЕсли;
							Обл.Параметры.КоэффициентВида = Формат(ВыбСтр.КоэффициентВида,КФ);
							
							
							Обл_Вознаграждение.Параметры.СхемаРасчетаСМенеджером	= ВыбСтр.СхемаРасчетаСМенеджером;
							Попытка
								Обл_Вознаграждение.Параметры.НовыйКлиент = Формат(ВыбСтр.НовыйКлиент,КФ);
							Исключение
							КонецПопытки;	
							Если НЕ СкрыватьКолонкиДСП Тогда
								Если НЕ ОтображатьТолькоФамилии Тогда
									//!Обл.Параметры.Подразделение			= ВыбСтр.Подразделение;
									Обл.Параметры.НаправлениеПлатежа	= ВыбСтр.НаправлениеПлатежа;
									//Обл_Взносы.Параметры.КВПроцент				= ВыбСтр.КВПроцент;
									Обл_Взносы.Параметры.КВПроцентДляАгента				= ВыбСтр.КВПроцентДляАгента;
									Обл_Взносы.Параметры.КВСумма				= Формат(ВыбСтр.КВСуммаДляАгента,ЧФ);
									Обл_Доход.Параметры.КВПроцентДляОтчета	= ВыбСтр.КВПроцентДляОтчета;        
									//Если ВыбСтр.КВПодВопросом Тогда
									//	Обл_Взносы.Области.КВПроцент.ЦветФона = WebЦвета.Желтый;
									//	Обл_Взносы.Области.КВПроцент.Примечание.Текст = "КВ под вопросом";
									//КонецЕсли;
									//Обл.Параметры.Ссылка				= ВыбСтр.Ссылка;
									//Обл.Параметры.Ссылка_Строка = "Оплата "+ВыбСтр.Номер+ " от "+Формат(ВыбСтр.Дата,"ДФ=dd.MM.yy");
								КонецЕсли;
							КонецЕсли;						
							Если ВыбСтр.ВычетСАгента = Null или ВыбСтр.ВычетСАгента = 0 Тогда
								Обл.Параметры.Разд ="";
								Обл.Параметры.ВычетСАгента = "";
							Иначе	
								Обл.Параметры.Разд ="/";
								Обл.Параметры.ВычетСАгента			= Формат(?(ВыбСтр.ВычетСАгента = Null, 0, -ВыбСтр.ВычетСАгента),ЧФ);;
							КонецЕсли;	
							ИнфоКВМ = СоотвИнфоКВМ.Получить(ВыбСтр.Номер);
							//Если ВыбСтр.ИсключитьИзРасчетаЗП <> Неопределено Тогда
							//	Если ВыбСтр.ИсключитьИзРасчетаЗП Тогда
							//		Обл.Области.ПолеСтроки.Узор = ТипУзораТабличногоДокумента.Узор3;
							//		Обл.Области.ПолеСтроки.ЦветУзора = новый Цвет(255, 50, 50);
							//	КонецЕсли;
							//КонецЕсли;
							Если ИнфоКВМ <> Неопределено Тогда
								//Если ВыводитьПримечанияКВМВячейки Тогда
								//	Обл_Вознаграждение.Параметры.ПримечаниеКВМ	= ИнфоКВМ;
								//Иначе
								//	Обл_Вознаграждение.Область("ПримечаниеКВМ").Примечание.Текст = ИнфоКВМ;
								//КонецЕсли;
							КонецЕсли;
							Если ВыбСтр.БонусМенеджеру <> Неопределено ИЛИ ВыбСтр.ВидРасчетаСАгентом <> Неопределено Тогда
								
								//Если ВыбСтр.БонусМенеджеру Тогда
								//	//Обл_Вознаграждение.Область("ПримечаниеКВМ").ЦветФона = цЖелтенький;
								//	//Обл_Вознаграждение.Область("ПримечаниеКВМ").Примечание.Текст = "Есть бонус менеджера";
								//КонецЕсли;
								//
								//Если ВыбСтр.ВидРасчетаСАгентом = кРасчетПоАВ Тогда
								//	//Обл.Область("СтрокаОтчета").ЦветФона = новый Цвет(245,200,150);
								//	//Обл.Область("СтрокаОтчета").Примечание.Текст = "Расчет по схеме";
								//КонецЕсли;
							КонецЕсли;
							
							Если НЕ ОтображатьТолькоФамилии Тогда
								
								Если Не ЗначениеЗаполнено(Страхователь) Или ВыбСтр.Страхователь = Страхователь Тогда
									
									ДокументРезультат.Вывести(Обл,Уровень+5,Строка(ВыборкаВидСП.ВидСП) + ", " + Строка(ВыборкаМенеджер.Агент),Истина);
									Если ОтображатьТолькоФамилии = Ложь Тогда
										ДокументРезультат.Присоединить(Обл_Вознаграждение);
									КонецЕсли;	
									ДокументРезультат.Присоединить(Обл_Взносы);
									Если ДБЕсть Тогда
										Попытка
											Если ВыбСтр.СхемаВознагражденияРуководителяОП = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП.ПроцентОтДБ Тогда
												Обл_Доход.Параметры.СуммаДоходаБрокера = ВыбСтр.СуммаДБ;
											Иначе	
											КонецЕсли;	
										Исключение
										КонецПопытки;
										ДокументРезультат.Присоединить(Обл_Доход);
									КонецЕсли;	
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;							
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		//ИндикаторСкрыть();
		
	КонецЦикла;
	Если ЗначениеЗаполнено(Менеджер) Тогда
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(6);
		ОблПодписи = Макет.ПолучитьОбласть("Подписи|Основная");
		
		ОблПодписи.Параметры.Менеджер	= Менеджер;
		ДокументРезультат.Вывести(ОблПодписи);
	Иначе
		ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3);
	КонецЕсли;	
	СкрыватьКолонкиДСП = _СкрыватьКолонкиДСП;
КонецПроцедуры

//Процедура ВывестиОтчетСтарый(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаОтчета, тзАгентовДляРаскраски = Неопределено) Экспорт
//	
//	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
//	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
//	кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
//	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
//	пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
//	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
//	ОтображатьКолонкиДляСхемыПланПоСКВ = Истина;//ВСЕГДА ВЫВОДИМ
//	//Необходимо переименовать колонку ВознаграждениеМенеджера, 
//	//иначе будут задвоения при объединении таблиц
//	ТзАгентов.Колонки.ВознаграждениеМенеджера.Имя = "ВознаграждениеМенеджера1";
//	ТзАгентов.Колонки.ВычетСАгента.Имя = "ВычетСАгента1";
//	
//	ЗапросВыводРасчетаВМ = Новый Запрос;
//	//Создаем временные таблицы 
//	ЗапросВыводРасчетаВМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	
//	ТЗ1.Колонки.ЕстьПланПоСКВ.Имя = "АгентРаботаетПоПлануПоСКВ";
//	
//	ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТСписокОплатЗаПериод ИЗ &ТЗ КАК ТТ";
//	ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗ", ТЗ1);
//	Этап = Этап + 1;
//	#Если Клиент Тогда
//		Состояние(" Этап: " + Этап + " из " + КоличествоЭтапов + " - Подготовка к расчету итогов");
//	#КонецЕсли
//	ЗапросВыводРасчетаВМ.Выполнить();
//	
//	ТЗАгентов.Колонки.Агент.Имя			= "Агент_ТАгентов";
//	ТЗАгентов.Колонки.Подразделение.Имя = "Подразделение_ТАгентов";
//	ТЗАгентов.Колонки.ЕстьПланПоСКВ.Имя = "РаботаетПоПлануПоСКВ_ТАгентов";
//	ТЗАгентов.Колонки.Удалить("СКВ_КС");
//	тзПодразделений.Колонки.Удалить("СКВ_КС");
//	
//	ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТАгентов ИЗ &ТЗАгентов КАК ТА";
//	ЗапросВыводРасчетаВМ.УстановитьПараметр("ТЗАгентов", ТЗАгентов);
//	ЗапросВыводРасчетаВМ.Выполнить();
//	
//	тзПодразделений.Колонки.Подразделение.Имя = "Подразделение_ТПодразделений";
//	
//	ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТПодразделений ИЗ &тзПодразделений КАК ТП";
//	ЗапросВыводРасчетаВМ.УстановитьПараметр("тзПодразделений", тзПодразделений);
//	ЗапросВыводРасчетаВМ.Выполнить();
//	
//	ЗапросВыводРасчетаВМ.Текст = "ВЫБРАТЬ
//	|	ТАгентов.*,
//	|	ТПодразделений.*,
//	|	ТСписокОплатЗаПериод.*
//	|
//	|ПОМЕСТИТЬ ТСписокОплат
//	|ИЗ
//	|	ТСписокОплатЗаПериод КАК ТСписокОплатЗаПериод
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТПодразделений КАК ТПодразделений
//	|		ПО ТСписокОплатЗаПериод.Подразделение = ТПодразделений.Подразделение_ТПодразделений
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАгентов КАК ТАгентов
//	|		ПО ТСписокОплатЗаПериод.Агент = ТАгентов.Агент_ТАгентов";
//	
//	Этап=Этап+1;
//	#Если Клиент Тогда
//		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Группировка таблиц итогов");
//	#КонецЕсли
//	ЗапросВыводРасчетаВМ.Выполнить();
//	
//	ЗапросВыводРасчетаВМ.Текст = " ВЫБРАТЬ * ИЗ ТСписокОплат
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Агент.Наименование,
//	|	ВидСП,
//	|	Дата
//	|ИТОГИ
//	|	СУММА(ВознаграждениеМенеджера),
//	|	СРЕДНЕЕ(ВознаграждениеРуководителя),
//	|	СУММА(НачисленнаяСуммаВзноса),
//	|	СУММА(ОплаченоФакт),
//	|	СУММА(КВСуммаДляАгента),
//	|	СУММА(АВилиСкидкаСумма),
//	|	СУММА(ЕД),
//	|	СУММА(ВычетСАгента),
//	|	СРЕДНЕЕ(ЗПотЗаПревышениеСуперПлана),
//	|	СРЕДНЕЕ(ЗПЗаПревышение1БП),
//	|	СРЕДНЕЕ(ЗПотСКВдоСуперПлана),
//	|	СРЕДНЕЕ(ИтогоЗП),
//	|	СРЕДНЕЕ(ИтогоЗПОрг),
//	|	СРЕДНЕЕ(ИтогоЗПпоПодразделению),          
//	|	СРЕДНЕЕ(План),
//	|	СРЕДНЕЕ(Количество),
//	|	СРЕДНЕЕ(ПревышениеСуперплана),
//	|	СРЕДНЕЕ(СКВ_ПоПодразделениямДоСП),
//	|	Минимум(ПроцентВыполненияПлана),
//	|	Минимум(ВыполненПланПоСКВ),
//	|	Минимум(ПроцентнаяСтавкаДоПлана),
//	|	Минимум(ПроцентнаяСтавкаПослеПлана),
//	|	Минимум(ПроцентнаяСтавкаПослеПервойБонусПланки),
//	|	Минимум(ПроцентнаяСтавкаПослеСуперПлана),
//	|	Минимум(Пустышка),
//	|	Минимум(НеВыводить),
//	|	СРЕДНЕЕ(СтавкаВознаграждения),
//	|	СРЕДНЕЕ(СуперПлан),
//	|	СРЕДНЕЕ(ПерваяБонусПланка),
//	|	СРЕДНЕЕ(ПоказательМинимальногоПорога_РОП),
//	|	СРЕДНЕЕ(ПоказательПлана_РОП),
//	|	Минимум(ПроцентВыполненияПлана_РОП),
//	|	Минимум(ПроцентнаяСтавкаДоМинимальногоПорога_РОП),
//	|	Минимум(ПроцентнаяСтавкаДоПлана_РОП),
//	|	Минимум(ПроцентнаяСтавкаПослеПлана_РОП),
//	|	СРЕДНЕЕ(СтавкаВознаграждения_РОП),
//	|	СРЕДНЕЕ(СуммаВМ),
//	|	СРЕДНЕЕ(СуммаВознаграждения_РОП),
//	|	СРЕДНЕЕ(СуммаВознаграждения_РОПОрг),
//	|	СРЕДНЕЕ(СКВ_ДляПланаПоСКВ_ПоПодразделению),
//	|	СРЕДНЕЕ(КоличествоФакт_ПоПодразделению),
//	|	СРЕДНЕЕ(СКВ_ДляПланаПоСКВ_ПоАгенту),
//	|	СРЕДНЕЕ(КоличествоФакт_ПоАгенту),
//	|	СРЕДНЕЕ(СуммаПлана),
//	|	СРЕДНЕЕ(СуммаПланаОрг),
//	|	СРЕДНЕЕ(СуммаКоличествоПлан),
//	|	СРЕДНЕЕ(СуммаКоличествоПланОрг),
//	|	СУММА(КоличествоФакт),
//	|	СУММА(СКВ),
//	|	СУММА(СКВ_КС),
//	|	СУММА(БОНУС_КС),
//	|	СУММА(БОНУС_РОП_КС)
//	|ПО
//	|	Организация,
//	|	Подразделение,
//	|	Агент,
//	|	ВидСП";
//	
//	Этап=Этап+1;
//	#Если Клиент Тогда
//		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Расчет итогов");
//	#КонецЕсли
//	ТЗ2 = ЗапросВыводРасчетаВМ.Выполнить();	
//	//Уничтожение временной таблицы
//	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплатЗаПериод ";
//	ЗапросВыводРасчетаВМ.Выполнить();	
//	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТПодразделений ";
//	ЗапросВыводРасчетаВМ.Выполнить();	
//	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТАгентов ";
//	ЗапросВыводРасчетаВМ.Выполнить();	
//	ЗапросВыводРасчетаВМ.Текст = "УНИЧТОЖИТЬ ТСписокОплат ";
//	ЗапросВыводРасчетаВМ.Выполнить();	
//	цЖелтенький = Новый Цвет(255, 255, 153);
//	//Макет 	= ПолучитьМакет("Макет");
//	Макет 	= ПолучитьМакет("Макет");
//	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
//	Если НЕ ВыводитьПримечанияКВМВячейки Тогда
//		Макет.УдалитьОбласть(Макет.Область("СтолбецПримКВМ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;
//	ВыводитьКС = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
//	Если НЕ ВыводитьКС Тогда
//		Макет.УдалитьОбласть(Макет.Область("КС"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;
//	РежимДвухБП = ДатаНачала>=Дата(2012,12,1);
//	Если РежимДвухБП Тогда
//		Макет.УдалитьОбласть(Макет.Область("РасчетЗП"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	Иначе
//		Макет.УдалитьОбласть(Макет.Область("РасчетЗП201212"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;	
//	ДБЕсть = Истина;
//	Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
//		Макет.УдалитьОбласть(Макет.Область("ДБ"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		ДБЕсть = Ложь;
//	КонецЕсли;		
//	Если НЕ ОтображатьКолонкиДляСхемыПланПоСКВ Тогда
//		Макет.УдалитьОбласть(Макет.Область("СхемаПлан1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		Макет.УдалитьОбласть(Макет.Область("СхемаПлан"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;
//	Если ОтображатьТолькоФамилии Тогда
//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_3"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);		
//		Если НЕ СкрыватьКолонкиДСП Тогда
//			Макет.УдалитьОбласть(Макет.Область("БезИтогов_4"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//			Макет.УдалитьОбласть(Макет.Область("БезИтогов_5"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//			Макет.УдалитьОбласть(Макет.Область("БезИтогов_6"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		КонецЕсли;		
//		Макет.УдалитьОбласть(Макет.Область("БезИтогов_7"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//		Макет.Область("ЗаголовокВРежимеТолькоФамилии").Объединить();
//		Макет.Область("ЗаголовокВРежимеТолькоФамилии").Текст = "Организация/Подразделение/Сотрудник";
//	КонецЕсли; 
//	Если СкрыватьКолонкиДСП Тогда
//		Макет.УдалитьОбласть(Макет.Область("ДСП1"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;	
//	Если СкрыватьКолонкиДСП ИЛИ ОтображатьТолькоФамилии Тогда
//		Макет.УдалитьОбласть(Макет.Область("ДСП2"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
//	КонецЕсли;	
//	Обл_Шапка = Макет.ПолучитьОбласть("Шапка");	
//	Обл_Заголовок = Макет.ПолучитьОбласть("Заголовок");
//	Обл_Заголовок.Параметры.ЗарплатныйПериод 	= Формат(ЗарплатныйПериод,"ДФ='ММMM yyyy'");
//	Если РежимОтчета=1 И ДатаОтчета <>ДатаСреза1 Тогда
//	Иначе
//		ДокументРезультат.Вывести(Обл_Заголовок);
//	КонецЕсли;
//	Если РежимОтчета = 0  Тогда
//		Если ЗначениеНеЗаполнено(ВидСП) Тогда
//			Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),Смещать);
//		Иначе
//			Обл_Шапка.Параметры.ВидСП	= ВидСП;
//		КонецЕсли;
//		Если Не ЗначениеЗаполнено(Менеджер) Тогда
//			Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),Смещать);
//		Иначе
//			Обл_Шапка.Параметры.Менеджер = Менеджер;
//		КонецЕсли;
//		Если Не ЗначениеЗаполнено(Подразделение) Тогда
//			Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
//		Иначе
//			Обл_Шапка.Параметры.Подразделение = Подразделение;
//		КонецЕсли;
//	Иначе
//		Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоВидСП"),		Смещать);
//		Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоМенеджер"),		Смещать);
//		Обл_Шапка.УдалитьОбласть(Макет.Область("ИнфоПодразделение"),Смещать);
//	КонецЕсли;
//	ДокументРезультат.ФиксацияСверху	= Обл_Шапка.ВысотаТаблицы + 1;
//	
//	Если ЗначениеЗаполнено(ДатаОтчета) Тогда
//		ДатаВотчет  = "Состояние расчета ЗП на "+Формат(ДатаОтчета,"ДФ='dd.MM.yyyy HH:mm'");
//	Иначе	
//		ДатаВотчет = "Состояние расчета ЗП на текущую дату ("+Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm'")+")";
//	КонецЕсли;	
//	Обл_Шапка.Параметры.ДатаВотчет = ДатаВотчет;
//	
//	ДокументРезультат.Вывести(Обл_Шапка);
//	
//	//ДокументРезультат.ФиксацияСверху = 8;
//	ДокументРезультат.НачатьАвтогруппировкуСтрок();
//	
//	//
//	
//	ВыборкаОрг 	= ТЗ2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//	СчНом = 0;
//	ЧФ = "ЧЦ=14; ЧДЦ=2";
//	ЧФ0 = "ЧЦ=14; ЧДЦ=2; ЧН=0";
//	ЧФ000 = "ЧЦ=14; ЧДЦ=2; ЧН=";
//	//////////////////// ОРГ \\\\\\\\\\\\\\\\\\\\\
//	// заполнение строки макета ОРГ
//	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
//	ФильтрПоСпискуМенеджеров = СписокМенеджеров.Количество() > 0;
//	ЭтоРуководитель = Ложь;
//	Если ФильтрПоМенеджеру Тогда
//		Уволен = Ложь;
//		ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер, КонецМесяца(ЗарплатныйПериод), Истина,Уволен);
//		Если ПодразделениеАгента = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
//			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
//			ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(Менеджер , НачалоМесяца(ЗарплатныйПериод), Ложь,Уволен);
//		КонецЕсли;
//		МЗ = тзПодразделений.Найти(ПодразделениеАгента,"Подразделение_ТПодразделений");
//		Если МЗ = Неопределено Тогда
//			МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), ПодразделениеАгента);
//			Руководитель = МЗ.Сотрудник;
//		Иначе
//			Руководитель = МЗ.Руководитель;
//		КонецЕсли;
//		ЭтоРуководитель = Руководитель = Менеджер;
//	КонецЕсли;
//	Этап=Этап+1;
//	#Если Клиент Тогда
//		Состояние("Этап: "+Этап+" из "+КоличествоЭтапов +" - Вывод отчета");
//	#КонецЕсли
//	
//	Пока ВыборкаОрг.Следующий() Цикл
//		Если ВыборкаОрг.Пустышка И НЕ ФильтрПоМенеджеру Тогда
//			Продолжить;
//		КонецЕсли;
//		ОблОрг = Макет.ПолучитьОбласть("Орг");
//		ОблОрг.Параметры.Организация	= "Организация: " + ВыборкаОрг.Организация;
//		ЗПОбщееО = УстановитьПараметрыОбласти(ОблОрг.Параметры,ВыборкаОрг,"ИтогоЗПОрг",Истина);
//		Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
//			ОблОрг.Параметры.План					= Формат(ВыборкаОрг.СуммаПланаОрг,ЧФ000);
//			Если ВыборкаОрг.СуммаКоличествоПланОрг  = 0 Тогда
//				ОблОрг.Параметры.КоличествоПлан		= "";
//			Иначе
//				ОблОрг.Параметры.КоличествоПлан		= Формат(ВыборкаОрг.СуммаКоличествоПланОрг,ЧФ000);
//			КонецЕсли;
//			ОблОрг.Параметры.ПроцентРуководителя	= Формат(ВыборкаОрг.СуммаВознаграждения_РОПОрг,ЧФ000);
//			ОблОрг.Параметры.ПроцентПлана			= Формат(?(ВыборкаОрг.СуммаПланаОрг=0,0,ВыборкаОрг.СКВ/ВыборкаОрг.СуммаПланаОрг*100),ЧФ0);
//		КонецЕсли;
//		Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
//			ОблОрг.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаОрг.СКВ - ЗПОбщееО - ?(ВыборкаОрг.СуммаВознаграждения_РОПОрг = Null, 0, ВыборкаОрг.СуммаВознаграждения_РОПОрг),ЧФ000);
//		КонецЕсли;
//		Если РольДоступна("уб_ЗП_ПолныйДоступ")= Истина Тогда //Итоги по компании
//			ДокументРезультат.Вывести(ОблОрг,1,,Истина);
//		КонецЕсли;	
//		ВыборкаПодраздел = ВыборкаОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//		Пока ВыборкаПодраздел.Следующий() Цикл			
//			МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
//			Если МЗ = Неопределено Тогда
//				МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);
//				РуководительПодразделения = МЗ.Сотрудник;
//				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.ПолучаетВознаграждениеЗаРуководство;
//			Иначе
//				РуководительПодразделения = МЗ.Руководитель;
//				ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.РуководительПолучаетВознаграждение;
//			КонецЕсли;
//			//Если (ЗначениеЗаполнено(Подразделение) И ВыборкаПодраздел.Подразделение <> Подразделение)
//			//	Или (СписокПодразделений <> Неопределено И СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) = Неопределено)
//			//	Или (ФильтрПоМенеджеру И ВыборкаПодраздел.Пустышка И РуководительПодразделения <> Менеджер И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение)
//			//	Или ВыборкаПодраздел.Пустышка
//			//	Тогда
//			//	Продолжить
//			//КонецЕсли;		
//			Если ФильтрПоМенеджеру Тогда
//				Если ВыборкаПодраздел.Пустышка И РуководительПодразделения <> Менеджер И Не ПодразделениеАгента <> ВыборкаПодраздел.Подразделение Тогда
//					Продолжить;
//				КонецЕсли;	
//			Иначе
//				Если ВыборкаПодраздел.Пустышка Тогда
//					Продолжить;
//				КонецЕсли;
//			КонецЕсли;
//			НаименованиеПодразделения = "Подразделение: "+ВыборкаПодраздел.Подразделение.Наименование + ?(Не ЗначениеЗаполнено(РуководительПодразделения),""," (" + РуководительПодразделения.Наименование + ")");
//			ОблПодразделение = Макет.ПолучитьОбласть("Подразделение");
//			ОблПодразделение.Параметры.Подразделение	= НаименованиеПодразделения;
//			Если Не ПолныеПрава() Тогда
//				//скрываем показатели подразделения
//				РассчитатьПоказателиПодразделения = СписокПодразделений.НайтиПоЗначению(ВыборкаПодраздел.Подразделение) <> Неопределено;
//			Иначе
//				РассчитатьПоказателиПодразделения = Истина
//			КонецЕсли;
//			Если РассчитатьПоказателиПодразделения Тогда
//				ЗПОбщееП = УстановитьПараметрыОбласти(ОблПодразделение.Параметры,ВыборкаПодраздел,"ИтогоЗПпоПодразделению",Истина);
//				
//				Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда			
//					ОблПодразделение.Параметры.План				= Формат(ВыборкаПодраздел.СуммаПлана,ЧФ0);
//					Если ВыборкаПодраздел.СуммаКоличествоПлан = 0 Тогда
//						ОблПодразделение.Параметры.КоличествоПлан =	"";
//					Иначе
//						ОблПодразделение.Параметры.КоличествоПлан = Формат(ВыборкаПодраздел.СуммаКоличествоПлан,ЧФ000);
//					КонецЕсли;
//					ОблПодразделение.Параметры.ПроцентПлана     = Строка(Формат(ВыборкаПодраздел.ПроцентВыполненияПлана_РОП,ЧФ000));
//					ОблПодразделение.Параметры.СКВдоСП			= Формат(ВыборкаПодраздел.СКВ_ПоПодразделениямДоСП,ЧФ0);
//					Если ВыводитьКС Тогда
//						ОблПодразделение.Параметры.СКВ_КС		= Формат(ВыборкаПодраздел.СКВ_КС,ЧФ);
//						ОблПодразделение.Параметры.БОНУС_РОП_КС = Формат(ВыборкаПодраздел.БОНУС_РОП_КС,ЧФ);
//					КонецЕсли;	
//					
//					//МЗ = тзПодразделений.Найти(ВыборкаПодраздел.Подразделение,"Подразделение_ТПодразделений");
//					//Если МЗ = Неопределено Тогда
//					//	МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаНачала+1, ВыборкаПодраздел.Подразделение);//.Ссылка
//					//КонецЕсли;
//					
//					ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,ВыборкаПодраздел.СтавкаВознаграждения_РОП,0);
//					
//					ОблПодразделение.Параметры.ПроцентРуководителя	= Формат(ВыборкаПодраздел.СуммаВознаграждения_РОП,ЧФ000);
//					
//					ОблПодразделение.Параметры.ПроцентОтСКВМенеджеру = Формат(ПроцентРуководителя,"");
//				КонецЕсли;
//				
//				Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
//					ОблПодразделение.Параметры.СуммаДоходаБрокера	= Формат(?(ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению = Null, 0, ВыборкаПодраздел.СКВ_ДляПланаПоСКВ_ПоПодразделению) - ЗПОбщееП - ?(ВыборкаПодраздел.СуммаВознаграждения_РОП = Null, 0, ВыборкаПодраздел.СуммаВознаграждения_РОП),ЧФ000);
//				КонецЕсли;
//			КонецЕсли;
//			//область подразделения выводим позже
//			ОбластьПодразделениеВыведено = Ложь;
//			
//			///////////////// МЕНЕДЖЕР \\\\\\\\\\\\\\\\\
//			// заполнение строки макета МЕНЕДЖЕР	
//			ВыборкаМенеджер = ВыборкаПодраздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//			Пока ВыборкаМенеджер.Следующий() Цикл
//				Если ФильтрПоМенеджеру Тогда
//					Если ВыборкаМенеджер.Агент = Менеджер Тогда
//					ИначеЕсли ЭтоРуководитель Тогда
//						Если ВыборкаМенеджер.НеВыводить Или (Не ФильтрПоСпискуМенеджеров Или СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено) Тогда
//							Продолжить;
//						КонецЕсли;	
//					Иначе
//						Продолжить;
//					КонецЕсли;	
//				ИначеЕсли ФильтрПоСпискуМенеджеров Тогда
//					Если СписокМенеджеров.НайтиПоЗначению(ВыборкаМенеджер.Агент) = Неопределено Тогда
//						Продолжить
//					КонецЕсли;
//				Иначе
//					Если ВыборкаМенеджер.Пустышка И ВыборкаМенеджер.План = 0 Тогда //И НЕ ФильтрПоМенеджеру Тогда
//						Продолжить;
//					КонецЕсли;
//				КонецЕсли;	
//				Если Не ОбластьПодразделениеВыведено Тогда
//					ДокументРезультат.Вывести(ОблПодразделение,2,,Истина);
//					ОбластьПодразделениеВыведено = Истина;
//				КонецЕсли;
//				ОблМенеджер = Макет.ПолучитьОбласть("Менеджер");
//				ОблМенеджер.Параметры.Менеджер		= ВыборкаМенеджер.Агент;
//				
//				СтруктураПоискаМенеджера = Новый Структура;
//				СтруктураПоискаМенеджера.Вставить("Менеджер", ВыборкаМенеджер.Агент);
//				Строки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоискаМенеджера);
//				Если Строки.Количество() > 0 Тогда
//					НайденнаяСтрокаМенеджера = Строки[0];
//					Если НайденнаяСтрокаМенеджера.РаскраситьПолеМенеджера = Истина Тогда
//						Область = ОблМенеджер.НайтиТекст("[Менеджер]");
//						Если Область <> Неопределено Тогда
//							Область.ЦветТекста = Новый Цвет(255,0,0);
//						КонецЕсли;
//					КонецЕсли;
//					
//					Если НайденнаяСтрокаМенеджера.РаскраситьПлан = Истина Тогда
//						Область = ОблМенеджер.НайтиТекст("[План]");
//						Если Область <> Неопределено Тогда
//							Область.ЦветТекста = Новый Цвет(255,0,0);
//						КонецЕсли;
//					КонецЕсли;
//					
//					Если НайденнаяСтрокаМенеджера.РаскраситьКоличественныйПлан = Истина Тогда
//						Область = ОблМенеджер.НайтиТекст("[КоличествоПлан]");
//						Если Область <> Неопределено Тогда
//							Область.ЦветТекста = Новый Цвет(255,0,0);
//						КонецЕсли;
//					КонецЕсли;
//				КонецЕсли;
//				
//				ЗПОбщее = УстановитьПараметрыОбласти(ОблМенеджер.Параметры,ВыборкаМенеджер,"ИтогоЗП",Истина);
//				
//				Отбор = Новый Структура();
//				Отбор.Вставить("Агент",ВыборкаМенеджер.Агент);
//				Строки = тзСхемаРасчетаДляАгентов.НайтиСтроки(Отбор);
//				СписокСхем = "";
//				Если Строки.Количество() > 0 Тогда
//					Для каждого Стр Из Строки Цикл
//						СписокСхем = СписокСхем + ?(СписокСхем = "","", ", ") + Строка(Стр.СхемаРасчетаСМенеджером);
//					КонецЦикла;
//				КонецЕсли;
//				ОблМенеджер.Параметры.СхемаРасчетаСМенеджером = СписокСхем;
//				//ПроцентРуководителя = ?(ПолучаетВознаграждениеЗаРуководствоОтделом,?(ВыборкаМенеджер.СтавкаВознаграждения_РОП = Null, 0, ВыборкаМенеджер.СтавкаВознаграждения_РОП),0);
//				//ВознаграждениеРук = Число(ВыборкаМенеджер.ВознаграждениеРуководителя);//ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту*ПроцентРуководителя/100;
//				
//				Если ОтображатьКолонкиДляСхемыПланПоСКВ Тогда
//					ОблМенеджер.Параметры.ПроцентРуководителя = ВыборкаМенеджер.ВознаграждениеРуководителя;
//					ОблМенеджер.Параметры.План			= Формат(ВыборкаМенеджер.План,ЧФ0);
//					Если ВыборкаМенеджер.Количество = 0 Тогда
//						ОблМенеджер.Параметры.КоличествоПлан = "";
//					Иначе
//						ОблМенеджер.Параметры.КоличествоПлан = Формат(ВыборкаМенеджер.Количество,ЧФ000);
//					КонецЕсли;
//					ОблМенеджер.Параметры.ПроцентПлана	= Формат(?(ВыборкаМенеджер.План=0,0,ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту/ВыборкаМенеджер.План*100),ЧФ0);
//					
//					Если НЕ ТипЗнч(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту)= Тип("Null") Тогда
//						ОблМенеджер.Параметры.ПроцентОтСКВМенеджеру = ВыборкаМенеджер.СтавкаВознаграждения;
//					КонецЕсли;
//					
//					СКВ_БЕЗ_КС = ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту-ВыборкаМенеджер.СКВ_КС;
//					Если РежимДвухБП Тогда
//						ОблМенеджер.Параметры.ПерваяБонусПланка					= Формат(ВыборкаМенеджер.ПерваяБонусПланка,ЧФ0);
//						ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
//						ОблМенеджер.Параметры.СКВдоСП                           = Формат(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.ПерваяБонусПланка),ЧФ);
//						ОблМенеджер.Параметры.СуммаОтСКВ                        = Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
//						Если ВыборкаМенеджер.ВыполненПланПоСКВ Тогда
//							ОблМенеджер.Параметры.Превышение1БП                     = Формат(Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0),ЧФ);
//							Если Макс(Мин(СКВ_БЕЗ_КС,ВыборкаМенеджер.СуперПлан)-ВыборкаМенеджер.ПерваяБонусПланка,0) > 0 Тогда
//								ОблМенеджер.Область("ПроцентПервойБП").Примечание.Текст = "Процентная ставка от суммы превышения min Бонус планки = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеПервойБонусПланки);	
//							КонецЕсли;
//						Иначе
//							ОблМенеджер.Параметры.СКВдоСП = СКВ_БЕЗ_КС;//
//						КонецЕсли;	
//						ОблМенеджер.Параметры.МенеджеруЗаПревышени1БП           = Формат(ВыборкаМенеджер.ЗПЗаПревышение1БП,ЧФ);
//						
//						//-Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
//						//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
//						//Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
//						ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
//						ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
//						
//					Иначе	
//						ОблМенеджер.Параметры.Суперплан							= Формат(ВыборкаМенеджер.Суперплан,ЧФ0);
//						ОблМенеджер.Параметры.СуммаОтСКВ						= Формат(ВыборкаМенеджер.ЗПотСКВдоСуперПлана,ЧФ0);
//						ОблМенеджер.Параметры.СКВдоСП							= Формат(Мин(СКВ_БЕЗ_КС, ВыборкаМенеджер.Суперплан),ЧФ0);
//						ОблМенеджер.Параметры.ПревышениеСуперплана				= Формат(ВыборкаМенеджер.ПревышениеСуперплана,ЧФ);
//						ОблМенеджер.Параметры.МенеджеруЗаПревышениеСуперплана	= Формат(ВыборкаМенеджер.ЗПотЗаПревышениеСуперПлана,ЧФ);
//					КонецЕсли;	
//					Если ВыводитьКС Тогда
//						ОблМенеджер.Параметры.Бонус_КС	= Формат(ВыборкаМенеджер.Бонус_КС,ЧФ);
//						ОблМенеджер.Параметры.СКВ_КС	= Формат(ВыборкаМенеджер.СКВ_КС,ЧФ);
//					КонецЕсли;	
//					Если ВыборкаМенеджер.ПревышениеСуперплана > 0 Тогда
//						Если ВыводитьПримечанияКВМВячейки Тогда
//							ОблМенеджер.Параметры.ПримечаниеКВМ	= "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);
//						КонецЕсли;
//						ОблМенеджер.Область("ПримечаниеПроцент"+?(РежимДвухБП,"201212","")).Примечание.Текст = "Процентная ставка от суммы превышения суперплана = "+Строка(ВыборкаМенеджер.ПроцентнаяСтавкаПослеСуперПлана);	
//					КонецЕсли;
//				КонецЕсли;
//				Если НЕ СкрыватьКолонкиДСП И ДБЕсть Тогда
//					//ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее - ВознаграждениеРук,ЧФ000);
//					ОблМенеджер.Параметры.СуммаДоходаБрокера	= Формат(ВыборкаМенеджер.СКВ_ДляПланаПоСКВ_ПоАгенту - ЗПОбщее,ЧФ000);
//				КонецЕсли;
//				
//				Если НЕ ОтображатьТолькоФамилии И НЕ СкрыватьКолонкиДСП Тогда
//					ОблМенеджер.Параметры.Подразделение = ВыборкаМенеджер.Подразделение;//уб_СС.ПолучитьПодразделениеАгента(ВыборкаМенеджер.Агент, КонецМесяца(ЗарплатныйПериод));
//				КонецЕсли;
//				ДокументРезультат.Вывести(ОблМенеджер,3,Строка(ВыборкаМенеджер.Подразделение),Истина);												
//				/////////////////// ВидСП \\\\\\\\\\\\\\\\\\\
//				// Заполнение строки макета ВидСП
//				ВыборкаВидСП 	= ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//				Пока ВыборкаВидСП.Следующий() Цикл					
//					Если РежимОтчета = 1 Тогда
//						Если ВыборкаВидСП.НеВыводить Тогда
//							Продолжить;
//						КонецЕсли;
//					Иначе
//						Если ВыборкаВидСП.Пустышка Тогда
//							Продолжить;
//						КонецЕсли;	
//					КонецЕсли;
//					#Если Клиент Тогда
//						ОбработкаПрерыванияПользователя();
//					#КонецЕсли
//					ОблВидСП = Макет.ПолучитьОбласть("ВидСП");
//					ОблВидСП.Параметры.ВидСП		= ВыборкаВидСП.ВидСП;
//					УстановитьПараметрыОбласти(ОблВидСП.Параметры,ВыборкаВидСП);
//					Если ВыводитьКС Тогда
//						ОблВидСП.Параметры.Бонус_КС	= Формат(ВыборкаВидСП.Бонус_КС,ЧФ);
//						ОблВидСП.Параметры.СКВ_КС	= Формат(ВыборкаВидСП.СКВ_КС,ЧФ);
//					КонецЕсли;	
//					
//					Если Не ОтображатьТолькоФамилии Тогда  
//						
//						Если Не ЗначениеЗаполнено(Страхователь) Тогда
//							ДокументРезультат.Вывести(ОблВидСП,4,Строка(ВыборкаМенеджер.Агент),Истина);
//						КонецЕсли;
//						
//					КонецЕсли;				
//					СчВидаСП = 0;
//					ВыбСтр 	= ВыборкаВидСП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);					
//					////////////////// СТРОКА \\\\\\\\\\\\\\\\\\\\
//					// Заполнение строки макета СТРОКА
//					Пока ВыбСтр.Следующий() Цикл
//						#Если Клиент Тогда
//							ОбработкаПрерыванияПользователя();
//						#КонецЕсли
//						ПолисАннулирован = ?(ВыбСтр.ПолисАннулирован = Неопределено, Ложь, ВыбСтр.ПолисАннулирован);
//						//при сравнении двух дат с галочкой "отображать только оплаты где изменился СКВ" ПолисАннулирован = Неопределено
//						Если Не ОтображатьАннулированныеОплаты И ПолисАннулирован И ВыбСтр.СКВ = 0 И ВыбСтр.ВознаграждениеМенеджера = 0 Тогда
//							Продолжить
//						КонецЕсли;
//						Если РежимОтчета = 1 Тогда
//							Если ВыбСтр.НеВыводить Тогда
//								Продолжить;
//							ИначеЕсли ЗначениеЗаполнено(ВыбСтр.Ссылка)=Ложь Тогда
//								Продолжить;
//							КонецЕсли;
//						Иначе
//							Если ВыбСтр.Пустышка Тогда
//								Продолжить;
//							КонецЕсли;
//						Конецесли;						
//						СчНом = СчНом + 1;
//						//ИндикаторСтеп();
//						СчВидаСП = СчВидаСП + 1;						
//						Обл = Макет.ПолучитьОбласть("Строка");
//						Обл.Параметры.ЗначРасшифровки 			= Новый Структура("Ссылка", ВыбСтр.Ссылка);
//						Обл.Параметры.Ном						= Формат(СчНом,"ЧЦ=10; ЧГ=");
//						Попытка
//							Обл.Параметры.НомерОплаты				= ВыбСтр.НомерОплаты;//СчВидаСП;
//							Обл.Параметры.НомСп				        = СчВидаСП;
//						Исключение
//						КонецПопытки;	
//						
//						Обл.Параметры.ДатаОплаты				= ВыбСтр.Дата;
//						Обл.Параметры.СК						= ВыбСтр.СК;
//						Обл.Параметры.СтраховойПродукт			= ВыбСтр.СтраховойПродукт;
//						Обл.Параметры.НомерЗаявки				= ВыбСтр.НомерЗаявки;
//						Обл.Параметры.ВМ						= Формат(ВыбСтр.ВознаграждениеМенеджера,ЧФ);
//						Если ВыводитьКС Тогда
//							Обл.Параметры.Бонус_КС				= Формат(ВыбСтр.Бонус_КС,ЧФ);
//							Обл.Параметры.СКВ_КС				= Формат(ВыбСтр.СКВ_КС,ЧФ);
//							Если ВыбСтр.СКВ_КС > 0 Тогда
//								Для Каждого ПодОбласть Из Обл.Области Цикл 
//									ПодОбласть.ЦветФона = Новый Цвет(200, 255, 200); // Светло-зеленый
//								КонецЦикла;	 
//								Обл.Область("Бонус_КС").Примечание.Текст = " ("+ВыборкаМенеджер.СтавкаВознаграждения+"+"+ВыбСтр.БонусПроцент+")%"+" "+?(ВыбСтр.Сделка.Дата = Дата(1,1,1),"Автоматически определенная крупная сделка",ВыбСтр.Сделка);
//							ИначеЕсли ПолисАннулирован Тогда
//								Для Каждого ПодОбласть Из Обл.Области Цикл
//									ЦветАннулированногоПолиса = Новый Цвет(252, 226, 192);
//									ПодОбласть.ЦветФона = ЦветАннулированногоПолиса;
//								КонецЦикла;
//							КонецЕсли;	
//						КонецЕсли;	
//						Если НЕ ОтображатьТолькоФамилии Тогда
//							Обл.Параметры.Страхователь				= ВыбСтр.Страхователь;
//							Обл.Параметры.НомерПолиса				= СокрЛП(ВыбСтр.НомерПолиса);
//							Обл.Параметры.НомерКвитанции			= ВыбСтр.НомерКвитанции;
//							Обл.Параметры.ПолнаяПремия				= Формат(ВыбСтр.ПолнаяПремия,ЧФ0);
//							Если ВыбСтр.НомерВзноса <> Неопределено ИЛИ ВыбСтр.НачисленнаяСуммаВзноса <> Неопределено Тогда
//								Если ВыбСтр.НомерВзноса = 1 И ВыбСтр.ПолнаяПремия = ВыбСтр.НачисленнаяСуммаВзноса Тогда
//									Обл.Параметры.НомерВзноса = "П";
//								Иначе
//									Обл.Параметры.НомерВзноса = Строка(ВыбСтр.НомерВзноса) + " взн";
//								КонецЕсли;
//								Обл.Параметры.ОплаченоФакт			= Формат(ВыбСтр.ОплаченоФакт,ЧФ000);
//								Обл.Параметры.АВилиСкидкаПроцент	= ВыбСтр.АВилиСкидкаПроцент;
//								Обл.Параметры.АВилиСкидкаСумма		= Формат(ВыбСтр.АВилиСкидкаСумма,ЧФ);
//								Обл.Параметры.Комментарий			= ВыбСтр.Комментарий;        
//								Обл.Параметры.ДатаПолиса			= ВыбСтр.ДатаПолиса;
//							КонецЕсли;
//						КонецЕсли; 
//						Обл.Параметры.НачисленнаяСуммаВзноса	= Формат(ВыбСтр.НачисленнаяСуммаВзноса,ЧФ0);
//						Обл.Параметры.СобранаяКВ				= Формат(ВыбСтр.СКВ,ЧФ0);
//						Если ВыбСтр.КоличествоФакт = 0 Тогда
//							Обл.Параметры.КоличествоФакт		= "";
//						Иначе
//							Обл.Параметры.КоличествоФакт		= Формат(ВыбСтр.КоличествоФакт,ЧФ000);
//						КонецЕсли;
//						Обл.Параметры.СхемаРасчетаСМенеджером	= ВыбСтр.СхемаРасчетаСМенеджером;
//						Если НЕ СкрыватьКолонкиДСП Тогда
//							Если НЕ ОтображатьТолькоФамилии Тогда
//								Обл.Параметры.Подразделение			= ВыбСтр.Подразделение;
//								Обл.Параметры.НаправлениеПлатежа	= ВыбСтр.НаправлениеПлатежа;
//								Обл.Параметры.КВПроцент				= ВыбСтр.КВПроцент;
//								Обл.Параметры.КВСумма				= Формат(ВыбСтр.КВСуммаДляАгента,ЧФ);
//								Обл.Параметры.КВПроцентДляОтчета	= ВыбСтр.КВПроцентДляОтчета;        
//								Если ВыбСтр.КВПодВопросом Тогда
//									Обл.Области.КВПроцент.ЦветФона = WebЦвета.Желтый;
//									Обл.Области.КВПроцент.Примечание.Текст = "КВ под вопросом";
//								КонецЕсли;
//								Обл.Параметры.Ссылка				= ВыбСтр.Ссылка;
//								Обл.Параметры.Ссылка_Строка = "Оплата "+ВыбСтр.Номер+ " от "+Формат(ВыбСтр.Дата,"ДФ=dd.MM.yy");
//							КонецЕсли;
//						КонецЕсли;						
//						Обл.Параметры.ВычетСАгента			= Формат(?(ВыбСтр.ВычетСАгента = Null, 0, -ВыбСтр.ВычетСАгента),ЧФ);;
//						ИнфоКВМ = СоотвИнфоКВМ.Получить(ВыбСтр.Номер);
//						Если ВыбСтр.ИсключитьИзРасчетаЗП <> Неопределено Тогда
//							Если ВыбСтр.ИсключитьИзРасчетаЗП Тогда
//								Обл.Области.ПолеСтроки.Узор = ТипУзораТабличногоДокумента.Узор3;
//								Обл.Области.ПолеСтроки.ЦветУзора = новый Цвет(255, 50, 50);
//							КонецЕсли;
//						КонецЕсли;
//						Если ИнфоКВМ <> Неопределено Тогда
//							Если ВыводитьПримечанияКВМВячейки Тогда
//								Обл.Параметры.ПримечаниеКВМ	= ИнфоКВМ;
//							Иначе
//								Обл.Область("ПримечаниеКВМ").Примечание.Текст = ИнфоКВМ;
//							КонецЕсли;
//						КонецЕсли;
//						Если ВыбСтр.БонусМенеджеру <> Неопределено ИЛИ ВыбСтр.ВидРасчетаСАгентом <> Неопределено Тогда
//							
//							Если ВыбСтр.БонусМенеджеру Тогда
//								Обл.Область("ПримечаниеКВМ").ЦветФона = цЖелтенький;
//								Обл.Область("ПримечаниеКВМ").Примечание.Текст = "Есть бонус менеджера";
//							КонецЕсли;
//							
//							Если ВыбСтр.ВидРасчетаСАгентом = кРасчетПоАВ Тогда
//								Обл.Область("СтрокаОтчета").ЦветФона = новый Цвет(245,200,150);
//								Обл.Область("СтрокаОтчета").Примечание.Текст = "Расчет по схеме";
//							КонецЕсли;
//						КонецЕсли;
//						
//						Если НЕ ОтображатьТолькоФамилии Тогда
//							
//							Если Не ЗначениеЗаполнено(Страхователь) Или ВыбСтр.Страхователь = Страхователь Тогда
//								
//								ДокументРезультат.Вывести(Обл,4,Строка(ВыборкаВидСП.ВидСП) + ", " + Строка(ВыборкаМенеджер.Агент),Истина);
//								
//							КонецЕсли;
//							
//						КонецЕсли;
//						
//					КонецЦикла;							
//				КонецЦикла;
//			КонецЦикла;
//		КонецЦикла;
//		
//		//ИндикаторСкрыть();
//		
//	КонецЦикла;
//	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
//	
//КонецПроцедуры


Функция ВыполнениеПланаМенеджерами(МассивМенеджеров, Период) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ЗП_ВыполнениеПланаМенеджерами.ВыполненПлан,
	|	уб_ЗП_ВыполнениеПланаМенеджерами.Менеджер
	|ИЗ
	|	РегистрСведений.уб_ЗП_ВыполнениеПланаМенеджерами КАК уб_ЗП_ВыполнениеПланаМенеджерами
	|ГДЕ
	|	уб_ЗП_ВыполнениеПланаМенеджерами.Менеджер В (&МассивМенеджеров)
	|	И НАЧАЛОПЕРИОДА(уб_ЗП_ВыполнениеПланаМенеджерами.ПериодЗП, МЕСЯЦ) = &ПериодЗП");
	Запрос.УстановитьПараметр("МассивМенеджеров",	МассивМенеджеров);
	Запрос.УстановитьПараметр("ПериодЗП",			НачалоМесяца(Период));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	
КонецФункции

//Пересчет сумм, переустановка схем оплаты
Процедура ПересчитатьСуммыПоЗП(РезультатЗапроса) Экспорт 
	
	СоотвИнфоКВМ = Новый Соответствие;			
	ВыборкаОплат = РезультатЗапроса.Выбрать();
	//ИндикаторИнициализировать(ВыборкаОПлат.Количество());
	ДанныеПоЗПМенеджерам = уб_РасчетыСМенеджерами.РасчетЗП_Быстро(ЗарплатныйПериод);
	Пока ВыборкаОПлат.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		ДО = ВыборкаОплат.Ссылка.ПолучитьОбъект(); 
		Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
		Параметры.ДанныеПоЗПМенеджерам = ДанныеПоЗПМенеджерам;
		уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ДО,,, Параметры);
		ИнфоКВМ = Параметры.ИнфоКВМ;
		СоотвИнфоКВМ.Вставить(ДО.Номер, Параметры.ИнфоКВМ);		
		Если ДО.Модифицированность() Тогда
			Попытка
				ДО.Записать();	
			Исключение
				Сообщить("Не удалось записать оплату номер: " + ДО.Номер + ". " + ОписаниеОшибки());	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьДельтыКВ(РезультатЗапроса) Экспорт 
	
	СоотвИнфоКВМ = Новый Соответствие;			
	ВыборкаОплат = РезультатЗапроса.Выбрать();
	//ИндикаторИнициализировать(ВыборкаОПлат.Количество());
	//ДанныеПоЗПМенеджерам = уб_РасчетыСМенеджерами.РасчетЗП_Быстро(ЗарплатныйПериод);
	Пока ВыборкаОПлат.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние ("Пересчет АВ");
		#КонецЕсли
		_СуммаФикс = 0;
		_ВычетСАгента = 0;
		
		ДО = ВыборкаОплат.Ссылка.ПолучитьОбъект(); 
		
		
		Источник = уб_РасчетыСМенеджерами.ПолучитьИсточникЗаявки(ДО.СтраховойПолис);
		Если ЗначениеЗаполнено(Источник) и ДО.Агент<>Источник Тогда
			
			_ВидСп = ДО.ВидСП;
			//Вариант 1
			Если _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКОПП Тогда
				_ВычетСАгента = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетПоИсточникуКАСКО",Источник,ДО.ЗарплатныйПериод,0);
			ИначеЕсли _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда
				_ВычетСАгента = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетПоИсточникуОСАГО",Источник,ДО.ЗарплатныйПериод,0);	
			Иначе
				//Если вычет установлен руками, он должен быть заблокирован "ПроверенаЗП", иначе вычет обнулится
				_ВычетСАгента = 0;
			КонецЕсли;	
			//УстЗнч(ОП, "ВычетСАгента", _ВычетСАгента, РасчетныеПоля.бЗаблокирована);
			
			//Вариант 2
			Если _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО
				или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО
				или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКОПП
				Тогда
				_СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетСКВПоИсточникуКАСКО",Источник,ДО.ЗарплатныйПериод,-1);
			ИначеЕсли _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО
				или _ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО
				Тогда
				_СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетСКВПоИсточникуОСАГО",Источник,ДО.ЗарплатныйПериод,-1);
			Иначе
				_СуммаФикс = 0;
			КонецЕсли;
			//Вариант 3
			Если _СуммаФикс = 0 Тогда
				_СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("СуммаФикс",ДО.Агент,ДО.ЗарплатныйПериод,-1);
			КонецЕсли;	
		КонецЕсли;	
		Если _СуммаФикс>0 или _ВычетСАгента>0 Тогда
			//прочие сложные расчеты здесь не трогаем
		Иначе
			
			тзДельта = уб_СтраховойБрокер.ПолучитьДельтуКВ(
			ДатаНачала, 
			Перечисления.уб_НазначенияКВ.ДляМенеджера,
			ДО.Подразделение.Владелец,
			ДО.Подразделение,
			ДО.Агент, 
			ДО.Поставщик, 
			ДО.ОрганизацияАгент, 
			ДО.СК, 
			ДО.ВидСП, 
			ДО.СтраховойПродукт 
			);
			
			//Если ДО.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ
			//и НЕ (ДО.ВидС = Перечисления.уб_ВидыСтрахования.ВЗР
			//ИЛИ ДО.ВидС = Перечисления.уб_ВидыСтрахования.Ипотека)
			//и ДО.ЗарплатныйПериод>=Дата(2026,1,1)	 
			//и ДО.ФормаОплаты     = Перечисления.уб_ФормыОплаты.Поставщику
			//Тогда
			//	Дельта = 9;
			//Иначе	
				Дельта = 6; //Для данного значения Дельта значение АВ везде будет равно 0
				Если тзДельта.Количество() > 0 Тогда
					Дельта = тзДельта[0].Дельта;
				КонецЕсли;	

			//КонецЕсли;	
						
			ТекДельта = ДО.КВПроцент-ДО.КВПроцентДляАгента;
			Если ТекДельта >= Дельта Тогда
			Иначе
				Если ДО.КВПроцент>Дельта Тогда
					_КВПроцентДляАгента = ДО.КВПроцент-Дельта;
				Иначе
					_КВПроцентДляАгента = 0;
				КонецЕсли;	
				_КВСуммаДляАгента    = ОКР(До.НачисленнаяСуммаВзноса*_КВПроцентДляАгента/100,2);
				
				_АВилиСкидкаСумма = ДО.НачисленнаяСуммаВзноса-ДО.ОплаченоФакт;
				
				Если _АВилиСкидкаСумма> _КВСуммаДляАгента Тогда
					//_КВПроцентДляАгента  = _КВПроцентДляАгента;
					//_КВСуммаДляАгента = _КВСуммаДляАгента;
					//до.АВилиСкидкаСумма	2 503.74	Число
					_СкидкаВыплаченаяКлиенту = _КВСуммаДляАгента-_АВилиСкидкаСумма;
					_АВилиСкидкаСумма = _КВСуммаДляАгента;					
				Иначе	
					_АВилиСкидкаСумма = Макс(_АВилиСкидкаСумма,_КВСуммаДляАгента);
					_СкидкаВыплаченаяКлиенту =_АВилиСкидкаСумма;
				КонецЕсли;	
				
				_АВилиСкидкаПроцент = Окр(?(ДО.НачисленнаяСуммаВзноса=0,100,_АВилиСкидкаСумма*100/ДО.НачисленнаяСуммаВзноса),2); 
					
				//Если  (_КВПроцентДляАгента <> ДО.КВПроцентДляАгента Или _АВилиСкидкаСумма<> ДО.АВилиСкидкаСумма )и  ДО.ПроверенаЗП = Ложь Тогда
				Если  (_КВПроцентДляАгента <> ДО.КВПроцентДляАгента Или _АВилиСкидкаСумма<> ДО.АВилиСкидкаСумма )и  ДО.НеМенятьАВ = Ложь Тогда
					ДО.КВПроцентДляАгента  = _КВПроцентДляАгента;
					ДО.КВСуммаДляАгента    = _КВСуммаДляАгента;//ОКР(До.НачисленнаяСуммаВзноса*ДО.КВПроцентДляАгента/100,2);
					ДО.АВилиСкидкаПроцент  = _АВилиСкидкаПроцент;
					ДО.АВилиСкидкаСумма  = _АВилиСкидкаСумма;
					ДО.ВМРасчетное      = ДО.КВСуммаДляАгента;
					ДО.ДБ                  = ДО.КВСумма - ДО.АВилиСкидкаСумма;// + ДО.ВычетСАгента;
					ДО.СкидкаВыплаченаяКлиенту = _СкидкаВыплаченаяКлиенту;
					//Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
					////	Параметры.ДанныеПоЗПМенеджерам = ДанныеПоЗПМенеджерам;
					//уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ДО,,, Параметры);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	
		//Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
		//Параметры.ДанныеПоЗПМенеджерам = ДанныеПоЗПМенеджерам;
		//уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ДО,,, Параметры);
		//ИнфоКВМ = Параметры.ИнфоКВМ;
		//СоотвИнфоКВМ.Вставить(ДО.Номер, Параметры.ИнфоКВМ);		
		Если ДО.Модифицированность() Тогда
			Попытка
				ДО.Записать();	
			Исключение
				Сообщить("Не удалось записать оплату номер: " + ДО.Номер + ". " + ОписаниеОшибки());	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Создает пустую таблицу с добавленными колонками
//Функция СоздатьТаблицу()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//	|	ОП.*,
//	|	ОП.Подразделение.Владелец КАК Организация,
//	|	0 КАК СКВ,
//	|	ОП.СтраховойПолис.СК КАК СП_СК,
//	|	ОП.СтраховойПолис.СтраховойПродукт.Вид КАК СП_ВидСП,
//	|	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
//	|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
//	|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
//	|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
//	|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
//	|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
//	|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
//	|	ОП.СтраховойПолис.Сделка Как Сделка, 
//	|   ОП.СтраховойПолис.Сделка.Дата как ДатаСделки,
//	|   ОП.СтраховойПолис.Сделка.БонусПроцент как БонусПроцент,
//	|   ОП.СтраховойПолис.Сделка.БонусПроцентРОП как БонусПроцентРОП,
//	|   0 Как КоличествоФакт,
//	|   1 КАК ЕД
//	|ИЗ
//	|	Документ.уб_ОплатаПолисов КАК ОП ";
//	ТЗ1	= Запрос.Выполнить().Выгрузить();
//	ТЗ1.Очистить();
//	Возврат ТЗ1;
//	
//КонецФункции		

Функция ПолучитьСоответствиеОрганизацийПодразделениям()
	//
	Запрос = Новый Запрос (
	"ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка Подразделение,
	|	ПодразделенияОрганизаций.Владелец как Организация
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций");
	Выборка = Запрос.Выполнить().Выбрать();
	Соответствие = Новый Соответствие;
	ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
	Соответствие.Вставить(0,ПустаяОрганизация);
	Соответствие.Вставить(NULL,ПустаяОрганизация);
	Соответствие.Вставить(Неопределено,ПустаяОрганизация);
	Соответствие.Вставить(Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),ПустаяОрганизация);	
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Подразделение,Выборка.Организация);
	КонецЦикла;	
	Возврат Соответствие;
	
Конецфункции	


Функция ПолныеПрава() Экспорт
	
	Возврат уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") 
	ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ПравкаПлановПоСКВ",ЛОЖЬ) = ИСТИНА
	ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ВыставлятьШтрафы, Ложь) = ИСТИНА;
	
КонецФункции // ПолныеПрава()

Функция ПолучитьШтрафнойПлан(Агент,Дата)
//
Запрос = Новый запрос("ВЫБРАТЬ
                      |	ЕСТЬNULL(СУММА(уб_Штрафы.СуммаШтрафа), 0) КАК СуммаШтрафа
                      |ИЗ
                      |	РегистрСведений.уб_Штрафы КАК уб_Штрафы
                      |ГДЕ
                      |	уб_Штрафы.Штраф = ЗНАЧЕНИЕ(Справочник.уб_ШтрафныеСанкции.ШтрафнойПлан)
                      |	И уб_Штрафы.Физлицо = &Физлицо
                      |	И НАЧАЛОПЕРИОДА(уб_Штрафы.ДатаШтрафа, МЕСЯЦ) = &Период");
ШтрафнойПлан = 0;				  
Запрос.УстановитьПараметр("Физлицо",Агент);
Запрос.УстановитьПараметр("Период",НачалоМесяца(Дата));
//Запрос.УстановитьПараметр("","");
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ШтрафнойПлан = Выборка.СуммаШтрафа;
КонецЕсли;	
Возврат ШтрафнойПлан;
КонецФункции

Функция ДайЗарплатныйПериод() Экспорт
	//	Если ЗначениеНеЗаполнено(ЗарплатныйПериод) Тогда
	//		Возврат НачалоДня(КонецМесяца(?(мОграничениеПоАгенту,ДатаСоздания,?(ЗначениеНеЗаполнено(Дата),ДатаСоздания,Дата))));
	//	Иначе
	Возврат НачалоМесяца(ЗарплатныйПериод);	
	//	КонецЕсли;
КонецФункции

Процедура СформироватьОтчет(фТЗОплат=Неопределено,фТЗАгентов=Неопределено,фтзПодразделений=Неопределено,фтзСхемаРасчетаДляАгентов=Неопределено, ДокументРезультат) Экспорт 
	
	Если Не ЗначениеЗаполнено(ЗарплатныйПериод) Тогда
		ЗарплатныйПериод = НачалоДня(КонецМесяца(ТекущаяДата()));
	КонецЕсли;	
	Этап = 0;
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	ДокументРезультат.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;

	Если РежимОтчета = 1 Тогда
		Если ДатаСреза1 = ДатаСреза2 Тогда
			КоличествоЭтапов = 6;
		Иначе
			КоличествоЭтапов = ?(ЗначениеЗаполнено(ДатаСреза1),7,6)+?(ЗначениеЗаполнено(ДатаСреза2),7,6);
		КонецЕсли;	
		ПересчитыватьСуммыВОплатах = Ложь;	
		ТЗ1  = Новый ТаблицаЗначений; ТЗАгентов = Новый ТаблицаЗначений;	тзПодразделений = Новый ТаблицаЗначений; тзСхемаРасчетаДляАгентов = Новый ТаблицаЗначений; 
		ТЗ1_ = Новый ТаблицаЗначений; ТЗАгентов_ = Новый ТаблицаЗначений;	тзПодразделений_ = Новый ТаблицаЗначений; тзСхемаРасчетаДляАгентов_ = Новый ТаблицаЗначений; 
		ТЗИнтервалов = Новый ТаблицаЗначений; ТЗИнтервалов_ = Новый ТаблицаЗначений;
		тзАгентовДляРаскраски = Неопределено;
		_тзАгентовДляРаскраски = Неопределено;
		//тзАгентовДляРаскраски = Новый ТаблицаЗначений;
		//тзАгентовДляРаскраски.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		//тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПолеМенеджера",Новый ОписаниеТипов("Булево"));
		//тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПлан",Новый ОписаниеТипов("Булево"));
		//тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьКоличественныйПлан",Новый ОписаниеТипов("Булево"));
		//_тзАгентовДляРаскраски = Новый ТаблицаЗначений;
		//_тзАгентовДляРаскраски.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		//_тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПолеМенеджера",Новый ОписаниеТипов("Булево"));
		//_тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПлан",Новый ОписаниеТипов("Булево"));
		//_тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьКоличественныйПлан",Новый ОписаниеТипов("Булево"));
		ДатаСреза = ДатаСреза1;
		РассчитатьТаблицы(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски,ТЗИнтервалов);
		//ТЗ1.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Булево"));
		Если НЕ ДатаСреза1 = ДатаСреза2 Тогда
			ДатаСреза = ДатаСреза2;
			РассчитатьТаблицы(ТЗ1_,ТЗАгентов_,тзПодразделений_,тзСхемаРасчетаДляАгентов_, _тзАгентовДляРаскраски,ТЗИнтервалов_);
			//ТЗ1_.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		Если ТолькоСОтличиями И НЕ ДатаСреза1=ДатаСреза2 Тогда
			ТЗ1.Индексы.Добавить("Ссылка");
			ТЗ1_.Индексы.Добавить("Ссылка");
			ТЗ1.Индексы.Добавить("СКВ");
			ТЗ1_.Индексы.Добавить("СКВ");
			ТЗ1.Индексы.Добавить("Агент");
			ТЗ1_.Индексы.Добавить("Агент");
			ТЗ1.Индексы.Добавить("ВычетСАгента");
			ТЗ1_.Индексы.Добавить("ВычетСАгента");
			ТЗ1.Индексы.Добавить("ВознаграждениеМенеджера");
			ТЗ1_.Индексы.Добавить("ВознаграждениеМенеджера");
			ВсегоСтрок = ТЗ1.Количество();
			Для СчетчикСтрок = 1 по ВсегоСтрок Цикл
				#Если Клиент Тогда
					ОбработкаПрерыванияПользователя();
				#КонецЕсли
				Строка = ТЗ1[ВсегоСтрок-СчетчикСтрок];
				СтруктураПоиска = Новый Структура("Ссылка,СКВ,Агент,ВычетСАгента,ВознаграждениеМенеджера,КВСуммаДляАгента,АВилиСкидкаСумма",Строка.Ссылка,Строка.СКВ,Строка.Агент,Строка.ВычетСАгента,Строка.ВознаграждениеМенеджера,Строка.КВСуммаДляАгента,Строка.АВилиСкидкаСумма);
				Массив = ТЗ1_.НайтиСтроки(СтруктураПоиска);
				Если Массив.Количество()= 0 Тогда
					//
					ф =1;
				Иначе
					Массив[0].НеВыводить = 1;
					Строка.НеВыводить = 1;
					//ТЗ1_.Удалить(Массив[0]);
					//ТЗ1.Удалить(Строка);
				КонецЕсли;	
			КонецЦикла;	
			Если ТЗ1.Количество() = 0 и ТЗ1_.Количество() = 0 Тогда
				//Предупреждение("Отличий не обнаружено, пустые таблицы!");
				//Возврат;
			Иначе	
				//Если Постарому Тогда
				//	ВывестиОтчетСтарый(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза1, тзАгентовДляРаскраски);
				//	Если НЕ ДатаСреза1 = ДатаСреза2 Тогда
				//		ВывестиОтчетСтарый(ДокументРезультат,ТЗ1_,ТЗАгентов_,тзПодразделений_,тзСхемаРасчетаДляАгентов_,ДатаСреза2, _тзАгентовДляРаскраски);
				//	КонецЕсли;	
				//Иначе	
					ВывестиОтчет(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза1, тзАгентовДляРаскраски,ТЗИнтервалов);
					Если НЕ ДатаСреза1 = ДатаСреза2 Тогда
						ВывестиОтчет(ДокументРезультат,ТЗ1_,ТЗАгентов_,тзПодразделений_,тзСхемаРасчетаДляАгентов_,ДатаСреза2, _тзАгентовДляРаскраски,ТЗИнтервалов_);
					КонецЕсли;	
			//	КонецЕсли;	
			КонецЕсли;	
		Иначе	
			//Если Постарому Тогда
			//	ВывестиОтчетСтарый(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза1, тзАгентовДляРаскраски);
			//	Если НЕ ДатаСреза1 = ДатаСреза2 Тогда
			//		ВывестиОтчетСтарый(ДокументРезультат,ТЗ1_,ТЗАгентов_,тзПодразделений_,тзСхемаРасчетаДляАгентов_,ДатаСреза2, _тзАгентовДляРаскраски);
			//	КонецЕсли;	
			//Иначе	
				
				ВывестиОтчет(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза1, тзАгентовДляРаскраски,ТЗИнтервалов);
				Если НЕ ДатаСреза1 = ДатаСреза2 Тогда
					ВывестиОтчет(ДокументРезультат,ТЗ1_,ТЗАгентов_,тзПодразделений_,тзСхемаРасчетаДляАгентов_,ДатаСреза2, _тзАгентовДляРаскраски,ТЗИнтервалов_);
				КонецЕсли;	
	//		КонецЕсли;	
		КонецЕсли;	
	Иначе
		КоличествоЭтапов = ?(ЗначениеЗаполнено(ДатаСреза),6,5);
		ТЗ1 = Новый ТаблицаЗначений; ТЗАгентов = Новый ТаблицаЗначений;	тзПодразделений = Новый ТаблицаЗначений; тзСхемаРасчетаДляАгентов = Новый ТаблицаЗначений; 
		ТЗИнтервалов = Новый ТаблицаЗначений;
		тзАгентовДляРаскраски = Неопределено;
		
		РассчитатьТаблицы(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски,ТЗИнтервалов);
		//ТЗ1.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Булево"));
		//Если Постарому Тогда
		//	ВывестиОтчетСтарый(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза, тзАгентовДляРаскраски);
		//Иначе	
			
			ВывестиОтчет(ДокументРезультат,ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов,ДатаСреза, тзАгентовДляРаскраски,ТЗИнтервалов);
	//	КонецЕсли;	
	Конецесли;	
	
	ДокументРезультат.ОтображатьЗаголовки 	= ЛОЖЬ;//ПараметрыСеанса.уб_ЭтоМенеджер = Ложь;
	ДокументРезультат.ОтображатьСетку     	= Ложь;
	ДокументРезультат.Защита              	= Ложь;
	ДокументРезультат.ТолькоПросмотр     	= Истина;
	ДокументРезультат.ФиксацияСлева			= 0;
	Если СохранитьВФайл И ПравоДоступа("Вывод", Метаданные) Тогда
		//TODO Заменить на доступный каталог
		ДокументРезультат.Записать("D:\" + Формат(ЗарплатныйПериод, "ДФ=YY_MMМ") + " " + Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH-mm-ss'") + ".mxl");
		Если НЕ ПоказыватьФайл Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	//Копии таблиц при вызове расчета через форму 
	//Не понятно зачем убрано
	//фТЗОплат 					= ТЗ1.Скопировать();
	//фТЗАгентов 					= ТЗАгентов.Скопировать();
	//фтзПодразделений 			= тзПодразделений.Скопировать();
	//фтзСхемаРасчетаДляАгентов 	= тзСхемаРасчетаДляАгентов.Скопировать();
	
КонецПроцедуры

Функция УстановитьПараметрыОбласти_Вознаграждение(Параметры,Выборка,ИмяОбщейЗП="ИтогоЗПОрг",УстановитьОбщееЗП = Ложь)
	
	Попытка 
		//Параметры.Кол			   = Выборка.ЕД;	
		Параметры.ВМ			   = Формат(Выборка.ВознаграждениеМенеджера,ЧФ);
		Параметры.ВычетСАгента	   = Формат(?(Выборка.ВычетСАгента = Null, 0, -Выборка.ВычетСАгента),ЧФ);
		ЗПОбщее = ?(Выборка[ИмяОбщейЗП] = Null, 0, Выборка[ИмяОбщейЗП]) //ВМ по СКВ
		+ ?(Выборка.ВознаграждениеМенеджера = Null, 0, Выборка.ВознаграждениеМенеджера) //ВМ в оплатах
		- ?(Выборка.ВычетСАгента = Null, 0, Выборка.ВычетСАгента)     //вычеты  
		+ ?(Выборка.Бонус_КС = Null, 0, Выборка.Бонус_КС)             //Крупные сделки
		+ ?(Выборка.ВМПоИнтервалам = Null, 0,Выборка.ВМПоИнтервалам); //По интервалам
		Если УстановитьОбщееЗП Тогда
			//Параметры.ОбщееЗП		= Формат(ЗПОбщее,ЧФ0);
			Параметры.ИтогоЗП       = Формат(Выборка[ИмяОбщейЗП],ЧФ000);
		КонецЕсли;	
		Параметры.ПроцентРуководителя = Выборка.ВознаграждениеРуководителя;
		Возврат ЗПОбщее;
	Исключение
		//Сообщить(ОписаниеОшибки());
		Возврат 0;
	КонецПопытки;
КонецФункции
Функция УстановитьПараметрыОбласти_Взносы(Параметры,Выборка,ИмяОбщейЗП="ИтогоЗПОрг",УстановитьОбщееЗП = Ложь)
	
	Попытка 
		Параметры.СуммаВзносов	   = Формат(Выборка.НачисленнаяСуммаВзноса,ЧФ000);
		//Параметры.СобранаяКВ	   = Формат(Выборка.СКВ,ЧФ000);
		Попытка
			Если Выборка.КоличествоФакт = 0 Тогда
				Параметры.КоличествоФакт = "";
			Иначе
				Параметры.КоличествоФакт = Формат(Выборка.КоличествоФакт,ЧФ000);
			КонецЕсли;
		Исключение
		КонецПопытки;
		Параметры.ОбщаяСуммаСкидок = Формат(Выборка.АВилиСкидкаСумма,ЧФ000);
		
		Если Выборка.НачисленнаяСуммаВзноса <> 0 И (Выборка.АВилиСкидкаСумма <> Null ИЛИ Выборка.НачисленнаяСуммаВзноса <> Null) Тогда
			Параметры.СредПроцСкидки		= Формат(Выборка.АВилиСкидкаСумма*100/Выборка.НачисленнаяСуммаВзноса,ЧФ000);
		КонецЕсли;
		Параметры.СуммаОплаченоФакт	= Формат(Выборка.ОплаченоФакт,ЧФ000);
		
		Если НЕ СкрыватьКолонкиДСП Тогда
			Если Выборка.НачисленнаяСуммаВзноса <> 0 И (Выборка.КВСуммаДляАгента <> Null ИЛИ Выборка.НачисленнаяСуммаВзноса <> Null) Тогда
				Параметры.СредПроцКВ			= Формат(Выборка.КВСуммаДляАгента*100/Выборка.НачисленнаяСуммаВзноса,ЧФ000);
			КонецЕсли;
			Параметры.ОбщаяСуммаКВ		= Формат(Выборка.КВСуммаДляАгента,ЧФ000)
		КонецЕсли;		
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Функция УстановитьПараметрыОбласти(Параметры,Выборка,ИмяОбщейЗП="ИтогоЗПОрг",УстановитьОбщееЗП = Ложь)
	
	Попытка 
		Параметры.Кол			   = Выборка.ЕД;	
		Параметры.ВМ			   = Формат(Выборка.ВознаграждениеМенеджера,ЧФ);
		Параметры.ВычетСАгента	   = Формат(?(Выборка.ВычетСАгента = Null, 0, -Выборка.ВычетСАгента),ЧФ);
		Параметры.СуммаВзносов	   = Формат(Выборка.НачисленнаяСуммаВзноса,ЧФ000);
		Параметры.СобранаяКВ	   = Формат(Выборка.СКВ,ЧФ000);
		Попытка
			Если Выборка.КоличествоФакт = 0 Тогда
				Параметры.КоличествоФакт = "";
			Иначе
				Параметры.КоличествоФакт = Формат(Выборка.КоличествоФакт,ЧФ000);
			КонецЕсли;
		Исключение
		КонецПопытки;
		Параметры.ОбщаяСуммаСкидок = Формат(Выборка.АВилиСкидкаСумма,ЧФ000);
		
		Если Выборка.НачисленнаяСуммаВзноса <> 0 И (Выборка.АВилиСкидкаСумма <> Null ИЛИ Выборка.НачисленнаяСуммаВзноса <> Null) Тогда
			Параметры.СредПроцСкидки		= Формат(Выборка.АВилиСкидкаСумма*100/Выборка.НачисленнаяСуммаВзноса,ЧФ000);
		КонецЕсли;
		Параметры.СуммаОплаченоФакт	= Формат(Выборка.ОплаченоФакт,ЧФ000);
		
		ЗПОбщее = ?(Выборка[ИмяОбщейЗП] = Null, 0, Выборка[ИмяОбщейЗП]) 
		+ ?(Выборка.ВознаграждениеМенеджера = Null, 0, Выборка.ВознаграждениеМенеджера) 
		- ?(Выборка.ВычетСАгента = Null, 0, Выборка.ВычетСАгента)+ ?(Выборка.Бонус_КС = Null, 0, Выборка.Бонус_КС); 
		Если УстановитьОбщееЗП Тогда
			Параметры.ОбщееЗП		= Формат(ЗПОбщее,ЧФ0);
			Параметры.ИтогоЗП       = Формат(Выборка[ИмяОбщейЗП],ЧФ000);
		КонецЕсли;	
		Если НЕ СкрыватьКолонкиДСП Тогда
			Если Выборка.НачисленнаяСуммаВзноса <> 0 И (Выборка.КВСуммаДляАгента <> Null ИЛИ Выборка.НачисленнаяСуммаВзноса <> Null) Тогда
				Параметры.СредПроцКВ			= Формат(Выборка.КВСуммаДляАгента*100/Выборка.НачисленнаяСуммаВзноса,ЧФ000);
			КонецЕсли;
			Параметры.ОбщаяСуммаКВ		= Формат(Выборка.КВСуммаДляАгента,ЧФ000)
		КонецЕсли;		
		
		Возврат ЗПОбщее;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Процедура ДобавитьПустышку(ТЗ1,Стр,СхемаРасчета=Неопределено)
	Пустышки = ТЗ1.НайтиСтроки(Новый Структура("Агент,Подразделение,Пустышка",Стр.Агент,Стр.Подразделение,Истина)).Количество();
	Если Пустышки = 1 Тогда
		Возврат;
	ИначеЕсли Пустышки > 1 Тогда
		Сообщить("Сообщить количество пустых записей по агенту "+Пустышки+ " Это может вызвать задвоение");
	КонецЕсли;	
		
			НовОплата					= ТЗ1.Добавить();
			НовОплата.Агент 			= Стр.Агент;		
			НовОплата.Подразделение		= Стр.Подразделение;
			НовОплата.Организация 		= Стр.Подразделение.Владелец;
			НовОплата.Пустышка			= Истина;
			Если Стр.ЕстьПланПоСКВ=Истина Тогда
				
			Иначе	
				тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
				Если тз.Количество() > 0 Тогда
					Стр.План = тз[0].План;
					Если Стр.План = 0 Тогда
						Стр.Количество = 0;
					Иначе
						Стр.Количество = тз[0].Количество;
					КонецЕсли;
				Иначе
					Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
				КонецЕсли;
				
			КонецЕсли;
			Если СхемаРасчета=Неопределено Тогда
				Если Стр.ЕстьПланПоСКВ=Истина Тогда
					СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
				Иначе	
					тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Стр.Подразделение.Владелец, Стр.Подразделение, Стр.Агент);
					Если тз.Количество() > 0 Тогда
						СхемаРасчета = тз[0].СхемаРасчета;
					Иначе
						СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
						Сообщить("Ошибка при получении вида расчета с менеджером."+Стр.Агент,СтатусСообщения.ОченьВажное);
						//Возврат  ВознаграждениеМенеджера;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			НовОплата.СхемаРасчетаСМенеджером = СхемаРасчета;
			
			НовОплата.УАгентаПланПоСКВ	= СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
			
			Стр.УАгентаПланПоСКВ		= НовОплата.УАгентаПланПоСКВ;
			НовОплата.СКВ = 0;
			НовОплата.КоличествоФакт = 0;
			НовОплата.КоэффициентВида = 0;
			НовОплата.НовыйКлиент = 0;
			НовОплата.НовыйКлиентСКВ = 0;
			
			
			НовОплата.ОплаченоФакт = 0;
			НовОплата.НачисленнаяСуммаВзноса = 0;
			НовОплата.СкидкаВыплаченаяКлиенту = 0;
			НовОплата.КВСумма = 0;
			НовОплата.СуммаДБ = 0;
			НовОплата.КВСуммаДляАгента = 0;
			НовОплата.ВознаграждениеМенеджера = 0;
			НовОплата.ВычетСАгента  = 0;
			НовОплата.АВилиСкидкаСумма  = 0;
			НовОплата.Ед = 0;
КонецПроцедуры	

//#Область ПлавСтавки //Плавающие ставки менеджера	
Функция ПолучитьТаблицуПлавающихСтавокРОП()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ставка");
	ТЗ.Колонки.Добавить("ПроцентПлана");
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 0;	СтрокаТЗ.Ставка = 0;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 50;	СтрокаТЗ.Ставка = 5;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 60;	СтрокаТЗ.Ставка = 6;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 70;	СтрокаТЗ.Ставка = 7;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 80;	СтрокаТЗ.Ставка = 8;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 90;	СтрокаТЗ.Ставка = 9;
	СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 100;	СтрокаТЗ.Ставка = 10;
	
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 50;	СтрокаТЗ.Ставка = 0;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 60;	СтрокаТЗ.Ставка = 5;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 70;	СтрокаТЗ.Ставка = 6;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 80;	СтрокаТЗ.Ставка = 7;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 90;	СтрокаТЗ.Ставка = 8;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 100;	СтрокаТЗ.Ставка = 9;
	//СтрокаТЗ = Тз.Добавить();	СтрокаТЗ.ПроцентПлана  = 999;	СтрокаТЗ.Ставка = 10;
	Возврат Тз;
КонецФункции

Функция ОпределитьСтавкуПоВыполнениюПлана(ТаблицаСтавок,ПроцентВыполненияПлана)
	ТекСтавка = 0;
	Для каждого СтрокаТЗ из ТаблицаСтавок Цикл
		Если ПроцентВыполненияПлана >= СтрокаТЗ.ПроцентПлана  Тогда
			ТекСтавка = СтрокаТЗ.Ставка;
		Иначе
			Прервать; 
		КонецЕсли;	 
		
	КонецЦикла;	
	Возврат  ТекСтавка;
КонецФункции

//#КонецОбласти


//Процедура РассчитатьТаблицыСтарый(ТЗ1,ТЗАгентов,тзПодразделений,тзСхемаРасчетаДляАгентов, тзАгентовДляРаскраски = Неопределено,ТЗИнтервалов=Неопределено) Экспорт
//	////////////////////////////////////////////////////////
//	//ЭТАП №1. ПОЛУЧЕНИЕ И ЗАДЕНИЕ НАСТРОЕК РАСЧЕТА
//	////////////////////////////////////////////////////////
//	Если тзАгентовДляРаскраски = Неопределено Тогда
//		тзАгентовДляРаскраски = Новый ТаблицаЗначений;
//		тзАгентовДляРаскраски.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
//		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПолеМенеджера",Новый ОписаниеТипов("Булево"));
//		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьПлан",Новый ОписаниеТипов("Булево"));
//		тзАгентовДляРаскраски.Колонки.Добавить("РаскраситьКоличественныйПлан",Новый ОписаниеТипов("Булево"));
//	КонецЕсли;
//	
//	СоотвИнфоКВМ = Новый Соответствие;
//	ДатаНачала 		= НачалоМесяца(ЗарплатныйПериод);
//	ДатаКонца 		= КонецМесяца(ЗарплатныйПериод);
//	стрСостояние    = "Расчет ЗП ОП за "+Формат(ЗарплатныйПериод,"ДФ='MMMM yyyy'");
//	//кЛичнаяЗаявка 	= Перечисления.уб_ВидыЗаявок.Личная;	 
//	кРасчетПоАВ 	= Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
//	СхемаПоАВ       = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
//	пВидКАСКО 		= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
//	ПустойПолис     = Документы.уб_СтраховойПолис.ПустаяСсылка();
//	
//	ЗапросРасчетВМ = Новый Запрос;
//	
//	ОписаниеТипаЧисло14_2_но	= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(14, 2, ДопустимыйЗнак.Любой));
//	ОписаниеТипаПроцент			= Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
//	ОписаниеТипаДата			= Новый ОписаниеТипов("Дата",,Новый КвалификаторыДаты(ЧастиДаты.Дата));
//	ОписаниеТипаБулево			= Новый ОписаниеТипов("Булево");
//	ОписаниеТипаСтрока			= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20));
//	ОписаниеТипа_ФизЛицо		= Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
//	ОписаниеТипаЧисло12_0       = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(12, 0));
//	
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
//	ОписаниеТипа_Подразделение = Новый ОписаниеТипов(Массив);
//	
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("СправочникСсылка.Организации"));
//	ОписаниеТипа_Организации = Новый ОписаниеТипов(Массив);
//	
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("ПеречислениеСсылка.уб_ЗП_СхемыВознагражденияРуководителейОП"));
//	ОписаниеТипаСхемВознРукОП = Новый ОписаниеТипов(Массив);
//	
//	РазмерКС = ?(ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1),уб_РасчетыСменеджерами.РазмерКС(ЗарплатныйПериод),50000);
//	
//	РасчетДО1БП = уб_РасчетыСменеджерами.РасчетДО1БП(ЗарплатныйПериод);
//	
//	ЭтоВариант20121001 = ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И ЗарплатныйПериод >= Дата(2012,10,1);
//	
//	ЭтоВариант20120401 = ЗарплатныйПериод >= Дата(2012,4,1); //У руководителей корректируется ЗП при наличии КС
//	
//	ЭтоВариант20121201 = ЗарплатныйПериод >= Дата(2012,12,1);//Используются 2 бонус планки
//	ЭтоВариант20130301 = ЗарплатныйПериод >= Дата(2013,3,1) ; //Для истории КВ Агента
//	
//	ЭтоВариант20130801 = ЗарплатныйПериод >= Дата(2013,8,1);//Количественный план
//	ЭтоВариант20130901 = ЗарплатныйПериод >= Дата(2013,9,1);//Количественный план РОП
//	ЭтоВариант20150401 = ЗарплатныйПериод >= Дата(2015,4,1);//До Суперплана для РОП при неполненном колич, но больших сборах
//	ЭтоВариант20150601 = ЗарплатныйПериод >= Дата(2015,6,1);//Штрафной план вычитается из бонуспланок
//	ЭтоВариант20150801 = ЗарплатныйПериод >= Дата(2015,8,1);//Структура отбора делается по ПлануСКВ
//	ЭтоВариант20150901 = ЗарплатныйПериод >= Дата(2015,9,1) ИЛИ НовыйРегламент;//Структура отбора делается по ПлануСКВ
//	ТаблицаПлавающихСтавокРОП = ПолучитьТаблицуПлавающихСтавокРОП();
//	////////////////////////////////////////////////////////
//	// ПОЛУЧЕНИЕ ДАННЫХ ИЗ ОПЛАТ ЛИБО ИЗ ИСТОРИИ ОПЛАТ
//	////////////////////////////////////////////////////////
//	
//	ФильтрПоМенеджеру = ЗначениеЗаполнено(Менеджер);
//	ФильтрПоПодразделению = ЗначениеЗаполнено(Подразделение) И РежимОтчета = 0 ;			   
//	ФильтрПоСП = ЗначениеЗаполнено(ВидСП);
//	Этап = Этап + 1;
//	ВРеальномВремени  = Не ЗначениеЗаполнено(ДатаСреза);
//	//этоКС = НЕ _вм.СписокКС.Найти(ОП.Знч("Ссылка")) = Неопределено;
//	//						__ВознаграждениеМенеджера = Окр(?(_вм.ЗП_СКВ=0 ИЛИ _этоКС,0,_вм.ЗП_СКВ*__СКВ/_вм.СКВ)+?(бЗаблокирована,ОП.Знч("ВознаграждениеМенеджера"),_ВознаграждениеМенеджера)+
//	//						?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.Бонус_КС*__СКВ/_вм.СКВ_КС),2);
//	
//	Если ВРеальномВремени Тогда
//		//////////////////////////////////////////////////////////////////////////////////////////
//		// Запрос формируется на основании Документов уб_ОплатаПолисов по текущему их состоянию //
//		//////////////////////////////////////////////////////////////////////////////////////////
//		УсловиеОтбораОплат = "
//		|ГДЕ ИСТИНА ";		
//		УсловиеОтбораОплат = УсловиеОтбораОплат + "
//		|	И ОП.ЗарплатныйПериод >= &ДатаНачала
//		|	И ОП.ЗарплатныйПериод <= &ДатаКонца ";
//		Если ПоказатьТолькоОплатыНеИзЭтогоЗППериода Тогда
//			УсловиеОтбораОплат = УсловиеОтбораОплат + " И (ОП.Дата < &ДатаНачала ИЛИ ОП.Дата > &ДатаКонца) ";
//		КонецЕсли;		
//		Если НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП Тогда
//			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ ";
//		КонецЕсли;		
//		УсловиеОтбораОплат = УсловиеОтбораОплат + "
//		|	И ОП.СтраховойПолис.Ссылка <> &ПустойПолис
//		|	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
//		|   И ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером)<>Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)//Вместо нижестоящей
//		//|	И ОП.СтраховойПолис.НомерЗаявки <> &ЛичнаяСтраховка 
//		|   И ОП.ПометкаУдаления = ЛОЖЬ ";		
//		Если ФильтрПоСП Тогда
//			УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.СтраховойПолис.СтраховойПродукт.Вид = &ВидСП ";
//		КонецЕсли;		
//		//Если ФильтрПоМенеджеру Тогда
//		//УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Агент = &Менеджер ";
//		//КонецЕсли;		
//		//Если ФильтрПоПодразделению Тогда
//		//	УсловиеОтбораОплат = УсловиеОтбораОплат + " И ОП.Подразделение = &Подразделение ";
//		//КонецЕсли;		
//		ЗапросРасчетВМ.УстановитьПараметр("ДатаНачала",		ДатаНачала);
//		ЗапросРасчетВМ.УстановитьПараметр("ДатаКонца",		ДатаКонца);
//		//ЗапросРасчетВМ.УстановитьПараметр("ЛичнаяСтраховка",кЛичнаяЗаявка);
//		//ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
//		ЗапросРасчетВМ.УстановитьПараметр("РасчетПоАВ",		кРасчетПоАВ);
//		ЗапросРасчетВМ.УстановитьПараметр("ВидКАСКО",		пВидКАСКО);
//		ЗапросРасчетВМ.УстановитьПараметр("ПустойПолис",	ПустойПолис);		
//		ЗапросРасчетВМ.УстановитьПараметр("Менеджер",		Менеджер);
//		ЗапросРасчетВМ.УстановитьПараметр("Подразделение",	Подразделение);
//		ЗапросРасчетВМ.УстановитьПараметр("ВидСП",			ВидСП);		
//		// Если галочка "пересчитывать суммы в оплатах" ИСТИНА
//		Если ПересчитыватьСуммыВОплатах Тогда
//			ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//			|	ОП.Ссылка
//			|ИЗ
//			|	Документ.уб_ОплатаПолисов КАК ОП" + УсловиеОтбораОплат;
//			Результат = ЗапросРасчетВМ.Выполнить();			
//			ПересчитатьСуммыПоЗП(Результат);
//		КонецЕсли;		
//		
//		ЗапросРасчетВМ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером) как СхемаРасчетаСМенеджером,
//		|	ОП.*,
//		|	ОП.Подразделение.Владелец КАК Организация,
//		|	ОП.Подразделение.НеОплачиватьКС КАК НеОплачиватьКС,
//		|	ВЫБОР
//		|		КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
//		|			КОГДА ОП.НачисленнаяСуммаВзноса = 0
//		|				ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
//		|			ИНАЧЕ ОП.НачисленнаяСуммаВзноса
//		|		КОНЕЦ - ОП.КВСуммаДляАгента
//		|	ТОГДА 0
//		|		ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
//		|			КОГДА ОП.НачисленнаяСуммаВзноса = 0
//		|				ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
//		|			ИНАЧЕ ОП.НачисленнаяСуммаВзноса
//		|		КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента
//		|	КОНЕЦ КАК СКВ,
//		|	ОП.СтраховойПолис.СК КАК СП_СК,
//		|	ОП.СтраховойПолис.СтраховойПродукт.Вид КАК СП_ВидСП,
//		|	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
//		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
//		|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
//		|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
//		|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
//		|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
//		|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
//		|   ОП.СтраховойПолис.Сделка Как Сделка,
//		|   ОП.СтраховойПолис.Сделка.Дата Как ДатаСделки,
//		|   Выразить (ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
//		|	ИНАЧЕ 0
//		|	КОНЕЦ КАК ЧИСЛО)КАК БонусПроцент,
//		|	Выразить (ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
//		|	ИНАЧЕ 0
//		|	КОНЕЦ КАК Число) КАК БонусПроцентРОП,
//		|   ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА Неопределено
//		|	ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕопределено)
//		|	КОНЕЦ КАК Интервалы,
//		|   ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА Неопределено
//		|	ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕопределено)
//		|	КОНЕЦ КАК ИнтервалыРОП,
//		|   Isnull(ОП.СтраховойПолис.Сделка.Крупная,ЛОЖЬ) как ЭтоКрупнаяСделка,
//		|   Выбор Когда ОП.НомерВзноса = 1 И (ОП.ВидСП = Значение(Перечисление.уб_ВидыСтраховыхПродуктов.НС) Или ОП.ВидСП = Значение(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество)) Тогда 1 Иначе 0 Конец Как КоличествоФакт,
//		|	1 КАК ЕД
//		|ИЗ
//		|	Документ.уб_ОплатаПолисов КАК ОП " + УсловиеОтбораОплат;
//		#Если Клиент Тогда
//			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам периода");
//		#КонецЕсли
//		Если СКВДляДенег Тогда
//			ЗапросРасчетВМ.Текст = Стрзаменить(ЗапросРасчетВМ.Текст,"КВСуммаДляАгента","КВСумма");
//		КонецЕсли;	
//		ТЗ1	= ЗапросРасчетВМ.Выполнить().Выгрузить();
//	Иначе		
//		///////////////////////////////////////////////////////////////////
//		// Запрос на основе данных из регистра уб_ИсторияРеквизит
//		///////////////////////////////////////////////////////////////////
//		СоотОрганизацийПодразделениям = ПолучитьСоответствиеОрганизацийПодразделениям();
//		//Получаем оплаты из истории
//		ЗапросПоОплатамИзИстории = Новый Запрос;
//		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата1",ДатаНачала);										
//		ЗапросПоОплатамИзИстории.УстановитьПараметр("Дата2",ДатаКонца);
//		ЗапросПоОплатамИзИстории.УстановитьПараметр("ДатаСреза",ДатаСреза);
//		ЗапросПоОплатамИзИстории.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//		|	ВЫБОР
//		|		КОГДА уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.НомерВзноса = 1
//		|				И (уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
//		|					ИЛИ уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.ВидСП = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество))
//		|			ТОГДА 1
//		|		ИНАЧЕ 0
//		|	КОНЕЦ КАК КоличествоФакт,
//		|	ВЫРАЗИТЬ(уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК Оплата,
//		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории.Подразделение.НеОплачиватьКС КАК НеОплачиватьКС
//		|ПОМЕСТИТЬ ОплатыМесяца
//		|ИЗ
//		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
//		|			&ДатаСреза,
//		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
//		|				И РеквизитОбъекта.Наименование = ""ЗарплатныйПериод"") КАК уб_ИсторияРеквизитСрезПоследних
//		|ГДЕ
//		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита >= &Дата1
//		|	И уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита <= &Дата2
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ОплатыМесяца.Оплата,
//		|	ОплатыМесяца.КоличествоФакт,
//		|	ОплатыМесяца.НеОплачиватьКС
//		|ИЗ
//		|	ОплатыМесяца КАК ОплатыМесяца
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//		|	ОП.Ссылка,
//		|	ОП.ВерсияДанных,
//		|	ОП.ПометкаУдаления,
//		|	ОП.Номер,
//		|	ОП.Дата,
//		|	ОП.Проведен,
//		|	ОП.АВилиСкидкаПроцент,
//		|	ОП.АВилиСкидкаСумма,
//		|	ОП.Агент,
//		|	ОП.Баланс_Брокер_Поставщик,
//		|	ОП.Валюта,
//		|	ОП.ВидРасчетаСАгентом,
//		|	ОП.ВидСП,
//		|	ОП.ВМпоРезультатамПериодаЗП,
//		|	ОП.ВознаграждениеМенеджера,
//		|	ОП.ВычетСАгента,
//		|	ОП.ДатаМониторинга,
//		|	ОП.ДатаПроведенияБСО,
//		|	ОП.ДокументВыгрузкиВУП,
//		|	ОП.ЕстьКвитанция,
//		|	ОП.ЗарплатныйПериод,
//		|	ОП.ИсключенаИзВзаиморасчетов,
//		|	ОП.ИсключитьИзРасчетаЗП,
//		|	ОП.КВПодВопросом,
//		|	ОП.КВПроцент,
//		|	ОП.КВПроцентДляАгента,
//		|	ОП.КВПроцентДляОтчета,
//		|	ОП.КВСумма,
//		|	ОП.КВСуммаДляАгента,
//		|	ОП.КВСуммаДляОтчета,
//		|	ОП.КодКВ,
//		|	ОП.Комментарий,
//		|	ОП.КОплатеАгентом,
//		|	ОП.Курс,
//		|	ОП.Курьер,
//		|	ОП.НачисленнаяСуммаВзноса,
//		|	ОП.НачисленнаяСуммаВзносаВВалюте,
//		|	ОП.НеВключатьВОтчетыПоставщикам,
//		|	ОП.НеМенятьАВ,
//		|	ОП.НеМенятьВК,
//		|	ОП.НеМенятьКВ,
//		|	ОП.НомерВзноса,
//		|	ОП.НомерКвитанции,
//		|	ОП.НомерРасчетногоСчета,
//		|	ОП.ОплаченоФакт,
//		|	ОП.ОрганизацияАгент,
//		|	ОП.ОтчетАгента,
//		|	ОП.ОтчетПоКарточкам,
//		|	ОП.ОтчетПоставщику,
//		|	ОП.ПересчетКВ,
//		|	ОП.ПлатежныйДокумент_Дата,
//		|	ОП.ПлатежныйДокумент_Номер,
//		|	ОП.Подразделение,
//		|	ОП.ПолисАннулирован,
//		|	ОП.ПолнаяСтраховаяПремия,
//		|	ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
//		|	ОП.Поставщик,
//		|	ОП.Проблемная,
//		|	ОП.СК,
//		|	ОП.СкидкаВыплаченаяКлиенту,
//		|	ОП.СтраховойПолис,
//		|	ОП.СтраховойПродукт,
//		|	ОП.СуммаКОплатеБрокеруДляОчетаПоставщику,
//		|	ISNULL(ОП.СтраховойПолис.Сделка.СхемаОплатыПоСделке,ОП.СхемаРасчетаСМенеджером) как СхемаРасчетаСМенеджером,
//		|	ОП.Счет,
//		|	ОП.НаправлениеПлатежа,
//		|	ОП.ЭтоКрупнаяСделка,
//		|	ОП.ПричинаИсключенияИзОП,
//		|	ОП.СписатьСКурьера,
//		|	ОП.ОкруглятьКВДо2Знаков,
//		|	ОП.ДБ,
//		|	ОП.ВМРасчетное,
//		|	ОП.ПроверенаЗП,
//		|	ОП.РазрядностьОкругления,
//		|	ОП.РежимОкругления,
//		|	ОП.Автор,
//		|	ОП.ДатаСоздания,
//		|	ОП.Модификатор,
//		|	ОП.ДатаИзменения,
//		|	ОП.Подразделение.Владелец КАК Организация,
//		|	ЛОЖЬ КАК НеОплачиватьКС,
//		|	0 КАК СКВ,
//		|	ОП.СтраховойПолис.СК КАК СП_СК,
//		|	ОП.СтраховойПолис.СтраховойПродукт.Вид КАК СП_ВидСП,
//		|	ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
//		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
//		|	ОП.СтраховойПолис.Дата КАК ДатаПолиса,
//		|	ОП.СтраховойПолис.Номер КАК НомерПолиса,
//		|	ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
//		|	ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
//		|	ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
//		|	ОП.СтраховойПолис.Сделка КАК Сделка,
//		|	ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
//		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
//		|				ТОГДА ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
//		|   ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА Неопределено
//		|	ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцент, НЕопределено)
//		|	КОНЕЦ КАК Интервалы,
//		|   ВЫБОР
//		|	КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
//		|		ТОГДА Неопределено
//		|	ИНАЧЕ ЕСТЬNULL(ОП.СтраховойПолис.Сделка.БонусПроцентРОП, НЕопределено)
//		|	КОНЕЦ КАК ИнтервалыРОП,
//		|	ЕСТЬNULL(ОП.СтраховойПолис.Сделка.Крупная, ЛОЖЬ) КАК ЭтоКрупнаяСделка,
//		|	0 КАК КоличествоФакт,
//		|	1 КАК ЕД,
//		|	ОП.ФормаОплаты
//		|ИЗ
//		|	Документ.уб_ОплатаПолисов КАК ОП
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВЫРАЗИТЬ(ИР.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК ОбъектИстории,
//		|	ИР.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
//		|	ИР.ЗначениеРеквизита
//		|ПОМЕСТИТЬ ВТ_ИсторияРеквизитовВсехОплат
//		|ИЗ
//		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
//		|			&ДатаСреза,
//		|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
//		|				И ОбъектИстории В
//		|					(ВЫБРАТЬ
//		|						Т.Оплата
//		|					ИЗ
//		|						ОплатыМесяца КАК Т)
//		|				И РеквизитОбъекта <> ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК ИР
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТ_ИсторияРеквизитовВсехОплат.ОбъектИстории КАК ОбъектИстории,
//		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита,
//		|	ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита
//		|ИЗ
//		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
//		|ИТОГИ ПО
//		|	ОбъектИстории
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВЫРАЗИТЬ(ВТ_ИсторияРеквизитовВсехОплат.ЗначениеРеквизита КАК Документ.уб_СтраховойПолис) КАК СтраховойПолис
//		|ПОМЕСТИТЬ ВТ_ВсеСтраховыеПолисы
//		|ИЗ
//		|	ВТ_ИсторияРеквизитовВсехОплат КАК ВТ_ИсторияРеквизитовВсехОплат
//		|ГДЕ
//		|	ВТ_ИсторияРеквизитовВсехОплат.НаименованиеРеквизита = ""СтраховойПолис""
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	уб_СтраховойПолис.Ссылка КАК СтраховойПолис,
//		|	уб_СтраховойПолис.Номер,
//		|	уб_СтраховойПолис.Дата,
//		|	уб_СтраховойПолис.СтраховойПродукт,
//		|	уб_СтраховойПолис.Страхователь,
//		|	уб_СтраховойПолис.НомерЗаявки,
//		|	уб_СтраховойПолис.БонусМенеджеру,
//		|	уб_СтраховойПолис.СК,
//		|	уб_СтраховойПолис.СтраховаяПремия,
//		|	уб_СтраховойПолис.ПометкаУдаления,
//		|	уб_СтраховойПолис.Сделка КАК Сделка,
//		|	уб_СтраховойПолис.Сделка.Дата КАК ДатаСделки,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)) = ТИП(ЧИСЛО)
//		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцент, 0)
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцент,
//		|	ВЫРАЗИТЬ(ВЫБОР
//		|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)) = ТИП(ЧИСЛО)
//		|				ТОГДА ЕСТЬNULL(уб_СтраховойПолис.Сделка.БонусПроцентРОП, 0)
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК ЧИСЛО) КАК БонусПроцентРОП,
//		|	уб_СтраховойПолис.СтраховойПродукт.Вид КАК Вид
//		|ИЗ
//		|	ВТ_ВсеСтраховыеПолисы КАК ВТ_ВсеСтраховыеПолисы
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
//		|		ПО ВТ_ВсеСтраховыеПолисы.СтраховойПолис = уб_СтраховойПолис.Ссылка";
//		#Если Клиент Тогда
//			Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " - Запрос по оплатам из истории");
//		#КонецЕсли
//		Пакет = ЗапросПоОплатамИзИстории.ВыполнитьПакет();		
//		//СписокОплатИзИстории = Пакет[1].Выгрузить().ВыгрузитьКолонку("Оплата");
//		ВыборкаОплат = Пакет[1].Выбрать();		
//		ТЗ1	= Пакет[2].Выгрузить();//ТЗ1 = СоздатьТаблицу();
//		ТЗ1.Очистить();		
//		ВыборкаИсторияРеквизитовОплат = Пакет[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
//		ВыборкаСтраховыхПолисов = Пакет[6].Выбрать();		
//		//ВсегоМассив = СписокОплатИзИстории.Количество();
//		ВсегоМассив = ВыборкаОплат.Количество();		
//		СпПометкаУдаления = Ложь;
//		Этап = Этап + 1;
//		СчетчикОплат = 0;
//		//Для СчетчикОплат = 0 по ВсегоМассив - 1 Цикл
//		Пока ВыборкаОплат.Следующий() Цикл
//			#Если Клиент Тогда
//				Состояние(стрСостояние+". Этап: " + Этап + " из " + КоличествоЭтапов + " (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + ") - Расчет показателей СКВ из истории");
//			#КонецЕсли
//			//Оплата = СписокОплатИзИстории[СчетчикОплат];
//			Оплата = ВыборкаОплат.Оплата;
//			СчетчикОплат = СчетчикОплат + 1;
//			#Если Клиент Тогда
//				ОбработкаПрерыванияПользователя();
//			#КонецЕсли
//			/////////////////////////////////////////////////////////////////////////////////////////////
//			//!!! Добавить проверку на удаленные оплаты, подменять некоторые реквизиты или менять представление
//			/////////////////////////////////////////////////////////////////////////////////////////////
//			Стр = ТЗ1.Добавить();
//			Стр.Ссылка = Оплата;//.Ссылка
//			Стр.ЕД = 1;
//			Стр.ЭтоКрупнаяСделка = Ложь;
//			Стр.КоличествоФакт = ВыборкаОплат.КоличествоФакт;			
//			Стр.НеОплачиватьКС = ВыборкаОплат.НеОплачиватьКС;
//			//СтруктураИзменений = уб_ИсторияИзмененияОбъектов.ПолучитьДанныеОбъектаНаДату(Стр.Ссылка,ДатаСреза);//!!!Сделать: объединить в один пакет			
//			СтруктураПоиска = Новый Структура;
//			СтруктураПоиска.Вставить("ОбъектИстории", Оплата);
//			СтруктураИзменений = Новый Структура;
//			ВыборкаИсторияРеквизитовОплат.Сбросить();
//			Если ВыборкаИсторияРеквизитовОплат.НайтиСледующий(СтруктураПоиска) Тогда
//				ДетальныеЗаписи = ВыборкаИсторияРеквизитовОплат.Выбрать();
//				
//				Пока ДетальныеЗаписи.Следующий() Цикл
//					СтруктураИзменений.Вставить(ДетальныеЗаписи.НаименованиеРеквизита, ДетальныеЗаписи.ЗначениеРеквизита);
//				КонецЦикла;
//			КонецЕсли;		
//			флПересчитанСКВ = Ложь;
//			Для Каждого ЭлементСтруктуры из СтруктураИзменений Цикл
//				КлючЭл = ЭлементСтруктуры.Ключ;
//				ЗначениеЭл = ЭлементСтруктуры.Значение;
//				
//				Попытка
//					Стр[КлючЭл]= ЗначениеЭл;
//				Исключение
//					Сообщить("Ошибка заполнения строки из истории (" + Оплата + " / " + КлючЭл + ")");
//					продолжить;
//				КонецПопытки;
//				Если КлючЭл = "СтраховойПолис" Тогда
//					Если ЗначениеЗаполнено (ЗначениеЭл) Тогда
//						
//						СтруктураПоиска = Новый Структура;
//						СтруктураПоиска.Вставить("СтраховойПолис", ЗначениеЭл);
//						
//						ВыборкаСтраховыхПолисов.Сбросить();
//						
//						Если ВыборкаСтраховыхПолисов.НайтиСледующий(СтруктураПоиска) Тогда
//							ЗначениеЭл = ВыборкаСтраховыхПолисов;
//							Стр.СП_СтраховойПродукт = ЗначениеЭл.СтраховойПродукт;
//							Стр.СП_ВидСП = ЗначениеЭл.Вид;
//							Стр.СП_СК = ЗначениеЭл.СК;//Не используется и тормозит
//							Стр.Страхователь = ЗначениеЭл.Страхователь;
//							Стр.ДатаПолиса = ЗначениеЭл.Дата;
//							Стр.НомерПолиса = ЗначениеЭл.Номер;
//							Стр.НомерЗаявки = ЗначениеЭл.НомерЗаявки;
//							Стр.БонусМенеджеру = ЗначениеЭл.БонусМенеджеру;
//							Стр.ПолнаяПремия = ЗначениеЭл.СтраховаяПремия;
//							//Если ЭтоВариант20121001 Тогда
//							Стр.Сделка = ЗначениеЭл.Сделка;
//							Стр.ДатаСделки = ЗначениеЭл.ДатаСделки;
//							Стр.БонусПроцент = ЗначениеЭл.БонусПроцент;
//							Стр.БонусПроцентРОП = ЗначениеЭл.БонусПроцентРОП;
//							//КонецЕсли;	
//							
//							СпПометкаУдаления = ЗначениеЭл.ПометкаУдаления;
//						Конецесли;
//					КонецЕсли;	
//				ИначеЕсли КлючЭл ="Подразделение" Тогда	
//					Стр.Организация = СоотОрганизацийПодразделениям.Получить(ЗначениеЭл);
//				ИначеЕсли КлючЭл ="ОплаченоФакт" 
//					Или КлючЭл ="НачисленнаяСуммаВзноса" 
//					Или КлючЭл ="СкидкаВыплаченаяКлиенту" 
//					Или КлючЭл ="ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику" 
//					Или КлючЭл ="КВСумма" Тогда		
//					
//					Если флПересчитанСКВ Тогда
//						Продолжить;
//					КонецЕсли;  
//					
//					Если СтруктураИзменений.Свойство("ОплаченоФакт") Тогда
//						ОплаченоФакт = СтруктураИзменений.ОплаченоФакт;
//						Стр.ОплаченоФакт = ОплаченоФакт;
//					Иначе
//						ОплаченоФакт = Стр.ОплаченоФакт;
//					КонецЕсли;	  
//					
//					Если СтруктураИзменений.Свойство("НачисленнаяСуммаВзноса") Тогда
//						НачисленнаяСуммаВзноса = СтруктураИзменений.НачисленнаяСуммаВзноса;
//						Стр.НачисленнаяСуммаВзноса = НачисленнаяСуммаВзноса;
//					Иначе
//						НачисленнаяСуммаВзноса = Стр.НачисленнаяСуммаВзноса;
//					КонецЕсли;
//					Если СтруктураИзменений.Свойство("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику") Тогда
//						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = СтруктураИзменений.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
//						Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
//					Иначе
//						ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Стр.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
//					КонецЕсли;
//					
//					Если СтруктураИзменений.Свойство("СкидкаВыплаченаяКлиенту") Тогда
//						СкидкаВыплаченаяКлиенту = СтруктураИзменений.СкидкаВыплаченаяКлиенту;
//						Стр.СкидкаВыплаченаяКлиенту = СкидкаВыплаченаяКлиенту;
//					Иначе
//						СкидкаВыплаченаяКлиенту = Стр.СкидкаВыплаченаяКлиенту;
//					КонецЕсли;
//					Если ЭтоВариант20130301 ИЛИ ДатаСреза > Дата(2013,10,7) Тогда
//						Если СтруктураИзменений.Свойство("КВСуммаДляАгента") Тогда
//							Попытка
//								КВСумма = Число(СтруктураИзменений.КВСуммаДляАгента);
//							Исключение
//								КВСумма = 0;
//							КонецПопытки;
//							Стр.КВСумма = КВСумма;
//							Стр.КВСуммаДляАгента = КВСумма;
//						Иначе
//							КВСумма = Стр.КВСуммаДляАгента;
//						КонецЕсли;
//					Иначе	
//						Если СтруктураИзменений.Свойство("КВСумма") Тогда
//							КВСумма = СтруктураИзменений.КВСумма;
//							Стр.КВСумма = КВСумма;
//							Стр.КВСуммаДляАгента = КВСумма;
//						Иначе
//							КВСумма = Стр.КВСумма;
//						КонецЕсли;
//					КонецЕсли;
//					Если (ОплаченоФакт - СкидкаВыплаченаяКлиенту ) < ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса)-КВСумма ТОГДА  
//						СКВ = 0;
//					Иначе	  
//						СКВ = ОплаченоФакт - ?(НачисленнаяСуммаВзноса=0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса) - СкидкаВыплаченаяКлиенту + КВСумма;
//					КонецЕсли; 
//					Стр.СКВ = СКВ;
//					флПересчитанСКВ = Истина;
//				КонецЕсли;	
//			КонецЦикла;	
//			
//			СтраховойПолис = Стр.СтраховойПолис;
//			/////////////////////////////////////////////////////////////////////////////////////////////
//			//!!! Добавить проверку на получение полиса из истории?
//			/////////////////////////////////////////////////////////////////////////////////////////////
//			//Если ФильтрПоМенеджеру И Стр.Агент<>Менеджер Тогда
//			////	//
//			//	ТЗ1.Удалить(Стр);
//			//Иначе
//			Если ФильтрПоПодразделению И Стр.Подразделение <> Подразделение Тогда
//				////	//
//				ТЗ1.Удалить(Стр);
//			ИначеЕсли (НЕ ОтображатьОплатыИсключенныеИзРасчетаЗП) И Стр.ИсключитьИзРасчетаЗП Тогда
//				ТЗ1.Удалить(Стр);
//			ИначеЕсли  СтраховойПолис = ПустойПолис Тогда
//				ТЗ1.Удалить(Стр);
//			ИначеЕсли  СпПометкаУдаления  Тогда
//				ТЗ1.Удалить(Стр);
//			ИначеЕсли  Стр.ПометкаУдаления  Тогда
//				ТЗ1.Удалить(Стр);
//			//ИначеЕсли  Стр.НомерЗаявки = кЛичнаяЗаявка Тогда
//			ИначеЕсли  Стр.СхемаРасчетаСМенеджером = СхемаПоАВ Тогда
//				ТЗ1.Удалить(Стр);	
//			ИначеЕсли ФильтрПоСП И Стр.СП_ВидСП <> ВидСП Тогда	
//				ТЗ1.Удалить(Стр);	
//			КонецЕсли;
//		КонецЦикла;	
//		
//	КонецЕсли;
//	
//	ТЗ1.Колонки.Добавить("ИнфоКВМ", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0)));
//	ТЗ1.Колонки.Добавить("НеВыводить",Новый ОписаниеТипов("Число"));
//	Если СоотвИнфоКВМ.Количество() > 0 Тогда
//		Для Каждого Стр ИЗ ТЗ1 Цикл
//			ИнфоКВМ = СоотвИнфоКВМ.Получить(Стр.Номер);
//			Если ИнфоКВМ <> Неопределено Тогда
//				Стр.ИнфоКВМ	= ИнфоКВМ;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//	//Создаем список Агентов, по которым есть оплаты 
//	//ТЗАгентов = ТЗ1.Скопировать(,"Агент");
//	//ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера");
//	
//	//	Если ФильтрПоменеджеру Тогда
//	//СтрокаМенеджера = ТЗАгентов.Добавить();
//	//СтрокаМенеджера.Агент = Менеджер;
//	//СтрокаМенеджера.ВознаграждениеМенеджера  = 0;
//	//	КонецЕсли;	
//	ТЗАгентов = ТЗ1.Скопировать(,"Агент,ВознаграждениеМенеджера,ВычетСАгента");
//	ТЗАгентов.Свернуть("Агент","ВознаграждениеМенеджера,ВычетСАгента");
//	ТЗАгентов.Колонки.Добавить("Подразделение", ОписаниеТипа_Подразделение);
//	
//	ТЗАгентов.Колонки.Добавить("ЕстьОплатыПоАгенту",ОписаниеТипаБулево);
//	ТЗАгентов.ЗаполнитьЗначения(Истина, "ЕстьОплатыПоАгенту");
//	
//	//Подготавливаем ТЗАгентов для обновления подразделений по агентам 
//	
//	
//	//Обновляем подразделения в списке Агентов
//	Для Каждого Стр ИЗ ТЗАгентов Цикл
//		
//		//Сначала пытаемся получить подразделение на конец месяца в режиме возврата пустого подразделения, если не найдено
//		Уволен = Ложь;
//		НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, КонецМесяца(ЗарплатныйПериод), Истина, Уволен);
//		Если НовПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
//			//Если не найдено, получаем подразделение на начало месяца в режиме возврата НЕ пустого подразделения
//			НовПодразделение = уб_СС.ПолучитьПодразделениеАгента(Стр.Агент, НачалоМесяца(ЗарплатныйПериод), Ложь, Уволен);
//		КонецЕсли;
//		//Если Уволен Тогда
//		//	Стр.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
//		//Иначе	
//		Стр.Подразделение = НовПодразделение;
//		//КонецЕсли;	
//		
//	КонецЦикла;
//	//Получаем список подразделений, в которых были оплаты
//	тзПодразделенийСОплатами = ТЗАгентов.Скопировать(,"Подразделение");
//	тзПодразделенийСОплатами.Свернуть("Подразделение");
//	
//	//Получаем список ВСЕХ подразделений, которые могут продавать
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//				   |	П.Ссылка,
//				   |	П.Наименование
//				   |ИЗ
//				   |	Справочник.ПодразделенияОрганизаций КАК П
//				   |ГДЕ
//				   |	П.ТипПодразделения В(&ТипыПодразделения)";
//	
//	ТипыПодразделения = Новый СписокЗначений;
//	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ГоловнойОфис);
//	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.ТочкаПродаж);
//	ТипыПодразделения.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВС);
//	
//	Запрос.УстановитьПараметр("ТипыПодразделения", ТипыПодразделения);
//	
//	Если ФильтрПоПодразделению Тогда
//		Запрос.Текст = Запрос.Текст + " И П.Ссылка = &Подразделение ";
//		Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	Иначе	
//		//	Если ФильтрПоМенеджеру Тогда
//		СпЗн = Новый СписокЗначений;
//		Для каждого Стр Из ТЗАгентов Цикл
//			СпЗн.Добавить(Стр.Подразделение);
//		КонецЦикла; 
//		Запрос.Текст = Запрос.Текст + " И П.Ссылка В (&Подразделение) ";
//		Запрос.УстановитьПараметр("Подразделение", СпЗн);
//		//	КонецЕсли;
//	КонецЕсли;
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	тзПодразделений = Новый ТаблицаЗначений;
//	Кол = тзПодразделений.Колонки;
//	Кол.Добавить("Подразделение",							ОписаниеТипа_Подразделение);
//	Кол.Добавить("НаименованиеПодразделения",				ОписаниеТипаСтрока);
//	Кол.Добавить("Руководитель",							ОписаниеТипа_ФизЛицо);
//	Кол.Добавить("РуководительПолучаетВознаграждение",		ОписаниеТипаБулево);
//	Кол.Добавить("СхемаВознагражденияРуководителяОП",		ОписаниеТипаСхемВознРукОП);
//	Кол.Добавить("ПроцентнаяСтавкаДоМинимальногоПорога_РОП",ОписаниеТипаПроцент);
//	Кол.Добавить("ПоказательМинимальногоПорога_РОП",		ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПроцентнаяСтавкаДоПлана_РОП",				ОписаниеТипаПроцент);
//	Кол.Добавить("ПоказательПлана_РОП",						ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПроцентнаяСтавкаПослеПлана_РОП",			ОписаниеТипаПроцент);
//	Кол.Добавить("ЕстьОплатыПоПодразделению",				ОписаниеТипаБулево);
//	Кол.Добавить("ПроцентКС_РОП",          				    ОписаниеТипаЧисло14_2_но);
//	
//	
//	СписокПодразделенийДляВыборки = Новый СписокЗначений;
//	ПрчСхемаВР = Перечисления.уб_ЗП_СхемыВознагражденияРуководителейОП; 
//	Пока Выборка.Следующий() Цикл
//		бНетОплатПоПодразделению = (тзПодразделенийСОплатами.Найти(Выборка.Ссылка) = Неопределено) И НЕ ФильтрПоМенеджеру; 
//		
//		МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Выборка.Ссылка);
//		Руководитель = МЗ.Сотрудник;
//		//Если не указан руководитель подразделения на данный период
//		//Или он не получает вознаграждения
//		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
//		Если (Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() ИЛИ НЕ МЗ.ПолучаетВознаграждениеЗаРуководство)
//			И бНетОплатПоПодразделению Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		//Далее ищем схему вознаграждения руководителя подразделения
//		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСРуководителемОП(НачалоДня(КонецМесяца(ЗарплатныйПериод)),,Выборка.Ссылка);
//		
//		//Также, если НЕ найдена схема вознаграждения руководителя подразделения 
//		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
//		Если тз.Количество() = 0 И бНетОплатПоПодразделению Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		//Также, если найдена схема вознаграждения руководителя подразделения "БезВознаграждения" 
//		//И при этом нет ни одной оплаты по подразделению, то исключаем такое подразделение из отчета
//		Если тз.Количество() > 0 И бНетОплатПоПодразделению Тогда
//			Если тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
//				Продолжить;
//			КонецЕсли;
//		КонецЕсли;
//		
//		//Добавляем подразделение в список 
//		НовСтрока = тзПодразделений.Добавить();	
//		НовСтрока.Подразделение				= Выборка.Ссылка;
//		НовСтрока.НаименованиеПодразделения	= Выборка.Наименование + ?(ЗначениеНеЗаполнено(Руководитель),""," (" + Руководитель.Наименование + ")");
//		НовСтрока.Руководитель				= Руководитель;
//		НовСтрока.РуководительПолучаетВознаграждение = МЗ.ПолучаетВознаграждениеЗаРуководство;
//		Если тз.Количество() = 0 ИЛИ тз[0].СхемаВознагражденияРуководителяОП = ПрчСхемаВР.БезВознаграждения Тогда
//			НовСтрока.СхемаВознагражденияРуководителяОП			= ПрчСхемаВР.БезВознаграждения;
//			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= 0;
//			НовСтрока.ПоказательМинимальногоПорога_РОП			= 0;
//			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= 0;
//			НовСтрока.ПоказательПлана_РОП						= 0;
//			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= 0;
//			НовСтрока.ПроцентКС_РОП  = 0 ;
//		Иначе	
//			Схема = тз[0];
//			НовСтрока.СхемаВознагражденияРуководителяОП			= Схема.СхемаВознагражденияРуководителяОП;
//			НовСтрока.ПроцентнаяСтавкаДоМинимальногоПорога_РОП	= Схема.ПроцентнаяСтавкаДоМинимальногоПорога;
//			НовСтрока.ПоказательМинимальногоПорога_РОП			= Схема.ПоказательМинимальногоПорога;
//			НовСтрока.ПроцентнаяСтавкаДоПлана_РОП				= Схема.ПроцентнаяСтавкаДоПлана;
//			НовСтрока.ПоказательПлана_РОП						= Схема.ПоказательПлана;
//			НовСтрока.ПроцентнаяСтавкаПослеПлана_РОП			= Схема.ПроцентнаяСтавкаПослеПлана;			
//			НовСтрока.ПроцентКС_РОП                             = Схема.ПроцентКС_РОП;
//			//Добавляем подразделение в список для последующей выборки агентов, работающих по схеме ПланПоСКВ
//			//Только для случая, когда руководитель получает процент от СКВ необходимо будет собрать в писок
//			//всех агентов подразделения, что бы посчитать суммарный план подразделения			
//			//В остальных случаях в список агентов подразделения (в отчете) попадут только те агенты, у которых есть оплаты		
//			//Так же исключаем случай, когда отчет фильтруется по конкретному менеджеру
//			Если //НЕ ФильтрПоМенеджеру И 
//				Схема.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ Тогда
//				СписокПодразделенийДляВыборки.Добавить(Выборка.Ссылка);
//			КонецЕсли;
//		КонецЕсли;                                                         
//		НовСтрока.ЕстьОплатыПоПодразделению = НЕ бНетОплатПоПодразделению;
//	КонецЦикла;
//	//##добавляем подразделения, где были оплаты в тзПодразделений
//	Для каждого Стр Из тзПодразделенийСОплатами Цикл		
//		Если тзПодразделений.Найти(Стр.Подразделение,"Подразделение")=Неопределено Тогда
//			НовСтрока = тзПодразделений.Добавить();	
//			НовСтрока.Подразделение	= Стр.Подразделение;
//		КонецЕсли;			
//	КонецЦикла; 	
//	//Формируем список всех агентов, которые в течение зарплатного периода присутствовали в выбранных подразделениях
//	//Если будут найдены агенты, которые не попали в главную выборку оплат (по пичине отсутствия у них оплат в этом периоде)
//	//то эти агенты будут добавлены в список	
//	//Запрос на получение списка сотрудников, работающих в подразделении в период отчета
//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	А.Агент,
//	|	А.Подразделение,
//	|	А.Период,
//	|	А.Организация
//	|ИЗ
//	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаНач, ) КАК А
//	|ГДЕ
//	|	А.Подразделение В(&Подразделения)
//	|	И (НЕ А.Выбытие)
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	А.Агент,
//	|	А.Подразделение,
//	|	А.Период,
//	|	А.Организация
//	|ИЗ
//	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
//	|ГДЕ
//	|	А.Подразделение В(&Подразделения)
//	|	И (НЕ А.Выбытие)
//	|	И А.Период МЕЖДУ &ДатаНач И &ДатаКон";
//	
//	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаКон", ДатаКонца);	
//	Запрос.УстановитьПараметр("Подразделения", СписокПодразделенийДляВыборки);	
//	ВыборкаАгентов = Запрос.Выполнить().Выбрать();
//	
//	//Подготавливаем ТЗАгентов для сравнения дублирующихся записей
//	//Возможны случаи, когда агент переходил из подразделения в подразделение в течение месяца
//	//Тогда подразделением Агента считается подразделение, в котором он числился позже всего
//	
//	//Не рассматриваем работу агента в разных подразделениях в течении месяца 
//	//По причине того, что придется пропорционально времени работы в подразделениях делить план (в случае работы по схеме план)
//	//Учет ведем по последнему подразделению, в котором работал сотрудник в отчетном периоде (даже если он работал всего один последний день)
//	
//	ТЗАгентов.Колонки.Добавить("ДатаПоступленияВПодразделение",ОписаниеТипаДата);
//	
//	Пока ВыборкаАгентов.Следующий() Цикл
//		НайденныйАгент	= ТЗАгентов.НайтиСтроки(Новый Структура("Агент",ВыборкаАгентов.Агент)); 
//		Если НайденныйАгент.Количество()=0 Тогда
//			//Добавляем нового агента
//			НовАгент								= ТЗАгентов.Добавить();
//			НовАгент.Агент							= ВыборкаАгентов.Агент;
//			НовАгент.Подразделение					= ВыборкаАгентов.Подразделение.Ссылка;
//			НовАгент.ДатаПоступленияВПодразделение	= ВыборкаАгентов.Период;
//			НовАгент.ВознаграждениеМенеджера 		= 0;
//			НовАгент.ВычетСАгента					= 0;
//		Иначе
//			НайденныйАгент = НайденныйАгент[0];
//			Если НайденныйАгент.Подразделение <> ВыборкаАгентов.Подразделение 
//				И НайденныйАгент.ДатаПоступленияВПодразделение < ВыборкаАгентов.Период Тогда
//				НайденныйАгент.Подразделение = ВыборкаАгентов.Подразделение.Ссылка;
//				НайденныйАгент.ДатаПоступленияВПодразделение = ВыборкаАгентов.Период;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	//Теперь выберем всех агентов, у которых встречаются оплаты по схеме "ПланПоСКВ"
//	СтруктураОтбора				= Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
//	ТЗАгентовПоСхемеПланПоСКВ	= ТЗ1.Скопировать(СтруктураОтбора, "Агент,СхемаРасчетаСМенеджером");
//	ТЗАгентовПоСхемеПланПоСКВ.Свернуть("Агент,СхемаРасчетаСМенеджером");
//	//Для таких агентов заполним параметры Плана и СуперПлана
//	Кол = ТЗАгентов.Колонки;
//	Кол.Добавить("План",							ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ШтрафнойПлан",							ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("Количество",						ОписаниеТипаЧисло12_0);
//	Кол.Добавить("СуперПлан",						ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПерваяБонусПланка",				ОписаниеТипаЧисло14_2_но);//2012
//	Кол.Добавить("ПроцентнаяСтавкаДоПлана",			ОписаниеТипаПроцент);
//	Кол.Добавить("ПроцентнаяСтавкаПослеПлана",		ОписаниеТипаПроцент);
//	Кол.Добавить("ПроцентнаяСтавкаПослеПервойБонусПланки",	ОписаниеТипаПроцент);//201212
//	Кол.Добавить("ПроцентнаяСтавкаПослеСуперПлана",	        ОписаниеТипаПроцент);
//	Кол.Добавить("ЕстьПланПоСКВ",					ОписаниеТипаБулево);
//	Кол.Добавить("ЭтотАгентЕстьВТЗ1",				ОписаниеТипаБулево);
//	Кол.Добавить("УАгентаПланПоСКВ",				ОписаниеТипаБулево);
//	Кол.Добавить("ВыполненПланПоСКВ",				ОписаниеТипаБулево);
//	//Итоги СКВ по КС
//	Кол.Добавить("СКВ_КС",							ОписаниеТипаЧисло14_2_но);
//	тзПодразделений.Колонки.Добавить("СКВ_КС",			ОписаниеТипаЧисло14_2_но);
//	тзПодразделений.Колонки.Добавить("ВыполненПланПоСКВ", ОписаниеТипаБулево);
//	тзАгентов.Сортировать("Агент,ДатаПоступленияВПодразделение УБЫВ");
//	ТЗАгентов.Индексы.Добавить("Агент");

//	//Пробегаем по агентам 
//	//И для тех, кто входит в подразделение, с расчетом вознаграждения рауководителя по схеме ПроцентОтСКВ
//	//А так же для тех агентов, у кого есть оплаты по схеме "ПланПоСКВ"
//	//- заполним параметры Плана и СуперПлана
//	Для Каждого Стр ИЗ ТЗАгентов Цикл
//		НайденноеПодразделение	=	тзПодразделений.Найти(Стр.Подразделение);
//		бСхемаРОП_ПроцентОтСКВ	=	(НайденноеПодразделение <> Неопределено) 
//								И НайденноеПодразделение.РуководительПолучаетВознаграждение = Истина 
//								и (НайденноеПодразделение.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ);
//		бЕстьОплатаПоПлануПоСКВ	=	ТЗАгентовПоСхемеПланПоСКВ.Найти(Стр.Агент) <> Неопределено;
//		
//		Если бСхемаРОП_ПроцентОтСКВ ИЛИ бЕстьОплатаПоПлануПоСКВ Тогда
//			
//			ШтрафнойПлан = ПолучитьШтрафнойПлан(Стр.Агент,НачалоДня(КонецМесяца(ЗарплатныйПериод)));
//			
//			тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
//			Если тз.Количество() > 0 Тогда
//				Стр.План = тз[0].План+ШтрафнойПлан;
//				Стр.ШтрафнойПлан = ШтрафнойПлан;
//				Если Стр.План = 0 Тогда
//					Стр.Количество = 0;
//				Иначе
//					Стр.Количество = тз[0].Количество;
//				КонецЕсли;
//			Иначе
//				Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
//			КонецЕсли;
//			
//			тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.СуперПлан<>0");
//			Если тз.Количество() > 0 Тогда
//				Стр.СуперПлан = тз[0].СуперПлан+?(ЭтоВариант20150601=Истина,ШтрафнойПлан,0);
//			Иначе
//				Сообщить("ВНИМАНИЕ! Не найдено значение Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
//			КонецЕсли;
//			
//			Если ЭтоВариант20121201 Тогда
//				тз = уб_СтраховойБрокер.ПолучитьСуперПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент," И Т.ПерваяБонусПланка<>0");
//				Если тз.Количество() > 0 Тогда
//					Стр.ПерваяБонусПланка = тз[0].ПерваяБонусПланка+?(ЭтоВариант20150601=Истина,ШтрафнойПлан,0);//201212	Стр.СуперПлан = тз[0].СуперПлан;
//				Иначе
//					Сообщить("ВНИМАНИЕ! Не найдено значение min Бонус-Планки по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
//				КонецЕсли;
//			КонецЕсли;
//			
//			тз = уб_СтраховойБрокер.ПолучитьПроцентныеСтавкиПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
//			Если тз.Количество() > 0 Тогда
//				Стр.ПроцентнаяСтавкаДоПлана			= тз[0].ПроцентнаяСтавкаДоПлана;
//				Стр.ПроцентнаяСтавкаПослеПлана		= тз[0].ПроцентнаяСтавкаПослеПлана;
//				Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = тз[0].ПроцентнаяСтавкаОтПервойБонусПланки;//201212
//				Стр.ПроцентнаяСтавкаПослеСуперПлана = тз[0].ПроцентнаяСтавкаПослеСуперПлана;
//			Иначе
//				Сообщить("ВНИМАНИЕ! Не найдена информация по ставкам ПланаПоСКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
//			КонецЕсли;
//			Стр.ЕстьПланПоСКВ = Истина;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	//Теперь В ТЗАгентов Есть все данные для получения общего плана подразделения, работающего по схеме ПланПоСКВ	
//	
//	//В таблице ТЗ1 есть сведения об СКВ
//	//Произведем корректировку значения подразделений для выборки оплат, находящейся в ТЗ1
//	ТЗ1.Колонки.Добавить("ЕстьПланПоСКВ",		ОписаниеТипаБулево);
//	ТЗ1.Колонки.Добавить("УАгентаПланПоСКВ",	ОписаниеТипаБулево);
//	ТЗ1.Колонки.Добавить("Пустышка", ОписаниеТипаБулево);
//	ТЗ1.Колонки.Добавить("СКВ_КС", ОписаниеТипаЧисло14_2_но);
//	ТЗ1.Колонки.Добавить("БОНУС_КС", ОписаниеТипаЧисло14_2_но);
//	ТЗ1.Колонки.Добавить("БОНУС_РОП_КС", ОписаниеТипаЧисло14_2_но);
//	СтрокаТЗАгентов = Неопределено;
//	Для Каждого Стр ИЗ ТЗ1 Цикл
//		Если (СтрокаТЗАгентов = Неопределено) ИЛИ (Стр.Агент<>СтрокаТЗАгентов.Агент) Тогда
//			СтрокаТЗАгентов = ТЗАгентов.Найти(Стр.Агент);
//		КонецЕсли;
//		Если СтрокаТЗАгентов <> Неопределено Тогда
//			
//			Стр.Подразделение = СтрокаТЗАгентов.Подразделение;
//			Стр.ЕстьПланПоСКВ = СтрокаТЗАгентов.ЕстьПланПоСКВ;
//			СтрокаТЗАгентов.ЭтотАгентЕстьВТЗ1 = Истина;
//		Иначе
//			Сообщить("Ошибка: не найден агент из оплаты " + Строка(Стр.Агент) + " в промежуточной таблице агентов");
//			продолжить;
//		КонецЕсли;
//		Если Стр.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
//			СтрокаТЗАгентов.УАгентаПланПоСКВ = Истина;
//			Стр.УАгентаПланПоСКВ = Истина;
//		КонецЕсли;	
//		
//	КонецЦикла;
//	
//	//+++++++++++ТЕСТЫ++++++++++++
//	//ТЗ1.Скопировать(Новый Структура("Агент",Справочники.ФизическиеЛица.НайтиПонаименованию("Митенков"))).Итог("СКВ")
//	//+++++++++++ТЕСТЫ++++++++++++
//	
//	//Добавляем в ТЗ1 пустые строки для Агентов, у которых не было оплат
//	
//	//ТЗ1.Колонки.Добавить("ВК", ОписаниеТипаЧисло14_2_но);
//	
//	//ЗапросВК  = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер как Менеджер,
//	//						 |	СУММА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера) КАК ОплатитьВКассуЗаВыездКурьера
//	//						 |ИЗ
//	//						 |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
//	//						 |ГДЕ
//	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен
//	//						 |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.isConfirmed
//	//						 |	И КонецПериода(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,МЕСЯЦ) = &ДатаКонца
//	//						 |
//	//						 |СГРУППИРОВАТЬ ПО
//	//						 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер");
//	//ЗапросВК.УстановитьПараметр("ДатаКонца",ДатаКонца);						 
//	//ВыборкаВК = ЗапросВК.Выполнить().Выбрать();						 
//	
//	Для Каждого Стр ИЗ ТЗАгентов Цикл
//		
//		//Добавляем пустышку для вознаграждения курьера
//		//ВыборкаВК.Сбросить();
//		//СтруктураПоиска = Новый Структура("Менеджер",Стр.Агент);
//		//Если ВыборкаВК.НайтиСледующий(СтруктураПоиска) Тогда
//		//	НовОплата					= ТЗ1.Добавить();
//		//	НовОплата.Агент 			= Стр.Агент;		
//		//	НовОплата.Подразделение		= Стр.Подразделение;
//		//	НовОплата.Организация 		= Стр.Подразделение.Владелец;
//		//	НовОплата.Пустышка			= Истина;
//		//	НовОплата.УАгентаПланПоСКВ	= Истина;
//		//	Стр.УАгентаПланПоСКВ		= Истина;
//		//	тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(ЗарплатныйПериод, , Стр.Подразделение, Стр.Агент);
//		//	//НовОплата.ВК =   ВыборкаВК.ОплатитьВКассуЗаВыездКурьера;
//		//КонецЕсли;	
//		
//		//Если НЕ Стр.ЭтотАгентЕстьВТЗ1 Тогда
//			 ДобавитьПустышку(тз1,Стр);
//		//КонецЕсли;
//	КонецЦикла;
//	////////////////////////////////////////////////////////
//	//ЭТАП №2. ОБРАБОТКА ПОЛУЧЕННЫХ ДАННЫХ
//	////////////////////////////////////////////////////////
//	Если НЕ ЭтоВариант20150801 Тогда
//		СтруктураОтбора 	= Новый Структура("УАгентаПланПоСКВ", Истина);
//		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
//	Иначе
//		//Сверху определена Структура отбора по Схеме, а не по виду 	
//		СтруктураОтбора3 	= Новый Структура("УАгентаПланПоСКВ", Истина);//!!!	Временно: таблица подразделений собирается по таблице агентов, а там нет разбивки по схемам, а сразу в этих колонках отобранные для СКВ
//	КонецЕсли;
//	
//	СтруктураОтбора2	= Новый Структура("УАгентаПланПоСКВ", Ложь);  //!!!
//	
//	СписокПодразделенийИзТЗ1 = ТЗ1.Скопировать(, "Подразделение");	
//	СписокПодразделенийИзТЗ1.Свернуть("Подразделение");
//	
//	ТЗАгентов.Колонки.Добавить("БОНУС_РОП_КС",	ОписаниеТипаЧисло14_2_но);
//	Если ЭтоВариант20121001 Тогда
//		//
//		//Проверка заданных справочником крупных сделок на Порог КС 
//		ТЗ1.Индексы.Добавить("ЭтоКрупнаяСделка");
//		
//		ТЗКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ));	
//		ТЗКрупныхСделок.Свернуть("Сделка","КВСуммаДляАгента,СКВ");
//		//
//		Для каждого СтрокаКС из  ТЗКрупныхСделок Цикл
//			Сделка = СтрокаКС.Сделка;
//			Если Сделка = Справочники.уб_Сделки.ПустаяСсылка() Тогда
//				Сообщить("Ошибочно установленный флаг большой сделки у оплаты");
//				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
//				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
//					Сообщить("Оплата "+СтрокаКСТекущейСделки.Номер);
//				КонецЦикла;	 
//			КонецЕсли;	
//			Если СтрокаКС.КВСуммаДляАгента<РазмерКС И уб_РасчетыСМенеджерами.ПолучитьПолноеКВСделки(Сделка)<РазмерКС Тогда
//				//Сделка не достигла размера крупной сделки(КС) убираем признак КС
//				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
//				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
//					СтрокаКСТекущейСделки.ЭтоКрупнаяСделка = Ложь;
//				КонецЦикла;	
//			Иначе
//				СтрокиПоСделке = ТЗ1.НайтиСтроки(Новый Структура("Сделка",Сделка));
//				Для каждого СтрокаКСТекущейСделки из СтрокиПоСделке Цикл
//					Если ЭтоВариант20150901 Тогда
//						СтрокаКСТекущейСделки.БОНУС_РОП_КС = 0;	
//					Иначе
//						СтрокаКСТекущейСделки.БОНУС_РОП_КС = СтрокаКСТекущейСделки.СКВ * (СтрокаКСТекущейСделки.БонусПроцентРОП)/100;	
//					КонецЕсли;
//					
//				КонецЦикла;	
//			КонецЕсли;	
//		КонецЦикла;
//		//Автоматическое определение КС
//		ТЗПотенцКрупныхСделок = ТЗ1.Скопировать(Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером",Ложь,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ),"Страхователь,КВСуммаДляАгента,СКВ,Дата");	
//		КопияПотенцКС =  ТЗПотенцКрупныхСделок.Скопировать();//,"Страхователь,КВСуммаДляАгента,СКВ,Дата");
//		ТЗПотенцКрупныхСделок.Свернуть("Страхователь","КВСуммаДляАгента,СКВ");
//		
//		Для каждого СтрокаКС из  ТЗПотенцКрупныхСделок Цикл
//			Если СтрокаКС.КВСуммаДляАгента>=РазмерКС Тогда
//				//Дополняем явные крупные сделки автоопределенными 
//				СтрокиПоСтрахователю = ТЗ1.НайтиСтроки(Новый Структура("ЭтоКрупнаяСделка,Страхователь",Ложь,СтрокаКС.Страхователь));
//				//Обпределим дату сделки
//				ТаблицаПоСтрахователю = КопияПотенцКС.Скопировать(Новый Структура ("Страхователь",СтрокаКС.Страхователь),"");
//				ТаблицаПоСтрахователю.Сортировать("Дата УБЫВ");
//				
//				Сделка = Справочники.уб_Сделки.ПолучитьСсылку(); //сгенерируем ссылку для сделки
//				
//				Для каждого СтрокаКССтрахователя из СтрокиПоСтрахователю Цикл
//					Если НЕ СтрокаКССтрахователя.НеОплачиватьКС = Истина Тогда
//						//Для подразделения может быть укзана настройка, чтобы не оплатить КС
//						СтрокаКССтрахователя.Сделка = Сделка;
//						СтрокаКССтрахователя.ЭтоКрупнаяСделка = Истина;
//						СтрокаКССтрахователя.ДатаСделки      = ТаблицаПоСтрахователю[0].Дата;
//						СтрокаКССтрахователя.БонусПроцент    = 5;
//						мСтрок = тзПодразделений.НайтиСтроки(Новый Структура("Подразделение",СтрокаКССтрахователя.Подразделение));
//						Если мСтрок.Количество() = 0  Тогда
//							СтрокаКССтрахователя.БонусПроцентРОП = 5;
//						Иначе
//							СтрокаКССтрахователя.БонусПроцентРОП = Число(мСтрок[0].ПроцентКС_РОП);
//						КонецЕсли;	
//						Если ЭтоВариант20150901 Тогда
//							СтрокаКССтрахователя.БОНУС_РОП_КС = 0;
//						Иначе
//							СтрокаКССтрахователя.БОНУС_РОП_КС = СтрокаКССтрахователя.СКВ * (СтрокаКССтрахователя.БонусПроцентРОП)/100;
//						КонецЕсли;
//						
//					Иначе
//						//
//						Сделка = Неопределено;
//					КонецЕсли;
//				КонецЦикла;	
//				//КонецЕсли;	
//			КонецЕсли;
//		КонецЦикла;	
//		СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,СхемаРасчетаСМенеджером", Истина,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
//		//МассивКС = ТЗ1.НайтиСтроки(СтруктураОтбора);
//		//Для каждого СтрокаКС из МассивКС Цикл
//		//	СтрокаКС.СКВ_КС       = СтрокаКС.СКВ;
//		//	СтрокаКС.БОНУС_КС     = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцент/100;
//		//	СтрокаКС.БОНУС_РОП_КС = СтрокаКС.СКВ_КС * СтрокаКС.БонусПроцентРОП/100;
//		//КонецЦикла;	
//		ТЗКрупныхСделок = ТЗ1.Скопировать(СтруктураОтбораКС);	
//		ТЗКрупныхСделокДляИтогов = ТЗКрупныхСделок.Скопировать(,"Агент,Подразделение,СКВ");
//		ТЗКрупныхСделокДляИтогов.Свернуть("Агент,Подразделение","СКВ");
//		Для Каждого СтрокаАгентаКС из ТЗКрупныхСделокДляИтогов Цикл
//			СтрокаАгента = ТЗАгентов.Найти(СтрокаАгентаКС.Агент,"Агент");
//			Если СтрокаАгента = Неопределено Тогда
//				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
//			Иначе
//				СтрокаАгента.СКВ_КС = СтрокаАгентаКС.СКВ;
//			КонецЕсли;	
//		КонецЦикла;
//		ТЗКрупныхСделокДляИтогов.Свернуть("Подразделение","СКВ");
//		Для Каждого СтрокаПодразделенияКС из ТЗКрупныхСделокДляИтогов Цикл
//			СтрокаПодразделения = ТЗПодразделений.Найти(СтрокаПодразделенияКС.Подразделение,"Подразделение");
//			Если СтрокаПодразделения = Неопределено Тогда
//				Сообщить("Не найдена строка подразделения КС, сообщите разработчикам");
//			Иначе
//				СтрокаПодразделения.СКВ_КС = СтрокаПодразделенияКС.СКВ;
//			КонецЕсли;	
//		КонецЦикла;
//		//Итоги Бонуса РОП по КС
//		ТЗИтоговРОП = ТЗ1.Скопировать(,"Агент,Подразделение,БОНУС_РОП_КС");	
//		ТЗИтоговРОП.Свернуть("Агент,Подразделение","БОНУС_РОП_КС");
//		//
//		Для каждого СтрокаИтогов из ТЗИтоговРОП Цикл
//			СтрокаАгента = ТЗАгентов.Найти(СтрокаИтогов.Агент,"Агент");
//			Если СтрокаАгента = Неопределено Тогда
//				Сообщить("Не найдена строка агента КС, сообщите разработчикам");
//			Иначе
//				СтрокаАгента.БОНУС_РОП_КС = СтрокаИтогов.БОНУС_РОП_КС;
//			КонецЕсли;	
//		КонецЦикла;
//	КонецЕсли;	
//	тзСхемаРасчетаДляАгентов = ТЗ1.Скопировать(, "Агент,СхемаРасчетаСМенеджером");
//	тзСхемаРасчетаДляАгентов.Свернуть("Агент,СхемаРасчетаСМенеджером");
//	тзСуммыВМ_ПоПодразделениям = ТЗ1.Скопировать(СтруктураОтбора2, "Организация,Агент,Подразделение,ВознаграждениеМенеджера");
//	тзСуммыВМ_ПоПодразделениям.Свернуть("Подразделение","ВознаграждениеМенеджера");
//	тзСуммы_ДляПланаПоСКВ_ПоАгентам = ТЗ1.Скопировать(СтруктураОтбора, "Агент,Подразделение,СКВ,НачисленнаяСуммаВзноса, КоличествоФакт");
//	тзСуммы_ДляПланаПоСКВ_ПоАгентам.Свернуть("Агент,Подразделение","СКВ,НачисленнаяСуммаВзноса, КоличествоФакт");
//	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП = ТЗ1.Скопировать(, "Агент,Подразделение,СКВ,НачисленнаяСуммаВзноса");
//	//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Свернуть("Агент,Подразделение","СКВ,НачисленнаяСуммаВзноса");
//	тзСуммыПлановПоСКВ_ПоПодразделениям = ТЗАгентов.Скопировать(, "Агент,Подразделение,План,ШтрафнойПлан,Количество");//СтруктураОтбора убрал
//	тзСуммыПлановПоСКВ_ПоПодразделениям.Свернуть("Подразделение","План,ШтрафнойПлан,Количество");
//	тзСуммыСКВ_ПоПодразделениям = ТЗ1.Скопировать(, "Подразделение,СКВ,КоличествоФакт");//тзСуммы_ДляПланаПоСКВ_ПоАгентамДляП.Скопировать(,"Агент,Подразделение,СКВ");
//	тзСуммыСКВ_ПоПодразделениям.Свернуть("Подразделение","СКВ,КоличествоФакт");
//	//Заполняем Фактические параметры для подразделений 
//	Кол = тзПодразделений.Колонки;
//	Кол.Добавить("СуммаВМ",								ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоПодразделению",	ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("КоличествоФакт_ПоПодразделению",		ОписаниеТипаЧисло12_0);
//	Кол.Добавить("СКВ_ПоПодразделениямДоСП",			ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ИтогоЗПпоПодразделению",				ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("СуммаПлана",							ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("СуммаКоличествоПлан",					ОписаниеТипаЧисло12_0);
//	Кол.Добавить("ИтогоЗПОрг",							ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("СуммаПланаОрг",						ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("СуммаКоличествоПланОрг",				ОписаниеТипаЧисло12_0);
//	Кол.Добавить("Организация",							ОписаниеТипа_Организации);
//	Кол.Добавить("СуммаВознаграждения_РОПОрг",			ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПроцентВыполненияПлана_РОП",			ОписаниеТипаПроцент);
//	Кол.Добавить("СтавкаВознаграждения_РОП",			ОписаниеТипаПроцент);
//	Кол.Добавить("СуммаВознаграждения_РОП",				ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ЭтоПодразделениеЕстьВТЗ1", 			ОписаниеТипаБулево);
//	Для Каждого Стр ИЗ тзПодразделений Цикл
//		Стр.Организация = Стр.Подразделение.Владелец;
//		Если СписокПодразделенийИзТЗ1.Найти(Стр.Подразделение,"Подразделение") <> Неопределено Тогда
//			Стр.ЭтоПодразделениеЕстьВТЗ1 = Истина;
//		КонецЕсли;
//		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
//		Если СтрокаСуммыПлана <> Неопределено Тогда
//			Стр.СуммаПлана = СтрокаСуммыПлана.План-СтрокаСуммыПлана.ШтрафнойПлан;
//			Стр.СуммаКоличествоПлан = СтрокаСуммыПлана.Количество;
//		КонецЕсли;
//		
//		СтрокаСуммыСКВ = тзСуммыСКВ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
//		Если СтрокаСуммыСКВ <> Неопределено Тогда
//			Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению = СтрокаСуммыСКВ.СКВ;
//			Стр.КоличествоФакт_ПоПодразделению = СтрокаСуммыСКВ.КоличествоФакт;
//		КонецЕсли;
//		СтрокаСуммыВМ = тзСуммыВМ_ПоПодразделениям.Найти(Стр.Подразделение,"Подразделение");
//		Если СтрокаСуммыВМ <> Неопределено Тогда
//			Стр.СуммаВМ = СтрокаСуммыВМ.ВознаграждениеМенеджера;
//		КонецЕсли;
//		бСхПроцентОтСКВ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтСКВ;
//		бСхПроцентОтВМ	= Стр.СхемаВознагражденияРуководителяОП = ПрчСхемаВР.ПроцентОтВМ;
//		Если бСхПроцентОтСКВ Тогда
//			колПланРукВыполнен = ЭтоВариант20130901=ЛОЖЬ ИЛИ Стр.СуммаКоличествоПлан=0 ИЛИ Стр.КоличествоФакт_ПоПодразделению>=Стр.СуммаКоличествоПлан;
//			Если Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательПлана_РОП / 100 Тогда
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП-?(колПланРукВыполнен,0,1);	
//			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.СуммаПлана * Стр.ПоказательМинимальногоПорога_РОП / 100 Тогда
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП-?(колПланРукВыполнен,0,1);	
//			Иначе
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+?(колПланРукВыполнен и ЭтоВариант20130901,1,0);	
//			КонецЕсли;
//			Если ЭтоВариант20120401  Тогда 
//				//В этом случае расчет может быть скорректирован
//			ИначеЕсли ЭтоВариант20121001 Тогда
//				//
//				Стр.СуммаВознаграждения_РОП	= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению) * Стр.СтавкаВознаграждения_РОП / 100;	
//				//Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению-Стр.СКВ_КС) * Стр.СтавкаВознаграждения_РОП / 100;	
//			Иначе
//				Стр.СуммаВознаграждения_РОП	= Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению * Стр.СтавкаВознаграждения_РОП / 100;	
//			КонецЕсли;	
//			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.СуммаПлана = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.СуммаПлана * 100);	
//		ИначеЕсли бСхПроцентОтВМ Тогда	
//			//Для схемы вознаграждения руководителя  ПроцентОтВМ значения показателей имеет иной смысл:
//			Если Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательПлана_РОП Тогда
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаПослеПлана_РОП;	
//			ИначеЕсли Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению >= Стр.ПоказательМинимальногоПорога_РОП Тогда
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоПлана_РОП;	
//			Иначе
//				Стр.СтавкаВознаграждения_РОП = Стр.ПроцентнаяСтавкаДоМинимальногоПорога_РОП;	
//			КонецЕсли;
//			Стр.СуммаВознаграждения_РОП		= Стр.СуммаВМ * Стр.СтавкаВознаграждения_РОП / 100;	
//			Стр.ПроцентВыполненияПлана_РОП	= ?(Стр.ПоказательПлана_РОП = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоПодразделению / Стр.ПоказательПлана_РОП * 100);	
//		КонецЕсли;
//		Если НЕ Стр.РуководительПолучаетВознаграждение Тогда
//			Стр.СуммаВознаграждения_РОП = 0;
//		КонецЕсли;	
//	КонецЦикла;
//	//Добавляем в ТЗ1 пустые строки для Подразделений, у которых небыло оплат
//	Для Каждого Стр ИЗ тзПодразделений Цикл
//		Если НЕ Стр.ЭтоПодразделениеЕстьВТЗ1 Тогда
//			НовОплата				= ТЗ1.Добавить();
//			НовОплата.Подразделение	= Стр.Подразделение;		
//			НовОплата.Пустышка		= Истина;	
//			НовОплата.СКВ = 0;
//			НовОплата.КоличествоФакт = 0;
//			НовОплата.КоэффициентВида = 0;			
//			НовОплата.НовыйКлиент = 0;			
//			НовОплата.НовыйКлиентСКВ = 0;						
//			
//			НовОплата.ОплаченоФакт = 0;
//			НовОплата.НачисленнаяСуммаВзноса = 0;
//			НовОплата.СкидкаВыплаченаяКлиенту = 0;
//			НовОплата.КВСумма = 0;
//			НовОплата.КВСуммаДляАгента = 0; 
//			НовОплата.ВознаграждениеМенеджера = 0;
//			НовОплата.ВычетСАгента = 0;
//			НовОплата.АВилиСкидкаСумма  = 0;
//			НовОплата.Ед = 0;
//		КонецЕсли;
//	КонецЦикла;	
//	//Заполняем Фактические параметры для Агентов 
//	Кол = ТЗАгентов.Колонки;
//	Кол.Добавить("СКВ_ДляПланаПоСКВ_ПоАгенту",	ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("КоличествоФакт_ПоАгенту",		ОписаниеТипаЧисло12_0);//_ПоАгенту
//	Кол.Добавить("СобраннаяСП",					ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПроцентВыполненияПлана",		ОписаниеТипаПроцент);
//	Кол.Добавить("СтавкаВознаграждения",		ОписаниеТипаПроцент);
//	Кол.Добавить("СКВдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
//	Кол.Добавить("СКВотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
//	Кол.Добавить("СКВот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
//	Кол.Добавить("СКВСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
//	Кол.Добавить("ЗПдоПлана",			ОписаниеТипаЧисло14_2_но); //До плана
//	Кол.Добавить("ЗПотПланадо1БП",			ОписаниеТипаЧисло14_2_но); //До ОтПлана1БП
//	Кол.Добавить("ЗПот1БПдо2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
//	Кол.Добавить("ЗПСвыше2БП",			ОписаниеТипаЧисло14_2_но); //До От1БПдо2БП
//	Кол.Добавить("ЗПотСКВдоСуперПлана",			ОписаниеТипаЧисло14_2_но); //До Первой БП
//	Кол.Добавить("ЗПЗаПревышение1БП",	        ОписаниеТипаЧисло14_2_но); //201212
//	Кол.Добавить("ПревышениеСуперплана",		ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ЗПотЗаПревышениеСуперПлана",	ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ИтогоЗП",						ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ВознаграждениеРуководителя",	ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("ПроцентРОП",	                ОписаниеТипаПроцент);
//	Кол.Добавить("ДельтаКСРуководитель",	ОписаниеТипаЧисло14_2_но);
//	
//	Кол.Добавить("БОНУС_КС_",ОписаниеТипаЧисло14_2_но);
//	Кол.Добавить("БратьВИтоги",ОписаниеТипаБулево);
//	СписокУчтенных = Новый Массив;
//	ЭтоПолныеПрава = ПолныеПрава();
//	ВыборкаМенеджеров = ВыполнениеПланаМенеджерами(ТЗАгентов.ВыгрузитьКолонку("Агент"), ЗарплатныйПериод);
//	
//	Для Каждого Стр ИЗ ТЗАгентов Цикл
//		Если СписокУчтенных.Найти(Стр.Агент) = Неопределено Тогда
//			Стр.БратьВИтоги = Истина;
//			СписокУчтенных.Добавить(Стр.Агент);
//		Иначе
//			Стр.БратьВИтоги = Ложь;
//		КонецЕсли;	
//		СтрокаСумм = тзСуммы_ДляПланаПоСКВ_ПоАгентам.Найти(Стр.Агент,"Агент"); //Тут таблица только по схеме
//		ДопПроцент = 0; //За выполнение НС при невыполнении плана по суммам
//		Если СтрокаСумм <> Неопределено Тогда
//			Стр.СКВ_ДляПланаПоСКВ_ПоАгенту	= СтрокаСумм.СКВ;
//			Стр.СобраннаяСП					= СтрокаСумм.НачисленнаяСуммаВзноса; 
//			Стр.ПроцентВыполненияПлана		= ?(Стр.План = 0,0,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту / Стр.План * 100); 
//			Стр.КоличествоФакт_ПоАгенту		= СтрокаСумм.КоличествоФакт;
//			//ПланВыполнен = уб_РасчетыСМенеджерами.ПланВыполнен(Стр.Агент,ЗарплатныйПериод,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План);
//			
//			СтруктураПоиска = Новый Структура;
//			СтруктураПоиска.Вставить("Менеджер", Стр.Агент);
//			ВыборкаМенеджеров.Сбросить();
//			
//			Если ВыборкаМенеджеров.НайтиСледующий(СтруктураПоиска) Тогда
//				ПланВыполнен = ВыборкаМенеджеров.ВыполненПлан;
//				РаскраситьКоличественныйПлан = Ложь;
//				РаскраситьПлан = Ложь;
//			//ИначеЕсли ЭтоВариант20181001 Тогда
//			//	СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
//			//	КоличественныйПланВыполнен = Стр.КоличествоФакт_ПоАгенту >= Стр.Количество;
//			//	ПланВыполнен = СуммовойПланВыполнен; //И КоличественныйПланВыполнен;
//			//	ДопПроцент = ?(КоличественныйПланВыполнен=Истина ,5,0);//
//			//	РаскраситьПлан = Не СуммовойПланВыполнен;
//			//	РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;	
//			ИначеЕсли ЭтоВариант20130801 Тогда
//				СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
//				КоличественныйПланВыполнен = Стр.КоличествоФакт_ПоАгенту >= Стр.Количество;
//				ПланВыполнен = СуммовойПланВыполнен И КоличественныйПланВыполнен;
//				ДопПроцент = ?(ПланВыполнен=ЛОЖЬ и КоличественныйПланВыполнен=Истина ,5,0);//За выполнение НС при невыполнении плана по суммам
//				РаскраситьПлан = Не СуммовойПланВыполнен;
//				РаскраситьКоличественныйПлан = Не КоличественныйПланВыполнен;
//			Иначе
//				СуммовойПланВыполнен = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту >= Стр.План;
//				ПланВыполнен = СуммовойПланВыполнен;
//				РаскраситьПлан = Не СуммовойПланВыполнен;
//				РаскраситьКоличественныйПлан = Ложь;
//			КонецЕсли;
//			РаскраситьПолеМенеджера = Не ПланВыполнен;
//			
//			Если РаскраситьПолеМенеджера = Истина Или РаскраситьПлан = Истина Или РаскраситьКоличественныйПлан = Истина Тогда
//				
//				НайденныеСтроки = тзАгентовДляРаскраски.НайтиСтроки(СтруктураПоиска);
//				Если НайденныеСтроки.Количество() > 0 Тогда
//					СтрокаМенеджера = НайденныеСтроки[0];
//				Иначе
//					СтрокаМенеджера = тзАгентовДляРаскраски.Добавить();
//					СтрокаМенеджера.Менеджер = Стр.Агент;
//					СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь;
//					СтрокаМенеджера.РаскраситьПлан = Ложь;
//					СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь;
//				КонецЕсли;
//				
//				Если СтрокаМенеджера.РаскраситьПолеМенеджера = Ложь Тогда
//					СтрокаМенеджера.РаскраситьПолеМенеджера = РаскраситьПолеМенеджера;
//				КонецЕсли;
//				
//				Если СтрокаМенеджера.РаскраситьПлан = Ложь Тогда
//					СтрокаМенеджера.РаскраситьПлан = РаскраситьПлан;
//				КонецЕсли;
//				
//				Если СтрокаМенеджера.РаскраситьКоличественныйПлан = Ложь Тогда
//					СтрокаМенеджера.РаскраситьКоличественныйПлан = РаскраситьКоличественныйПлан;
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//			Стр.ВыполненПланПоСКВ = ПланВыполнен;
//			Стр.СтавкаВознаграждения = ?(ПланВыполнен, Стр.ПроцентнаяСтавкаПослеПлана, Стр.ПроцентнаяСтавкаДоПлана+ДопПроцент);
//			Бонус_КС  = 0;
//			Если ЭтоВариант20121001 и (ЭтоВариант20150401=Истина ИЛИ ПланВыполнен = Истина) Тогда //Отработка не выполненного плана внутри
//				//
//				Если ПланВыполнен Тогда
//					СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС;
//				Иначе	
//					//Подменяем ставки, а суммы также будут распределятся по диапазонам, чтобы не влиять на зп руководителей
//					Стр.ПроцентнаяСтавкаПослеПервойБонусПланки = Стр.СтавкаВознаграждения; 
//					Стр.ПроцентнаяСтавкаПослеСуперПлана        = Стр.СтавкаВознаграждения;
//					//КС идут в план бьез бонусов
//					СКВ_БЕЗ_КС = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту;
//					//= Стр.СКВ_КС-(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка))
//					//= 53000 - (248000-(248000-53000)<Стр.ПерваяБонусПланка))
//					// = ?((248000-53000)>Стр.ПерваяБонусПланка,0,1);
//					// Мин(Стр.ПерваяБонусПланка,500000)- Мин((500000-150000),Стр.ПерваяБонусПланка)
//					// Мин(Стр.ПерваяБонусПланка,236000)- Мин((236000-236000),Стр.ПерваяБонусПланка)
//					Если ЭтоВариант20150901 Тогда
//						ДельтаКСРуководитель = 0; //Дельты нет. т.к. все идет в план
//					Иначе
//						ДельтаКСРуководитель = Мин(Стр.ПерваяБонусПланка,Стр.СКВ_ДляПланаПоСКВ_ПоАгенту)- Мин((Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-Стр.СКВ_КС),Стр.ПерваяБонусПланка);
//						Если ДельтаКСРуководитель <> 0 Тогда
//							Сообщить("Дельта "+ДельтаКСРуководитель 
//							//+ "/"+ Стр.Подраздаление
//							+"/"+Стр.Агент);
//						КонецЕсли;
//					КонецЕсли;
//					Стр.ДельтаКСРуководитель = ДельтаКСРуководитель;
//				КонецЕсли;
//				
//				
//				//+Новые промежуточные расчеты
//				Стр.СКВДоПлана = Мин(СКВ_БЕЗ_КС,Стр.План);
//				//-
//				Если ЭтоВариант20121201 Тогда
//					//+Новые промежуточные расчеты
//					Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) - Стр.План,0);
//					Стр.СКВот1БПдо2БП               = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.ПерваяБонусПланка,0);
//					Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
//					//-
//					Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.ПерваяБонусПланка) * Стр.СтавкаВознаграждения / 100; 
//					//Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)
//					//Стр.ЗПЗаПревышение1БП           = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан)-Стр.ПерваяБонусПланка,0)* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
//					Стр.ЗПЗаПревышение1БП           = Стр.СКВот1БПдо2БП* Стр.ПроцентнаяСтавкаПослеПервойБонусПланки / 100;
//					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
//					
//				Иначе	
//					//+Новые промежуточные расчеты
//					Стр.СКВотПланадо1БП             = Макс(Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) - Стр.План,0);
//					Стр.СКВот1БПдо2БП               = 0;
//					Стр.СКВСвыше2БП                 = Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
//					//-
//					//Стр.СКВотПланадо1БП = 0;
//					Стр.ЗПотСКВдоСуперПлана			= Мин(СКВ_БЕЗ_КС,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
//					Стр.ПревышениеСуперплана		= Макс(СКВ_БЕЗ_КС - Стр.СуперПлан, 0);
//				КонецЕсли;	
//				Бонус_КС =0;
//				Если ПланВыполнен = Истина Тогда
//					СтруктураОтбораКС = Новый Структура("ЭтоКрупнаяСделка,Агент,СхемаРасчетаСМенеджером",Истина,Стр.Агент,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
//					СтрокиКС = ТЗ1.НайтиСтроки(СтруктураОтбораКС);
//					
//					Для каждого СтрокаКС из СтрокиКС Цикл
//						СтрокаКС.СКВ_КС =  СтрокаКС.СКВ;
//						СтрокаКС.БОНУС_КС = СтрокаКС.СКВ_КС * (СтрокаКС.БонусПроцент+Стр.СтавкаВознаграждения)/100;
//						Бонус_КС = Бонус_КС + СтрокаКС.БОНУС_КС;
//					КонецЦикла;	
//				КонецЕсли;
//			Иначе	
//				//+Новые промежуточные расчеты
//				Стр.СКВДоПлана       = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.План);
//				Стр.СКВотПланадо1БП  = Макс(Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) - Стр.План,0);
//				Стр.СКВот1БПдо2БП    = 0;
//				Стр.СКВСвыше2БП      = Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
//				//-
//				//Стр.СКВотПланадо1БП = 0;
//				Стр.ЗПотСКВдоСуперПлана		= Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту,Стр.СуперПлан) * Стр.СтавкаВознаграждения / 100; 
//				Стр.ПревышениеСуперплана	= Макс(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.СуперПлан, 0);
//			КонецЕсли;
//			
//			//Стр.ЗПотПланадо1БП = Стр.СКВотПланадо1БП*Стр.ПерваяБонусПланка;
//			
//			КорректировкаЗПСуперПлана = 0;
//			СуммаДляРуководителяПоПониженнойСтавке = 0;
//			ПроцентКС 		= 5;
//			Бонус_КС_РОП 	= 0;
//			Бонус     		= 0;
//			Если Стр.ПревышениеСуперплана > 0 Тогда 
//				Если ЭтоВариант20121001 Тогда
//					ПревышениеСуперпланаКРаспределению = Стр.ПревышениеСуперплана;
//					Если ПревышениеСуперпланаКРаспределению > 0 Тогда
//						БОНУС = ПревышениеСуперпланаКРаспределению * ?(ПланВыполнен,Стр.ПроцентнаяСтавкаПослеСуперПлана,Стр.ПроцентнаяСтавкаДоПлана)/100;
//					КонецЕсли;	
//					Стр.ЗПотЗаПревышениеСуперПлана = БОНУС;
//				Иначе
//					СтруктураОтбораОплат = Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
//					СКВ_КС = 0;
//					//Копируем таблицу по агенту
//					ТЗОплатАгентаПоСхемеПланПоСКВ = ТЗ1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером,Агент,Подразделение",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ,Стр.Агент,Стр.Подразделение));
//					Для каждого СтрокаТЗ ИЗ ТЗОплатАгентаПоСхемеПланПоСКВ Цикл
//						//Сообщить(СтрокаТЗ.Ссылка);
//						Если СтрокаТЗ.КВСуммаДляАгента>РазмерКС Тогда
//							СКВ_КС = СКВ_КС + СтрокаТЗ.СКВ;
//							Если ЭтоВариант20120401 Тогда
//								СуммаДляРуководителяПоПониженнойСтавке = СуммаДляРуководителяПоПониженнойСтавке+СтрокаТЗ.СКВ;
//							КонецЕсли;
//						КонецЕсли;	
//					КонецЦикла;	
//					Если СКВ_КС>Стр.ПревышениеСуперплана Тогда
//						СуммаПоПовышеннойСтавке        = Стр.ПревышениеСуперплана;
//						БОНУС_КС                       = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
//						Стр.ЗПотЗаПревышениеСуперПлана = БОНУС_КС;
//					Иначе
//						ФактическоеПревышениеСупера    = Стр.ПревышениеСуперплана - СКВ_КС;
//						СуммаПоПовышеннойСтавке        = СКВ_КС;
//						БОНУС_КС      = СуммаПоПовышеннойСтавке*(Стр.ПроцентнаяСтавкаПослеПлана+ПроцентКС)/100;
//						БОНУС         = ФактическоеПревышениеСупера * Стр.ПроцентнаяСтавкаПослеСуперПлана / 100;
//						//+Новые промежуточные расчеты
//						Стр.СКВСвыше2БП      = ФактическоеПревышениеСупера;
//						//-
//						Стр.ЗПотЗаПревышениеСуперПлана	= БОНУС + БОНУС_КС;
//					КонецЕсли;	
//					
//					
//					НадоВыводитьСообщение = ЭтоПолныеПрава;
//					Если НадоВыводитьСообщение И Бонус_КС > 0 Тогда
//						Сообщить("По агенту "+Стр.Агент+" начислен бонус за крупную сделку в размере: "+Формат(Бонус_КС,"ЧЦ=15; ЧДЦ=2"));
//					КонецЕсли;	
//				КонецЕсли;
//			КонецЕсли;			
//			//+Новые промежуточные расчеты
//			Стр.ЗПдоПлана      = Стр.СКВДоПлана * Стр.СтавкаВознаграждения/100;
//			Стр.ЗПотПланадо1БП = Стр.СКВотПланадо1БП * Стр.СтавкаВознаграждения/100;
//			Стр.ЗПот1БПдо2БП   = Стр.СКВот1БПдо2БП * Стр.ПроцентнаяСтавкаПослеПервойБонусПланки/100;
//			Стр.ЗПСвыше2БП     = Стр.СКВСвыше2БП * Стр.ПроцентнаяСтавкаПослеСуперПлана/100;
//			//-Новые промежуточные расчеты
//			
//			Если Стр.БратьВИтоги Тогда
//				Стр.ИтогоЗП	= Стр.ЗПотСКВдоСуперПлана + Стр.ЗПотЗаПревышениеСуперПлана+Стр.ЗПЗаПревышение1БП;//+?(ЭтоВариант20121001,БОНУС_КС,0);
//				Стр.БОНУС_КС_ = +?(ЭтоВариант20121001,БОНУС_КС,0);
//			Иначе
//				Стр.ИтогоЗП = 0 ;
//			КонецЕсли;	
//			СтрокаПодразделения				= тзПодразделений.Найти(Стр.Подразделение,"Подразделение");
//			Если СтрокаПодразделения <> Неопределено Тогда
//				Если СтрокаПодразделения.РуководительПолучаетВознаграждение Тогда					
//					//ПроцентнаяСтавкаДоМинимальногоПорога_РОП	5	
//					//СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 8
//					//Превышен план и есть крупная сделка
//					НадоВыводитьСообщение = ЭтоПолныеПрава Или (СтрокаПодразделения.Руководитель = ПараметрыСеанса.уб_ТекущееФизЛицо);
//					Если СуммаДляРуководителяПоПониженнойСтавке>0 
//						И СтрокаПодразделения.СтавкаВознаграждения_РОП>СтрокаПодразделения.ПроцентнаяСтавкаДоПлана_РОП 
//						и ЭтоВариант20150901 = ЛОЖЬ
//						Тогда //Для старых расчетных периодов так.
//						СуммаДляРуководителяПоПолнойСтавке = Стр.СКВ_ДляПланаПоСКВ_ПоАгенту-СуммаДляРуководителяПоПониженнойСтавке;
//						СуммаДляРуководителяПоПониженнойСтавке = Мин(Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана,СуммаДляРуководителяПоПониженнойСтавке)-СуммаДляРуководителяПоПолнойСтавке;
//						ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана-СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
//						//Для руководителя эта часть по пониженной ставке
//						ВознаграждениеРуководителя2 = (СуммаДляРуководителяПоПониженнойСтавке) * СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП / 100;
//						Если НадоВыводитьСообщение И СтрокаПодразделения.СтавкаВознаграждения_РОП<>СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП Тогда
//							Сообщить("Для "+СтрокаПодразделения.Руководитель+" крупная сделка подчиненного на сумму "+Формат(СуммаДляРуководителяПоПониженнойСтавке,"ЧЦ=15; ЧДЦ=2; ДФ=")+" посчитана по "+СтрокаПодразделения.ПроцентнаяСтавкаДоМинимальногоПорога_РОП+"%");
//						КонецЕсли;	
//						Стр.ВознаграждениеРуководителя = ВознаграждениеРуководителя+ВознаграждениеРуководителя2;
//						//Корректируем
//						СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
//					Иначе							
//						Если ЭтоВариант20121001 Тогда
//							//TO DO проверить								
//						ИначеЕсли ЭтоВариант20120401 Тогда
//							//TO DO проверить
//							Стр.ВознаграждениеРуководителя = (Стр.СКВ_ДляПланаПоСКВ_ПоАгенту - Стр.ПревышениеСуперплана)* СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;
//							СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
//						Иначе
//							Стр.ВознаграждениеРуководителя = Стр.ЗПотСКВдоСуперПлана * СтрокаПодразделения.СтавкаВознаграждения_РОП / 100;	
//						КонецЕсли;	
//						
//					КонецЕсли;	
//					
//					Если ЭтоВариант20150901 = Истина Тогда
//						Если СтрокаПодразделения.Подразделение.НеПроверятьЛичныеЗаявки = Истина Тогда
//							ПроцентнаяСтавкаРОП = 1;
//						Иначе
//							ПроцентнаяСтавкаРОП = ОпределитьСтавкуПоВыполнениюПлана(ТаблицаПлавающихСтавокРОП,Стр.ПроцентВыполненияПлана);	
//							//Если ЭтоПолныеПрава Тогда
//							//	Сообщить("Для "+Стр.Агент+" ставка РОП "+ПроцентнаяСтавкаРОП+"["+Стр.ПроцентВыполненияПлана+"]" );
//							//КонецЕсли;	
//						КонецЕсли;
//						
//						СКВ_ПоПодразделениямДоСП = Стр.СКВДоПлана + Стр.СКВ_КС+ Стр.СКВотПланадо1БП;
//						Стр.ВознаграждениеРуководителя = Окр(ПроцентнаяСтавкаРОП*СКВ_ПоПодразделениямДоСП/100,2);
//						Стр.ПроцентРОП = ПроцентнаяСтавкаРОП;
//						СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Стр.ВознаграждениеРуководителя;
//					Иначе
//						//!!!Проверить
//						Если НадоВыводитьСообщение И Бонус_КС_РОП > 0 Тогда
//							//Добавляем бонус руководителю за КС
//							Сообщить("Для "+СтрокаПодразделения.Руководитель+" начислен бонус за заключение агентом крупной сделки  в размере: "+Формат(Бонус_КС_РОП,"ЧЦ=15; ЧДЦ=2; ДФ=")+"");
//							Стр.ВознаграждениеРуководителя = Стр.ВознаграждениеРуководителя+Бонус_КС_РОП;
//							СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Бонус_КС_РОП;
//						КонецЕсли;	
//					КонецЕсли;
//					
//					
//				Иначе
//					Стр.ВознаграждениеРуководителя = 0;
//				Конецесли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//					
//	тзСуммыСКВ_ПоПодразделениямДоСП = ТЗАгентов.Скопировать(СтруктураОтбора3, "Агент,Подразделение,СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
//	тзСуммыСКВ_ПоПодразделениямДоСП.Свернуть("Подразделение","СКВ_ДляПланаПоСКВ_ПоАгенту,ПревышениеСуперплана,ИтогоЗП,БОНУС_РОП_КС,КоличествоФакт_ПоАгенту,СКВДоПлана,СКВотПланадо1БП,СКВот1БПдо2БП,СКВСвыше2БП,СКВ_КС,ДельтаКСРуководитель");
//	тзПодразделений.Колонки.Добавить("БОНУС_РОП_КС_",ОписаниеТипаЧисло14_2_но);
//	Для Каждого Стр ИЗ тзПодразделений Цикл
//		тзСКВпоПодДоСП = тзСуммыСКВ_ПоПодразделениямДоСП.Найти(Стр.Подразделение,"Подразделение");
//		Если тзСКВпоПодДоСП <> Неопределено Тогда
//			//Как считать до чего считать превышение 201212
//			Если РасчетДО1БП = Истина Тогда
//				Стр.СКВ_ПоПодразделениямДоСП    = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП 
//				- ?(ЭтоВариант20150801,тзСКВпоПодДоСП.ДельтаКСРуководитель,0); //20141110 //КС удалится ниже //Дельта КС пойдет как оплата КС
//			Иначе	
//				Стр.СКВ_ПоПодразделениямДоСП	= тзСКВпоПодДоСП.СКВ_ДляПланаПоСКВ_ПоАгенту - тзСКВпоПодДоСП.ПревышениеСуперплана;
//				//Стр.СКВ_ПоПодразделениямДоСП  = тзСКВпоПодДоСП.СКВДоПлана + Стр.СКВ_КС+ тзСКВпоПодДоСП.СКВотПланадо1БП +тзСКВпоПодДоСП.СКВот1БПдо2БП //20141110 //КС удалится ниже
//			КонецЕсли;	
//			
//			Если ЭтоВариант20121001 Тогда
//				Если ЭтоВариант20150901 и Стр.Подразделение.НеПроверятьЛичныеЗаявки = Ложь  Тогда
//					Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП; //КС не вычитается
//					//Стр.СуммаВознаграждения_РОП - считается по агентам выше
//				Иначе
//					Стр.СКВ_ПоПодразделениямДоСП = Стр.СКВ_ПоПодразделениямДоСП-Стр.СКВ_КС;	
//					Стр.СуммаВознаграждения_РОП		= (Стр.СКВ_ПоПодразделениямДоСП) * Стр.СтавкаВознаграждения_РОП / 100 + тзСКВпоПодДоСП.БОНУС_РОП_КС;
//				КонецЕсли;
//				
//			ИначеЕсли ЭтоВариант20120401 Тогда
//				//Расчет уже скорректирован выше
//			Иначе	
//				Стр.СуммаВознаграждения_РОП		= Стр.СКВ_ПоПодразделениямДоСП * Стр.СтавкаВознаграждения_РОП / 100;
//			Конецесли;	
//			Стр.БОНУС_РОП_КС_ = тзСКВпоПодДоСП.БОНУС_РОП_КС;
//			Стр.ИтогоЗПпоПодразделению		= тзСКВпоПодДоСП.ИтогоЗП;//!!!Добавить КС?
//		КонецЕсли;
//		Если  НЕ Стр.РуководительПолучаетВознаграждение Тогда
//			Стр.СуммаВознаграждения_РОП = 0;
//		Иначе
//			Если РольДоступна("ПолныеПрава") и Стр.Руководитель = Менеджер  тогда
//				Сообщить("-------------");
//				Сообщить(Стр.Подразделение);
//				Сообщить("Сборы в план "+Стр.СКВ_ПоПодразделениямДоСП);
//				Сообщить("Ставка "+Стр.СтавкаВознаграждения_РОП);
//				
//				Если Не Стр.БОНУС_РОП_КС_ = 0 Тогда
//					Сообщить("Сборы по КС "+Стр.СКВ_КС);
//					Сообщить("Бонус КС "+Стр.БОНУС_РОП_КС_);
//				КонецЕсли;	
//				Сообщить("Итого "+Стр.СуммаВознаграждения_РОП);
//			КонецЕсли;	
//		КонецЕсли;	
//	КонецЦикла;	
//	ТЗАгентов.Сортировать("Подразделение,Агент");
//	ТЗАгентов.Колонки.БОНУС_РОП_КС.Имя = "БОНУС_РОП_КС_";
//	тзСуммыПлановПоСКВ_ПоОрганизации = тзПодразделений.Скопировать(,"Организация,Подразделение,СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП, СуммаКоличествоПлан");	
//	тзСуммыПлановПоСКВ_ПоОрганизации.Свернуть("Организация", "СуммаПлана,ИтогоЗПпоПодразделению,СуммаВознаграждения_РОП, СуммаКоличествоПлан");
//	
//	Для Каждого Стр ИЗ тзПодразделений Цикл
//		СтрокаСуммыПлана = тзСуммыПлановПоСКВ_ПоОрганизации.Найти(Стр.Организация,"Организация");
//		Если СтрокаСуммыПлана <> Неопределено Тогда
//			Стр.СуммаПланаОрг				= СтрокаСуммыПлана.СуммаПлана;
//			Стр.СуммаКоличествоПланОрг		= СтрокаСуммыПлана.СуммаКоличествоПлан;
//			Стр.ИтогоЗПОрг					= СтрокаСуммыПлана.ИтогоЗПпоПодразделению;
//			Стр.СуммаВознаграждения_РОПОрг	= СтрокаСуммыПлана.СуммаВознаграждения_РОП;
//		КонецЕсли;
//	КонецЦикла;	
//	//
//	
//	Если ФильтрПоМенеджеру Тогда
//		Для Каждого Стр из ТЗАгентов Цикл
//			#Если Клиент Тогда
//				ОбработкаПрерыванияПользователя();
//			#КонецЕсли
//			Если Стр.Агент = Менеджер и Стр.ЭтотАгентЕстьВТЗ1 = ЛОЖЬ Тогда
//				ДобавитьПустышку(тз1,Стр);
//				//НовОплата					= ТЗ1.Добавить();
//				//НовОплата.Агент 			= Стр.Агент;		
//				//НовОплата.Подразделение		= Стр.Подразделение;
//				//НовОплата.Организация 		= Стр.Подразделение.Владелец;
//				//НовОплата.Пустышка			= Истина;
//				//тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(НачалоДня(КонецМесяца(ЗарплатныйПериод)), Стр.Подразделение.Владелец, Стр.Подразделение, Стр.Агент);
//				//Если тз.Количество() > 0 Тогда
//				//	СхемаРасчета = тз[0].СхемаРасчета;
//				//Иначе
//				//	СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
//				//	Сообщить("Ошибка при получении вида расчета с менеджером."+Стр.Агент,СтатусСообщения.ОченьВажное);
//				//	//Возврат  ВознаграждениеМенеджера;
//				//КонецЕсли;
//				//НовОплата.СхемаРасчетаСМенеджером = СхемаРасчета;
//				//НовОплата.УАгентаПланПоСКВ	= СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
//				//Стр.УАгентаПланПоСКВ		= НовОплата.УАгентаПланПоСКВ;
//				//тз = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ЗарплатныйПериод)), , Стр.Подразделение, Стр.Агент);
//				//Если тз.Количество() > 0 Тогда
//				//	Стр.План = тз[0].План;
//				//	Если Стр.План = 0 Тогда
//				//		Стр.Количество = тз[0].Количество;
//				//	КонецЕсли;
//				//Иначе
//				//	Сообщить("ВНИМАНИЕ! Не найдено значение плана по СКВ для Агента " + Строка(Стр.Агент) + " на дату " + Строка(НачалоДня(КонецМесяца(ЗарплатныйПериод))) + " (Подразделение: " + Строка(Стр.Подразделение) + ")" );
//				//КонецЕсли;
//				//НовОплата.СКВ = 0;
//				//НовОплата.КоличествоФакт = 0;
//				//НовОплата.ОплаченоФакт = 0;
//				//НовОплата.НачисленнаяСуммаВзноса = 0;
//				//НовОплата.СкидкаВыплаченаяКлиенту = 0;
//				//НовОплата.КВСумма = 0;
//				//НовОплата.КВСуммаДляАгента = 0;
//				//НовОплата.ВознаграждениеМенеджера = 0;
//				//НовОплата.ВычетСАгента = 0;
//				//НовОплата.АВилиСкидкаСумма  = 0;
//				//НовОплата.Ед = 0;
//			КонецЕсли;
//		КонецЦикла;	
//		Для каждого СтрокаП  из тзПодразделений Цикл
//			Если НЕ СтрокаП.Руководитель = Менеджер Тогда
//				//		СтрокаП.Пустышка = Истина
//				МассивСтрок = ТЗ1.НайтиСтроки(Новый Структура("Подразделение",СтрокаП.Подразделение));
//				Всего = МассивСтрок.Количество();
//				Для сч = 0 по Всего-1 Цикл
//					Строка1 = МассивСтрок[сч];
//					Если НЕ Строка1.Агент = Менеджер Тогда
//						Строка1.НеВыводить = 1;
//					КонецЕсли;	
//				КонецЦикла;	
//			Иначе
//				
//			КонецЕсли;	
//			//		
//		КонецЦикла;	
//		//Для каждого СтрокаА  из тзАгентов Цикл
//		//	Если НЕ СтрокаА.Агент = Менеджер Тогда
//		//		СтрокаА.Пустышка = Истина
//		//	КонецЕсли;	
//		//		
//		//КонецЦикла;	
//		
//		
//		//Для каждого Строка1  из тз1 Цикл
//		//	Если НЕ Строка1.Агент = Менеджер Тогда
//		//		Строка1.НеВыводить = Истина;
//		//	КонецЕсли;	
//		//КонецЦикла;	
//	КонецЕсли;	
//	//Корпоративное
//	Кол = ТзАгентов.Колонки;
//	Кол.Добавить("ВМПоИнтервалам",		ОписаниеТипаЧисло14_2_но);
//	
//	тзПоИнтерваламСКВ = тз1.Скопировать(Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ));
//	Если тзПоИнтерваламСКВ.Количество()> 0 Тогда
//		
//	Запрос = Новый Запрос("Выбрать * ПОМЕСТИТЬ Оплаты из &ТЗ как Оплаты
//	|;
//	|   Выбрать * 
//	|   ПОМЕСТИТЬ ДействующиеДипазоны
//	|   из РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
//	|   ;
//	|	////////////////////////////////////////////////////////////////////////////////
//	|	ВЫБРАТЬ
//	|     Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
//	|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
//	|	  Иначе
//	|	 	ОПЛАТЫ.Интервалы
//	|     Конец как НаборИнтерваловДляМенеджера,
//	|	  ОПЛАТЫ.Агент КАК менеджер,
//	|	  ОПЛАТЫ.Подразделение КАК Подразделение,
//	|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
//	|	ПОМЕСТИТЬ ДанныеПоМенеджерам
//	|	ИЗ
//	|	  Оплаты КАК ОПЛАТЫ
//	|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
//	|       ПО ИСТИНА
//	|	ГДЕ
//	|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
//	|	СГРУППИРОВАТЬ ПО
//	|	  ОПЛАТЫ.Агент,Оплаты.Подразделение,
//	|	  Выбор когда ОПЛАТЫ.Интервалы = Неопределено Тогда
//	|		ДействующиеДипазоны.ИнтервалыДляМенеджеров
//	|	  Иначе
//	|		ОПЛАТЫ.Интервалы
//	|     Конец
//	//|	;
//	//|	Выбрать * из ДанныеПоМенеджерам//Для Проверки
//	|	;
//	|	////////////////////////////////////////////////////////////////////////////////
//	|	ВЫБРАТЬ
//	|     Оплаты.Подразделение как Подразделение,
//	|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
//	|		ДействующиеДипазоны.ИнтервалыДляРОП
//	|	  Иначе
//	|	 	ОПЛАТЫ.ИнтервалыРОП
//	|     Конец КАК НаборИнтерваловРОП,
//	|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник КАК РОП,
//	|	  СУММА(ОПЛАТЫ.СКВ) КАК СКВ
//	|	ПОМЕСТИТЬ ДанныеПоРОП
//	|	ИЗ
//	|	  Оплаты КАК ОПЛАТЫ
//	|	  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_РуководителиПодразделенийСрезПоследних
//	|	  ПО ОПЛАТЫ.Подразделение = уб_РуководителиПодразделенийСрезПоследних.Подразделение
//	|	   И (уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство = ИСТИНА)
//	|     ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеДипазоны как ДействующиеДипазоны
//	|       ПО ИСТИНА
//	|	ГДЕ
//	|	  ОПЛАТЫ.СхемаРасчетаСМенеджером = Значение(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ)
//	|	СГРУППИРОВАТЬ ПО
//	|	  уб_РуководителиПодразделенийСрезПоследних.Сотрудник, Оплаты.Подразделение,
//	|	  Выбор когда ОПЛАТЫ.ИнтервалыРОП = Неопределено Тогда
//	|		ДействующиеДипазоны.ИнтервалыДляРОП
//	|	  Иначе
//	|	 	ОПЛАТЫ.ИнтервалыРОП
//	|     Конец
//	//|	;
//	//|	Выбрать * из ДанныеПоРОП//Для Проверки
//	|	;
//	|	ВЫБРАТЬ
//	|	  уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
//	|	  уб_ИнтервалыЗначенийИнтервалы.Начало,
//	|	  уб_ИнтервалыЗначенийИнтервалы.Окончание,
//	|	  уб_ИнтервалыЗначенийИнтервалы.Значение
//	|	ПОМЕСТИТЬ Диапазоны
//	|	ИЗ
//	|	  Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
//	|		
//	//|  ;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	////|	уб_ИнтервалыЗначенийИнтервалы.Ссылка как НаборИнтервалов,
//	//|	уб_ИнтервалыЗначенийИнтервалы.Начало,
//	//|	уб_ИнтервалыЗначенийИнтервалы.Окончание,
//	//|	уб_ИнтервалыЗначенийИнтервалы.Значение
//	//|ПОМЕСТИТЬ ДиапазоныРОП
//	//|ИЗ
//	//|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗарплатныйПериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних
//	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ИнтервалыЗначений.Интервалы КАК уб_ИнтервалыЗначенийИнтервалы
//	//|	ПО уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.ИнтервалыДляРОП = уб_ИнтервалыЗначенийИнтервалы.Ссылка
//	|;

//	|	////////////////////////////////////////////////////////////////////////////////
//	|	ВЫБРАТЬ
//	|	ДанныеПоМенеджерам.Подразделение,
//	|	ДанныеПоМенеджерам.менеджер,
//	|	ДанныеПоМенеджерам.СКВ,
//	|	Диапазоны.Начало,
//	|	Диапазоны.Окончание,
//	|	Диапазоны.Значение КАК ПроцентИнтервала,
//	|	ВЫБОР
//	|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
//	|	    ТОГДА ВЫБОР
//	|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
//	|	            И НЕ Диапазоны.Окончание = 0
//	|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
//	|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
//	|	    КОНЕЦ * Диапазоны.Значение / 100
//	|     ИНАЧЕ 0
//	|	КОНЕЦ КАК Доплата,
//	|   ВЫБОР
//	|	  КОГДА ДанныеПоМенеджерам.СКВ > Диапазоны.Начало
//	|	    ТОГДА ВЫБОР
//	|	      КОГДА ДанныеПоМенеджерам.СКВ >= Диапазоны.Окончание
//	|	            И НЕ Диапазоны.Окончание = 0
//	|	        ТОГДА Диапазоны.Окончание - Диапазоны.Начало
//	|         ИНАЧЕ ДанныеПоМенеджерам.СКВ - Диапазоны.Начало
//	|	    КОНЕЦ 
//	|     ИНАЧЕ 0
//	|	КОНЕЦ КАК БАЗА,
//	|	ИСТИНА КАК ЭтоВМ
//	|	ПОМЕСТИТЬ ПромежуточныеРасчеты
//	|	ИЗ
//	|	ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
//	|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
//	|	ПО ДанныеПоМенеджерам.НаборИнтерваловДляМенеджера = Диапазоны.НаборИнтервалов
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|	ДанныеПоРОП.Подразделение,
//	|	ДанныеПоРОП.РОП,
//	|	ДанныеПоРОП.СКВ,
//	|	Диапазоны.Начало,
//	|	Диапазоны.Окончание,
//	|	Диапазоны.Значение,
//	|	ВЫБОР
//	|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
//	|	ТОГДА ВЫБОР
//	|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
//	|	И НЕ Диапазоны.Окончание = 0
//	|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
//	|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
//	|	КОНЕЦ * Диапазоны.Значение / 100
//	|ИНАЧЕ 0
//	|	КОНЕЦ,
//	|ВЫБОР
//	|	КОГДА ДанныеПоРОП.СКВ > Диапазоны.Начало
//	|	ТОГДА ВЫБОР
//	|	КОГДА ДанныеПоРОП.СКВ >= Диапазоны.Окончание
//	|	И НЕ Диапазоны.Окончание = 0
//	|	ТОГДА Диапазоны.Окончание - Диапазоны.Начало
//	|ИНАЧЕ ДанныеПоРОП.СКВ - Диапазоны.Начало
//	|	КОНЕЦ 
//	|ИНАЧЕ 0
//	|	КОНЕЦ,
//	|	ЛОЖЬ
//	|	ИЗ
//	|	ДанныеПоРОП КАК ДанныеПоРОП
//	|	ПОЛНОЕ СОЕДИНЕНИЕ Диапазоны КАК Диапазоны
//	|	ПО ДанныеПоРОП.НаборИнтерваловРОП = Диапазоны.НаборИнтервалов
//	|	;
//	|   Выбрать * из ПромежуточныеРасчеты 
//	|	;
//	|	////////////////////////////////////////////////////////////////////////////////
//	|	ВЫБРАТЬ
//	|	   ПромежуточныеРасчеты.менеджер,
//	|	   ПромежуточныеРасчеты.Подразделение,
//	|	   ВЫБОР
//	|	   КОГДА ДанныеПоМенеджерам.СКВ = 0
//	|		  ТОГДА 0
//	|	   КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
//	|				И ПромежуточныеРасчеты.ЭтоВМ
//	|		  ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
//	|	   ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
//	|	   КОНЕЦ КАК ВМ,
//	|	   ВЫБОР
//	|	     КОГДА ПромежуточныеРасчеты.ЭтоВМ
//	|	      ТОГДА ДанныеПоМенеджерам.СКВ
//	|      ИНАЧЕ ДанныеПоРОП.СКВ
//	|	   КОНЕЦ КАК СКВ,
//	|	   ВЫБОР
//	|	     КОГДА ДанныеПоМенеджерам.СКВ = 0
//	|	       ТОГДА 0
//	|        ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
//	|	        КОГДА СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ < &МинПроцент
//	|	           И ПромежуточныеРасчеты.ЭтоВМ
//	|	         ТОГДА &МинПроцент * ДанныеПоМенеджерам.СКВ / 100
//	|           ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата)
//	|	        КОНЕЦ * 100 / ДанныеПоМенеджерам.СКВ КАК ЧИСЛО(15, 1))
//	|	   КОНЕЦ КАК ВМПроцент,
//	|	   ВЫРАЗИТЬ(ВЫБОР
//	|	               КОГДА ДанныеПоМенеджерам.СКВ = 0
//	|	                 ТОГДА 0
//	|                  ИНАЧЕ СУММА(ПромежуточныеРасчеты.Доплата) * 100 / ДанныеПоМенеджерам.СКВ
//	|	            КОНЕЦ КАК ЧИСЛО(15, 1)) КАК ВМПроцентБезКоррекции,
//	|	    ВЫБОР
//	|	      КОГДА ПромежуточныеРасчеты.ЭтоВМ = ИСТИНА
//	|	        ТОГДА ""ВМ""
//	|         ИНАЧЕ ""РОП""
//	|	    КОНЕЦ КАК ВидВознаграждения
//	|	ИЗ
//	|	ПромежуточныеРасчеты КАК ПромежуточныеРасчеты
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоМенеджерам КАК ДанныеПоМенеджерам
//	|	ПО (ДанныеПоМенеджерам.менеджер = ПромежуточныеРасчеты.менеджер)
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоРОП КАК ДанныеПоРОП
//	|	ПО (ДанныеПоРОП.РОП = ПромежуточныеРасчеты.менеджер)
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|	ПромежуточныеРасчеты.менеджер,
//	|	ПромежуточныеРасчеты.Подразделение,
//	|	ДанныеПоМенеджерам.СКВ,
//	|	ДанныеПоРОП.СКВ,
//	|	ПромежуточныеРасчеты.ЭтоВМ");
//	Если тзПоИнтерваламСКВ.Колонки.Найти("РасчетыПоДокументу")<>Неопределено Тогда
//		тзПоИнтерваламСКВ.Колонки.Удалить("РасчетыПоДокументу");
//	КонецЕсли;
//	
//	Если тзПоИнтерваламСКВ.Колонки.Найти("УслугиПоДокументу")<>Неопределено Тогда
//		тзПоИнтерваламСКВ.Колонки.Удалить("УслугиПоДокументу");	
//	КонецЕсли;
//	
//	
//	Запрос.УстановитьПараметр("тз",тзПоИнтерваламСКВ);
//	Запрос.УстановитьПараметр("ЗарплатныйПериод",ЗарплатныйПериод);
//	Запрос.УстановитьПараметр("МинПроцент",10);
//	
//	
//	МассивПакетов = Запрос.ВыполнитьПАкет();
//	ВсегоЗапросов = МассивПакетов.Количество();
//	Выборка = МассивПакетов[ВсегоЗапросов-1].Выбрать();
//	//
//	Пока Выборка.Следующий() Цикл
//		Если НЕ ЗначениеЗаполнено(Выборка.Менеджер) Тогда
//			Продолжить;
//		КонецЕсли;	
//			массивСтрок = ТзАгентов.НайтиСтроки(Новый Структура("Агент",Выборка.Менеджер));
//			Если массивСтрок.Количество()=0 Тогда
//				Если Уб_Кэшируемые.ДоступностьРоли("ПолныеПрава") Тогда
//					Сообщить("Не найден менеджер в таблице агентов "+Выборка.Менеджер);
//				КонецЕсли;	
//			Иначе	
//				СтрокаАгента = массивСтрок[0];
//				Если Выборка.ВидВознаграждения = "ВМ" Тогда
//					СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
//					ДобавитьПустышку(тз1,СтрокаАгента,ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ);
//					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
//				ИначеЕсли Выборка.ВидВознаграждения = "РОП" Тогда
//					//СтрокаАгента.ВМПоИнтервалам = СтрокаАгента.ВМПоИнтервалам+ Выборка.ВМ;
//					СтрокаАгента.ВознаграждениеРуководителя = СтрокаАгента.ВознаграждениеРуководителя+Выборка.ВМ;
//					//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
//				КонецЕсли;	
//			КонецЕсли;		
//			Если Выборка.ВидВознаграждения = "РОП" Тогда
//				//СтрокаАгента.ИтогоЗП = СтрокаАгента.ИтогоЗП + СтрокаАгента.ВМПоИнтервалам;
//				СтрокаПодразделения				= тзПодразделений.Найти(Выборка.Подразделение,"Подразделение");
//				Если СтрокаПодразделения <> Неопределено Тогда
//					СтрокаПодразделения.СуммаВознаграждения_РОП = СтрокаПодразделения.СуммаВознаграждения_РОП+Выборка.ВМ;
//					СтрокаПодразделения.СуммаВознаграждения_РОПОрг = СтрокаПодразделения.СуммаВознаграждения_РОПОрг+Выборка.ВМ;
//				КонецЕсли;	
//			КонецЕсли;			
//	КонецЦикла;	
//	ТЗИнтервалов = МассивПакетов[ВсегоЗапросов-2].Выгрузить();
//	Иначе
//		ТЗИнтервалов = Новый  ТаблицаЗначений;
//	КонецЕсли;	
//	//Корпоративное
//	//Условно
//	//Сверка вознаграждения в оплате
//	Если ПерезаполнитьВМ И ВРеальномВремени Тогда
//		#Если Клиент Тогда
//			Состояние(стрСостояние+". Распределение вознаграждения по оплатам");
//		#КонецЕсли
//		
//		
//		СчетчикОплат = 0;
//		
//		ВсегоМассив = тз1.Количество();
//		Этап = Этап+1;
//		Для каждого Строка1  из тз1 Цикл
//			
//			#Если Клиент Тогда
//				Если СчетчикОплат%5 = 0 Тогда
//					Состояние(стрСостояние+". Этап: " + Этап + ". Распределение вознаграждения по оплатам (" + Окр(100*СчетчикОплат/ВсегоМассив,2) + "%)");
//				КонецЕсли;
//				СчетчикОплат = СчетчикОплат+1;
//			#КонецЕсли
//			Если НЕ Строка1.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ Тогда
//				Продолжить;
//			КонецЕсли;	
//			_этоКС = (Строка1.ЭтоКрупнаяСделка = Истина) ;
//			__СКВ = Строка1.СКВ;
//			_вм = тзАгентов.НайтиСтроки(Новый Структура("Агент",Строка1.Агент))[0];
//			_ВознаграждениеМенеджера = ?(Строка1.ВМРасчетное=Неопределено,0,Строка1.ВМРасчетное);
//			
//			__ВознаграждениеМенеджера = Окр(?(_вм.ИтогоЗП=0 ИЛИ _этоКС ИЛИ (_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС)=0,0,_вм.ИтогоЗП*__СКВ/(_вм.СКВ_ДляПланаПоСКВ_ПоАгенту-_вм.СКВ_КС))+Строка1.ВознаграждениеМенеджера+
//			?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.БОНУС_КС_*__СКВ/_вм.СКВ_КС),2);
//			//__ВознаграждениеМенеджера = Окр(__ВознаграждениеМенеджера, 2);
//			Если _ВознаграждениеМенеджера <> __ВознаграждениеМенеджера Тогда
//				__ДоходБрокера = __СКВ - __ВознаграждениеМенеджера;
//				ОП = Строка1.Ссылка.ПолучитьОбъект();
//				ОП.ДополнительныеСвойства.Вставить("ОтключенКонтрольПериодов",Истина);
//				УстановитьЗначение(ОП.ДБ, 			__ДоходБрокера);
//				УстановитьЗначение(ОП.ВМРасчетное, 	__ВознаграждениеМенеджера);
//				ОП.Записать();
//				#Если Клиент Тогда
//					ОбработкаПрерыванияПользователя();
//				#КонецЕсли
//			КонецЕсли;	
//		КонецЦикла;	
//	КонецЕсли;	
//	
//	//	ДополнитьТаблицыРасчетомПоИнтервалами
//КонецПроцедуры

Процедура ПосчитатьСтрахователей(ТЗ1)
	тз1_Страхователи = ТЗ1.Скопировать(,"Страхователь,Ед,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");//Новый Структура("СхемаРасчетаСМенеджером",ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
	тз1_Страхователи.Свернуть("Страхователь","ЕД,КоэффициентВида,НовыйКлиент,НовыйКлиентСКВ");
	
	ТЗ1.Сортировать("КоэффициентВида Убыв");//Учитывыем более высокие коэффицинты
	
	Для каждого СтрокаТЗ из ТЗ1.НайтиСтроки(Новый Структура("НовыйКлиент",1)) Цикл
		СтрокаТЗ.НовыйКлиентСКВ = СтрокаТЗ.СКВ;
		СтрокаТЗ.НовыйКлиентУник = 1;
	КонецЦикла;	
	
	Для каждого СтрокаСтрахователя из тз1_Страхователи Цикл
		Если СтрокаСтрахователя.Ед>1 и СтрокаСтрахователя.КоэффициентВида>1 Тогда
			Учтено = Ложь;
			нстроки = ТЗ1.НайтиСтроки(Новый Структура("Страхователь",СтрокаСтрахователя.Страхователь));
			Для каждого СтрокаС из нстроки Цикл
				Если СтрокаС.КоэффициентВида>0 Тогда
					Если Учтено  = Ложь Тогда
						Учтено = Истина;
					Иначе
						//Повторные оплаты от того же клиента обнуляем
						СтрокаС.КоэффициентВида = 0;
						СтрокаС.НовыйКлиентУник     = 0;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

Функция ЭтоМастер()
	
	Запрос = Новый Запрос;
	
	Если ЗарплатныйПериод >=Дата(2023,8,1) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
		|ГДЕ
		|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = ""ЭтоМастер""
		|	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0";
	Иначе
		Запрос.Текст  = "ВЫБРАТЬ
		|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПервых(, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
		|ГДЕ
		|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = ""ЭтоМастер""
		|	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0";
		//	|	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	КонецЕсли;				
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(ЗарплатныйПериод));				
	//Запрос.УстановитьПараметр("Сотрудник", Агент);				
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции

Функция ЭтоСтажер(_Агент)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст  = "ВЫБРАТЬ
					|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник
					|ИЗ
					|	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПервых(, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
					|ГДЕ
					|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = ""ЭтоСтажер""
					|	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0
					|	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
					
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(ЗарплатныйПериод));				
	Запрос.УстановитьПараметр("Сотрудник", _Агент);				
	Возврат Запрос.Выполнить().Выгрузить().Количество()>0;
КонецФункции


Процедура ЗаписатьПараметр(_ТипПараметра,_Агент,_ЗначениеПараметра) Экспорт
	Попытка
	МЗ = Регистрысведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СоздатьМенеджерЗаписи();
	МЗ.Сотрудник         = _Агент;
	МЗ.ТипПараметра      = _ТипПараметра;
	МЗ.ЗначениеПараметра = _ЗначениеПараметра;
	МЗ.Период = ДатаНачала;
	Попытка
		МЗ.Записать();
	Исключение
	КонецПопытки;	
	Исключение
	КонецПопытки;	
КонецПроцедуры	