
Функция ПолучитьТаблицуДвижений(Документ,уб_РасчетыСПоставщиками=Неопределено) Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Если уб_РасчетыСПоставщиками = Неопределено Тогда
		уб_РасчетыСПоставщиками = РегистрыНакопления.уб_РасчетыСПоставщиками.СоздатьНаборЗаписей();
	КонецЕсли;
	//Заготавливаем Таблицу для движений
	
	ТаблицаДвижений = уб_РасчетыСПоставщиками.Выгрузить();
	ТаблицаДвижений.Очистить();
	бЕстьОтчетПоставщику = НЕ Документ.ОтчетПоставщику.Пустая();
	СП = Документ.СтраховойПолис;
	Если ЗначениеЗаполнено(Документ.Поставщик)
		И ЗначениеЗаполнено(Документ.Поставщик.ДатаВеденияВзаиморасчётов) Тогда
		Если бЕстьОтчетПоставщику Тогда
			Если Документ.ОтчетПоставщику.Дата<Документ.Поставщик.ДатаВеденияВзаиморасчётов Тогда
				//Документы есть, но движений не делают
				Возврат ТаблицаДвижений;
			КонецЕсли;
		Иначе
			Если Документ.Дата<Документ.Поставщик.ДатаВеденияВзаиморасчётов Тогда
				//Документы есть, но движений не делают
				Возврат ТаблицаДвижений;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НЕ Документ.Проведен Тогда
		//Документ не проведен
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	бДоговорБезУдержанияКВ = НЕ уб_СС.ОпределитьЭтоРасчетСУдержаниемКВ(СП.Поставщик, СП.ОрганизацияАгент, СП.Дата, Ложь);
	Если СистемаНаправлениеПлатежа Тогда
		бПоставщику = Документ.НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.Поставщику;
	Иначе
		бПоставщику = Документ.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
	КонецЕсли;
	Если НЕ Документ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = 0
		И НЕ Документ.КВСуммаДляОтчета = 0
		Тогда
		Если Документ.НеВключатьВОтчетыПоставщикам И НЕ Документ.Проблемная Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
		Движение = ТаблицаДвижений.Добавить();
		//Движение.ВидДвижения = ?(бПоставщику,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Валюта    = Документ.Валюта;
		Движение.Контрагент = Документ.Поставщик;
		Движение.ОрганизацияАгент = Документ.ОрганизацияАгент;
		Движение.Период = Документ.Дата;
		Движение.Регистратор = Документ.Ссылка;
		//Движение.Сумма = ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
		Движение.Сумма = ?(бПоставщику,0,Документ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику);
		Движение.СуммаКВ = Документ.КВСуммаДляОтчета;
		Движение.Активность = Истина;
		Если бПоставщику Тогда
			//Деньги пришли поставщику
			Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
			Движение.Описание = "Оплата получена поставщиком";
		Иначе
			Если НЕ бЕстьОтчетПоставщику Тогда
				Если Документ.Проблемная Тогда
					//Деньги приняты, но скрыты от поставщика
					Категория = Перечисления.уб_КатегорияЗадолженности.ПроблемнаяЗадолженность;
					Движение.Описание = "Оплата получена, но не деньги не сданы, или утеряны";
				Иначе
					//Деньги приняты, но поставщику ЕЩЕ не показаны
					Категория = Перечисления.уб_КатегорияЗадолженности.ПоПринятымОплатам;
					Движение.Описание = "Получена оплата по полису";
				КонецЕсли;
			Иначе
				Движение.Период = Документ.ОтчетПоставщику.Дата;
				ЗапросДатыАктуальности  = Новый Запрос("ВЫБРАТЬ
				                                       |	уб_ИсторияОбъект.Период КАК Период,
				                                       |	уб_ИсторияОбъект.ОбъектИстории
				                                       |ИЗ
				                                       |	РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
				                                       |ГДЕ
				                                       |	уб_ИсторияОбъект.ОбъектИстории = &ОП
				                                       |	И уб_ИсторияОбъект.ВерсияАктуальна
				                                       |
				                                       |УПОРЯДОЧИТЬ ПО
				                                       |	Период УБЫВ");
				ЗапросДатыАктуальности.УстановитьПараметр("ОП",Документ.ОтчетПоставщику.Ссылка);
				Выборка = ЗапросДатыАктуальности.Выполнить().Выбрать();
				ЗапросДатыАктуальности = Неопределено;
				Если Выборка.Следующий() Тогда
					//Есть актуальная версия
					ДатаАктуальныхДанных = Выборка.Период;
					МассивРеквизитов = Новый Массив;
					МассивРеквизитов.Добавить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику");
					МассивРеквизитов.Добавить("КВСуммаДляОтчета");
					ЗапросАктуальныхРеквизитов = Новый Запрос("ВЫБРАТЬ
					|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
					|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита
					|ИЗ
					|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
					|			&ДатаСреза,
					|			ОбъектИстории = &ОбъектИстории
					|				И РеквизитОбъекта.Наименование В (&МассивРеквизитов)) КАК уб_ИсторияРеквизитСрезПоследних");
					ЗапросАктуальныхРеквизитов.УстановитьПараметр("ДатаСреза",ДатаАктуальныхДанных);
					ЗапросАктуальныхРеквизитов.УстановитьПараметр("ОбъектИстории",Документ.Ссылка);
					ЗапросАктуальныхРеквизитов.УстановитьПараметр("МассивРеквизитов",МассивРеквизитов);
					ТаблицаРеквизитов = ЗапросАктуальныхРеквизитов.Выполнить().Выгрузить();
					
					СтрокаРеквизита = ТаблицаРеквизитов.Найти("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику","НаименованиеРеквизита");
					Если СтрокаРеквизита = Неопределено Тогда
						ВремПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = 0;
					Иначе	
						ВремПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = СтрокаРеквизита.ЗначениеРеквизита;
					КонецЕсли;
					
					СтрокаРеквизита = ТаблицаРеквизитов.Найти("КВСуммаДляОтчета","НаименованиеРеквизита");
					Если СтрокаРеквизита = Неопределено Тогда
						ВремКВСуммаДляОтчета = 0;
					Иначе	
						ВремКВСуммаДляОтчета = СтрокаРеквизита.ЗначениеРеквизита;
					КонецЕсли;
					
					Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
					
					Движение.Описание = "Оплата включена в переданный отчет";
					Если ВремКВСуммаДляОтчета<>Документ.КВСуммаДляОтчета 
						ИЛИ ВремПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику<>Документ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику Тогда
						//Если произошли измененния, то сначала отразим "актуальные" данные
						Движение.Сумма = ?(бПоставщику,0,ВремПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику);
						Движение.СуммаКВ = ВремКВСуммаДляОтчета;
						Движение.НомерСтроки = 0;
						//Добавляем корректирующие движения по произошедшим изменениям после сдачи актуального отчета
						КорДвижение = ТаблицаДвижений.Добавить();
						КорДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
						КорДвижение.Валюта    = Документ.Валюта;
						КорДвижение.Контрагент = Документ.Поставщик;
						КорДвижение.ОрганизацияАгент = Документ.ОрганизацияАгент;
						//КорДвижение.Период = Документ.Дата;
						КорДвижение.Период = Документ.ОтчетПоставщику.Дата;
						КорДвижение.Регистратор = Документ.Ссылка;
						КорДвижение.Сумма = ?(бПоставщику,0,Документ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику-ВремПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику);
						КорДвижение.СуммаКВ = Документ.КВСуммаДляОтчета - ВремКВСуммаДляОтчета;
						КорДвижение.Активность = Истина;
						КорДвижение.Категория = Перечисления.уб_КатегорияЗадолженности.ИзменениеПослеПринятияОтчета;
						КорДвижение.Описание = "По оплате были изменения после сдачи отчета";
						Движение.НомерСтроки = 3;
		            КонецЕсли;
				Иначе
					//Отчет сделан, но ЕЩЕ не отправлен (не актуален)
					Категория = Перечисления.уб_КатегорияЗадолженности.ЕстьОтчетПоставщику;
					Движение.Описание = "Получена оплата по полису, сделан отчет";
				КонецЕсли;	
			КонецЕсли;	
		Конецесли;	
		Движение.Категория = Категория;
		//Удержание вознаграждения
		Если НЕ бДоговорБезУдержанияКВ И НЕ бПоставщику И НЕ Документ.КВСуммаДляОтчета = 0 Тогда
			Движение = ТаблицаДвижений.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Валюта    = Документ.Валюта;
			Движение.Контрагент = Документ.Поставщик;
			Движение.ОрганизацияАгент = Документ.ОрганизацияАгент;
			Если НЕ бЕстьОтчетПоставщику Тогда
				Движение.Период = Документ.Дата;
			Иначе
				Движение.Период = Документ.ОтчетПоставщику.Дата;
			КонецЕсли;	
			Движение.Регистратор = Документ.Ссылка;
			Движение.Сумма = Документ.КВСуммаДляОтчета;
			Движение.СуммаКВ = Документ.КВСуммаДляОтчета;
			Движение.Описание = "Удержано КВ";
			Движение.Категория = Категория;
			Движение.Активность = Истина;
			Движение.НомерСтроки = 1;
		КонецЕсли;			
		
	КонецЕсли;	
	Возврат ТаблицаДвижений;
	
КонецФункции	

Процедура ОтразитьРасчеты(Ссылка) Экспорт
	
	НЗ = РегистрыНакопления.уб_РасчетыСПоставщиками.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Значение = Ссылка;
	НЗ.Очистить();
    НЗ.Загрузить(ПолучитьТаблицуДвижений(Ссылка,НЗ));
	НЗ.Записать();	
	
КонецПроцедуры	

Функция МассивЗапрещенныхРеквизитов() Экспорт

	МассивЗапрещенныхРеквизитов = Новый Массив;
	Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
		МассивЗапрещенныхРеквизитов.Добавить("КВСумма");
		МассивЗапрещенныхРеквизитов.Добавить("КВПроцент");
		МассивЗапрещенныхРеквизитов.Добавить("КВПроцентДляОтчета");
		МассивЗапрещенныхРеквизитов.Добавить("КВСуммаДляОтчета");
	КонецЕсли;
	Возврат МассивЗапрещенныхРеквизитов;

КонецФункции // МассивЗапрещенныхРеквизитов()

Функция НаправлениеПлатежаКартинка(НаправлениеПлатежа) Экспорт

	Пер = Перечисления.уб_НаправленияПлатежа;
	Если НаправлениеПлатежа = Пер.ВБрокер Тогда
		Иконка = БиблиотекаКартинок.уб_НаправлениеПлатежаЛевоЗел
	ИначеЕсли НаправлениеПлатежа = Пер.Поставщику Тогда
		Иконка = БиблиотекаКартинок.уб_НаправлениеПлатежаПравоРозовый
	Иначе
		Иконка = Новый Картинка;
	КонецЕсли;
	Возврат Иконка;

КонецФункции // ФормаОплатыКартинка()
