Перем ЭтоПереустановкаЗПКрупнойСделки Экспорт;
Перем ИДГруппыВзаиморасчетов Экспорт; //+++Взаиморасчеты
//из формы
Перем лАктуальныйПериод Экспорт;
Перем мВалютаРегл Экспорт;
Перем лРазрешеноРедактирование Экспорт;
Перем РасчетПоАВ Экспорт;
Перем лАгентВнешний Экспорт;
Перем ТЗИзменений Экспорт;
Перем лПересчитыватьСуммы Экспорт;

Процедура ПередУдалением(Отказ)
	
	НачатьТранзакцию();
	
	Если уб_СС.УдалитьКвитовки(Неопределено, Ссылка, Неопределено, ЭтотОбъект) Тогда
		ЗафиксироватьТранзакцию();	
	Иначе
		ОтменитьТранзакцию();	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик события ПередЗаписью документа
// Проверяются реквизиты затрагивающие период расчета ЗП, изменяется его актуальность
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Проверка изменения значимых реквизитов
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//СДЕЛКА
	//Если НЕ Отказ И ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА И НЕ ЭтоПереустановкаЗПКрупнойСделки=Истина Тогда
	//	ПроверитьНаУчастиеВКрупнойСделке();
	//КонецЕсли;
	
	//Если ВидРасчетаСагентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
	//	Если ЗарплатныйПериод<>Дата Тогда
	//		ЗарплатныйПериод = Дата;
	//	КонецЕсли;
	//Иначе
		Если Не ЗначениеЗаполнено(ЗарплатныйПериод) Тогда
			ЗарплатныйПериод = НачалоДня(КонецМесяца(Дата));
		//Иначе
			//Разность = (Макс(Дата,ЗарплатныйПериод)-Мин(Дата,ЗарплатныйПериод))/(60*60*24);
			//Если НЕ ЭтоКрупнаяСделка И Разность>92 И НЕ ЭтоПереустановкаЗПКрупнойСделки Тогда
			//	#Если Клиент Тогда
			//		Предупреждение("Дата оплаты и зарплатный период отличаются более чем на 3 месяца!");
			//		Отказ = Истина;
			//	#КонецЕсли
			//КонецЕсли;
		КонецЕсли;
	//КонецЕсли;

	
	Запрос = Новый Запрос;
	
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("Ссылка",СтраховойПолис);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_СтраховойПолис.Ссылка,
		               |	уб_СтраховойПолис.Проведен,
		               |	уб_СтраховойПолис.ПометкаУдаления,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ЗарплатныйПериод,
		               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Куратор, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Куратор,
		               |	ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПустаяСсылка) КАК ВидРасчетаСАгентом,
		               |	ЛОЖЬ КАК ИсключитьИзРасчетаЗП,
		               |	0 КАК ВознаграждениеМенеджера,
		               |	уб_СтраховойПолис.Номер КАК Номер,
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(уб_СтраховойПолис.СтраховойПродукт) = ТИП(Справочник.уб_СтраховыеПродукты)
		               |			ТОГДА уб_СтраховойПолис.СтраховойПродукт.Вид
		               |		ИНАЧЕ уб_СтраховойПолис.СтраховойПродукт
		               |	КОНЕЦ КАК видСП
		               |ИЗ
		               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		               |		ПО уб_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
		               |ГДЕ
		               |	уб_СтраховойПолис.Ссылка = &Ссылка";
				   
		Иначе
		   Запрос.УстановитьПараметр("Полис", СтраховойПолис);
		   Запрос.УстановитьПараметр("Ссылка",Ссылка);
		   
		   Запрос.Текст = "ВЫБРАТЬ
		                  |	уб_СтраховойПолис.Ссылка,
		                  |	уб_СтраховойПолис.Проведен,
		                  |	уб_СтраховойПолис.ПометкаУдаления,
		                  |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Куратор, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Куратор,
		                  |	уб_ОплатаПолисов.ЗарплатныйПериод КАК ЗарплатныйПериод,
		                  |	уб_ОплатаПолисов.ВидРасчетаСАгентом,
		                  |	уб_ОплатаПолисов.ИсключитьИзРасчетаЗП,
		                  |	уб_ОплатаПолисов.ВознаграждениеМенеджера,
		                  |	уб_СтраховойПолис.Номер КАК Номер,
		                  |	ВЫБОР
		                  |		КОГДА ТИПЗНАЧЕНИЯ(уб_СтраховойПолис.СтраховойПродукт) = ТИП(Справочник.уб_СтраховыеПродукты)
		                  |			ТОГДА уб_СтраховойПолис.СтраховойПродукт.Вид
		                  |		ИНАЧЕ уб_СтраховойПолис.СтраховойПродукт
		                  |	КОНЕЦ КАК видСП
		                  |ИЗ
		                  |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		                  |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		                  |			ПО уб_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
		                  |		ПО уб_ОплатаПолисов.СтраховойПолис = уб_СтраховойПолис.Ссылка
		                  |ГДЕ
		                  |	уб_ОплатаПолисов.Ссылка = &Ссылка";
	КонецЕсли;
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	Если ВыборкаСсылка.Следующий() Тогда
		
	Иначе
		ВыборкаСсылка = ЭтотОбъект;
	КонецЕсли;
	
	УстановитьЗначение(ВидСП, ВыборкаСсылка.ВидСП);
	
	уб_РасчетыСМенеджерами.ПроверитьВидСтрахования(ЭтотОбъект);
	
	Если ВыборкаСсылка.ПометкаУдаления = Ложь и ПометкаУдаления Тогда
		НачатьТранзакцию();
		Если уб_СС.УдалитьКвитовки(Неопределено, Ссылка, Неопределено, ЭтотОбъект) Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ВыборкаСсылка.Куратор) и не Куратор = ВыборкаСсылка.Куратор и НЕ(СкидкаВыплаченаяКлиенту>0 и ЗначениеЗаполнено(Куратор)) Тогда
		Куратор = ВыборкаСсылка.Куратор;
	КонецЕсли;
	
	УстановитьСхемуРасчета();//В основном для пустой схемы
	
	//Фиксация необходимости перерасчета ЗП по периоду
	ОтключенКонтрольПериодов = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтключенКонтрольПериодов",ОтключенКонтрольПериодов) = Ложь Тогда
		ОтключенКонтрольПериодов = Ложь;
	КонецЕсли;
	
	Если НЕ Отказ и ОтключенКонтрольПериодов = Ложь Тогда
		МассивПериодов = Новый Массив;

		Если ЗарплатныйПериод <> ВыборкаСсылка.ЗарплатныйПериод Тогда
			МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
			МассивПериодов.Добавить(НачалоМесяца(ВыборкаСсылка.ЗарплатныйПериод));
		ИначеЕсли ВидРасчетаСАгентом <> ВыборкаСсылка.ВидРасчетаСАгентом Тогда
			МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
		ИначеЕсли ИсключитьИзРасчетаЗП <> ВыборкаСсылка.ИсключитьИзРасчетаЗП Тогда
			МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
		ИначеЕсли ВознаграждениеМенеджера <> ВыборкаСсылка.ВознаграждениеМенеджера Тогда
			МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
			//СКВ
		Иначе
			СтруктураПолей = уб_РасчетыСМенеджерами.СтруктураПолейДляРасчетаСКВ(ЭтотОбъект);
			_СКВ 	= уб_РасчетыСМенеджерами.ПолучитьСКВ(СтруктураПолей, 	"ДляАгента");
			__СКВ   = уб_РасчетыСМенеджерами.ПолучитьСКВ(Ссылка, 	        "ДляАгента");
			//_СуммаДляСК = НачисленнаяСуммаВзноса - КВСуммаДляАгента;
			//Если (ОплаченоФакт - СкидкаВыплаченаяКлиенту) < _СуммаДляСК Тогда
			//	_СКВ = 0;
			//Иначе
			//	_СКВ = (ОплаченоФакт - СкидкаВыплаченаяКлиенту) - _СуммаДляСК;
			//КонецЕсли;
			//__СуммаДляСК = Ссылка.НачисленнаяСуммаВзноса - Ссылка.КВСуммаДляАгента;
			//Если (Ссылка.ОплаченоФакт - Ссылка.СкидкаВыплаченаяКлиенту) < __СуммаДляСК Тогда
			//	__СКВ = 0;
			//Иначе
			//	__СКВ = (Ссылка.ОплаченоФакт - Ссылка.СкидкаВыплаченаяКлиенту) - __СуммаДляСК;
			//КонецЕсли;
			Если _СКВ <> __СКВ Тогда
				МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
			Иначе
				//Проверка на изменение проведения
				Если Проведен Тогда
					//
					Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
						МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
					ИначеЕсли ПометкаУдаления <> ВыборкаСсылка.ПометкаУдаления Тогда
						МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
					КонецЕсли;
				Иначе
					Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
						МассивПериодов.Добавить(НачалоМесяца(ЗарплатныйПериод));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		
		Для СчетчикПериодов = 0 по МассивПериодов.Количество()-1 Цикл
			ДатаНеактуальности = МассивПериодов[СчетчикПериодов];
			//ТЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(,Новый Структура("РасчетныйПериод",ДатаНеактуальности));

//			Если ТЗ.Количество() = 0 Тогда
//			Иначе
//				Если Не ТЗ[0].Актуален Тогда
//					Продолжить;
//				КонецЕсли;
//			КонецЕсли;
			Если НЕ уб_РасчетыСМенеджерами.ЗарплатныйПериодАктуален(ДатаНеактуальности,Новый Структура("Актуален,Объект",Ложь,Ссылка)) Тогда
				Продолжить;
			КонецЕсли;
			
			//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
			//МЗ.Актуален = Ложь;
			//МЗ.РасчетныйПериод = ДатаНеактуальности;
			//МЗ.Период = ТекущаяДата();
			//МЗ.Объект = Ссылка;
			//Попытка
			//	МЗ.Записать();
			//Исключение
			//	#Если Клиент  Тогда
			//		Сообщить("Ошибка регистрации неактуальности периода расчета ЗП");
			//	#КонецЕсли
			//КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	//++Расчеты
	ЗарегистрироватьРасчеты(ВыборкаСсылка);
	//--Расчеты
КонецПроцедуры

// Процедура обработчик события ПриЗаписи документа
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//+++Взаиморасчеты
	Если ПараметрыСеанса.уб_Константы.ВестиВзаиморасчетыПоОперациям = Истина И Отказ = Ложь Тогда
		ВыполнитьДвиженияПоВзаиморасчетам();
	КонецЕсли;
	//+++Взаиморасчеты
КонецПроцедуры


Процедура УстановитьСхемуРасчета() Экспорт
	
	Если СхемаРасчетаСМенеджером.Пустая() Тогда
		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(ЗарплатныйПериод, Подразделение.Владелец, Подразделение, Агент, ВидСП);
		Если тз.Количество() > 0 Тогда
			СхемаРасчетаСМенеджером = тз[0].СхемаРасчета;
		Иначе
			//СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
			Сообщить("Ошибка при получении вида расчета с менеджером.",СтатусСообщения.ОченьВажное);
			УстановитьЗначение(СхемаРасчетаСМенеджером, ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
			
		КонецЕсли;
	КонецЕсли;
	Если СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ Тогда
		_ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	Иначе
		_ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме;
	КонецЕсли;	 
	УстановитьЗначение(ВидРасчетаСАгентом, _ВидРасчетаСАгентом);
	
	//Если ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
	//	
	//	Если (ЗарплатныйПериод<Дата(2016,1,1) или СхемаРасчетаСМенеджером.Пустая()) Тогда
	//		УстановитьЗначение(СхемаРасчетаСМенеджером, ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ);
	//	КонецЕсли;
	//Иначе
	//	Если СхемаРасчетаСМенеджером.Пустая() Тогда
	//		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(ЗарплатныйПериод, Подразделение.Владелец, Подразделение, Агент, ВидСП);
	//		Если тз.Количество() > 0 Тогда
	//			СхемаРасчетаСМенеджером = тз[0].СхемаРасчета;
	//		Иначе
	//			//СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
	//			Сообщить("Ошибка при получении вида расчета с менеджером.",СтатусСообщения.ОченьВажное);
	//			УстановитьЗначение(СхемаРасчетаСМенеджером, ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	//			
	//		КонецЕсли;
	//	Иначе
	//		Если ПроверенаЗП = Ложь и Куратор.Пустая() = Ложь Тогда
	//			//УстановитьЗначение(СхемаРасчетаСМенеджером, ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентПартнеру);
	//			//Процент нашего СКВ после минуса скидки
	//			_ПроцентСКВ = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ПроцентКуратора",Куратор,ЗарплатныйПериод,0);
	//			
	//			//Временно неверно
	//			//_КВПроцентДляАгента = (100-ПроцентКуратора)*КВПроцент/100;
	//			//УстановитьЗначение(КВПроцентДляАгента, _КВПроцентДляАгента);
	//			//_КВСуммаДляАгента   = (100-ПроцентКуратора)*КВСумма/100;
	//			//УстановитьЗначение(КВСуммаДляАгента, _КВСуммаДляАгента);
	//		Иначе
	//			_ПроцентСКВ = 0;
	//		КонецЕсли;	
	//		УстановитьЗначение(ПроцентСКВ, _ПроцентСКВ);
	//	КонецЕсли;
	//КонецЕсли;
	//Если СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка() Тогда
	//			
	//КонецЕсли;
	
			
КонецПроцедуры


//--- Взаиморасчеты ---
Процедура ВыполнитьДвиженияПоВзаиморасчетам() Экспорт
	
	Если ИДГруппыВзаиморасчетов = Неопределено Тогда
		ИДГруппыВзаиморасчетов = уб_Взаиморасчеты.ПолучитьУИДГруппыПоДокументу(Ссылка);
		Если ИДГруппыВзаиморасчетов = Ложь Тогда
			//Не сгенерируем новый УИД
			ИДГруппыВзаиморасчетов = Строка (Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	ЗапросВзаиморасчеты = уб_Взаиморасчеты.ЗапросПоВзаиморасчетамДокумента(Ссылка);
	СтруктураПараметров = Новый Структура("Дата,Агент,Страхователь,Поставщик,ОрганизацияАгент",Дата,Агент,СтраховойПолис.Страхователь,Поставщик,ОрганизацияАгент,Дата,ЗапросВзаиморасчеты);
	НачатьТранзакцию();
	//--Предварительные цифры
	ПоАВ = СхемаРасчетаСМенеджером=ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;//ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	ВКассу = ФормаОплаты=Перечисления.уб_ФормыОплаты.Касса;
	_УдержаноМенеджеромИзДСКлиента = ?(ПоАВ, АВилиСкидкаСумма, 0);
	_НачислениеСтраховогоВзноса = ?(ПолисАннулирован И ОплаченоФакт = 0 И АВилиСкидкаСумма<>0 и НеВключатьВОтчетыПоставщикам = ЛОЖЬ и НЕ ПоАВ,
			АВилиСкидкаСумма,НачисленнаяСуммаВзноса);
	 //_НачислениеВМ = ?(ПоАВ,Мин(АВилиСкидкаСумма,КВСумма),ВМРасчетное);//?((ПолисАннулирован И ОплаченоФакт = 0 и НеВключатьВОтчетыПоставщикам=ЛОЖЬ)=ЛОЖЬ И АВилиСкидкаСумма<>0 И (НачисленнаяСуммаВзноса - ОплаченоФакт+СкидкаВыплаченаяКлиенту)<>0,?(ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ,_НачислениеВМ,0),0);	
	 _НачислениеВМ = ?(ПоАВ,Мин(ВМРасчетное,КВСумма),ВМРасчетное);//?((ПолисАннулирован И ОплаченоФакт = 0 и НеВключатьВОтчетыПоставщикам=ЛОЖЬ)=ЛОЖЬ И АВилиСкидкаСумма<>0 И (НачисленнаяСуммаВзноса - ОплаченоФакт+СкидкаВыплаченаяКлиенту)<>0,?(ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ,_НачислениеВМ,0),0);	
	 
	_СкидкаКлиентуИзДБ = ?((ПолисАннулирован И ОплаченоФакт = 0 и НеВключатьВОтчетыПоставщикам=ЛОЖЬ)=ЛОЖЬ И АВилиСкидкаСумма<>0 И (НачисленнаяСуммаВзноса - ОплаченоФакт+СкидкаВыплаченаяКлиенту)<>0,?(ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ,0,АВилиСкидкаСумма),0);
	
	//Мин
	//_ДоходБрокера = КВСумма - (АВилиСкидкаСумма - ВычетСАгента);
	//_ДБ = ?(ПоАВ,,0);
	
	
	//---КВ брокера
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("КВСумма",
		Справочники.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера,Ссылка,Ссылка,КВСумма,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	//---КВ штраф менеджеру
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("ВычетСАгента",
	Справочники.уб_ВидыРасчетныхОпераций.УдержаниеИзВМ,Ссылка,Ссылка,ВычетСАгента,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);	
	//---Выплата клиенту
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("СкидкаВыплаченаяКлиенту",
		Справочники.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту,Ссылка,Ссылка,СкидкаВыплаченаяКлиенту,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	//---Начисление ВМ
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("НачислениеВМ",
		Справочники.уб_ВидыРасчетныхОпераций.НачислениеВМ,Ссылка,Ссылка,_НачислениеВМ,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	//---Начисление Страхового взноса
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("НачисленнаяСуммаВзноса",
		Справочники.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса,Ссылка,Ссылка,_НачислениеСтраховогоВзноса,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	//---Удержано менеджером		
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("УдержаноМенеджеромИзДСКлиента", 
		Справочники.уб_ВидыРасчетныхОпераций.УдержаноМенеджеромИзДСКлиента,Ссылка,Ссылка,_УдержаноМенеджеромИзДСКлиента,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	//---Скидка Клиенту		
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("СкидкаКлиентуИзДБ",
		Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ,Ссылка,Ссылка,_СкидкаКлиентуИзДБ,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	ДвиженияПоРегистрам();
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Процедура ДвиженияПоРегистрам()
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Движения.уб_РасчетыСПоставщиками.Записывать = Истина;
	Движения.уб_РасчетыСПоставщиками.Очистить();
	Движения.уб_РасчетыСПоставщиками.Загрузить(Документы.уб_ОплатаПолисов.ПолучитьТаблицуДвижений(ЭтотОбъект,Движения.уб_РасчетыСПоставщиками));
	//ЗП
	уб_РасчетыСФЛПоЗП = Движения.уб_РасчетыСФЛПоЗП;
	уб_РасчетыСФЛПоЗП.Записывать = Истина;
	уб_РасчетыСФЛПоЗП.Очистить();
	Если типзнч(Агент) = Тип("СправочникСсылка.ФизическиеЛица") и  СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ и (АВилиСкидкаСумма<>0 или СкидкаВыплаченаяКлиенту<>0)Тогда
		ЗаписьПоЗП = уб_РасчетыСФЛПоЗП.Добавить();
		ЗаписьПоЗП.Активность     = Ложь;
		ЗаписьПоЗП.ВидДвижения    = ВидДвиженияНакопления.Приход;
		ЗаписьПоЗП.ВидНачисления  = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВычетПоАВ;
		//ЗаписьПоЗП.Источник = ;
		ЗаписьПоЗП.Сумма          = АВилиСкидкаСумма+СкидкаВыплаченаяКлиенту;
		ЗаписьПоЗП.ФизическоеЛицо = Агент; 
		ЗаписьПоЗП.Организация    = Справочники.Организации.НайтиПоКоду("000000001");
		ЗаписьПоЗП.Период         = Дата;
		ЗаписьПоЗП.Раздел         = 5;//Проверить, но вроде бы не используется
		ЗаписьПоЗП.Описание       = "АВ по полису "+ СтраховойПолис.Номер;
		ЗаписьПоЗП.РасчетныйПериод = ЗарплатныйПериод;
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры

////СДЕЛКИ 
//Процедура ПроверитьНаУчастиеВКрупнойСделке()
//	
//	Если СтраховойПолис.Пустая() Тогда
//		_ЭтоКрупнаяСделка = Ложь;
//	Иначе
//		_ЭтоКрупнаяСделка = СтраховойПолис.Сделка.Крупная;
//	Конецесли;	
//	УстановитьЗначение(ЭтоКрупнаяСделка,_ЭтоКрупнаяСделка);
//	Если ЭтоКрупнаяСделка Тогда
//		_ЗарплатныйПериод = ПолучитьЗПКрупнойСделки(СтраховойПолис.Сделка);
//		УстановитьЗначение(ЗарплатныйПериод,_ЗарплатныйПериод);
//	КонецЕсли;	
//КонецПроцедуры	

//Функция ПолучитьЗПКрупнойСделки(Сделка)
//	//
//	Запрос = Новый Запрос("ВЫБРАТЬ
//						  |	уб_ОплатаПолисов.ЗарплатныйПериод КАК ЗарплатныйПериод,
//						  |	уб_ОплатаПолисов.Ссылка
//						  |ИЗ
//						  |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
//						  |ГДЕ
//						  |	уб_ОплатаПолисов.СтраховойПолис.Сделка = &Сделка
//						  |	И уб_ОплатаПолисов.ПометкаУдаления = ЛОЖЬ
//						  |	И уб_ОплатаПолисов.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
//						  |
//						  |УПОРЯДОЧИТЬ ПО
//						  |	ЗарплатныйПериод");
//Запрос.УстановитьПараметр("Сделка",Сделка);
//Выборка = Запрос.Выполнить().Выбрать();

//_ЗарплатныйПериод = ЗарплатныйПериод;

//Если _ЗарплатныйПериод = Дата(1,1,1) Тогда
//	_ЗарплатныйПериод = НачалоДня(КонецМесяца(Дата));
//КонецЕсли;	

//Пока Выборка.Следующий() Цикл
//	Если Выборка.ЗарплатныйПериод = Дата(1,1,1) Тогда
//		//не заполненные пропускаем
//		Продолжить;
//	КонецЕсли;	
//	_ЗарплатныйПериод = Мин(_ЗарплатныйПериод, Выборка.ЗарплатныйПериод);
//	Прервать;
//КонецЦикла;

////Для всех документов кроме текущего устанавливаем найденный ЗП
//Выборка.Сбросить();
//Пока Выборка.Следующий() Цикл
//	Если Выборка.ЗарплатныйПериод <> _ЗарплатныйПериод И Выборка.Ссылка <> Ссылка Тогда
//		
//		Об = Выборка.Ссылка.ПолучитьОбъект();
//		Об.ЗарплатныйПериод = _ЗарплатныйПериод;
//		Об.ЭтоКрупнаяСделка = Истина;
//		Об.ЭтоПереустановкаЗПКрупнойСделки = Истина; //Для исключения ЗАЦИКЛИВАНИЯ
//		//
//		Попытка
//			Об.Записать();
//		Исключение
//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка при установке одинакового Зарплатного периода всех оплат полиса крупной сделки."+Символы.ПС+
//				"Техническая информация: "+ОписаниеОшибки(),
//				"Сообщить", 
//				Истина,
//				УровеньЖурналаРегистрации.Ошибка,
//				Ссылка.Метаданные(),
//				Ссылка);
//		КонецПопытки;	
//	КонецЕсли;	
//КонецЦикла;	
//Возврат _ЗарплатныйПериод;
//КонецФункции	

//Обработчики формы

Процедура УстановитьКВиАВ(
	Знач НеПереУстанавливатьВыбранноеРанееКВ 	= Ложь, 
	ПроверятьАктуальностьКВ 					= Истина, 
	Параметры
	) Экспорт
	
	ОткрыватьФорму = Параметры.ОткрыватьФормуВыбораКВиАВ;
	Если НеМенятьКВ И (НеМенятьАВ Или НЕ РасчетПоАВ) Тогда
		Возврат;	
	КонецЕсли;	
	ДанныеЗапроса = ОбновитьДанныеИзПолиса(СтраховойПолис, Истина);	
	ЭтоПролонгация = ДанныеЗапроса.ПолисовПоОбъекту;
	ПрошлыйПроцент = ?(ЗначениеЗаполнено(ДанныеЗапроса.КВПроцент),ДанныеЗапроса.КВПроцент,Неопределено);
	//УстановитьПодразделение();
	_КВСумма = РасчетСуммыКВ();
	_КВСуммаДляАгента = Окр(НачисленнаяСуммаВзноса * КВПроцентДляАгента / 100, 2);
	дзКВ = Новый ДеревоЗначений;	
	Дельта = -1;	
	//Сначала подготавливаем тзКВ и тзАВ
	Если ПодготовитьДеревоКВиАВ(дзКВ, Дельта,ПрошлыйПроцент) Тогда   //, бЗадаватьВопросы = Истина
		_КВПроцент			= КВПроцент;
		_КВПроцентДляОтчета	= КВПроцентДляОтчета;
		_АВПроцент	= КВПроцентДляАгента;	
		_Условие = "";
		_КодКВ = КодКВ;
		Если НеПереУстанавливатьВыбранноеРанееКВ И ПроверятьАктуальностьКВ И КодКВ <> 0 Тогда
			НеПереУстанавливатьВыбранноеРанееКВ = НеПереУстанавливатьВыбранноеРанееКВ И (дзКВ.Строки.Найти(КодКВ,"Код",Истина) <> Неопределено);	
		КонецЕсли;
		НеПереУстанавливатьВыбранноеРанееКВ = НеПереУстанавливатьВыбранноеРанееКВ И КодКВ <> 0;
		КВНеВыбирается = НеМенятьКВ Или НеПереУстанавливатьВыбранноеРанееКВ;
		АВНеВыбирается = (НеМенятьАВ Или НЕ РасчетПоАВ);
		Если НеПереУстанавливатьВыбранноеРанееКВ И Параметры.УстанавливатьКВДляАгента Тогда
			Если НеМенятьКВ И _КВПроцент = 0 Тогда
				//Если указано 0-е КВ и оно зафиксировано, то и АВ = 0
				Если НЕ АВНеВыбирается Тогда
					УстЗнч("КВПроцентДляАгента", 0);
					УстЗнч("КВСуммаДляАгента", 0);
				КонецЕсли;
				Возврат;	
			ИначеЕсли _КВПроцент > 0 И КодКВ = 0 Тогда
				//Если указано КВ вручную, то АВ равно КВ - Дельта
				Если НЕ АВНеВыбирается Тогда
					_АВПроцент	= ?(Дельта = -1, 0, Макс(_КВПроцент - Дельта,0));	//(Если Дельта = -1, то АВ = 0; АВ не может быть меньше 0)
					_АВСумма = Окр(НачисленнаяСуммаВзноса * _АВПроцент / 100,2);
					УстЗнч("КВПроцентДляАгента", _АВПроцент);
					УстЗнч("КВСуммаДляАгента", _АВСумма);
				КонецЕсли;
				Возврат;	
			ИначеЕсли _КВПроцент > 0 И КодКВ <> 0 Тогда
				//Если указано КВ из справочника, то находим АВ по коду
				Если НЕ АВНеВыбирается Тогда
					_АВПроцент	= ПолучитьАВПоКодуКВ(КодКВ, Дельта, Агент);	
					_АВСумма = Окр(НачисленнаяСуммаВзноса * _АВПроцент / 100,2);
					УстЗнч("КВПроцентДляАгента", _АВПроцент);
					УстЗнч("КВСуммаДляАгента", _АВСумма);
				КонецЕсли;
				Возврат;	
			КонецЕсли;
		КонецЕсли;	
		//Передаем дзКВ в форму выбора и получаем обратно выбранное значение
		Если ПолучитьВыбранные_КВ_и_АВ(
			_КВПроцент, 
			_КВПроцентДляОтчета, 
			_АВПроцент, 
			_Условие, 
			_КодКВ, 
			дзКВ, 
			КВНеВыбирается, 
			АВНеВыбирается,
			ОткрыватьФорму
			) Тогда
			Если Не КВНеВыбирается Тогда
				УстЗнч("КВПроцент", _КВПроцент);
				//КВДляОтчета не будет меняться, когда не будет менятьсяКВ?
				УстЗнч("КВПроцентДляОтчета", _КВПроцентДляОтчета);
				УстЗнч("КодКВ", _КодКВ);
			КонецЕсли;
			_КВСумма = РасчетСуммыКВ();
			УстЗнч("КВСумма", _КВСумма);
			Если НЕ АВНеВыбирается И Параметры.УстанавливатьКВДляАгента Тогда
				УстЗнч("КВПроцентДляАгента", _АВПроцент);
				_АВСумма = Окр(НачисленнаяСуммаВзноса * _АВПроцент / 100,2);
				УстЗнч("КВСуммаДляАгента", _АВСумма);
			КонецЕсли;
			//УстЗнч("АВилиСкидкаСумма", _АВилиСкидкаСумма);
			ДобавитьВКомментарийУсловие(_Условие);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВыбранные_КВ_и_АВ(
	КВ, 
	КВДляОтчета, 
	АВ, 
	Условие, 
	_КодКВ, 
	дзКВ, 
	КВНеВыбирается = Ложь, 
	АВНеВыбирается = Ложь,
	ОткрыватьФорму = Истина
	)

	Банк 					= Неопределено;	
	КредитноеКВ				= Неопределено;
	ЕстьДанные 				= Ложь;	
	ВыбраннаяСтрока 		= Неопределено;
	БылаОткрытаФормаВыборКВ = Ложь;
	Если дзКВ.Строки.Количество() = 0 Тогда
		ЕстьДанные = Ложь;	
		#Если Клиент Тогда
			Состояние("НЕТ КВ БРОКЕРА!");
		#КонецЕсли
	ИначеЕсли дзКВ.Строки.Количество() = 1 И НЕ дзКВ.Строки[0].БанкСтрока = "<Кредитные КВ>" Тогда  
		//В наличии единственная строка в дзКВ: выбор КВ однозначен
		ЕстьДанные  = Истина;	
		ВыбраннаяСтрока = дзКВ.Строки[0];
		#Если Клиент Тогда
			Состояние("Единственная строка");
		#КонецЕсли
	ИначеЕсли дзКВ.Строки.Количество() = 1 И дзКВ.Строки[0].Строки.Количество() = 1 Тогда  
		//В наличии единственная строка в дзКВ: <Кредитные КВ>
		//Только Кредитные и единственная строка для этого банка
		ЕстьДанные = Истина;	
		ВыбраннаяСтрока = дзКВ.Строки[0].Строки[0];	
		#Если Клиент Тогда
			Состояние("Единственная строка. КРЕДИТ");
		#КонецЕсли
	ИначеЕсли ОткрыватьФорму Тогда
		//В наличии несколько строк в дзКВ, предоставляем выбор пользователю
		ФормаВыбора = ПолучитьОбщуюФорму("уб_ВыборКВ");
		ФормаВыбора.in_ДЗ 				= дзКВ;
		ФормаВыбора.in_СК 				= СК;
		ФормаВыбора.in_Поставщик 		= СтраховойПолис.Поставщик;
		ФормаВыбора.in_ОрганизацияАгент = СтраховойПолис.ОрганизацияАгент;
		ФормаВыбора.in_СтраховойПродукт = СтраховойПродукт;
		Если ТипЗнч(СтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
			ФормаВыбора.in_ВидСП 			= СтраховойПродукт.Вид;
		КонецЕсли;
		ФормаВыбора.in_Агент 			= Агент;
		ФормаВыбора.in_КВНеВыбирается 	= КВНеВыбирается;
		ФормаВыбора.in_АВНеВыбирается 	= АВНеВыбирается;
		ФормаВыбора.inКредитный         = СтраховойПолис.ЕстьКредитныйДоговор;
		ФормаВыбора.inЛизинговый        = СтраховойПолис.ЕстьЛизинговыйДоговор;
		ФормаВыбора.РежимВыбора 		= Истина;
		ФормаВыбора.МножественныйВыбор	= Ложь;
		ФормаВыбора.ЗакрыватьПриВыборе	= Истина;
		ФормаВыбора.ОткрытьМодально(); 
		ВыбраннаяСтрока = ФормаВыбора.out_Строка;
		ЕстьДанные = (ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаДереваЗначений"));
		БылаОткрытаФормаВыборКВ = Истина;
	КонецЕсли;
	Если ЕстьДанные Тогда
		КВ			= ВыбраннаяСтрока.Процент;
		КВДляОтчета	= ВыбраннаяСтрока.ПроцентДляОтчета;
		АВ			= ВыбраннаяСтрока.АВ;	
		Условие		= СокрЛП(ВыбраннаяСтрока.Условие);
		//
		ПолучатьБанк = Истина;
		Если БылаОткрытаФормаВыборКВ Тогда
			ВладелецСтрокиДЗ = ВыбраннаяСтрока.Владелец();
			Если ВладелецСтрокиДЗ.Колонки.Найти("БанкСтрока") = Неопределено Тогда
				ПолучатьБанк = Ложь
			КонецЕсли;
		КонецЕсли;
		Если ПолучатьБанк Тогда
			Банк = ВыбраннаяСтрока.БанкСтрока;
		КонецЕсли;
		_КодКВ      = ВыбраннаяСтрока.Код;
		Если ЗначениеЗаполнено(Банк) Тогда
			Спр = Справочники.уб_БанкиКредитные; 
			КБ = Спр.НайтиПоРеквизиту("Банк",Банк);
			Наимен = Банк;//?(КБ = Спр.ПустаяСсылка(), Банк.Наименование, КБ.Наименование);	
			Условие = ?(Найти(НРег(Наимен),"банк") = 0,"Банк: ","") + Наимен + ?(Условие = "","","; " + Условие);	
		КонецЕсли;
	КонецЕсли;	
	Возврат ЕстьДанные;	
	
КонецФункции

Функция ВозможноРедактирование(лРазблокировать, Форма, Параметры = Неопределено) Экспорт
	
	Разрешено = уб_СС.ОП_ВозможноРедактирование(ЭтотОбъект, Параметры) И лРазблокировать;
	
	ПозБлокиратора = Найти (Форма.Заголовок,"[");
	Если ПозБлокиратора>0 Тогда
		//замена
		Форма.Заголовок = Лев(Форма.Заголовок,ПозБлокиратора-1)+Параметры.ЗаголовокФормы;
	Иначе
		//добавление
		Форма.Заголовок = Форма.Заголовок+Параметры.ЗаголовокФормы;
	КонецЕсли;	
	Возврат Разрешено;
	//Инфо = "";
	//Если ЭтоНовый() Тогда
	//	Разрешено = Истина
	//ИначеЕсли лРазблокировать Тогда
	//	Разрешено = Истина;
	//	Если Не ДоступностьКВ() Тогда
	//		Инфо = "[БЛОКИРАТОРЫ: Согласованный Отчет Поставщику (нельзя менять КВ)";
	//	КонецЕсли;
	//Иначе
	//	Разрешено = уб_СС.ОП_ВозможноРедактирование(ЭтотОбъект, Инфо)
	//КонецЕсли;
	//Форма.Заголовок = ?(ЭтоНовый()," - НОВАЯ. "," № " + Строка(Номер) + ". ") + "Оплата полиса " + ?(СокрЛП(СтраховойПолис.Номер) = "",""," № " + СокрЛП(СтраховойПолис.Номер) + ". ") + ?(Разрешено,"","Только просмотр. ") + Инфо;
	//Возврат Разрешено;
	
КонецФункции

Функция ДоступностьКВ() Экспорт

	Возврат уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Или Не ЗначениеЗаполнено(ОтчетПоставщику.ДатаСогласования)	

КонецФункции // ДоступностьКВ()

//Устанавливает значение объекта/связанных данных по его имени
Функция УстЗнач(ИмяРеквизита, НовоеЗначение,НачальноеЗначение = Неопределено,ОбъектПравки =  Неопределено) Экспорт
	
	//Если Найти("",ИмяРеквизита)>0 Тогда //На будущее
	//	НачальноеЗначение="";
	//	ЕстьИзменения = ЛОЖЬ;
	//Иначе
	Если ОбъектПравки = Неопределено  Тогда
		ОбъектПравки = ЭтотОбъект;
	КонецЕсли;	
	НачальноеЗначение = ОбъектПравки[ИмяРеквизита];
	ЕстьИзменения = УстановитьЗначение(ОбъектПравки[ИмяРеквизита], НовоеЗначение); 
	//КонецЕсли;	
	
	Возврат ЕстьИзменения;
	
КонецФункции
//Получает значение объекта по его имени
Функция Знч(ИмяРеквизита) Экспорт //Для унификации получения значения при пересчетах
	Возврат ЭтотОбъект[ИмяРеквизита];
	
КонецФункции	

Функция УстЗнч(ИмяПоляДанных, НовоеЗначение, ПересчСуммы = Ложь, ИгнорироватьБлокировку = Ложь,ОбъектПравки =  Неопределено) Экспорт

	Если Не лРазрешеноРедактирование И Не ИгнорироватьБлокировку Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	НачальноеЗначение = Неопределено;
	
	Если УстЗнач(ИмяПоляДанных, НовоеЗначение,НачальноеЗначение,ОбъектПравки) Тогда
		МассивСтрок = ТЗИзменений.НайтиСтроки(Новый Структура("Реквизит",ИмяПоляДанных));
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаТЗ = МассивСтрок[0];
			НачальноеЗначение = СтрокаТЗ.НачальноеЗначение;//Берем первоначальное значение
		Иначе	
			СтрокаТЗ = ТЗИзменений.Добавить();
		КонецЕсли;	
		СтрокаТЗ.Реквизит 			= ИмяПоляДанных;
		СтрокаТЗ.НачальноеЗначение  = НачальноеЗначение;
		СтрокаТЗ.НовоеЗначение		= ОбъектПравки[ИмяПоляДанных];
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;

КонецФункции // УстЗнч()

Функция ПолучитьАВПоКодуКВ(_КодКВ, Дельта, Агент, СсылкаНаСтрокуКВ = Неопределено, Процент = Неопределено,естьЭксклюзивныеКВ = Истина)
	
	Если СсылкаНаСтрокуКВ = Неопределено Тогда
		СсылкаНаСтрокуКВ = Справочники.уб_КВ.НайтиПоКоду(_КодКВ);
	КонецЕсли;
	Если Процент = Неопределено Тогда
		Процент = СсылкаНаСтрокуКВ.Процент;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(СсылкаНаСтрокуКВ) Тогда
		Возврат 0; 
	КонецЕсли;
	ЗксклюзивАВ =?(естьЭксклюзивныеКВ,НайтиЭксклюзивноеАВ(СсылкаНаСтрокуКВ, Агент),Неопределено);  
	Если ЗксклюзивАВ = Неопределено Тогда
		АВ = ?(Дельта = -1,0,Макс(Процент - Дельта,0)); 
	Иначе
		АВ = ЗксклюзивАВ; 
	КонецЕсли;
	Возврат АВ; 
	
КонецФункции

Функция НайтиЭксклюзивноеАВ(СсылкаНаСтрокуКВ, Знач Агент)
	
	тзАВ = уб_СтраховойБрокер.Получить_АВ(
			Дата
			, СсылкаНаСтрокуКВ
			, Подразделение.Владелец
			, Подразделение
			, Агент);
			
	Если тзАВ.Количество() = 0 Тогда
		Возврат Неопределено; 
	КонецЕсли;
	Возврат тзАВ[0].Процент; 
	
КонецФункции

Процедура ДобавитьВКомментарийУсловие(Знач Условие)
	
	Условие = СокрЛП(Условие);
	Если Условие <> "" И Найти(Комментарий,Условие) > 0 Тогда
		Возврат;	
	КонецЕсли;
	ЛевОграничитель = "{";
	ПравОграничитель = "}";
	Нач = Найти(Комментарий,ЛевОграничитель);
	Кон = Найти(Комментарий,ПравОграничитель);
	Если Нач > 0 И Кон > 0 Тогда
		Комментарий = СокрЛП(Сред(Комментарий,1,Нач-1) + " " + Сред(Комментарий,Кон+1));
	КонецЕсли;
	Если Условие = "" Тогда
		Возврат;	
	Иначе
		Условие = СтрЗаменить(Условие,ЛевОграничитель,"(");
		Условие = СтрЗаменить(Условие,ПравОграничитель,")");
	КонецЕсли;
	Комментарий = ЛевОграничитель + Условие + ПравОграничитель + " " + Комментарий;	
	
КонецПроцедуры

Функция ПодготовитьДеревоКВиАВ(дзКВ, Дельта = -1, ПрошлыйПроцент = Неопределено, Сообщать = Ложь,ДанныеПолиса = неопределено) Экспорт
	Если ДанныеПолиса = неопределено Тогда
		ДанныеПолиса = СтраховойПолис;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ДанныеПолиса) Тогда
		#Если Клиент Тогда
			Если Сообщать Тогда
				Сообщить("При получени КВ не хватает данных: не указан Страховой Полис.")
			КонецЕсли;
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;	
	Если НеМенятьКВ И (НеМенятьАВ ИЛИ НЕ РасчетПоАВ) Тогда
		Возврат Ложь;
	КонецЕсли;
	//TODO Ускорить
	Организация			= Подразделение.Владелец; 
	ДатаКВ	 			= ДанныеПолиса.Дата;	
	СП_Поставщик		= ДанныеПолиса.Поставщик;
	СП_ОрганизацияАгент	= ДанныеПолиса.ОрганизацияАгент;
	//Формируем виртуальную таблицу КВ, которая будет включать в себя полную матрицу данных по КВ брокера и Агента
	//актуальных для этого страхового полиса
	//Отталкиваемся от матрицы КВ брокера.
	тзКВ = уб_СтраховойБрокер.Получить_КВ_Брокера(
			ДатаКВ
			, СК
			, СП_Поставщик
			, СП_ОрганизацияАгент
			, ВидСП
			, СтраховойПродукт);
	тзКВ.Свернуть("Процент,Условие,БанкСтрока,ПроцентДляОтчета,Код,Ссылка,ПролонгацияПоПредыдущемуПроценту");
	//Если СтраховойПолис.ЕстьКредитныйДоговор Тогда
	//	//Удаляем не кредитные строки
	//	тзКВ = тзКВ.Скопировать(Новый Структура("Банк",СтраховойПолис.КредитныйБанк.Банк));
	//Иначе
	//	//
	//	тзКВ = тзКВ.Скопировать(Новый Структура("Банк",Справочники.Банки.ПустаяСсылка()));
	//КонецЕсли;	
	// КВ не найдено, тогда сообшаем об ошибке и выходим
	Если тзКВ.Количество() = 0 Тогда
		#Если Клиент  Тогда
			Если Сообщать Тогда
				Сообщить("Не найдено КВ для страхового продукта '" + СтраховойПродукт.Наименование + "', СК: '" + 
					Строка(СК) + "', Поставщик: '" + Строка(СП_Поставщик) + "', ОргАгент: '" + Строка(СП_ОрганизацияАгент) + "'." );
			КонецЕсли;
		#КонецЕсли
		Возврат Ложь;			
	КонецЕсли;
	тзКВ.Сортировать("БанкСтрока,Условие,Процент,ПроцентДляОтчета");//Для оптимизации переход к строковому значению банка
	уб_СС.УдалитьПустыеКолонки(тзКВ,"Процент,ПроцентДляОтчета,Условие,БанкСтрока");
	// найден один или несколько вариантов КВ 
	// Различные вариации КВ: по Условию, Рискам, а так же вид КВ - "Кредитное"
	дзКВ = Новый ДеревоЗначений;
	Для Каждого Колонка ИЗ тзКВ.Колонки Цикл
		дзКВ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок, Колонка.Ширина);
	КонецЦикла;	
	МассивТипов = Новый Массив;
	//МассивТипов.Добавить(Тип("ПеречислениеСсылка.уб_ВидыКВ"));
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТипаПроцент = Новый ОписаниеТипов(МассивТипов,Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный),Новый КвалификаторыСтроки(40));
	ОписаниеТипаДельта = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Любой));
	//ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255));	
	дзКВ.Колонки.Добавить("АВ",		ОписаниеТипаПроцент,	"АВ, %",		6);
	дзКВ.Колонки.Добавить("Дельта",	ОписаниеТипаДельта,		"Дельта, %",	6);
	//Находим "Дельту" КВ для данного случая и заполняем колонку АВ соответствующими значениями
	тзДельта = уб_СтраховойБрокер.ПолучитьДельтуКВ(
		ДатаКВ, 
		Перечисления.уб_НазначенияКВ.ДляМенеджера,
		Организация,
		Подразделение,
		Агент, 
		СП_Поставщик, 
		СП_ОрганизацияАгент, 
		СК, 
		ВидСП, 
		СтраховойПродукт 
	);
	Дельта = -1; //Для данного значения Дельта значение АВ везде будет равно 0
	Если тзДельта.Количество() > 0 Тогда
		Дельта = тзДельта[0].Дельта;
	КонецЕсли;	
	//Заполняем дерево значений
	СтрокаКредитныхКВ = Неопределено;
	естьЭксклюзивныеКВ = уб_СтраховойБрокер.ЕстьЭксклюзивноеКВ();
	Для Каждого стрТЗ из тзКВ Цикл
		Если дзКВ.Колонки.Найти("БанкСтрока") <> Неопределено И НЕ ЗначениеНеЗаполнено(стрТЗ.БанкСтрока) Тогда
			Если СтрокаКредитныхКВ = Неопределено Тогда
				СтрокаКредитныхКВ = дзКВ.Строки.Вставить(0); 	
				СтрокаКредитныхКВ.Условие = "<Кредитные КВ>";
				СтрокаКредитныхКВ.БанкСтрока = "<Кредитные КВ>"; 	
				СтрокаКредитныхКВ.АВ = "---";
				СтрокаКредитныхКВ.Процент = "---";
				СтрокаКредитныхКВ.ПроцентДляОтчета = "---"; 	
			КонецЕсли;
			новСтр = СтрокаКредитныхКВ.Строки.Добавить();
		Иначе
			новСтр = дзКВ.Строки.Добавить();
		КонецЕсли;		
		Для Каждого кол из тзКВ.Колонки Цикл
			новСтр[кол.Имя] = стрТЗ[кол.Имя];
		КонецЦикла;
		новСтр.Дельта = Дельта; 		
		новСтр.АВ = ПолучитьАВПоКодуКВ(стрТЗ.Код, Дельта, Агент, стрТЗ.Ссылка,стрТЗ.Процент,естьЭксклюзивныеКВ);
		Если ПрошлыйПроцент <>Неопределено и стрТЗ.ПролонгацияПоПредыдущемуПроценту = Истина Тогда 
			НомерСтроки = дзКВ.Строки.Количество()-1;
			СтрокаПролонгации = дзКВ.Строки.Вставить(НомерСтроки);
			ЗаполнитьЗначенияСвойств(СтрокаПролонгации,новСтр);
			СтрокаПролонгации.Процент = ПрошлыйПроцент;
			СтрокаПролонгации.ПроцентДляОтчета = ПрошлыйПроцент;
			СтрокаПролонгации.Условие = "Это ПРОЛОНГАЦИЯ !!!";
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция РасчетСуммыКВ(ДляОтчета = Ложь) Экспорт

	РасчетнаяБаза  = ?(НачисленнаяСуммаВзноса = 0,ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,НачисленнаяСуммаВзноса);
			
	Возврат уб_РасчетыСменеджерами.уб_Окр(РасчетнаяБаза * ?(ДляОтчета, КВПроцентДляОтчета, КВПроцент) / 100, РазрядностьОкругления,РежимОкругления);

КонецФункции // РасчетСуммыКВ()

//!!!
Функция ОбновитьДанныеИзПолиса(оСП, БезВопросов = Истина) Экспорт
		
	Запрос = Новый Запрос (
	"ВЫБРАТЬ
	|	уб_СтраховойПолис.Ссылка,
	|	уб_СтраховойПолис.СК,
	|	Выбор когда ТИПЗНАЧЕНИЯ(уб_СтраховойПолис.СтраховойПродукт) = Тип(Справочник.Уб_СтраховыеПродукты) Тогда уб_СтраховойПолис.СтраховойПродукт.Вид Иначе уб_СтраховойПолис.СтраховойПродукт Конец как СтраховойПродуктВид,
	|	уб_СтраховойПолис.СтраховойПродукт,
	|	уб_СтраховойПолис.СтраховаяПремия,
	|	уб_СтраховойПолис.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА уб_СтраховойПолис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Аннулирован,
	|	уб_СтраховойПолис.ОбъектСтрахования,
	|	уб_СтраховойПолис.Страхователь,
	|	1 КАК счетчик,
	|	уб_СтраховойПолисПоОбъекту.Ссылка КАК СтраховойПолисГод,
	|	НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД) КАК ЭтотГод,
	|	НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД) КАК ГодПолиса,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), ГОД) КАК Поле1,
	|	уб_СтраховойПолисПоОбъекту.Ссылка КАК ПрошлыйПолис,
	|	ВЫБОР
	|		КОГДА уб_СтраховойПолис.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПуСтаяСсылка)
	|			ТОГДА уб_СтраховойПолис.Куратор
	|		ИНАЧЕ уб_СтраховойПолис.Заявка.Куратор
	|	КОНЕЦ КАК Куратор,
	|	ЕСТЬNULL(уб_СтраховойПолисБСО.ВидБСО, ЗНАЧЕНИЕ(Справочник.уб_ВидыБСО.ПустаяСсылка)) КАК ВидБСОПолиса
	|ПОМЕСТИТЬ ДанныеПоПолисуИОбъекту
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолисПоОбъекту
	|		ПО уб_СтраховойПолис.Страхователь = уб_СтраховойПолисПоОбъекту.Страхователь
	|			И уб_СтраховойПолис.СК = уб_СтраховойПолисПоОбъекту.СК
	|			И уб_СтраховойПолис.СтраховойПродукт = уб_СтраховойПолисПоОбъекту.СтраховойПродукт
	|			И уб_СтраховойПолис.ОбъектСтрахования = уб_СтраховойПолисПоОбъекту.ОбъектСтрахования
	|			И (НЕ уб_СтраховойПолисПоОбъекту.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка))
	|			И (НЕ уб_СтраховойПолисПоОбъекту.Ссылка = &Ссылка)
	|			И (ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ) >= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ)
	|					ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ) - РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ)
	|				ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ) - РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ)
	|			КОНЕЦ < 7)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	|		ПО (уб_СтраховойПолисБСО.Ссылка = уб_СтраховойПолис.Ссылка)
	|			И (уб_СтраховойПолисБСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОСАГО)))
	|ГДЕ
	|	уб_СтраховойПолис.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Оплаты.КВПроцент) КАК КВПроцент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Оплаты.СтраховойПолис) КАК ПолисовПоОбъекту
	|ПОМЕСТИТЬ КВПрошлойОплаты
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК Оплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПолисуИОбъекту КАК ДанныеПоПолисуИОбъекту
	|		ПО Оплаты.СтраховойПолис = ДанныеПоПолисуИОбъекту.СтраховойПолисГод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоПолисуИОбъекту.Ссылка,
	|	ДанныеПоПолисуИОбъекту.СК,
	|	ДанныеПоПолисуИОбъекту.СтраховойПродуктВид,
	|	ДанныеПоПолисуИОбъекту.ВидБСОПолиса,
	|	ДанныеПоПолисуИОбъекту.СтраховойПродукт,
	|	ДанныеПоПолисуИОбъекту.СтраховаяПремия,
	|	ДанныеПоПолисуИОбъекту.ВалютаДокумента,
	|	ДанныеПоПолисуИОбъекту.Аннулирован,
	|	ДанныеПоПолисуИОбъекту.ОбъектСтрахования,
	|	ДанныеПоПолисуИОбъекту.Страхователь,
	|	ДанныеПоПолисуИОбъекту.счетчик + ЕСТЬNULL(КВПрошлойОплаты.ПолисовПоОбъекту, 0) КАК ПолисовПоОбъекту,
	|	ЕСТЬNULL(КВПрошлойОплаты.КВПроцент, 0) КАК КВПроцент,
	|	КВПрошлойОплаты.ПолисовПоОбъекту КАК ДругихПолисов,
	|	ДанныеПоПолисуИОбъекту.Куратор
	|ИЗ
	|	ДанныеПоПолисуИОбъекту КАК ДанныеПоПолисуИОбъекту
	|		ЛЕВОЕ СОЕДИНЕНИЕ КВПрошлойОплаты КАК КВПрошлойОплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДанныеПоПолисуИОбъекту.Ссылка = &Ссылка"
	//Старый
	//"ВЫБРАТЬ
	//|	уб_СтраховойПолис.Ссылка,
	//|	уб_СтраховойПолис.СК,
	//|	уб_СтраховойПолис.СтраховойПродукт.Вид,
	//|	уб_СтраховойПолис.СтраховойПродукт,
	//|	уб_СтраховойПолис.СтраховаяПремия,
	//|	уб_СтраховойПолис.ВалютаДокумента,
	//|	ВЫБОР
	//|		КОГДА уб_СтраховойПолис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка))
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК Аннулирован,
	//|	уб_СтраховойПолис.ОбъектСтрахования,
	//|	уб_СтраховойПолис.Страхователь,
	//|	1 КАК счетчик,
	//|	уб_СтраховойПолисПоОбъекту.Ссылка КАК СтраховойПолисГод,
	//|	НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД) КАК ЭтотГод,
	//|	НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД) КАК ГодПолиса,
	//|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), ГОД) КАК Поле1,
	//|	ВЫБОР
	//|		КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), ГОД) = 1
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ПрошлыйПолис
	//|ПОМЕСТИТЬ ДанныеПоПолисуИОбъекту
	//|ИЗ
	//|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолисПоОбъекту
	//|		ПО уб_СтраховойПолис.Страхователь = уб_СтраховойПолисПоОбъекту.Страхователь
	//|			И уб_СтраховойПолис.СК = уб_СтраховойПолисПоОбъекту.СК
	//|			И уб_СтраховойПолис.СтраховойПродукт.Вид = уб_СтраховойПолисПоОбъекту.СтраховойПродукт.Вид
	//|			И уб_СтраховойПолис.ОбъектСтрахования = уб_СтраховойПолисПоОбъекту.ОбъектСтрахования
	//|			И (НЕ уб_СтраховойПолисПоОбъекту.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка))
	//|			И (ВЫБОР
	//|				КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ) >= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ)
	//|					ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ) - РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ)
	//|				ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолисПоОбъекту.ДатаНачала, ГОД), уб_СтраховойПолисПоОбъекту.ДатаНачала, ДЕНЬ) - РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(уб_СтраховойПолис.ДатаНачала, ГОД), уб_СтраховойПолис.ДатаНачала, ДЕНЬ)
	//|			КОНЕЦ < 7)
	//|ГДЕ
	//|	уб_СтраховойПолис.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(Оплаты.КВПроцент) КАК КВПроцент
	//|ПОМЕСТИТЬ КВПрошлойОплаты
	//|ИЗ
	//|	Документ.уб_ОплатаПолисов КАК Оплаты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПолисуИОбъекту КАК ДанныеПоПолисуИОбъекту
	//|		ПО Оплаты.СтраховойПолис = ДанныеПоПолисуИОбъекту.СтраховойПолисГод
	//|			И (ДанныеПоПолисуИОбъекту.ПрошлыйПолис = ИСТИНА)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ДанныеПоПолисуИОбъекту.Ссылка,
	//|	ДанныеПоПолисуИОбъекту.СК,
	//|	ДанныеПоПолисуИОбъекту.СтраховойПродуктВид,
	//|	ДанныеПоПолисуИОбъекту.СтраховойПродукт,
	//|	ДанныеПоПолисуИОбъекту.СтраховаяПремия,
	//|	ДанныеПоПолисуИОбъекту.ВалютаДокумента,
	//|	ДанныеПоПолисуИОбъекту.Аннулирован,
	//|	ДанныеПоПолисуИОбъекту.ОбъектСтрахования,
	//|	ДанныеПоПолисуИОбъекту.Страхователь,
	//|	СУММА(ДанныеПоПолисуИОбъекту.счетчик) КАК ПолисовПоОбъекту,
	//|	МАКСИМУМ(КВПрошлойОплаты.КВПроцент) КАК КВПроцент
	//|ИЗ
	//|	ДанныеПоПолисуИОбъекту КАК ДанныеПоПолисуИОбъекту
	//|		ЛЕВОЕ СОЕДИНЕНИЕ КВПрошлойОплаты КАК КВПрошлойОплаты
	//|		ПО (ИСТИНА)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДанныеПоПолисуИОбъекту.Ссылка,
	//|	ДанныеПоПолисуИОбъекту.СК,
	//|	ДанныеПоПолисуИОбъекту.СтраховойПродуктВид,
	//|	ДанныеПоПолисуИОбъекту.СтраховойПродукт,
	//|	ДанныеПоПолисуИОбъекту.СтраховаяПремия,
	//|	ДанныеПоПолисуИОбъекту.ВалютаДокумента,
	//|	ДанныеПоПолисуИОбъекту.Аннулирован,
	//|	ДанныеПоПолисуИОбъекту.ОбъектСтрахования,
	//|	ДанныеПоПолисуИОбъекту.Страхователь"
	);
	Запрос.УстановитьПараметр("Ссылка", Осп.ссылка);					   
	ДанныеПолиса = Запрос.Выполнить().Выбрать();
	Если ДанныеПолиса.Следующий() Тогда
		лВидБСОКвА7 = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СК);
		//
		УстЗнч("СК", 					ДанныеПолиса.СК, 					, Истина);
		УстЗнч("ВидСП", 				ДанныеПолиса.СтраховойПродуктВид, 	, Истина);
		УстЗнч("ВидБСОПолиса", 			ДанныеПолиса.ВидБСОПолиса, 	, Истина);
		
		УстЗнч("СтраховойПродукт", 		ДанныеПолиса.СтраховойПродукт, 		, Истина);
		УстЗнч("ПолнаяСтраховаяПремия", ДанныеПолиса.СтраховаяПремия, 		, Истина);
		УстЗнч("Валюта", 				ДанныеПолиса.ВалютаДокумента, 		, Истина);
		УстЗнч("ПолисАннулирован", 		ДанныеПолиса.Аннулирован, 			, Истина);
		Если НЕ (СкидкаВыплаченаяКлиенту>0 и ЗначениеЗаполнено(Куратор)) Тогда
			УстЗнч("Куратор", 		        ДанныеПолиса.Куратор, 			, Истина);
		КонецЕсли;	
		
	КонецЕсли;
	Если мВалютаРегл <> Валюта Тогда
		ОбновитьКурс();
		ОбновитьНачисленнуюСуммуВзноса();
	КонецЕсли;	
	УстановитьНомерВзноса();	
	Возврат ДанныеПолиса;
	
КонецФункции

Функция УстановитьНомерВзноса() Экспорт
	
	//В Выборка оплаты расположены в порядке возрастания даты
	ТзОплат = уб_СС.ОП_ПолучитьТзОплат(СтраховойПолис);
	Если ТзОплат.Количество() = 0 Тогда
		Возврат УстЗнч("НомерВзноса", 1);
	КонецЕсли;	
	НомерВзноса_ = 0;
	Для Каждого оОплата из ТзОплат Цикл
		НомерВзноса_ = НомерВзноса_ + 1;
		Если оОплата.Ссылка = Ссылка Тогда
			Прервать;
		КонецЕсли;
		Если лАктуальныйПериод < оОплата.Дата Тогда
			НомерВзноса_ = НомерВзноса_ - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Возврат УстЗнч("НомерВзноса", НомерВзноса_);
	
КонецФункции

Процедура ОбновитьНачисленнуюСуммуВзноса(Знач БезВопросов = Истина) Экспорт
	
	Если НачисленнаяСуммаВзносаВВалюте = 0 Тогда
		Возврат;	
	КонецЕсли;
	Новая_НачисленнаяСуммаВзноса = Окр(НачисленнаяСуммаВзносаВВалюте * Курс, 2);	
	Если Новая_НачисленнаяСуммаВзноса <> НачисленнаяСуммаВзноса Тогда
		#Если Клиент Тогда
			Заг = "Изменилась сумма взноса в рублях";
			СОО = "Внимание! Новая сумма вноса без скидок в рублях (" + Новая_НачисленнаяСуммаВзноса + "),
			  |расчитанная по курсу на день оплаты отличается от указанной (" + НачисленнаяСуммаВзноса + ").
			  |
			  |Изменить сумму взноса в рублях на расчетную?";
			Если КодВозвратаДиалога.Да = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг) Тогда
				БезВопросов = Истина
			КонецЕсли;
		#КонецЕсли
		Если БезВопросов Тогда
			УстЗнч("НачисленнаяСуммаВзноса", Новая_НачисленнаяСуммаВзноса, , Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьКурс(Знач БезВопросов = Истина) Экспорт
	
	//УстЗнч("Валюта", ?(СтраховойПолис.Пустая(),мВалютаРегл,СтраховойПолис.ВалютаДокумента),, Истина);
	Если мВалютаРегл = Валюта Тогда
		УстЗнч("Курс", 1,, Истина);
	Иначе		
		СтруктураКурса = ОбщегоНазначения.ПолучитьКурсВалюты(Валюта, Дата);
		Новый_Курс = ?(СтруктураКурса.Курс = 0, 1, СтруктураКурса.Курс);
		Если Новый_Курс <> Курс Тогда
			#Если Клиент Тогда
				Заг = "Изменился курс валюты";
				СОО = "Внимание! Новый курс валюты (" + Валюта + "): " + Новый_Курс + ",
					|полученный на день оплаты отличается от текущего (" + Курс + ").
					|
				  	|Обновить курс?";
				Если КодВозвратаДиалога.Да = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг) Тогда
					БезВопросов = Истина
				КонецЕсли;
			#КонецЕсли
			Если БезВопросов Тогда
				УстЗнч("Курс", Новый_Курс,, Истина);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры


Процедура Подсветить(Элемент, бПодсветить, Критичность = 3) Экспорт // Критичность - от 0 до 3
	
	чсл = 255 - (255/3 * Критичность);
	ЦветПодсветки = Новый Цвет(255,255,чсл);
	гЦветАвто = Новый Цвет();
	Если ТипЗнч(Элемент) = Тип("Надпись") Тогда
		Элемент.ЦветФона = ?(бПодсветить,ЦветПодсветки,гЦветАвто);
	ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеВвода") Тогда
		Элемент.ЦветФона = ?(бПодсветить,ЦветПодсветки,гЦветАвто);
		Элемент.ЦветФонаПоля = ?(бПодсветить,ЦветПодсветки,гЦветАвто);
	КонецЕсли;
	Элемент.ЦветТекста = ?(бПодсветить,Новый Цвет(255,0,0),гЦветАвто);
КонецПроцедуры


//++Расчеты
Функция ЗарегистрироватьРасчеты(Выборка =Неопределено) Экспорт
	
	Если Выборка = Неопределено Тогда 
		Выборка = СтраховойПолис;
	КонецЕсли;
	ТаблицаРасчетов = СобратьРасчеты(Выборка);
	ЕстьИзменения = Ложь;
	НовыеРасчеты = уб_Взаиморасчеты.СравнитьСкорректироватьТаблицу(РасчетыПоДокументу.Выгрузить(),ТаблицаРасчетов,ЕстьИзменения,"Вид,УидСтроки,Уточнение");
	Если ЕстьИзменения = Истина Тогда
		РасчетыПоДокументу.Загрузить(НовыеРасчеты);
	КонецЕсли;	
	
КонецФункции

Функция СобратьРасчеты(Выборка)
	СсылкаДокумента = ?(ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка);
	НомерПолиса = СокрЛП(Выборка.Номер);
	ТаблицаРасчетов = РасчетыПоДокументу.Выгрузить();
	ТаблицаРасчетов.Очистить();
	Для каждого СтрокаБСО  из УслугиПоДокументу Цикл
		уб_Взаиморасчеты.ПроверитьСтроку(СтрокаБСО);
		Если СтрокаБСО.СхемаОплаты = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль 
			ИЛИ	СтрокаБСО.СхемаОплаты  = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ
			ИЛИ (СтрокаБСО.СхемаОплаты = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка() 
			и СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ) Тогда
			ПлановаяСтоимость = СтрокаБСО.Себестоимость;
			Разница = СтрокаБСО.Сумма-ПлановаяСтоимость;
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтКлиентаПрочее;
			СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
			СтрокаР.Уточнение     = СтрокаБСО.Вид;
			СтрокаР.СуммаКлиент   = СтрокаБСО.Сумма;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = ПлановаяСтоимость;//Часть брокера   
			
			//++ ОТЛИЧИЕ ++
			Если СтрокаБСО.СхемаОплаты = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль  Тогда
				_Вид  = Справочники.уб_ВидыРасчетныхОпераций.НачислениеВМ;  //Сразу менеджеру
				ВМ   = Разница;
			Иначе 
				_Вид           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеСКВ; //Часть от СКВ менеджеру
				ВМ   = 0;
			КонецЕсли;	
			УстЗнч("ВМ",ВМ,,,СтрокаБСО);
			
			Если СтрокаБСО.СхемаОплатыРОП= ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПроцентОтСебестоимости Тогда
				_ВидВР  = Справочники.уб_ВидыРасчетныхОпераций.НачислениеРОП; //Руковоодителю
				ПараметрыСотрудника = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
				ПараметрыСотрудника.ВключаяВыбывших		= Истина;
				ПараметрыСотрудника.ТолькоТочкиПродаж		= Истина;
				//ПараметрыСотрудника.СотрудникиПоДокументу = СписокСотрудниковДляДокумента();
				уб_СС.ПодчиненныеРуководителя(Агент,, ПараметрыСотрудника);
				
				РуководительСотрудника = ПараметрыСотрудника.РуководительСотрудника;
				Если ЗначениеЗаполнено(РуководительСотрудника) Тогда
					ПроцентРОП = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ПроцентРОПСебестоимость"+ПараметрыСотрудника.ПодразделениеСотрудника,РуководительСотрудника,ЗарплатныйПериод,0);
					ВР = Окр(ПлановаяСтоимость*ПроцентРОП/100,2);
				Иначе
					ВР  = 0;	
				КонецЕсли;
				
				
			Иначе 
				_ВидВР           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеСКВ; //Часть от СКВ менеджеру
				ВР  = 0;
				РуководительСотрудника = Справочники.ФизическиеЛица.ПустаяСсылка(); 
			КонецЕсли;	
			УстЗнч("ВР",ВР,,Истина,СтрокаБСО);
			
			//-- ОТЛИЧИЕ --
			Если ВМ >0 Тогда
				СтрокаР = ТаблицаРасчетов.Добавить();
				СтрокаР.Вид = _Вид;
				СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
				СтрокаР.Уточнение     = СтрокаБСО.Вид;
				СтрокаР.СуммаКлиент   = 0;
				СтрокаР.СуммаМенеджер = ВМ;//Разница;
				СтрокаР.СуммаБрокер   = 0;
				СтрокаР.СуммаБрокерВС = 0;
			КонецЕсли;
			
			Если ВР >0 и ЗначениеЗаполнено(РуководительСотрудника) Тогда
				СтрокаР = ТаблицаРасчетов.Добавить();
				СтрокаР.Вид = _ВидВР;
				СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
				СтрокаР.Уточнение     = РуководительСотрудника;
				СтрокаР.СуммаКлиент   = 0;
				СтрокаР.СуммаМенеджер = ВР;//Разница;
				СтрокаР.СуммаБрокер   = ПлановаяСтоимость;
				СтрокаР.СуммаБрокерВС = 0;
			КонецЕсли;

			
		КонецЕсли;
	КонецЦикла;
	Если НачисленнаяСуммаВзноса<>0 Тогда
		СтрокаР = ТаблицаРасчетов.Добавить();
		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса;
		СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
		СтрокаР.Уточнение     = НомерПолиса;
		СтрокаР.СуммаКлиент   = НачисленнаяСуммаВзноса;
		СтрокаР.СуммаМенеджер = 0;
		СтрокаР.СуммаБрокер   = 0;//Часть брокера   
	КонецЕсли;
	ЭтоПоАВ = СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;//ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ; 
	Если АВилиСкидкаСумма<>0 Тогда
		Если ЭтоПоАВ Тогда
			//Допустимы 3 варианта                                 АВ                    СКИДКА
			//1. Менеджер полностью забрал АВ сразу        АВилиСкидкаСумма                 0
			//2. Менеджер полностью забрал АВ позднее      КВАгента-АВилиСкидкаСумма   АВилиСкидкаСумма
			//3. Эта сумма частично скидка, частично АВ    КВАгента-АВилиСкидкаСумма   АВилиСкидкаСумма
			//4. Менеджеру АВ идет в момент выплаты ЗП     КВАгента-АВилиСкидкаСумма   АВилиСкидкаСумма
			//Расчетная скидка
			АВилиСкидкаСуммаРасчетное = Окр(НачисленнаяСуммаВзноса+СуммаДоп - ОплаченоФакт,2);
			АВСумма  = КВСуммаДляАгента-КВСуммаУдержания-АВилиСкидкаСуммаРасчетное;
			Брокеру  = КВСумма-КВСуммаДляАгента;
			Если АВилиСкидкаСуммаРасчетное<>0 Тогда
				//Недосданная сумма
				//принимаем это всегда скидкой, хотя это может включать АВ
				СтрокаР = ТаблицаРасчетов.Добавить();
				СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ;
				СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
				СтрокаР.Уточнение     = НомерПолиса;
				СтрокаР.СуммаКлиент   = -АВилиСкидкаСуммаРасчетное;
				СтрокаР.СуммаМенеджер = 0;
				СтрокаР.СуммаБрокер   = 0;//Часть брокера   	
			КонецЕсли;	
			Если АВСумма<>0 или Брокеру<>0 Тогда
				//Если АВ < Сданных, удерживается из ВМ
				СтрокаР = ТаблицаРасчетов.Добавить();
				СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ВыплатаМенеджеру;
				СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
				СтрокаР.Уточнение     = НомерПолиса;
				СтрокаР.СуммаКлиент   = 0;
				СтрокаР.СуммаМенеджер = АВСумма;
				СтрокаР.СуммаБрокер   = Брокеру; //часть брокера   	
			КонецЕсли;
			
		Иначе
			//Явная скидка
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ;
			СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
			СтрокаР.Уточнение     = НомерПолиса;
			СтрокаР.СуммаКлиент   = -АВилиСкидкаСумма;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = 0;//Часть брокера   	
		КонецЕсли;
	КонецЕсли;
	
	Если ОплаченоФакт<>0 Тогда
		СтрокаР = ТаблицаРасчетов.Добавить();
		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером;
		СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
		СтрокаР.Уточнение     = НомерПолиса;
		СтрокаР.СуммаКлиент   = -ОплаченоФакт;
		СтрокаР.СуммаМенеджер = 0;
		СтрокаР.СуммаБрокер   = 0;//Часть брокера   
	КонецЕсли;
	
	Если СкидкаВыплаченаяКлиенту<>0 и НЕ ЭтоПоАВ Тогда
		СтрокаР = ТаблицаРасчетов.Добавить();
		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту;
		СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
		СтрокаР.Уточнение     = НомерПолиса;
		СтрокаР.СуммаКлиент   = СкидкаВыплаченаяКлиенту;
		СтрокаР.СуммаМенеджер = 0;
		СтрокаР.СуммаБрокер   = 0;//Часть брокера   
	КонецЕсли;
	
	Если СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ
		ИЛИ СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ Тогда
		СтрокаР = ТаблицаРасчетов.Добавить();
		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеСКВ; //Часть от СКВ менеджеру
		ВМ   = 0;
		
	//	УстЗнч("ВМ",ВМ,,,СтрокаБСО);
		//-- ОТЛИЧИЕ --
		СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
		СтрокаР.Уточнение     = НомерПолиса;
		СтрокаР.СуммаКлиент   = 0;
		СтрокаР.СуммаМенеджер = ?(ОплаченоФакт>0 и (КВСуммаДляАгента-КВСуммаУдержания)>АВилиСкидкаСумма,(КВСуммаДляАгента-КВСуммаУдержания)-АВилиСкидкаСумма,0)*(100-ПроцентСКВ)/100;
		СтрокаР.СуммаБрокер   = 0;
		СтрокаР.СуммаБрокерВС = 0;
	КонецЕсли;
	
	Если СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ
		ИЛИ СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ 
		и ПроцентСКВ<>0 Тогда
		СтрокаР = ТаблицаРасчетов.Добавить();
		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.СКВПартнера; //Часть от СКВ менеджеру
		ВМ   = 0;
		
		СтрокаР.УидСтроки     = Ссылка.УникальныйИдентификатор();
		СтрокаР.Уточнение     = Куратор;
		СтрокаР.СуммаКлиент   = 0;
		СтрокаР.СуммаМенеджер = ?(ОплаченоФакт>0 и (КВСуммаДляАгента-КВСуммаУдержания)>АВилиСкидкаСумма,(КВСуммаДляАгента-КВСуммаУдержания)-АВилиСкидкаСумма,0)*ПроцентСКВ/100;
		СтрокаР.СуммаБрокер   = 0;
		СтрокаР.СуммаБрокерВС = 0;
	КонецЕсли;
	

	//	//
	//	//ПроверитьСтрокуБСО(СтрокаБСО);
	//	
	//	ТолькоБрокерскиеРасчеты = ТипЗнч(СтрокаБСО.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО")	и СтрокаБСО.ВидБСО.Владелец = ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент;
	//	//Страховая премия
	//	Если СтрокаБСО.ИтогСтраховаяПремия<>0 Тогда
	//		СтрокаР = ТаблицаРасчетов.Добавить();
	//		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером;//!!!Возможно другой вариант
	//		СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
	//		СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
	//		СтрокаР.СуммаКлиент   = СтрокаБСО.ИтогСтраховаяПремия;
	//		СтрокаР.СуммаМенеджер = 0;
	//		СтрокаР.СуммаБрокер   = ?(ТолькоБрокерскиеРасчеты,0,СтрокаБСО.ИтогСтраховаяПремия);
	//		СтрокаР.СуммаБрокерВС = 0;
	//	КонецЕсли;
	//	Если ТолькоБрокерскиеРасчеты Тогда
	//		ПлановаяСтоимость = СтрокаБСО.ВидБСО.ПлановаяСтоимость;
	//		Разница = СтрокаБСО.ИтогСтраховаяПремия-ПлановаяСтоимость;
	//		//Если ПлановаяСтоимость >0 Тогда
	//		//	СтрокаР = ТаблицаРасчетов.Добавить();
	//		//	СтрокаР.НачислениеВМ  =
	//		//	СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
	//		//	СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
	//		//	СтрокаР.СуммаКлиент   = 0;
	//		//	СтрокаР.СуммаМенеджер = 0;
	//		//	СтрокаР.СуммаБрокер   = 0;//-ПлановаяСтоимость;//Часть брокера
	//		//КонецЕсли;	
	//		Если Разница >0 Тогда
	//			СтрокаР = ТаблицаРасчетов.Добавить();
	//			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеВМ;
	//			СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
	//			СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
	//			СтрокаР.СуммаКлиент   = 0;
	//			СтрокаР.СуммаМенеджер = -Разница;
	//			СтрокаР.СуммаБрокер   = 0;//СтрокаБСО.ИтогСтраховаяПремия;
	//			СтрокаР.СуммаБрокерВС = 0;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//		
	//	Если СтрокаБСО.ИтогПредоставленнаяСкидка <> 0  Тогда
	//		СтрокаР = ТаблицаРасчетов.Добавить();
	//		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ;
	//		СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
	//		СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
	//		СтрокаР.СуммаКлиент   = - СтрокаБСО.ИтогПредоставленнаяСкидка;
	//		СтрокаР.СуммаМенеджер = 0;
	//		СтрокаР.СуммаБрокер   = 0;
	//		СтрокаР.СуммаБрокерВС = 0;
	//	КонецЕсли;
	//КонецЦикла;
	//врМотивация = Мотивация.Выгрузить();
	//врМотивация.Свернуть("ВидМотивации","ЧастьМенеджера,ЧастьБрокера,ЧастьКлиента");
	//Для каждого СтрокаМотивации  из  врМотивация Цикл
	//	Если СтрокаМотивации.ЧастьКлиента<>0 Тогда
	//		СтрокаР = ТаблицаРасчетов.Добавить();
	//		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтКлиентаЗаВыезд;
	//		СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
	//		СтрокаР.СуммаКлиент   = СтрокаМотивации.ЧастьКлиента;
	//		СтрокаР.СуммаМенеджер = 0;
	//		СтрокаР.СуммаБрокер   = 0;
	//		СтрокаР.СуммаБрокерВС = 0;
	//		СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
	//	КонецЕсли;
	//	Если СтрокаМотивации.ЧастьБрокера<>0 Тогда
	//		СтрокаР = ТаблицаРасчетов.Добавить();
	//		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтБрокераЗаВыезд;
	//		СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
	//		СтрокаР.СуммаКлиент   = 0;
	//		СтрокаР.СуммаМенеджер = 0;
	//		СтрокаР.СуммаБрокер   = 0;
	//		СтрокаР.СуммаБрокерВС = СтрокаМотивации.ЧастьБрокера;
	//		СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
	//	КонецЕсли;
	//	Если СтрокаМотивации.ЧастьМенеджера<>0 Тогда
	//		СтрокаР = ТаблицаРасчетов.Добавить();
	//		СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтМенеджераЗаВыезд;
	//		СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
	//		СтрокаР.СуммаКлиент   = 0;
	//		СтрокаР.СуммаМенеджер = СтрокаМотивации.ЧастьМенеджера;
	//		СтрокаР.СуммаБрокер   = 0;
	//		СтрокаР.СуммаБрокерВС = 0;
	//		СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
	//	КонецЕсли;
	//КонецЦикла;	
	
	
	Возврат ТаблицаРасчетов;
	
	
КонецФункции	

Процедура ОбработкаУдаленияПроведения(Отказ)
	УстановитьПривилегированныйРежим(Истина);
КонецПроцедуры
//--Расчеты
//

//из формы
лАктуальныйПериод = '00010101000000';
мВалютаРегл = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
РасчетПоАВ = Ложь;
лАгентВнешний = Ложь;
//
ЭтоПереустановкаЗПКрупнойСделки = Ложь;
//
лАктуальныйПериод = ?(Не ЗначениеЗаполнено(Дата), ТекущаяДата(), Дата);
лРазрешеноРедактирование = ЛОЖЬ;
//#Если Клиент Тогда
ТЗИзменений = уб_РасчетыСМенеджерами.ТЗИзмененийРеквизитов();
//#Иначе
//TODO
//#КонецЕсли
СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;