
Функция ПустаяСтрокаЗВС(СтрокаТЧ) Экспорт

	Возврат СтрокаТЧ <> Неопределено
	И СтрокаТЧ.СК.Пустая()
	И СтрокаТЧ.ВидСП.Пустая() 
	И Не ЗначениеЗаполнено(СтрокаТЧ.ВидБСО)
	И СтрокаТЧ.ЛимитОтветственности 		= 0
	И СтрокаТЧ.Основной 					= Ложь
	И СтрокаТЧ.ПредоставленнаяСкидка 		= 0
	И СтрокаТЧ.ПредоставленнаяСкидкаПроцент = 0
	И СтрокаТЧ.СтраховаяПремия				= 0

КонецФункции // ПустаяСтрока()

Функция ТипВыездаОтделаБСО(Параметр) Экспорт

	Возврат Ложь;

КонецФункции // ТипВыездаОтделаБСО()

//заявка ссылка или объект
Функция НетБСОПоЗаявке(Заявка) Экспорт

	НетБСО = Истина;
	ТекЗаявка = Заявка;
	Пока Не ТекЗаявка.Ссылка.Пустая() Цикл
		Если ТекЗаявка.НетБСО и ЗначениеЗаполнено(ТекЗаявка.СозданНаОсновании) Тогда
			ТекЗаявка = ТекЗаявка.СозданНаОсновании;
		Иначе
			НетБСО = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат НетБСО;
	
КонецФункции

Функция ТребуетсяПроверка(Источник, СтруктураРезультат = Неопределено) Экспорт

	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИспытательныйСрок", Ложь);
	СтруктураРезультат.Вставить("ТребуетсяПроверкаРуководителем", Источник.ТребуетсяПроверкаРуководителем и ЗначениеЗаполнено(Источник.УтвердилРуководитель)=ЛОЖЬ);
	СтруктураРезультат.Вставить("ТребуетсяУтверждениеАндеррайтера", Источник.ТребуетсяУтверждениеАндеррайтера и ЗначениеЗаполнено(Источник.УтвердилАндеррайтер)=ЛОЖЬ);
	Возврат СтруктураРезультат.ТребуетсяПроверкаРуководителем=Истина или СтруктураРезультат.ТребуетсяУтверждениеАндеррайтера = Истина;
	//Есть риск неактуальности, 
	//но уходим от разных текстов запросов/проверок в разных местах
	//Обработчик проверки должен быть в одном месте (сейчас в форме заявки)
	//Отказ = Ложь;
	//Запрос = Новый Запрос;
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	Источник.ТребуетсяПроверкаРуководителем,
	//|	Источник.Менеджер,
	//|	Источник.Тип
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	&Источник КАК Источник
	//|ГДЕ
	//|	&УсловиеГде
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА НЕ ВТ.ТребуетсяПроверкаРуководителем
	//|				ИЛИ ВТ.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
	//|				ИЛИ НЕ ВЗ.ИспытательныйСрок
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ТребуетсяПроверкаРуководителем,
	//|	ВЗ.ИспытательныйСрок КАК ИспытательныйСрок
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ФЛ.Ссылка КАК Ссылка,
	//|			ФЛ.ИспытательныйСрок КАК ИспытательныйСрок
	//|		ИЗ
	//|			Справочник.ФизическиеЛица КАК ФЛ) КАК ВЗ
	//|		ПО ВТ.Менеджер = ВЗ.Ссылка";
	//ТипЗнчИсточник = ТипЗнч(Источник);
	//Если ТипЗнчИсточник = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
	//	ТекстЗапроса 	= СтрЗаменить(ТекстЗапроса, "&Источник", "Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста");
	//	УсловиеГде		= "Источник.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка", Источник);
	//ИначеЕсли ТипЗнчИсточник = Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
	//	ТЗ = Новый ТаблицаЗначений;
	//	ТЗ.Колонки.Добавить("Менеджер", 						уб_temp.СозданиеОписанияТиповПоТипу(Тип("СправочникСсылка.ФизическиеЛица")));
	//	ТЗ.Колонки.Добавить("Тип",								уб_temp.СозданиеОписанияТиповПоТипу(Тип("ПеречислениеСсылка.уб_ТипВыезда")));
	//	ТЗ.Колонки.Добавить("ТребуетсяПроверкаРуководителем",   Новый ОписаниеТипов("Булево"));
	//	СтрокаТЗ = ТЗ.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаТЗ, Источник);
	//	Запрос.УстановитьПараметр("Источник", ТЗ);
	//	УсловиеГде = "ИСТИНА";
	//ИначеЕсли ТипЗнчИсточник = Тип("ТаблицаЗначений") Тогда
	//	Запрос.УстановитьПараметр("Источник", Источник);
	//	УсловиеГде = "ИСТИНА";
	//Иначе
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Некорректный тип параметра функции модуля менеджера заявки ТребуетсяПроверка(), тип значения Источник: " + ТипЗнчИсточник, "НеСообщать", Истина);
	//	Отказ = Истина;
	//КонецЕсли;
	//Если Не Отказ Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
	//	Запрос.Текст = ТекстЗапроса;
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если Не РезультатЗапроса.Пустой() Тогда
	//		Выборка = РезультатЗапроса.Выбрать();
	//		Выборка.Следующий();
	//		ЗаполнитьЗначенияСвойств(СтруктураРезультат, Выборка);
	//		Возврат Выборка.ТребуетсяПроверкаРуководителем;
	//	Иначе
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;

КонецФункции // ТребуетсяПроверка()

Функция СоответствиеВидовДокументовИмениПоля() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.уб_ВидыДокументовКПолисам.РасчетныйЛист, 	"Расчетчик");
	Соответствие.Вставить(Справочники.уб_ВидыДокументовКПолисам.ДопСоглашение, 	"ДопСоглашение");
	Соответствие.Вставить(Справочники.уб_ВидыДокументовКПолисам.Прочее,			"ДругиеДокументы");
	Возврат Соответствие

КонецФункции // СоответствиеВидовДокументовИмениПоля()


Функция ПолучитьСтрокуПоУИД(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УИД",УИД);
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.*
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |ГДЕ
	               |уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки = &УИД";
	Результат = Запрос.Выполнить();			   
	Выборка = Результат.Выбрать();			   
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
		Для каждого Колонка Из Результат.Колонки Цикл
			Структура.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		Если ЗначениеЗаполнено(Структура.ОбъектСтрахования) = Ложь Тогда
			Структура.Вставить("ОбъектСтрахования", Обработки.ЗагрузкаПолисовИзB2B.НайтиПростойОбъектСтрахования(Строка(Выборка.ВидБСО),Строка(Выборка.ВидБСО)));
		КонецЕсли;		
		Возврат Структура;
	Иначе
		Возврат Новый Структура;	
	КонецЕсли;
КонецФункции


Функция ВКОтСтатусаИКоличества(Знач Заявка = Неопределено,Период, Вариант = 1) Экспорт
	Запрос = Новый Запрос;
	Если Заявка = Неопределено Тогда
		Запрос.УстановитьПараметр("Заявка",Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка());
		Запрос.УстановитьПараметр("Курьер",Справочники.ФизическиеЛица.ПустаяСсылка());
	Иначе                                                                           		
		Запрос.УстановитьПараметр("Заявка",Заявка.Ссылка);
		Запрос.УстановитьПараметр("Курьер",Заявка.Курьер);
		Если Вариант = 1 и (Заявка.Курьер =  Справочники.ФизическиеЛица.ПустаяСсылка()
			или Заявка.Курьер =  Справочники.ФизическиеЛица.ПустойАгент)
			Тогда
			//нет смысла считать для пустого курьера
			Возврат 0;
		Иначе
			//
		КонецЕсли	
	КонецЕсли;	
	
	Нач = НачалоМесяца(Период);
	Запрос.УстановитьПараметр("ДатаНач",Нач);
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	
	
	
	
	Запрос.УстановитьПараметр("ПросчитыватьСУчетомНепроведенных", Истина);
	Запрос.УстановитьПараметр("ПросчитыватьСУчетомНеподтвержденных", Истина);
	Запрос.УстановитьПараметр("СчитатьВнешних", Ложь);
	Если Нач = Дата(2017,1,1) Тогда
		Запрос.УстановитьПараметр("План250", 75);
		Запрос.УстановитьПараметр("План200", 49);	
	Иначе
		Запрос.УстановитьПараметр("План250", 100);
		Запрос.УстановитьПараметр("План200", 65);	
	КонецЕсли;
	
	
	Запрос.Текст = ТекстЗапросаВК(,ЛОЖЬ) + ДопЗапрос();
	Результаты = Запрос.ВыполнитьПакет();
	Если Вариант = 1 Тогда
		Результат = Результаты[Результаты.Количество()-1].Выгрузить();
		Вк  = Результат.Итог("ВК")+Результат.Итог("ВКБезДенег");
		Возврат ВК;
	Иначе
	  Возврат Результаты[Результаты.Количество()-2].Выгрузить();	
	КонецЕсли;
	
КонецФункции

Функция ТекстЗапросаВК(Дата = Неопределено,Наличный=Истина) экспорт
	Если Дата = Неопределено  или Дата >=Дата(2020,7,1) Тогда
	Иначе
		Возврат ТекстЗапросаВКДо072020();
	КонецЕсли;	
	  
	Если Наличный Тогда
		ТекстНаличный = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Полисы.Заявка,
		|	СУММА(уб_ПриемкаОплатПлатежи.Сумма) КАК Сумма,
		|	Полисы.Заявка.ИтогСуммаВзноса
		|ПОМЕСТИТЬ ЗаявкиНаличные
		|ИЗ
		|	Документ.уб_ПриемкаОплат.Полисы КАК Полисы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
		|		ПО Полисы.Ссылка = уб_ПриемкаОплатПлатежи.Ссылка
		|			И (Полисы.НомерСтроки = 1)
		|			И (уб_ПриемкаОплатПлатежи.Ссылка.ОтчетКассира.Подтверждено)
		|			И (уб_ПриемкаОплатПлатежи.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса))
		|ГДЕ
		|	Полисы.Заявка.Дата > &ДатаНач
		|	И Полисы.Заявка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Терминал)
		|
		|СГРУППИРОВАТЬ ПО
		|	Полисы.Заявка,
		|	Полисы.Заявка.ИтогСуммаВзноса
		|
		|ИМЕЮЩИЕ
		|	СУММА(уб_ПриемкаОплатПлатежи.Сумма) > Полисы.Заявка.ИтогСуммаВзноса * 0.8
		|;"
	Иначе
		ТекстНаличный = "	Выбрать Неопределено как Заявка, 0 как Сумма,0 как ИтогСуммаВзноса поместить ЗаявкиНаличные 
		|;"
	КонецЕсли;
		 Возврат ТекстНаличный +
	         
	         "
			 |ВЫБРАТЬ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор КАК Оператор,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВознаграждениеКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЗаблокироватьАвторасчет,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТипВыезда,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Каско > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Каско,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Осаго > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Осаго,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДМС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДМС,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.НС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК НС,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплачиваемыйОсмотр,
			 |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.НеобходимостьОсмотра,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС,
	         |	ЕСТЬNULL(ПодразделенияОрганизаций.ТипПодразделения, ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВС)) КАК ТипПодразделения
	         |ПОМЕСТИТЬ Заявки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	         |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС = ПодразделенияОрганизаций.Ссылка
	         |ГДЕ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления = ЛОЖЬ
	         |	И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено
	         |			ИЛИ &ПросчитыватьСУчетомНеподтвержденных = ИСТИНА)
	         |	И ВЫБОР
	         |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |				ТОГДА ИСТИНА
			 //|			ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			 //|					И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
			 |Иначе уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер = &Курьер
	         |		КОНЕЦ
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка КАК Ссылка,
	         |	БСОЗаявок.Ссылка.ФайловБланкиПлан КАК ФайловБланкиПлан,
	         |	БСОЗаявок.Ссылка.ФайловБланкиФакт КАК ФайловБланкиФакт,
	         |	0 КАК ЗаполнениеОператором,
	         |	ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка) КАК Оператор,
	         |	0 КАК ВознаграждениеОператора,
	         |	""Общее"" КАК УИД
	         |ПОМЕСТИТЬ СтрокиЗаявок
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка,
	         |	0,
	         |	0,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		ИНАЧЕ БСОЗаявок.Количество
	         |	КОНЕЦ,
	         |	БСОЗаявок.Оператор,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		КОГДА БСОЗаявок.Оператор = БСОЗаявок.Ссылка.Курьер
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ,
	         |	БСОЗаявок.УидСтроки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |	И НЕ БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	        // |	И БСОЗаявок.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	         |ПОМЕСТИТЬ Статусы
	         |ИЗ
	         |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(
	         |			,
	         |			Заявка В
	         |				(ВЫБРАТЬ
	         |					Заявки.Ссылка
	         |				ИЗ
	         |					Заявки)) КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Заявки.Ссылка КАК Ссылка,
	         |	Статусы.Статус,
	         |	ВЫБОР
	|	КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	|			ИЛИ Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира)
	|			или Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	|		ТОГДА ВЫБОР
	|				КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА (Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Страховка)
	|									ИЛИ Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	|									И (Заявки.Каско
	|										ИЛИ Заявки.Осаго)
	|								ТОГДА ИСТИНА
	|							КОГДА //Заявки.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр)) и
	|									&ДатаНач >= ДАТАВРЕМЯ(2023, 6, 1)
	|									И Заявки.ТипВыезда = 0
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	//КОГДА Заявки.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	|	//		И &ДатаНач >= ДАТАВРЕМЯ(2023, 6, 1)
	|	//		И Статусы.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	|	//	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Административный,
	         |	Заявки.Курьер,
	         |	Заявки.Менеджер,
	         |	Заявки.Оператор,
	         |	Заявки.Утверждено,
	         |	Заявки.Проведен,
	         |	Заявки.ОплатитьВКассуЗаВыездКурьера,
	         |	Заявки.ВознаграждениеКурьера,
	         |	Заявки.Дата,
	         |	Заявки.ЗаблокироватьАвторасчет,
	         |	Заявки.Самовыезд,
	         |	Заявки.Тип,
	         |	Заявки.Каско КАК Каско,
	         |	Заявки.Осаго КАК Осаго,
	         |	Заявки.ДМС КАК ДМС,
	         |	Заявки.НС КАК НС,
	         |	Заявки.ОплачиваемыйОсмотр,
			 |	Заявки.НеобходимостьОсмотра,
	         |	Заявки.СВС,
	         |	Заявки.ТипПодразделения
	         |ПОМЕСТИТЬ ЗаявкиСоСтатусами
	         |ИЗ
	         |	Заявки КАК Заявки
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	         |		ПО Заявки.Ссылка = Статусы.Заявка
	         |ГДЕ
	         |	НЕ ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ЗаявкиСоСтатусами.Курьер,
	         |	ЗаявкиСоСтатусами.Ссылка,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)
	         |				И НЕ &СчитатьВнешних
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |						ТОГДА 0
			 |       КОГДА &ДатаНач >= ДАТАВРЕМЯ(2026, 3, 1) и (ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр)) или ЗаявкиСоСтатусами.НеобходимостьОсмотра в (Значение(Перечисление.НеобходимостьОсмотра.НашОсмотр),Значение(Перечисление.НеобходимостьОсмотра.НашПереосмотр)))
			 |			Тогда 500
			 |      КОГДА &ДатаНач >= ДАТАВРЕМЯ(2023, 12, 1)	
			 |			Тогда 350
	         |					КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |						ТОГДА ВЫБОР
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= 0
	         |										И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |									ТОГДА 300
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 75
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 5, 1)
			 |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2023, 1, 1)
	         |											ТОГДА 85
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
	         |											ТОГДА 90
	         |										ИНАЧЕ 100
	         |									КОНЕЦ
	         |									ТОГДА ВЫБОР
	         |											КОГДА ЗаявкиСоСтатусами.Дата <= ДАТАВРЕМЯ(2022, 1, 16)
	         |												ТОГДА 250
	         |											ИНАЧЕ 350
	         |										КОНЕЦ
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 49
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 5, 1)
			 |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2023, 1, 1)
	         |											ТОГДА 55
	         |										ИНАЧЕ 65
	         |									КОНЕЦ
	         |									ТОГДА ВЫБОР
	         |											КОГДА ЗаявкиСоСтатусами.Дата <= ДАТАВРЕМЯ(2022, 1, 16)
	         |												ТОГДА 200
	         |											ИНАЧЕ 300
	         |										КОНЕЦ
	         |								ИНАЧЕ ВЫБОР
	         |										КОГДА ЗаявкиСоСтатусами.Дата <= ДАТАВРЕМЯ(2022, 1, 16)
	         |											ТОГДА 150
	         |										ИНАЧЕ 250
	         |									КОНЕЦ
	         |							КОНЕЦ
	         |					ИНАЧЕ ВЫБОР
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 75
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 5, 1)
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2023, 1, 1)
	         |										ТОГДА 85
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |										ТОГДА 90
	         |									ИНАЧЕ 100
	         |								КОНЕЦ
	         |								ТОГДА 250
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 49
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |										ТОГДА 55
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2022, 5, 1)
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2023, 1, 1)
	         |										ТОГДА 55
	         |									ИНАЧЕ 65
	         |								КОНЕЦ
	         |								ТОГДА 200
	         |							ИНАЧЕ 150
	         |						КОНЕЦ
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)
	         |				И НЕ &СчитатьВнешних
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Административный
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
			 |       КОГДА &ДатаНач >= ДАТАВРЕМЯ(2026, 3, 1) и (ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр)) или ЗаявкиСоСтатусами.НеобходимостьОсмотра в (Значение(Перечисление.НеобходимостьОсмотра.НашОсмотр),Значение(Перечисление.НеобходимостьОсмотра.НашПереосмотр)))
			 |			Тогда 500
			 |      КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр),ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум))	
			 |         и (&ДатаНач >= ДАТАВРЕМЯ(2023, 12, 1)) 
			 |          Тогда 350
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
			 |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				//И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2023, 6, 1)
	         |			ТОГДА 250
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум))
	         |				И &ДатаНач > ДАТАВРЕМЯ(2020, 6, 1)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					ИЛИ ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					ИЛИ ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.НС = ЛОЖЬ
	         |					И ЗаявкиСоСтатусами.ДМС = ЛОЖЬ)
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.НС = ЛОЖЬ
	         |					И ЗаявкиСоСтатусами.ДМС = ЛОЖЬ)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2021, 1, 1)
	         |				И (ЗаявкиСоСтатусами.НС = ИСТИНА
	         |					ИЛИ ЗаявкиСоСтатусами.ДМС = ИСТИНА)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Административный = ЛОЖЬ
	         |							И (ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |								ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |								ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира) и ЗаявкиСоСтатусами.Ссылка.ТипВыезда = 1 )
	         |						ТОГДА ИСТИНА
	         |					ИНАЧЕ ЛОЖЬ
	         |				КОНЕЦ
	         |		ИНАЧЕ ЗаявкиСоСтатусами.ДенежныйВыезд
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов
	         |		ИНАЧЕ КоличествоВыездов.ДенежныхВыездов
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 0
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	ЗаявкиСоСтатусами.Статус,
	         |	ЗаявкиСоСтатусами.Менеджер,
	         |	ЗаявкиСоСтатусами.Оператор,
	         |	ЗаявкиСоСтатусами.Утверждено,
	         |	ЗаявкиСоСтатусами.Проведен,
	         |	ЗаявкиСоСтатусами.ОплатитьВКассуЗаВыездКурьера,
	         |	ЗаявкиСоСтатусами.ВознаграждениеКурьера,
	         |	ЗаявкиСоСтатусами.Дата,
	         |	ЗаявкиСоСтатусами.ЗаблокироватьАвторасчет
	         |ПОМЕСТИТЬ РасчетВКПоЗаявке
	         |ИЗ
	         |	ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК ДенежныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.ДенежныйВыезд = ИСТИНА
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоВыездов.Курьер
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК НеАдминистративныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.Административный = ЛОЖЬ
	         |			И (ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
			 |	                ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира)
	         |					ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоНеАдминистративныхВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоНеАдминистративныхВыездов.Курьер
	         |ГДЕ
	         |	(&Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |			ИЛИ ЗаявкиСоСтатусами.Ссылка = &Заявка)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	РасчетВКПоЗаявке.Менеджер,
	         |	РасчетВКПоЗаявке.Оператор,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Менеджер
	         |	КОНЕЦ КАК ИсточникФинансирования,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Курьер
	         |	КОНЕЦ КАК Сотрудник,
	         |	РасчетВКПоЗаявке.Ссылка,
	         |	РасчетВКПоЗаявке.Дата,
	         |	НАЧАЛОПЕРИОДА(РасчетВКПоЗаявке.Дата, МЕСЯЦ) КАК Период,
	         |	РасчетВКПоЗаявке.ВК,
	         |	РасчетВКПоЗаявке.ВКБезДенег,
	         |	РасчетВКПоЗаявке.ДенежныйВыезд,
	         |	РасчетВКПоЗаявке.ДенежныхВыездов,
	         |	РасчетВКПоЗаявке.БезДенежныхВыездов,
	         |	РасчетВКПоЗаявке.ПрочихВыездов,
	         |	РасчетВКПоЗаявке.Статус,
	         |	РасчетВКПоЗаявке.Утверждено КАК Подтверждена,
	         |	РасчетВКПоЗаявке.Проведен КАК Проведена,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА ВЫБОР
	         |					КОГДА РасчетВКПоЗаявке.Дата < ДАТАВРЕМЯ(2016, 8, 1)
	         |							ИЛИ РасчетВКПоЗаявке.ЗаблокироватьАвторасчет = ИСТИНА
	         |						ТОГДА РасчетВКПоЗаявке.ВознаграждениеКурьера
	         |					ИНАЧЕ РасчетВКПоЗаявке.ВК + РасчетВКПоЗаявке.ВКБезДенег
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА РасчетВКПоЗаявке.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера
	         |ПОМЕСТИТЬ ПредРасчет
	         |ИЗ
	         |	РасчетВКПоЗаявке КАК РасчетВКПоЗаявке
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	СтрокиЗаявок.Оператор,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка КАК Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВК
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВКБезДенег
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныйВыезд
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.БезДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ПрочихВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВознаграждениеКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК Заявок,
	         |	ВЫБОР
	         |		КОГДА Предрасчет.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
	         |			ТОГДА СтрокиЗаявок.ВознаграждениеОператора
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеОператора,
	         |	СтрокиЗаявок.ЗаполнениеОператором КАК ЗаполнениеОператором,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование,
	         |	ВЫБОР
	         |		КОГДА уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Операторы БД""
	         |			ТОГДА 0
	         |		ИНАЧЕ СтрокиЗаявок.Оператор.Наименование
	         |	КОНЕЦ КАК Сортировка,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Общая,
	         |	СтрокиЗаявок.ФайловБланкиПлан,
	         |	СтрокиЗаявок.ФайловБланкиФакт
	         |ПОМЕСТИТЬ ПредРасчет11
	         |ИЗ
	         |	ПредРасчет КАК Предрасчет
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаявок КАК СтрокиЗаявок
	         |		ПО Предрасчет.Ссылка = СтрокиЗаявок.Ссылка
	         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	         |		ПО (СтрокиЗаявок.Оператор = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	Предрасчет.ВК,
	         |	Предрасчет.ВКБезДенег,
	         |	Предрасчет.ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА Предрасчет.ДенежныйВыезд = ИСТИНА
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК КолДенежных,
	         |	Предрасчет.ДенежныхВыездов,
	         |	Предрасчет.БезДенежныхВыездов,
	         |	Предрасчет.ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	Предрасчет.ВознаграждениеКурьера,
	         |	Предрасчет.ВознаграждениеОператора,
	         |	Предрасчет.Оператор,
	         |	Предрасчет.ОплатитьВКассуЗаВыездКурьера,
	         |	Предрасчет.Общая,
	         |	Предрасчет.ФайловБланкиПлан,
	         |	Предрасчет.ФайловБланкиФакт,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиНаличные.Заявка ЕСТЬ NULL 
	         |				ИЛИ Предрасчет.Дата < ДАТАВРЕМЯ(2022, 1, 16)
	         |			ТОГДА 0
	         |		ИНАЧЕ 50
	         |	КОНЕЦ КАК Бонус
	         |ПОМЕСТИТЬ ПредРасчет2
	         |ИЗ
	         |	ПредРасчет11 КАК Предрасчет
	         |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаличные КАК ЗаявкиНаличные
	         |		ПО (ЗаявкиНаличные.Заявка = Предрасчет.Ссылка)
	         |			И (Предрасчет.Общая = ИСТИНА)";
	
КонецФункции


Функция ТекстЗапросаВКДо2022(Дата = Неопределено) экспорт
	Если Дата = Неопределено  или Дата >=Дата(2020,7,1) Тогда
	Иначе
		Возврат ТекстЗапросаВКДо072020();
	КонецЕсли;	
	Возврат  "ВЫБРАТЬ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор КАК Оператор,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВознаграждениеКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЗаблокироватьАвторасчет,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Каско > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Каско,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Осаго > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Осаго,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДМС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДМС,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.НС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК НС,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплачиваемыйОсмотр,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС,
	         |	ЕСТЬNULL(ПодразделенияОрганизаций.ТипПодразделения, ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВС)) КАК ТипПодразделения
	         |ПОМЕСТИТЬ Заявки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	         |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС = ПодразделенияОрганизаций.Ссылка
	         |ГДЕ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления = ЛОЖЬ
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено
	         |	И ВЫБОР
	         |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |				ТОГДА ИСТИНА
	         |			ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |					И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		КОНЕЦ
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка КАК Ссылка,
	         |	0 КАК ЗаполнениеОператором,
	         |	ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка) КАК Оператор,
	         |	0 КАК ВознаграждениеОператора,
	         |	""Общее"" КАК УИД
	         |ПОМЕСТИТЬ СтрокиЗаявок
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		ИНАЧЕ БСОЗаявок.Количество
	         |	КОНЕЦ,
	         |	БСОЗаявок.Оператор,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		КОГДА БСОЗаявок.Оператор = БСОЗаявок.Ссылка.Курьер
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ,
	         |	БСОЗаявок.УидСтроки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |	И НЕ БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |	И БСОЗаявок.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	         |ПОМЕСТИТЬ Статусы
	         |ИЗ
	         |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(
	         |			,
	         |			Заявка В
	         |				(ВЫБРАТЬ
	         |					Заявки.Ссылка
	         |				ИЗ
	         |					Заявки)) КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Заявки.Ссылка КАК Ссылка,
	         |	Статусы.Статус,
	         |	ВЫБОР
	         |		КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |			ТОГДА ВЫБОР
	         |					КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |						ТОГДА ВЫБОР
	         |								КОГДА (Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Страховка)
	         |										ИЛИ Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	         |										И (Заявки.Каско
	         |											ИЛИ Заявки.Осаго)
	         |									ТОГДА ИСТИНА
	         |								ИНАЧЕ ЛОЖЬ
	         |							КОНЕЦ
	         |					ИНАЧЕ ИСТИНА
	         |				КОНЕЦ
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Административный,
	         |	Заявки.Курьер,
	         |	Заявки.Менеджер,
	         |	Заявки.Оператор,
	         |	Заявки.Утверждено,
	         |	Заявки.Проведен,
	         |	Заявки.ОплатитьВКассуЗаВыездКурьера,
	         |	Заявки.ВознаграждениеКурьера,
	         |	Заявки.Дата,
	         |	Заявки.ЗаблокироватьАвторасчет,
	         |	Заявки.Самовыезд,
	         |	Заявки.Тип,
	         |	Заявки.Каско КАК Каско,
	         |	Заявки.Осаго КАК Осаго,
	         |	Заявки.ДМС КАК ДМС,
	         |	Заявки.НС КАК НС,
	         |	Заявки.ОплачиваемыйОсмотр,
	         |	Заявки.СВС,
	         |	Заявки.ТипПодразделения
	         |ПОМЕСТИТЬ ЗаявкиСоСтатусами
	         |ИЗ
	         |	Заявки КАК Заявки
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	         |		ПО Заявки.Ссылка = Статусы.Заявка
	         |ГДЕ
	         |	НЕ ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ЗаявкиСоСтатусами.Курьер,
	         |	ЗаявкиСоСтатусами.Ссылка,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)
	         //|				И НЕ &СчитатьВнешних
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |						ТОГДА 0
	         |					КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |						ТОГДА ВЫБОР
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= 0
	         |										И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |									ТОГДА 300
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 75
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
			 |                                              ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
			 |                                              ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |											ТОГДА 85
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1) 
	         |											ТОГДА 90
	         |										ИНАЧЕ 100
	         |									КОНЕЦ
	         |									ТОГДА 250
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 49
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |												ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1) 
			 |                                              ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
			 |                                              ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)
	         |											ТОГДА 55
	         |										ИНАЧЕ 65
	         |									КОНЕЦ
	         |									ТОГДА 200
	         |								ИНАЧЕ 150
	         |							КОНЕЦ
	         |					ИНАЧЕ ВЫБОР
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 75
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1) 
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)	         
			 |										ТОГДА 85
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |										ТОГДА 90
	         |									ИНАЧЕ 100
	         |								КОНЕЦ
	         |								ТОГДА 250
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 49
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |										ТОГДА 55
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)
	         |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1) 
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 1, 1)
			 |											ИЛИ &ДатаНач = ДАТАВРЕМЯ(2021, 5, 1)	         
	         |										ТОГДА 55
	         |									ИНАЧЕ 65
	         |								КОНЕЦ
	         |								ТОГДА 200
	         |							ИНАЧЕ 150
	         |						КОНЕЦ
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)
	         //|				И НЕ &СчитатьВнешних
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Административный
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум))
	         |				И &ДатаНач > ДАТАВРЕМЯ(2020, 6, 1)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					ИЛИ ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					ИЛИ ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 100
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.НС = ЛОЖЬ
	         |					И ЗаявкиСоСтатусами.ДМС = ЛОЖЬ)
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.НС = ЛОЖЬ
	         |					И ЗаявкиСоСтатусами.ДМС = ЛОЖЬ)
	         |			ТОГДА 100
			 |КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
			 |	И &ДатаНач >= ДАТАВРЕМЯ(2021, 1, 1)
			 |	И (ЗаявкиСоСтатусами.НС = Истина
			 |			ИЛИ ЗаявкиСоСтатусами.ДМС = Истина)
			|   ТОГДА 100		
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1)
	         |					ИЛИ &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Административный = ЛОЖЬ
	         |							И (ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |								ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	         |						ТОГДА ИСТИНА
	         |					ИНАЧЕ ЛОЖЬ
	         |				КОНЕЦ
	         |		ИНАЧЕ ЗаявкиСоСтатусами.ДенежныйВыезд
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов
	         |		ИНАЧЕ КоличествоВыездов.ДенежныхВыездов
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 0
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	ЗаявкиСоСтатусами.Статус,
	         |	ЗаявкиСоСтатусами.Менеджер,
	         |	ЗаявкиСоСтатусами.Оператор,
	         |	ЗаявкиСоСтатусами.Утверждено,
	         |	ЗаявкиСоСтатусами.Проведен,
	         |	ЗаявкиСоСтатусами.ОплатитьВКассуЗаВыездКурьера,
	         |	ЗаявкиСоСтатусами.ВознаграждениеКурьера,
	         |	ЗаявкиСоСтатусами.Дата,
	         |	ЗаявкиСоСтатусами.ЗаблокироватьАвторасчет
	         |ПОМЕСТИТЬ РасчетВКПоЗаявке
	         |ИЗ
	         |	ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК ДенежныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.ДенежныйВыезд = ИСТИНА
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоВыездов.Курьер
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК НеАдминистративныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.Административный = ЛОЖЬ
	         |			И (ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |					ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоНеАдминистративныхВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоНеАдминистративныхВыездов.Курьер
	         |ГДЕ
	         |	(&Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |			ИЛИ ЗаявкиСоСтатусами.Ссылка = &Заявка)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	РасчетВКПоЗаявке.Менеджер,
	         |	РасчетВКПоЗаявке.Оператор,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Менеджер
	         |	КОНЕЦ КАК ИсточникФинансирования,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Курьер
	         |	КОНЕЦ КАК Сотрудник,
	         |	РасчетВКПоЗаявке.Ссылка,
	         |	РасчетВКПоЗаявке.Дата,
	         |	НАЧАЛОПЕРИОДА(РасчетВКПоЗаявке.Дата, МЕСЯЦ) КАК Период,
	         |	РасчетВКПоЗаявке.ВК,
	         |	РасчетВКПоЗаявке.ВКБезДенег,
	         |	РасчетВКПоЗаявке.ДенежныйВыезд,
	         |	РасчетВКПоЗаявке.ДенежныхВыездов,
	         |	РасчетВКПоЗаявке.БезДенежныхВыездов,
	         |	РасчетВКПоЗаявке.ПрочихВыездов,
	         |	РасчетВКПоЗаявке.Статус,
	         |	РасчетВКПоЗаявке.Утверждено КАК Подтверждена,
	         |	РасчетВКПоЗаявке.Проведен КАК Проведена,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА ВЫБОР
	         |					КОГДА РасчетВКПоЗаявке.Дата < ДАТАВРЕМЯ(2016, 8, 1)
	         |							ИЛИ РасчетВКПоЗаявке.ЗаблокироватьАвторасчет = ИСТИНА
	         |						ТОГДА РасчетВКПоЗаявке.ВознаграждениеКурьера
	         |					ИНАЧЕ РасчетВКПоЗаявке.ВК + РасчетВКПоЗаявке.ВКБезДенег
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА РасчетВКПоЗаявке.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера
	         |ПОМЕСТИТЬ ПредРасчет
	         |ИЗ
	         |	РасчетВКПоЗаявке КАК РасчетВКПоЗаявке
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	СтрокиЗаявок.Оператор,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка КАК Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВК
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВКБезДенег
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныйВыезд
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.БезДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ПрочихВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВознаграждениеКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК Заявок,
	         |	ВЫБОР
	         |		КОГДА Предрасчет.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
	         |			ТОГДА СтрокиЗаявок.ВознаграждениеОператора
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеОператора,
	         |	СтрокиЗаявок.ЗаполнениеОператором КАК ЗаполнениеОператором,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование,
	         |	ВЫБОР
	         |		КОГДА уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Операторы БД""
	         |				ИЛИ уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Отдел сопровождения договоров страхования""
	         |			ТОГДА 0
	         |		ИНАЧЕ СтрокиЗаявок.Оператор.Наименование
	         |	КОНЕЦ КАК Сортировка, 0 как Бонус
	         |ПОМЕСТИТЬ ПредРасчет2
	         |ИЗ
	         |	ПредРасчет КАК Предрасчет
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаявок КАК СтрокиЗаявок
	         |		ПО Предрасчет.Ссылка = СтрокиЗаявок.Ссылка
	         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	         |		ПО (СтрокиЗаявок.Оператор = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент)";
	
КонецФункции

Функция ТекстЗапросаВКДо072020() Экспорт
	Возврат  "ВЫБРАТЬ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор КАК Оператор,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВознаграждениеКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЗаблокироватьАвторасчет,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Каско > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Каско,
	         |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Осаго > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Осаго,
			 |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДМС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДМС,
			 |	ВЫБОР
	         |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.НС > 0
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК НС,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплачиваемыйОсмотр,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС,
	         |	ЕСТЬNULL(ПодразделенияОрганизаций.ТипПодразделения, ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВС)) КАК ТипПодразделения
	         |ПОМЕСТИТЬ Заявки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	         |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.СВС = ПодразделенияОрганизаций.Ссылка
	         |ГДЕ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления = ЛОЖЬ
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено
	         |	И ВЫБОР
	         |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |				ТОГДА ИСТИНА
	         |			ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |					И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		КОНЕЦ
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка КАК Ссылка,
	         |	0 КАК ЗаполнениеОператором,
	         |	ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка) КАК Оператор,
	         |	0 КАК ВознаграждениеОператора,
	         |	""Общее"" КАК УИД
	         |ПОМЕСТИТЬ СтрокиЗаявок
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		ИНАЧЕ БСОЗаявок.Количество
	         |	КОНЕЦ,
	         |	БСОЗаявок.Оператор,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		КОГДА БСОЗаявок.Оператор = БСОЗаявок.Ссылка.Курьер
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ,
	         |	БСОЗаявок.УидСтроки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |	И НЕ БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |	И БСОЗаявок.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	         |ПОМЕСТИТЬ Статусы
	         |ИЗ
	         |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(
	         |			,
	         |			Заявка В
	         |				(ВЫБРАТЬ
	         |					Заявки.Ссылка
	         |				ИЗ
	         |					Заявки)) КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Заявки.Ссылка КАК Ссылка,
	         |	Статусы.Статус,
	         |	ВЫБОР
	         |		КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |			ТОГДА ВЫБОР
	         |					КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |						ТОГДА ВЫБОР
	         |								КОГДА (Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Страховка)
	         |										ИЛИ Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Пролонгация))
	         |										И (Заявки.Каско
	         |											ИЛИ Заявки.Осаго)
	         |									ТОГДА ИСТИНА
	         |								ИНАЧЕ ЛОЖЬ
	         |							КОНЕЦ
	         |					ИНАЧЕ ИСТИНА
	         |				КОНЕЦ
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК Административный,
	         |	Заявки.Курьер,
	         |	Заявки.Менеджер,
	         |	Заявки.Оператор,
	         |	Заявки.Утверждено,
	         |	Заявки.Проведен,
	         |	Заявки.ОплатитьВКассуЗаВыездКурьера,
	         |	Заявки.ВознаграждениеКурьера,
	         |	Заявки.Дата,
	         |	Заявки.ЗаблокироватьАвторасчет,
	         |	Заявки.Самовыезд,
	         |	Заявки.Тип,
	         |	Заявки.Каско КАК Каско,
	         |	Заявки.Осаго КАК Осаго,
			 |	Заявки.ДМС КАК ДМС,
	         |	Заявки.НС КАК НС,
	         |	Заявки.ОплачиваемыйОсмотр,
	         |	Заявки.СВС,
	         |	Заявки.ТипПодразделения
	         |ПОМЕСТИТЬ ЗаявкиСоСтатусами
	         |ИЗ
	         |	Заявки КАК Заявки
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	         |		ПО Заявки.Ссылка = Статусы.Заявка
	         |ГДЕ
	         |	НЕ ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ЗаявкиСоСтатусами.Курьер,
	         |	ЗаявкиСоСтатусами.Ссылка,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя) и &ДатаНач >= ДАТАВРЕМЯ(2025, 12, 1)
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |						ТОГДА 0
	         |					КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |						ТОГДА ВЫБОР
			 |                              КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >=0  и (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1)) Тогда 300
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 75
			 |                                      КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |											ТОГДА 85
			 |                                      КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ТОГДА 90
	         |										ИНАЧЕ 100
	         |									КОНЕЦ
	         |									ТОГДА 250
	         |								КОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов >= ВЫБОР
	         |										КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |											ТОГДА 49
			 |                                      КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)  или &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ТОГДА 55
	         |										ИНАЧЕ 65
	         |									КОНЕЦ
	         |									ТОГДА 200
	         |								ИНАЧЕ 150
	         |							КОНЕЦ
	         |					ИНАЧЕ ВЫБОР
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 75
			 |                                  КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1)  или &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1)
	         |											ТОГДА 85
			|                                  КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ТОГДА 90
	         |									ИНАЧЕ 100
	         |								КОНЕЦ
	         |								ТОГДА 250
	         |							КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |									КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |										ТОГДА 49
			 |                                  КОГДА &ДатаНач = ДАТАВРЕМЯ(2018, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2018, 5, 1)  или &ДатаНач = ДАТАВРЕМЯ(2019, 1, 1) или &ДатаНач = ДАТАВРЕМЯ(2019, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 1, 1)
	         |											ТОГДА 55
	         |									ИНАЧЕ 65
	         |								КОНЕЦ
	         |								ТОГДА 200
	         |							ИНАЧЕ 150
	         |						КОНЕЦ
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР КОГДА
			|	  	    ЗаявкиСоСтатусами.ТипПодразделения = Значение(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)и &ДатаНач >= ДАТАВРЕМЯ(2025, 12, 1)  Тогда 0
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Административный
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
			 |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				и (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1)) Тогда 300
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПервичныйОсмотр))
	         |				И ЗаявкиСоСтатусами.ОплачиваемыйОсмотр
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 100
			 |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
			 |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Переосмотр), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Аддендум), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись), ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Перепись))
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА 0
			 |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				и (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1)) 
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					Или ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 300
			 |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |				И &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |				И (ЗаявкиСоСтатусами.Каско
	         |					Или ЗаявкиСоСтатусами.Осаго)
	         |			ТОГДА 100
			 |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
			 |				и (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))
	         |				И (ЗаявкиСоСтатусами.НС=Ложь
	         |					И ЗаявкиСоСтатусами.ДМС=ложь)
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
			 |				И &ДатаНач >= ДАТАВРЕМЯ(2018, 9, 1)
	         |				И (ЗаявкиСоСтатусами.НС=Ложь
	         |					И ЗаявкиСоСтатусами.ДМС=ложь)
	         |			ТОГДА 100
			 |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана) и (&ДатаНач = ДАТАВРЕМЯ(2020, 4, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 5, 1) или &ДатаНач = ДАТАВРЕМЯ(2020, 6, 1))  
	         |			ТОГДА 300
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ЗаявкиСоСтатусами.ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА &ДатаНач >= ДАТАВРЕМЯ(2017, 4, 1)
	         |			ТОГДА КоличествоНеАдминистративныхВыездов.НеАдминистративныхВыездов
	         |		ИНАЧЕ КоличествоВыездов.ДенежныхВыездов
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 0
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	ЗаявкиСоСтатусами.Статус,
	         |	ЗаявкиСоСтатусами.Менеджер,
	         |	ЗаявкиСоСтатусами.Оператор,
	         |	ЗаявкиСоСтатусами.Утверждено,
	         |	ЗаявкиСоСтатусами.Проведен,
	         |	ЗаявкиСоСтатусами.ОплатитьВКассуЗаВыездКурьера,
	         |	ЗаявкиСоСтатусами.ВознаграждениеКурьера,
	         |	ЗаявкиСоСтатусами.Дата,
	         |	ЗаявкиСоСтатусами.ЗаблокироватьАвторасчет
	         |ПОМЕСТИТЬ РасчетВКПоЗаявке
	         |ИЗ
	         |	ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК ДенежныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.ДенежныйВыезд = ИСТИНА
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоВыездов.Курьер
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК НеАдминистративныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.Административный = ЛОЖЬ
	         |			И (ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |					ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоНеАдминистративныхВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоНеАдминистративныхВыездов.Курьер
	         |ГДЕ
	         |	(&Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |			ИЛИ ЗаявкиСоСтатусами.Ссылка = &Заявка)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	РасчетВКПоЗаявке.Менеджер,
	         |	РасчетВКПоЗаявке.Оператор,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Менеджер
	         |	КОНЕЦ КАК ИсточникФинансирования,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Курьер
	         |	КОНЕЦ КАК Сотрудник,
	         |	РасчетВКПоЗаявке.Ссылка,
	         |	РасчетВКПоЗаявке.Дата,
	         |	НАЧАЛОПЕРИОДА(РасчетВКПоЗаявке.Дата, МЕСЯЦ) КАК Период,
	         |	РасчетВКПоЗаявке.ВК,
	         |	РасчетВКПоЗаявке.ВКБезДенег,
	         |	РасчетВКПоЗаявке.ДенежныйВыезд,
	         |	РасчетВКПоЗаявке.ДенежныхВыездов,
	         |	РасчетВКПоЗаявке.БезДенежныхВыездов,
	         |	РасчетВКПоЗаявке.ПрочихВыездов,
	         |	РасчетВКПоЗаявке.Статус,
	         |	РасчетВКПоЗаявке.Утверждено КАК Подтверждена,
	         |	РасчетВКПоЗаявке.Проведен КАК Проведена,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА ВЫБОР
	         |					КОГДА РасчетВКПоЗаявке.Дата < ДАТАВРЕМЯ(2016, 8, 1)
	         |							ИЛИ РасчетВКПоЗаявке.ЗаблокироватьАвторасчет = ИСТИНА
	         |						ТОГДА РасчетВКПоЗаявке.ВознаграждениеКурьера
	         |					ИНАЧЕ РасчетВКПоЗаявке.ВК + РасчетВКПоЗаявке.ВКБезДенег
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА РасчетВКПоЗаявке.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера
	         |ПОМЕСТИТЬ ПредРасчет
	         |ИЗ
	         |	РасчетВКПоЗаявке КАК РасчетВКПоЗаявке
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	СтрокиЗаявок.Оператор,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка КАК Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВК
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВКБезДенег
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныйВыезд
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.БезДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ПрочихВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВознаграждениеКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК Заявок,
	         |	ВЫБОР
	         |		КОГДА Предрасчет.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
	         |			ТОГДА СтрокиЗаявок.ВознаграждениеОператора
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеОператора,
	         |	СтрокиЗаявок.ЗаполнениеОператором КАК ЗаполнениеОператором,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование,
	         |	ВЫБОР
	         |		КОГДА уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Операторы БД"" или уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Отдел сопровождения договоров страхования""
	         |			ТОГДА 0
	         |		ИНАЧЕ СтрокиЗаявок.Оператор.Наименование
	         |	КОНЕЦ КАК Сортировка, 0 как Бонус
	         |ПОМЕСТИТЬ ПредРасчет2
	         |ИЗ
	         |	ПредРасчет КАК Предрасчет
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаявок КАК СтрокиЗаявок
	         |		ПО Предрасчет.Ссылка = СтрокиЗаявок.Ссылка
	         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	         |		ПО (СтрокиЗаявок.Оператор = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент)";
	
КонецФункции


Функция ТекстЗапросаВКДо04_2017() экспорт
	Возврат  "ВЫБРАТЬ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор КАК Оператор,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВознаграждениеКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЗаблокироватьАвторасчет,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд
	         |ПОМЕСТИТЬ Заявки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	         |ГДЕ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления = ЛОЖЬ
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено
	         |	И ВЫБОР
	         |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |				ТОГДА ИСТИНА
	         |			ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |					И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		КОНЕЦ
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка КАК Ссылка,
	         |	0 КАК ЗаполнениеОператором,
	         |	ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка) КАК Оператор,
	         |	0 КАК ВознаграждениеОператора,
	         |	""Общее"" КАК УИД
	         |ПОМЕСТИТЬ СтрокиЗаявок
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	БСОЗаявок.Ссылка,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		ИНАЧЕ БСОЗаявок.Количество
	         |	КОНЕЦ,
	         |	БСОЗаявок.Оператор,
	         |	ВЫБОР
	         |		КОГДА БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |			ТОГДА 0
	         |		КОГДА БСОЗаявок.Оператор = БСОЗаявок.Ссылка.Курьер
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ,
	         |	БСОЗаявок.УидСтроки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСОЗаявок
	         |ГДЕ
	         |	БСОЗаявок.Ссылка В
	         |			(ВЫБРАТЬ
	         |				Заявки.Ссылка
	         |			ИЗ
	         |				Заявки)
	         |	И НЕ БСОЗаявок.Оператор = ЗНАЧЕНИЕ(Справочник.ФИзическиеЛица.ПустаяСсылка)
	         |	И БСОЗаявок.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	         |ПОМЕСТИТЬ Статусы
	         |ИЗ
	         |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(
	         |			,
	         |			Заявка В
	         |				(ВЫБРАТЬ
	         |					Заявки.Ссылка
	         |				ИЗ
	         |					Заявки)) КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Заявки.Ссылка КАК Ссылка,
	         |	Статусы.Статус,
	         |	ВЫБОР
	         |		КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	Заявки.Курьер,
	         |	Заявки.Менеджер,
	         |	Заявки.Оператор,
	         |	Заявки.Утверждено,
	         |	Заявки.Проведен,
	         |	Заявки.ОплатитьВКассуЗаВыездКурьера,
	         |	Заявки.ВознаграждениеКурьера,
	         |	Заявки.Дата,
	         |	Заявки.ЗаблокироватьАвторасчет,
	         |	Заявки.Самовыезд
	         |ПОМЕСТИТЬ ЗаявкиСоСтатусами
	         |ИЗ
	         |	Заявки КАК Заявки
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	         |		ПО Заявки.Ссылка = Статусы.Заявка
	         |ГДЕ
	         |	НЕ ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ЗаявкиСоСтатусами.Курьер,
	         |	ЗаявкиСоСтатусами.Ссылка,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |						ТОГДА 0
	         |					КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |							КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |								ТОГДА 75
	         |							ИНАЧЕ 100
	         |						КОНЕЦ
	         |						ТОГДА 250
	         |					КОГДА КоличествоВыездов.ДенежныхВыездов >= ВЫБОР
	         |							КОГДА &ДатаНач = ДАТАВРЕМЯ(2017, 1, 1)
	         |								ТОГДА 49
	         |							ИНАЧЕ 65
	         |						КОНЕЦ
	         |						ТОГДА 200
	         |					ИНАЧЕ 150
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ЗаявкиСоСтатусами.ДенежныйВыезд,
	         |	КоличествоВыездов.ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 0
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	ЗаявкиСоСтатусами.Статус,
	         |	ЗаявкиСоСтатусами.Менеджер,
	         |	ЗаявкиСоСтатусами.Оператор,
	         |	ЗаявкиСоСтатусами.Утверждено,
	         |	ЗаявкиСоСтатусами.Проведен,
	         |	ЗаявкиСоСтатусами.ОплатитьВКассуЗаВыездКурьера,
	         |	ЗаявкиСоСтатусами.ВознаграждениеКурьера,
	         |	ЗаявкиСоСтатусами.Дата,
	         |	ЗаявкиСоСтатусами.ЗаблокироватьАвторасчет
	         |ПОМЕСТИТЬ РасчетВКПоЗаявке
	         |ИЗ
	         |	ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК ДенежныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.ДенежныйВыезд = ИСТИНА
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоВыездов.Курьер
	         |ГДЕ
	         |	(&Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |			ИЛИ ЗаявкиСоСтатусами.Ссылка = &Заявка)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	РасчетВКПоЗаявке.Менеджер,
	         |	РасчетВКПоЗаявке.Оператор,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Менеджер
	         |	КОНЕЦ КАК ИсточникФинансирования,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Курьер
	         |	КОНЕЦ КАК Сотрудник,
	         |	РасчетВКПоЗаявке.Ссылка,
	         |	РасчетВКПоЗаявке.Дата,
	         |	НАЧАЛОПЕРИОДА(РасчетВКПоЗаявке.Дата, МЕСЯЦ) КАК Период,
	         |	РасчетВКПоЗаявке.ВК,
	         |	РасчетВКПоЗаявке.ВКБезДенег,
	         |	РасчетВКПоЗаявке.ДенежныйВыезд,
	         |	РасчетВКПоЗаявке.ДенежныхВыездов,
	         |	РасчетВКПоЗаявке.БезДенежныхВыездов,
	         |	РасчетВКПоЗаявке.ПрочихВыездов,
	         |	РасчетВКПоЗаявке.Статус,
	         |	РасчетВКПоЗаявке.Утверждено КАК Подтверждена,
	         |	РасчетВКПоЗаявке.Проведен КАК Проведена,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА ВЫБОР
	         |					КОГДА РасчетВКПоЗаявке.Дата < ДАТАВРЕМЯ(2016, 8, 1)
	         |							ИЛИ РасчетВКПоЗаявке.ЗаблокироватьАвторасчет = ИСТИНА
	         |						ТОГДА РасчетВКПоЗаявке.ВознаграждениеКурьера
	         |					ИНАЧЕ РасчетВКПоЗаявке.ВК + РасчетВКПоЗаявке.ВКБезДенег
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА РасчетВКПоЗаявке.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера
	         |ПОМЕСТИТЬ ПредРасчет
	         |ИЗ
	         |	РасчетВКПоЗаявке КАК РасчетВКПоЗаявке
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	СтрокиЗаявок.Оператор,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка КАК Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВК
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВКБезДенег
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныйВыезд
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.БезДенежныхВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ПрочихВыездов
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ВознаграждениеКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА Предрасчет.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера,
	         |	ВЫБОР
	         |		КОГДА СтрокиЗаявок.УИД = ""Общее""
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК Заявок,
	         |	ВЫБОР
	         |		КОГДА Предрасчет.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
	         |			ТОГДА СтрокиЗаявок.ВознаграждениеОператора
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеОператора,
	         |	СтрокиЗаявок.ЗаполнениеОператором КАК ЗаполнениеОператором,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
	         |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование,
	         |	ВЫБОР
	         |		КОГДА уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Операторы БД"" или уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование = ""Отдел сопровождения договоров страхования""
	         |			ТОГДА 0
	         |		ИНАЧЕ СтрокиЗаявок.Оператор.Наименование
	         |	КОНЕЦ КАК Сортировка, 0 как Бонус поместить ПредРасчет2
	         |ИЗ
	         |	ПредРасчет КАК Предрасчет
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаявок КАК СтрокиЗаявок
	         |		ПО Предрасчет.Ссылка = СтрокиЗаявок.Ссылка
	         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	         |		ПО (СтрокиЗаявок.Оператор = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент)";
	
КонецФункции


Функция ТекстЗапросаВКСтарый() экспорт
	Возврат  "ВЫБРАТЬ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ОплатитьВКассуЗаВыездКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВознаграждениеКурьера,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЗаблокироватьАвторасчет,
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд
	         |ПОМЕСТИТЬ Заявки
	         |ИЗ
	         |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	         |ГДЕ
	         |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления = ЛОЖЬ
	         |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено
	         |	И ВЫБОР
	         |			КОГДА &Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |				ТОГДА ИСТИНА
	         |			ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |					И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		КОНЕЦ
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус,
	         |	уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	         |ПОМЕСТИТЬ Статусы
	         |ИЗ
	         |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(
	         |			,
	         |			Заявка В
	         |				(ВЫБРАТЬ
	         |					Заявки.Ссылка
	         |				ИЗ
	         |					Заявки)) КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Заявки.Ссылка КАК Ссылка,
	         |	Статусы.Статус,
	         |	ВЫБОР
	         |		КОГДА Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	         |			ТОГДА ИСТИНА
	         |		ИНАЧЕ ЛОЖЬ
	         |	КОНЕЦ КАК ДенежныйВыезд,
	         |	Заявки.Курьер,
	         |	Заявки.Менеджер,
	         |	Заявки.Утверждено,
	         |	Заявки.Проведен,
	         |	Заявки.ОплатитьВКассуЗаВыездКурьера,
	         |	Заявки.ВознаграждениеКурьера,
	         |	Заявки.Дата,
	         |	Заявки.ЗаблокироватьАвторасчет,
	         |	Заявки.Самовыезд
	         |ПОМЕСТИТЬ ЗаявкиСоСтатусами
	         |ИЗ
	         |	Заявки КАК Заявки
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	         |		ПО Заявки.Ссылка = Статусы.Заявка
	         |ГДЕ
	         |	НЕ ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ЗаявкиСоСтатусами.Курьер,
	         |	ЗаявкиСоСтатусами.Ссылка,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА ВЫБОР
	         |					КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |						ТОГДА 0
	         |					КОГДА КоличествоВыездов.ДенежныхВыездов >= &План250//100
	         |						ТОГДА 250
	         |					КОГДА КоличествоВыездов.ДенежныхВыездов >= &План200//65
	         |						ТОГДА 200
	         |					ИНАЧЕ 150
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВК,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Самовыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 100
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВКБезДенег,
	         |	ЗаявкиСоСтатусами.ДенежныйВыезд,
	         |	КоличествоВыездов.ДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 1
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК БезДенежныхВыездов,
	         |	ВЫБОР
	         |		КОГДА ЗаявкиСоСтатусами.ДенежныйВыезд
	         |			ТОГДА 0
	         |		КОГДА ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась)
	         |				ИЛИ ЗаявкиСоСтатусами.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)
	         |			ТОГДА 0
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК ПрочихВыездов,
	         |	ЗаявкиСоСтатусами.Статус,
	         |	ЗаявкиСоСтатусами.Менеджер,
	         |	ЗаявкиСоСтатусами.Утверждено,
	         |	ЗаявкиСоСтатусами.Проведен,
	         |	ЗаявкиСоСтатусами.ОплатитьВКассуЗаВыездКурьера,
	         |	ЗаявкиСоСтатусами.ВознаграждениеКурьера,
	         |	ЗаявкиСоСтатусами.Дата,
	         |	ЗаявкиСоСтатусами.ЗаблокироватьАвторасчет
	         |ПОМЕСТИТЬ РасчетВКПоЗаявке
	         |ИЗ
	         |	ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкиСоСтатусами.Ссылка) КАК ДенежныхВыездов,
	         |			ЗаявкиСоСтатусами.Курьер КАК Курьер
	         |		ИЗ
	         |			ЗаявкиСоСтатусами КАК ЗаявкиСоСтатусами
	         |		ГДЕ
	         |			ЗаявкиСоСтатусами.ДенежныйВыезд = ИСТИНА
	         |		
	         |		СГРУППИРОВАТЬ ПО
	         |			ЗаявкиСоСтатусами.Курьер) КАК КоличествоВыездов
	         |		ПО ЗаявкиСоСтатусами.Курьер = КоличествоВыездов.Курьер
	         |ГДЕ
	         |	(&Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	         |			ИЛИ ЗаявкиСоСтатусами.Ссылка = &Заявка)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	РасчетВКПоЗаявке.Менеджер,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Менеджер
	         |	КОНЕЦ КАК ИсточникФинансирования,
	         |	ВЫБОР
	         |		КОГДА РасчетВКПоЗаявке.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	         |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	         |		ИНАЧЕ РасчетВКПоЗаявке.Курьер
	         |	КОНЕЦ КАК Сотрудник,
	         |	РасчетВКПоЗаявке.Ссылка,
	         |	РасчетВКПоЗаявке.Дата,
	         |	НАЧАЛОПЕРИОДА(РасчетВКПоЗаявке.Дата, МЕСЯЦ) КАК Период,
	         |	РасчетВКПоЗаявке.ВК,
	         |	РасчетВКПоЗаявке.ВКБезДенег,
	         |	РасчетВКПоЗаявке.ДенежныйВыезд,
	         |	РасчетВКПоЗаявке.ДенежныхВыездов,
	         |	РасчетВКПоЗаявке.БезДенежныхВыездов,
	         |	РасчетВКПоЗаявке.ПрочихВыездов,
	         |	РасчетВКПоЗаявке.Статус,
	         |	РасчетВКПоЗаявке.Утверждено КАК Подтверждена,
	         |	РасчетВКПоЗаявке.Проведен КАК Проведена,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА ВЫБОР
	         |					КОГДА РасчетВКПоЗаявке.Дата < ДАТАВРЕМЯ(2016, 8, 1)
	         |							ИЛИ РасчетВКПоЗаявке.ЗаблокироватьАвторасчет = ИСТИНА
	         |						ТОГДА РасчетВКПоЗаявке.ВознаграждениеКурьера
	         |					ИНАЧЕ РасчетВКПоЗаявке.ВК + РасчетВКПоЗаявке.ВКБезДенег
	         |				КОНЕЦ
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ВознаграждениеКурьера,
	         |	ВЫБОР
	         |		КОГДА (&ПросчитыватьСУчетомНепроведенных
	         |				ИЛИ РасчетВКПоЗаявке.Проведен)
	         |				И (&ПросчитыватьСУчетомНеподтвержденных
	         |					ИЛИ РасчетВКПоЗаявке.Утверждено)
	         |			ТОГДА РасчетВКПоЗаявке.ОплатитьВКассуЗаВыездКурьера
	         |		ИНАЧЕ 0
	         |	КОНЕЦ КАК ОплатитьВКассуЗаВыездКурьера
	         |ПОМЕСТИТЬ ПредРасчет
	         |ИЗ
	         |	РасчетВКПоЗаявке КАК РасчетВКПоЗаявке
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	Предрасчет.Курьер,
	         |	Предрасчет.Менеджер,
	         |	Предрасчет.ИсточникФинансирования,
	         |	Предрасчет.Сотрудник,
	         |	Предрасчет.Ссылка,
	         |	Предрасчет.Дата,
	         |	Предрасчет.Период,
	         |	Предрасчет.ВК,
	         |	Предрасчет.ВКБезДенег,
	         |	Предрасчет.ДенежныйВыезд,
	         |	Предрасчет.ДенежныхВыездов,
	         |	Предрасчет.БезДенежныхВыездов,
	         |	Предрасчет.ПрочихВыездов,
	         |	Предрасчет.Статус,
	         |	Предрасчет.Подтверждена,
	         |	Предрасчет.Проведена,
	         |	Предрасчет.ВознаграждениеКурьера,
	         |	Предрасчет.ОплатитьВКассуЗаВыездКурьера
	         |ИЗ
	         |	ПредРасчет КАК Предрасчет";
	
КонецФункции

Функция ДопЗапрос()
	Возврат          "
		|;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	РасчетВКПоЗаявке.Курьер,
	         |	СУММА(РасчетВКПоЗаявке.ВК) КАК ВК,
	         |	СУММА(РасчетВКПоЗаявке.ВКБезДенег) КАК ВКБезДенег,
	         |	МАКСИМУМ(РасчетВКПоЗаявке.ДенежныхВыездов) КАК ДенежныхВыездов,
	         |	СУММА(РасчетВКПоЗаявке.БезДенежныхВыездов) КАК БезДенежныхВыездов,
	         |	СУММА(РасчетВКПоЗаявке.ПрочихВыездов) КАК ПрочихВыездов,
			 |	СУММА(РасчетВКПоЗаявке.Бонус) КАК Бонус
	         |ИЗ
	         |	ПредРасчет2 КАК РасчетВКПоЗаявке
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	РасчетВКПоЗаявке.Курьер
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	ВК УБЫВ";
КонецФункции
Функция ДопЗапросРасчетЗП() Экспорт
	Возврат          "
		|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПустаяСсылка) КАК Начисление,
|	з.ИсточникФинансирования КАК ИсточникФинансирования,
|	з.Курьер КАК Сотрудник,
|	СУММА(з.ВознаграждениеКурьера) + СУММА(з.Бонус) КАК Результат,
|	з.Период КАК Период,
|	СУММА(ВЫБОР
|			КОГДА НЕ з.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Курьер)
|				ТОГДА з.ОплатитьВКассуЗаВыездКурьера
|			ИНАЧЕ 0
|		КОНЕЦ) КАК РезультатДляИсточника,
|	з.Ссылка КАК Заявка
|ИЗ
|	ПредРасчет2 КАК з

|СГРУППИРОВАТЬ ПО
|	з.ИсточникФинансирования,
|	з.Курьер,
|	з.Период,
|	з.Ссылка

|ИМЕЮЩИЕ
|	(СУММА(з.ВознаграждениеКурьера) <> 0
|		ИЛИ СУММА(ВЫБОР
|				КОГДА НЕ з.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Курьер)
|					ТОГДА з.ОплатитьВКассуЗаВыездКурьера
|				ИНАЧЕ 0
|			КОНЕЦ) <> 0)

|ОБЪЕДИНИТЬ ВСЕ

|ВЫБРАТЬ
|	ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПечатьПолиса),
|	з.ИсточникФинансирования,
|	з.Оператор,
|	СУММА(з.ВознаграждениеОператора),
|	з.Период,
|	СУММА(0),
|	з.Ссылка
|ИЗ
|	ПредРасчет2 КАК з
|ГДЕ
|	з.ВознаграждениеОператора <> 0

|СГРУППИРОВАТЬ ПО
|	з.ИсточникФинансирования,
|	з.Оператор,
|	з.Период,
|	з.Ссылка";
КонецФункции		 
Функция ДопЗапросРасчетЗПСтарый() Экспорт
	Возврат          "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|			 ВЫБРАТЬ
		|	з.ИсточникФинансирования КАК ИсточникФинансирования,
		|	з.Сотрудник КАК Сотрудник,
		|	СУММА(з.ВознаграждениеКурьера) КАК Результат,
		|	з.Период КАК Период,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ з.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Курьер)
		|				ТОГДА з.ОплатитьВКассуЗаВыездКурьера
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РезультатДляИсточника,
		|	з.Ссылка КАК Заявка
		|ИЗ
		|	ПредРасчет КАК з
		
		|СГРУППИРОВАТЬ ПО
		|	з.ИсточникФинансирования,
		|	з.Сотрудник,
		|	з.Период,
	|	з.Ссылка";
КонецФункции		 



Функция ПосчитатьПолиса(Ссылка, ПоСк= ложь) Экспорт
	ДополнительныеСвойства = Новый Структура;
	Запрос = Новый Запрос(
		
	"ВЫБРАТЬ
	|	БСО.НомерСтроки,
	|	БСО.ВидБСО,
	|	БСО.Количество,
	|	БСО.СК
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСО
	|ГДЕ
	|	БСО.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТЧ.ВидБСО,
	|	ВТ_ТЧ.СК,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ТЧ.ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов)
	|				ТОГДА ВТ_ТЧ.ВидБСО
	|			ИНАЧЕ ЕСТЬNULL(СП.Ссылка.Вид, ""Прочее"")
	|		КОНЕЦ) КАК Вид,
	|	МАКСИМУМ(ВТ_ТЧ.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Виды
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
	|		ПО ВТ_ТЧ.ВидБСО = СП.ВидБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК С
	|		ПО ВТ_ТЧ.ВидБСО = С.Ссылка
	|ГДЕ
	|	СП.Ссылка есть null или НЕ СП.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧ.НомерСтроки,
	|	ВТ_ТЧ.ВидБСО,
	|	ВТ_ТЧ.СК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КАСКО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ОСАГО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК НС,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК Прочие
	|ИЗ
	|	ВТ_Виды КАК ВТ_Виды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КАСКО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ОСАГО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК НС,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК Прочие,
	|	ВТ_Виды.СК
	|ИЗ
	|	ВТ_Виды КАК ВТ_Виды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Виды.СК");
		//ТЗБСО = БСО.Выгрузить();
		//ТЗБСО.Колонки.Добавить("Тип");
		//Для Каждого СтрокаТЗ Из ТЗБСО Цикл
		//	Если ТипЗнч(СтрокаТЗ.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		//		СтрокаТЗ.Тип = СтрокаТЗ.ВидБСО.Тип
		//	КонецЕсли;
	//	КонецЦикла;
		//Запрос.УстановитьПараметр("ТЗБСО", ТЗБСО);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Пакет = Запрос.ВыполнитьПакет();
		Выборка = Пакет[2].Выбрать();
		Если Выборка.Следующий() Тогда
			ДополнительныеСвойства.Вставить("Каско",  Выборка.Каско);
			ДополнительныеСвойства.Вставить("Осаго",  Выборка.Осаго);
			ДополнительныеСвойства.Вставить("НС",     Выборка.НС);
			ДополнительныеСвойства.Вставить("Прочие", Выборка.Прочие);
		Иначе
			ДополнительныеСвойства.Вставить("Каско",  0);
			ДополнительныеСвойства.Вставить("Осаго",  0);
			ДополнительныеСвойства.Вставить("НС",     0);
			ДополнительныеСвойства.Вставить("Прочие", 0);	
		КонецЕсли;
		
		Если ПоСк Тогда
			ДополнительныеСвойства.Вставить("ПоСК", Пакет[3].Выгрузить());	
		КонецЕсли;
		
		Возврат ДополнительныеСвойства;
КонецФункции


Функция ОбработчикРассылки(Очередь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТекДата = ТекущаяДата();
	ТекЧас = Час(ТекДата);
	
	НачалоРассылки = 9;
	КонецРассылки  = 19;
	Если ТекЧас >=НачалоРассылки и ТекЧас<КонецРассылки Тогда
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Если ТекЧас = НачалоРассылки Тогда
		//
		Дата1  = НачалоДня(ТекДата)+ТекЧас*3600;//
		Дата2  = КонецДня(ТекДата);
	Иначе
		Дата1  = ТекДата-15*60;//За 15 минут до тек момента
		Дата2  = ТекДата+3600;//1 час вперед
	КонецЕсли;	
	пРассылка  = Перечисления.уб_ТипыОчереди.Рассылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Каско,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Осаго,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.НС,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДМС,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДК,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТипВыезда,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Контакты,
	               |	уб_Очередь.КоличествоПопытокВыполнения,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_Очередь КАК уб_Очередь
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = уб_Очередь.Объект
	               |			И (уб_Очередь.ТипОчереди = ЗНАЧЕНИЕ(Перечисление.уб_ТипыОчереди.Рассылка))
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Ссылки)
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &Дата1
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &Дата2";
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",Дата2);			   
	Запрос.УстановитьПараметр("Ссылки",Очередь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Утверждено = Ложь Тогда
			уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Сообщение("Неутверждено. Удалена из рассылки.",Выборка.Менеджер,Выборка.Номер);
			продолжить;
		ИначеЕсли Выборка.ПометкаУдаления = Истина Тогда	
			уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Сообщение("Помечена на удаление. Удалена из рассылки.",Выборка.Менеджер,Выборка.Номер);
			продолжить;
		ИначеЕсли Выборка.ТипВыезда = 2 Тогда	
			//офис
			уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Сообщение("Офис. Удалена из рассылки.",Выборка.Менеджер,Выборка.Номер);
			продолжить;	
		ИначеЕсли ПустаяСтрока(Выборка.Контакты) Тогда	
			//не куда сообщать
			уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Сообщение("Пустые контакты. Удалена из рассылки.",Выборка.Менеджер,Выборка.Номер);
			продолжить;		
		КонецЕсли;	
		
		Если Выборка.КоличествоПопытокВыполнения = 100 и ТекЧас <> НачалоРассылки Тогда
			ТекстСМС = ТекстSMSоКурьере(Выборка,"Произошли изменения, на доставку полиса");
		Иначе	
			ТекстСМС = ТекстSMSоКурьере(Выборка);
		КонецЕсли;	
		
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Вставить("ИмяСервиса","www.sluice");
		Параметры.Вставить("ИмяСервиса","smsc.ru");
		Параметры.Вставить("Режим","HTTP");
		Параметры.Вставить("ТолькоОдномуПолучателю", Истина);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			Параметры.Получатели 	= Выборка.Контакты;
		Иначе
			Параметры.Получатели 	= "+79133616124";
		КонецЕсли;
		
		Параметры.Тема			= "Рассылка СМС";
		
		Параметры.Сообщение		= ТекстСМС;
		Попытка //TODO Временно добавлена попытка
			Ответ = "";
			уб_ОбменДанными.SendSMS(Параметры,Ответ);
			Если Найти (Ответ,"Ложь") = 0 Тогда
				Ответ = СтрЗаменить(Ответ,"¶","");
				Сообщение(ТекстСМС+". "+Ответ,Выборка.Менеджер,Выборка.Номер);
				уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Иначе
				уб_МодульРегламентныхЗаданий.ОшибкаОчереди(Выборка.Ссылка,пРассылка);
			Конецесли;	
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПроверитьИОтправитьСМС(). " + " -- " + ОписаниеОшибки(), "Сообщить", Истина, , ,,"СМС-рассылка.Error.Заявка" );	
		КонецПопытки;
	КонецЦикла;	
	//Зачистка не отработанной очереди
	
	Дата1  = ТекДата-30*60;// за 30 минут до текущего момента
	Запрос.УстановитьПараметр("Дата1",НачалоГода(Дата1));
	Запрос.УстановитьПараметр("Дата2",Дата1);			   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
		Сообщение("Истекла дата. Удалена из рассылки.",Выборка.Менеджер,Выборка.Номер);	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция Сообщение(Сообщение,Получатель,Номер,ДублироватьПочтой = Истина) Экспорт
	
	Если ПустаяСтрока(Сообщение) Тогда
		Возврат Ложь;	
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Канал = "З-"+Формат(Номер,"ЧГ=");
	МЗ = РегистрыСведений.уб_Чат_Сообщения.СоздатьМенеджерЗаписи(); 
	МЗ.Период      = ТекущаяДата();
	Мз.ИмяКанала   = Канал;
	Мз.Отправитель = ПараметрыСеанса.ТекущийПользователь;
	//Если ПараметрыСеанса.уб_ТекущееФизЛицо = Менеджер Тогда
	//	Если ЗначениеЗаполнено(Оператор) Тогда
	//		МЗ.Получатель =  Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Оператор);	
	//	Иначе
	//		МЗ.Получатель =  Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Менеджер);	
	//	КонецЕсли;
	//	
	//Иначе
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Пользователи") Тогда
		МЗ.Получатель = Получатель;
	Иначе	
		МЗ.Получатель = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Получатель);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МЗ.Получатель) = Ложь Тогда
		МЗ.Получатель = Справочники.Пользователи.Robot;
	КонецЕсли;
	
	МЗ.ИДСообщения = Новый УникальныйИдентификатор;
	Мз.Заголовок  = Формат(Номер,"ЧГ=");
	Мз.Сообщение = Сообщение;
	
	Мз.Записать();
	
	_Заявка = Документы.уб_ЗаявкаНаВъезд.НайтиПоНомеру(Номер);
	ТекстHTML ="<body>ЗАЯВКА на выезд: <b>"+Канал+"</b>"
	+"<br>Страхователь: <b>"+_Заявка.Страхователь+"</b>" 
	+"<br><br><div style='    background: #7cd1ef;   color: #fff;  font-size: 16px; padding:15px; font-weight: 600; border-radius: 8px;'>"+Сообщение+"</div><br><br>Отправитель: <b>"+Мз.Отправитель+"</b><br>---  Отвечать на адрес 1c@kupipolis.ru не следует, это никто не прочитает</body>";
	Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
	ОбратныйАдрес = уб_temp.КонтактнаяИнформация(Мз.Отправитель.ФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	//Сообщить(ОбратныйАдрес);
	Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
		Параметры.ОбратныйАдрес = ОбратныйАдрес;
	КонецЕсли;
	
	Если ДублироватьПочтой = Истина Тогда
		МассивПолучателей = Новый Массив;
		Попытка
			МассивПолучателей.Добавить(уб_temp.КонтактнаяИнформация(МЗ.Получатель.ФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
		Исключение
		КонецПопытки;
		
		Если МассивПолучателей.Количество() = 0 Тогда
			Сообщить("Почта получателя не определена");
		Иначе	
			
			Параметры.Получатели					= МассивПолучателей;
			Параметры.Тема							= Мз.Заголовок;// +" - сообщение от "+РегистрСведенийМенеджерЗаписи.Отправитель;
			Параметры.ТекстHTML						= ТекстHTML;
			Параметры.ПисатьВЖурналТемуПриОшибке    = Ложь;
			Параметры.ТипСообщенияПриИсключении		= "Предупреждение";
			//Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
			//	Параметры.ОбратныйАдрес = ОбратныйАдрес
			//КонецЕсли;
			
			ЗаписыватьВРегистр = уб_ОбменДанными.SendMail(Параметры);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции	
	

Функция ТекстSMSоКурьере(Выборка,НачалоСообщения ="") Экспорт
	Если НачалоСообщения = "" Тогда
		НачалоСообщения = "На доставку полиса";
	КонецЕсли;	
	
	Назначен = ?(Выборка.ТипВыезда = 0,Выборка.Курьер,Выборка.Менеджер);
	
	Возврат НачалоСообщения+" назначен "+Назначен+", тел. "+ТелефонКурьера(Назначен);
	
КонецФункции	
	
Функция ТелефонКурьера(Назначен) Экспорт
	//Если Назначен = Неопределено Тогда
	//	Назначен = Курьер;
	//КонецЕсли;
	
	ТелефонКурьера = уб_temp.ДайКонтактнуюИнформациюФизлица(Назначен, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
	Если ПустаяСтрока(ТелефонКурьера) Тогда
		Возврат "+74952280942";
	Иначе
		Возврат ТелефонКурьера;
	КонецЕсли;

КонецФункции


Функция СписокОператоров(ВставитьТекущееЛицо =Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |ГДЕ
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ЛОЖЬ
	               |	И уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение В
	               |			(ВЫБРАТЬ
	               |				Подр.Ссылка
	               |			ИЗ
	               |				Справочник.ПодразделенияОрганизаций КАК Подр
	               |			ГДЕ
	               |				(Подр.Наименование = ""Операторы БД""
	               |					ИЛИ Подр.Наименование = ""Отдел сопровождения договоров страхования"" или Подр.Код = ""000000030""))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент.Наименование";
				   
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Агент");		   
	
	Если ВставитьТекущееЛицо = Истина Тогда
		Если Массив.Найти(ПараметрыСеанса.уб_ТекущееФизЛицо) = Неопределено Тогда
			Массив.Вставить(0,ПараметрыСеанса.уб_ТекущееФизЛицо);			
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Массив;
КонецФункции	

Функция ПроверитьДК(Заявка) Экспорт
	//Возврат Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДопНомерБСО
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Ссылка = &Ссылка
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование ПОДОБНО ""ДК%""";
	Запрос.УстановитьПараметр("Ссылка",Заявка);				   
	ЕстьНомерДлиньше6 = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьДК = Ложь;
	Пока Выборка.Следующий() Цикл
		ЕстьДк = Истина;
		
		Если СтрДлина(СокрЛП(Выборка.НомерБСО))>= 15 или
			СтрДлина(СокрЛП(Выборка.ДопНомерБСО))>= 15 Тогда
			ЕстьНомерДлиньше6 = Истина;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	Если ЕстьДк = Ложь Тогда
		Возврат Истина;
	Иначе
		Возврат ЕстьНомерДлиньше6 = Истина;
	КонецЕсли;	
	
КонецФункции

Функция ПроверитьСтроки(Заявка) Экспорт
	
	Если Заявка.Тип = Перечисления.уб_ТипВыезда.Административный
				или Заявка.Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр Тогда
		Возврат Истина
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДопНомерБСО
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	|ГДЕ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Ссылка = &Ссылка
	|	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОСАГО))
	|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Состояние В (ЗНАЧЕНИЕ(Перечисление.уб_СостояниеОформления.Печать), ЗНАЧЕНИЕ(Перечисление.уб_СостояниеОформления.КомплектОформлен), ЗНАЧЕНИЕ(Перечисление.уб_СостояниеОформления.Отказ))";
	Запрос.УстановитьПараметр("Ссылка",Заявка);				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Ложь
	КонецЦикла;	
	Возврат Истина
КонецФункции


Функция ПроверитьОбъектСтрахования(Заявка) Экспорт
	//Возврат Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОбъектСтрахования,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаНачала,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОкончания
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СтраховаяПремия > 0
	               |	И (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис)
	               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОСАГО))
	               |	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование ПОДОБНО ""ДК%""
	               |	И (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя = """"
	               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки = уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя)
	               |	И (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОбъектСтрахования = ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
	               |				И (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование ПОДОБНО ""%каско%""
	               |					ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.Наименование ПОДОБНО ""%осаго%"")
	               |			ИЛИ (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления = ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)))";
	Запрос.УстановитьПараметр("Ссылка",Заявка);				   
	Выборка = Запрос.Выполнить().Выбрать();
	НЕТОбъекта = Ложь;
	Пока Выборка.Следующий() Цикл
		НЕТОбъекта = Истина;
		Прервать;
		//ЕстьДк = Истина;
		//
		//Если СтрДлина(СокрЛП(Выборка.НомерБСО))=15 или
		//	СтрДлина(СокрЛП(Выборка.ДопНомерБСО))=15 Тогда
		//	ЕстьНомерДлиньше6 = Истина;
		//	Прервать;
		//КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат НЕТОбъекта = ЛОЖЬ;
	//Если ЕстьДк = Ложь Тогда
	//	Возврат Истина;
	//Иначе
	//	Возврат ЕстьНомерДлиньше6 = Истина;
	//КонецЕсли;	
	
КонецФункции

Процедура ВыгрузитьФайлы(Заявка) Экспорт
	Выгружено = уб_СЕРВЕРные.ВыгрузитьФайлыПоЗаявке(Заявка,ПараметрыСеанса.ТекущийПользователь);
				   
КонецПроцедуры	

#Область ПечатьЗаявки

Функция Печать(Параметры = Неопределено,СсылкаНаОбъект) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Отказ = Ложь;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	З.Ссылка,
	|	З.ВерсияДанных,
	|	З.ПометкаУдаления,
	|	З.Номер,
	|	З.Дата,
	|	З.Проведен,
	|	З.Утверждено,
	|	З.Адрес,
	|	З.Банк,
	|	З.Блокиратор,
	|	З.ВремяВстречи,
	|	З.ВремяНачало,
	|	З.ВремяОкончания,
	|	З.Город,
	|	З.ИсточникФинансирования,
	|	З.ИтогПредоставленнаяСкидка,
	|	З.ИтогСтраховаяПремия,
	|	З.Комментарий,
	|	З.КонтактноеЛицо,
	|	З.Контакты,
	|	З.Курьер,
	|	З.МаркаТС,
	|	З.Менеджер,
	|	З.МестоВстречи,
	|	З.МодельТС,
	|	З.НетБСО,
	|	З.НетДокументов,
	|	З.НомерДоговора,
	|	З.НомерЗаявки,
	|	З.НомерЗаявкиСК,
	|	З.НомерКартыСтрахователя,
	|	З.ВознаграждениеКурьера,
	|	З.ОплатитьВКассуЗаВыездКурьера,
	|	З.ПредставлениеЗаявки,
	|	З.ПредставлениеСтроки,
	|	З.ПриоритетЗадачи,
	|	З.РассрочкаПлатежа,
	|	З.Самовыезд,
	|	З.СК,
	|	З.СтанцияМетро,
	|	З.Статус,
	|	З.Страхователь,
	|	З.СуммаПоКарте,
	|	З.Тип,
	|	З.ТребуетсяПроверкаРуководителем,
	|	З.ЦельВыезда,
	|	З.ИтогСуммаВзноса,
	|	З.СозданНаОсновании,
	|	З.КомментарийСлужебный,
	|	З.ТребуетсяУтверждениеАндеррайтера,
	|	З.УтвердилАндеррайтер,
	|	З.УтвердилРуководитель,
	|	З.ВознаграждениеЧастьКлиента,
	|	З.ВознаграждениеЧастьБрокера,
	|	З.За10КмОтМКАД,
	|	З.ЗаблокироватьАвторасчет,
	|	З.ОбъектСтрахования,
	|	З.УтвержденоДата,
	|	З.Срочная,
	|	З.Оператор,
	|	З.ВремяВстречиКлиент,
	|	З.ВремяОкончанияКлиент,
	|	З.ФормаОплаты,
	|	З.НеобходимостьОсмотра,
	|	З.Куратор,
	|	З.ТипВыезда,
	|	З.Каско,
	|	З.Осаго,
	|	З.НС,
	|	З.ДМС,
	|	З.ДК,
	|	З.ОплачиваемыйОсмотр,
	|	З.СВС,
	|	З.Состояния,
	|	З.Источник,
	|	З.ПроцентГотовности,
	|	З.НеВерный,
	|	З.ЕОСАГО,
	|	З.РезультатПроверки,
	|	З.Автор,
	|	З.ДатаСоздания,
	|	З.Модификатор,
	|	З.ДатаИзменения,
	|	З.БСО.(
	|		Ссылка,
	|		НомерСтроки,
	|		СК,
	|		ВидСП,
	|		ВидБСО,
	|		СтраховаяПремия,
	|		ПредоставленнаяСкидка,
	|		ПредоставленнаяСкидкаПроцент,
	|		ЛимитОтветственности,
	|		Основной,
	|		Количество,
	|		Расчетчик,
	|		ДопСоглашение,
	|		ИтогСтраховаяПремия,
	|		ИтогПредоставленнаяСкидка,
	|		ДопКоличество,
	|		МаркаТС,
	|		МодельТС,
	|		Франшиза,
	|		РассрочкаПлатежа,
	|		БезубыточныйПереход,
	|		СуммаВзноса,
	|		ФормаОплаты,
	|		Агрегатная,
	|		НомерВзноса,
	|		ИтогСуммаВзноса,
	|		ОрганизацияАгент,
	|		Валюта,
	|		Курс,
	|		Кратность,
	|		Стоимость,
	|		ДругиеДокументы,
	|		УидСтроки,
	|		УидРодителя,
	|		КВБрокераПлан,
	|		ОфициальнаяСкидка,
	|		Поставщик,
	|		Оператор,
	|		Состояние,
	|		НомерБСО,
	|		Ссылка КАК Ссылка1,
	|		НомерСтроки КАК НомерСтроки1,
	|		СК КАК СК1,
	|		ВидСП КАК ВидСП1,
	|		ВидБСО КАК ВидБСО1,
	|		СтраховаяПремия КАК СтраховаяПремия1,
	|		ПредоставленнаяСкидка КАК ПредоставленнаяСкидка1,
	|		ПредоставленнаяСкидкаПроцент КАК ПредоставленнаяСкидкаПроцент1,
	|		ЛимитОтветственности КАК ЛимитОтветственности1,
	|		Основной КАК Основной1,
	|		Количество КАК Количество1,
	|		Расчетчик КАК Расчетчик1,
	|		ДопСоглашение КАК ДопСоглашение1,
	|		ИтогСтраховаяПремия КАК ИтогСтраховаяПремия1,
	|		ИтогПредоставленнаяСкидка КАК ИтогПредоставленнаяСкидка1,
	|		ДопКоличество КАК ДопКоличество1,
	|		МаркаТС КАК МаркаТС1,
	|		МодельТС КАК МодельТС1,
	|		Франшиза КАК Франшиза1,
	|		РассрочкаПлатежа КАК РассрочкаПлатежа1,
	|		БезубыточныйПереход КАК БезубыточныйПереход1,
	|		СуммаВзноса КАК СуммаВзноса1,
	|		ФормаОплаты КАК ФормаОплаты1,
	|		Агрегатная КАК Агрегатная1,
	|		НомерВзноса КАК НомерВзноса1,
	|		ИтогСуммаВзноса КАК ИтогСуммаВзноса1,
	|		ОрганизацияАгент КАК ОрганизацияАгент1,
	|		Валюта КАК Валюта1,
	|		Курс КАК Курс1,
	|		Кратность КАК Кратность1,
	|		Стоимость КАК Стоимость1,
	|		ДругиеДокументы КАК ДругиеДокументы1,
	|		УидСтроки КАК УидСтроки1,
	|		УидРодителя КАК УидРодителя1,
	|		КВБрокераПлан КАК КВБрокераПлан1,
	|		ОфициальнаяСкидка КАК ОфициальнаяСкидка1,
	|		Поставщик КАК Поставщик1,
	|		Оператор КАК Оператор1,
	|		Состояние КАК Состояние1,
	|		НомерБСО КАК НомерБСО1,ФормаОплатыСтрока,Кошелек
	|	),
	|	З.Мотивация.(
	|		Ссылка,
	|		НомерСтроки,
	|		ВидМотивации,
	|		ЧастьМенеджера,
	|		ЧастьБрокера,
	|		ЧастьКлиента
	|	),
	|	З.СписокФайлов.(
	|		Ссылка,
	|		НомерСтроки,
	|		Опубликован,
	|		СсылкаСправочника,
	|		Размещен,
	|		ДатаПубликации,
	|		УидСтроки
	|	),
	|	З.РасчетыПоЗаявке.(
	|		Ссылка,
	|		НомерСтроки,
	|		Вид,
	|		УидСтроки,
	|		СуммаКлиент,
	|		СуммаМенеджер,
	|		СуммаБрокер,
	|		СуммаБрокерВС,
	|		Уточнение,
	|		ВремяРегистрации,
	|		Автор
	|	),
	|	ЕСТЬNULL(З.МаркаТС.Наименование, """") КАК МаркаТСНаименование,
	|	ЕСТЬNULL(З.Банк.Наименование, """") КАК БанкНаименование,
	|	ЕСТЬNULL(З.МодельТС.Наименование, """") КАК МодельТСНаименование,
	|	ВЫБОР
	|		КОГДА З.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Клиент)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыездОплачиваетсяКлиентом,
	|	ПРЕДСТАВЛЕНИЕ(З.Тип) КАК ТипСтрока,
	|	ПРЕДСТАВЛЕНИЕ(З.СтанцияМетро) КАК СтанцияМетроСтрока,
	|	ПРЕДСТАВЛЕНИЕ(З.СК) КАК СКСтрока,
	//|	ПРЕДСТАВЛЕНИЕ(З.ФормаОплаты) КАК ФормаОплатыСтрока,
	|	ПРЕДСТАВЛЕНИЕ(З.Менеджер) КАК МенеджерСтрока,
	|	ПРЕДСТАВЛЕНИЕ(З.Курьер) КАК КурьерСтрока,
	|	ПРЕДСТАВЛЕНИЕ(З.Страхователь) КАК СтраховательСтрока,
	|	ВЫБОР
	|		КОГДА З.НомерДоговора ССЫЛКА Документ.уб_СтраховойПолис
	|			ТОГДА З.НомерДоговора.Номер
	|		КОГДА З.НомерДоговора = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ З.НомерДоговора
	|	КОНЕЦ КАК НомерДоговораСтрока,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(З.СтанцияМетро.Линия), """") КАК СтанцияМетроЛинияСтрока,
	|	ЕСТЬNULL(З.НомерДоговора.Номер, """") КАК НомерДоговораНомер,
	|	NULL КАК Поле1,
	|	ЕСТЬNULL(СЗ.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) КАК ТекущийСтатус,
	|	ЕСТЬNULL(Занятость.Подразделение.Наименование, """") КАК Подразделение,
	|	З.РезультатПроверки КАК РезультатПроверки1,
	|	З.ТребуетсяУтверждениеАндеррайтера КАК ТребуетсяУтверждениеАндеррайтера1,
	|	З.email,
	|	З.СтаршийОператор,
	|	З.Кошелек.НомерКарты,
	|	З.Кошелек.Сотрудник,
	|	З.Кошелек.НомерТелефона
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	|		ПО З.Ссылка = СЗ.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК Занятость
	|		ПО З.Менеджер = Занятость.Агент
	|ГДЕ
	|	З.Ссылка = &Ссылка");
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Не Выборка.Проведен Тогда
			Отказ = Истина;
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Печатать можно только проведенный документ!", "Предупреждение");
		Иначе
			Отказ = Ложь;
			Если Выборка.Тип <> Перечисления.уб_ТипВыезда.Административный Тогда
				
				Если Не ?(ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина,Выборка.РезультатПроверки = Перечисления.уб_РезультатПроверкиЗаявки.ПринятоВРаботу или Выборка.Утверждено,Выборка.Утверждено)=Истина Тогда
					Запрос = Новый Запрос(
					"ВЫБРАТЬ
					|	РП.Подразделение
					|ИЗ
					|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Период, ) КАК РП
					|ГДЕ
					|	РП.Сотрудник = &Сотрудник
					|	И НЕ РП.Уход");
					Запрос.УстановитьПараметр("Период",		Выборка.Дата);
					Запрос.УстановитьПараметр("Сотрудник", 	ПараметрыСеанса.уб_ТекущееФизЛицо);
					Результат = Запрос.Выполнить();
					Если Результат.Пустой() Тогда
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Печатать можно только принятый ОСД или утвержденный документ", "Предупреждение");
						Отказ = ?(Строка(ПараметрыСеанса.ТекущийПользователь)="Трофимова Алена" или Строка(ПараметрыСеанса.ТекущийПользователь)="Трунин Андрей" или Строка(ПараметрыСеанса.ТекущийПользователь)="Губарев Владислав", ЛОЖЬ,ИСТИНА);
					КонецЕсли;
				КонецЕсли;
				//Если Не Отказ Тогда
				//	Отказ = Не РасчетчикЗаполненВТЧ(Выборка);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#Если Клиент Тогда
			Если Не Отказ Тогда
				Если Выборка.ТекущийСтатус = Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании Тогда
					Ответ = Вопрос("По данной заявке уже приняты деньги (перемещение БСО впоследствии не будет создано!). Требуется создать новую заявку.
					|Все равно распечатать заявку?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Приняты деньги!");
					Отказ = Ответ <> КодВозвратаДиалога.Да;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		Если Не Отказ Тогда
			//Вылечили
			//Эрго = Справочники.Контрагенты.НайтиПоНаименованию("ЭРГО Русь");
			//Если ЗначениеЗаполнено(Эрго) Тогда 
			//	Для Каждого СтрокаТЧ Из Выборка.БСО.Выгрузить() Цикл
			//		Если СтрокаТЧ.СК = Эрго Тогда
			//			ПечататьРасчетчики = Ложь;
			//			Прервать;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			
			Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДобавитьЗаявкуВТабличныйДокумент(ТабличныйДокумент,Выборка,ЛОЖЬ,Параметры);
			//Форма = ПолучитьФорму("Форма");
			//Поиск = ?(ПустаяСтрока(Выборка.Город), "", Выборка.Город + " ") + ?(ПустаяСтрока(Выборка.СтанцияМетро), "", "м. " + Выборка.СтанцияМетро + " ") + ?(ПустаяСтрока(Выборка.Адрес), "", СокрЛП(Выборка.Адрес) + " ") + Выборка.МестоВстречи;
			//Поиск = СтрЗаменить(Поиск, Символы.ПС, 	 " ");
			//Поиск = СтрЗаменить(Поиск, Символы.ВК, 	 "");
			//Поиск = СтрЗаменить(Поиск, Символы.ВТаб, "");
			//Поиск = СтрЗаменить(Поиск, Символы.НПП,  "");
			//Поиск = СтрЗаменить(Поиск, Символы.ПФ, 	 "");
			//Поиск = СтрЗаменить(Поиск, Символы.Таб,  "");
			//Форма.Поиск 		= СокрЛП(Поиск);
			//Форма.ВыборкаСсылки = Выборка;
			//Форма.Параметры 	= Параметры;
			//Форма.Открыть();
		КонецЕсли;
	Иначе
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Нет такой ссылки, либо некорректный параметр СсылкаНаОбъект: " + СсылкаНаОбъект + ", тип значения: " + ТипЗнч(СсылкаНаОбъект));
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции // Печать()


Процедура ДобавитьЗаявкуВТабличныйДокумент(ТабДок, Выборка, МакетОтделаБСО = Ложь,Параметры = Неопределено) Экспорт
		
	Ссылка 							= Выборка.Ссылка;
	Тип 							= Выборка.Тип;
	Административный 				= Тип = Перечисления.уб_ТипВыезда.Административный;
	МаркаТС							= Выборка.МаркаТС;
	МаркаТСНаименование				= Выборка.МаркаТСНаименование;
	Менеджер						= Выборка.Менеджер;
	Курьер							= Выборка.Курьер;
	Дата							= Выборка.Дата;
	ОплатитьВКассуЗаВыездКурьера    = Выборка.ОплатитьВКассуЗаВыездКурьера;
	Номер							= Выборка.Номер;
	ВремяВстречи					= Выборка.ВремяВстречи;
	ВремяНачало						= Выборка.ВремяВстречиКлиент;//ВремяНачало;
	ВремяОкончания					= Выборка.ВремяОкончанияКлиент;//ВремяОкончания;
	НомерЗаявки						= Выборка.НомерЗаявки;
	Утверждено						= Выборка.Утверждено;
	СК								= Выборка.СК;
	КонтактноеЛицо					= Выборка.КонтактноеЛицо;
	Самовыезд						= Выборка.Самовыезд;
	Страхователь					= Выборка.Страхователь;
	Контакты						= Выборка.Контакты;
	email						= Выборка.email;
	МестоВстречи					= Выборка.МестоВстречи;
	Банк							= Выборка.Банк;
	БанкНаименование                = Выборка.БанкНаименование;
	СуммаПоКарте					= Выборка.СуммаПоКарте;
	//ВидОплаты						= Выборка.ВидОплаты;
	НомерДок 						= Выборка.Номер;
	БСО								= Выборка.БСО.Выгрузить();
	ЕОСАГО = Выборка.ЕОСАГО;
	БСО.Сортировать("НомерСтроки");
	КоличествоСтрокВДокументе = БСО.Количество();
	НетБСО							= Выборка.НетБСО и Выборка.Количество()=0;
	НетДокументов					= Выборка.НетДокументов;
	//Комментарий						= Выборка.Комментарий;
	//Попытка
	//	Отзыв = ВРЕГ(Ссылка.Отзыв);
	//Исключение
	//	Отзыв = "";
	//КонецПопытки;	
	РассрочкаПлатежа				= Выборка.РассрочкаПлатежа;
	//ВидУчетаСтраховки				= Выборка.ВидУчетаСтраховки;
	МодельТС						= Выборка.МодельТС;
	МодельТСНаименование			= Выборка.МодельТСНаименование;
	Адрес							= Выборка.Адрес;
	ЦельВыезда						= Выборка.ЦельВыезда;
	НеобходимостьОсмотра            = Выборка.НеобходимостьОсмотра;
	Переосмотр						= Тип = Перечисления.уб_ТипВыезда.Переосмотр И ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Параметры, "Переосмотр", Истина);
	НомерДоговора					= Выборка.НомерДоговора;
	НомерЗаявкиСК					= Выборка.НомерЗаявкиСК;
	ВыездОплачиваетсяКлиентом		= Выборка.ВыездОплачиваетсяКлиентом;
	ВознаграждениеКурьера			= Выборка.ВознаграждениеКурьера;
	ВознаграждениеЧастьКлиента      = Выборка.ВознаграждениеЧастьКлиента;
	НомерДоговораНомер				= СокрЛП(Выборка.НомерДоговораНомер);
	//
	ТабДок.Очистить();////!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка_На_Заказ_Выездного_Специалиста";
	ТабДок.ИспользуемоеИмяФайла = "Заявка_На_Заказ_Выездного_Специалиста";
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=0.00";
	Если МакетОтделаБСО Тогда
		Макет = ПолучитьМакет("МакетОтделаБСО");
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Номер 		= Номер;
		Область.Параметры.Дата			= Формат(Дата, "ДФ=dd.MM.yyyy");
		Область.Параметры.ВремяВыезда   = Формат(ВремяНачало, "ДФ=""ЧЧ:мм""") + " - " + Формат(ВремяОкончания, "ДФ=""ЧЧ:мм""");
		Область.Параметры.Тип			= Выборка.ЦельВыезда;
		ТабДок.Вывести(Область);
		МассивТипов5 = Новый Массив;
		МассивТипов5.Добавить("Аддендум ОСАГО");
		МассивТипов5.Добавить("Перепись ОСАГО");
		Область = Макет.ПолучитьОбласть("Середина");
		Область.Параметры.СтанцияМетро 		= Выборка.СтанцияМетроСтрока;
		Область.Параметры.СтанцияМетроЛиния = Выборка.СтанцияМетроЛинияСтрока + ?(ПустаяСтрока(Выборка.СтанцияМетроЛинияСтрока), "", " линия");
		Область.Параметры.Город				= Выборка.Город;
		Область.Параметры.Адрес				= Выборка.Адрес;
		Область.Параметры.Контакты			= Выборка.Контакты;
		Область.Параметры.МестоВстречи		= Выборка.МестоВстречи;
		Область.Параметры.НомерЗаявки		= ?(Выборка.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная, "Рекомендация", Выборка.НомерЗаявки);
		Область.Параметры.Страхователь		= Выборка.СтраховательСтрока;
		//получаем первые попавшиеся данные марки, модели
		МаркаИМодельЗаполнена 	= Ложь;
		РискЗаполнен			= Ложь;
		СтоимостьЗаполнена		= Ложь;
		Для Каждого СтрокаТЧ Из БСО Цикл
			Если Не МаркаИМодельЗаполнена И ЗначениеЗаполнено(СтрокаТЧ.МаркаТС) И ЗначениеЗаполнено(СтрокаТЧ.МодельТС) Тогда
				Область.Параметры.МаркаМодель = Строка(СтрокаТЧ.МаркаТС) + "/" + СтрокаТЧ.МодельТС;
				МаркаИМодельЗаполнена = Истина;
			КонецЕсли;
			Если Не РискЗаполнен И ЗначениеЗаполнено(СтрокаТЧ.ВидСП) Тогда
				Область.Параметры.Риск = СтрокаТЧ.ВидСП.Вид;
				РискЗаполнен = Истина;
			КонецЕсли;
			Если МаркаИМодельЗаполнена И РискЗаполнен И СтоимостьЗаполнена Тогда
				Прервать
			КонецЕсли;
		КонецЦикла;
		//ск лучше не брать из ТЧ, т.к. туда может попасть Купиполис с договорами и карточками.
		Область.Параметры.СК 			= Выборка.СКСтрока;
		Область.Параметры.НомерДоговора = Выборка.НомерДоговораСтрока;
		Попытка
			//Область.Параметры.ФормаОплаты =  Выборка.ФормаОплатыСтрока;	
		Исключение
		КонецПопытки;
		
		
		ТабДок.Вывести(Область);
		Если БСО.Количество() > 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаТаб");
			ТабДок.Вывести(Область);
		КонецЕсли;
		Для Каждого СтрокаТЧ Из БСО Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Валюта						= СтрокаТЧ.Валюта;
			Область.Параметры.Курс							= СтрокаТЧ.Курс;
			Область.Параметры.ЛимитОтветственности 			= Формат(СтрокаТЧ.ЛимитОтветственности, ЧФ);
			Область.Параметры.ИтогСуммаВзноса				= Формат(СтрокаТЧ.СуммаВзноса, ЧФ);
			Область.Параметры.ПредоставленнаяСкидкаПроцент  = СтрокаТЧ.ПредоставленнаяСкидкаПроцент;
			Область.Параметры.ПредоставленнаяСкидкаСумма	= Формат(СтрокаТЧ.ПредоставленнаяСкидка, ЧФ);
			ПолучитьНаРуки = СтрокаТЧ.СуммаВзноса - ?(СтрокаТЧ.ОфициальнаяСкидка,0,СтрокаТЧ.ПредоставленнаяСкидка);
			Область.Параметры.ПолучитьНаРуки = Формат(ПолучитьНаРуки, ЧФ);
			ТабДок.Вывести(Область);
		КонецЦикла;
		Прч = Перечисления.уб_ТипВыезда;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить("Доплата по ошибке");
		МассивТипов.Добавить("Аддендум ОСАГО");
		МассивТипов.Добавить("Перепись ОСАГО");
		Если МассивТипов.Найти(ЦельВыезда) <> Неопределено Тогда
			Область = Макет.ПолучитьОбласть("ОбщееПримечаниеПоОплате");
			ТабДок.Вывести(Область);
		КонецЕсли;
		Область = Макет.ПолучитьОбласть("Контакты");
		//Область.Параметры.Комментарий 	= Комментарий;
		
		
		Область.Параметры.Менеджер		= Выборка.МенеджерСтрока;
		Руководитель = уб_temp.РуководительПодразделенияПоАгенту(Выборка.Менеджер,, "рук");
		Область.Параметры.Руководитель		= Руководитель;
		ТелефонМенеджера = уб_temp.ДайКонтактнуюИнформациюФизлица(Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
		ТелефонМенеджера2 = уб_temp.ДайКонтактнуюИнформациюФизлица(Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаМобильный);
		Если ТелефонМенеджера2 = ТелефонМенеджера Тогда
			ТелефонМенеджера2 ="";
		КонецЕсли;	
		Область.Параметры.ТелефонМенеджера	= ТелефонМенеджера;
		//Область.Параметры.ТелефонМенеджера2	= ТелефонМенеджера2;
		Если ЗначениеЗаполнено(Руководитель) Тогда
			Если Руководитель = Выборка.Менеджер Тогда
				ТелефонРуководителя = ТелефонМенеджера;
			Иначе
				ТелефонРуководителя = уб_temp.ДайКонтактнуюИнформациюФизлица(Руководитель, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
			КонецЕсли;
			Область.Параметры.ТелефонРуководителя = ТелефонРуководителя;
		КонецЕсли;
		ТабДок.Вывести(Область);
		Если МассивТипов5.Найти(Тип) = Неопределено Тогда
			Область = Макет.ПолучитьОбласть("ЧистоеТС");
			ТабДок.Вывести(Область);
		КонецЕсли;
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Руководитель 	= Руководитель;
		Область.Параметры.Менеджер		= Выборка.МенеджерСтрока;
		Если ЗначениеЗаполнено(Выборка.Курьер) И Не Выборка.Самовыезд Тогда
			КурьерСтрока = Выборка.КурьерСтрока
		Иначе
			КурьерСтрока = Выборка.МенеджерСтрока
		КонецЕсли;
		Область.Параметры.Курьер = КурьерСтрока;
		ТабДок.Вывести(Область);
	Иначе
		ЕстьМарка = Не МаркаТС.Пустая();
		//НЕ административный тип выезда
		Макет = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПолучитьМакет("Макет");////!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		ТабДок.Вывести(ПолучитьОбластьШапки(Макет,Выборка));
		ОбластьМакета = Макет.ПолучитьОбласть("ИнфОВыезде");
		ОбластьМакета.Параметры.Тип					= Тип;
		
		//Если Тип = Перечисления.уб_ТипВыезда.Страховка Тогда
		//	//Ингосстрах
		//	ДопКомментарий = ДопКомментарий();
		//Иначе
		//	ДопКомментарий = "";
		//КонецЕсли;	
		//ОбластьМакета.Параметры.Комментарий			= ДопКомментарий+""+Комментарий;
		ОбластьМакета.Параметры.СК					= СК;
		//ОбластьМакета.Параметры.ФормаОплаты =  Выборка.ФормаОплатыСтрока;
		//ОбластьМакета.Параметры.Отзыв 	= Отзыв;
		
		Если Не ПустаяСтрока(НеобходимостьОсмотра) Тогда
			ОбластьМакета.Параметры.НеобходимостьОсмотра			= НеобходимостьОсмотра;
			//ОбластьМакета.Параметры.НадписьНеобходимостьОсмотра	= "Осмотр:";
		КонецЕсли;
		ОбластьМакета.Параметры.НомерДоговора		= НомерДоговораНомер;
		ОбластьМакета.Параметры.Город = Выборка.Город;
		ОбластьМакета.Параметры.Метро = Выборка.СтанцияМетро ;
		//?(ПустаяСтрока(Выборка.Город), "", Выборка.Город + " ") + ?(Выборка.СтанцияМетро = "", "" ,"м. " + Выборка.СтанцияМетро + " ")
		ОбластьМакета.Параметры.МестоВстречи		=?(ПустаяСтрока(Выборка.Адрес), "", СокрЛП(Выборка.Адрес) + " ");
		ОбластьМакета.Параметры.Примечание		= СокрЛП(МестоВстречи);
		ОбластьМакета.Параметры.КонтактныеТелефоны	= Контакты+?(ПустаяСтрока(email),"",", "+email);
		ОбластьМакета.Параметры.ФИОКлиента			= Страхователь;
		ОбластьМакета.Параметры.КонтактноеЛицо		= КонтактноеЛицо;
		//ОбластьМакета.Параметры.НомерЗаявкиВБазе	= НомерЗаявки;
		ОбластьМакета.Параметры.ПериодЗанятости		= "с " + Формат(ВремяНачало, "ДФ=""ЧЧ:мм""") + " по " + Формат(ВремяОкончания, "ДФ=""ЧЧ:мм""");
		ОбластьМакета.Параметры.ДатаВстречи			= Формат(Дата, "ДФ=""дд.ММ.гг""") + "г. " + Формат(ВремяВстречи, "ДФ=""ЧЧ:мм""");
		Если Выборка.ФормаОплаты = Перечисления.уб_ФормыОплаты.НаКарту Тогда
			ПредставлениеНаКарту = "";
			Если ЗначениеЗаполнено(Выборка.КошелекНомерТелефона) Тогда
				ПредставлениеНаКарту = ПредставлениеНаКарту+"На номер: "+Выборка.КошелекНомерТелефона;
			КонецЕсли;	
			Если ЗначениеЗаполнено(Выборка.КошелекНомерКарты) Тогда
				ПредставлениеНаКарту = ПредставлениеНаКарту+?(ПредставлениеНаКарту="",""," ")+"№ карты: "+Выборка.КошелекНомерКарты;
			КонецЕсли;	
			Если ЗначениеЗаполнено(Выборка.КошелекСотрудник) Тогда
				ПредставлениеНаКарту = ПредставлениеНаКарту+?(ПредставлениеНаКарту="",""," ")+"ФИО владельца: "+Выборка.КошелекСотрудник;
			КонецЕсли;	
			ОбластьМакета.Параметры.ПредставлениеНаКарту = ПредставлениеНаКарту;
		КонецЕсли;	
		//Если Не Банк.Пустая() Тогда
		//	ОбластьМакета.Параметры.Банк = "Кредитный банк: " + БанкНаименование;
		//КонецЕсли;
		ТабДок.Вывести(ОбластьМакета);
		_БСО = Выборка.БСО.Выгрузить();
		Если _БСО.Количество()>0 Тогда
			ВыбКарта =_БСО[0].Кошелек;
		Иначе
			ВыбКарта = Неопределено;
		КонецЕсли;	
		Карты = уб_Серверные.Карты(Выборка.Менеджер,ВыбКарта);
		Если НЕ Карты.Количество() = 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаКарты");
			ТабДок.Вывести(ОбластьМакета);
			Для каждого СтрокаКарты из Карты Цикл
				Если СтрокаКарты.Приоритетная Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПриоритетнойКарты");
				Иначе	
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКарты");
				КонецЕсли;	
				Наименование = СтрокаКарты.Наименование;
				Наименование = СтрЗаменить(Наименование,"Карта ","");
				ПозЗапятой = Найти(Наименование,",");
				Если Не ПозЗапятой = 0 Тогда
					ОбластьМакета.Параметры.Банк = Лев(Наименование,ПозЗапятой-1);
					ОбластьМакета.Параметры.НомерКарты = СтрокаКарты.НомерКарты;
					ОбластьМакета.Параметры.Информация = Сред(Наименование,ПозЗапятой+1)+" "+СтрокаКарты.НомерТелефона;
					ТабДок.Вывести(ОбластьМакета);
				Иначе
					Сообщить("В названии карты сотрудника отсутствует запятая "+СтрокаКарты.Наименование +" пропущена");
				КонецЕсли;	
				
			КонецЦикла;	
			
			
		КонецЕсли;	
		
		Если Тип = Перечисления.уб_ТипВыезда.Перепись И (ТипЗнч(НомерДоговора) = Тип("ДокументСсылка.уб_СтраховойПолис") И Не НомерДоговора.Пустая()) Тогда
			СписокБСО = "";
			Для Каждого СтрокаТЧ Из НомерДоговора.БСО Цикл
				Если СтрокаТЧ.Обязательно Тогда
					СписокБСО = СписокБСО + "Вид БСО: " + СтрокаТЧ.ВидБСО + ", номер БСО: " + СтрокаТЧ.НомерБСО + ". ";
				КонецЕсли;
			КонецЦикла;
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	уб_ОплатаПолисов.НомерКвитанции
			|ИЗ
			|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
			|ГДЕ
			|	НЕ уб_ОплатаПолисов.ПометкаУдаления
			|	И уб_ОплатаПолисов.СтраховойПолис = &Полис");
			Запрос.УстановитьПараметр("Полис", НомерДоговора);
			Выб = Запрос.Выполнить().Выбрать();
			Пока Выб.Следующий() Цикл
				СписокБСО = СписокБСО + "Вид БСО: Квитанция А7, номер БСО: " + Выб.НомерКвитанции + ". ";
			КонецЦикла;
			Если СписокБСО <> "" Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПредупреждениеПерепись");
				ОбластьМакета.Параметры.СписокБСО = СписокБСО;
			КонецЕсли;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Не НетБСО Тогда
			Итог = 0;
			Если БСО.Количество() > 0 И Не Переосмотр Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИнфОСП");
				ОбластьМакета.Параметры.СтаршийОператор = Выборка.СтаршийОператор;
				Если ВыездОплачиваетсяКлиентом И Не Самовыезд Тогда
					//ОбластьМакета.Параметры.ВознаграждениеКурьераКлиентом = "К оплате за выезд клиентом:";
					////ОбластьМакета.Параметры.СуммаКОплатеКлиентом = Формат(ВознаграждениеКурьера, "ЧДЦ = 2") + " руб.";
					ОбластьМакета.Параметры.СуммаКОплатеКлиентом = Формат(ВознаграждениеЧастьКлиента, "ЧДЦ = 2") + " руб.";
					
				Иначе
					//ОбластьМакета.Параметры.ВознаграждениеКурьераКлиентом = "";
					ОбластьМакета.Параметры.СуммаКОплатеКлиентом = "";
				КонецЕсли;
				ТабДок.Вывести(ОбластьМакета);
				ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабДок.Вывести(ОбластьШапкиТаблицы);
				ИскатьНомерДоговора = Ложь;
				Слэш = " / ";
				СоответствиеДоговоровИВидовБСО = Новый Соответствие;
				Для Каждого Строка Из БСО Цикл
					Если Не ЗначениеЗаполнено(Строка.ВидБСО) И Строка.СК.Пустая() Тогда
						Продолжить;
					КонецЕсли;
					ТипЗнчВидБСОВидБСО = ТипЗнч(Строка.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО");
					Если ТипЗнчВидБСОВидБСО И Строка.ВидБСО.Тип = Перечисления.уб_ТипыБСО.Карточка Тогда
						ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыКарта");
						ОбластьСтрокаТаблицы.Параметры.СК 				= Строка.СК;
						ОбластьСтрокаТаблицы.Параметры.ВидБСО 			= Строка.ВидБСО;
					Иначе
						ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
						ОбластьСтрокаТаблицы.Параметры.СК 				= Строка.СК;
						ОбластьСтрокаТаблицы.Параметры.ВидБСО 			= Строка.ВидБСО;
						ОбластьСтрокаТаблицы.Параметры.ФормаОплатыСтрока= Строка.ФормаОплатыСтрока;
						
						Договор = уб_Серверные.НомерДоговора(Строка.ВидБСО, Строка.ОрганизацияАгент, Дата);
						ОбластьСтрокаТаблицы.Параметры.Договор = ?(Строка.СК=Строка.Поставщик или ЗначениеЗаполнено(Строка.Поставщик)= Ложь,""," / "+Строка.Поставщик)+""+?(ПустаяСтрока(Договор), "", " / " + Договор);
						Если ТипЗнчВидБСОВидБСО И ИскатьНомерДоговора Тогда
							ВидБСОТип = Строка.ВидБСО.Тип;
							Если ВидБСОТип = Перечисления.уб_ТипыБСО.Полис 
								Или ВидБСОТип = Перечисления.уб_ТипыБСО.ПолисОсаго
								Тогда
								ДобавитьДоговор = Ложь;
								Договор = СоответствиеДоговоровИВидовБСО.Получить(Строка.ВидБСО);
								Если Договор = Неопределено Тогда
									Договор = уб_Серверные.ДоговорПоВидуБСО(Строка.ВидБСО, Дата);
									Если Договор <> "" Тогда
										ДобавитьДоговор = Истина
									КонецЕсли;
									СоответствиеДоговоровИВидовБСО.Вставить(Строка.ВидБСО, Договор);
								Иначе
									ДобавитьДоговор = Истина;
								КонецЕсли;
								Если ДобавитьДоговор Тогда
									ОбластьСтрокаТаблицы.Параметры.Договор = Слэш + Договор
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						ОбластьСтрокаТаблицы.Параметры.Количество		= Строка.Количество;
						//ОбластьСтрокаТаблицы.Параметры.Запасных 		= Строка.ДопКоличество;
						Если Строка.Агрегатная Тогда
							ОбластьСтрокаТаблицы.Параметры.Агрегатная = "Агрегатная";
						КонецЕсли;
						Если Строка.БезубыточныйПереход Тогда
							ОбластьСтрокаТаблицы.Параметры.БезубыточныйПереход = "Без убытка"
						КонецЕсли;
						ВыводимСумму = Истина;
						Если ЕОСАГО = ИСтина Тогда
							_ВидБСО = ВРЕГ(Строка.ВидБСО);
							Если Найти(_ВидБСО,"ЕОСАГО")>0 или Найти(_ВидБСО,"Е-ОСАГО")>0 Тогда
								ВыводимСумму = Ложь;
							КонецЕсли;	
						КонецЕсли;	
						Если ВыводимСумму = Истина Тогда
							ОбластьСтрокаТаблицы.Параметры.СтраховаяПремия 	= Формат(Строка.СтраховаяПремия, "ЧДЦ = 2");
							ИтогСкидка = Строка.ПредоставленнаяСкидка * Строка.Количество;
							ОбластьСтрокаТаблицы.Параметры.ИтогСкидка = Формат(ИтогСкидка, "ЧДЦ = 2");
							ИтогСП = Строка.СуммаВзноса * Строка.Количество;
							ОбластьСтрокаТаблицы.Параметры.ИтогСП = Формат(ИтогСП, "ЧДЦ = 2");
							Итог = Итог + ИтогСП - ?(Строка.ОфициальнаяСкидка,0,ИтогСкидка);
							ОбластьСтрокаТаблицы.Параметры.СтраховаяСумма 		= Формат(Строка.ЛимитОтветственности, "ЧДЦ = 2");
							ОбластьСтрокаТаблицы.Параметры.Франшиза 			= Формат(Строка.Франшиза, "ЧДЦ = 2");
						КонецЕсли;	
						
						//ОбластьСтрокаТаблицы.Параметры.Скидка = Строка.ПредоставленнаяСкидка;
						//ОбластьСтрокаТаблицы.Параметры.ПроцентСкидки = Строка.ПредоставленнаяСкидкаПроцент;
						
						//ОбластьСтрокаТаблицы.Параметры.СуммаВзноса 			= ?(Строка.СтраховаяПремия = Строка.СуммаВзноса, "", Формат(Строка.СуммаВзноса, "ЧДЦ = 2"));
						ОбластьСтрокаТаблицы.Параметры.МаркаТС 				= Строка.МаркаТС;
						ОбластьСтрокаТаблицы.Параметры.МодельТС 			= Строка.МодельТС;
						
					КонецЕсли;					
					ТабДок.Вывести(ОбластьСтрокаТаблицы);
				КонецЦикла;
				Если ВыездОплачиваетсяКлиентом Тогда
					Итог = Итог + ВознаграждениеЧастьКлиента;
				КонецЕсли;
				//Если СуммаПоКарте <> 0 или Выборка.ФормаОплатыСтрока ="Терминал"  Тогда
				//	ОбластьМакета = Макет.ПолучитьОбласть("ПолучитьПоКарте");
				//	ОбластьМакета.Параметры.Итог = Формат(Итог + СуммаПоКарте, ЧФ);
				//	ОбластьМакета.Параметры.СуммаПоКарте = Формат(СуммаПоКарте, ЧФ);
				//	ТабДок.Вывести(ОбластьМакета);
				//Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("ПолучитьНаРуки");
					ОбластьМакета.Параметры.Итог = Формат(Итог, ЧФ);
					ТабДок.Вывести(ОбластьМакета);
				//КонецЕсли;
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			//ОбластьМакета.Параметры.НомерДокумента	= Номер;
			ОбластьМакета.Параметры.ИтогПрописью	= ЧислоПрописью(Итог, "Л = ru_RU", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
			ТабДок.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
			ТабДок.Вывести(ОбластьМакета);
						
			ОбластьМакета = Макет.ПолучитьОбласть("Расписка1");
			ОбластьМакета.Параметры.НомерДокумента	= ?(ПустаяСтрока(НомерЗаявкиСК) Или НомерЗаявкиСК = "<нет>", Номер, Строка(Номер) + " (№ на осмотр '" + НомерЗаявкиСК + "')");
			ТабДок.Вывести(ОбластьМакета);
			//ПЕРЕМЕЩЕНИЕ
			Если ТипЗнч(Параметры) = Тип("Структура") и Параметры.ПечататьАктПеремещения = ЛОЖЬ Тогда
			Иначе	
				Объект = НайтиПеремещение(Ссылка);
				Если ЗначениеЗаполнено(Объект) Тогда
					Объект = Объект.ПолучитьОбъект();
					Контекст 	= уб_ПФ.ИнициализироватьКонтекстПечати();
					Контекст.ТабличныйДокумент = ТабДок;
					Контекст.СсылкаПФ 			= Справочники.уб_ПечатныеФормы.НайтиПоКоду(258);
					Если ЗначениеЗаполнено(Контекст.СсылкаПФ) Тогда
						Контекст.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(Контекст.СсылкаПФ);//Контекст.ОбъектПФ 		= Ссылка.ПолучитьОбъект();
						Контекст.Отладка.Лог 		= Ложь;//Отладка_Лог;
						Контекст.ИмяОбъекта			= Объект.Метаданные().Имя;
						
						ИмяОбъекта = Контекст.ИмяОбъекта;
						Если уб_ПФ.Объект_Печать_степ2(Объект, Контекст, "ПФ" + Контекст.СтруктураОбъектаПФ.Код) Тогда 
							//уб_ПФ.Печать(Контекст, Объект, "ПФ" + Контекст.СтруктураОбъектаПФ.Код);
							Контекст.ТЧДокумента = уб_ПФ.ПолучитьТЗизТЧдляПечати(Контекст);
							
							уб_ПФ.ДобавитьОбщиеПоказателиПечатныхФорм(Контекст);
							уб_ПФ.ПеремещениеБСО_АктКСостоянием(Контекст);
							//уб_ПФ.ПСП(Контекст,"ШапкаАкт");
							//уб_ПФ.ПСП_ПеремещениеБСО(Контекст,"Шапка2Акт");
							уб_ПФ.ПСП_ПеремещениеБСО(Контекст,"ШапкаТаблицыАкт");
							//уб_ПФ.ПСП(Контекст,"ПодвалАкт");
							
							ТабДок.КоличествоЭкземпляров = 1;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//РАСПИСКА
			//Если Не НетДокументов Тогда
			//	ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
			//	ТабДок.Вывести(ОбластьМакета);
			//	
			//	ТабДокОбластьОсмотр = Новый ТабличныйДокумент;
			//	ВывестиОбластьОсмотр(Макет, НомерЗаявки, НомерДок,ТабДокОбластьОсмотр, КоличествоСтрокВДокументе);
			//	
			//	МассивОбластей = Новый Массив;
			//	МассивОбластей.Добавить(ТабДокОбластьОсмотр);
			//	
			//	//При возникновении проблем с получением информации о текущем принтере (например, в системе не установлено ни одного принтера), будет вызвано исключение. 
			//	Попытка
			//		Если Не ТабДок.ПроверитьВывод(МассивОбластей) Тогда
			//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			//		КонецЕсли;
			//	Исключение
			//	КонецПопытки;
			//	ТабДок.Вывести(ТабДокОбластьОсмотр);
			//	
			//	ОбластьМакетаРазделитель = Макет.ПолучитьОбласть("Разделитель");
			//	ОбластьМакетаРасписка = Макет.ПолучитьОбласть("Расписка");
			//	ОбластьМакетаРасписка.Параметры.НомерДокумента	= ?(ПустаяСтрока(НомерЗаявкиСК) Или НомерЗаявкиСК = "<нет>", Номер, Строка(Номер) + " (№ на осмотр '" + НомерЗаявкиСК + "')");
			//	ОбластьМакетаРасписка.Параметры.ИтогПрописью	= ЧислоПрописью(Итог, "Л = ru_RU", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
			//	
			//	МассивОбластей.Добавить(ОбластьМакетаРазделитель);
			//	МассивОбластей.Добавить(ОбластьМакетаРасписка);
			//	МассивОбластей.Добавить(ОбластьМакетаРазделитель);
			//	
			//	Попытка
			//		ВыводитьГоризонтальныйРазделитель = Не ТабДок.ПроверитьВывод(МассивОбластей)
			//	Исключение
			//		ВыводитьГоризонтальныйРазделитель = Ложь
			//	КонецПопытки;
			//	Если ВыводитьГоризонтальныйРазделитель Тогда
			//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			//	Иначе
			//		ТабДок.Вывести(ОбластьМакетаРазделитель);
			//	КонецЕсли;
			//	
			//	ТабДок.Вывести(ОбластьМакетаРасписка);
			//	ТабДок.Вывести(ОбластьМакетаРазделитель);
			//	
			//	ТабДок.Вывести(ТабДокОбластьОсмотр);
			//	//ВывестиОбластьОсмотр(Макет, НомерЗаявки, НомерДок,ТабДок, КоличествоСтрокВДокументе);
			//Иначе
			Если НЕ ТипЗнч(Объект)= Тип("ДокументОбъект.уб_ПеремещениеБСО") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
				ТабДок.Вывести(ОбластьМакета);
			КонецЕсли;
				
			ОбластьМакета = Макет.ПолучитьОбласть("Расписка2");
			ОбластьМакета.Параметры.ИтогПрописью	= ЧислоПрописью(Итог, "Л = ru_RU", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
			
			
			ТабДок.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Расписка3");
			ТабДок.Вывести(ОбластьМакета);
				
			//КонецЕсли;

			Если ТипЗнч(Объект)= Тип("ДокументОбъект.уб_ПеремещениеБСО") Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
				ТабДок.Вывести(ОбластьМакета);
				
						уб_ПФ.ПСП(Контекст,"ШапкаАкт");
						уб_ПФ.ПСП_ПеремещениеБСО(Контекст,"Шапка2Акт");
						уб_ПФ.ПСП_ПеремещениеБСО(Контекст,"ШапкаТаблицыАкт");
						уб_ПФ.ПСП(Контекст,"ПодвалАкт");
			КонецЕсли;	
		Иначе
			//переосмотр
			ОбластьМакета = Макет.ПолучитьОбласть("Осмотр");
			ОбластьМакета.Параметры.НомерЗаявки = НомерЗаявки;
			//ОбластьМакета.Рисунки[0].Текст = "№ " + Строка(НомерЗаявки);
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Не уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ЗапретПечатиЗаявокНаВС, Ложь) Тогда
			ТабДок.Вывод = ИспользованиеВывода.Разрешить;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


Функция НайтиПеремещение(Заявка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ПеремещениеБСОБСО.Ссылка
	               |ИЗ
	               |	Документ.уб_ПеремещениеБСО.БСО КАК уб_ПеремещениеБСОБСО
	               |ГДЕ
	               |	уб_ПеремещениеБСОБСО.Подтверждено = ИСТИНА
	               |	И уб_ПеремещениеБСОБСО.Ссылка.СозданНаОсновании = &Заявка
	               |	И уб_ПеремещениеБСОБСО.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Заявка",Заявка);
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Документы.уб_ПеремещениеБСО.ПустаяСсылка();
КонецФункции	


Функция ПолучитьОбластьШапки(Макет,ВыборкаСсылки) Экспорт

	Менеджер 	  = ВыборкаСсылки.Менеджер;
	Курьер		  = ВыборкаСсылки.Курьер;
	НомерЗаявкиСК = ВыборкаСсылки.НомерЗаявкиСК;
	Макет = ПолучитьМакет("Макет");
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=0.00";
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ФИОМенеджера				= Менеджер.Наименование;
	ТелефонМенеджера = уб_temp.ДайКонтактнуюИнформациюФизлица(Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
	ТелефонМенеджера2 = уб_temp.ДайКонтактнуюИнформациюФизлица(Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаМобильный);
	
	Если ТелефонМенеджера2 = ТелефонМенеджера Тогда
		ТелефонМенеджера2 ="";
	КонецЕсли;	
	ОбластьШапка.Параметры.ТелефонМенеджера2	= ТелефонМенеджера2;

	ОбластьШапка.Параметры.ТелефонМенеджера			= ТелефонМенеджера;
	ОбластьШапка.Параметры.ФИОКурьера				= Курьер.Наименование;
	ОбластьШапка.Параметры.ТелефонКурьера			= уб_temp.ДайКонтактнуюИнформациюФизлица(Курьер, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
	Руководитель = уб_temp.РуководительПодразделенияПоАгенту(ВыборкаСсылки.Менеджер,, "рук");
	ОбластьШапка.Параметры.Руководитель		= Руководитель;
	Если ЗначениеЗаполнено(Руководитель) Тогда
		Если Руководитель = ВыборкаСсылки.Менеджер Тогда
			ТелефонРуководителя = ТелефонМенеджера;
		Иначе
			ТелефонРуководителя = уб_temp.ДайКонтактнуюИнформациюФизлица(Руководитель, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
		КонецЕсли;
		ОбластьШапка.Параметры.ТелефонРуководителя = ТелефонРуководителя;
	КонецЕсли;
	//ОбластьШапка.Параметры.ВознаграждениеКурьера	= Формат(ВыборкаСсылки.ОплатитьВКассуЗаВыездКурьера, ЧФ);	
	//ОбластьШапка.Параметры.ВознаграждениеКурьера	= Формат(ВыборкаСсылки.ВознаграждениеКурьера, ЧФ);	
	НомерДляВывода = СокрЛП(Строка(ВыборкаСсылки.Номер));
	Если Не (ПустаяСтрока(НомерЗаявкиСК) Или НомерЗаявкиСК = "<нет>") Тогда
		Если Не ПустаяСтрока(НомерЗаявкиСК) Тогда
			НомерДляВывода = НомерДляВывода + " / " + СокрЛП(НомерЗаявкиСК);
		КонецЕсли;
	КонецЕсли;
	ОбластьШапка.Параметры.НомерДокумента = НомерДляВывода;
	ОбластьШапка.Параметры.Подразделение = ?(ВыборкаСсылки.Подразделение="","","/"+ВыборкаСсылки.Подразделение+"/");
	//ВнешняяКомпонента = уб_ШК.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	//Если Не ВнешняяКомпонента = Неопределено Тогда
	//	ВнешняяКомпонента.АвтоТип = Истина;
	//	ВнешняяКомпонента.АвтоТип = Ложь;
	//	ВнешняяКомпонента.ТипКода = 1; // указан тип EAN13
	//	ВнешняяКомпонента.ВыравниваниеКода = 3;
	//	//ТипКода - число от 0 до 15: 0 - EAN8, 1 - EAN13, 2 - EAN128. Вот полный список типов по порядку:
	//	//EAN8, EAN13, EAN128, Code39, Code128, Code16k, PDF417, Standart (Industrial) 2 of 5, Interleaved 2 of 5, Расширение Code39, Code93, ITF14, RSS14, CodaBar, EAN13 AddOn 2, EAN13 AddOn 5.			
	//	//Кроме типа штрихкода, компонента имеет ряд других свойств, например ВнешняяКомпонента.ОтображатьТекст, ВнешняяКомпонента.РазмерШрифта и прочие, можно посмотреть в свойствах.
	//	ОбластьШапка.Рисунки.Штрихкод.Картинка = уб_ШК.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, "Z" + Формат(ВыборкаСсылки.Номер,"ЧГ="), ОбластьШапка.Рисунки.Штрихкод.Ширина, ОбластьШапка.Рисунки.Штрихкод.Высота);
	//КонецЕсли;
	ОбластьШапка.Параметры.НомерЗаявкиВБазе	= ВыборкаСсылки.НомерЗаявки;
	Возврат ОбластьШапка;

КонецФункции // ПолучитьОбластьШапки()

#КонецОбласти

Функция ПечатьДоговораПоддержки(Параметры,СсылкаНаОбъект) Экспорт

	ТабДокумент = Новый ТабличныйДокумент;	
	Если ТипЗНч(СсылкаНаобъект.НомерЗаявки) = ТИп("ПеречислениеСсылка.уб_ВидыЗаявок") Тогда
		Возврат ТабДокумент
	КонецЕсли;	
	ТабДокумент.Вывод = ИспользованиеВывода.Разрешить;//?(УБ_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ,ПолныеПрава,уб_ДопРольУправлениеПерсоналом"),ИспользованиеВывода.Разрешить,ИспользованиеВывода.Авто);

	Макет = ПолучитьМакет("ДоговорПоддержки");
	ОбластьШапка = Макет.ПолучитьОбласть("все");	
	
	ТекОрганизация = Справочники.Организации.НайтиПоКоду("000000039");
	
	Если Не ТекОрганизация.Пустая() Тогда
		этоИП = ТекОрганизация.ЭтоИндивидуальныйПредприниматель ИЛИ ТекОрганизация.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо;
		ОбластьШапка.Параметры.ИНН			= ?(этоИП,?(ТекОрганизация.ИндивидуальныйПредприниматель.Пустая(),"",ТекОрганизация.ИндивидуальныйПредприниматель.ИНН),ТекОрганизация.ИНН);
		ОбластьШапка.Параметры.ОГРН			= ТекОрганизация.ОГРН;
	Иначе
		Сообщить("Нельзя распечатать договор, т.к. неопределено место работы!");
		Возврат Неопределено;
	КонецЕсли;	
	Кэш = Новый Соответствие;
	СписокПоказателей = Новый Массив;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организации.Ссылка,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Наименование, """") КАК НаименованиеБанка,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Код, """") КАК БИК,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.НомерСчета, """") КАК НомерСчета,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.КоррСчет, """") КАК Кор,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ФактАдресОрганизации,
	|	ЕСТЬNULL(КонтактнаяИнформация2.Представление, """") КАК ЮрАдресОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = Организации.Ссылка)
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация2
	|		ПО (КонтактнаяИнформация2.Объект = Организации.Ссылка)
	|			И (КонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮРАдресОрганизации))
	|ГДЕ
	|	Организации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ТекОрганизация);					  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.Заполнить(Выборка);
	КонецЕсли;		
	//паспортные данные ФЛ
	//ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	//Если ДанныеФизЛица = Неопределено Тогда
	//	#Если Клиент Тогда
	//	Предупреждение("По физическому лицу нет паспортных данных!");
	//	#КонецЕсли
	//	Возврат Неопределено;
	//КонецЕсли;
	//ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	//ТекПаспортФЛ		= "Серия "+ДанныеФизЛица.ДокументСерия + " Номер " + ДанныеФизЛица.ДокументНомер;
	//ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	//ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;
	//КодПодразделения = ДанныеФизЛица.ДокументКодПодразделения;
	//ОбластьШапка.Параметры.НомерДоговора			= Прав(ТекНомерПаспорта, 4);
	//ОбластьШапка.Параметры.ТекДатаПриема 			= Формат(ТекДатаПриема, "ДФ= гг/ММ/дд");
	ОбластьШапка.Параметры.ТекДата 					= Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерВыезда  = Формат(СсылкаНаобъект.Номер,"ЧГ=");
	ОбластьШапка.Параметры.ОрганизацияАгент			= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьШапка.Параметры.ОрганизацияАгентПолно   = ТекОрганизация.НаименованиеПолное;
	
	ТекДата = СсылкаНаобъект.Дата;
	//ОбластьШапка.Параметры.ФИОФизЛицоПолное			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Именительный);
	//ОбластьШапка.Параметры.ФИОФизЛицоКраткое		= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина, Перечисления.Падежи.Именительный);
	//ОбластьШапка.Параметры.ФИОРуководительПолноеРП	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДата, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ФИОРуководительКраткое	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДата, Истина, Перечисления.Падежи.Именительный);	
	ОбластьШапка.Параметры.ФИОКЛИЕНТА = СсылкаНаобъект.Страхователь;
	ОбластьШапка.Параметры.ФИОКЛИЕНТАКраткое = уб_Кэшируемые.ФИОФизлицаСтрокой(СсылкаНаобъект.Страхователь, ТекДата, Истина, Перечисления.Падежи.Именительный);
	НомерКвитанции = "";
	НомерПолиса    = "";
	СК ="";
	Марка  = "";
	Модель = "";
	Vin    = "";
	Название = "Премиальный договор обслуживания клиента по автомобилю VIN ";
	Для каждого Строка из СсылкаНаобъект.БСО Цикл
		
		Если ЗначениеЗаполнено(Строка.vin) Тогда
			Название = Название + Строка.vin;
		Иначе
			Название = Название+ "_______________________";
		КонецЕсли;	
		//Если ЗначениеЗаполнено(Строка.МаркаТС) Тогда
		//	Название = Название+ ?(Название ="",""," ")+СокрЛП(Строка.МаркаТС);
		//КонецЕсли;	
		//Если ЗначениеЗаполнено(Строка.МодельТС) Тогда
		//	Название = Название+ ?(Название ="",""," ")+Строка.МодельТС;
		//КонецЕсли;	
		Прервать;
	КонецЦикла;	
	ОбластьШапка.Параметры.Строка = Название;
	Попытка
		ОбластьШапка.Параметры.НомерПолиса = ?(ПустаяСтрока(НомерПолиса),"_________________________",НомерПолиса);
		ОбластьШапка.Параметры.НомерКвитанции = ?(ПустаяСтрока(НомерКвитанции),"_________________________",НомерКвитанции);
		ОбластьШапка.Параметры.СК = ?(ЗначениеЗаполнено(СК) = ЛОЖь,"_________________________",СК.НаименованиеПолное);
	Исключение
	КонецПопытки;
	
	
	//ОбластьШапка.Параметры.ТекКемВыдан = ТекКемВыдан;
	//ОбластьШапка.Параметры.ТекПаспортФЛ = ТекПаспортФЛ;
	//ОбластьШапка.Параметры.КодПодразделения = КодПодразделения;	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КонтактнаяИнформация.Объект,
	//|	КонтактнаяИнформация.Тип,
	//|	КонтактнаяИнформация.Вид,
	//|	КонтактнаяИнформация.Представление
	//|ИЗ
	//|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ГДЕ
	//|	КонтактнаяИнформация.Объект = &Объект";
	//Запрос.УстановитьПараметр("Объект", Ссылка);
	//Результат = Запрос.Выполнить();
	//ТЗ = Результат.Выгрузить();
	//ТекАдресРегистрацииФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке ,"Вид");
	//ТекФактАдресФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания ,"Вид");
	//Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
	//	ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекАдресРегистрацииФЛ.Представление;
	//Иначе
	//	Если ТекФактАдресФЛ <> Неопределено Тогда
	//		ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекФактАдресФЛ.Представление;
	//	КонецЕсли;	
	//КонецЕсли;	
	//Если ТекФактАдресФЛ <> Неопределено Тогда
	//	ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекФактАдресФЛ.Представление;
	//Иначе
	//	Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
	//		ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекАдресРегистрацииФЛ.Представление;
	//	КонецЕсли;	
	//КонецЕсли;	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.ПолеСлева = 20;
	ТабДокумент.ПолеСправа = 10;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСверху = 5;
	//ТабДокумент.Показать("Соглашение о неразглашении");
	
	//Режим = РежимДиалогаВыбораФайла.Сохранение;
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	//ДиалогОткрытияФайла.ПолноеИмяФайла = "Договор "+Формат(СсылкаНаобъект.Номер,"ЧГ=")+" для "+уб_Кэшируемые.ФИОФизлицаСтрокой(СсылкаНаобъект.Страхователь, ТекДата, Истина, Перечисления.Падежи.Родительный);
	//Фильтр = НСтр("ru = 'PDF'; en = 'PDF'")
	//+ "(*.PDF)|*.PDF";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	//ДиалогОткрытияФайла.МножественныйВыбор = ЛОЖЬ;
	//ДиалогОткрытияФайла.Заголовок = "Сохранить файл или показать?";
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	ТабДокумент.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	//Иначе
		Возврат ТабДокумент;
//	КонецЕсли;
	

КонецФункции // Печать()



Функция ЕстьПриемкиПоЗаявке(Ссылка) Экспорт
	Результат = Новый СписокЗначений;
	Если Не Ссылка.Пустая() Тогда
		//добавлен поиск приемок без табличных частей, но с оплатой за выезд клиентом с заявкой в шапке
		Запрос = Новый Запрос;
		СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
		Если СистемаТЧПлатежи Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	П.Ссылка
			|ИЗ
			|	Документ.уб_ПриемкаОплат.Полисы КАК П
			|ГДЕ
			|	П.Заявка = &Ссылка
			|	И НЕ П.Ссылка.ПометкаУдаления";
			//|
			//|ОБЪЕДИНИТЬ
			//|
			//|ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	П.Ссылка
			//|ИЗ
			//|	Документ.уб_ПриемкаОплат.Платежи КАК П
			//|ГДЕ
			//|	П.Заявка = &Ссылка
			//|	И НЕ П.Ссылка.ПометкаУдаления"
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	П.Ссылка
			|ИЗ
			|	Документ.уб_ПриемкаОплат.Полисы КАК П
			|ГДЕ
			|	П.Заявка = &Ссылка
			|	И НЕ П.Ссылка.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	П.Ссылка
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК П
			|ГДЕ
			|	П.Заявка = &Ссылка
			|	И НЕ П.ПометкаУдаления";
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезЗапроса = Запрос.Выполнить();
		Если РезЗапроса.Пустой() = ЛОЖЬ Тогда
			Результат.ЗагрузитьЗначения(РезЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;
	Результат = Результат.Количество() > 0;
	Возврат Результат;

КонецФункции // ДоступКИзменениюПриНаличииПриемки()
