
Перем мВалютаРегламентированногоУчета Экспорт;
Перем ПоказателиРасчетаЗП Экспорт;
Перем ПроцентПроверкиКАСКО Экспорт;
Перем ПодразделениеЗаявки Экспорт;

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	ТабПФ = уб_ПФ.ПустаяТЗСтруктурыПФ();
	СтрТабПФ = ТабПФ.Добавить();
	СтрТабПФ.КодПФ			= "Макет";
	СтрТабПФ.Наименование	= "Заявка";
	СтрТабПФ.ПоУмолчанию = Истина;
	СтрТабПФ.Действовала = Ложь;
	Возврат ТабПФ;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура обработчик события ПередЗаписью документа
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Если Час(Дата)<8 и Час(Дата)>22 Тогда
		Отказ = Истина;
		Сообщить("Проверьте дату встречи");
	КонецЕсли;	
	СинхронизацияДатыВремени();
	//выборка ссылки
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	З.Дата,
	|	З.ВознаграждениеКурьера,
	|	З.Утверждено,
	|	З.Курьер,
	|	З.Менеджер,
	|	З.ПометкаУдаления,
	|	З.Ссылка,
	|	З.Каско,
	|	З.Осаго,
	|	З.НС,
	|	З.ДМС,
	|	З.ДК,
	|	З.Утверждено КАК Утверждено1,
	|	З.ТипВыезда,
	|	З.Номер,
	|	З.Контакты,
	|	З.Курьер.Код как КурьерКод
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
	|ГДЕ
	|	З.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаСсылки = Запрос.Выполнить().Выбрать();
	ВыборкаСсылки.Следующий();
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТребуетсяПроверка(ЭтотОбъект) Тогда
		#Если Клиент Тогда
			//Если ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина Тогда
			//	Предупреждение("Для проведения требуется проверка отделом сопровождения договоров");// Документ будет записан, но не проведен");
			//Иначе	
			//	Предупреждение("Для проведения требуется проверка руководителем/андеррайтером.");// Документ будет записан, но не проведен");
			//КонецЕсли;	
		#КонецЕсли
		//отключил, так как не обращают внимание на сообщение и пропадает из графика
		//РежимЗаписи = ?(Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
	ИначеЕсли (РежимЗаписи = РежимЗаписиДокумента.Запись Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) И Утверждено Тогда
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Утвержденные заявки должны быть проведены. Документ будет проведен");
		РежимЗаписи = ?(Не Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	КонецЕсли;
	_Модифицированность = Модифицированность() Или Не уб_СС.СоответствиеРежимаЗаписиСостояниюСсылки(Ссылка, РежимЗаписи);
	ДополнительныеСвойства.Вставить("Модифицированность", _Модифицированность);
	ДополнительныеСвойства.Вставить("Курьер", ВыборкаСсылки.Курьер);
	ДополнительныеСвойства.Вставить("КурьерКод", ВыборкаСсылки.КурьерКод);
	//удаляем пустые строчки
	
	
	Для Каждого СтрокаТЧ Из БСО Цикл
		Если Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСтрокаЗВС(СтрокаТЧ) Тогда
			БСО.Удалить(БСО.Индекс(СтрокаТЧ))
		КонецЕсли;
		
	КонецЦикла;
	//Проверка изменения значимых реквизитов
	#Если Клиент Тогда
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ИтогСтраховаяПремия",БСО.Итог("ИтогСтраховаяПремия"));
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ИтогПредоставленнаяСкидка",БСО.Итог("ИтогПредоставленнаяСкидка"));
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ИтогСуммаВзноса",БСО.Итог("ИтогСуммаВзноса"));
	#Иначе		
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ИтогСтраховаяПремия",БСО.Итог("ИтогСтраховаяПремия"));
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ИтогПредоставленнаяСкидка",БСО.Итог("ИтогПредоставленнаяСкидка"));
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ИтогСуммаВзноса",БСО.Итог("ИтогСуммаВзноса"));
	#КонецЕсли
	МассивПериодов = Новый Массив;
	ЗарплатныйПериод = НачалоМесяца(Дата);
	//TODO!
	//затираем значение номера до 0, если тип выезда административный, даже если был заполнен
	//Если Тип = Перечисления.уб_ТипВыезда.Административный Тогда
	//	УстановитьЗначение(НомерЗаявки, 0)
	//КонецЕсли;
	
	Если Утверждено <> ВыборкаСсылки.Утверждено ИЛИ (Курьер<>ВыборкаСсылки.Курьер и Самовыезд=Ложь) Тогда
		МассивПериодов.Добавить(ЗарплатныйПериод);
		ПроверкаПодготовкаСМС2017(ВыборкаСсылки);	
	Иначе	
		Если Утверждено Тогда
			//Подтверждена
			//проверяем реквизиты
			Если ЗарплатныйПериод <> НачалоМесяца(ВыборкаСсылки.Дата) Тогда
				МассивПериодов.Добавить(ЗарплатныйПериод);
				МассивПериодов.Добавить(НачалоМесяца(ВыборкаСсылки.Дата));				
			ИначеЕсли ВознаграждениеКурьера <> ВыборкаСсылки.ВознаграждениеКурьера Тогда
				МассивПериодов.Добавить(ЗарплатныйПериод);
			ИначеЕсли Курьер <> ВыборкаСсылки.Курьер Тогда
				МассивПериодов.Добавить(ЗарплатныйПериод);
			ИначеЕсли Менеджер <> ВыборкаСсылки.Менеджер Тогда
				МассивПериодов.Добавить(ЗарплатныйПериод);				
			Иначе
				//Проверка на изменение проведения
				Если Проведен Тогда
					//
					Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
						МассивПериодов.Добавить(ЗарплатныйПериод);
					ИначеЕсли ПометкаУдаления <> ВыборкаСсылки.ПометкаУдаления Тогда	
						МассивПериодов.Добавить(ЗарплатныйПериод);
					КонецЕсли;
				Иначе
					Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
						МассивПериодов.Добавить(ЗарплатныйПериод);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;	
	
	Если Утверждено = Истина и УтвержденоДата = Дата(1,1,1) Тогда
		УтвержденоДата = ТекущаяДата();	
	КонецЕсли;

	Попытка
		Для СчетчикПериодов = 0 по МассивПериодов.Количество()-1 Цикл
			ДатаНеактуальности = МассивПериодов[СчетчикПериодов];
			//ТЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(,Новый Структура("РасчетныйПериод",ДатаНеактуальности));
			//Если ТЗ.Количество() = 0 Тогда
			//Иначе
			//	Если Не ТЗ[0].Актуален Тогда
			//		Продолжить;
			//	КонецЕсли
			//КонецЕсли;
			Если уб_РасчетыСменеджерами.ЗарплатныйПериодАктуален(ДатаНеактуальности,Новый Структура("Актуален,Объект",Ложь,Ссылка)) = Ложь Тогда
				Продолжить;
			КонецЕсли;	
			////Если актуален или не задан делаем неактуальным
			//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
			//МЗ.Актуален = Ложь;
			//МЗ.РасчетныйПериод = ДатаНеактуальности;
			//МЗ.Период = ТекущаяДата();
			//МЗ.Объект = Ссылка;
			//Попытка
			//	МЗ.Записать();
			//Исключение
			//	//
			//	#Если клиент  Тогда 
			//		Сообщить("Ошибка регистрации неактуальности периода расчета ЗП");
			//	#КонецЕсли
			//КонецПопытки;
		КонецЦикла;	
	Исключение
	КонецПопытки;
	
	//Операторы+
	пФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	СтрОператор = "";
	мОператоры = Новый Массив;
	Для Каждого СтрокаТЧ  Из БСО  Цикл
		
		Если СтрокаТЧ.Оператор<>пФизлицо и мОператоры.Найти(СтрокаТЧ.Оператор)=Неопределено Тогда
			//
			СтрОператор = СтрОператор +?(СтрОператор="","",", ")+ уб_Кэшируемые.ФИОФизлицаСтрокой(СтрокаТЧ.Оператор);
			
			мОператоры.Добавить(СтрокаТЧ.Оператор);			
		КонецЕсли;		
	КонецЦикла;
	
	СтрОператор = Лев(СтрОператор,99);
	Если Не СтрОператор = Оператор Тогда
		Оператор = СтрОператор;
	КонецЕсли;
	
	СтрСостояния ="";
	пСостояние = Перечисления.уб_СостояниеОформления.ПустаяСсылка();
	мСостояние = Новый Массив;
	
	ПолисЗаведен = Истина;
	ВсегоКорней = 0;
	ВсегоЗаведено =0;
	Для Каждого СтрокаТЧ  Из БСО  Цикл
		
		Если СтрокаТЧ.Состояние<>пСостояние и мСостояние.Найти(СтрокаТЧ.Состояние)=Неопределено Тогда
			//
			СтрСостояния = СтрСостояния +?(СтрСостояния="","",", ")+ СтрокаТЧ.Состояние;
			
			мСостояние.Добавить(СтрокаТЧ.Состояние);			
		КонецЕсли;		
		
		Если СтрокаТЧ.УидРодителя="" или СтрокаТЧ.УидРодителя = СтрокаТЧ.УидСтроки Тогда
			ВсегоКорней = ВсегоКорней+1;
			Если //СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.ВозвратНаДоработку
				//или 
				СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.Отказ
				или СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.ПустаяСсылка()
				или СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.НаОформлении
				
				Тогда
				
				ПолисЗаведен = Ложь;
			Иначе
				ВсегоЗаведено = ВсегоЗаведено+1;
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
			Если СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.Печать  Тогда
				Если ПустаяСтрока(СтрокаТЧ.НомерБСО) Тогда
					
					Если Не ДополнительныеСвойства.Свойство("Допроведение") Тогда 
						Отказ = Истина;
						#Если Клиент Тогда
							Сообщить("В строке "+СтрокаТЧ.НомерСтроки +" не внесен номер полиса");
						#КонецЕсли
					КонецЕсли;	
				Иначе	
					
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	
		Если НЕ уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
			врег = Врег(СтрокаТЧ.ВидБСО);
			Если (Найти(врег,"ОСАГО")>0 или Найти(врег,"КАСКО")>0) 
				и (СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.КомплектОформлен или СтрокаТЧ.Состояние = Перечисления.уб_СостояниеОформления.Печать) Тогда	
				Если ПустаяСтрока(СтрокаТЧ.Vin) Тогда
					
					Если Не ДополнительныеСвойства.Свойство("Допроведение") Тогда 
					Отказ = Истина;
					#Если Клиент Тогда
						Сообщить("В строке "+СтрокаТЧ.НомерСтроки +" не внесен vin");
					#КонецЕсли
					КонецЕсли;
				Иначе	
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	
	КонецЦикла;
	ПроцентГотовности = ?(ВсегоКорней=0,100,Окр(ВсегоЗаведено*100/ВсегоКорней,2));
	ДополнительныеСвойства.Вставить("ПолисЗаведен",ПолисЗаведен);
	
	СтрСостояния = Лев(СтрСостояния,150);
	Если Не СтрСостояния = Состояния Тогда
		Состояния = СтрСостояния;
	КонецЕсли;
	
	//Операторы-
	
	Если Не Отказ Тогда		
		Если ЭтоНовый() Тогда 
			УстановитьНовыйНомер()
		КонецЕсли;
		#Если Клиент Тогда
			Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ПредставлениеЗаявки", "№ " + СтрЗаменить(Номер, Символ(160), "") + " (" + СтрЗаменить(НомерЗаявки, Символ(160), "") + ")" + " от " + Формат(Дата, "ДФ=dd.MM.yy"));
		#Иначе	
			Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ПредставлениеЗаявки", "№ " + СтрЗаменить(Номер, Символ(160), "") + " (" + СтрЗаменить(НомерЗаявки, Символ(160), "") + ")" + " от " + Формат(Дата, "ДФ=dd.MM.yy"));
		#КонецЕсли
		//чкн
		//Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда	
		//	Возврат;
		//КонецЕсли;
		//чкн
		// заполнение регистра файлы к полисам
		//ТЗ = Новый ТаблицаЗначений;
		//ТЗ.Колонки.Добавить("ИмяФайла",		Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
		//ТЗ.Колонки.Добавить("ВидДокумента", Новый ОписаниеТипов("СправочникСсылка.уб_ВидыДокументовКПолисам"));
		//ТЗ.Колонки.Добавить("НомерСтроки",	Новый ОписаниеТипов("Число"));
		//СоответствиеВидовДокументовИмениПоля = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СоответствиеВидовДокументовИмениПоля();
		//Для Каждого СтрокаТЧ Из БСО Цикл
		//	Если Не ПустаяСтрока(СтрокаТЧ.Расчетчик) Тогда
		//		СтрокаТЗ = ТЗ.Добавить();
		//		СтрокаТЗ.ИмяФайла			= СтрокаТЧ.Расчетчик;
		//		СтрокаТЗ.ВидДокумента   	= Справочники.уб_ВидыДокументовКПолисам.РасчетныйЛист;
		//		СтрокаТЗ.НомерСтроки		= СтрокаТЧ.НомерСтроки;
		//	КонецЕсли;
		//	Если Не ПустаяСтрока(СтрокаТЧ.ДопСоглашение) Тогда
		//		СтрокаТЗ = ТЗ.Добавить();
		//		СтрокаТЗ.ИмяФайла			= СтрокаТЧ.ДопСоглашение;
		//		СтрокаТЗ.ВидДокумента   	= Справочники.уб_ВидыДокументовКПолисам.ДопСоглашение;
		//		СтрокаТЗ.НомерСтроки		= СтрокаТЧ.НомерСтроки;
		//	КонецЕсли;
		//	Если Не ПустаяСтрока(СтрокаТЧ.ДругиеДокументы) Тогда
		//		СтрокаТЗ = ТЗ.Добавить();
		//		СтрокаТЗ.ИмяФайла			= СтрокаТЧ.ДругиеДокументы;
		//		СтрокаТЗ.ВидДокумента   	= Справочники.уб_ВидыДокументовКПолисам.Прочее;
		//		СтрокаТЗ.НомерСтроки		= СтрокаТЧ.НомерСтроки;
		//	КонецЕсли;
		//КонецЦикла;
		//Запрос = Новый Запрос(
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	Источник.ИмяФайла КАК ИмяФайла,
		//|	Источник.ВидДокумента КАК ВидДокумента,
		//|	Источник.НомерСтроки КАК НомерСтроки
		//|ПОМЕСТИТЬ ВТ_Источник
		//|ИЗ
		//|	&Источник КАК Источник
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Источник.ИмяФайла КАК ИмяФайла,
		//|	ВТ_Источник.ВидДокумента КАК ВидДокумента,
		//|	ВТ_Источник.НомерСтроки КАК НомерСтроки
		//|ИЗ
		//|	ВТ_Источник КАК ВТ_Источник
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф
		//|		ПО ВТ_Источник.ИмяФайла = Ф.УИД
		//|ГДЕ
		//|	Ф.УИД ЕСТЬ NULL ");
		//Запрос.УстановитьПараметр("Источник", ТЗ);
		//РезультатЗапроса = Запрос.Выполнить();
		//Если Не РезультатЗапроса.Пустой() Тогда
		//	Хранилище 		= Справочники.уб_ХранилищаФайловБ2Б.ФайлыКЗаявкам;
		//	ХранилищеПуть 	= Хранилище.Путь;
		//	ТекущаяДата		= ТекущаяДата();
		//	Выборка = РезультатЗапроса.Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		НачатьТранзакцию();
		//		УИД = Новый УникальныйИдентификатор;
		//		СтрокаТЧ = БСО[Выборка.НомерСтроки - 1];
		//		Запись = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
		//		// измерения
		//		Запись.СтраховойПолис 	= ?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка);
		//		Запись.УИД				= УИД;
		//		Запись.СК				= СтрокаТЧ.СК;
		//		Запись.ВидБСО			= СтрокаТЧ.ВидБСО;
		//		Запись.НомерБСО			= "";
		//		// ресурсы
		//		Запись.ПутьКПапке		= "";
		//		Запись.ДеньПолиса		= День(Дата);
		//		Запись.Хранилище		= Хранилище;
		//		Запись.ВидДокумента		= Выборка.ВидДокумента;
		//		Запись.Размещен			= Ложь;
		//		Запись.Обработан		= Ложь;
		//		ПолноеИмяФайла = уб_СЛ.ПроверитьИмяКаталога(ХранилищеПуть) + Выборка.ИмяФайла;
		//		Файл = Новый Файл(ПолноеИмяФайла);
		//		Если Файл.Существует() И Файл.ЭтоФайл() Тогда
		//			Запись.ФайлРазмер = Файл.Размер();
		//		КонецЕсли;
		//		Запись.ФайлРасширение   = СтрЗаменить(Файл.Расширение, ".", "");
		//		Запись.ФайлИмя			= Файл.Имя;
		//		// реквизиты
		//		Запись.Страхователь		= Страхователь;
		//		Запись.Агент			= Менеджер;
		//		Запись.МодельТС			= СтрокаТЧ.МодельТС;
		//		Запись.Курьер			= Курьер;
		//		Запись.ВидФайлаB2B		= Перечисления.уб_ВидыФайловB2B.БСО_ДОК;
		//		Запись.Автор			= ПараметрыСеанса.ТекущийПользователь;
		//		Запись.ДатаПубликации	= ТекущаяДата;
		//		Успешно = Истина;
		//		Попытка
		//			Запись.Записать();
		//		Исключение
		//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка записи файлов заявки в регистр файлов к полисам. Описание ошибки: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина); 
		//			Успешно = Ложь;
		//		КонецПопытки;
		//		Если Успешно Тогда
		//			ИмяРеквизита = СоответствиеВидовДокументовИмениПоля.Получить(Выборка.ВидДокумента);
		//			Если ИмяРеквизита = Неопределено Тогда
		//				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка записи файлов заявки в регистр файлов к полисам. Пустое соответствие", ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		//				Успешно = Ложь;
		//			КонецЕсли;
		//			Если Успешно Тогда
		//				СтрокаТЧ[ИмяРеквизита] = УИД;
		//			КонецЕсли;
		//		КонецЕсли;
		//		Если Успешно Тогда
		//			ЗафиксироватьТранзакцию();
		//		Иначе
		//			ОтменитьТранзакцию();
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
	КонецЕсли;
	
	//++Расчеты
	ЗарегистрироватьРасчеты();
	//--Расчеты	
	
	Если Самовыезд = Истина Тогда
		_СВС = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	Иначе
		ПараметрыСВС = уб_РасчетыСМенеджерами.ПараметрыСВС(Курьер,КонецДня(Дата));
		_СВС = ПараметрыСВС.СВС;
		Если ЗначениеЗаполнено(_СВС) = Ложь Тогда
			_СВС = ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС;
		КонецЕсли;	
	КонецЕсли;	
	#Если Клиент Тогда
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"СВС",_СВС);
	#Иначе	
		уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"СВС",_СВС);
	#КонецЕсли
	
	
	Если Тип = Перечисления.уб_ТипВыезда.Административный или
		Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр 
		Тогда
		Если ЗначениеЗаполнено(РезультатПроверки) = Ложь Тогда
			РезультатПроверки = перечисления.уб_РезультатПроверкиЗаявки.ПринятоВРаботу;
			УтвердилАндеррайтер = ПараметрыСеанса.уб_ТекущееФизЛицо;
			Утверждено = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//уб_temp.ОпределитьСтатуcЗаявкиИЗаписатьВРегистр(Ссылка);
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	//++Движение статусов заявок
	
	Если ДополнительныеСвойства.Свойство("НеОповещатьСтатусы") и ДополнительныеСвойства.НеОповещатьСтатусы = Истина Тогда
		Оповещать  = Ложь;
	Иначе
		Оповещать  = Истина;
	КонецЕсли;
	
	
	СИспользованиемОтделаДоговоров = ТекущаяДата()>Дата(2017,10,1);
	ПолисЗаведен = ДополнительныеСвойства.Свойство("ПолисЗаведен") и ДополнительныеСвойства.ПолисЗаведен = Истина;
	
	ТекСтатус = уб_УСЗ.ВернутьСтатусЗаявки(Ссылка, ТекущаяДата());
	
	
	МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Ссылка;
	МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
	МенеджерЗаписи.Параметр   = ""+ТекСтатус;
	МенеджерЗаписи.Записать();
	
	Действие = Неопределено;
	Если Тип = Перечисления.уб_ТипВыезда.Административный  Тогда
		Если ПометкаУдаления Тогда
			Действие = "УстановитьСтатус_ЗапросНаУдаление";
		ИначеЕсли ТекСтатус.Пустая() Тогда
			СтрокаРеквизитов = "";
			Действие = "УстановитьСтатус_СогласованиеСКлиентом";
		//Иначе	
		//	СтрокаРеквизитов = "";
		//	Действие = "УстановитьСтатус_НазначениеКурьера";
		КонецЕсли;	
	Иначе	
		
		СтрокаРеквизитов = Неопределено;
		Если ПометкаУдаления Тогда
			Действие = "УстановитьСтатус_ЗапросНаУдаление";
		ИначеЕсли ТекСтатус.Пустая() Тогда
			//Запись без отправки
			СтрокаРеквизитов = "";
			Действие = "УстановитьСтатус_СогласованиеСКлиентом";
			Пустой = Справочники.ФизическиеЛица.ПустойАгент;
			Если не Курьер = Пустой Тогда
				Курьер = Пустой;
			КонецЕсли;	
		ИначеЕсли Тип = Перечисления.уб_ТипВыезда.Административный и Проведен Тогда
			
			Действие = "УстановитьСтатус_НазначениеКурьера";
		ИначеЕсли (ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО)  Тогда
			ВозможнаПечать = Ложь;
			//ВозможнаПечать = Истина;
			//
			//Для каждого СтрокаБСО  из БСО Цикл
			//	
			//	Если СтрокаБСО.УидРодителя = "" ИЛИ СтрокаБСО.УидРодителя = СтрокаБСО.УидСтроки Тогда
			//		//Корень
			//		Если СтрокаБСО.Состояние <> Перечисления.уб_СостояниеОформления.Печать и СтрокаБСО.Состояние <> Перечисления.уб_СостояниеОформления.Отказ Тогда
			//			ВозможнаПечать = Ложь;
			//			//Сообщить("Неподходящее состояние для печати "+СтрокаБСО.Состояние + " в строке "+СтрокаБСО.ВидБСО+"("+СтрокаБСО.УидСтроки+")");
			//		КонецЕсли;	
			//	КонецЕсли;	
			//	
			//КОнецЦикла;	
			
			Если ТребуетсяУтверждениеАндеррайтера и
				(РезультатПроверки = Перечисления.уб_РезультатПроверкиЗаявки.Отклонено
				//сам на себя
				//или
				//(ПараметрыСеанса.уб_ТекущееФизЛицо = Менеджер и не ЗначениеЗаполнено(РезультатПроверки))
				) 
				Тогда
				Действие = "УстановитьСтатус_СогласованиеСКлиентом_Доработка";
			//ИначеЕсли ВозможнаПечать Тогда
			//	Действие = "УстановитьСтатус_ЗаявкаВПечати";
			Иначе
				Действие = Неопределено;	
			КонецЕсли;	
		//Выполняется по кнопке в форме
		//ИначеЕсли 
		//	//(ТекСтатус = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера 
		//	//или ТекСтатус = Перечисления.уб_СтатусыЗаявок.КомплектДокументацииПодготовлен
		//	//или ТекСтатус = Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера
		//	//или ТекСтатус = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати
		//	//или ТекСтатус = Перечисления.уб_СтатусыЗаявок.КурьерНаВыезде)
		//	 (Утверждено=ЛОЖЬ ИЛИ ТребуетсяУтверждениеАндеррайтера и не ЗначениеЗаполнено(РезультатПроверки) или РезультатПроверки = Перечисления.уб_РезультатПроверкиЗаявки.Отклонено) Тогда	
		//	Действие = "УстановитьСтатус_ФормированиеКомплектаБСО";
		//ИначеЕсли Утверждено Тогда
		//	Действие = "УстановитьСтатус_НазначениеКурьера";
		Иначе
			//Очередь статуса
			IDКурьера = Курьер.Код;
			ЭтоПустой = Самовыезд = Ложь и (IDКурьера="000081966" или IDКурьера="000081967" или IDКурьера="000081969" или IDКурьера="000081970" или IDКурьера="000000000"); //или IDКурьера="000081966"
			
			IDКурьера = ?(ЭтоНовый(),"000081966",ДополнительныеСвойства.КурьерКод);
			БылПустой = Самовыезд = Ложь и (IDКурьера="000081966" или IDКурьера="000081967" или IDКурьера="000081969" или IDКурьера="000081970"
			или IDКурьера="000000000"); //или IDКурьера="000081966"
			
			УстановитьПривилегированныйРежим(Истина);
			Если Самовыезд = Ложь //и (БылПустой или ) 
				и ЭтоПустой = Ложь Тогда
				Если //ТекСтатус = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати
					//или 
					ТекСтатус = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера
					Тогда
					МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = Ссылка;
					МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДвижениеСтатусов;
					МенеджерЗаписи.Параметр   = "УстановитьСтатус_БСОНаРукахУКурьера";
					МенеджерЗаписи.Записать();
				ИначеЕсли ТекСтатус = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати Тогда
					//МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Ссылка,Истина);
					//ВсегоПеремещений = МассивПеремещений.Количество();
					//Для Счетчик = 1 по ВсегоПеремещений Цикл
					//	СсылкаПеремещения = МассивПеремещений[Счетчик - 1];
					//	Если Не СсылкаПеремещения.Проведен Тогда
					//		Об = СсылкаПеремещения.ПолучитьОбъект();
					//		Попытка
					//			Об.Записать(РежимЗаписиДокумента.Проведение);
					//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Проведено перемещение: " + СсылкаПеремещения);
					//		Исключение
					//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка проведения перемещения " + уб_УСЗ.РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
					//			ФлЕстьОшибки = Истина;
					//			Прервать;
					//		КонецПопытки;	
					//	КонецЕсли;	
					//КонецЦикла;	
				ИначеЕсли ТекСтатус = Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера Тогда
					//МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Ссылка,Истина);
					//ВсегоПеремещений = МассивПеремещений.Количество();
					//Для Счетчик = 1 по ВсегоПеремещений Цикл
					//	СсылкаПеремещения = МассивПеремещений[Счетчик - 1];
					//	Если Не СсылкаПеремещения.Проведен или (НЕ ЭтоПустой и СсылкаПеремещения.АгентКуда<>Курьер) Тогда
					//		Об = СсылкаПеремещения.ПолучитьОбъект();
					//		Если НЕ ЭтоПустой Тогда
					//			Если Об.АгентКуда<>Курьер Тогда
					//				Об.АгентКуда=Курьер;
					//			КонецЕсли;	
					//		КонецЕсли;	
					//		Попытка
					//			Об.Записать(РежимЗаписиДокумента.Проведение);
					//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Проведено перемещение: " + СсылкаПеремещения);
					//		Исключение
					//			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка проведения перемещения " + уб_УСЗ.РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
					//			ФлЕстьОшибки = Истина;
					//			Прервать;
					//		КонецПопытки;	
					//	КонецЕсли;	
					//КонецЦикла;	
				КонецЕсли;
				//МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
				//МенеджерЗаписи.Объект = Ссылка;
				//МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
				//МенеджерЗаписи.Параметр   = ""+ТекСтатус;
				//МенеджерЗаписи.Записать();
			//ИначеЕсли (БылПустой = Ложь и ЭтоПустой = Истина) или Самовыезд = Истина ТОгда
			//	МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			//	МенеджерЗаписи.Объект = Ссылка;
			//	МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
			//	МенеджерЗаписи.Параметр   = ""+ТекСтатус;
			//	МенеджерЗаписи.Записать();
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
			//Конец очереди

			Действие = Неопределено;
		КонецЕсли;	
		
		//---------------------
		//СтрокаРеквизитов = Неопределено;
		//Если ПометкаУдаления Тогда
		//	Действие = "УстановитьСтатус_ЗапросНаУдаление";
		//ИначеЕсли Не Проведен Тогда	
		//	Если ТекСтатус.Пустая () Тогда
		//		СтрокаРеквизитов = "";
		//		Действие = "УстановитьСтатус_СогласованиеСКлиентом";
		//	КонецЕсли;	
		//Иначе
		//	Действие = Неопределено;
		//	ПодходящийСтатус = "";
		//	Если ТекСтатус.Пустая() Тогда
		//		ТекСтатус = Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом;
		//	КонецЕсли;	
		//	Если ТребуетсяУтверждениеАндеррайтера и не ЗначениеЗаполнено(УтвердилАндеррайтер) Тогда
		//		Если ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО Тогда
		//			ПодходящийСтатус = "";
		//		Иначе	
		//			ПодходящийСтатус = "ФормированиеКомплектаБСО";
		//		КонецЕсли;	
		//	ИначеЕсли ТребуетсяПроверкаРуководителем и не ЗначениеЗаполнено(УтвердилРуководитель) Тогда
		//		ПодходящийСтатус = "СогласованиеСКлиентом";	
		//	ИначеЕсли ТекСтатус = Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом Тогда
		//		
		//		ПодходящийСтатус = ?(Самовыезд или (СИспользованиемОтделаДоговоров и ПолисЗаведен = Ложь),  "ФормированиеКомплектаБСО", "НазначениеКурьера");
		//		Если Не Самовыезд и ЗначениеЗаполнено(Курьер) И Утверждено Тогда
		//			//Пропускаем этап
		//			ПодходящийСтатус = "ФормированиеКомплектаБСО";
		//		КонецЕсли;	
		//	ИначеЕсли ТекСтатус = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера или ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО Тогда	
		//		//Если (ЗначениеЗаполнено(Курьер) и Утверждено) Тогда
		//		Если Утверждено Тогда
		//			//Нормальный автостатус
		//			Если СИспользованиемОтделаДоговоров Тогда
		//				ПодходящийСтатус = "НазначениеКурьера";
		//			Иначе	
		//				ПодходящийСтатус = "ФормированиеКомплектаБСО";
		//			КонецЕсли;	
		//		ИначеЕсли Самовыезд	Тогда
		//			//Ошибочная ситуация, исправляем
		//			//ПодходящийСтатус = "ФормированиеКомплектаБСО";
		//			//
		//			//какого рода ошибочная ситуация? В случае ошибочной ситуации руководитель СВС не может снять утверждение
		//			//у заявки с таким текущим статусом
		//		ИначеЕсли ПолисЗаведен = Истина Тогда
		//			ПодходящийСтатус = "НазначениеКурьера";	
		//		Иначе
		//			ПодходящийСтатус = "ФормированиеКомплектаБСО";
		//		КонецЕсли;	
		//	
		//	КонецЕсли;
		//	//ВыполнитьДействиеПоЗаявке автоматически установит БСОНаРукахУКурьера если нужно
		//	//ИначеЕсли Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НетБСОПоЗаявке(ЭтотОбъект) И ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО Тогда
		//	//	ПодходящийСтатус = "БСОНаРукахУКурьера"
		//	//КонецЕсли;					
		//	Если НЕ ПодходящийСтатус = "" Тогда
		//		СтрокаРеквизитов = уб_УСЗ.ПолучитьРеквизитыЗаявки(Ссылка);
		//		Действие = "УстановитьСтатус_" + ПодходящийСтатус;
		//	КонецЕсли;
		//	////Если текущий статус "ДеньгиВКомпании" он будет отменен
		//	//ОтменяемыйСтатус = Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании;
		//	//уб_УСЗ.ОтменитьСтатусЗаявки(Ссылка,ОтменяемыйСтатус);
		//КонецЕсли;
	КонецЕсли;
	
	Если Действие <> Неопределено Тогда
			Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(Ссылка, ТекСтатус, Действие, СтрокаРеквизитов,,,,) Тогда
				#Если Клиент Тогда
					СписокОбработанныхЗаявок = Новый СписокЗначений;
					СписокОбработанныхЗаявок.Добавить(Ссылка);
					Если Оповещать = Истина Тогда
						Оповестить("уб_СтатусыЗаявокОбновитьСписки", СписокОбработанныхЗаявок, "Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста");	
					КонецЕсли;
					
					Оповещать = Ложь;
				#КонецЕсли
			КонецЕсли;
			
		КонецЕсли;
	//--Движение статусов заявок
	
	Если Не Отказ Тогда
		ПроверитьИОтправитьСМС();
		Если ДополнительныеСвойства.Модифицированность Тогда
			//оповещаем статусы только при модифицированном объекте
			#Если Клиент Тогда
				Если Оповещать = Истина Тогда //исключить двойное оповещение
					Оповестить("уб_СтатусыЗаявок"	, "ОбновитьСписки");
				КонецЕсли;
				
				Оповестить("Заявка",		    , "ОбновитьСписки");
			#КонецЕсли	
		КонецЕсли;
	КонецЕсли;		
	
	Если Дата > Дата(2017,11,1) Тогда
		Ответ = уб_СЕРВЕРные.СинхронизацияФайловЗаявки(Новый Структура("Номер,Ссылка,Страхователь,Менеджер,Файлы",Номер,Ссылка,Страхователь,Менеджер,СписокФайлов.ВыгрузитьКолонку("СсылкаСправочника")));
		Если не Ответ = Истина и уб_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") тогда
			Сообщить(Ответ);
		КонецЕсли;	
	КонецЕсли;
	//Если ДополнительныеСвойства.Канал <> "З-"+Формат(Номер,"ЧГ=") Тогда
	//	
	//	НаборЗаписей =РегистрыСведений.уб_Чат_Сообщения.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ИмяКанала.Установить(ДополнительныеСвойства.Канал);
	//	НаборЗаписей.Прочитать();
	//	НовыйКанал = "З-"+Формат(Номер,"ЧГ=");
	//	Для каждого Запись из НаборЗаписей Цикл
	//		Запись.ИмяКанала = НовыйКанал;
	//	КонецЦикла;	
	//	ДополнительныеСвойства.Вставить	("Канал",НовыйКанал);		
	//КонецЕсли;	
	
	ДатаМинус30Дней = ТекущаяДата()-60*24*3600;
	ПринятыеСтроки = БСо.НайтиСтроки(Новый Структура("ПринятыДеньги",Истина));
	Если Дата>=ДатаМинус30Дней Тогда
		Для каждого СтрокаБСО Из ПринятыеСтроки Цикл
				УстановитьПривилегированныйРежим(Истина);
				МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = Ссылка;
				МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.СозданиеПриемок;
				МенеджерЗаписи.Параметр   = СтрокаБСО.УидСтроки;
				МенеджерЗаписи.Записать();
				Прервать;
			
		КонецЦикла;
	Иначе
		Если ПринятыеСтроки.Количество()>0 Тогда
			Сообщить("Для заявок свыше 60 дней приемки автоматически не создаются/не проверяются на наличие");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("СкопированС",ОбъектКопирования);
	//Скорее всего не актуально 20241114	
	//// конвертация УИДов регистра файлов к полисам, чтобы новый объект заявки создал свои записи в РС, 
	//// без конфликтов с записями объекта копирования
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	З.НомерСтроки КАК НомерСтроки,
	//|	ВЫБОР
	//|		КОГДА Ф_Расчетчик.ФайлИмя ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьРасчетчик,
	//|	ВЫБОР
	//|		КОГДА Ф_ДопСоглашение.ФайлИмя ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьДопСоглашение,
	//|	ВЫБОР
	//|		КОГДА Ф_ДругиеДокументы.ФайлИмя ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьДругиеДокументы,
	//|	Ф_Расчетчик.ФайлИмя КАК Расчетчик,
	//|	Ф_ДопСоглашение.ФайлИмя КАК ДопСоглашение,
	//|	Ф_ДругиеДокументы.ФайлИмя КАК ДругиеДокументы
	//|ИЗ
	//|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_Расчетчик
	//|		ПО (З.Расчетчик <> """")
	//|			И З.Расчетчик = Ф_Расчетчик.УИД
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_ДопСоглашение
	//|		ПО (З.ДопСоглашение <> """")
	//|			И З.ДопСоглашение = Ф_ДопСоглашение.УИД
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_ДругиеДокументы
	//|		ПО (З.ДругиеДокументы <> """")
	//|			И З.ДругиеДокументы = Ф_ДругиеДокументы.УИД
	//|ГДЕ
	//|	З.Ссылка = &Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки");
	//Запрос.УстановитьПараметр("Ссылка", ОбъектКопирования.Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СтрокаТЧ = БСО[Выборка.НомерСтроки - 1];
	//		Если Выборка.ЕстьРасчетчик Тогда
	//			СтрокаТЧ.Расчетчик = Выборка.Расчетчик;
	//		КонецЕсли;
	//		Если Выборка.ЕстьДопСоглашение Тогда
	//			СтрокаТЧ.ДопСоглашение = Выборка.ДопСоглашение;
	//		КонецЕсли;
	//		Если Выборка.ЕстьДругиеДокументы Тогда
	//			СтрокаТЧ.ДругиеДокументы = Выборка.ДругиеДокументы;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

#Область Печать

Функция ПечатьМакетов(Кнопка,Параметры = Неопределено) Экспорт

	Если ТипЗнч(Кнопка) = Тип("Строка") Тогда
		ИмяКнопки = Кнопка;
	Иначе	
		ИмяКнопки = Кнопка.Имя;
	КонецЕсли;	
	
	ИмяКнопки = СтрЗаменить(ИмяКнопки,"ВыполнитьКомандуПечати_","");
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;	
	Если ИмяКнопки = "Макет" Тогда
		//Встроенные формы
		 ТабличныйДокумент = документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Печать(Новый Структура("ПечататьАктПеремещения",ЛОЖЬ),Ссылка);
	Иначе
		ТабличныйДокумент =  Уб_ВызовСервера.ПечатьВнешнейФормы(Ссылка,ИмяКнопки,Параметры);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

Процедура СинхронизацияДатыВремени() Экспорт
	
	Если ВремяВстречиКлиент<>Дата(1,1,1) и НачалоДня(ВремяВстречиКлиент)<> НачалоДня(Дата) Тогда
		_ВремяВстречиКлиент = НачалоДня(Дата)+ (ВремяВстречиКлиент-НачалоДня(ВремяВстречиКлиент));
		Если _ВремяВстречиКлиент<>ВремяВстречиКлиент Тогда
			ВремяВстречиКлиент = _ВремяВстречиКлиент;
		КонецЕсли;
	Иначе
		Дата = ВремяНачало; 
	КонецЕсли;	
	Если ВремяОкончанияКлиент<>Дата(1,1,1) и НачалоДня(ВремяОкончанияКлиент)<> НачалоДня(Дата) Тогда
		_ВремяОкончанияКлиент = НачалоДня(Дата)+ (ВремяОкончанияКлиент-НачалоДня(ВремяОкончанияКлиент));
		Если _ВремяОкончанияКлиент<>ВремяОкончанияКлиент Тогда
			ВремяОкончанияКлиент = _ВремяОкончанияКлиент;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
	
//++Расчеты
Функция ЗарегистрироватьРасчеты() Экспорт
	ТаблицаРасчетов = СобратьРасчеты();
	ЕстьИзменения = Ложь;
	
	НовыеРасчеты = уб_Взаиморасчеты.СравнитьСкорректироватьТаблицу(РасчетыПоЗаявке.Выгрузить(),ТаблицаРасчетов,ЕстьИзменения);
	Если ЕстьИзменения = Истина Тогда
		РасчетыПоЗаявке.Загрузить(НовыеРасчеты);
	КонецЕсли;	
	
КонецФункции

Функция СобратьРасчеты() Экспорт
	СсылкаДокумента = ?(ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка);
	Если РасчетыПоЗаявке.Количество()>200 Тогда
		РасчетыПоЗаявке.Очистить();
	КонецЕсли;	
	ТаблицаРасчетов = РасчетыПоЗаявке.Выгрузить();
	ТаблицаРасчетов.Очистить();
	Для каждого СтрокаБСО  из  БСО Цикл
		//
		уб_Взаиморасчеты.ПроверитьСтроку(СтрокаБСО);
		
		ТолькоБрокерскиеРасчеты = ТипЗнч(СтрокаБСО.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО")	и СтрокаБСО.ВидБСО.Владелец = ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент;
		//Страховая премия
		Если СтрокаБСО.ИтогСтраховаяПремия<>0 Тогда
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером;//!!!Возможно другой вариант
			СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
			СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
			СтрокаР.СуммаКлиент   = СтрокаБСО.ИтогСтраховаяПремия;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = ?(ТолькоБрокерскиеРасчеты,0,СтрокаБСО.ИтогСтраховаяПремия);
			СтрокаР.СуммаБрокерВС = 0;
		КонецЕсли;
		Если ТолькоБрокерскиеРасчеты Тогда
			//ПлановаяСтоимость = ?(Найти(ПодразделениеЗаявки,"М-ОП")=1 и СтрокаБСО.ВидБСО.ПлановаяСтоимость>0,200,СтрокаБСО.ВидБСО.ПлановаяСтоимость);
			ДанныеПоБланку = уб_РасчетыСМенеджерами.ПолучитьСхемуИАлгоритмРасчета(СтрокаБСО.ВидБСО,Менеджер,Дата);
			Если не ДанныеПоБланку = Неопределено Тогда
				ПлановаяСтоимость = ДанныеПоБланку.МинимальнаяСумма;
			Иначе	
				ПлановаяСтоимость = 0;
			Конецесли;	
			Разница = СтрокаБСО.ИтогСтраховаяПремия-ПлановаяСтоимость;
			//Если ПлановаяСтоимость >0 Тогда
			//	СтрокаР = ТаблицаРасчетов.Добавить();
			//	СтрокаР.НачислениеВМ  =
			//	СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
			//	СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
			//	СтрокаР.СуммаКлиент   = 0;
			//	СтрокаР.СуммаМенеджер = 0;
			//	СтрокаР.СуммаБрокер   = 0;//-ПлановаяСтоимость;//Часть брокера
			//КонецЕсли;	
			Если Разница >0 Тогда
				СтрокаР = ТаблицаРасчетов.Добавить();
				СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.НачислениеВМ;
				СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
				СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
				СтрокаР.СуммаКлиент   = 0;
				СтрокаР.СуммаМенеджер = -Разница;
				СтрокаР.СуммаБрокер   = 0;//СтрокаБСО.ИтогСтраховаяПремия;
				СтрокаР.СуммаБрокерВС = 0;
			КонецЕсли;	
		КонецЕсли;	
			
		Если СтрокаБСО.ИтогПредоставленнаяСкидка <> 0 и СтрокаБСО.ОфициальнаяСкидка=Ложь  Тогда
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ;
			СтрокаР.УидСтроки     = СтрокаБСО.УидСтроки;
			СтрокаР.Уточнение     = СтрокаБСО.ВидБСО;
			СтрокаР.СуммаКлиент   = - СтрокаБСО.ИтогПредоставленнаяСкидка;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = 0;
			СтрокаР.СуммаБрокерВС = 0;
		КонецЕсли;
	КонецЦикла;
	врМотивация = Мотивация.Выгрузить();
	врМотивация.Свернуть("ВидМотивации","ЧастьМенеджера,ЧастьБрокера,ЧастьКлиента");
	Для каждого СтрокаМотивации  из  врМотивация Цикл
		Если СтрокаМотивации.ЧастьКлиента<>0 Тогда
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтКлиентаЗаВыезд;
			СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
			СтрокаР.СуммаКлиент   = СтрокаМотивации.ЧастьКлиента;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = 0;
			СтрокаР.СуммаБрокерВС = 0;
			СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
		КонецЕсли;
		Если СтрокаМотивации.ЧастьБрокера<>0 Тогда
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтБрокераЗаВыезд;
			СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
			СтрокаР.СуммаКлиент   = 0;
			СтрокаР.СуммаМенеджер = 0;
			СтрокаР.СуммаБрокер   = 0;
			СтрокаР.СуммаБрокерВС = СтрокаМотивации.ЧастьБрокера;
			СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
		КонецЕсли;
		Если СтрокаМотивации.ЧастьМенеджера<>0 Тогда
			СтрокаР = ТаблицаРасчетов.Добавить();
			СтрокаР.Вид           = Справочники.уб_ВидыРасчетныхОпераций.ОтМенеджераЗаВыезд;
			СтрокаР.Уточнение     = СтрокаМотивации.ВидМотивации;
			СтрокаР.СуммаКлиент   = 0;
			СтрокаР.СуммаМенеджер = СтрокаМотивации.ЧастьМенеджера;
			СтрокаР.СуммаБрокер   = 0;
			СтрокаР.СуммаБрокерВС = 0;
			СтрокаР.УидСтроки = СсылкаДокумента.УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;	
	
	
	Возврат ТаблицаРасчетов;
	
	
КонецФункции	
//--Расчеты


Процедура ПроверитьИОтправитьСМС ()

	ТребуетсяОтправить = Ложь;
	ДополнительныеСвойства.Свойство("ОтправитьСМС",ТребуетсяОтправить);
	Если ТребуетсяОтправить = Истина Тогда
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		//Параметры.Вставить("ИмяСервиса","iqsms.ru");
		//Параметры.Вставить("Режим","REST");
		//Параметры.Вставить("ИмяСервиса","smsc.ru");
		//Параметры.Вставить("Режим","HTTP");
		
		Параметры.Вставить("ИмяСервиса","www.sluice");
		Параметры.Вставить("ИмяСервиса","smsc.ru");
		Параметры.Вставить("Режим","HTTP");
		Параметры.Вставить("ТолькоОдномуПолучателю", Истина);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			Параметры.Получатели 	= Контакты;
		Иначе
			Параметры.Получатели 	= "+79133616124";
		КонецЕсли;
		
		Параметры.Тема			= "Рассылка СМС";
		//TODO телефон брать из основной организации
		Если ДополнительныеСвойства.Свойство("ТекстСМС") Тогда
		//Попытка
			Параметры.Сообщение		= ДополнительныеСвойства.ТекстСМС;
		Иначе	
		//Исключение
			Параметры.Сообщение		= "На выезд по страховке назначен "+Курьер+", тел. "+Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТелефонКурьера(Курьер);//89067775770";// "Bыeзд на cтpaxoвкy подтвержден. Для оформления КАСКО необх.: чистый Авто, ПТС, 2 ключa, права вод-лей, №ТО.+74952280942";		
		КонецЕсли;//Попытки;
		
		Попытка //TODO Временно добавлена попытка
			Ответ = "";
			
			
			
			уб_ОбменДанными.SendSMS(Параметры,Ответ);
			Если Найти (Ответ,"Ложь") = 0 Тогда
				Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение(Параметры.Сообщение,Менеджер,Номер);
				Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Результат отправки SMS:"+СтрЗаменить(Ответ,"¶",""),Менеджер,Номер,Ложь);
				///КомментарийСлужебный = СокрЛП(КомментарийСлужебный)+"; "+СтрЗаменить(Ответ,"¶","")+Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm:ss'");
			Конецесли;	
		Исключение
			
			Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Ошибка при отправке SMS",Менеджер,Номер,Ложь);
			
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПроверитьИОтправитьСМС(). " + " -- " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина, , ,,"СМС-рассылка.Error.Заявка" );	
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры	


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ДатаСоздания = ТекущаяДата();
	ТипЗнчДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипЗнчДанныеЗаполнения = Неопределено Или ТипЗнчДанныеЗаполнения = Тип("Структура") Тогда
		// стандартно при вводе нового, ничего делать не требуется
	ИначеЕсли ТипЗнчДанныеЗаполнения = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		Если ДополнительныеСвойства.Свойство("ТипЗаявки") Тогда
			Тип = ДополнительныеСвойства.ТипЗаявки;
		Иначе
			Тип = Перечисления.уб_ТипВыезда.Пролонгация;
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("Менеджер") Тогда
			Менеджер = ДополнительныеСвойства.Менеджер;
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ДатаЗакрытия") Тогда
			ДатаЗакрытия = ДополнительныеСвойства.ДатаЗакрытия;
		КонецЕсли;
		НомерДоговора = ДанныеЗаполнения;
		Самовыезд = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_СтраховойПолис.СК КАК СК,
		|	уб_СтраховойПолис.Страхователь КАК Страхователь,
		|	уб_СтраховойПолис.НомерЗаявки,
		|	уб_СтраховойПолис.НомерКартыСтрахователя,
		|	уб_СтраховойПолис.БСО.(
		|		ВидБСО,
		|		ВидБСО.Тип КАК Тип
		|	)
		|ИЗ
		|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|ГДЕ
		|	уб_СтраховойПолис.Ссылка = &СтраховойПолис";
		Запрос.УстановитьПараметр("СтраховойПолис", ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СК = Выборка.СК;
			Страхователь = Выборка.Страхователь;
			НомерЗаявки = Выборка.НомерЗаявки;
			НомерКартыСтрахователя = Выборка.НомерКартыСтрахователя;
			ВыборкаБСО = Выборка.БСО.Выбрать();
			Пока ВыборкаБСО.Следующий() Цикл
				Если Тип = Перечисления.уб_ТипВыезда.Пролонгация Тогда
					НоваяСтрока = БСО.Добавить();
					НоваяСтрока.СК = Выборка.СК;
					НоваяСтрока.ВидБСО = ВыборкаБСО.ВидБСО;
					НоваяСтрока.Количество = 1;
				Иначе
					Если ВыборкаБСО.Тип = Перечисления.уб_ТипыБСО.Полис или 
						ВыборкаБСО.Тип = Перечисления.уб_ТипыБСО.ПолисОсаго Тогда
						НоваяСтрока = БСО.Добавить();
						НоваяСтрока.СК = Выборка.СК;
						НоваяСтрока.ВидБСО = уб_КЭШируемые.ВидБСОТипаКвА7ДляСК(Выборка.СК).ВидБСО;
						НоваяСтрока.Количество = 1;
						Если ДатаЗакрытия<>Неопределено Тогда
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	уб_СтраховойПолис.Ссылка,
							|	уб_СтраховойПолисПлатежи.Сумма КАК Сумма,
							|	уб_СтраховойПолис.СтраховаяСумма,
							|	уб_СтраховойПолис.СтраховаяПремия
							|ИЗ
							|	Документ.уб_СтраховойПолис.Платежи КАК уб_СтраховойПолисПлатежи
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
							|		ПО уб_СтраховойПолисПлатежи.Ссылка = уб_СтраховойПолис.Ссылка
							|ГДЕ
							|	уб_СтраховойПолисПлатежи.Дата = &Дата
							|	И уб_СтраховойПолис.Ссылка = &СтраховойПолис" ;
							Запрос.УстановитьПараметр("Дата",ДатаЗакрытия);
							ВыборкаПлатеж = Запрос.Выполнить().Выбрать();
							Если ВыборкаПлатеж.Следующий() Тогда 
								НоваяСтрока.СтраховаяПремия = ВыборкаПлатеж.СтраховаяПремия;
								НоваяСтрока.СуммаВзноса = ВыборкаПлатеж.Сумма;
								НоваяСтрока.ИтогСтраховаяПремия = НоваяСтрока.СтраховаяПремия; 
								НоваяСтрока.ИтогСуммаВзноса     = НоваяСтрока.СуммаВзноса;
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнчДанныеЗаполнения = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	З.Ссылка
		|ПОМЕСТИТЬ ВТ_Заявка
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
		|ГДЕ
		|	З.Ссылка = &ДанныеЗаполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СП.ВидБСО,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ_ИсключаемыеВидыБСО
		|ИЗ
		|	ВТ_Заявка КАК ВТ_Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.БСО КАК СП
		|		ПО ВТ_Заявка.Ссылка = СП.Ссылка.Заявка
		|
		|СГРУППИРОВАТЬ ПО
		|	СП.ВидБСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	З.Ссылка,
		|	З.ВерсияДанных,
		|	З.ПометкаУдаления,
		|	З.Номер,
		|	З.Дата,
		|	З.Проведен,
		|	З.Утверждено,
		|	З.Адрес,
		|	З.Банк,
		|	З.Блокиратор,
		|	З.ВознаграждениеКурьера,
		|	З.ВремяВстречи,
		|	З.ВремяНачало,
		|	З.ВремяОкончания,
		|	З.Город,
		|	З.ИсточникФинансирования,
		|	З.ИтогПредоставленнаяСкидка,
		|	З.ИтогСтраховаяПремия,
		|	З.Комментарий,
		|	З.КонтактноеЛицо,
		|	З.Контакты,
		|	З.Курьер,
		|	З.МаркаТС,
		|	З.Менеджер,
		|	З.МестоВстречи,
		|	З.МодельТС,
		|	З.НетБСО,
		|	З.НетДокументов,
		|	З.НомерДоговора,
		|	З.НомерЗаявки,
		|	З.НомерЗаявкиСК,
		|	З.НомерКартыСтрахователя,
		|	З.ОплатитьВКассуЗаВыездКурьера,
		|	З.ПредставлениеЗаявки,
		|	З.ПредставлениеСтроки,
		|	З.ПриоритетЗадачи,
		|	З.РассрочкаПлатежа,
		|	З.Самовыезд,
		|	З.СК,
		|	З.СтанцияМетро,
		|	З.Статус,
		|	З.Страхователь,
		|	З.СуммаПоКарте,
		|	З.Тип,
		|	З.ТребуетсяПроверкаРуководителем,
		|	З.ЦельВыезда,
		|	З.ИтогСуммаВзноса,
		|	З.СозданНаОсновании КАК СозданНаОсновании1,
		|	З.КомментарийСлужебный,
		|	З.Автор,
		|	З.ДатаСоздания,
		|	З.Модификатор,
		|	З.ДатаИзменения,
		|	З.БСО.(
		|		Ссылка,
		|		НомерСтроки,
		|		СК,
		|		ВидСП,
		|		ВидБСО,
		|		СтраховаяПремия,
		|		ПредоставленнаяСкидка,
		|		ПредоставленнаяСкидкаПроцент,
		|		ЛимитОтветственности,
		|		Основной,
		|		Количество,
		|		Расчетчик,
		|		ДопСоглашение,
		|		ИтогСтраховаяПремия,
		|		ИтогПредоставленнаяСкидка,
		|		ДопКоличество,
		|		МаркаТС,
		|		МодельТС,
		|		Франшиза,
		|		РассрочкаПлатежа,
		|		БезубыточныйПереход,
		|		СуммаВзноса,
		|		ФормаОплаты,
		|		Агрегатная,
		|		НомерВзноса,
		|		ИтогСуммаВзноса,
		|		ОрганизацияАгент,
		|		Валюта,
		|		Курс,
		|		Кратность,
		|		Стоимость,
		|		ДругиеДокументы
		|	)
		|ИЗ
		|	ВТ_Заявка КАК ВТ_Заявка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
		|		ПО ВТ_Заявка.Ссылка = З.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(З.Количество) КАК Количество,
		|	СУММА(З.ДопКоличество) КАК ДопКоличество,
		|	З.СК,
		|	З.ВидСП,
		|	З.ВидБСО,
		|	З.СтраховаяПремия,
		|	З.ПредоставленнаяСкидка,
		|	З.ПредоставленнаяСкидкаПроцент,
		|	З.ЛимитОтветственности,
		|	З.Основной,
		|	ВЫБОР
		|		КОГДА Ф_Расчетчик.ФайлИмя ЕСТЬ NULL 
		|			ТОГДА З.Расчетчик
		|		ИНАЧЕ Ф_Расчетчик.ФайлИмя
		|	КОНЕЦ КАК Расчетчик,
		|	ВЫБОР
		|		КОГДА Ф_ДопСоглашение.ФайлИмя ЕСТЬ NULL 
		|			ТОГДА З.ДопСоглашение
		|		ИНАЧЕ Ф_ДопСоглашение.ФайлИмя
		|	КОНЕЦ КАК ДопСоглашение,
		|	ВЫБОР
		|		КОГДА Ф_ДругиеДокументы.ФайлИмя ЕСТЬ NULL 
		|			ТОГДА З.ДругиеДокументы
		|		ИНАЧЕ Ф_ДругиеДокументы.ФайлИмя
		|	КОНЕЦ КАК ДругиеДокументы,
		|	З.ИтогСтраховаяПремия,
		|	З.ИтогПредоставленнаяСкидка,
		|	З.МаркаТС,
		|	З.МодельТС,
		|	З.Франшиза,
		|	З.РассрочкаПлатежа,
		|	З.БезубыточныйПереход,
		|	З.СуммаВзноса,
		|	З.ФормаОплаты,
		|	З.Агрегатная,
		|	З.НомерВзноса,
		|	З.ИтогСуммаВзноса
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК З
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявка КАК ВТ_Заявка
		|		ПО З.Ссылка = ВТ_Заявка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_Расчетчик
		|		ПО (З.Расчетчик <> """")
		|			И З.Расчетчик = Ф_Расчетчик.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_ДопСоглашение
		|		ПО (З.ДопСоглашение <> """")
		|			И З.ДопСоглашение = Ф_ДопСоглашение.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф_ДругиеДокументы
		|		ПО (З.ДругиеДокументы <> """")
		|			И З.ДругиеДокументы = Ф_ДругиеДокументы.УИД
		|
		|СГРУППИРОВАТЬ ПО
		|	З.МаркаТС,
		|	З.МодельТС,
		|	З.РассрочкаПлатежа,
		|	З.БезубыточныйПереход,
		|	З.Агрегатная,
		|	З.СК,
		|	З.ВидСП,
		|	З.ВидБСО,
		|	З.Основной,
		|	З.Расчетчик,
		|	З.ДопСоглашение,
		|	З.СтраховаяПремия,
		|	З.ПредоставленнаяСкидка,
		|	З.ПредоставленнаяСкидкаПроцент,
		|	З.ЛимитОтветственности,
		|	З.ИтогСтраховаяПремия,
		|	З.ИтогПредоставленнаяСкидка,
		|	З.Франшиза,
		|	З.СуммаВзноса,
		|	З.ФормаОплаты,
		|	З.НомерВзноса,
		|	З.ИтогСуммаВзноса,
		|	З.ДругиеДокументы,
		|	Ф_Расчетчик.ФайлИмя,
		|	Ф_ДопСоглашение.ФайлИмя,
		|	Ф_ДругиеДокументы.ФайлИмя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Количество - ЕСТЬNULL(ВТ_ИсключаемыеВидыБСО.Количество, 0) КАК Количество,
		|	ВТ_ТЧ.Количество КАК Количество1,
		|	ВТ_ТЧ.ДопКоличество,
		|	ВТ_ТЧ.СК,
		|	ВТ_ТЧ.ВидСП,
		|	ВТ_ТЧ.ВидБСО,
		|	ВТ_ТЧ.СтраховаяПремия,
		|	ВТ_ТЧ.ПредоставленнаяСкидка,
		|	ВТ_ТЧ.ПредоставленнаяСкидкаПроцент,
		|	ВТ_ТЧ.ЛимитОтветственности,
		|	ВТ_ТЧ.Основной,
		|	ВТ_ТЧ.Расчетчик,
		|	ВТ_ТЧ.ДопСоглашение,
		|	ВТ_ТЧ.ИтогСтраховаяПремия,
		|	ВТ_ТЧ.ИтогПредоставленнаяСкидка,
		|	ВТ_ТЧ.МаркаТС,
		|	ВТ_ТЧ.МодельТС,
		|	ВТ_ТЧ.Франшиза,
		|	ВТ_ТЧ.РассрочкаПлатежа,
		|	ВТ_ТЧ.БезубыточныйПереход,
		|	ВТ_ТЧ.СуммаВзноса,
		|	ВТ_ТЧ.ФормаОплаты,
		|	ВТ_ТЧ.Агрегатная,
		|	ВТ_ТЧ.НомерВзноса,
		|	ВТ_ТЧ.ИтогСуммаВзноса,
		|	ВТ_ТЧ.ДругиеДокументы
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключаемыеВидыБСО КАК ВТ_ИсключаемыеВидыБСО
		|		ПО ВТ_ТЧ.ВидБСО = ВТ_ИсключаемыеВидыБСО.ВидБСО
		|ГДЕ
		|	ВТ_ТЧ.Количество - ЕСТЬNULL(ВТ_ИсключаемыеВидыБСО.Количество, 0) > 0";
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		Пакет = Запрос.ВыполнитьПакет();
		Выборка = Пакет[2].Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка,,"Номер, НомерЗаявки, Автор, ДатаСоздания, Модификатор, ДатаИзменения, Проведен");
			ВыборкаТЧБСО = Пакет[4].Выбрать();
			Пока ВыборкаТЧБСО.Следующий() Цикл
				СтрокаТЧ = БСО.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаТЧБСО);
			КонецЦикла;
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ЭтоКопировани");
	ИначеЕсли ТипЗнчДанныеЗаполнения = Тип("ДокументСсылка.уб_ЗаявкаНаПечать") Тогда
		//
		Дата = ТекущаяДата();
		Тип = Перечисления.уб_ТипВыезда.Страховка;
		//Если Перечисления.уб_СтатусыЗаявкиНаПечать.Индекс(ДанныеЗаполнения.СтатусЗаявки) < 4 Тогда
		//	ДополнительныеСвойства.Вставить("ЗакрытьФорму",Истина);
		//	#Если Клиент Тогда
		//	Предупреждение("Статус заявки на печать не позволяет создать Заявку на выезд");
		//	#КонецЕсли
		//	Возврат;
		//КонецЕсли;	
		СозданНаОсновании = ДанныеЗаполнения;
		
		ДанныеПоЗаявке  = Документы.уб_ЗаявкаНаПечать.Данные(ДанныеЗаполнения);
		ЗаявкаШапка     = ДанныеПоЗаявке[0].Выбрать();
		ЗаявкаШапка.Следующий();
		ЗаявкаБСО       = ДанныеПоЗаявке[1].Выгрузить();
		ЗаявкаПараметры = ДанныеПоЗаявке[2].Выгрузить();
		
		СК = ЗаявкаШапка.СК;
		
		ЗаявкаОбъект = ДанныеЗаполнения.ПолучитьОбъект();
		ЗаявкаДанные = Неопределено;
		ЗаявкаОбъект.ПодготовитьДанные("НомерСессииНеВажен",ЗаявкаДанные);
		Менеджер  = ЗаявкаШапка.Менеджер;
		Если ЗначениеЗаполнено(Менеджер) = ЛОЖЬ Тогда
			Менеджер = ПараметрыСеанса.уб_ТекущееФизЛицо;
		КонецЕсли;	
		МестоВстречи = "";
		Город = ЗначениеПараметраЗаявки("СтраховательНаселенныйПунктФакт",ЗаявкаДанные);
		Если ПустаяСтрока(Город) Тогда
			Город = ЗначениеПараметраЗаявки("СтраховательГородФакт",ЗаявкаДанные);
		КонецЕсли;	
		Страхователь = ЗначениеПараметраЗаявки("СтраховательПодменаСсылки",ЗаявкаДанные);
		Для каждого СтрокаБСОИсточник из ЗаявкаБСО Цикл
			СтрокаБСО = БСО.Добавить();
			СтрокаБСО.ВидБСО = СтрокаБСОИсточник.ВидБСО; 
			СтрокаБСО.СК     = СтрокаБСОИсточник.СК;
			СтрокаБСО.ВидСП  = ЗаявкаШапка.ВидСП;
			СтрокаБСО.Количество = 1;
			СтрокаБСО.МаркаТС  = ЗначениеПараметраЗаявки("ОбъектСтрахованияМаркаТС",ЗаявкаДанные);
			СтрокаБСО.МодельТС = ЗначениеПараметраЗаявки("ОбъектСтрахованияМодельТС",ЗаявкаДанные);
			СтрокаБСО.СтраховаяПремия  = ЗначениеПараметраЗаявки("СтраховаяПремияВсего",ЗаявкаДанные);
			СтрокаБСО.СуммаВзноса      = СтрокаБСО.СтраховаяПремия;
			СтрокаБСО.ИтогСуммаВзноса  = СтрокаБСО.СтраховаяПремия;
			СтрокаБСО.ИтогСтраховаяПремия = СтрокаБСО.СтраховаяПремия;
			СтрокаБСО.Курс = 1;
			СтрокаБСО.Кратность = 1;
			СтрокаБСО.ЛимитОтветственности = ЗначениеПараметраЗаявки("СтраховаяСумма",ЗаявкаДанные);
			СтрокаБСО.ОрганизацияАгент   = СтрокаБСОИсточник.ОрганизацияАгент;
			//СтрокаБСО
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

Функция ЗначениеПараметраЗаявки(ИМЯ,ЗаявкаПараметры)
	нСтроки = ЗаявкаПараметры.НайтиСтроки(Новый Структура("Параметр",Имя));
	Если нСтроки.Количество()= 0 Тогда
		Сообщить("Не найден параметр с именем "+Имя);
	Иначе
		Возврат нСтроки[0].Значение 
	КонецЕсли;	
КонецФункции	


//чкн

// расчет мотивации курьера
Процедура ИтогиМотивацииОбъект(Элемент,ПроверятьМинимум = Истина) Экспорт 
	Если НЕ Элемент = Неопределено Тогда //ВНИМАНИЕ!
		#Если Клиент Тогда
			Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ЗаблокироватьАвторасчет",Истина);	
		#Иначе	
			Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ЗаблокироватьАвторасчет",Истина);	
		#КонецЕсли
		
	КонецЕсли;	
	_ОплатитьВКассуЗаВыездКурьера = Мотивация.Итог("ЧастьМенеджера");
	_ВознаграждениеЧастьКлиента   = Мотивация.Итог("ЧастьКлиента");
	_ВознаграждениеЧастьБрокера   = Мотивация.Итог("ЧастьБрокера");
	Если ДополнительныеСвойства.ВнешнееСВС = Истина Тогда
		_ВознаграждениеКурьера = 0;
	Иначе	
		_ВознаграждениеКурьера        = _ОплатитьВКассуЗаВыездКурьера + _ВознаграждениеЧастьКлиента + _ВознаграждениеЧастьБрокера;
	КонецЕсли;
	//КОНТРОЛЬ МИНИМАЛЬНОГО ВОЗНАГРАЖДЕНИЯ
	//Если ПроверятьМинимум = Истина Тогда
	//	Если _ВознаграждениеКурьера <ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера 
	//		и НЕ ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Курьер 
	//		И ДополнительныеСвойства.ВнешнееСВС = Ложь
	//		Тогда
	//		_ВознаграждениеКурьера = ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера;
	//		//Распределяется разница
	//		Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
	//			_ВознаграждениеЧастьКлиента = _ВознаграждениеКурьера-_ВознаграждениеЧастьБрокера-_ОплатитьВКассуЗаВыездКурьера;
	//			СтрокаМ = Мотивация.Добавить();
	//			СтрокаМ.ВидМотивации = "Минимальный выезд";
	//			СтрокаМ.ЧастьКлиента = _ВознаграждениеЧастьКлиента;
	//		ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер Тогда
	//			_ОплатитьВКассуЗаВыездКурьера = _ВознаграждениеКурьера-_ВознаграждениеЧастьБрокера-_ВознаграждениеЧастьКлиента;
	//			СтрокаМ = Мотивация.Добавить();
	//			СтрокаМ.ВидМотивации = "Минимальный выезд";
	//			СтрокаМ.ЧастьМенеджера = _ОплатитьВКассуЗаВыездКурьера;
	//		ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер Тогда
	//			_ВознаграждениеЧастьБрокера = _ВознаграждениеКурьера-_ОплатитьВКассуЗаВыездКурьера-_ВознаграждениеЧастьКлиента;	
	//			СтрокаМ = Мотивация.Добавить();
	//			СтрокаМ.ВидМотивации = "Минимальный выезд";
	//			СтрокаМ.ЧастьБрокера = _ВознаграждениеЧастьБрокера;
	//		Конецесли;	
	//	КонецЕсли;	
	//КонецЕсли;	
	#Если Клиент Тогда
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ОплатитьВКассуЗаВыездКурьера",_ОплатитьВКассуЗаВыездКурьера);
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеКурьера", 		_ВознаграждениеКурьера);
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеЧастьКлиента", 	_ВознаграждениеЧастьКлиента);
		Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеЧастьБрокера", 	_ВознаграждениеЧастьБрокера);		
	#Иначе	
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ОплатитьВКассуЗаВыездКурьера",_ОплатитьВКассуЗаВыездКурьера);
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеКурьера", 		_ВознаграждениеКурьера);
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеЧастьКлиента", 	_ВознаграждениеЧастьКлиента);
		Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ВознаграждениеЧастьБрокера", 	_ВознаграждениеЧастьБрокера);		
	#КонецЕсли
	
КонецПроцедуры

Функция РасчетВознагражденияКурьера(ПараметрыСотрудника) Экспорт //Новый регламент с учетом категории курьера
	//ОбновитьПараметры(_Источник) Экспорт
	ПараметрыСВС = уб_РасчетыСМенеджерами.ПараметрыСВС(Курьер,КонецДня(Дата));

	ДополнительныеСвойства.Вставить("СВС",              ПараметрыСВС.СВС);
	ДополнительныеСвойства.Вставить("ТипПодразделения", ПараметрыСВС.ТипПодразделения);
	ДополнительныеСвойства.Вставить("ВнешнееСВС",ПараметрыСВС.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя);
	_Комиссия =0;
	СКВ = РасчетСКВПоЗаявке(_Комиссия);
	ДополнительныеСвойства.Вставить("СКВ",СКВ);	
	ДополнительныеСвойства.Вставить("Комиссия",_Комиссия);	

	Прч = Перечисления.уб_ТипВыезда;
	ПосчитатьПолиса(); //Расчет количества по видам (осаго каско)
	СКВ = 0; //РасчетСКВПоЗаявке();
	
	ДополнительныеСвойства.Вставить("СКВ",СКВ);
	Если Самовыезд 
		ИЛИ Тип = Прч.Административный 
		ИЛИ ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Курьер Тогда
		Если Мотивация.Количество() >0 Тогда
			Мотивация.Очистить();//Возможно есть ситуации, когда это не требуется, но пока очищаем
		КонецЕсли;
		ИтогиМотивацииОбъект(Неопределено,ЛОЖЬ);
		СКВ = РасчетСКВПоЗаявке(_Комиссия);
		ДополнительныеСвойства.Вставить("СКВ",СКВ);
		ДополнительныеСвойства.Вставить("Комиссия",_Комиссия);
		Возврат 0;
	ИначеЕсли Дата>Дата(2018,1,1) 
		и (Адрес ="Офис" 
		или Адрес ="офис"
		или Адрес ="Краснопролетарская ул. 16 стр. 1"
		или Адрес ="Большая Новодмитровская дом 23, корп 6")
		или уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("Оплата курьеру",Курьер,Дата,-1) = 0
		Тогда
		Если Мотивация.Количество() >0 Тогда
			Мотивация.Очистить();//Возможно есть ситуации, когда это не требуется, но пока очищаем
		КонецЕсли;
		Если Не ЗаблокироватьАвторасчет = Истина Тогда
			ЗаблокироватьАвторасчет = Истина;
		КонецЕсли;
		Если ВознаграждениеОтКлиента>0 Тогда 
			#Если Клиент Тогда
				Предупреждение("При адресе ""Офис"" вознаграждение с клиента не учитывается"); 
			#КонецЕсли	
		КонецЕсли;	
		ИтогиМотивацииОбъект(Неопределено,ЛОЖЬ);
		СКВ = РасчетСКВПоЗаявке(_Комиссия);
		ДополнительныеСвойства.Вставить("Комиссия",_Комиссия);
		ДополнительныеСвойства.Вставить("СКВ",СКВ);
	ИначеЕсли уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("Оплата курьеру",Курьер,Дата,-1)<>0 и ЗаблокироватьАвторасчет=Истина Тогда	
		ЗаблокироватьАвторасчет = Ложь;
	КонецЕсли;	
	Если Дата<Дата(2014,10,1) 
		ИЛИ ЗаблокироватьАвторасчет = Истина
		//ИЛИ Утверждено = Истина
		//ИЛИ (НЕ СтатусЗаявки.Пустая() И Перечисления.уб_СтатусыЗаявок.Индекс(СтатусЗаявки) >= 4)
		Тогда
		Возврат 0;
	КонецЕсли;	
	
	//Если Ссылка.УтвержденоДата<>Дата(1,1,1)  Тогда
	//	Если РольДоступна("ПолныеПрава") Тогда
	//		Возврат 0;
	//	КонецЕсли;
	//КонецЕсли;	
	Если ПараметрыСотрудника.НеОплачиваютВыезд = Истина 
		//и НЕ НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная
		и НЕ ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер Тогда
		ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер;
	КонецЕсли;
	Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер  Тогда
		КолонкаИсточника = "ЧастьБрокера";
	ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент  Тогда
		КолонкаИсточника = "ЧастьКлиента";	
	Иначе
		КолонкаИсточника = "ЧастьМенеджера";	
	КонецЕсли;	
	
	Категория   = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("Категория",Курьер,Дата,3);
	
	//Сообщить("Категория "+Категория);
	//суммы
	Структура = Новый Структура;
	
	ЧастьМенеджера = 0;
	ЧастьБрокера   = 0;
	ВремМотивация  = Мотивация.Выгрузить();
	ВремМотивация.Очистить();
	//СКВ = РасчетСКВПоЗаявке();
	Если ПоказателиРасчетаЗП = Неопределено Тогда
		ПоказателиРасчетаЗП = уб_РасчетыСМенеджерами.ПоказателиРасчетаЗП(КонецМесяца(Дата));
	КонецЕсли;	
	
	Если Дата < Дата(2016,8,1) Тогда
		ТаблицаМотивации = ТаблицаМотивации(Категория);
		Если Тип = Прч.ОчереднойВзнос Тогда
			Мотивация("Получение второго взноса",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
		ИначеЕсли Тип = Прч.ПервичныйОсмотр ИЛИ Тип = Прч.ПереОсмотр  Тогда
			Мотивация("Фото ТС",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
		Иначе	
			//остальное - СТРАХОВКА зависит от типа полиса	
			
			
			//Сообщить(Выборка.Каско);	
			//Сообщить(Выборка.Осаго);	
			//Сообщить(Выборка.НС);	
			//БАЗОВАЯ ЧАСТЬ
			Если ДополнительныеСвойства.Каско>0 и ДополнительныеСвойства.Осаго>0 Тогда
				Мотивация("Оформление КАСКО+ОСАГО",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
			ИначеЕсли ДополнительныеСвойства.Каско>0 Тогда	
				Мотивация("Оформление КАСКО",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
			ИначеЕсли ДополнительныеСвойства.Осаго>0 Тогда	
				Мотивация("Выезд по оформлению полисов ОСАГО",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
			КонецЕсли;	
			//
			Если ДополнительныеСвойства.НС>0 Тогда	
				Мотивация("НС",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
			КонецЕсли;	
			//ДопКАСКО
			Если ДополнительныеСвойства.Каско > 1 Тогда
				
				Мотивация("Дополнительный полис КАСКО",Категория,ДополнительныеСвойства.Каско-1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
				
			КонецЕсли;	
			//
			
			Если НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная Тогда
				Мотивация("Личная",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
			КонецЕсли;	
		КонецЕсли;		
		Если За10КмОтМКАД Тогда
			Мотивация("За 10 км от МКАД",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
		КонецЕсли;	
		
		_ОплатитьВКассуЗаВыездКурьера = ВремМотивация.Итог("ЧастьМенеджера");
		_ВознаграждениеЧастьКлиента   = ВремМотивация.Итог("ЧастьКлиента");
		_ВознаграждениеЧастьБрокера   = ВремМотивация.Итог("ЧастьБрокера");
		_ВознаграждениеКурьера        = _ОплатитьВКассуЗаВыездКурьера + _ВознаграждениеЧастьКлиента + _ВознаграждениеЧастьБрокера;
		МинималкаКурьер = ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера;
	Иначе
		//Расчет с 01.08.2016
		Если НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная и ПараметрыСотрудника.НеОплачиваютВыезд = Ложь Тогда
			Мотивация("Личная",Категория,1,ТаблицаМотивации,ВремМотивация,КолонкаИсточника,СКВ);
		КонецЕсли;	
		Если Дата > Дата(2019,3,1) Тогда
			СтрокаП = ВремМотивация.Добавить();
			СтрокаП.ВидМотивации      = "Клиент";
			СтрокаП.ЧастьМенеджера   = ВознаграждениеОтМенеджера; //Внесено руками
		КонецЕсли;	
		//Если Дата > Дата(2019,1,1) и ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
		//	СтрокаП = ВремМотивация.Добавить();
		//	СтрокаП.ВидМотивации      = "Клиент";
		//	СтрокаП.ЧастьКлиента   = ВознаграждениеЧастьКлиента; //Внесено руками
		//КонецЕсли;	
		
		_ОплатитьВКассуЗаВыездКурьера = ВремМотивация.Итог("ЧастьМенеджера");
		_ВознаграждениеЧастьКлиента   = ВремМотивация.Итог("ЧастьКлиента");
		_ВознаграждениеЧастьБрокера   = ВремМотивация.Итог("ЧастьБрокера");
		//_ВознаграждениеКурьера        = _ОплатитьВКассуЗаВыездКурьера + _ВознаграждениеЧастьКлиента + _ВознаграждениеЧастьБрокера;
		
		Если ДополнительныеСвойства.ВнешнееСВС = Истина Тогда
			_ВознаграждениеКурьера = 0;
		Иначе	
			
			Если ЭтоНовый() Тогда
				СсылкаНового = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПолучитьСсылку(Новый УникальныйИдентификатор);
			Иначе	
				СсылкаНового = Ссылка;
			КонецЕсли;	
			//_ВознаграждениеКурьера = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВКОтСтатусаИКоличества(СсылкаНового,Дата);	
			_ВознаграждениеКурьера = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВКОтСтатусаИКоличества(ЭтотОбъект,Дата);	
		КонецЕсли;	
		МинималкаКурьер = 0;//ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера;//?(ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент,250,ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера);
		
	КонецЕсли;
	
	//Оценка надбавки
	Если Не ПараметрыСотрудника.НеПроверятьСрочность = Истина 
		И	ДатаСоздания >= Дата(2016,7,7) 
		//И НЕ НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная
		Тогда
		ВидСрочнойМотивации = "Срочный выезд";
		Если Срочная  Тогда//Если скв от 1000 до 3350, за срочность не идет
			Если ДатаСоздания < Дата(2017,4,1) Тогда
				Если НЕ (СКВ >= 1000 и СКВ<=3350) Тогда
					Если  Тип   = Перечисления.уб_ТипВыезда.ОчереднойВзнос 
						или Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр
						или Тип = Перечисления.уб_ТипВыезда.Переосмотр
						Тогда
						НадбавкаСрочность = 200;
					ИначеЕсли ДополнительныеСвойства.Каско>0 Тогда
						НадбавкаСрочность = 500;
					Иначе
						НадбавкаСрочность = 200;
					КонецЕсли;	
				Иначе
					НадбавкаСрочность = 0;
				КонецЕсли;
				
			Иначе
				Если Тип = Перечисления.уб_ТипВыезда.ОчереднойВзнос Тогда
					НадбавкаСрочность = 100;
					ВидСрочнойМотивации = "За срочный очередной взнос";
				ИначеЕсли Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр и ОплачиваемыйОсмотр Тогда
					ВидСрочнойМотивации = "За оплачиваемый осмотр";
					НадбавкаСрочность = 100;
				ИначеЕсли Каско>0 и Тип <> Перечисления.уб_ТипВыезда.Административный и Тип <> Перечисления.уб_ТипВыезда.Перепись Тогда
					НадбавкаСрочность = 500;	
					ВидСрочнойМотивации = "За срочное КАСКО";
				ИначеЕсли Осаго>0 и Тип <> Перечисления.уб_ТипВыезда.Административный и Тип <> Перечисления.уб_ТипВыезда.Перепись Тогда
					НадбавкаСрочность = 200;		
					ВидСрочнойМотивации = "За срочное ОСАГО";
				ИначеЕсли ДК>0 и Тип <> Перечисления.уб_ТипВыезда.Административный и Тип <> Перечисления.уб_ТипВыезда.Перепись Тогда
					ВидСрочнойМотивации = "За срочную ДК";
					НадбавкаСрочность = 100;			
				Иначе
					НадбавкаСрочность = 0;
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Если Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр и ОплачиваемыйОсмотр Тогда
				ВидСрочнойМотивации = "За оплачиваемый осмотр";
				НадбавкаСрочность = 100;
			Иначе		
				НадбавкаСрочность = 0;	
			КонецЕсли;	
		КонецЕсли;
		
	Иначе
		
		//без изменений
		НадбавкаСрочность  = 0; 
	КонецЕсли;

	Если Дата > Дата(2016,8,1) Тогда
		СтрокаМ = ВремМотивация.Добавить();
		СтрокаМ.ВидМотивации = "Вознаграждение курьера";
		Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
			
			Если Дата < Дата(2019,1,1) Тогда
				СтрокаМ.ЧастьКлиента  = ?(НадбавкаСрочность=500,0,250-НадбавкаСрочность);
			Иначе
				Если Дата > Дата(2022,11,1) и ВознаграждениеОтКлиента>0 и ВознаграждениеОтКлиента<=НадбавкаСрочность Тогда
					НадбавкаСрочность = НадбавкаСрочность-ВознаграждениеОтКлиента;
					СтрокаМ.ЧастьКлиента = ВознаграждениеОтКлиента;
				Иначе	
					Если ВознаграждениеОтКлиента>НадбавкаСрочность Тогда
						НадбавкаСрочность = 0;
					КонецЕсли;	
					СтрокаМ.ЧастьКлиента  = ?(НадбавкаСрочность=500,0,ВознаграждениеОтКлиента-НадбавкаСрочность);
				КонецЕсли;	
			КонецЕсли;	
			СтрокаМ.ЧастьБрокера  = _ВознаграждениеКурьера-СтрокаМ.ЧастьКлиента;
		ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер 
			или ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер 
			Тогда
			//расчитано выше
			СтрокаМ.ЧастьБрокера = _ВознаграждениеКурьера;
		КонецЕсли;	
	Иначе	
		//КОНТРОЛЬ МИНИМАЛЬНОГО ВОЗНАГРАЖДЕНИЯ
		Если _ВознаграждениеКурьера < МинималкаКурьер 
			и НЕ ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Курьер 
			и ДополнительныеСвойства.ВнешнееСВС = Ложь
			Тогда
			_ВознаграждениеКурьера = МинималкаКурьер;
			//Распределяется разница
			СтрокаМ = ВремМотивация.Добавить();
			СтрокаМ.ВидМотивации = "Минимальный выезд";
			Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
				Если Дата > Дата(2016,8,1) Тогда
					_ВознаграждениеКурьера      =  250;
				КонецЕсли;
				_ВознаграждениеЧастьБрокера = -(_ВознаграждениеКурьера-МинималкаКурьер);
				
				_ВознаграждениеЧастьКлиента = _ВознаграждениеКурьера-_ВознаграждениеЧастьБрокера-_ОплатитьВКассуЗаВыездКурьера;
				СтрокаМ.ЧастьКлиента  = _ВознаграждениеКурьера;//_ВознаграждениеЧастьКлиента;
				СтрокаМ.ЧастьБрокера  = _ВознаграждениеЧастьБрокера;
			ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер Тогда
				//_ОплатитьВКассуЗаВыездКурьера = _ВознаграждениеКурьера-_ВознаграждениеЧастьБрокера-_ВознаграждениеЧастьКлиента;
				СтрокаМ.ЧастьМенеджера = _ВознаграждениеКурьера;
			ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер Тогда
				//_ВознаграждениеЧастьБрокера = _ВознаграждениеКурьера-_ОплатитьВКассуЗаВыездКурьера-_ВознаграждениеЧастьКлиента;	
				СтрокаМ.ЧастьБрокера = _ВознаграждениеКурьера;//_ВознаграждениеЧастьБрокера;
			Конецесли;	
		КонецЕсли;
	КонецЕсли;
	//Коррекция для менеджера в зависимости от времени назначения
	//РазностьУтвержденияИВыезда = Дата-УтвержденоДата;
	//Если УтвержденоДата <>Дата(1,1,1) и (РазностьУтвержденияИВыезда > 0) 
	//	И (ДополнительныеСвойства.Каско>0 или ДополнительныеСвойства.Осаго>0) 
	//	и ДатаСоздания > Дата(2016,6,17)
	//	И НЕ НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная Тогда
	//	
	//	Если (РазностьУтвержденияИВыезда)>(24*3600)  Тогда
	//		СуммаМенеджер = 0;
	//	Иначе
	//		СуммаМенеджер = ?(ДополнительныеСвойства.Каско>0,ПоказателиРасчетаЗП.СтоимостьКАСКОМенеджер,ПоказателиРасчетаЗП.СтоимостьОСАГОМенеджер);//Взять из регистра	
	//	КонецЕсли;
		
	Если НадбавкаСрочность>0 Тогда
		ИтогоСуммаМенеджер = ВремМотивация.Итог("ЧастьМенеджера");
		
		Если Дата > Дата(2016,8,1) Тогда
			//НадбавкаСрочность = НадбавкаСрочность-ВознаграждениеОтКлиента;
			Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер Тогда
				СтрокаМ = ВремМотивация.Добавить();
				СтрокаМ.ВидМотивации = ВидСрочнойМотивации;		
		        СтрокаМ.ЧастьМенеджера = НадбавкаСрочность;
				//разница уходит брокеру
				СтрокаМ.ЧастьБрокера   = -СтрокаМ.ЧастьМенеджера;
			ИначеЕсли ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
				СтрокаМ = ВремМотивация.Добавить();
				СтрокаМ.ВидМотивации = ВидСрочнойМотивации;		
				СтрокаМ.ЧастьМенеджера  = НадбавкаСрочность;
		        СтрокаМ.ЧастьКлиента = ВознаграждениеОтКлиента;
				//разница уходит брокеру
				СтрокаМ.ЧастьБрокера   = -СтрокаМ.ЧастьКлиента-СтрокаМ.ЧастьМенеджера;
			КонецЕсли;
		Иначе
			//Старый вариант
			Если ИтогоСуммаМенеджер=0 Тогда
				// самовыезд или прочие
				Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
					ИтогоКлиент = ВремМотивация.Итог("ЧастьКлиента");
					НадбавкаСрочность = Макс(ИтогоКлиент,НадбавкаСрочность);
					Если ИтогоКлиент>0 Тогда
						Для Каждого СтрокаМ Из ВремМотивация  Цикл
							БылоЧастьКлиент      = СтрокаМ.ЧастьКлиента;  
							//Делим пропорционально
							СтрокаМ.ЧастьКлиента = НадбавкаСрочность * СтрокаМ.ЧастьКлиента/ИтогоКлиент;
							//разница уходит брокеру
							СтрокаМ.ЧастьБрокера   = СтрокаМ.ЧастьБрокера+ (БылоЧастьКлиент-СтрокаМ.ЧастьКлиента);
						КонецЦикла;		
					КонецЕсли;
				КонецЕсли;
			Иначе
				Для Каждого СтрокаМ Из ВремМотивация  Цикл
					БылоЧастьМенеджер      = СтрокаМ.ЧастьМенеджера;  
					//Делим пропорционально
					СтрокаМ.ЧастьМенеджера = НадбавкаСрочность *СтрокаМ.ЧастьМенеджера/ИтогоСуммаМенеджер;
					//разница уходит брокеру
					СтрокаМ.ЧастьБрокера   = СтрокаМ.ЧастьБрокера+ (БылоЧастьМенеджер-СтрокаМ.ЧастьМенеджера);
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Сумма = ЧастьМенеджера + ЧастьБрокера;
	//Сообщить(ЧастьМенеджера);
	//Сообщить(ЧастьБрокера);
	Если ВремМотивация.Итог(КолонкаИсточника)<> Мотивация.Итог(КолонкаИсточника)
		или ВремМотивация.Итог("ЧастьБрокера")<> Мотивация.Итог("ЧастьБрокера")
		Тогда
		//Кому можно перезаписывать данные
		Мотивация.Загрузить(ВремМотивация);
	КонецЕсли;	
	//Возврат Макс(Сумма, ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера);
    ИтогиМотивацииОбъект(Неопределено,Ложь);
	СКВ = РасчетСКВПоЗаявке();
	ДополнительныеСвойства.Вставить("СКВ",СКВ);
КонецФункции // РасчетВознагражденияКурьера()


Процедура ПосчитатьПолиса() Экспорт
	ДополнительныеСвойства.Вставить("Каско",0);
	ДополнительныеСвойства.Вставить("Осаго",0);
	ДополнительныеСвойства.Вставить("НС",0);
	ДополнительныеСвойства.Вставить("Прочие",0);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	БСО.НомерСтроки,
		|	БСО.ВидБСО,
		|	БСО.Количество
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЗБСО КАК БСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТЧ.ВидБСО,
		|	ЕСТЬNULL(С.Наименование, ""Вид СП"") КАК Наименование,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ТЧ.ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов)
		|				ТОГДА ВТ_ТЧ.ВидБСО
		|			ИНАЧЕ ЕСТЬNULL(СП.Ссылка.Вид, ""Прочее"")
		|		КОНЕЦ) КАК Вид,
		|	МАКСИМУМ(ВТ_ТЧ.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Виды
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
		|		ПО ВТ_ТЧ.ВидБСО = СП.ВидБСО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК С
		|		ПО ВТ_ТЧ.ВидБСО = С.Ссылка
		|ГДЕ
		|	СП.Ссылка есть null или НЕ СП.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЧ.НомерСтроки,
		|	ВТ_ТЧ.ВидБСО,
		|	ЕСТЬNULL(С.Наименование, ""Вид СП"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	99,
		|	ЗНАЧЕНИЕ(Справочник.уб_ВидыБСО.ПустаяСсылка),
		|	""Квитанция"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(уб_СтраховойПолис.СтраховойПродукт) = ТИП(Справочник.уб_СтраховыеПродукты)
		|			ТОГДА уб_СтраховойПолис.СтраховойПродукт.Вид
		|		ИНАЧЕ уб_СтраховойПолис.СтраховойПродукт
		|	КОНЕЦ,
		|	1
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК С
		|		ПО ВТ_ТЧ.ВидБСО = С.Ссылка
		|			И (С.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7))
		|			И (&Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ОчереднойВзнос))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|		ПО (уб_СтраховойПолис.Ссылка = &Полис)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
		|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
		|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК КАСКО,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
		|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОСАГО,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДМС)
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ДМС,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Наименование = ""Техосмотр""
		|						ИЛИ ВТ_Виды.Наименование = ""Техосмотр (отдельно)""
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ДК,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НС,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
		|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""ЕОСАГО%""
		|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""Е-ОСАГО%""
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ЕОСАГО,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
		|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""ЕКАСКО%""
		|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""Е-КАСКО%""
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ЕКАСКО,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
		|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
		|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
		|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП)
		|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
		|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
		|					ТОГДА ВТ_Виды.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК Прочие
		|ИЗ
		|	ВТ_Виды КАК ВТ_Виды");
		ТЗБСО = БСО.Выгрузить();
		//ТЗБСО.Колонки.Добавить("Тип");
		//Для Каждого СтрокаТЗ Из ТЗБСО Цикл
		//	Если ТипЗнч(СтрокаТЗ.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		//		СтрокаТЗ.Тип = СтрокаТЗ.ВидБСО.Тип
		//	КонецЕсли;
	//	КонецЦикла;
		Запрос.УстановитьПараметр("ТЗБСО", ТЗБСО);
		Запрос.УстановитьПараметр("Тип", Тип);
		Запрос.УстановитьПараметр("Полис", НомерДоговора);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДополнительныеСвойства.Вставить("Каско",  Выборка.Каско);
			ДополнительныеСвойства.Вставить("Осаго",  Выборка.Осаго);
			ДополнительныеСвойства.Вставить("НС",     Выборка.НС);
			ДополнительныеСвойства.Вставить("Прочие", Выборка.Прочие);
			ДополнительныеСвойства.Вставить("ДМС", Выборка.ДМС);
			ДополнительныеСвойства.Вставить("ДК", Выборка.ДК);
			ДополнительныеСвойства.Вставить("ЕОСАГО", Выборка.ЕОСАГО);
			ДополнительныеСвойства.Вставить("ЕКАСКО", Выборка.ЕКАСКО);
			#Если Клиент Тогда
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"Каско",Выборка.Каско);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"Осаго",Выборка.Осаго);  
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"НС",   Выборка.НС);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ДМС",  Выборка.ДМС);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ДК",   Выборка.ДК);
			#Иначе	
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"Каско",Выборка.Каско);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"Осаго",Выборка.Осаго);  
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"НС",   Выборка.НС);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ДМС",  Выборка.ДМС);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ДК",   Выборка.ДК);
			#КонецЕсли
		Иначе
			#Если Клиент Тогда
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"Каско",0);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"Осаго",0);  
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"НС",   0);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ДМС",  0);
				уб_Клиент._УстановитьЗначение(ЭтотОбъект,"ДК",   0);
				
			#Иначе	
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"Каско",0);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"Осаго",0);  
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"НС",   0);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ДМС",  0);
				уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ДК",   0);
			#КонецЕсли
			ДополнительныеСвойства.Вставить("Каско",  0);
			ДополнительныеСвойства.Вставить("Осаго",  0);
			ДополнительныеСвойства.Вставить("НС",     0);
			ДополнительныеСвойства.Вставить("Прочие", 0);
			ДополнительныеСвойства.Вставить("ДМС", 0);
			ДополнительныеСвойства.Вставить("ДК", 0);
			ДополнительныеСвойства.Вставить("ЕОСАГО", 0);
			ДополнительныеСвойства.Вставить("ЕКАСКО", 0);
		КонецЕсли;
		
КонецПроцедуры

Функция Мотивация(ВидМотивации, Категория, Количество = 1,ТаблицаМотивации = Неопределено,ПолучательДанных = Неопределено,КолонкаИсточника = "ЧастьМенеджера",СКВ = 0)
	Если ТаблицаМотивации = Неопределено Тогда
		ТаблицаМотивации = ТаблицаМотивации(Категория);
	КонецЕсли;	
	мСтрок = ТаблицаМотивации.НайтиСтроки(Новый Структура("ВидМотивации,Категория",ВидМотивации,Категория));
	Если мСтрок.Количество() = 0 Тогда
		ЧастьМенеджера = 0;
		ЧастьБрокера   = 0;
		Возврат 0;
	Иначе
		//
		Если ДатаСоздания<Дата(2017,4,1) и СКВ >= 1000 и СКВ <= 3350 и (НомерЗаявки <> Перечисления.уб_ВидыЗаявок.Личная и НомерЗаявки <> Перечисления.уб_ВидыЗаявок.Агентская)   Тогда
			//Всё за счет брокера
			ЧастьМенеджера = 0;
			ЧастьБрокера   = мСтрок[0].ЧастьМенеджера; //мСтрок[0].ЧастьБрокера не оплачивается
		Иначе
			ЧастьМенеджера = мСтрок[0].ЧастьМенеджера;
			ЧастьБрокера   = мСтрок[0].ЧастьБрокера;
		КонецЕсли;
		Если НЕ ПолучательДанных = Неопределено Тогда 
			СтрокаП = ПолучательДанных.Добавить();
			СтрокаП.ВидМотивации      = ВидМотивации;
			Если НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная и ВидМотивации = "Личная" Тогда
				СтрокаП["ЧастьМенеджера"] = ЧастьМенеджера*Количество;	
			Иначе
				СтрокаП[КолонкаИсточника] = ЧастьМенеджера*Количество;	
			КонецЕсли;
			
			СтрокаП.ЧастьБрокера      = ЧастьБрокера*Количество;
			Если КолонкаИсточника = "ЧастьКлиента" и не НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная Тогда
				СтрокаП[КолонкаИсточника] = СтрокаП[КолонкаИсточника]+СтрокаП.ЧастьБрокера;
				СтрокаП.ЧастьБрокера = 0;
			КонецЕсли;
		КонецЕсли;	
		Возврат ЧастьМенеджера*Количество+ЧастьБрокера*Количество;
	КонецЕсли;	
КонецФункции

Функция ТаблицаМотивации(Категория = Неопределено)
	ТаблицаМотивации = Новый ТаблицаЗначений;
	ТаблицаМотивации.Колонки.Добавить("ВидМотивации");
	ТаблицаМотивации.Колонки.Добавить("Категория");
	ТаблицаМотивации.Колонки.Добавить("ЧастьМенеджера");
	ТаблицаМотивации.Колонки.Добавить("ЧастьБрокера");
	
	
	Если ПоказателиРасчетаЗП.Свойство("НадбавкаКурьеруЗаЛичнуюСтраховку") Тогда
		Возврат ТаблицаМотивации;
	КонецЕсли;
	
	НадбавкаКурьеруЗаЛичнуюСтраховку = ПоказателиРасчетаЗП.НадбавкаКурьеруЗаЛичнуюСтраховку;
	//1 категория
	Если Категория = Неопределено ИЛИ Категория = 1 Тогда
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 200;
		СтрокаМ.ЧастьБрокера   = 100;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО+ОСАГО";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 300;
		СтрокаМ.ЧастьБрокера   = 100;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Выезд по оформлению полисов ОСАГО";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 50;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Получение второго взноса";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 50;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Фото ТС";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "НС";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 20;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дополнительный полис КАСКО";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дальше 10 км от МКАД";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;
		//Личная
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Личная";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = НадбавкаКурьеруЗаЛичнуюСтраховку;
		СтрокаМ.ЧастьБрокера   = -НадбавкаКурьеруЗаЛичнуюСтраховку;
		//За 10 км от МКАД
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "За 10 км от МКАД";
		СтрокаМ.Категория      = 1;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;
	КонецЕсли;
	//2 категория
	Если Категория = Неопределено ИЛИ Категория = 2 Тогда
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 200;
		СтрокаМ.ЧастьБрокера   = 50;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО+ОСАГО";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 300;
		СтрокаМ.ЧастьБрокера   = 50;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Выезд по оформлению полисов ОСАГО";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 50;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Получение второго взноса";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Фото ТС";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "НС";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 0;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дополнительный полис КАСКО";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дальше 10 км от МКАД";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;
		//Личная
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Личная";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = НадбавкаКурьеруЗаЛичнуюСтраховку;
		СтрокаМ.ЧастьБрокера   = -НадбавкаКурьеруЗаЛичнуюСтраховку;
		//За 10 км от МКАД
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "За 10 км от МКАД";
		СтрокаМ.Категория      = 2;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;

	КонецЕсли;
	//3 категория
	Если Категория = Неопределено ИЛИ Категория = 3 Тогда
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 200;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Оформление КАСКО+ОСАГО";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 300;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Выезд по оформлению полисов ОСАГО";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Получение второго взноса";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Фото ТС";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "НС";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 0;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дополнительный полис КАСКО";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 150;
		СтрокаМ.ЧастьБрокера   = 0;
		//
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Дальше 10 км от МКАД";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;
		//Личная
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "Личная";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = НадбавкаКурьеруЗаЛичнуюСтраховку;
		СтрокаМ.ЧастьБрокера   = -НадбавкаКурьеруЗаЛичнуюСтраховку;
		//За 10 км от МКАД
		СтрокаМ = ТаблицаМотивации.Добавить();
		СтрокаМ.ВидМотивации   = "За 10 км от МКАД";
		СтрокаМ.Категория      = 3;
		СтрокаМ.ЧастьМенеджера = 100;
		СтрокаМ.ЧастьБрокера   = 0;

	КонецЕсли;
	Возврат  ТаблицаМотивации
КонецФункции

Функция РасчетСКВПоЗаявке(Комиссия=0) Экспорт
	Если Дата<Дата(2016,2,11) Тогда
		Возврат 999999;//Заоблачное значение
	КонецЕсли;	
	СКВ = 0;
	Комиссия = 0;
	Для Каждого СтрокаБСО Из БСО Цикл
		Если ТипЗнч(СтрокаБСО.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
			Если Найти("Техосмотр",Строка(СтрокаБСО.ВидБСО))>0 Тогда
			//Если СтрокаБСО.ВидБСО.Тип = Перечисления.уб_ТипыБСО.ПолисОсаго Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		ТекФормаОплаты = ?(СтрокаБСо.ФормаОплатыСтрока.Пустая(),ФормаОплаты,СтрокаБСо.ФормаОплатыСтрока );
		Если Дата>=Дата(2026,1,1) 
			и ТекФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику 
			и СтрокаБСО.ВидБСО<>Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека 
			и СтрокаБСО.ВидБСО<>Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР Тогда
			дельта = 3;
			
		Иначе
			дельта = 0;
		КонецЕсли;	
		Комиссия = Комиссия+Окр((дельта)*СтрокаБСО.ИтогСтраховаяПремия/100,2);
		СуммаСтроки = Окр((СтрокаБСО.КВБрокераПлан-дельта)*СтрокаБСО.ИтогСтраховаяПремия/100,2)-СтрокаБСО.ИтогПредоставленнаяСкидка;
		СКВ = СКВ+ СуммаСтроки;
	КонецЦикла;	
	//Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
		СКВ = СКВ+ ВознаграждениеЧастьКлиента+ВознаграждениеОтМенеджера-СуммаПоКарте;
		//Комиссия = Комиссия+СуммаПоКарте;
	//КонецЕсли;	
	//Если СКВ >= 1000 и СКВ <= 3350 и  НомерЗаявки <> Перечисления.уб_ВидыЗаявок.Личная Тогда
	//	#Если Клиент тогда
	//	Предупреждение("По данной заявке оплата выезда производится за счет брокера без доплаты за класность выездного специалиста ["+СКВ+"]",10);
	//	#КонецЕсли
	//Иначе
	//	//возврат 999999
	//КонецЕсли;
	
	Возврат СКВ;
КонецФункции

Функция Реквизиты(Знач _Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Проведен,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Тип,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СозданНаОсновании,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Куратор
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",_Ссылка);
	Результат = Запрос.Выполнить();
	Ответ = Новый Структура;
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Для каждого Колонка из Результат.Колонки Цикл
			Ответ.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;	
	Иначе
		Для каждого Колонка из Результат.Колонки Цикл
			Ответ.Вставить(Колонка.Имя, _Ссылка[Колонка.Имя]);
		КонецЦикла;	
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьПараметры(_Источник) Экспорт
	ПараметрыСВС = уб_РасчетыСМенеджерами.ПараметрыСВС(_Источник.Курьер,КонецДня(_Источник.Дата));

	ДополнительныеСвойства.Вставить("СВС",              ПараметрыСВС.СВС);
	ДополнительныеСвойства.Вставить("ТипПодразделения", ПараметрыСВС.ТипПодразделения);
	ДополнительныеСвойства.Вставить("ВнешнееСВС",ПараметрыСВС.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя);
	Комиссия = 0;
	СКВ = РасчетСКВПоЗаявке(Комиссия);
	ДополнительныеСвойства.Вставить("СКВ",СКВ);	
	ДополнительныеСвойства.Вставить("Комиссия",Комиссия);	
КонецФункции	
//чкн


Функция ПроверкаПодготовкаСМС2017(ВыборкаСсылки) Экспорт
	
	ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
	Возврат "";//20181010
	
	Утверждается = 	Утверждено = Истина И Утверждено <> ВыборкаСсылки.Утверждено;
	
	ДоВыезда = Окр((Дата-ТекущаяДата())/60);
	МожноОтправить= ТипВыезда <> 2 //Офис
		И Самовыезд = Ложь
		И ПустаяСтрока(Контакты) = Ложь 
		И (Курьер<>Справочники.ФизическиеЛица.ПустойАгент)
		И (Курьер<>Справочники.ФизическиеЛица.ПустаяСсылка())
		И ПометкаУдаления = ЛОЖЬ
		И ДоВыезда>0//Непросрочен
		И (СокрЛП(Курьер)<>"КОРЗИНА")
		И (СокрЛП(Курьер)<>"Е-ОСАГО")
		И (Найти(Курьер,"Пустой")=0)
		И (Найти(Курьер,"Офис")=0)
		;
		
		пРассылка  = Перечисления.уб_ТипыОчереди.Рассылка;
		
	
	
	
	
	ЗаменаКурьера = Курьер<> ВыборкаСсылки.Курьер;
	
	ДеньВДень = НачалоДня(Дата) = НачалоДня(ТекущаяДата());
	
	Если МожноОтправить и Утверждается //Происходит утверждение
		Тогда
		//
		
		Если ДоВыезда < 60 Тогда
			ТипОтправки = "Сразу о курьере";
		ИначеЕсли ДеньВДень = Истина Тогда	
			ТипОтправки = "Полис подготовлен";
		Иначе
			ТипОтправки = "В очередь";
		КонецЕсли;	
			

		//И ДоВыезда >= 0 //прошлые не отправляем
		//И ДоВыезда < 60*60*24*6 // 6 дней

		//Назначен = ?(ТипВыезда = 0,Курьер,Менеджер);
		Если ТипОтправки = "Сразу о курьере" Тогда
			//ТекстСМС = "На доставку полиса назначен "+Назначен+", тел. "+ТелефонКурьера(Назначен);
			ТекстСМС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТекстSMSоКурьере(ЭтотОбъект);
		ИначеЕсли ТипОтправки = "Полис подготовлен" Тогда
			//сегодня
			ТекстСМС = "Ваш полис страхования на стадии оформления. Доставка назначена на "+Формат(Дата,"ДФ=dd.MM.yy");//+" +74952280942";
			
			//Создаем очередь напоминалки за час
			РегистрыСведений.уб_Очередь.ОбъектВОчереди(Новый Структура("Объект,ТипОчереди,КоличествоПопытокВыполнения",ВыборкаСсылки.Ссылка,пРассылка,0),,Истина);
			
		ИначеЕсли ТипОтправки = "В очередь" Тогда
			//В день
			ТекстСМС = "Ваш полис страхования на стадии оформления. Доставка назначена на "+Формат(Дата,"ДФ=dd.MM.yyyy");
			//Создаем очередь напоминалки за час
			РегистрыСведений.уб_Очередь.ОбъектВОчереди(Новый Структура("Объект,ТипОчереди,КоличествоПопытокВыполнения",ВыборкаСсылки.Ссылка,пРассылка,0),,Истина);
		Иначе
			ТекстСМС = "";
		КонецЕсли;	
		
		Если Не ТекстСМС = "" Тогда
			Если ДополнительныеСвойства.Свойство("ТекстСМС") и ДополнительныеСвойства.ТекстСМС = ТекстСМС Тогда
				ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
			Иначе	
				Последнее = РегистрыСведений.уб_Чат_Сообщения.ПоследнееСообщение("", "З-"+Формат(Номер,"ЧГ="));
				Если Последнее = ТекстСМС Тогда
					ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
				Иначе	
					ДополнительныеСвойства.Вставить("ОтправитьСМС",Истина);
					ДополнительныеСвойства.Вставить("ТекстСМС",ТекстСМС);
				КонецЕсли;	
			КонецЕсли;
		Иначе	
			ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
		КонецЕсли;	
		
		Возврат ТекстСМС;
	ИначеЕсли МожноОтправить и ЗаменаКурьера и Утверждено Тогда
		
		Если ДоВыезда < 60 Тогда
			ТекстСМС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТекстSMSоКурьере(ЭтотОбъект,"Произошли изменения, на доставку полиса");
		ИначеЕсли ДеньВДень = Истина Тогда
			РегистрыСведений.уб_Очередь.ОбъектВОчереди(Новый Структура("Объект,ТипОчереди,КоличествоПопытокВыполнения",ВыборкаСсылки.Ссылка,пРассылка,100),,Истина);
			//МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Объект = ВыборкаСсылки.Ссылка;
			//МенеджерЗаписи.ТипОчереди = пРассылка;
			//МенеджерЗаписи.КоличествоПопытокВыполнения = 100;
			//МенеджерЗаписи.Записать();
		Иначе	
			ТекстСМС = "";
		КонецЕсли;	
		
		Если Не ТекстСМС = "" Тогда
			Последнее = РегистрыСведений.уб_Чат_Сообщения.ПоследнееСообщение("", "З-"+Формат(Номер,"ЧГ="));
			Если Последнее = ТекстСМС Тогда
				ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
			Иначе	
				ДополнительныеСвойства.Вставить("ОтправитьСМС",Истина);
				ДополнительныеСвойства.Вставить("ТекстСМС",ТекстСМС);
			КонецЕсли;	
		КонецЕсли;	
		
	Иначе
		уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(ВыборкаСсылки.Ссылка,пРассылка);
		Возврат "";
	КонецЕсли;	
КонецФункции	

Процедура ПроверкаПодготовкаСМС(ВыборкаСсылки)
	ДоВыезда = Дата-НачалоДня(ТекущаяДата());
		
	    Утверждается = 	Утверждено = Истина И Утверждено <> ВыборкаСсылки.Утверждено;
		Если Утверждается //Происходит утверждение
			//И ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина  
			И ТипВыезда <> 2 //Офис
			//И Тип = Перечисления.уб_ТипВыезда.Страховка 
			И Самовыезд = Ложь
			И ПустаяСтрока(Контакты) = Ложь 
			И ДоВыезда >= 0 //прошлые не отправляем
			И ДоВыезда < 60*60*24*6 // 6 дней
			И ПометкаУдаления = ЛОЖЬ
			И (Курьер<>Справочники.ФизическиеЛица.ПустойАгент)
			И (Курьер<>Справочники.ФизическиеЛица.ПустаяСсылка())
			Тогда
			//
			Назначен = ?(ТипВыезда = 0,Курьер,Менеджер);
			Если Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр ИЛИ Тип = Перечисления.уб_ТипВыезда.Переосмотр Тогда
				ДополнительныеСвойства.Вставить("ОтправитьСМС",Истина);
				ДополнительныеСвойства.Вставить("ТекстСМС","На предстраховой осмотр назначен эксперт "+Назначен+". Для осмотра необх: чистый авто, 2 ключа, СТС, паспорт.");
			ИначеЕсли Тип = Перечисления.уб_ТипВыезда.Страховка Тогда
				ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
				
				//Запрос = Новый Запрос(
				//"ВЫБРАТЬ
				//|	уб_СтраховыеПродукты.Ссылка
				//|ИЗ
				//|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК уб_СтраховыеПродукты
				//|ГДЕ
				//|	уб_СтраховыеПродукты.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
				//|	И уб_СтраховыеПродукты.ВидБСО.Ссылка В(&СписокБСО)
				//|	И уб_СтраховыеПродукты.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис)");
				//Запрос.УстановитьПараметр("СписокБСО",БСО.ВыгрузитьКолонку("ВидБСО"));
				//ЕстьКаско = НЕ Запрос.Выполнить().Пустой();
				//Если ЕстьКаско Тогда
				Если Каско >0 Тогда
					ДополнительныеСвойства.Вставить("ОтправитьСМС",Истина);
					ДополнительныеСвойства.Вставить("ТекстСМС","На выезд по КАСКО назначен "+Назначен+", тел. "+Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТелефонКурьера(Назначен));
				Иначе
					//Запрос.Текст ="ВЫБРАТЬ
					//			  |	уб_СтраховыеПродукты.Ссылка
					//			  |ИЗ
					//			  |	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК уб_СтраховыеПродукты
					//			  |ГДЕ
					//			  |	уб_СтраховыеПродукты.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
					//			  |	И уб_СтраховыеПродукты.ВидБСО.Ссылка В(&СписокБСО)
					//			  |	И уб_СтраховыеПродукты.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго)";
					//ЕстьОсаго = НЕ Запрос.Выполнить().Пустой();
					Если Осаго >0 Тогда
						ДополнительныеСвойства.Вставить("ОтправитьСМС",Истина);
						ДополнительныеСвойства.Вставить("ТекстСМС","На выезд по ОСАГО назначен "+Назначен+", тел. "+Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТелефонКурьера(Назначен));
					Иначе
						ДополнительныеСвойства.Вставить("ОтправитьСМС",Ложь);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	ТекСтатус = уб_УСЗ.ВернутьСтатусЗаявки(Ссылка, ТекущаяДата());
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", ЛОЖЬ);
	пСтутусы  = Перечисления.уб_СтатусыЗаявок;
	АгентВТЧДокумента = Ложь;
	
	Если ТекСтатус = пСтутусы.СогласованиеСКлиентом или Самовыезд Тогда
		_Агент = Менеджер;
	//ИНачеЕсли ТекСтатус = пСтутусы.КомплектДокументацииПодготовлен или ТекСтатус = пСтутусы.ФормированиеКомплектаБСО или ТекСтатус = пСтутусы.НазначениеКурьера Тогда	
	//	_Агент = "Оператор";
	//	АгентВТЧДокумента = Истина;
	//ИНачеЕсли ТекСтатус = пСтутусы.БСОНаРукахУКурьера Тогда	
	//	_Агент = Курьер;
	Иначе
	    _Агент = Курьер;
		//Агент = Неопределено;
	КонецЕсли;
	_Агент = Неопределено;
	
	СтруктураПараметров.Вставить("АгентВТЧДокумента", АгентВТЧДокумента);
	СтруктураПараметров.Вставить("Агент", _Агент);//?(Самовыезд = Истина,Менеджер,Курьер));//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
	//СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.БлокировкаБСО);
	СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Перечисления.уб_СостоянияБСО.НеПолностьюОформлен);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Ложь);
	СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", ВидДвиженияНакопления.Расход);
	//СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Поставщик", Неопределено);
	//СтруктураПараметров.Вставить("ОрганизацияАгент", Неопределено);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
    СтруктураПараметров.Вставить("ПропускатьПустойНомерБСО",Истина);
	СтруктураПараметров.Вставить("ПроверитьСостояние",Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	УстановитьПривилегированныйРежим(Ложь);
	


КонецПроцедуры
	

//Функция ПроверитьНеобходимостьУтвержденияАндеррайтером() Экспорт
//	ТребуетсяУтверждение = ЛОЖЬ;
//	Если УтвердилАндеррайтер.Пустая() Тогда
//		ТребуетсяУтверждение = ТребуетсяУтверждениеАндеррайтера;
//		Если ТребуетсяУтверждение = ЛОЖЬ Тогда
//			//Производится проверка
//			Для Каждого СтрокаБСО из БСО Цикл
//				//
//				ВидБСО = СтрокаБСО.ВидБСО;
//				Если ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
//					ТекВидБСО = Нрег(Строка(ВидБСО));
//					ЭтоОСАГО = Найти(ТекВидБСО, "осаго") <> 0;
//					ЭтоКАСКО = Найти(ТекВидБСО, "каско") <> 0;
//				Иначе
//					ЭтоОСАГО = ВидБСО.Вид = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО;
//					ЭтоКАСКО = ВидБСО.Вид = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО; 
//				КонецЕсли;
//				
//				//
//				Если ЭтоКАСКО и НЕ СтрокаБСО.СК.Пустая() Тогда
//					ТаблицаЛимитов = уб_СтраховойБрокер.ПолучитьЛимитыНаСтрахование(СтрокаБСО.СК,СтрокаБСО.ЛимитОтветственности);
//					Если ТаблицаЛимитов.Количество()> 0 Тогда
//						ТребуетсяУтверждение = Истина;
//						Прервать;
//					КонецЕсли;	
//				Иначе
//					//СтрокаЛимитов = "Лимиты не установлены";
//				КонецЕсли;
//				
//			КонецЦикла;	
//			
//		КонецЕсли;	
//	Иначе
//		//Уже утверждено
//	КонецЕсли;
//	Если ТребуетсяУтверждение и НЕ ТребуетсяУтверждениеАндеррайтера Тогда
//		//Замена реквизита
//		ТребуетсяУтверждениеАндеррайтера = Истина;
//	КонецЕсли;	
//	Если ТребуетсяУтверждениеАндеррайтера и УтвердилАндеррайтер.Пустая() Тогда
//		//Снимается утверждение	
//		Если Утверждено = Истина Тогда
//			Утверждено = ЛОЖЬ;
//		КонецЕсли;	
//	КонецЕсли;	
//КонецФункции	

ПроцентПроверкиКАСКО = 7;
мВалютаРегламентированногоУчета = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
//
//Если ЭтотОбъект.ОбменДанными<>неопределено Тогда
	Объект = Реквизиты(Ссылка);
	//ЭтотОбъект.Прочитать();
	//ПоказателиРасчетаЗП = уб_РасчетыСМенеджерами.ПоказателиРасчетаЗП(КонецМесяца(Объект.Дата));
	
	ОбновитьПараметры(Объект);
//КонецЕсли;
