Процедура СинхронизироватьОстатки() Экспорт
	//TODO наложить фильтр доля номерных
	Запрос = Новый запрос("ВЫБРАТЬ
	|	ВИДЫБСО.Ссылка КАК ВидБСО,
	|	ЕСТЬNULL(Остатки.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(уб_УпрОстаткиБСО.Количество, 0) КАК КоличествоУпр
	|ИЗ
	|	Справочник.уб_ВидыБСО КАК ВИДЫБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(*) КАК Количество,
	|			ДСП.ВидБСО КАК ВидБСО
	|		ИЗ
	|			РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|					,
	|					Подтверждено
	|					) КАК ДСП
	|		ГДЕ (ДСП.Агент = &Подразделение или
	|			ДСП.Агент В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВН.Агент
	|					ИЗ
	|						(ВЫБРАТЬ
	|							А.Агент КАК Агент,
	|							А.Подразделение КАК Подразделение,
	|							А.Период КАК Период,
	|							А.Организация КАК Организация
	|						ИЗ
	|							РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ), ) КАК А
	|						ГДЕ
	|							НЕ А.Выбытие
	|				
	|						ОБЪЕДИНИТЬ
	|				
	|						ВЫБРАТЬ
	|							А.Агент,
	|							А.Подразделение,
	|							А.Период,
	|							А.Организация
	|						ИЗ
	|							РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
	|						ГДЕ
	|							НЕ А.Выбытие
	|							И А.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаИзПериода, МЕСЯЦ)
	|						) КАК ВН
	|					ГДЕ
	|						НЕ ВН.Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	|						И ВН.Подразделение = &Подразделение))
	|			И ДСП.ПоложениеБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПолученИзСК), ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ВозвращенИзСК), 
	|// ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку), 
	|ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ВозвращенСТочки)) и ДСП.Активность
	|			И ДСП.СостояниеБСО В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияБСО.ПустойБланк), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияБСО.НеиспользованныйБланк) )
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДСП.ВидБСО) КАК Остатки
	|		ПО (Остатки.ВидБСО = ВИДЫБСО.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_УпрОстаткиБСО КАК уб_УпрОстаткиБСО
	|		ПО (уб_УпрОстаткиБСО.ВидБСО = ВИДЫБСО.Ссылка)
	|ГДЕ
	|	ЕСТЬNULL(Остатки.Количество, 0) <> ЕСТЬNULL(уб_УпрОстаткиБСО.Количество, 0)");
	
	Запрос.УстановитьПараметр("Подразделение",ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
	Запрос.УстановитьПараметр("ДатаИзПериода",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.уб_УпрОстаткиБСО.СоздатьМенеджерЗаписи();
		МЗ.ВидБСО = Выборка.ВидБСО;
		МЗ.Количество = Выборка.Количество;
		МЗ.Записать();
	КонецЦикла;	

КонецПроцедуры
