Перем ПараметрыОбработки Экспорт;

Процедура ВыполнитьОбработку() Экспорт
	
	Если ПараметрыОбработки = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	Если ПараметрыОбработки.Свойство("ПодсчетКоличестваФайловВЗаявке") Тогда
		ПодсчетКоличестваФайловВЗаявке();
	КонецЕсли;	
	
	//Проверка итогов отчеты без включенных оплат
	Если ПараметрыОбработки.Свойство("ИсправитьИтогиОтчетовПоставщику") Тогда
		ИсправитьИтогиОтчетовПоставщику();
	КонецЕсли;	
	
	Если ПараметрыОбработки.Свойство("СинхронизироватьЕстьЧек") тогда
		СинхронизироватьЕстьЧек();
	КонецЕсли;	

	
	Если ПараметрыОбработки.Свойство("ПроверкаСКВ") Тогда
		ПроверкаСКВ();
	КонецЕсли;	
	
	
	Если ПараметрыОбработки.Свойство("ПроверкаНаличияПеремещений") Тогда
		ПроверкаНаличияПеремещений();
	КонецЕсли;	
	
	Если ПараметрыОбработки.Свойство("АнализРекомендаций") Тогда
		Если Минута(ТекущаяДата())<6 или РольДоступна("уб_ЗП_ПолныйДоступ") Тогда
			АнализРекомендаций();
		КонецЕсли;	
	КонецЕсли;	
	Если ПараметрыОбработки.Свойство("АнализРекомендацийСразу") Тогда
		АнализРекомендаций();
	КонецЕсли;	
	
	Если ПараметрыОбработки.Свойство("СинхронизироватьАгентаВПеремещениях") Тогда
		СинхронизироватьАгентаВПеремещениях();
	КонецЕсли;	
	
	Если ПараметрыОбработки.Свойство("ОбработатьСтраховойПолисВДвижениях") Тогда
		ОбработатьСтраховойПолисВДвижениях();
	КонецЕсли;
		
	Если ПараметрыОбработки.Свойство("ПроверитьШтрафыЗаОпоздание") Тогда
		ПроверитьШтрафыЗаОпоздание();
	КонецЕсли;
	
	Если ПараметрыОбработки.Свойство("ЗаполнитьВДокументахОплатаПолисовСхемуРасчетаСМенеджером") Тогда
		ЗаполнитьВДокументахОплатаПолисовСхемуРасчетаСМенеджером();
	КонецЕсли;
	Если ПараметрыОбработки.Свойство("УдалитьЛишниеВзаиморасчетыВСК") Тогда
		УдалитьЛишниеВзаиморасчетыВСК();
	КонецЕсли;
	Если ПараметрыОбработки.Свойство("ДобавитьОтсутствующиеОплатыВСК") Тогда
		ДобавитьОтсутствующиеОплатыВСК();
	КонецЕсли;	
	//Исправляется дата движения БСО
	Если ПараметрыОбработки.Свойство("ПроверкаОплатСПоступлениемПоКвитанцииПозжеДвижения") Тогда
		ПроверкаОплатСПоступлениемПоКвитанцииПозжеДвижения();
	КонецЕсли;	
	//Если ПараметрыОбработки.Свойство("ПроверкаЗависшихСоединений") Тогда
	//	ПроверкаЗависшихСоединений(Истина,"1640");
	//КонецЕсли;	
	//Если ПараметрыОбработки.Свойство("ПроверкаПерезапускаРабочихПроцессовСервера") Тогда
	//	ПроверкаПерезапускаРабочихПроцессовСервера(Истина, "1640");
	//КонецЕсли;	
	//Если ПараметрыОбработки.Свойство("ПроверитьЗаполнитьПредопределенные") Тогда
	//	ПроверитьЗаполнитьПредопределенные();
	//КонецЕсли;	
	Если ПараметрыОбработки.Свойство("ПроверкаНаличияДанныхКонфигурации") Тогда
		#Если Клиент Тогда
			ПроверкаНаличияДанныхКонфигурации();
		#КонецЕсли	
	КонецЕсли;	
	
		
	Если ПараметрыОбработки.Свойство("ПроверкаОплатПолисовБезИстории") Тогда
		ПроверкаОплатПолисовБезИстории();
	КонецЕсли;
	
	
	Если ПараметрыОбработки.Свойство("Оплаты_Поставщику_С_НулевойСуммой") Тогда
		Оплаты_Поставщику_С_НулевойСуммой();  // в дальнейшем исправление руками
	КонецЕсли;	
	
	
	Если ПараметрыОбработки.Свойство("ПроверкаКорректностиПВХНастройкиПользователя") Тогда
		ПроверкаКорректностиПВХНастройкиПользователя();
	КонецЕсли;
	
	
	Если ПараметрыОбработки.Свойство("ПроверкаАутентификацииПользователей") Тогда
		ПроверкаАутентификацииПользователей();
	КонецЕсли;
	
	Если ПараметрыОбработки.Свойство("ПровестиСтатусыПриемок") тогда
		ПровестиСтатусыПриемок();
	КонецЕсли;	
	
	Если ПараметрыОбработки.Свойство("ПроверкаЗаявокСОтказом") тогда
		ПроверкаЗаявокСОтказом();
	КонецЕсли;	
	
	
	Если ПараметрыОбработки.Свойство("ОбновитьМарки") 
		и ДеньНедели(ТекущаяДата())=1
		и Час(ТекущаяДата())=5
		тогда
		//Обработка = Обработки.ЗагрузкаМарокИМоделей.Создать();
		//Обработка.Обновить();
	КонецЕсли;
	
	Если ПараметрыОбработки.Свойство("ПроставитьБонусыРекомендаций") и ПараметрыОбработки.ПроставитьБонусыРекомендаций = Истина Тогда
		ПроставитьБонусыРекомендаций();
	КонецЕсли;	
	Если ПараметрыОбработки.Свойство("ПроставитьБонусыКоробок") и ПараметрыОбработки.ПроставитьБонусыКоробок = Истина Тогда
		ПроставитьБонусыКоробок();
	КонецЕсли;	
			
КонецПроцедуры


Процедура ИнициализироватьПараметры() Экспорт 
	Час = Час(ТекущаяДата());
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ЗаполнитьВДокументахОплатаПолисовСхемуРасчетаСМенеджером",Истина);
	ПараметрыОбработки.Вставить("ПроверкаКорректностиПВХНастройкиПользователя",Истина);
	ПараметрыОбработки.Вставить("ПроверкаОплатПолисовБезИстории",Истина);
	ПараметрыОбработки.Вставить("УдалитьЛишниеВзаиморасчетыВСК",Истина);
	ПараметрыОбработки.Вставить("ДобавитьОтсутствующиеОплатыВСК",Истина);
	//ПараметрыОбработки.Вставить("ПроверкаОплатСПоступлениемПоКвитанцииПозжеДвижения",ЛОЖЬ);
	ПараметрыОбработки.Вставить("Оплаты_Поставщику_С_НулевойСуммой",Истина);
	ПараметрыОбработки.Вставить("ПроверкаЗависшихСоединений",Истина);
	//ПараметрыОбработки.Вставить("ПроверкаПерезапускаРабочихПроцессовСервера",Истина);
	//ПараметрыОбработки.Вставить("ПроверитьЗаполнитьПредопределенные",Истина);
	//ПараметрыОбработки.Вставить("ПроверкаНаличияДанныхКонфигурации",Истина);
	ПараметрыОбработки.Вставить("ИсправитьИтогиОтчетовПоставщику",Истина);	
	ПараметрыОбработки.Вставить("ПроверкаСКВ",Истина);	
	ПараметрыОбработки.Вставить("ОбновитьМарки",Истина);	
	ПараметрыОбработки.Вставить("ПроверкаНаличияПеремещений",Истина);	
	
	
	ПараметрыОбработки.Вставить("ПроверитьШтрафыЗаОпоздание",Истина);
	ПараметрыОбработки.Вставить("ПодсчетКоличестваФайловВЗаявке",Истина);
	//ПараметрыОбработки.Вставить("АнализРекомендаций",ЛОЖЬ);
	ПараметрыОбработки.Вставить("СинхронизироватьАгентаВПеремещениях",Истина);
	Если Час >2 и Час<4 Тогда
		ПараметрыОбработки.Вставить("ОбработатьСтраховойПолисВДвижениях",Истина);
	КонецЕсли;	
	ПараметрыОбработки.Вставить("ПровестиСтатусыПриемок",Истина);
	ПараметрыОбработки.Вставить("ПроверкаЗаявокСОтказом",Истина);
	ПараметрыОбработки.Вставить("ПроставитьБонусыРекомендаций",Истина);
	ПараметрыОбработки.Вставить("ПроставитьБонусыКоробок",Истина);
	ПараметрыОбработки.Вставить("СинхронизироватьЕстьЧек",Истина);
	
	
	
КонецПроцедуры	


Процедура ПроверитьЗаполненностьНастроекКонфигурации()
	// 
	СпрМенеджерКонстанты = Справочники.уб_Константы;
	Если СпрМенеджерКонстанты.уб_ПодразделениеОтделаПродаж.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ПодразделениеОтделаПродаж", Справочники.ПодразделенияОрганизаций.ПустаяСсылка(), ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ОсновноеПодразделениеПоУчетуБСО.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ОсновноеПодразделениеПоУчетуБСО", Справочники.ПодразделенияОрганизаций.ПустаяСсылка(), ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ПодразделениеАгентскойСети.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ПодразделениеАгентскойСети", Справочники.ПодразделенияОрганизаций.ПустаяСсылка(), ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ПодразделениеСВС.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ПодразделениеСВС", Справочники.ПодразделенияОрганизаций.ПустаяСсылка(), ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаСотрудников.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаСотрудников", Справочники.ФизическиеЛица.Сотрудники, ЛОЖЬ);
	КонецЕсли;
	//Если СпрМенеджерКонстанты.уб_ГруппаСтрахователейФизЛиц.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаСтрахователейФизЛиц", Справочники.ФизическиеЛица.ПустаяСсылка(), ЛОЖЬ);
	//КонецЕсли;
	//Если СпрМенеджерКонстанты.уб_ГруппаСтрахователейЮрЛиц.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаСтрахователейЮрЛиц", Справочники.Контрагенты.ПустаяСсылка(), ЛОЖЬ);
	//КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаАгентовФизЛиц.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаАгентовФизЛиц", Справочники.ФизическиеЛица.Агенты, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаАгентовЮрЛиц.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаАгентовЮрЛиц", Справочники.Контрагенты.АгентыЮрЛица, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаПоставщиков.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаПоставщиков", Справочники.Контрагенты.Поставщики, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаСК.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаСК", Справочники.Контрагенты.СтраховыеКомпании, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ГруппаСотрудниковКурьеров.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ГруппаСотрудниковКурьеров", Справочники.ФизическиеЛица.Курьеры, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_НеактивныеКонтрагенты.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_НеактивныеКонтрагенты", Справочники.Контрагенты.НЕАКТИВНЫЕ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.ОтключитьДвиженияВПолисе.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("ОтключитьДвиженияВПолисе", ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.ОчищатьСообщенияПриЗаписиДокументов.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("ОчищатьСообщенияПриЗаписиДокументов", ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_КонтролироватьОстаткиБСО.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_КонтролироватьОстаткиБСО", ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_КонтролироватьНаличиеБСО.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_КонтролироватьНаличиеБСО", ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_КонтролироватьНаличиеСвободныхНомеровПриПроведенииПолиса.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_КонтролироватьНаличиеСвободныхНомеровПриПроведенииПолиса", ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_РискОсаго.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_РискОсаго", Справочники.уб_СтраховыеРиски.ОСАГО, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_СуммаОсаго.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_СуммаОсаго", 400000, ЛОЖЬ);
	КонецЕсли;
	Если СпрМенеджерКонстанты.уб_ДатаЗапретаДляМониторинга.ЗначениеКонстанты = Неопределено Тогда
		уб_ВызовСервера.УстановитьЗначениеКонстанты("уб_ДатаЗапретаДляМониторинга", НачалоГода(ТекущаяДата()), ЛОЖЬ);
	КонецЕсли;
	//
КонецПроцедуры	




Процедура ПроверкаОплатПолисовБезИстории() Экспорт
	
	Если ПравоДоступа("Вывод", Метаданные) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		| Вложенный.Ссылка,
		| Вложенный.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		| (ВЫБРАТЬ
		|  уб_ОплатаПолисов.Ссылка КАК Ссылка,
		|  уб_ИсторияОбъект.НомерВерсии КАК НомерВерсии,
		|  уб_ОплатаПолисов.МоментВремени КАК МоментВремени,
		|  уб_ОплатаПолисов.ДатаСоздания КАК ДатаСоздания
		| ИЗ
		|  Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
		|   ПО уб_ОплатаПолисов.Ссылка = уб_ИсторияОбъект.ОбъектИстории
		| ГДЕ
		|  уб_ИсторияОбъект.НомерВерсии ЕСТЬ NULL ) КАК Вложенный
		|
		|УПОРЯДОЧИТЬ ПО
		| ДатаСоздания");
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() <> 0 Тогда
			Файл = Новый ТекстовыйДокумент;
			Для Каждого Строка Из Результат Цикл
				Файл.ДобавитьСтроку("<P>" + Строка.Ссылка + "</P>");
			КонецЦикла;
			Попытка
				ПутьФайла = КаталогВременныхФайлов() + "OP_errors.htm";
				Файл.Записать(ПутьФайла);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось записать " + ПутьФайла,, Истина);
				Возврат;
			КонецПопытки;
			Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			Параметры.Получатели	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
			Параметры.Тема			= "Не имеют истории документы ""ОплатаПолисов"" из файла во вложении";
			Параметры.Сообщение		= "<P> Всего <B>" + Результат.Количество() + "</B> оплат не имеют истории.</P>";
			Параметры.Вложения		= ПутьФайла;
			Попытка
				//уб_ОбменДанными.SendMail(ПараметрыСеанса.уб_Константы.АдресДоставкиЛога, "Не имеют истории документы ""ОплатаПолисов"" из файла во вложении","<P> Всего <B>"+Результат.Количество()+"</B> оплат не имеют истории.</P>",ПутьФайла);	
				уб_ОбменДанными.SendMail(Параметры);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось отправить по почте " + ПутьФайла,, Истина);
			КонецПопытки;
			УдалитьФайлы(КаталогВременныхФайлов(), "OP_errors*.*");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьЛишниеВзаиморасчетыВСК() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка,
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Сумма,
	|	уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК уб_ВзаиморасчетСПоставщикомРаспределение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|		ПО уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику = уб_ОплатаПолисов.ОтчетПоставщику
	|			И уб_ВзаиморасчетСПоставщикомРаспределение.Уточнение = уб_ОплатаПолисов.Ссылка
	|ГДЕ
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	|	И (уб_ОплатаПолисов.Ссылка ЕСТЬ NULL 
	|			ИЛИ уб_ОплатаПолисов.ОтчетПоставщику.ОрганизацияАгент <> уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.ОрганизацияАгент
	|			ИЛИ уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику <> уб_ВзаиморасчетСПоставщикомРаспределение.Сумма)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка,
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Сумма,
	|	уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК уб_ВзаиморасчетСПоставщикомРаспределение
	|ГДЕ
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	|	И уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	|	И уб_ВзаиморасчетСПоставщикомРаспределение.Сумма = уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.СуммаДокумента") ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();	
		Объект.Удалить();
	КонецЦикла;
	
КонецПроцедуры	


Процедура ДобавитьОтсутствующиеОплатыВСК() Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Запрос = Новый Запрос;
	Если СистемаНаправлениеПлатежа Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.Ссылка КАК Оплата,
		|	уб_ОплатаПолисов.ОтчетПоставщику КАК ОтчетПоставщику
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	уб_ОплатаПолисов.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.уб_НаправленияПлатежа.Поставщику)
		|	И НЕ уб_ОплатаПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
		|	И НЕ уб_ОплатаПолисов.ПометкаУдаления";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.Ссылка КАК Оплата,
		|	уб_ОплатаПолисов.ОтчетПоставщику КАК ОтчетПоставщику
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	уб_ОплатаПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
		|	И НЕ уб_ОплатаПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
		|	И НЕ уб_ОплатаПолисов.ПометкаУдаления";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка"));
	Для Каждого СтрокаТЧ Из Таблица Цикл		
		СтрокаТЧ.УникальныйИдентификатор = Строка(СтрокаТЧ.Оплата.УникальныйИдентификатор());		
	КонецЦикла;
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = "ВЫБРАТЬ
	|	Таблица.Оплата,
	|	Таблица.ОтчетПоставщику,
	|	Таблица.УникальныйИдентификатор
	|ПОМЕСТИТЬ ВТ_Оплаты
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оплаты.Оплата,
	|	ВТ_Оплаты.ОтчетПоставщику КАК ОтчетПоставщику,
	|	ВТ_Оплаты.УникальныйИдентификатор,
	|	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка КАК СсылкаВзаиморасчет
	|ПОМЕСТИТЬ ВТ_ОплатыСВзаиморасчетом
	|ИЗ
	|	ВТ_Оплаты КАК ВТ_Оплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК уб_ВзаиморасчетСПоставщикомРаспределение
	|		ПО ((ВЫРАЗИТЬ(ВТ_Оплаты.УникальныйИдентификатор КАК СТРОКА(36))) = (ВЫРАЗИТЬ(уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.IDизБухДок КАК СТРОКА(36))))
	|			И ВТ_Оплаты.ОтчетПоставщику = уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику
	|           И ВТ_Оплаты.Оплата = уб_ВзаиморасчетСПоставщикомРаспределение.Уточнение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОплатыСВзаиморасчетом.Оплата,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.Валюта КАК ОплатаВалюта,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.Дата КАК ОплатаДата,	
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.ПлатежныйДокумент_Дата КАК ОплатаПлатежныйДокумент_Дата,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.ПлатежныйДокумент_Номер КАК ОплатаПлатежныйДокумент_Номер,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.Поставщик КАК ОплатаПоставщик,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику КАК ОплатаПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.ОрганизацияАгент КАК ОплатаОрганизацияАгент,
	|	ВТ_ОплатыСВзаиморасчетом.Оплата.ОтчетПоставщику.ОрганизацияАгент КАК ОтчетПоставщикуОрганизацияАгент,
	|	ВТ_ОплатыСВзаиморасчетом.ОтчетПоставщику,
	|	ВТ_ОплатыСВзаиморасчетом.УникальныйИдентификатор
	|ИЗ
	|	ВТ_ОплатыСВзаиморасчетом КАК ВТ_ОплатыСВзаиморасчетом
	|ГДЕ
	|	ВТ_ОплатыСВзаиморасчетом.СсылкаВзаиморасчет ЕСТЬ NULL ";
	ЗапросДокументов.УстановитьПараметр("Таблица", Таблица);			
	Выборка = ЗапросДокументов.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОплатаПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику<=0 Тогда
			Продолжить;
		КонецЕсли;	
		Оплата = Выборка.Оплата;
		Док = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
		Док.Дата 						= Выборка.ОплатаДата;
		Док.IDизБухДок 					= Выборка.УникальныйИдентификатор;
		Док.ВалютаДокумента 			= Выборка.ОплатаВалюта;
		Док.ДатаВходящегоДокумента  	= Выборка.ОплатаПлатежныйДокумент_Дата;
		Док.НомерВходящегоДокумента 	= Выборка.ОплатаПлатежныйДокумент_Номер;
		Док.ДокументИсточникОтсутствует = Истина;
		Док.ИсключитьИзВзаиморасчетов   = Ложь;
		Док.Категория     				= Перечисления.уб_КатегорияЗадолженности.ЕстьОтчетПоставщику;
		Док.Комментарий   				= "Создано автоматичеcки при привязке оплаты полиса к Отчету Поставщику";
		Док.Контрагент    				= Выборка.ОплатаПоставщик;
		Док.Поставщик     				= Выборка.ОплатаПоставщик;
		Док.НаправлениеРасчетов 		= Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем;
		Док.НеИзменятьПриЗагрузке 		= Ложь;
		Док.СуммаДокумента 				= Выборка.ОплатаПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
		Док.ОрганизацияАгент 			= Выборка.ОтчетПоставщикуОрганизацияАгент;
		Док.Ответственный    			= ПараметрыСеанса.ТекущийПользователь;
		Док.ФормаОплаты      			= Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;
		СтрокаРаспределения = Док.Распределение.Добавить();
		СтрокаРаспределения.ОтчетПоставщику = Выборка.ОтчетПоставщику;
		СтрокаРаспределения.Сумма 			= Док.СуммаДокумента;
		СтрокаРаспределения.Уточнение       =  Выборка.Оплата;
		Док.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;	
	
КонецПроцедуры	

Функция ОбработатьОтчетСОплатойПоставщику(ТекОтчет) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка,
	               |	уб_ВзаиморасчетСПоставщикомРаспределение.Сумма,
	               |	уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК уб_ВзаиморасчетСПоставщикомРаспределение
	               |ГДЕ
	               |	уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику = &ОтчетПоставщику
	               |	И уб_ВзаиморасчетСПоставщикомРаспределение.Уточнение = ЗНАЧЕНИЕ(Документ.уб_ОплатаПолисов.ПустаяСсылка)
				   |    и уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)";
				   Запрос.УстановитьПараметр("ОтчетПоставщику",ТекОтчет);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		 Объект = Выборка.Ссылка.ПолучитьОбъект();	
		 Объект.Удалить();
	 КонецЦикла;	
	 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	уб_ОплатаПолисов.Ссылка КАК Оплата,
	                |	уб_ОплатаПолисов.ФормаОплаты,
	                |	уб_ОплатаПолисов.ОтчетПоставщику,
	                |	Распределение.Ссылка КАК Ссылка1,
	                |	уб_ОплатаПолисов.Дата,
	                |	уб_ОплатаПолисов.Валюта,
	                |	уб_ОплатаПолисов.ПлатежныйДокумент_Дата,
	                |	уб_ОплатаПолисов.ПлатежныйДокумент_Номер,
	                |	уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
	                |	уб_ОплатаПолисов.ОтчетПоставщику.ОрганизацияАгент КАК ОтчетПоставщикуОрганизацияАгент,
	                |	уб_ОплатаПолисов.Поставщик
	                |ИЗ
	                |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Распределение
	                |		ПО (Распределение.ОтчетПоставщику = уб_ОплатаПолисов.ОтчетПоставщику)
	                |			И (Распределение.Уточнение = уб_ОплатаПолисов.Ссылка)
	                |ГДЕ
	                |	уб_ОплатаПолисов.ОтчетПоставщику = &ОтчетПоставщику
	                |	И НЕ уб_ОплатаПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	                |	И уб_ОплатаПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	                |	И Распределение.Ссылка ЕСТЬ NULL ";
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Оплата = Выборка.Оплата;
		Док = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
		Док.Дата 						= Выборка.Дата;
		Док.IDизБухДок 					= Выборка.Оплата.УникальныйИдентификатор();
		Док.ВалютаДокумента 			= Выборка.Валюта;
		Док.ДатаВходящегоДокумента  	= Выборка.ПлатежныйДокумент_Дата;
		Док.НомерВходящегоДокумента 	= Выборка.ПлатежныйДокумент_Номер;
		Док.ДокументИсточникОтсутствует = Истина;
		Док.ИсключитьИзВзаиморасчетов   = Ложь;
		Док.Категория     				= Перечисления.уб_КатегорияЗадолженности.ЕстьОтчетПоставщику;
		Док.Комментарий   				= "Создано автоматичеcки при привязке оплаты полиса к Отчету Поставщику";
		Док.Контрагент    				= Выборка.Поставщик;
		Док.Поставщик     				= Выборка.Поставщик;
		Док.НаправлениеРасчетов 		= Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем;
		Док.НеИзменятьПриЗагрузке 		= Ложь;
		Док.СуммаДокумента 				= Выборка.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
		Док.ОрганизацияАгент 			= Выборка.ОтчетПоставщикуОрганизацияАгент;
		Док.Ответственный    			= ПараметрыСеанса.ТекущийПользователь;
		Док.ФормаОплаты      			= Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;
		СтрокаРаспределения = Док.Распределение.Добавить();
		СтрокаРаспределения.ОтчетПоставщику = Выборка.ОтчетПоставщику;
		СтрокаРаспределения.Сумма 			= Док.СуммаДокумента;
		СтрокаРаспределения.Уточнение       =  Выборка.Оплата;
		Док.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;	
КонецФункции	

Процедура ПроверкаОплатСПоступлениемПоКвитанцииПозжеДвижения(РежимТестирования=Неопределено)
	
	Запрос= Новый Запрос("ВЫБРАТЬ
	                     |	уб_ОплатаПолисов.НомерКвитанции,
	                     |	уб_ДвиженияБСО.Период,
	                     |	уб_ДвиженияБСО.Регистратор,
	                     |	уб_ОплатаПолисов.Ссылка КАК Оплата,
	                     |	Перемещения.Регистратор.Дата КАК Дата,
	                     |	РАЗНОСТЬДАТ(уб_ОплатаПолисов.Дата, Перемещения.Регистратор.Дата, ДЕНЬ) КАК Поле1
	                     |ИЗ
	                     |	РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	                     |		ПО уб_ДвиженияБСО.НомерБСО = уб_ОплатаПолисов.НомерКвитанции
	                     |			И (уб_ДвиженияБСО.Активность)
	                     |			И (уб_ДвиженияБСО.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО)
	                     |			И уб_ДвиженияБСО.Период > уб_ОплатаПолисов.ДатаПроведенияБСО
	                     |			И (уб_ДвиженияБСО.КодОперации = ЗНАЧЕНИЕ(Перечисление.уб_КодыОперацийБСО.ОформлениеКвитанции))
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                     |			уб_ДвиженияБСО.НомерБСО КАК НомерБСО,
	                     |			МАКСИМУМ(уб_ДвиженияБСО.Регистратор) КАК Регистратор
	                     |		ИЗ
	                     |			РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	                     |		ГДЕ
	                     |			уб_ДвиженияБСО.КодОперации = ЗНАЧЕНИЕ(Перечисление.уб_КодыОперацийБСО.ОформлениеКвитанции)
	                     |			И уб_ДвиженияБСО.Активность
	                     |			И уб_ДвиженияБСО.Регистратор ССЫЛКА Документ.уб_ПеремещениеБСО
	                     |			И уб_ДвиженияБСО.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку)
	                     |		
	                     |		СГРУППИРОВАТЬ ПО
	                     |			уб_ДвиженияБСО.НомерБСО,
	                     |			уб_ДвиженияБСО.Регистратор.МоментВремени) КАК Перемещения
	                     |		ПО уб_ДвиженияБСО.НомерБСО = Перемещения.НомерБСО
	                     |ГДЕ
	                     |	НЕ Перемещения.Регистратор ЕСТЬ NULL 
	                     |	И РАЗНОСТЬДАТ(уб_ОплатаПолисов.Дата, Перемещения.Регистратор.Дата, ДЕНЬ) < 10");
	
	выборка= Запрос.Выполнить().Выбрать();
	Если НЕ РежимТестирования =Неопределено Тогда
		//Режим Тестирования
		Результат = Выборка.Количество();
		Возврат;
	КонецЕсли;	
	Пока Выборка.Следующий() Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние(Выборка.Дата);
		#КонецЕсли
		
		об = Выборка.Оплата.ПолучитьОбъект();
		об.ДатаПроведенияБСО = Макс(Выборка.Дата,Выборка.Период)+1;
		//об.ОбменДанными.Загрузка = Истина;
		Попытка
			об.Записать();
			Об2  = об.СтраховойПолис.ПолучитьОбъект();
			Если Об.Проведен Тогда
				Если Об2.ОтключитьКонтрольНомеровБСО Тогда
					ОтключитьКонтрольНомеровБСО = ложь;
				КонецЕсли;	
				Об2.Записать (РежимЗаписиДокумента.Проведение);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры



Процедура ПроверитьЗаполнитьПредопределенные()
	
	//TODO Заменить по новому
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//|	уб_ВидыРасчетныхОпераций.Ссылка
	//|ИЗ
	//|	Справочник.уб_ВидыРасчетныхОпераций КАК уб_ВидыРасчетныхОпераций
	//|ГДЕ
	//|	уб_ВидыРасчетныхОпераций.Предопределенный
	//|	И уб_ВидыРасчетныхОпераций.ОперацияДоступна = ЛОЖЬ");
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//МенятьДоступность = Выборка.Количество()>5;
	//
	//Пока Выборка.Следующий() Цикл
	//	//
	//	Имя = Справочники.уб_ВидыРасчетныхОпераций.ПолучитьИмяПредопределенного(выборка.Ссылка);
	//	Объект = Выборка.Ссылка.ПолучитьОбъект();
	//	
	//	Если Имя = "ПриемкаОтКлиентаБрокером" Тогда		
	//		Объект.Клиент          = 1;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = -1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ПриемкаОплат";	
	//		Объект.Автоматическая  = Истина;
	//		Объект.Комментарий     = "";

	//	ИначеЕсли Имя = "ПриемкаОтКлиентаПоставщиком" Тогда		
	//		Объект.Клиент          = 1;
	//		Объект.Поставщик       = -1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ПриемкаОплат";	
	//		Объект.Автоматическая  = Истина;
	//		Объект.Комментарий     = "";
	//	ИначеЕсли Имя = "ПриемкаОтКлиентаСК" Тогда		
	//		//Объект.Клиент          = ;
	//		//Объект.Поставщик       = ;
	//		//Объект.Агент           = ;
	//		//Объект.ПоставщикКлиент = ;	
	//		//Объект.Касса           = ;	
	//		//Объект.ДоходБрокера    = ;		
	//		//Объект.Принадлежность  = "уб_ПриемкаОплат";	
	//		//Объект.Комментарий     = "";
	//		//Объект.Автоматическая  =Ложь;
	//	ИначеЕсли Имя = "НачислениеСтраховогоВзноса" Тогда	
	//		Объект.Клиент          = -1;
	//		Объект.Поставщик       = 1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Ложь;
	//	ИначеЕсли Имя = "НачислениеКВБрокера" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = -1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = 1;		
	//		Объект.Принадлежность  = "уб_ОплатаПолисов";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Ложь;
	//	ИначеЕсли Имя = "СкидкаКлиентуИзДБ" Тогда		
	//		Объект.Клиент          = 1;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = -1;		
	//		Объект.Принадлежность  = "уб_ОплатаПолисов";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Ложь;
	//	ИначеЕсли Имя = "НачислениеВМ" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = 1;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = -1;		
	//		Объект.Принадлежность  = "уб_ОплатаПолисов,уб_НачислениеЗП";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Ложь;
	//	ИначеЕсли Имя = "ВыплатаМенеджеру" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = -1;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ВыплатаЗП";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	//	ИначеЕсли Имя = "ПеречисленоПоставщику" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = -1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ВзаиморасчетСПоставщиком";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	//	ИначеЕсли Имя = "ПоставщикВыплатилКВ" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = -1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ВзаиморасчетСПоставщиком";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	// 	ИначеЕсли Имя = "ВозвратОтПоставщика" Тогда
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 1;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = -1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ВзаиморасчетСПоставщиком";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	//	ИначеЕсли Имя = "УдержаниеИзВМ" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = -1;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = 1;		
	//		Объект.Принадлежность  = "уб_ОплатаПолисов";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Ложь;
	//	ИначеЕсли Имя = "ОплаченоМенеджером" Тогда	
	//		Объект.Клиент          = 0;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = 1;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = -1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ВыплатаЗП";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	// 	ИначеЕсли Имя = "ВыплатаКлиенту" Тогда	
	//		Объект.Клиент          = -1;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = 0;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 1;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ПриемкаОплат";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;
	//	ИначеЕсли Имя = "УдержаноМенеджеромИзДСКлиента" Тогда	
	//		Объект.Клиент          = 1;
	//		Объект.Поставщик       = 0;
	//		Объект.Агент           = -1;
	//		Объект.ПоставщикКлиент = 0;	
	//		Объект.Касса           = 0;	
	//		Объект.ДоходБрокера    = 0;		
	//		Объект.Принадлежность  = "уб_ПриемкаОплат";	
	//		Объект.Комментарий     = "";
	//		Объект.Автоматическая  = Истина;	
	//		
	//	//ИначеЕсли Имя = "ПоставщикПринялОбязательства" Тогда	
	//	//	Объект.Клиент = ;
	//	//	Объект.Поставщик = ;
	//	//	Объект.Агент = ;
	//	//	Объект.ПоставщикКлиент = ;	
	//	//	Объект.Касса = ;	
	//	//	Объект.ДоходБрокера = ;		
	//	//	Объект.Принадлежность = "";	
	//	//	Объект.Комментарий = "";

	//		//ИначеЕсли Имя = "" Тогда			
	//	КонецЕсли;
	//	Если МенятьДоступность Тогда
	//		Объект.ОперацияДоступна = Истина;
	//	КонецЕсли;
	//	Объект.Записать();
	//КонецЦикла;	  
	
КонецПроцедуры	

//Вызывает принудительный перерасчет итогов отчета поставщику, в которых исключены все оплаты
Процедура ИсправитьИтогиОтчетовПоставщику() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Итоги.ОтчетПоставщику,
	               |	СУММА(Итоги.Задолженность - Итоги.ЗадолженностьПоКВ) КАК ФактЗадолженность,
	               |	СУММА(Итоги.Задолженность) КАК Задолженность,
	               |	СУММА(Итоги.ЗадолженностьПоКВ) КАК ЗадолженностьПоКВ,
	               |	СУММА(Итоги.Начислено) КАК Начислено,
	               |	СУММА(Итоги.НачисленоПоКВ) КАК НачисленоПоКВ,
	               |	СУММА(Итоги.НачисленоПоКВДляОтчета) КАК НачисленоПоКВДляОтчета,
	               |	СУММА(Итоги.Оплачено) КАК Оплачено,
	               |	СУММА(Итоги.ОплаченоКВ) КАК ОплаченоКВ,
	               |	СУММА(Итоги.ОплаченоФакт) КАК ОплаченоКлиентомФакт,
	               |	СУММА(Итоги.СкидкаКлиенту) КАК СкидкаКлиенту,
	               |	МАКСИМУМ(Итоги.Дата) КАК Дата,
	               |	МАКСИМУМ(Итоги.ОтчетПоставщику.Поставщик.АльтернативноеУдержаниеДопКВ) КАК АльтернативноеУдержаниеДопКВ,
	               |	СУММА(Итоги.Баланс_Брокер_Поставщик) КАК Баланс_Брокер_Поставщик,
	               |	СУММА(Итоги.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	               |	СУММА(Итоги.КВСуммаДляОтчета) КАК КВСуммаДляОтчета,
	               |	СУММА(Итоги.КВСумма) КАК КВСумма,
	               |	МАКСИМУМ(Итоги.ОтчетПоставщикуДата) КАК ОтчетПоставщикуДата,
	               |	МАКСИМУМ(Итоги.ОтчетПоставщикуНомер) КАК ОтчетПоставщикуНомер,
	               |	ЕСТЬNULL(Итоги.ОтчетПоставщику.НомерОтчетаПоставщику, """") КАК НомерОтчетаПоставщику,
	               |	ЕСТЬNULL(Итоги.ОтчетПоставщику.ВидВзаиморасчета, """") КАК ВидВзаиморасчета
	               |ПОМЕСТИТЬ ВТ_СостояниеПромежуточная
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ОплатыПолисов.ОтчетПоставщику КАК ОтчетПоставщику,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	               |						ТОГДА 0
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК Задолженность,
	               |		СУММА(ОплатыПолисов.ОплаченоФакт) КАК ОплаченоФакт,
	               |		СУММА(ОплатыПолисов.АВилиСкидкаСумма) КАК СкидкаКлиенту,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма - ВЫБОР
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	               |						ТОГДА 0
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоКВ,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	               |						ТОГДА 0
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК Начислено,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК ЧИСЛО(15, 2)) КАК НачисленнаяСуммаВзноса,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма - ВЫБОР
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	               |						ТОГДА 0
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СУдержаниемКВ)
	               |						ТОГДА ОплатыПолисов.КВСумма
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК НачисленоПоКВ,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСуммаДляОтчета - ВЫБОР
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	               |						ТОГДА ОплатыПолисов.КВСуммаДляОтчета
	               |					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	               |						ТОГДА 0
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	               |						ТОГДА ОплатыПолисов.КВСуммаДляОтчета
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК НачисленоПоКВДляОтчета,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма) КАК ЧИСЛО(15, 2)) КАК КВСумма,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСуммаДляОтчета) КАК ЧИСЛО(15, 2)) КАК КВСуммаДляОтчета,
	               |		0 КАК Оплачено,
	               |		0 КАК ОплаченоКВ,
	               |		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.Баланс_Брокер_Поставщик) КАК ЧИСЛО(15, 2)) КАК Баланс_Брокер_Поставщик,
	               |		NULL КАК Дата,
	               |		МАКСИМУМ(ОплатыПолисов.ОтчетПоставщику.Номер) КАК ОтчетПоставщикуНомер,
	               |		МАКСИМУМ(ОплатыПолисов.ОтчетПоставщику.Дата) КАК ОтчетПоставщикуДата
	               |	ИЗ
	               |		Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	               |	ГДЕ
	               |		НЕ ОплатыПолисов.ПометкаУдаления
	               |		И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
	               |		И НЕ ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |		И &УсловиеГде1
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ОплатыПолисов.ОтчетПоставщику
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПлатежныеВедомости.ОтчетПоставщику,
	               |		ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		ПлатежныеВедомости.Ссылка.Дата,
	               |		ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |		ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	ИЗ
	               |		Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	               |	ГДЕ
	               |		НЕ ПлатежныеВедомости.Ссылка.ПометкаУдаления
	               |		И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |		И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	               |		И ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |		И &УсловиеГде2
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ДВОУ.Ссылка,
	               |		ВЫБОР
	               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		ДВОУ.Ссылка.Дата,
	               |		ДВОУ.ВнешнийНомер,
	               |		ДВОУ.Дата
	               |	ИЗ
	               |		Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
	               |	ГДЕ
	               |		НЕ ДВОУ.Ссылка.ПометкаУдаления
	               |		И &УсловиеГде3) КАК Итоги
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Итоги.ОтчетПоставщику,
	               |	ЕСТЬNULL(Итоги.ОтчетПоставщику.НомерОтчетаПоставщику, """"),
	               |	ЕСТЬNULL(Итоги.ОтчетПоставщику.ВидВзаиморасчета, """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СостояниеОП.ОтчетПоставщику,
	               |	ВТ_СостояниеОП.ФактЗадолженность,
	               |	ВЫБОР
	               |		КОГДА ВТ_СостояниеОП.ФактЗадолженность = 0
	               |				ИЛИ ВТ_СостояниеОП.Начислено - ВТ_СостояниеОП.НачисленоПоКВ = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ (ВТ_СостояниеОП.Оплачено - ВТ_СостояниеОП.ОплаченоКВ) / (ВТ_СостояниеОП.Начислено - ВТ_СостояниеОП.НачисленоПоКВ)
	               |	КОНЕЦ КАК КоэфОплаченности,
	               |	ВЫБОР
	               |		КОГДА ВТ_СостояниеОП.Задолженность = 0
	               |				ИЛИ ВТ_СостояниеОП.Начислено = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ВТ_СостояниеОП.Оплачено / ВТ_СостояниеОП.Начислено
	               |	КОНЕЦ КАК КоэфОплаченностиВзноса,
	               |	ВЫБОР
	               |		КОГДА ВТ_СостояниеОП.ЗадолженностьПоКВ = 0
	               |				ИЛИ ВТ_СостояниеОП.НачисленоПоКВ = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ВТ_СостояниеОП.ОплаченоКВ / ВТ_СостояниеОП.НачисленоПоКВ
	               |	КОНЕЦ КАК КоэфОплаченностиКВ,
	               |	ВТ_СостояниеОП.Задолженность,
	               |	ВТ_СостояниеОП.ЗадолженностьПоКВ,
	               |	ВТ_СостояниеОП.Начислено,
	               |	ВТ_СостояниеОП.НачисленоПоКВ,
	               |	ВТ_СостояниеОП.НачисленоПоКВДляОтчета,
	               |	ВТ_СостояниеОП.Оплачено,
	               |	ВТ_СостояниеОП.ОплаченоКВ,
	               |	ВТ_СостояниеОП.Дата,
	               |	ВТ_СостояниеОП.АльтернативноеУдержаниеДопКВ,
	               |	ВТ_СостояниеОП.Баланс_Брокер_Поставщик,
	               |	ВТ_СостояниеОП.НачисленнаяСуммаВзноса,
	               |	ВТ_СостояниеОП.ОтчетПоставщику.ИтогОС_НачисленнаяСуммаВзноса,
	               |	ВТ_СостояниеОП.КВСуммаДляОтчета,
	               |	ВТ_СостояниеОП.КВСумма,
	               |	ВТ_СостояниеОП.КВСумма - ВТ_СостояниеОП.КВСуммаДляОтчета КАК ДопКВ,
	               |	ВТ_СостояниеОП.ОтчетПоставщикуДата,
	               |	ВТ_СостояниеОП.ОтчетПоставщикуНомер,
	               |	ВТ_СостояниеОП.НомерОтчетаПоставщику,
	               |	ВТ_СостояниеОП.ВидВзаиморасчета,
	               |	ВТ_СостояниеОП.ОплаченоКлиентомФакт,
	               |	ВТ_СостояниеОП.СкидкаКлиенту
	               |ИЗ
	               |	ВТ_СостояниеПромежуточная КАК ВТ_СостояниеОП
	               |ГДЕ
	               |	ВТ_СостояниеОП.НачисленнаяСуммаВзноса <> ВТ_СостояниеОП.ОтчетПоставщику.ИтогОС_НачисленнаяСуммаВзноса
				   |Или ВТ_СостояниеОП.КВСуммаДляОтчета <> ВТ_СостояниеОП.ОтчетПоставщику.ИтогОС_КВ
	|Или (ВТ_СостояниеОП.КВСумма - ВТ_СостояниеОП.КВСуммаДляОтчета) <> ВТ_СостояниеОП.ОтчетПоставщику.ИтогОС_КВДоп
	|Или ВТ_СостояниеОП.Баланс_Брокер_Поставщик <> ВТ_СостояниеОП.ОтчетПоставщику.ИтогОС_КПеречислениюПоставщику";
				   Запрос.УстановитьПараметр("УсловиеГде1",Истина);
				   Запрос.УстановитьПараметр("УсловиеГде2",Истина);
				   Запрос.УстановитьПараметр("УсловиеГде3",Истина);
				   Запрос.УстановитьПараметр("ВидВзаиморасчетовСУдержаниемКВ",Неопределено);
				   Выборка= Запрос.Выполнить().Выбрать();
				   Пока Выборка.Следующий() Цикл
					   Об =Выборка.ОтчетПоставщику.ПолучитьОбъект();
					   Об.ОбменДанными.Загрузка = Истина;
					   Об.ИтогОС_КПеречислениюПоставщику	= Выборка.Баланс_Брокер_Поставщик;
		Об.ИтогОС_КВ		= Выборка.КВСуммаДляОтчета;
		Об.ИтогОС_НачисленнаяСуммаВзноса	= Выборка.НачисленнаяСуммаВзноса;
		Об.ИтогОС_КВДоп		            = Выборка.ДопКВ;
		Об.Записать();
				КонецЦикла;
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	К.ЗначениеКонстанты
	//|ПОМЕСТИТЬ ВТ_ПоКарточкам
	//|ИЗ
	//|	Справочник.уб_Константы КАК К
	//|ГДЕ
	//|	К.Ссылка = ЗНАЧЕНИЕ(Справочник.уб_Константы.ПоставщикДляОтчетаПоКарточкам)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Отч.Ссылка,
	//|	Отч.ИтогОС_НачисленнаяСуммаВзноса,
	//|	Отч.ИтогОС_КВ,
	//|	Отч.ИтогОС_КВДоп,
	//|	Отч.ИтогОС_КПеречислениюПоставщику
	//|ИЗ
	//|	Документ.уб_ОтчетПоставщику КАК Отч
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоКарточкам КАК ВТ_ПоКарточкам
	//|		ПО (Отч.Поставщик <> ЕСТЬNULL(ВТ_ПоКарточкам.ЗначениеКонстанты, НЕОПРЕДЕЛЕНО))
	//|ГДЕ
	//|	НЕ Отч.Ссылка В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					ОП.ОтчетПоставщику
	//|				ИЗ
	//|					Документ.уб_ОплатаПолисов КАК ОП
	//|				ГДЕ
	//|					ОП.ОтчетПоставщику <> ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка))
	//|	И (Отч.ИтогОС_НачисленнаяСуммаВзноса <> 0
	//|			ИЛИ Отч.ИтогОС_КВ <> 0
	//|			ИЛИ Отч.ИтогОС_КВДоп <> 0
	//|			ИЛИ Отч.ИтогОС_КПеречислениюПоставщику <> 0)");
	//Выборка = Запрос.Выполнить().Выбрать();
	//Инфо = "";
	//Пока Выборка.Следующий() Цикл
	//	Объект = Выборка.Ссылка.ПолучитьОбъект();
	//	Объект.ОбменДанными.Загрузка = Истина;
	//	ЕстьИзменения = Ложь;
	//	Объект.ПересчетИтоговМодуль(,ЕстьИзменения);
	//	Если ЕстьИзменения Тогда
	//		Попытка
	//			Объект.Записать();
	//		Исключение
	//			Инфо = Инфо + "
	//			|Не записан Отчет Поставщику № " + Объект.Номер;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//Если Инфо <> "" Тогда
	//	Инфо = "ИсправитьИтогиОтчетовПоставщику():" + Инфо;
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Инфо,, Истина);
	//КонецЕсли;

КонецПроцедуры

// установка паролей для всех пользователей, имеющий аутентификацию 1с
Процедура ПроверкаАутентификацииПользователей() Экспорт

	Пароль = "4568";
	Для Каждого Пользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Если Пользователь.АутентификацияСтандартная И Не Пользователь.ПарольУстановлен Тогда
			Пользователь.Пароль = Пароль;
			Пользователь.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


Процедура Оплаты_Поставщику_С_НулевойСуммой()
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Запрос = Новый Запрос;
	Если СистемаНаправлениеПлатежа Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.Ссылка,
		|	уб_ОплатаПолисов.ОтчетПоставщику,
		|	уб_ОплатаПолисов.НачисленнаяСуммаВзноса,
		|	уб_ОплатаПолисов.НеВключатьВОтчетыПоставщикам,
		|	уб_ОплатаПолисов.ОплаченоФакт,
		|	уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		|	уб_ОплатаПолисов.СкидкаВыплаченаяКлиенту,
		|	уб_ОплатаПолисов.СуммаКОплатеБрокеруДляОчетаПоставщику
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	НЕ уб_ОплатаПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
		|	И НЕ уб_ОплатаПолисов.ОтчетПоставщику.ВидВзаиморасчета.Код ЕСТЬ NULL 
		|	И уб_ОплатаПолисов.ОплаченоФакт = 0
		|	И уб_ОплатаПолисов.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.уб_НаправленияПлатежа.Поставщику)
		|	И уб_ОплатаПолисов.НачисленнаяСуммаВзноса <> уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.Ссылка,
		|	уб_ОплатаПолисов.ОтчетПоставщику,
		|	уб_ОплатаПолисов.НачисленнаяСуммаВзноса,
		|	уб_ОплатаПолисов.НеВключатьВОтчетыПоставщикам,
		|	уб_ОплатаПолисов.ОплаченоФакт,
		|	уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,
		|	уб_ОплатаПолисов.СкидкаВыплаченаяКлиенту,
		|	уб_ОплатаПолисов.СуммаКОплатеБрокеруДляОчетаПоставщику
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	НЕ уб_ОплатаПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
		|	И НЕ уб_ОплатаПолисов.ОтчетПоставщику.ВидВзаиморасчета.Код ЕСТЬ NULL 
		|	И уб_ОплатаПолисов.ОплаченоФакт = 0
		|	И уб_ОплатаПолисов.ФормаОплаты = Значение(Перечисление.уб_ФормыОплаты.Поставщику)
		|	И уб_ОплатаПолисов.НачисленнаяСуммаВзноса<>уб_ОплатаПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Объект.НачисленнаяСуммаВзноса;
		Объект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;	
	
КонецПроцедуры

Функция ЗаполнитьВДокументахОплатаПолисовСхемуРасчетаСМенеджером() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ОплатаПолисов.Ссылка
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	уб_ОплатаПолисов.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоАВ)
	|	И уб_ОплатаПолисов.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка)");//НЕ уб_ОплатаПолисов.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)");
	Выборка = Запрос.Выполнить().Выбрать();					  
	Пока Выборка.Следующий() Цикл
		ОБ= Выборка.Ссылка.ПолучитьОбъект();
		ОБ.ОбменДанными.Загрузка = Истина;
		ОБ.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
		Попытка
			ОБ.Записать();
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось записать ""СхемуРасчетаСМенеджером"" в документ " + ОБ, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		КонецПопытки;
	КонецЦикла;
	
КонецФункции


//неактуальна, все заполнено нормально
Функция ПроверкаКорректностиПВХНастройкиПользователя() Экспорт
	
	//при начале работы системы проверяет корректность реквизита вид настройки у ПВХ Настройки пользователи при несовпадении меняет по родителю
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава, ПравоАдминистрирования") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПользователей.Ссылка,
		|	НастройкиПользователей.Родитель.ВидНастройки
		|ИЗ
		|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Родитель.ВидНастройки <> НастройкиПользователей.ВидНастройки";		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.ВидНастройки = Выборка.РодительВидНастройки;
			Попытка
				Объект.Записать();
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось записать ""РодительВидНастройки"" в объект " + Объект, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
			КонецПопытки;
		КонецЦикла;
		//удалить после первого запуска
		Массив = Новый Массив;
		Массив.Добавить(Перечисления.уб_ВидыНастроекПользователей.Настройка);
		Массив.Добавить(Перечисления.уб_ВидыНастроекПользователей.Полномочие);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПользователей.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.ВидНастройки В(&НастройкаПолномочие)
		|	И НастройкиПользователей.ДобавлятьВПрофили";
		Запрос.УстановитьПараметр("НастройкаПолномочие", Массив);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Не Выборка.Следующий() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиПользователей.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
			|ГДЕ
			|	НастройкиПользователей.ВидНастройки В(&НастройкаПолномочие)
			|	И НастройкиПользователей.Ссылка <> &ОсновнойОтветственный
			|	И НЕ НастройкиПользователей.ЭтоГруппа";
			Запрос.УстановитьПараметр("НастройкаПолномочие",	Массив);
			Запрос.УстановитьПараметр("ОсновнойОтветственный",  ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Объект.ДобавлятьВПрофили = Истина;
				Попытка
					Объект.Записать()
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не записан " + Выборка.Ссылка + "
					|уб_temp.ПроверкаКорректностиПВХНастройкиПользователя");
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		//удалять до этой строки
	КонецЕсли;
КонецФункции




Процедура ПроверкаЗависшихСоединений(ТолькоНочью=Истина, ПортСервера = "1640") Экспорт
	
	Попытка
		ИмяСервера = "";
		ИмяЦентральногоСервера = "";
		ИмяБазы = "";
		ТекДата = ТекущаяДата();
		Если ТолькоНочью Тогда
			ЧасОт = 0;
			ЧасДо = 6;		
			НачалоТекДня = НачалоДня(ТекДата);
			ТекВремя = ТекДата - НачалоТекДня;
			Если НЕ ((ТекВремя >= 3600 * ЧасОт) И (ТекВремя <= 3600 * ЧасДо)) Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		КоличествоЧасовДляУдаленияСоединения = ПараметрыСеанса.уб_Константы.уб_КоличествоЧасовДляУдаленияСоединения;	
		Если (ТипЗнч(КоличествоЧасовДляУдаленияСоединения) = Тип("Число") И КоличествоЧасовДляУдаленияСоединения > 0) Или Не ТолькоНочью Тогда									
			Если Не ПолучитьДанныеПодключенияКБазе(СтрокаСоединенияИнформационнойБазы(), ИмяСервера, ИмяБазы, ПортСервера, ИмяЦентральногоСервера) Тогда
				Возврат;
			КонецЕсли;	
			
			Коннектор = Новый COMОбъект("v82.COMConnector");
			Агент = Коннектор.ConnectAgent(ИмяЦентральногоСервера);
			Кластеры = Агент.GetClusters();		
			Для каждого Кластер из Кластеры Цикл
				АдминистраторКластера = "";
				ПарольКластера = "";
				Агент.Authenticate(Кластер, АдминистраторКластера, ПарольКластера);
				Процессы = Агент.GetWorkingProcesses(Кластер);
				Для каждого Процесс из Процессы Цикл
					Если Не Процесс.Running Тогда
						Продолжить;
					КонецЕсли;	
					Порт = Процесс.MainPort;					
					// теперь есть адрес и порт для подключения к рабочему процессу
					РабПроц = Коннектор.ConnectWorkingProcess(ИмяСервера + ":" + СтрЗаменить(Порт, Символы.НПП, ""));
					ИмяАдминистратораБД = "";
					ПарольАдминистратораБД = "";			
					РабПроц.AddAuthentication(ИмяАдминистратораБД, ПарольАдминистратораБД);
					ИнформационнаяБаза = "";
					
					Базы = Агент.GetInfoBases(Кластер);
					Для каждого База из Базы Цикл
						Если НРег(База.Name) = НРег(ИмяБазы) Тогда
							ИнформационнаяБаза = База;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ИнформационнаяБаза = "" Тогда
						Продолжить;// база не найдена
					КонецЕсли;
					
					//Сеансы = Агент.GetInfoBaseSessions(Кластер, ИнформационнаяБаза);
					//Для каждого Сеанс из Сеансы Цикл
					//	Если нРег(Сеанс.AppID) = "backgroundjob" ИЛИ нРег(Сеанс.AppID) = "designer" Или нРег(Соединение.Application) = "srvrconsole" Тогда
					//		// если это сеансы конфигуратора или фонового задания или консоль сервера, то не отключаем
					//		Продолжить;
					//	КонецЕсли;
					//	Если Сеанс.UserName = ИмяПользователя() Тогда
					//		// это текущий пользователь
					//		Продолжить;
					//	КонецЕсли;
					//	
					//	Агент.TerminateSession(Кластер, Сеанс);
					//КонецЦикла;
					
					СоединенияБазы = Агент.GetInfoBaseConnections(Кластер, ИнформационнаяБаза);
					Для Каждого Соединение Из СоединенияБазы Цикл
						Если Найти(НРег(Соединение.Application), "web") <> 0 Тогда //если слово web в названии приложения										
							Если ТекДата - Соединение.ConnectedAt > 3600 * КоличествоЧасовДляУдаленияСоединения Тогда														
								РабПроц.Disconnect(Соединение);
							КонецЕсли;				
						КонецЕсли;																
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;		
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при выполнении процедуры ПроверкаЗависшихСоединений", 
		УровеньЖурналаРегистрации.Ошибка, , ,
		ОписаниеОшибки() + " Имя сервера: " + ИмяСервера + ". Порт центрального сервера: " + ПортСервера +". Имя базы: " + ИмяБазы + ".");
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьДанныеПодключенияКБазе(СтрокаСоединенияИнформационнойБазы, ИмяСервера, ИмяБазы, ПортСервера, ИмяЦентральногоСервера)
	
	Если Найти(СтрокаСоединенияИнформационнойБазы, "Srvr") > 0 Тогда
		//серверный вариант
		Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы, "Srvr=");
		ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы, Поиск1 + 6);
		ИмяСервера = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
		Поиск2 = Найти(ИмяСервера, ":");//если указан порт кластера, то в имени центрального сервера нужно заменить на порт центрального сервера
		Если Поиск2 <> 0 Тогда
			ИмяЦентральногоСервера = Лев(ИмяСервера,Поиск2) + ПортСервера;	
		Иначе
			ИмяЦентральногоСервера = ИмяСервера +":" + ПортСервера;	
		КонецЕсли;
		//ищем имя базы
		Поиск1 = Найти(СтрокаСоединенияИнформационнойБазы, "Ref=");
		ПодстрокаПоиска = Сред(СтрокаСоединенияИнформационнойБазы, Поиск1 + 5);
		ИмяБазы = Лев(ПодстрокаПоиска, Найти(ПодстрокаПоиска, """") - 1);
		Если ИмяСервера = "" Или ИмяБазы = "" Тогда
			Возврат Ложь;
		Иначе	
			Возврат Истина;
		КонецЕсли;	
	Иначе
		// для других способов подключения алгоритм не актуален
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Процедура ПроверкаПерезапускаРабочихПроцессовСервера(ТолькоНочью=Истина, ПортСервера = "1640") Экспорт
	
	Попытка 
		ИмяСервера = "";
		ИмяБазы = "";
		ИмяЦентральногоСервера = "";
		ТекДата = ТекущаяДата();
		Если ТолькоНочью Тогда
			ЧасОт = 0;
			ЧасДо = 6;	
			НачалоТекДня = НачалоДня(ТекДата);
			ТекВремя = ТекДата - НачалоТекДня;
			Если НЕ ((ТекВремя >= 3600 * ЧасОт) И (ТекВремя <= 3600 * ЧасДо)) Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		КоличествоЧасовДляУдаленияСоединения = ПараметрыСеанса.уб_Константы.уб_КоличествоЧасовДляУдаленияСоединения;	
		Если (ТипЗнч(КоличествоЧасовДляУдаленияСоединения) = Тип("Число") И КоличествоЧасовДляУдаленияСоединения > 0) Или Не ТолькоНочью Тогда //процессы не перезапускаются если константа равна нулю
			                                                          
			Если Не ПолучитьДанныеПодключенияКБазе(СтрокаСоединенияИнформационнойБазы(), ИмяСервера, ИмяБазы, ПортСервера, ИмяЦентральногоСервера) Тогда
				Возврат;
			КонецЕсли;
			
			Коннектор = Новый COMОбъект("v82.COMConnector");
			Агент = Коннектор.ConnectAgent(ИмяЦентральногоСервера);
			Кластеры = Агент.GetClusters();
			Для каждого Кластер из Кластеры Цикл			
				
				АдминистраторКластера = "";
				ПарольКластера = "";
				Агент.Authenticate(Кластер, АдминистраторКластера, ПарольКластера);
				
				ИнформационнаяБаза = "";
				Базы = Агент.GetInfoBases(Кластер);
				Для каждого База из Базы Цикл
					Если НРег(База.Name) = НРег(ИмяБазы) Тогда
						ИнформационнаяБаза = База;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ИнформационнаяБаза = "" Тогда
					Продолжить;// база не найдена в этом кластере
				КонецЕсли;
				
				Процессы = Агент.GetWorkingProcesses(Кластер);										
				ЕстьАктивныеВыключенныеПроцессы = Ложь;
				Для каждого Процесс из Процессы Цикл
					Если Процесс.Running И Не Процесс.Enable Тогда
						ЕстьАктивныеВыключенныеПроцессы = Истина;
					КонецЕсли;	
				КонецЦикла;	
				
				Для каждого Процесс из Процессы Цикл										
					Если Процесс.Running И Процесс.Enable И (ТекДата - Процесс.StartedAt) > 3600 * КоличествоЧасовДляУдаленияСоединения И Не ЕстьАктивныеВыключенныеПроцессы Тогда						
						НовыйПроцесс = Агент.CreateWorkingProcessInfo();						
						НовыйПроцесс.HostName = Процесс.HostName;			
						НовыйПроцесс.Use = 1;
						НовыйПроцесс.Capacity = Процесс.Capacity;
						Агент.RegWorkingProcess(Кластер,НовыйПроцесс);				
						Агент.SetWorkingProcessUsage(Кластер,Процесс,0); 
					ИначеЕсли Не Процесс.Running Тогда 
						Агент.UnregWorkingProcess(Кластер,Процесс,Ложь);
					КонецЕсли;
				КонецЦикла;	
				
			КонецЦикла;		
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при выполнении процедуры ПроверкаПерезапускаРабочихПроцессовСервера", 
		УровеньЖурналаРегистрации.Ошибка, , ,
		ОписаниеОшибки() + " Имя сервера: " + ИмяСервера + ". Порт центрального сервера: " + ПортСервера +". Имя базы: " + ИмяБазы + ".");
	КонецПопытки;
	
КонецПроцедуры	


Процедура ПроверкаНаличияДанныхКонфигурации() Экспорт
	
	Сообщение = "";
	Для Каждого Документ Из Метаданные.Документы Цикл
		МассивРеквизитов = Новый Массив;
		Для Каждого Реквизит Из Документ.Реквизиты Цикл
			МассивРеквизитов.Добавить(Реквизит.Имя)
		КонецЦикла;
		Форма = Документы[Документ.Имя].ПолучитьФорму(Документ.ОсновнаяФормаОбъекта.Имя);
		НетДанных = Истина;
		Для Каждого ЭлементФормы Из Форма.ЭлементыФормы Цикл
			Если Не ПустаяСтрока(ЭлементФормы.Данные) И МассивРеквизитов.Найти(ЭлементФормы.Данные) <> Неопределено Тогда
				//данные есть и они не равны
				НетДанных = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НетДанных Тогда
			Сообщение = Сообщение + "Нет данных: " + Документ.Имя + ", форма: " + Форма.Имя + "!!!
			|";
		КонецЕсли;
	КонецЦикла;
	Если Сообщение <> "" Тогда 
		Соо = Новый СообщениеПользователю;
		Соо.Текст = Сообщение;
		Соо.Сообщить();
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Получатели 	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
		Параметры.Тема			= "Критичные ошибки хранилища конфигурации: нет данных";
		Параметры.Сообщение		= Сообщение;
		уб_ОбменДанными.SendMail(Параметры);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПроверитьШтрафыЗаОпоздание() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияОрганизаций.Ссылка
	               |ПОМЕСТИТЬ Подразделения
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |ГДЕ
	               |	ПодразделенияОрганизаций.Код В (""000000024"", ""000000023"", ""000000019"", 
				   //""000000018"",
	               |		""000000038"", ""000000025"", ""000000039"", ""000000042"")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_РуководителиПодразделенийСрезПоследних.Сотрудник
	               |ПОМЕСТИТЬ Руководители
	               |ИЗ
	               |	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних КАК уб_РуководителиПодразделенийСрезПоследних
	               |ГДЕ
	               |	уб_РуководителиПодразделенийСрезПоследних.Уход = ЛОЖЬ
	               |	И уб_РуководителиПодразделенийСрезПоследних.Заместитель = ЛОЖЬ
	               |	И уб_РуководителиПодразделенийСрезПоследних.Подразделение В
	               |			(ВЫБРАТЬ
	               |				Подразделения.Ссылка
	               |			ИЗ
	               |				Подразделения)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент,
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие КАК АгентыНадоШтраф
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |ГДЕ
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ЛОЖЬ
	               |	И уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение В
	               |			(ВЫБРАТЬ
	               |				Подразделения.Ссылка
	               |			ИЗ
	               |				Подразделения)
	               |	И НЕ уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент В
	               |				(ВЫБРАТЬ
	               |					Руководители.Сотрудник
	               |				ИЗ
	               |					Руководители)
	               |	И НЕ уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент В
	               |				(ВЫБРАТЬ
	               |					уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник
	               |				ИЗ
	               |					РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(, ТипПараметра = ""Начислять штраф за опаздание в план"") КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = Регистрысведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СоздатьМенеджерЗаписи();
		МЗ.Сотрудник         = Выборка.Агент;
		МЗ.ТипПараметра      = "Начислять штраф за опаздание в план";
		МЗ.ЗначениеПараметра = 2000;
		МЗ.Период = НачалоМесяца (ТекущаяДата());
		Попытка
			МЗ.Записать();
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры 	


Функция ПодсчетКоличестваФайловВЗаявке() Экспорт
	
	Если Час(ТекущаяДата())=1 Тогда
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Курьер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ФайловКурьер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ФайловМенеджер,
	               |	уб_ФайлыКПолисам.Автор,
	               |	уб_ФайлыКПолисам.ДатаПубликации,
	               |	ВЫБОР
	               |		КОГДА уб_ФайлыКПолисам.Автор.ФизЛицо = уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Менеджер
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ФайловМенеджерФакт,
	               |	ВЫБОР
	               |		КОГДА уб_ФайлыКПолисам.Автор.ФизЛицо = уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Курьер
	               |				И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Менеджер = уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Курьер
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ФайловКурьерФакт,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ФайловБланкиПлан,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ФайловБланкиФакт,
	               |	ВЫБОР
	               |		КОГДА уб_ФайлыКПолисам.ДатаПубликации >= уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ДатаСоздания
	               |				И (уб_ФайлыКПолисам.ВидДокумента В (ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.Полис), ЗНАЧЕНИЕ(Справочник.уб_ВидыДокументовКПолисам.Квитанция))
	            //   |					ИЛИ уб_ФайлыКПолисам.ВидДокумента.Наименование В (""_Фото А7 КАСКО"",""_Фото А7 ОСАГО"",""_Фото ДК"",""_Фото КАСКО"",""_Фото ОСАГО""))
				|   ИЛИ уб_ФайлыКПолисам.ВидДокумента.Наименование В (""_Фото А7 КАСКО"", ""_Фото А7 ОСАГО"", ""_Фото ДК"", ""_Фото КАСКО"", ""_Фото ОСАГО"",""_Фото КАСКО квитанция"",""_Фото КАСКО полис"",""_Фото ОСАГО полис"",""_Фото ОСАГО квитанция""))
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НовыйФайловБланкиФакт
	               |ПОМЕСТИТЬ АнализКоличества
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника = уб_ФайлыКПолисам.УИД
	               |			И (уб_ФайлыКПолисам.ДатаПубликации >= уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.ДатаСоздания
	               |				ИЛИ уб_ФайлыКПолисам.ДатаПубликации = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Дата >= ДАТАВРЕМЯ(2018, 10, 1)
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Дата < &Текдата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				|   	БСО.Ссылка,
				|   	СУММА(
				|   	Выбор Когда 
				|   	БСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(перечисление.уб_ТипыБСО.ПолисОСАГО), ЗНАЧЕНИЕ(перечисление.уб_ТипыБСО.КвитанцияА7))
				|   	И
				|   	БСО.Ссылка.Дата < ДАТАВРЕМЯ(2020, 1, 1)  или БСО.ВидБСО.ВключатьВРасчетФайлов = Истина Тогда
				|   	1 иначе 0 Конец) КАК НовыйФайловБланкиПлан
				|   ПОМЕСТИТЬ АнализБСО
				|   ИЗ
				|   	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСО
				|   ГДЕ
				|   	БСО.Ссылка.Дата >= ДАТАВРЕМЯ(2018, 10, 1)
				//  и 	БСО.Ссылка = &З
				|   	И БСО.Ссылка.Дата < &Текдата
				|СГРУППИРОВАТЬ ПО
	             |  	БСО.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АнализКоличества.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(АнализКоличества.ФайловКурьер) КАК ФайловКурьер,
	               |	МАКСИМУМ(АнализКоличества.ФайловМенеджер) КАК ФайловМенеджер,
	               |	СУММА(АнализКоличества.ФайловМенеджерФакт) КАК ФайловМенеджерФакт,
	               |	СУММА(АнализКоличества.ФайловКурьерФакт) КАК ФайловКурьерФакт,
	               |	МАКСИМУМ(АнализКоличества.ФайловБланкиПлан) КАК ФайловБланкиПлан,
	               |	МАКСИМУМ(АнализКоличества.ФайловБланкиФакт) КАК ФайловБланкиФакт,
	               |	СУММА(АнализКоличества.НовыйФайловБланкиФакт) КАК НовыйФайловБланкиФакт
	               |ПОМЕСТИТЬ Анализ1
	               |ИЗ
	               |	АнализКоличества КАК АнализКоличества
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АнализКоличества.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Анализ1.Ссылка, АнализБСО.Ссылка) КАК Ссылка,
	               |	ЕСТЬNULL(Анализ1.Ссылка.Дата, АнализБСО.Ссылка.Дата) КАК Дата,
	               |	ЕСТЬNULL(Анализ1.ФайловКурьер, 0) КАК ФайловКурьер,
	               |	ЕСТЬNULL(Анализ1.ФайловКурьерФакт, 0) КАК ФайловКурьерФакт,
	               |	ЕСТЬNULL(Анализ1.ФайловМенеджер, 0) КАК ФайловМенеджер,
	               |	ЕСТЬNULL(Анализ1.ФайловМенеджерФакт, 0) КАК ФайловМенеджерФакт,
	               |	ЕСТЬNULL(Анализ1.ФайловБланкиПлан, 0) КАК ФайловБланкиПлан,
	               |	ЕСТЬNULL(АнализБСО.НовыйФайловБланкиПлан, 0) КАК НовыйФайловБланкиПлан,
	               |	ЕСТЬNULL(Анализ1.ФайловБланкиФакт, 0) КАК ФайловБланкиФакт,
	               |	ЕСТЬNULL(Анализ1.НовыйФайловБланкиФакт, 0) КАК НовыйФайловБланкиФакт
	               |ИЗ
	               |	Анализ1 КАК Анализ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АнализБСО КАК АнализБСО
	               |		ПО Анализ1.Ссылка = АнализБСО.Ссылка
	               |ГДЕ
	               |	(ЕСТЬNULL(Анализ1.ФайловМенеджер, 0) <> ЕСТЬNULL(Анализ1.ФайловМенеджерФакт, 0)
	               |			ИЛИ ЕСТЬNULL(Анализ1.ФайловКурьер, 0) <> ЕСТЬNULL(Анализ1.ФайловКурьерФакт, 0)
	               |			ИЛИ ЕСТЬNULL(Анализ1.ФайловБланкиФакт, 0) <> ЕСТЬNULL(Анализ1.НовыйФайловБланкиФакт, 0)
	               |			ИЛИ ЕСТЬNULL(Анализ1.ФайловБланкиПлан, 0) <> ЕСТЬNULL(АнализБСО.НовыйФайловБланкиПлан, 0))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Анализ1.Ссылка.Дата";
				   Запрос.УстановитьПараметр("Текдата",НачалоДня(ТекущаяДата()));
				   Запрос.УстановитьПараметр("СвойКонтрагент",ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент);
				   Выборка = Запрос.Выполнить().Выбрать();
				   Пока Выборка.Следующий() Цикл
					   Об = Выборка.Ссылка.ПолучитьОбъект();
					   Об.ОбменДанными.Загрузка = Истина;
					   
					   Об.ФайловКурьер   = Выборка.ФайловКурьерФакт;
					   Об.ФайловМенеджер = Выборка.ФайловМенеджерФакт;
					   Об.ФайловБланкиФакт   = Выборка.НовыйФайловБланкиФакт;
					   Об.ФайловБланкиПлан = Выборка.НовыйФайловБланкиПлан;
					   
					   Попытка
						   Об.Записать();
					   Исключение
					   КонецПопытки;
					   
				   КонецЦикла; 
КонецФункции	

Функция АнализРекомендаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	полис.Страхователь,
	               |	МИНИМУМ(полис.ДатаНачала) КАК ДатаНачала,
	               |	уб_ЗаменаПолисовСрезПоследних.АннулированныйПолис
	               |ПОМЕСТИТЬ ДатыПервыхПолисов
	               |ИЗ
	               |	Документ.уб_СтраховойПолис КАК полис
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаменаПолисов.СрезПоследних КАК уб_ЗаменаПолисовСрезПоследних
	               |		ПО (уб_ЗаменаПолисовСрезПоследних.НовыйПолис = полис.Ссылка)
	               |ГДЕ
	               |	НЕ полис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
	               |	И полис.СтраховаяПремия > 0
	               |	И уб_ЗаменаПолисовСрезПоследних.АннулированныйПолис ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	полис.Страхователь,
	               |	уб_ЗаменаПолисовСрезПоследних.АннулированныйПолис
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОП.Ссылка КАК Оплата,
	               |	ОП.СтраховойПолис.Заявка КАК Заявка,
	               |	ОП.СтраховойПолис.Заявка.Менеджер КАК Менеджер,
	               |	ОП.СтраховойПолис.Заявка.Страхователь КАК Страхователь,
	               |	ОП.СтраховойПолис.Заявка,
	               |	ОП.СтраховойПолис.Заявка.Источник КАК Источник,
	               |	ОП.СтраховойПолис.Заявка.ДатаСоздания КАК ДатаСоздания,
	               |	СУММА(ОП.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОП.ОплаченоФакт > 0
	               |					И ОП.КВСумма >= ОП.АВилиСкидкаСумма
	               |				ТОГДА ОП.КВСумма - ОП.АВилиСкидкаСумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ * (100 - ОП.ПроцентСКВ) / 100) КАК СКВ,
	               |	СУММА(ОП.КВСумма) КАК КВСумма,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА СУММА(ОП.НачисленнаяСуммаВзноса) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ СУММА(ОП.КВСумма) * 100 / СУММА(ОП.НачисленнаяСуммаВзноса)
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК КВПроцент,
	               |	ВЫБОР
	               |		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР),  ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
	               |			ТОГДА 0
	               |		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
	               |				И ОП.НачисленнаяСуммаВзноса < 1500
	               |			ТОГДА 0
	               |		КОГДА ОП.НомерВзноса = 1
	               |				И РАЗНОСТЬДАТ(ДатыПервыхПолисов.ДатаНачала, ОП.СтраховойПолис.Заявка.ДатаСоздания, МЕСЯЦ) < 3
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НовыйКлиент
	               |ПОМЕСТИТЬ Оплаты
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПервыхПолисов КАК ДатыПервыхПолисов
	               |		ПО ОП.СтраховойПолис.Страхователь = ДатыПервыхПолисов.Страхователь
	               |ГДЕ
	               |	ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	               |	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	               |	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	               |	И ОП.ПометкаУдаления = ЛОЖЬ
	               |	И ОП.НеВключатьВОтчетыПоставщикам = ЛОЖЬ
	               |	И ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
	               |	И ОП.СтраховойПолис.Заявка.ДатаСоздания >= &ДатаНачала
	               |	И ОП.СтраховойПолис.Заявка.Источник = ""Рекомендация""
	               |	И ОП.СК.Наименование <> ""-- КупиПолис --""
	               |	И ОП.НомерВзноса = 1
	               |	И ОП.НачисленнаяСуммаВзноса > 100
				   |    И ОП.СтраховойПолис.Заявка.Дата<ДатаВремя(2024,1,1)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОП.Ссылка,
	               |	ОП.СтраховойПолис.Заявка.Менеджер,
	               |	ОП.СтраховойПолис.Заявка.Страхователь,
	               |	ОП.СтраховойПолис.Заявка,
	               |	ОП.СтраховойПолис.Заявка.Источник,
	               |	ОП.СтраховойПолис.Заявка.ДатаСоздания,
	               |	ВЫБОР
	               |		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС))
	               |			ТОГДА 0
	               |		КОГДА ОП.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Имущество), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Произвольный))
	               |				И ОП.НачисленнаяСуммаВзноса < 1500
	               |			ТОГДА 0
	               |		КОГДА ОП.НомерВзноса = 1
	               |				И РАЗНОСТЬДАТ(ДатыПервыхПолисов.ДатаНачала, ОП.СтраховойПолис.Заявка.ДатаСоздания, МЕСЯЦ) < 3
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ОП.СтраховойПолис.Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	оплаты.Заявка КАК Заявка,
	               |	оплаты.Менеджер КАК Менеджер,
	               |	оплаты.Заявка.ИндексРекомендации КАК ИндексРекомендации,
	               |	оплаты.Заявка.ИндексЦепочкиРекомендаций,
	               |	МАКСИМУМ(оплаты.НовыйКлиент) КАК НовыйКлиент,
	               |	оплаты.Заявка.Дата КАК ДатаЗаявки,
				   |	оплаты.Оплата.Подразделение.Наименование как ПодразделениеНаименование
	               |ИЗ
	               |	Оплаты КАК оплаты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	оплаты.Заявка,
	               |	оплаты.Менеджер,
	               |	оплаты.Заявка.ИндексРекомендации,
	               |	оплаты.Заявка.ИндексЦепочкиРекомендаций,
	               |	оплаты.Заявка.Дата,оплаты.Оплата.Подразделение.Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	оплаты.Заявка.ДатаСоздания
	               |ИТОГИ ПО
	               |	Менеджер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	оплаты.Оплата,
	               |	оплаты.Заявка,
	               |	оплаты.Заявка.Дата КАК ДатаЗаявки,
	               |	оплаты.Менеджер,
	               |	оплаты.Страхователь,
	               |	оплаты.СтраховойПолисЗаявка,
	               |	оплаты.Источник,
	               |	оплаты.ДатаСоздания,
	               |	оплаты.НачисленнаяСуммаВзноса,
	               |	оплаты.СКВ,
	               |	оплаты.КВСумма,
	               |	оплаты.КВПроцент,
	               |	оплаты.НовыйКлиент,
	               |	оплаты.Оплата.Подразделение,
	               |	оплаты.Оплата.Подразделение.Наименование как ПодразделениеНаименование
	               |ИЗ
	               |	Оплаты КАК оплаты";
				   
				   Запрос.УстановитьПараметр("ДатаНачала",Дата(2018,10,1));
				   
				   Пакет = Запрос.ВыполнитьПакет();
				   Выборка = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				   ВсеОплаты = Пакет[3].Выгрузить();
				   
				   Пока Выборка.Следующий() Цикл
					   ТекМенеджер = Выборка.Менеджер;
					   ТекущийИндекс = 0;
					   ТекущаяЦепочка = 0;
					   
					   СуммаКВ     = 0;
					   СуммаПремии = 0;
					   ВсегоОплат  = 0;
					   
					   ВыборкаЗаявок = Выборка.Выбрать();
					   Пока ВыборкаЗаявок.Следующий() Цикл
						   
						   Если ВыборкаЗаявок.ПодразделениеНаименование = "ОП-3" и ВыборкаЗаявок.Заявка.ДатаСоздания>Дата(2023,4,1) Тогда
							   Продолжить
						   ИначеЕсли ВыборкаЗаявок.Заявка.ДатаСоздания<Дата(2023,10,15) Тогда	   
							   Продолжить
						   КонецЕсли; 
					   
						   
						   
						   Если ВыборкаЗаявок.НовыйКлиент = 0 Тогда
							   //не считаются
							   ПриведенныйТекущийИндекс = 0;
						   Иначе
							   ТекущийИндекс = ТекущийИндекс+1;
							   ПриведенныйТекущийИндекс = ТекущийИндекс;
						   КонецЕсли; 
						   
						   Если ВыборкаЗаявок.ИндексРекомендации<>ПриведенныйТекущийИндекс Тогда
							   Об = ВыборкаЗаявок.Заявка.ПолучитьОбъект();
							   об.ОбменДанными.Загрузка = Истина;
							   об.ИндексРекомендации = ПриведенныйТекущийИндекс;
							   об.ИндексЦепочкиРекомендаций = ТекущаяЦепочка;
							   
							   Об.Записать();
						   КонецЕсли;	   
						   
						   Если ТекущийИндекс = 16 Тогда
							   СреднееКВ = Окр(?(ВсегоОплат =0,0,СуммаКВ/ВсегоОплат),2);
							   СредняяПремия = Окр(?(ВсегоОплат =0,0,СуммаПремии/ВсегоОплат),2);
							   найденныеОплаты = ВсеОплаты.НайтиСтроки(Новый Структура("Заявка",ВыборкаЗаявок.Заявка)); 
							   Подразделение = Неопределено;
							   Об = Документы.уб_ОплатаПолисов.ПустаяСсылка();
							   Для каждого СтрокаОплаты из найденныеОплаты Цикл
								   Об = СтрокаОплаты.Оплата.ПолучитьОбъект();
								  // об.ОбменДанными.Загрузка = Истина;
								   Если Об.НомерВзноса =1 и (об.СредняяПремияРекомендаций <> СредняяПремия
									   или об.СреднийКВРекомендаций <> СреднееКВ
									   или об.ИндексЦепочкиРекомендаций  <> ТекущаяЦепочка) Тогда
									   об.СредняяПремияРекомендаций = СредняяПремия;
									   об.СреднийКВРекомендаций = СреднееКВ;
									   об.ИндексЦепочкиРекомендаций  = ТекущаяЦепочка;
									   
									   Об.Записать();
								   КонецЕсли;
								   Подразделение = Об.Подразделение;
							   КонецЦикла;	   
							   Месяц = НачалоМесяца(ВыборкаЗаявок.Заявка.Дата);
							   Текст = "За рекомендации (группа "+Формат(ТекущаяЦепочка,"ЧН=; ЧГ=")+")";
							   //ТекМенеджер
							   Сумма =  Окр((СреднееКВ-6)*СредняяПремия/100,2);
							   ТекущийИндекс = 0;
							   ТекущаяЦепочка = ТекущаяЦепочка+1;
							   ВсегоОплат = 0;
							   СуммаКВ = 0;
							   СуммаПремии = 0;
							   
							   //Версия 2+
							   Если Месяц>=Дата(2019,5,1) Тогда
								   ТекущийИндекс = 1; //16 заявка становится первой в следующей цепочке
								   
								   //Расчет средних значений КВ и премий по заявке
								   найденныеОплаты = ВсеОплаты.НайтиСтроки(Новый Структура("Заявка",ВыборкаЗаявок.Заявка)); 
								   ОплатЗаявки = найденныеОплаты.Количество();
								   Если ВыборкаЗаявок.ДатаЗаявки>=Дата(2019,5,1)  и ОплатЗаявки>0 Тогда
									   СуммаКВЗаявки      = 0;
									   СуммаПремииЗаявки  =  0;
									   
									   Для каждого СтрокаОплаты из найденныеОплаты Цикл
										   СуммаКВЗаявки = СуммаКВЗаявки + СтрокаОплаты.КВПроцент;
										   СуммаПремииЗаявки = СуммаПремииЗаявки + СтрокаОплаты.НачисленнаяСуммаВзноса;
									   КонецЦикла;
									   СуммаПремии = СуммаПремии + СуммаПремииЗаявки/ОплатЗаявки;
									   СуммаКВ = СуммаКВ + СуммаКВЗаявки/ОплатЗаявки;
									   ВсегоОплат = ВсегоОплат+1;
								   КонецЕсли;
							   КонецЕсли; 
							   //Версия 2-
							   
							   Если ТекМенеджер.ВзаиморасчетыПрекращены = Истина Тогда
								   продолжить;
							   ИначеЕсли Подразделение<>Неопределено и Подразделение.НеИспользоватьПремированиеРекомендаций = Истина Тогда
								   Сумма = 0;
							   ИначеЕсли уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("БезРекомендаций",ТекМенеджер,ВыборкаЗаявок.Заявка.Дата,-1)>0 Тогда
								   Сумма = 0;
							   КонецЕсли; 
							   СинхронизироватьСумму(Месяц,ТекМенеджер,Текст,Сумма);
								   
							   
						   ИначеЕсли ПриведенныйТекущийИндекс>0 Тогда
							   найденныеОплаты = ВсеОплаты.НайтиСтроки(Новый Структура("Заявка",ВыборкаЗаявок.Заявка)); 
							   ОплатЗаявки = найденныеОплаты.Количество();
							   //Версия 2+
							   Если ВыборкаЗаявок.ДатаЗаявки>=Дата(2019,5,1)  и ОплатЗаявки>0 Тогда
								   СуммаКВЗаявки      = 0;
								   СуммаПремииЗаявки  =  0;
								   
								   Для каждого СтрокаОплаты из найденныеОплаты Цикл
									   СуммаКВЗаявки = СуммаКВЗаявки + СтрокаОплаты.КВПроцент;
									   СуммаПремииЗаявки = СуммаПремииЗаявки + СтрокаОплаты.НачисленнаяСуммаВзноса;
								   КонецЦикла;
								   СуммаПремии = СуммаПремии + СуммаПремииЗаявки/ОплатЗаявки;
								   СуммаКВ = СуммаКВ + СуммаКВЗаявки/ОплатЗаявки;
								   ВсегоОплат = ВсегоОплат+1;
							   //Версия 2-
							   Иначе	   
								   Для каждого СтрокаОплаты из найденныеОплаты Цикл
									   СуммаКВ = СуммаКВ + СтрокаОплаты.КВПроцент;
									   СуммаПремии = СуммаПремии + СтрокаОплаты.НачисленнаяСуммаВзноса;
									   ВсегоОплат = ВсегоОплат+1;
								   КонецЦикла; 
							   КонецЕсли;
						   КонецЕсли;	   
					   КонецЦикла;	
					   
				   КонецЦикла;	
				   
КонецФункции	
			   
Функция СинхронизироватьСумму(Месяц,Сотрудник,Текст,Сумма)
	
	Док = Документы.уб_НачислениеЗП.Выбрать(Месяц,Месяц);
	ЕстьПравки = ложь;
	Если Док.Следующий() ТОгда
		Об = Док.ПолучитьОбъект();
		Разовые = Об.НачисленияРазовые;
		нСтроки = Разовые.НайтиСтроки(Новый Структура("Сотрудник,Начисление",Сотрудник,Текст));
		Если Сумма = 0 Тогда
			Для каждого СтрокаН из нСтроки Цикл
				Если Не СтрокаН.Результат = 0 Тогда
					СтрокаН.Результат = 0;
					ЕстьПравки = Истина;
				КонецЕсли;
				
			КонецЦикла;	
		Иначе
			Если нСтроки.Количество() = 0 Тогда
				СтрокаН = Разовые.Добавить();
				СтрокаН.Сотрудник  = Сотрудник; 
				СтрокаН.Начисление = Текст;
				СтрокаН.Период = Месяц;
				ЕстьПравки = Истина;
			Иначе
				СтрокаН = нСтроки[0];
			КонецЕсли;
			Если Не СтрокаН.Результат = Сумма Тогда
				ЕстьПравки = Истина;
				СтрокаН.Результат = Сумма;
			КонецЕсли;	
			
		КонецЕсли;	
		Если ЕстьПравки = Истина Тогда
			Об.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции	
			   
Процедура СинхронизироватьАгентаВПеремещениях()			   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер как Курьер,
	|	уб_ПеремещениеБСО.АгентКуда,
	|	уб_ПеремещениеБСО.Проведен,
	|	уб_ПеремещениеБСО.Ссылка КАК Перемещение
	|ИЗ
	|	Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|		ПО уб_ПеремещениеБСО.СозданНаОсновании = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
	|			И уб_ПеремещениеБСО.АгентКуда <> уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер
	|			И (уб_ПеремещениеБСО.Проведен)
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= ДАТАВРЕМЯ(2018, 12, 1))
	|			И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд = ЛОЖЬ)";
	
	Выборка= Запрос.Выполнить().Выбрать();			   
	Пока Выборка.Следующий() Цикл
		об = Выборка.Перемещение.ПолучитьОбъект();
		об.АгентКуда = Выборка.Курьер;
		Попытка
			об.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры	


Процедура ОбработатьСтраховойПолисВДвижениях()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ДвиженияБСОСрезПоследних.СтраховойПолис,
	               |	уб_ДвиженияБСОСрезПоследних.ВидБСО,
	               |	уб_ДвиженияБСОСрезПоследних.НомерБСО,
	               |	уб_ДвиженияБСОСрезПоследних.НомерПолиса,
	               |	уб_СтраховойПолисБСО.Ссылка,
	               |	уб_СтраховойПолисБСО.Ссылка.ДатаДвиженияБСО КАК ДатаПолиса
	               |ПОМЕСТИТЬ БезПолиса
	               |ИЗ
	               |	РегистрСведений.уб_ДвиженияБСО.СрезПоследних КАК уб_ДвиженияБСОСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	               |		ПО уб_ДвиженияБСОСрезПоследних.НомерБСО = уб_СтраховойПолисБСО.НомерБСО
	               |			И уб_ДвиженияБСОСрезПоследних.ВидБСО = уб_СтраховойПолисБСО.ВидБСО
	               |			И (уб_СтраховойПолисБСО.Ссылка.Дата > ДАТАВРЕМЯ(2023, 1, 1))
	               |			И (уб_СтраховойПолисБСО.Ссылка.Проведен)
	               |ГДЕ
	               |	уб_ДвиженияБСОСрезПоследних.СтраховойПолис = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ //ПЕРВЫЕ 100
	               |	Безполиса.СтраховойПолис,
	               |	Безполиса.ВидБСО,
	               |	Безполиса.НомерБСО,
	               |	Безполиса.НомерПолиса,
	               |	Безполиса.Ссылка,
	               |	Безполиса.ДатаПолиса,
	               |	уб_ДвиженияБСО.Регистратор, Представление(уб_ДвиженияБСО.Регистратор) как Регистратор2
	               |ИЗ
	               |	БезПолиса КАК Безполиса
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	               |		ПО (уб_ДвиженияБСО.Период > Безполиса.ДатаПолиса)
	               |			И (уб_ДвиженияБСО.НомерБСО = Безполиса.НомерБСО)
	               |			И (уб_ДвиженияБСО.ВидБСО = Безполиса.ВидБСО)
	               |			И (уб_ДвиженияБСО.Регистратор.Проведен)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Безполиса.ДатаПолиса,Безполиса.НомерБСО,уб_ДвиженияБСО.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Регистратор.ПолучитьОбъект();
		Объект.ДополнительныеСвойства.Вставить("Допроведение",Истина);
		Попытка
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
		#Если Клиент Тогда
			Состояние(Выборка.Регистратор2);
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
	КонецЦикла;	
КонецПроцедуры	


Процедура ПровестиСтатусыПриемок() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Полисы.Заявка КАК Заявка,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Полисы.Ссылка.ОтчетКассира.Проведен
	               |					И Полисы.Ссылка.ОтчетКассира.Подтверждено
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК Установить
	               |ПОМЕСТИТЬ ВТ_Заявок
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат.Полисы КАК Полисы
	               |ГДЕ
	               |	НЕ Полисы.Ссылка.ПометкаУдаления
	               |	И НЕ Полисы.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Полисы.Заявка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	П.Заявка,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА П.ОтчетКассира.Проведен
	               |					И П.ОтчетКассира.Подтверждено
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат КАК П
	               |ГДЕ
	               |	НЕ П.ПометкаУдаления
	               |	И НЕ П.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	П.Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СЗ.Заявка КАК Заявка,
	               |	СЗ.Статус КАК Статус,
	               |	СЗ.Заявка.Номер КАК ЗаявкаНомер,
	               |	ВЫБОР
	               |		КОГДА ВТ_Заявок.Установить
	               |			ТОГДА ""УстановитьСтатус_ДеньгиВКомпании""
	               |		ИНАЧЕ ""УстановитьСтатус_КомплектИДеньгиУКассира""
	               |	КОНЕЦ КАК УстСтатус
	               |ПОМЕСТИТЬ ВРаботе
	               |ИЗ
	               |	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявок КАК ВТ_Заявок
	               |		ПО СЗ.Заявка = ВТ_Заявок.Заявка
	               |ГДЕ
	               |	ВТ_Заявок.Установить
	               |	И СЗ.Статус <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	               |	И СЗ.Заявка.Дата > ДАТАВРЕМЯ(2026, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ИсторияСтатусовЗаявок.Заявка КАК Заявка,
	               |	уб_ИсторияСтатусовЗаявок.Статус КАК Статус,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ИсторияСтатусовЗаявок.Период) КАК КоличествоУстановок
	               |ПОМЕСТИТЬ Статистика
	               |ИЗ
	               |	РегистрСведений.уб_ИсторияСтатусовЗаявок КАК уб_ИсторияСтатусовЗаявок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВРаботе КАК ВТ_Заявок
	               |		ПО (ВТ_Заявок.Заявка = уб_ИсторияСтатусовЗаявок.Заявка)
	               |			И (уб_ИсторияСтатусовЗаявок.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уб_ИсторияСтатусовЗаявок.Заявка,
	               |	уб_ИсторияСтатусовЗаявок.Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВРаботе.Заявка КАК Заявка,
	               |	ВРаботе.Статус КАК Статус,
	               |	ВРаботе.ЗаявкаНомер КАК ЗаявкаНомер,
	               |	ВРаботе.УстСтатус КАК УстСтатус,
	               |	ЕСТЬNULL(Статистика.КоличествоУстановок, 0) КАК КоличествоУстановок
	               |ИЗ
	               |	ВРаботе КАК ВРаботе
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Статистика КАК Статистика
	               |		ПО ВРаботе.Заявка = Статистика.Заявка
	               |ГДЕ
	               |	ЕСТЬNULL(Статистика.КоличествоУстановок, 0) < 5";
	//Зацикливается установка
	УстановитьПривилегированныйРежим(Истина);
	
	Роль = уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
			Выборка.Заявка, 
			Выборка.Статус,
			Выборка.УстСтатус,
			,
			Роль,
			, //ТекстКоманды
			)
			Тогда
			//СписокОбработанныхЗаявок.Добавить(Выборка.ЗаявкаНомер);
		КонецЕсли;

		//МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Объект = Выборка.Заявка;
		//МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДвижениеСтатусов;
		//МенеджерЗаписи.Параметр   = Выборка.УстСтатус;
		//МенеджерЗаписи.Записать();
		

	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ Различные ПЕРВЫЕ 100
	//|	уб_ПриемкаОплатПолисы.Ссылка//,
	////|	уб_ПриемкаОплатПолисы.Заявка,
	////|	уб_ПриемкаОплатПолисы.Ссылка.Проведен,
	////|	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус
	//|ИЗ
	//|	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	//|		ПО уб_ПриемкаОплатПолисы.Заявка = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	//|			И (НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира)))
	//|ГДЕ
	//|	уб_ПриемкаОплатПолисы.Ссылка.Проведен
	//|	И уб_ПриемкаОплатПолисы.Ссылка.Дата > ДАТАВРЕМЯ(2023, 1, 1)
	//
	//|УПОРЯДОЧИТЬ ПО
	//|	уб_ПриемкаОплатПолисы.Ссылка.Дата Убыв";
	//выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	об = Выборка.ссылка.ПолучитьОбъект();
	//	Попытка
	//		об.Записать(РежимЗаписиДокумента.Проведение);
	//	Исключение
	//	КонецПопытки;	
	//КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверкаЗаявокСОтказом() Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка
	//               |ПОМЕСТИТЬ ЗаявкиСОтказом
	//               |ИЗ
	//               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	//               |ГДЕ
	//               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Состояние = ЗНАЧЕНИЕ(Перечисление.уб_СостояниеОформления.Отказ)
	//               |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Дата >= ДАТАВРЕМЯ(2023, 1, 1)
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	//               |	МАКСИМУМ(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерСтроки) КАК НомерСтроки,
	//               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус
	//               |ИЗ
	//               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	//               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	//               |ГДЕ
	//               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка В
	//               |			(ВЫБРАТЬ
	//               |				ЗаявкиСОтказом.Ссылка
	//               |			ИЗ
	//               |				ЗаявкиСОтказом)
	//               |	И НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена))
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	//               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус
	//               |
	//               |ИМЕЮЩИЕ
	//               |	МАКСИМУМ(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерСтроки) = 1" ;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	уб_УСЗ.УстановитьСтатусЗаявки(выборка.Ссылка, Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась,"Строки аннулированы");
	//КонецЦикла;	
КонецПроцедуры	

Процедура ПроверкаСКВ() Экспорт
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//|	ОПлаты.Ссылка,
//|	ОПлаты.Организация,
//|	ОПлаты.СКВ,
//|	ОПлаты.СКВ2,
//|	ОПлаты.КВСумма,
//|	ОПлаты.АВилиСкидкаСумма,
//|	ОПлаты.Условие,
//|	ОПлаты.СП_СК,
//|	ОПлаты.СП_ВидСП,
//|	ОПлаты.СП_СтраховойПродукт,
//|	ОПлаты.Страхователь,
//|	ОПлаты.ДатаПолиса,
//|	ОПлаты.НомерПолиса,
//|	ОПлаты.НомерЗаявки,
//|	ОПлаты.БонусМенеджеру,
//|	ОПлаты.ПолнаяПремия,
//|	ОПлаты.Сделка,
//|	ОПлаты.ДатаСделки,
//|	ОПлаты.БонусПроцент,
//|	ОПлаты.БонусПроцентРОП,
//|	ОПлаты.ЕД
//|ИЗ
//|	(ВЫБРАТЬ
//|		ОП.Ссылка КАК Ссылка,
//|		ОП.Подразделение.Владелец КАК Организация,
//|		ВЫБОР
//|			КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
//|					КОГДА ОП.НачисленнаяСуммаВзноса = 0
//|						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
//|					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
//|				КОНЕЦ - ОП.СуммаДоп - ОП.КВСумма
//|				ТОГДА 0
//|			ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
//|					КОГДА ОП.НачисленнаяСуммаВзноса = 0
//|						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
//|					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
//|				КОНЕЦ - ОП.СуммаДоп - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
//|		КОНЕЦ КАК СКВ,
//|		ВЫБОР
//|			КОГДА ОП.КВСумма > ОП.АВилиСкидкаСумма
//|					И ОП.ОплаченоФакт > 0
//|				ТОГДА ОП.КВСумма - ОП.АВилиСкидкаСумма
//|			ИНАЧЕ 0
//|		КОНЕЦ КАК СКВ2,
//|		ОП.КВСумма КАК КВСумма,
//|		ОП.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
//|		ОП.КВСумма - ОП.АВилиСкидкаСумма КАК Условие,
//|		ОП.СтраховойПолис.СК КАК СП_СК,
//|		ОП.СтраховойПолис.СтраховойПродукт.Вид КАК СП_ВидСП,
//|		ОП.СтраховойПолис.СтраховойПродукт КАК СП_СтраховойПродукт,
//|		ОП.СтраховойПолис.Страхователь КАК Страхователь,
//|		ОП.СтраховойПолис.Дата КАК ДатаПолиса,
//|		ОП.СтраховойПолис.Номер КАК НомерПолиса,
//|		ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
//|		ОП.СтраховойПолис.БонусМенеджеру КАК БонусМенеджеру,
//|		ОП.СтраховойПолис.СтраховаяПремия КАК ПолнаяПремия,
//|		ОП.СтраховойПолис.Сделка КАК Сделка,
//|		ОП.СтраховойПолис.Сделка.Дата КАК ДатаСделки,
//|		ОП.СтраховойПолис.Сделка.БонусПроцент КАК БонусПроцент,
//|		ОП.СтраховойПолис.Сделка.БонусПроцентРОП КАК БонусПроцентРОП,
//|		1 КАК ЕД
//|	ИЗ
//|		Документ.уб_ОплатаПолисов КАК ОП
//|	ГДЕ
//|		ОП.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоСхеме)
//|		И НЕ ОП.ПометкаУдаления) КАК ОПлаты
//|ГДЕ
//|	ОПлаты.СКВ <> ОПлаты.СКВ2
//|	И ОПлаты.Ссылка.ЗарплатныйПериод >= &ЗарплатныйПериод

//|УПОРЯДОЧИТЬ ПО
//|	ОПлаты.Ссылка.Дата";
//Запрос.УстановитьПараметр("ЗарплатныйПериод",Дата(2024,7,1));
//Выборка = Запрос.Выполнить().Выбрать();
//Пока Выборка.Следующий() Цикл
//	ОбъектОплаты = Выборка.Ссылка.ПолучитьОбъект();
//	Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию() ;
//	ПараметрыПерерасчета = Неопределено;
//	уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ОбъектОплаты, , ПараметрыПерерасчета, Параметры);
//	ОбъектОплаты.Записать();

//КонецЦикла;	

КонецПроцедуры	


Процедура ПроверкаНаличияПеремещений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	уб_ПеремещениеБСО.Ссылка КАК Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка1,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус КАК Статус//,
	               //|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерБСО КАК НомерБСО
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
	               |		ПО (уб_ПеремещениеБСО.СозданНаОсновании = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка.Дата > &Дата
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерБСО <> """"
	               |	И уб_ПеремещениеБСО.Ссылка ЕСТЬ NULL
	               |	И НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_статусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_статусыЗаявок.СогласованиеСКлиентом))
				   |    И не Isnull(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка.Курьер.Код,""!23у23434"") в(""000000000"",""000081966"",""000081967"",""000081969"",""000081970"")";
	Запрос.УстановитьПараметр("Дата",ТекущаяДата()-90*3600*24);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			уб_УСЗ.ПроверитьПеремещения(Выборка.Ссылка1,Выборка.Статус,Истина);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры	


Процедура ПроставитьБонусыРекомендаций() Экспорт
	Запрос  = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	оплатыполисов.Ссылка КАК Ссылка,
	               	|	СУММА(ВЫБОР
	               	|			КОГДА ЕСТЬNULL(влож.Результат, 0) > 0 и (оплатыполисов.ВидС В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.КАСКО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ОСАГО)))
	               	|				ТОГДА ЕСТЬNULL(влож.Результат, 0)
	               	|			ИНАЧЕ 0
	               	|		КОНЕЦ) КАК Результат
	               	|ПОМЕСТИТЬ данные
	               	|ИЗ
	               	|	Документ.уб_ОплатаПолисов КАК оплатыполисов
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               	|			уб_НачислениеЗПНачисленияПоДокументам.Начисление КАК Начисление,
	               	|			СУММА(уб_НачислениеЗПНачисленияПоДокументам.Результат) КАК Результат,
	               	|			уб_НачислениеЗПНачисленияПоДокументам.Документ КАК Документ
	               	|		ИЗ
	               	|			Документ.уб_НачислениеЗП.НачисленияПоДокументам КАК уб_НачислениеЗПНачисленияПоДокументам
	               	|		ГДЕ
	               	|			уб_НачислениеЗПНачисленияПоДокументам.Начисление = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознЗаРекомендацию)
	               	|		
	               	|		СГРУППИРОВАТЬ ПО
	               	|			уб_НачислениеЗПНачисленияПоДокументам.Начисление,
	               	|			уб_НачислениеЗПНачисленияПоДокументам.Документ) КАК влож
	               	|		ПО оплатыполисов.СтраховойПолис.Заявка = влож.Документ
	               	
	               	|ГДЕ
	               	|	оплатыполисов.НомерВзноса = 1
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	оплатыполисов.Ссылка
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	данные.Результат КАК Результат,
	               	|	данные.Ссылка.ЗаРекомендацию КАК ЗаРекомендацию,
	               	|	данные.Ссылка КАК Ссылка
	               	|ИЗ
	               	|	данные КАК данные
	               	|ГДЕ
	               	|	данные.Ссылка.ЗаРекомендацию <> данные.Результат
	               	|	И данные.Ссылка.НомерВзноса = 1";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект                             = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка       = Истина;
		Объект.НачисленБонусЗаРекомендацию = Выборка.Результат>0;
		Объект.ЗаРекомендацию              = Выборка.Результат;
		Объект.Записать();
		
	КонецЦикла;	
				   
КонецПроцедуры	




Процедура ПроставитьБонусыКоробок() Экспорт
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АналитикаУчетаБСО.ВидСП КАК ВидСП,
	               |	АналитикаУчетаБСО.ОрганизацияАгент КАК ОрганизацияАгент,
	               |	АналитикаУчетаБСО.СК КАК СК
	               |ПОМЕСТИТЬ Аналитика
	               |ИЗ
	               |	Справочник.АналитикаУчетаБСО КАК АналитикаУчетаБСО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_НачислениеЗПНачисленияПоДокументам.Начисление КАК Начисление,
	               |	СУММА(уб_НачислениеЗПНачисленияПоДокументам.Результат) КАК Результат,
	               |	уб_НачислениеЗПНачисленияПоДокументам.Документ КАК Документ
	               |ПОМЕСТИТЬ Начисления
	               |ИЗ
	               |	Документ.уб_НачислениеЗП.НачисленияПоДокументам КАК уб_НачислениеЗПНачисленияПоДокументам
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(уб_НачислениеЗПНачисленияПоДокументам.Начисление) = ТИП(СТРОКА)
	               |	И (уб_НачислениеЗПНачисленияПоДокументам.Начисление ПОДОБНО ""Клуб%""
	               |			ИЛИ уб_НачислениеЗПНачисленияПоДокументам.Начисление ПОДОБНО ""Коробка%"")
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уб_НачислениеЗПНачисленияПоДокументам.Начисление,
	               |	уб_НачислениеЗПНачисленияПоДокументам.Документ
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(уб_НачислениеЗПНачисленияПоДокументам.Результат) <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ОП.КВПроцентДляАгента >= 29
	               |				ТОГДА начисления.Результат
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Результат,
	               |	ОП.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	Начисления КАК начисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК ОП
	               |		ПО (ОП.СтраховойПолис.Заявка = начисления.Документ)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Аналитика КАК Аналитика
	               |		ПО (ОП.ВидСП = Аналитика.ВидСП)
	               |			И (ОП.ОрганизацияАгент = Аналитика.ОрганизацияАгент)
	               |			И (ОП.СК = Аналитика.СК)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОП.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	данные.Результат КАК Результат,
	               |	данные.Ссылка.ЗаКоробку КАК СсылкаЗаКоробку,
	               |	данные.Ссылка КАК Ссылка
	               |ИЗ
	               |	Данные КАК данные
	               |ГДЕ
	               |	данные.Ссылка.ЗаКоробку <> данные.Результат
	               |	И данные.Ссылка.НомерВзноса = 1";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект                        = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка  = Истина;
		Объект.НачисленБонусЗаКоробку = Выборка.Результат<>0;
		Объект.ЗаКоробку              = Выборка.Результат;
		Объект.Записать();
	КонецЦикла;	
				   
КонецПроцедуры	

Процедура СинхронизироватьЕстьЧек() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника КАК СсылкаСправочника,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.УидСтроки КАК УидСтроки,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.ДатаПубликации КАК ДатаПубликации,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Размещен КАК Размещен,
	               |	уб_ФайлыКПолисам.ФайлИмя КАК ФайлИмя,
	               |	уб_ФайлыКПолисам.Размещен КАК Размещен1,
	               |	уб_ФайлыКПолисам.ВидДокумента КАК ВидДокумента,
	               |	уб_ФайлыКПолисам.Хранилище КАК Хранилище,
	               |	уб_ФайлыКПолисам.Архив КАК Архив,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка КАК Ссылка,
	               |	уб_ФайлыКПолисам.Страхователь КАК Страхователь
	               |ПОМЕСТИТЬ Чеки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника = уб_ФайлыКПолисам.УИД
	               |			И (уб_ФайлыКПолисам.ВидДокумента.Код = 74)
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Дата >= ДАТАВРЕМЯ(2022, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	БСО.Ссылка КАК Ссылка,
	               |	БСО.УидСтроки КАК УидСтроки,
	               |	ВЫБОР
	               |		КОГДА Чеки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК естьчек
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК БСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Чеки КАК Чеки
	               |		ПО БСО.Ссылка = Чеки.Ссылка
	               |			И БСО.УидСтроки = Чеки.УидСтроки
	               |ГДЕ
	               |	БСО.Ссылка.Дата >= ДАТАВРЕМЯ(2022, 1, 1)
	               |	И БСО.ЕстьЧек <> ВЫБОР
	               |			КОГДА Чеки.Ссылка ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	Сообщить("Для обработки 'Естьчек' "+ Всего);
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик+1;
		ОбъектЗаявка = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаявка.ОбменДанными.Загрузка = Истина;
		#Если Клиент Тогда
			Состояние("Обработка 'Естьчек': "+Окр(Счетчик*100/Всего,2));
		#КонецЕсли
		
		нСтроки = ОбъектЗаявка.БСО.НайтиСтроки(Новый Структура("УидСтроки",Выборка.УидСтроки));
		Для каждого Строка из нСтроки Цикл
			Строка.ЕстьЧек = Выборка.ЕстьЧек;
		КонецЦикла;	
		ОбъектЗаявка.Записать();
	КонецЦикла;	
КонецПроцедуры	
