#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьПараметры();
	ИнициализироватьСписки()
КонецПроцедуры

#КонецОбласти


#Область Отборы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаС",Период.ДатаНачала);
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаПо",период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаявкиПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры


&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура ОператорПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура КурьерПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗаявкиПриИзменении(Элемент)
	Фильтр();
КонецПроцедуры
&НаКлиенте
Процедура МенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Агенты"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОператорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КурьерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Курьеры"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры



&НаСервере
Процедура Фильтр()
	СтруктурыФильтра = Новый Массив;
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Менеджер",      Менеджер, Неопределено, НЕ Менеджер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Курьер",        Курьер,   Неопределено, НЕ Курьер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Оператор",      Оператор, Неопределено, НЕ Оператор.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СтатусЗаявки",  СтатусЗаявки, Неопределено, НЕ СтатусЗаявки.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Номер",         НомерЗаявки, Неопределено, НЕ НомерЗаявки = 0));
	//Если ТипЗнч(эуПоискНомерЗаявки) = Тип("Строка") Тогда 
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",_Число(эуПоискНомерЗаявки),Неопределено, НЕ ПустаяСтрока(эуПоискНомерЗаявки)));
	//Иначе
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",эуПоискНомерЗаявки,Неопределено, ЗначениеЗаполнено(эуПоискНомерЗаявки)));
	//КонецЕсли;	
	//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","БСО.СК",эуСК,Неопределено,НЕ эуСК.Пустая()));
	//Если СтрДлина(эуПоискСтрахователь)>=3 Тогда
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  уб_ВызовСервера.СтрахователиПоНаименованию(эуПоискСтрахователь),
	//	                                                                                                            ВидСравненияКомпоновкиДанных.ВСписке, НЕ ПустаяСтрока(эуПоискСтрахователь)));
	//Иначе
	//	//Отключаем
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.Равно,ЛОЖЬ));
	//КонецЕсли;	
	//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Тип",               эуПоискТипВыезда, Неопределено, НЕ эуПоискТипВыезда.Пустая()));
	//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","ФормаОплаты",       эуФормаОплаты,    Неопределено, НЕ эуФормаОплаты.Пустая()));
	//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","БСО.ВидБСО",        эуПоискВидСП,     Неопределено, НЕ эуПоискВидСП.Пустая()));
	
	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.ТаблицаМенеджер,СтруктурыФильтра);

КонецПроцедуры	

#КонецОбласти

#Область СобытияТаблицаМенеджер
&НаКлиенте
Процедура ТаблицаМенеджерВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Текущиеданные = Элементы.ТаблицаМенеджер.ТекущиеДанные;
	Элементы.ТаблицаМенеджер.ДанныеСтроки(ВыбраннаяСтрока);
	ПоказатьЗначение(,Текущиеданные.Заявка);
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеФункции

&НаСервере
Процедура ИнициализироватьПараметры()
	
		ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		ПараметрыПодчиненных.ВключаяВыбывших   			= Истина;	
		ПараметрыПодчиненных.ТолькоТочкиПродаж 			= Истина;
		ПараметрыПодчиненных.ДополнитьПредшественниками = Истина;
		уб_СС.ПодчиненныеРуководителя(,, ПараметрыПодчиненных);
		
	
	Объект.ТаблицаРолей.Очистить();
	Для каждого Роль из уб_УСЗ.ПолучитьРольПользователяДляЗаявок(Ложь,Истина,ПараметрыПодчиненных.ЭтоРуководитель) Цикл
		НоваяРоль = Объект.ТаблицаРолей.Добавить();
		НоваяРоль.Роль = Роль;
	КонецЦикла;	
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата); 
	
	
	ТекЧАС = Час(ТекущаяДата);
	ДатаНачалаДня =НачалоДня(ТекущаяДата);
	Если ТекЧАС<=8 Тогда
		ДатаСрочность = ДатаНачалаДня+14*3600;
	ИначеЕсли ТекЧАС<14 Тогда
		ДатаСрочность = ТекущаяДата+6*3600;
	Иначе
		ДатаСрочность = ТекущаяДата+((20-ТекЧАС)+16)*3600;
	КонецЕсли;	
	//ЗапросОбновленияСписков.УстановитьПараметр("ДатаСрочность",ТекущаяДата()+5*3600);
	
	Если ЕстьРоль("Менеджер") Тогда
		НачПериода1 = НачалоДня(ТекущаяДата-7*3600*24);
		КонПериода1 = КонецДня (ТекущаяДата+7*3600*24);
	Иначе	
		НачПериода1 = ДобавитьМесяц(НачалоМесяца,-6);
		КонПериода1 = КонецМесяца(КонецМесяца(НачалоМесяца)+1);
	КонецЕсли;	
	Период = Новый СтандартныйПериод(НачПериода1,КонПериода1);
	ДатаС  = Период.ДатаНачала;
	ДатаПо = Период.ДатаОкончания;
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("Менеджер",ПараметрыСеанса.уб_ТекущееФизЛицо);
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаС",ДатаС);
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаПо",ДатаПо);
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаСрочность",ДатаСрочность);
	ТаблицаМенеджер.Параметры.УстановитьЗначениеПараметра("ДатаНачалаДня",ДатаНачалаДня);
	
	
	ПолеСтатистики = уб_ВызовСервера.ВывестиСтатистику();
	ПолеСтатистики.ПоказатьУровеньГруппировокСтрок(1);
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьСписки()
	Список = Элементы.СтатусЗаявки.СписокВыбора;
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.НазначениеКурьера);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.СтраховкаСостоялась);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.ЗаявкаОтработана);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.КомплектНаХраненииВБухгалтерии);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.КомплектИДеньгиУКассира);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании);
	Список.Добавить(Перечисления.уб_СтатусыЗаявок.ЗапросНаУдаление);	
	
КонецПроцедуры	


&НаСервере
Функция ЕстьРоль(СтрокаРоли)
	
	ЕстьХотьОдна=Ложь;
	МассивПроверяемыхРолей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаРоли,",");
	Для каждого Роль из МассивПроверяемыхРолей Цикл
		ЕстьХотьОдна = НЕ Объект.ТаблицаРолей.НайтиСтроки(Новый Структура("Роль",Роль)).Количество() = 0;
		Если ЕстьХотьОдна = Истина Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ЕстьХотьОдна;
	
КонецФункции


&НаКлиенте
Процедура ТаблицаМенеджерПриАктивизацииСтроки(Элемент)
	Текущиеданные = Элементы.ТаблицаМенеджер.ТекущиеДанные;
	Если Текущиеданные = Неопределено Тогда
		ИнфоМенеджер ="";
	Иначе
		ИнфоМенеджер = "<html>"+уб_temp.СводкаПоЗаявке(Текущиеданные.Заявка)+"</html>";
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти