
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПЕЧАТИ ДОКУМЕНТА


Функция ВернутьРасчетныйСчет(СчетКонтрагента)

	БанкДляРасчетов = СчетКонтрагента.БанкДляРасчетов;
	Результат       = ?(БанкДляРасчетов.Пустая(), СчетКонтрагента.НомерСчета, СчетКонтрагента.Банк.КоррСчет);

	Возврат Результат;

КонецФункции // ВернутьРасчетныйСчет()
	
Функция ПечатьСчета()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплатуПолиса";

	Макет = ПолучитьМакет("СчетНаОплату");

	// Выводим шапку накладной

	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ПараметрыСеанса.уб_ОсновнаяОрганизация, Дата);
	
	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
	
	Банк = ?(ЗначениеНеЗаполнено(БанкСчет.БанкДляРасчетов), БанкСчет.Банк, БанкСчет.БанкДляРасчетов);
	БИК        = Банк.Код;
	КоррСчет   = Банк.КоррСчет;
	ГородБанка = Банк.Город;
	НомерСчета = ВернутьРасчетныйСчет(БанкСчет);

	ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
	ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
	ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
	ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
	ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
	ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
	ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
	
	Если ПустаяСтрока(БанкСчет.ТекстКорреспондента) Тогда
		ТекстКорреспондента = СведенияОПоставщике.ПолноеНаименование;
		Если НЕ ЗначениеНеЗаполнено(БанкСчет.БанкДляРасчетов) Тогда
			ТекстКорреспондента = ТекстКорреспондента + " р/с " + БанкСчет.НомерСчета
			+ " в " + БанкСчет.Банк + " " + БанкСчет.Банк.Город;
		КонецЕсли;	
	Иначе
		ТекстКорреспондента = БанкСчет.ТекстКорреспондента;
	КонецЕсли;		
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ТекстКорреспондента;
	
	//ОбластьМакета.Параметры.ПечОрганизация = СведенияОПоставщике.ПолноеНаименование;
	//ОбластьМакета.Параметры.ПечАдрес = "Адрес: "+СведенияОПоставщике.ЮридическийАдрес+"  тел.: "+СведенияОПоставщике.Телефоны;
	ТабДокумент.Вывести(ОбластьМакета);

	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Счет № " + Номер + " от " + Формат(Дата, "ДФ='дд ММММ гггг'");

	//ОбластьМакета.Параметры.ПечЗаказчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(СК, Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
	ОбластьМакета.Параметры.ПечЗаказчик = ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(СК, Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
	фПлательщик = ?(ОнЖеПлательщик, Страхователь, Плательщик.НаименованиеПолное+" (страхователь: "+Страхователь.НаименованиеПолное+")");
	ОбластьМакета.Параметры.ПечПлательщик = фПлательщик;
	//ОбластьМакета.Параметры.ПечЗаказчик = СК.НаименованиеПолное;
	//ПечПлательщик = ?(ОнЖеПлательщик, Страхователь.НаименованиеПолное, Плательщик.НаименованиеПолное+" (страхователь: "+Страхователь.НаименованиеПолное+")");
	//ОбластьМакета.Параметры.ПечПлательщик = ПечПлательщик;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ИтСумма = 0;
	Для каждого СтрокаТЧ Из Товары Цикл 
		ОбластьМакета.Параметры.НомерСтроки = СтрокаТЧ.НомерСтроки;
		ОбластьМакета.Параметры.Наименование = СтрокаТЧ.Наименование;
		ОбластьМакета.Параметры.Количество = СтрокаТЧ.Количество;
		ОбластьМакета.Параметры.Единица = СтрокаТЧ.Единица;
		ОбластьМакета.Параметры.Цена = СтрокаТЧ.Цена;
		ОбластьМакета.Параметры.Сумма = СтрокаТЧ.Сумма;
		ТабДокумент.Вывести(ОбластьМакета);
		ИтСумма = ИтСумма + СтрокаТЧ.Сумма;
	КонецЦикла;

	// Вывести Итого
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = ИтСумма;
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = ИтСумма;	
	ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + Строка(Товары.Количество())	
	+ ", на сумму " + ФорматСумм(СуммаКПрописи, ВалютаДокумента);	
	//+ ", на сумму " + ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ВалютаДокумента);	
	#Если Клиент Тогда
	ОбластьМакета.Параметры.СуммаПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаДокумента);
	#КонецЕсли
	ТабДокумент.Вывести(ОбластьМакета);  

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ПараметрыСеанса.уб_ОсновнаяОрганизация, Дата,);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;

	ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
	ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;
	ОбластьМакета.Параметры.ФИОМенеджера	= Ответственный;
	ОбластьМакета.Параметры.ФИОПлательщика  = ?(ОнЖеПлательщик, Страхователь.НаименованиеПолное, Плательщик.НаименованиеПолное);

	
	ТабДокумент.Вывести(ОбластьМакета); 

	Возврат ТабДокумент;

КонецФункции // ПечатьСчетаЗаказа()

Функция ФорматСумм(Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "") Экспорт 
	
	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2" + 
	?(НЕ ЗначениеЗаполнено(ЧН), "", ";" + "ЧН=" + ЧН) + 
	?(НЕ ЗначениеЗаполнено(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ); 
	
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока)); 
	
	Если ЗначениеЗаполнено(Валюта) Тогда 
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта); 
	КонецЕсли; 
	
	Возврат РезультирующаяСтрока; 
	
КонецФункции // ФорматСумм()

// Возвращает структуру данных со сводным описанием контрагента
//
// Параметры: 
//  СписокСведений - список значений со значениями параметров организации
//   СписокСведений формируется функцией СведенияОЮрФизЛице
//  Список         - список запрашиваемых параметров организации
//  СПрефиксом     - Признак выводить или нет префикс параметра организации
//
// Возвращаемое значение:
//  Строка - описатель организации / контрагента / физ.лица.
//
Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт
	
	Если ПустаяСтрока(Список) Тогда
		
		Список = "ИНН,Свидетельство,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
		Если Не СписокСведений.Свойство("НаименованиеДляПечатныхФорм") Тогда
			Список = "НаименованиеПолное," + Список;
		Иначе
			Список = "НаименованиеДляПечатныхФорм," + Список;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = "";
	
	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование",   " ");
	СоответствиеПараметров.Вставить("СокращенноеНаименование",  " ");
	СоответствиеПараметров.Вставить("НаименованиеДляПечатныхФорм", " ");
	СоответствиеПараметров.Вставить("ИНН",       " ИНН ");
	СоответствиеПараметров.Вставить("КПП",       " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство",    " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи",  " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",    " ");
	СоответствиеПараметров.Вставить("Телефоны",      " тел.: ");
	СоответствиеПараметров.Вставить("НомерСчета",     " р/с ");
	СоответствиеПараметров.Вставить("Банк",                  " в банке ");
	СоответствиеПараметров.Вставить("БИК",                   " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет",              " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО",             " Код по ОКПО ");
	
	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");
	
	Для Счетчик = 1 по ЧислоПараметров Цикл
		
		ПозЗапятой = Найти(Список, ",");
		
		Если ПозЗапятой > 0  Тогда
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));
			
			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);
				
				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;
				
				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 
				
				Результат = Результат + ?(СПрефиксом = Истина, ?(ПустаяСтрока(Результат), СокрЛ(Префикс), Префикс), "") + СтрокаДополнения;
				
			Исключение
				
				Сообщить("Не удалось определить значение параметра организации: " + ИмяПараметра, СтатусСообщения.Внимание);
				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ОписаниеОрганизации()

Процедура Печать(КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	#Если Клиент Тогда
	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОнЖеПлательщик и ЗначениеНеЗаполнено(Плательщик) Тогда
		Предупреждение("Поле плательщика не заполнено");
		Возврат;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(ВалютаДокумента) Тогда
		Предупреждение("Не выбрана валюта документа");
		Возврат;
	КонецЕсли;
	#КонецЕсли
	ТабДокумент = ПечатьСчета();
	ЗаголовокДокумента = "";
	#Если Клиент Тогда
		ЗаголовокДокумента = РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект, "");
	#КонецЕсли
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ЗаголовокДокумента, НепосредственнаяПечать);
	
КонецПроцедуры