Перем флОтладка ;
Перем ПараметрыОбмена Экспорт;


Процедура ВыполнитьОбмен() Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	УидПользователя = "a19dce94-dd5c-41a0-8bd5-42a2b4b15ca3";
	
	ИмяФайлаКэш = "D:\!1C\изШлюза.txt";
	ИмяФайлаXml = "D:\!1C\изШлюза.xml";
	файл = Новый Файл(ИмяФайлаКэш);
	Если файл.Существует() и НЕ ПараметрыОбмена.ПеречитатьСоШлюза = Истина  Тогда
		Структура = ЗначениеИзФайла(ИмяФайлаКэш);
	Иначе
		Если ПустаяСтрока(ПараметрыОбмена.ИмяФайла) = Истина Тогда
			//Из Шлюза
			
			//Сообщить("Выберите файл ");
			//Возврат;
			
			//УидПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID");
			ИмяФ = "1234.txt";
			ИмяФайлаОтправки = "D:\temp\"+ИмяФ;
			//ДатаС  = Лев(XMLСтрока(НачПериода),10);
			//ДатаПо = Лев(XMLСтрока(КонецДня(КонПериода)+1),10);
			Строка = "<?xml version=""1.0"" encoding=""UTF-8""?>
			|<rq type='Request1C' task='GetAllNewPolicesData' comp_name='TAU' sessid='' uid='"+УидПользователя+"' hash='86fe95ce-541b-e8ef-ce1a-071c97183942' />";
			Сообщить (Строка);//Запрос
			Текст = Новый ТекстовыйДокумент;
			Текст.ДобавитьСтроку(Строка);
			Текст.Вывод = ИспользованиеВывода.Разрешить;
			Текст.Записать(ИмяФайлаОтправки);
			//Сообщить(ИмяФайлаОтправки);
			
			Сервер = "www.sluice";
			//Сервер = "sluice.loc";
			Порт = 80 ;
			
			HTTP = Новый HTTPСоединение(Сервер, Порт);
			
			ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("tmp");
			ИмяФайла = ИмяПолученногоФайла;
			
			
			ЗаголовокHTTP = Новый Соответствие();
			ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
			
			Ресурс ="";
			Попытка
				HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, Ресурс, ИмяПолученногоФайла, ЗаголовокHTTP);
			Исключение
				
				//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
			КонецПопытки;
			СообщитьИзФайла(ИмяФайла," полученного файла");
			СообщитьИзФайла(ИмяФайла," полученного файла",КодировкаТекста.Системная);
			КопироватьФайл(ИмяФайла,ИмяФайлаXml);
			//Текст = Новый  ТекстовыйДокумент;
			//Текст2 = Новый  ТекстовыйДокумент;
			//Текст.Прочитать(ИмяФайла);
			//
			//Для СчетчикТ = 1 по Текст.КоличествоСтрок()  Цикл
			//	ВремСтрока = Текст.ПолучитьСтроку(СчетчикТ);
			//	Текст2.ДобавитьСтроку(ЗаменитьНедопустимыеСимволыXML(ВремСтрока));
			//КонецЦикла;
			//Текст ="";
			//Текст2.Записать(ИмяФайла);
			//Текст2 = "";
			
			//УдалитьФайлы(ИмяФайлаОтправки,);
			
		КонецЕсли;
		Попытка
			Чтение = Новый ЧтениеXML;
			Чтение.ОткрытьФайл(ИмяФайла);
		Исключение
			Сообщить("Ошибка при чтении файла "+ИмяФайла+" "+ОписаниеОшибки());
		КонецПопытки;	
		
		ИмяФайла = "";
		Структура = Чтение(Чтение,,"--ЗАГРУЗКА--");//////ЗАГРУЗКА/////	
		ЗначениеВФайл(ИмяФайлаКэш,Структура);
	КонецЕсли;
	
	
	Ответ = Новый  ТаблицаЗначений;
	Ответ.Колонки.Добавить("UID1C");
	Ответ.Колонки.Добавить("AccessKey");
	Ответ.Колонки.Добавить("Error");
	
	ОтветыПолис = Новый  ТаблицаЗначений;
	ОтветыПолис.Колонки.Добавить("UID1C");
	ОтветыПолис.Колонки.Добавить("AccessKey");
	ОтветыПолис.Колонки.Добавить("Error");
	
	ОтветыПлатежи = Новый  ТаблицаЗначений;
	ОтветыПлатежи.Колонки.Добавить("UID1C");
	ОтветыПлатежи.Колонки.Добавить("AccessKey");
	ОтветыПлатежи.Колонки.Добавить("Error");
	
	//++XML++
	Запись = Новый ЗаписьXML();
	//Запись.ОткрытьФайл("C:\Users\itc1\Desktop\Шлюз\otvet.xml");
	ИмяОтвета = ПолучитьИмяВременногоФайла("xml");
	Запись.ОткрытьФайл(ИмяОтвета);
	Запись.ЗаписатьНачалоЭлемента("rq");
	Запись.ЗаписатьАтрибут("type","Request1C");
	Запись.ЗаписатьАтрибут("task","UploadingPoliciesAnswer");
	Запись.ЗаписатьАтрибут("comp_name","TAU");
	Запись.ЗаписатьАтрибут("sessid","");
	Запись.ЗаписатьАтрибут("uid",""+УидПользователя);
	Запись.ЗаписатьАтрибут("hash","86fe95ce-541b-e8ef-ce1a-071c97183942");
	//|<rq type='Request1C' task='GetAllNewPolicesData' comp_name='"+ИмяКомпьютера()+"' sessid='' uid='"+УидПользователя+"' hash='"+уб_СЕРВЕРНЫЕ.SID()+"' />";
	Запись.ЗаписатьНачалоЭлемента("body");
	//--XML--
	
	СчетчикОшибок = 0;
	Если НЕ ТипЗнч(Структура) = Тип("Структура") Тогда
		Сообщить("Xml не преобразована в структуру");
		Возврат;
	КонецЕсли;	
	Если Структура.Свойство("body")= Истина и Структура.body.Свойство("Polices") = Истина Тогда
		Полисы = Структура.body.Polices;
		Если ТипЗнч(Полисы) = Тип("ТаблицаЗначений") Тогда
			КоличествоПолисов = Полисы.Количество();
			Сообщить("Всего полисов "+КоличествоПолисов);
			МассивСтрок = Новый Массив;
			Если Не ПустаяСтрока(ПараметрыОбмена.НомерПолисаОтбор) Тогда
				//
				Для каждого СтрокаП из Полисы Цикл
					Если СтрокаП.Значение.Свойство("PoliceNumber") и Найти (ПараметрыОбмена.НомерПолисаОтбор,СтрокаП.Значение.PoliceNumber)>0 Тогда
						МассивСтрок.Добавить( СтрокаП);
						//Прервать;
					КонецЕсли;	
				КонецЦикла;	
				
				Если МассивСтрок.Количество() = 0  Тогда
					Сообщить("Не найден полис в выгрузке");
				КонецЕсли;
				Полисы = Полисы.Скопировать(МассивСтрок);		
			Иначе
				Если ПараметрыОбмена.ОграничениеСписков >0  и ПараметрыОбмена.ОграничениеСписков<КоличествоПолисов Тогда
					Для Счетчик = (КоличествоПолисов-ПараметрыОбмена.ОграничениеСписков+1)  По КоличествоПолисов Цикл
						МассивСтрок.Добавить( Полисы[Счетчик-1]);
					КонецЦикла;
					Полисы = Полисы.Скопировать(МассивСтрок);	
				КонецЕсли;
			КонецЕсли;
			
			//++XML++
			Запись.ЗаписатьНачалоЭлемента("Polices");
			ЗакрытПолис = Истина;
			//--XML--
			Для каждого СтрокаПолис Из Полисы Цикл
				Полис = СтрокаПолис.Значение;
				AccessKey = Полис.AccessKey;
				Если Полис.Свойство("UID1C") Тогда
					UID1C = Полис.UID1C;
				Иначе
				 	UID1C = "";	
				КонецЕсли;
				Если Полис.Свойство("PoliceNumber") = Ложь 
					ИЛИ ПустаяСтрока(Полис.PoliceNumber) Тогда
					Сообщить("Пустой номер полиса "+?(Полис.Свойство("AccessKey")=Ложь,"",Полис.AccessKey));
					Продолжить;
				КонецЕсли;
				//
				Полис.Вставить("PoliceNumberIn",Полис.PoliceNumber);
				Полис.PoliceNumber = ПреобразоватьНОмерПолиса(Полис.PoliceNumber);
				
				
				ОтветыПолис.Очистить();
				//++XML++
				Если ЗакрытПолис = Ложь Тогда
					
					Запись.ЗаписатьКонецЭлемента();
				КонецЕсли;
				Запись.ЗаписатьНачалоЭлемента("Police");
					Запись.ЗаписатьНачалоЭлемента("AccessKey");
					
						Запись.ЗаписатьТекст(Полис.AccessKey);
						
					Запись.ЗаписатьКонецЭлемента();
					Запись.ЗаписатьКомментарий(" Уникальный ID полиса, увязывающий его с платежными операциями ");
					Запись.ЗаписатьКомментарий(" "+СтрЗаменить(Полис.PoliceNumber,"--","")+" ");
					Запись.ЗаписатьНачалоЭлемента("InsType");
					
						Запись.ЗаписатьАтрибут("t",Полис.InsType);
						Запись.ЗаписатьТекст(Полис.InsTypeValue);
					Запись.ЗаписатьКонецЭлемента();
					Запись.ЗаписатьКомментарий(" ID вида страхования из т. stat.SEOAnketaTypes. 23 - DMS44, 12 - ВЗР, 1 - КАСКО, 2 - ОСАГО, 3 - ДМС ");
					
				ЗакрытПолис = Ложь;
				//--XML--
				
				Если Полис.Свойство("Сancellation") Тогда
					//	
					Аннулирован = Полис.Сancellation="1";
				Иначе
					
					Аннулирован = Ложь;
				КонецЕсли;
				Если Полис.Свойство("HasChangesFor1C") = Ложь Тогда
					//	
					ЕстьИзмененияСуществующего = Ложь;
				Иначе
					ЕстьИзмененияСуществующего = Полис.HasChangesFor1C="1";
				КонецЕсли;
				
				ОбъектПолиса = Неопределено;
				Если Не ПустаяСтрока(UID1C) Тогда
					//1 Вариант поиска полиса
					СсылкаПолиса = Документы.уб_СтраховойПолис.ПолучитьСсылку(Новый УникальныйИдентификатор(UID1C));
					ОбъектПолиса = СсылкаПолиса.ПолучитьОбъект();
					
					Если ОбъектПолиса = Неопределено Тогда
						Сообщить("Не найден полис с этим UID");
						Если ПараметрыОбмена.Свойство("СоздаватьПолисыСНеНайденнымУИД") = Истина и ПараметрыОбмена.СоздаватьПолисыСНеНайденнымУИД = Истина Тогда
							
						Иначе
							//++error++
							ТекстОшибки = "Заполнен УИД, но не найден ID=%s. Полис не будет обновлен.";
							
							СчетчикОшибок = СчетчикОшибок+1;
							Ошибка = Новый Структура("msg,num,args",
								ТекстОшибки,
								"2015042001",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
								UID1C);
							Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
							СтрокаОшибки = ОтветыПолис.Добавить();
							СтрокаОшибки.Error = Ошибка;
							//--error--
							
							Перейти ~ЗакрытиеПолиса;
							//Продолжить;
						КонецЕсли;	
					Иначе
						//Если Аннулирован = Истина Тогда
						//	ОбъектПолиса.СостояниеПолиса = Перечисления.уб_СостоянияПолиса.АннулированПолностью;
						//КонецЕсли;	
					КонецЕсли;
				Иначе
					//Нет уид
					СсылкаПолис = Документы.уб_СтраховойПолис.ПолучитьСсылку(Новый УникальныйИдентификатор);//Генерируем новую ссылку
				КонецЕсли;	
				
				Если ОбъектПолиса = Неопределено Тогда
					
					//2 Вариант поиска полиса
					ВремСсылкаПолис = Документы.уб_СтраховойПолис.НайтиПоНомеру(Полис.PoliceNumber,ДатаИзСтроки(Полис.EffDate));
					Если ВремСсылкаПолис.Пустая() Тогда
						ВремСсылкаПолис = Документы.уб_СтраховойПолис.НайтиПоНомеру(Полис.PoliceNumber+"'",ДатаИзСтроки(Полис.EffDate));
					КонецЕсли;	
					Если ВремСсылкаПолис.Пустая() Тогда
						Если Аннулирован = 1 Тогда
							Сообщить("Пропущен аннулированный "+Полис.PoliceNumber);
							Продолжить;//Не найден и не создаем
						КонецЕсли;
					
						//++++ Создаем объект полиса ++++
						ОбъектПолиса = Документы.уб_СтраховойПолис.СоздатьДокумент();
						ОбъектПолиса.УстановитьСсылкуНового(СсылкаПолис);
					Иначе
						СсылкаПолис = ВремСсылкаПолис;//Найден по номеру, возможно создан ранее, в т.ч. руками
						ОбъектПолиса = СсылкаПолис.ПолучитьОбъект();
					КонецЕсли;	
				КонецЕсли;
				Если Аннулирован = Истина Тогда
					ОбъектПолиса.СостояниеПолиса = Перечисления.уб_СостоянияПолиса.АннулированПолностью;
					ЕстьИзмененияСуществующего =ЕстьИзмененияСуществующего=Истина или ОбъектПолиса.ЭтоНовый()=Ложь;
				КонецЕсли;	
				//АВ
				Комиссия     = 0;
				ОплаченоФакт = 0;
				Если Полис.Свойство("Payments") Тогда
					Для каждого СтрокаПриемки Из Полис.Payments Цикл
						Попытка
							СтрПриемки = СтрокаПриемки.Значение;		
						Исключение
							Продолжить;
						КонецПопытки;
						
						Если СтрПриемки.Свойство("PaySysFee") Тогда
							Комиссия = Комиссия -Число(СтрПриемки.PaySysFee);
						КонецЕсли;	
						Если СтрПриемки.Свойство("Amount") Тогда
							ОплаченоФакт = ОплаченоФакт + Число(СтрПриемки.Amount);
						КонецЕсли;	
						
					КонецЦикла;
				КонецЕсли;	
				Если ОплаченоФакт<0 Тогда
					//
					ОплаченоФакт = 0;
					Сообщить("Отрицательная оплата "+Полис.PoliceNumber);
				КонецЕсли;

				Если ОбъектПолиса.ЭтоНовый() = Ложь Тогда
					НомерВзноса = 1;//дальше брать из xml когда будет
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	уб_ОплатаПолисов.Ссылка,
					               |	уб_ОплатаПолисов.НачисленнаяСуммаВзноса,
					               |	уб_ОплатаПолисов.ОплаченоФакт
					               |ИЗ
					               |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
					               |ГДЕ
					               |	(уб_ОплатаПолисов.НомерВзноса =0 или уб_ОплатаПолисов.НомерВзноса = &НомерВзноса)
					               |	И уб_ОплатаПолисов.СтраховойПолис = &СтраховойПолис";
					Запрос.УстановитьПараметр("НомерВзноса",НомерВзноса);
					Запрос.УстановитьПараметр("СтраховойПолис",ОбъектПолиса.Ссылка);
					ВыборкаОплата = Запрос.Выполнить().Выбрать();
					ЕстьИзмененияСуществующегоОплата = ЕстьИзмененияСуществующего;
					Если ВыборкаОплата.Следующий() Тогда
						//
						ОбъектОплата = ВыборкаОплата.Ссылка.ПолучитьОбъект(); 
						Если ОплаченоФакт = 0 Тогда
							_ОплаченоФакт = 0;
						Иначе
							_НачисленнаяСуммаВзноса = Число(Полис.GrossРremium);//!-- Полная страховая премия (Брутто), включающая все комиссии -->;	
							_АВилиСкидкаСумма       = Окр(Число(Полис.AV)+Комиссия,2);//
							_ОплаченоФакт           = _НачисленнаяСуммаВзноса - _АВилиСкидкаСумма;
						КонецЕсли;
						Если _ОплаченоФакт<>ВыборкаОплата.ОплаченоФакт Тогда
							//ОплаченоФакт = 0 и (Не ВыборкаОплата.НачисленнаяСуммаВзноса = 0 или не ВыборкаОплата.ОплаченоФакт =0) Тогда
							ГрузимОплату = Истина;
							ЕстьИзмененияСуществующегоОплата = Истина;
						КонецЕсли;
					Иначе
						ОбъектОплата = Документы.уб_ОплатаПолисов.СоздатьДокумент(); 
						ОбъектОплата.СтраховойПолис = ОбъектПолиса.Ссылка;
						ЕстьИзмененияСуществующегоОплата = Ложь;//Был полис, но не было оплаты
					КонецЕсли;

					//Два варианта
					//1. Принудительная перезапись полиса
					Если ПараметрыОбмена.ПерезаписыватьСуществующиеПолисы  = Истина Тогда
						ГрузимПолис = Истина;
						ГрузимОплату = Истина;
					//2. Есть существенные изменения	
					ИначеЕсли ЕстьИзмененияСуществующего = Истина или ЕстьИзмененияСуществующегоОплата=Истина Тогда
						ГрузимПолис = Истина;
						ГрузимОплату = Истина;
					Иначе
						
						ГрузимПолис = Ложь;
						ГрузимОплату = Ложь;
						//Продолжить;
					КонецЕсли;
				Иначе
					ЕстьИзмененияСуществующего = Ложь;//
					ГрузимПолис  = Истина ;
					ГрузимОплату = Истина;
					ОбъектОплата = Неопределено;
					НомерВзноса = 1;//дальше брать из xml когда будет
				КонецЕсли;
				
				СК = НайтиСтраховуюКомпанию(Полис.InsCompany,Полис.InsCompanyINN);
				Если Полис.Свойство("InsType") и Полис.Свойство("InsProduct") и Полис.Свойство("OrgAgentINNValue") Тогда
					СтруктураСтраховки = ПолучитьДанныеПоСтраховке(Новый Структура("СК,ТипСтрахования,СтраховойПродукт,Организация",СК,Полис.InsType,Полис.InsProduct,Полис.OrgAgentINNValue));
				Иначе
					Сообщить(""+Полис.PoliceNumber+" Отсутствует свойство "+Полис.Свойство("InsType") +"/"+ Полис.Свойство("InsProduct") +"/"+ Полис.Свойство("OrgAgentINNValue") );
					Продолжить;
				КонецЕсли;
				
				Если СтруктураСтраховки.СтраховойПродуктСтрока ="ВЗР" 
					и ОбъектПолиса.Дата < Дата(2015,9,1)  
					и  ОбъектПолиса.ЭтоНовый() = Ложь Тогда
					Сообщить ("Пропущен и подтвержден старый "+ОбъектПолиса.Ссылка);
					Запись.ЗаписатьНачалоЭлемента("UID1C");
					Запись.ЗаписатьТекст(Строка(ОбъектПолиса.Ссылка.УникальныйИдентификатор()));
					Запись.ЗаписатьКонецЭлемента();
					Запись.ЗаписатьКомментарий(" ID полиса в 1С. Служит для идентификации сущности полиса в 1С и как признак ""загружено в 1С"" на стороне шлюза. Для еще не отправленных в 1С полисов - отсутствует. ");
					Если Полис.Payments.Количество()>0 Тогда
						//++XML++
						Запись.ЗаписатьНачалоЭлемента("Payments");
						Для каждого СтрокаПлатежей из Полис.Payments Цикл
							ПлатежP = СтрокаПлатежей.Значение;
							Если ПлатежP.Свойство("UID1C") Тогда
								UID1CПриемка = ПлатежP.UID1C;
							Иначе
								UID1CПриемка = "TransactionID_"+ПлатежP.TransactionID;
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								               |	уб_ПриемкаОплатПолисы.УИДСтроки,
								               |	уб_ПриемкаОплатПолисы.Ссылка
								               |ИЗ
								               |	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
								               |ГДЕ
								               |	уб_ПриемкаОплатПолисы.НомерПолиса = &НомерПолиса
								               |	И уб_ПриемкаОплатПолисы.СК = &СК
								               |	И уб_ПриемкаОплатПолисы.Ссылка.Проведен";
								Запрос.УстановитьПараметр("НомерПолиса",Полис.PoliceNumber);
								Запрос.УстановитьПараметр("СК",ОбъектПолиса.СК);
								Выборка = Запрос.Выполнить().Выбрать();
								Если Выборка.Следующий() Тогда  
									//СсылкаПриемка = Выборка.Ссылка;
									//ОбъектПриемка = СсылкаПриемка.ПолучитьОбъект();
									//КритическаОшибка = Ложь;
									//СтрокаПриемки  = СтрокаПриемки(ОбъектПриемка,Выборка.УИДСтроки,ОтветыПлатежи,КритическаОшибка) ;	 
									//Если КритическаОшибка = Истина Тогда
									//	Прервать;
									////	Перейти ~ЗакрытиеПриемки;
									//КонецЕсли;
									UID1CПриемка = Выборка.УИДСтроки; //Подмена
								КонецЕсли;	
							КонецЕсли;
							
							Запись.ЗаписатьНачалоЭлемента("Payment");
								Запись.ЗаписатьНачалоЭлемента("TransactionID");
									Запись.ЗаписатьТекст(ПлатежP.TransactionID);
								Запись.ЗаписатьКонецЭлемента();
								Запись.ЗаписатьКомментарий("ID платежной операции, служащее для идентификации данных в ответе 1С");
								//
								Запись.ЗаписатьНачалоЭлемента("UID1C");
									Запись.ЗаписатьТекст(UID1CПриемка);
								Запись.ЗаписатьКонецЭлемента();
								Запись.ЗаписатьКомментарий("ID строки приемки сигнализирует, что строка загружена");
							Запись.ЗаписатьКонецЭлемента();//Payment
						КонецЦикла;	
						Запись.ЗаписатьКонецЭлемента();//Payments
						//--XML--
					КонецЕсли;
					
					Перейти ~ЗакрытиеПолиса;
					
				КонецЕсли;
				
				ДанныеПоБланку = ДанныеПоБланку(Полис.PoliceNumber,СК,СтруктураСтраховки.СтраховойПродуктСтрока,СтруктураСтраховки.Организация);
				
				
				Если ГрузимПолис = Истина Тогда
					ОбъектПолиса.ДополнительныеСвойства.Вставить("НеДвигатьСтатусы");//Статусов по ним - нет, для ускорения
					
					
					Если ПустаяСтрока(Полис.Official) Тогда
						ОбъектПолиса.Агент =	Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию(Полис.Site);
					Иначе	
						ОбъектПолиса.Агент                  = уб_temp.СсылкаСправочникаПоНаименованию("ФизическиеЛица",Полис.Official,Ложь);
						Если ЗначениеЗаполнено(ОбъектПолиса.Агент) = Ложь Тогда 
							Если Полис.Свойство("OfficialValue") Тогда
								OfficialID = Полис.OfficialValue;
								ОбъектПолиса.Агент = НайтиАгентаПоУИД(OfficialID);
							КонецЕсли;	
							Если ЗначениеЗаполнено(ОбъектПолиса.Агент) = Ложь Тогда 
								//++error++
								ТекстОшибки = "Не найден агент по ID=%s. Полис не создан.";
								СчетчикОшибок = СчетчикОшибок+1;
								
								Ошибка = Новый Структура("msg,num,args",
								ТекстОшибки,
								"2015042002",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
								""+OfficialID+","+Полис.Official);
								Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args+"/"+Полис.PoliceNumber));
								СтрокаОшибки = ОтветыПолис.Добавить();
								СтрокаОшибки.Error = Ошибка;
								//--error--
								Перейти ~ЗакрытиеПолиса;
								//Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					//Агент
					ОбъектПолиса.ПодразделениеОП        = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию(Полис.Site);
					Если ОбъектПолиса.ПодразделениеОП.Пустая() Тогда
						ОбъектПолиса.ПодразделениеОП = ОбъектПолиса.Подразделение;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ОбъектПолиса.Агент) =Ложь Тогда
						ОбъектПолиса.Агент  =  ОбъектПолиса.ПодразделениеОП;	
					Иначе
						ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(ОбъектПолиса.Агент,ОбъектПолиса.Дата,Истина);
						Если ЗначениеЗаполнено(ПодразделениеАгента) Тогда
							ОбъектПолиса.ПодразделениеОП = ПодразделениеАгента;
						КонецЕсли;
					КонецЕсли;	
					
					//Страхователь
					Если Полис.Insurer.Свойство("Person") = Истина Тогда
						
						ОбъектПолиса.Страхователь = СоздатьФизлицо(Полис.Insurer.Person,ОбъектПолиса.Страхователь);	
						
					ИначеЕсли Полис.Insurer.Свойство("Legal") = Истина Тогда
						Страхователь  = Полис.Insurer.Legal;
						Если Страхователь.Свойство("INN") = Истина и ЗначениеЗаполнено(Страхователь.INN) Тогда
							СсылкаСтрахователь =  Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",Страхователь.INN);
						КонецЕсли;
						Если ЗначениеЗаполнено(СсылкаСтрахователь) = Ложь Тогда
							НаименованиеC = Страхователь.Name;
							СтруктураЗаполнения = Новый Структура;
							СтруктураЗаполнения.Вставить("Наименование",НаименованиеC);
							СтруктураЗаполнения.Вставить("НаименованиеПолное",НаименованиеC);
							СтруктураЗаполнения.Вставить("НаименованиеКраткое",НаименованиеC);
							СтруктураЗаполнения.Вставить("ИНН",Страхователь.INN);
							СтруктураЗаполнения.Вставить("КПП",Страхователь.KPP);
							СтруктураЗаполнения.Вставить("ЮрФизЛицо",?(Страхователь.LegalType=1,Перечисления.ЮрФизЛицо.ФизЛицо,Перечисления.ЮрФизЛицо.ЮрЛицо));
							
							СсылкаСтрахователь = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты",НаименованиеC,Истина,,СтруктураЗаполнения);
						КонецЕсли;
						ОбъектПолиса.Страхователь = СсылкаСтрахователь;
					КонецЕсли;
					
					//Организация
					ОбъектПолиса.ОрганизацияАгент       = ДанныеПоБланку.ОрганизацияАгент;
					
					ОбъектПолиса.СуммаСкидкиПоОплатам   = Число(Полис.AV)+Комиссия;//<!-- Полная сумма АВ агента. Она же - скидка -->
					
					Если ЕстьИзмененияСуществующего = Ложь Тогда
						//Остальное постоянно не перезаписывается
						ОбъектПолиса.Номер                  = Полис.PoliceNumber;
						ОбъектПолиса.Дата                   = ДатаИзСтроки(Полис.IssueDate);
						
						ОбъектПолиса.ВалютаДокумента        = ПараметрыОбмена.Валюта;
						ОбъектПолиса.ДатаВыдачи             = ДатаИзСтроки(Полис.IssueDate);
						ОбъектПолиса.ДатаДвиженияБСО        = ОбъектПолиса.ДатаВыдачи;
						ОбъектПолиса.ДатаНачала             = ДатаИзСтроки(Полис.EffDate);
						ОбъектПолиса.ДатаОкончания          = ДатаИзСтроки(Полис.TermDate);
						ОбъектПолиса.Комментарий            = "Загружено из шлюза";
						ОбъектПолиса.КурсДокумента          = ПараметрыОбмена.Курс;
						ОбъектПолиса.ВидУчетаСтраховки      = Перечисления.уб_ВидыУчетаСтраховок.Первичная;
						//ОбъектПолиса.Курьер                 = ;
						ОбъектПолиса.НомерЗаявки            = Перечисления.уб_ВидыЗаявок.КоробочнаяПродажа;
						
						ОбъектПолиса.ОбъектСтрахования      = СтруктураСтраховки.ОбъектСтрахования;
						
						ОбъектПолиса.Ответственный          = ПараметрыСеанса.ТекущийПользователь;
						ОбъектПолиса.Ответственный2          = ПараметрыСеанса.ТекущийПользователь;
						ОбъектПолиса.Подразделение          = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("ОУ БСО");
						ОбъектПолиса.Поставщик              = ДанныеПоБланку.Поставщик;
						
						ОбъектПолиса.СК                     = СК;
						//ОбъектПолиса.СкидкаОбщаяПроцент     = ;
						ОбъектПолиса.Собственник            = ОбъектПолиса.Страхователь;
						ОбъектПолиса.СостояниеОплаченности  = 2;//0 - не оплачен, 1 - оплачен частично, 2 - оплачен полностью, 3 - переплачено.
						ОбъектПолиса.СостояниеПолиса        = Перечисления.уб_СостоянияПолиса.Действует;
						
						ОбъектПолиса.СтраховаяПремия        = Число(Полис.GrossРremium);//!-- Полная страховая премия (Брутто), включающая все комиссии -->
						ОбъектПолиса.СтраховаяСумма         = Число(Полис.SumInsured);
						ОбъектПолиса.СтраховойПродукт       = СтруктураСтраховки.СтраховойПродукт;
						ОбъектПолиса.СуммаПремийПоОплатам   = ОбъектПолиса.СтраховаяПремия;
						
						ОбъектПолиса.ЕстьОшибка             = Ложь;
						
						Платежи = ОбъектПолиса.Платежи;
						Платежи.Очистить();
						Платеж = Платежи.Добавить();
						Платеж.Дата   =  ОбъектПолиса.Дата;
						Платеж.Сумма  =  ОбъектПолиса.СтраховаяПремия;
						
						Риски  = ОбъектПолиса.Риски;
						Риски.Очистить();
						Риск = Риски.Добавить();
						Риск.СтраховойРиск    = СтруктураСтраховки.Риск;
						Риск.СтраховаяСумма   = ОбъектПолиса.СтраховаяСумма;
						Риск.Валюта           = ПараметрыОбмена.Валюта;
						Риск.СтраховаяПремия  = ОбъектПолиса.СтраховаяПремия;
						Риск.Тариф            = ?(Риск.СтраховаяСумма = 0, 0, Риск.СтраховаяПремия * 100 / Риск.СтраховаяСумма);
						//Риск.ТипФраншизы      = ;
						//Риск.СуммаФраншизы    = ;
						
						Застрах  = Полис.Insured.Person;
						ФИО = Застрах.LastName+" "+Застрах.FirstName+" "+?(Застрах.Свойство("MiddleName"),Застрах.MiddleName,"");
						Застрахованные = ОбъектПолиса.Застрахованные;
						Застрахованные.Очистить();
						Застрахованный = Застрахованные.Добавить();
						Застрахованный.ФИО          = ФИО;
						Застрахованный.ДатаРождения = ДатаИзСтроки(Застрах.BirthDate);
						
						
						БСО = ОбъектПолиса.БСО;
						СтрокаБСО = Неопределено;
						Для каждого СтрокаБСО Из БСО Цикл
							Если СтрокаБСО.ВидБСО = ДанныеПоБланку.ВидБСО Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						//БСО.Очистить();
						Если СтрокаБСО =Неопределено Тогда
							СтрокаБСО = БСО.Добавить();
							СтрокаБСО.ВидБСО = ДанныеПоБланку.ВидБСО;
						КонецЕсли;
						
						СтрокаБСО.НомерБСО        =  ДанныеПоБланку.НомерБСО;
						СтрокаБСО.НомерПолиса     =  ДанныеПоБланку.НомерПолиса;
						СтрокаБСО.Обязательно     =  Истина;
						СтрокаБСО.Оформлен        =  Истина;
						СтрокаБСО.НазначениеБСО   =  Перечисления.уб_НазначенияБСО.Остается;
						//СтрокаБСО.Агент           =  ;
						
						//
					КонецЕсли;//ЕстьИзмененияСуществующего=ложь
					Попытка
						Если ПараметрыОбмена.РабочийРежим = Истина  Тогда
							ОбъектПолиса.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
					Исключение
						Попытка
							Если ПараметрыОбмена.РабочийРежим = Истина Тогда
								ОбъектПолиса.Записать();
							КонецЕсли;	
						Исключение
							
							//++error++
							ТекстОшибки = "При записи полиса ID=%s. Полис не создан.("+ОписаниеОшибки()+")";
							
							СчетчикОшибок = СчетчикОшибок+1;
							
							Ошибка = Новый Структура("msg,num,args",
							ТекстОшибки,
							"2015042003",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
							ОбъектПолиса.Номер);
							Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
							СтрокаОшибки = ОтветыПолис.Добавить();
							СтрокаОшибки.Error = Ошибка;
							//--error--
							Перейти ~ЗакрытиеПолиса;
							//Продолжить;
						КонецПопытки;	
					КонецПопытки;

					//СтрокаОтвета.UID1C = Строка(ОбъектПолиса.Ссылка.УникальныйИдентификатор());
					//++XML++
					Если Не ОбъектПолиса.Ссылка = Документы.уб_СтраховойПолис.ПустаяСсылка() Тогда
						Запись.ЗаписатьНачалоЭлемента("UID1C");
						Запись.ЗаписатьТекст(Строка(ОбъектПолиса.Ссылка.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
						Запись.ЗаписатьКомментарий(" ID полиса в 1С. Служит для идентификации сущности полиса в 1С и как признак ""загружено в 1С"" на стороне шлюза. Для еще не отправленных в 1С полисов - отсутствует. ");
					КонецЕсли;	
					//--XML--
				Иначе
					//++XML++
					Если Не ОбъектПолиса.Ссылка = Документы.уб_СтраховойПолис.ПустаяСсылка() Тогда
						Запись.ЗаписатьНачалоЭлемента("UID1C");
						Запись.ЗаписатьТекст(Строка(ОбъектПолиса.Ссылка.УникальныйИдентификатор()));
						Запись.ЗаписатьКонецЭлемента();
						Запись.ЗаписатьКомментарий(" ID полиса в 1С. Служит для идентификации сущности полиса в 1С и как признак ""загружено в 1С"" на стороне шлюза. Для еще не отправленных в 1С полисов - отсутствует. ");
					КонецЕсли;	
					//--XML--

				КонецЕсли;//ГрузимПолис = Истина
			
				//Поиск оплаты
				
				
				Если Не ОбъектПолиса.Ссылка.Пустая()  Тогда
					Если ОбъектОплата = Неопределено Тогда
						ОбъектОплата = Документы.уб_ОплатаПолисов.СоздатьДокумент(); 
						ОбъектОплата.СтраховойПолис = ОбъектПолиса.Ссылка;
						ЕстьИзмененияСуществующегоОплата = Ложь;//Был полис, но не было оплаты
						ОбъектОплата.НомерВзноса = НомерВзноса;
					КонецЕсли; 
						
					//НомерВзноса = 1;//дальше брать из xml когда будет
					//
					//Запрос = Новый Запрос;
					//Запрос.Текст = "ВЫБРАТЬ
					//			   |	уб_ОплатаПолисов.Ссылка,
					//			   |	уб_ОплатаПолисов.НачисленнаяСуммаВзноса,
					//			   |	уб_ОплатаПолисов.ОплаченоФакт
					//			   |ИЗ
					//			   |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
					//			   |ГДЕ
					//			   |	уб_ОплатаПолисов.НомерВзноса = &НомерВзноса
					//			   |	И уб_ОплатаПолисов.СтраховойПолис = &СтраховойПолис";
					//Запрос.УстановитьПараметр("НомерВзноса",НомерВзноса);
					//Запрос.УстановитьПараметр("СтраховойПолис",ОбъектПолиса.Ссылка);
					//ВыборкаОплата = Запрос.Выполнить().Выбрать();
					//ЕстьИзмененияСуществующегоОплата = ЕстьИзмененияСуществующего;
					//Если ВыборкаОплата.Следующий() Тогда
					//	//
					//	ОбъектОплата = ВыборкаОплата.Ссылка.ПолучитьОбъект(); 
					//	Если ОплаченоФакт = 0 и (Не ВыборкаОплата.НачисленнаяСуммаВзноса = 0 или не ВыборкаОплата.ОплаченоФакт =0) Тогда
					//		ГрузимОплату = Истина;
					//		ЕстьИзмененияСуществующегоОплата = Истина;
					//	КонецЕсли;
					//Иначе
					//	ОбъектОплата = Документы.уб_ОплатаПолисов.СоздатьДокумент(); 
					//	ОбъектОплата.СтраховойПолис = ОбъектПолиса.Ссылка;
					//	ЕстьИзмененияСуществующегоОплата = Ложь;//Был полис, но не было оплаты
					//КонецЕсли;
					
					Если ГрузимОплату = Истина Тогда
						Если ОбъектОплата.ЭтоНовый()= Ложь Тогда
							//При записи полиса могло быть изменение оплаты
							ОбъектОплата.Прочитать();
						КонецЕсли;
						//Организация
						УстановитьЗначение(ОбъектОплата.ОрганизацияАгент,  ОбъектПолиса.ОрганизацияАгент);
						УстановитьЗначение(ОбъектОплата.Дата, ОбъектПолиса.Дата);
						УстановитьЗначение(ОбъектОплата.ЗарплатныйПериод,НачалоМесяца(ОбъектОплата.Дата));
						УстановитьЗначение(ОбъектОплата.Подразделение, ОбъектПолиса.ПодразделениеОП);
						//Агент
						УстановитьЗначение(ОбъектОплата.Агент,  ОбъектПолиса.Агент); 
						тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(НачалоДня(КонецМесяца(ОбъектОплата.ЗарплатныйПериод)), ОбъектОплата.Подразделение.Владелец, ОбъектОплата.Подразделение, ОбъектОплата.Агент);
						Если тз.Количество() > 0 Тогда
							СхемаРасчета = тз[0].СхемаРасчета;
						Иначе
							СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
							Сообщить("Ошибка при получении вида расчета с менеджером."+ОбъектОплата.Агент,СтатусСообщения.ОченьВажное);
							//Возврат  ВознаграждениеМенеджера;
						КонецЕсли;
						УстановитьЗначение(ОбъектОплата.СхемаРасчетаСМенеджером,        СхемаРасчета);
						УстановитьЗначение(ОбъектОплата.ВидРасчетаСАгентом     ,        Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме);
						
						//АВ
						Изменено = Ложь;
						
						Если ОплаченоФакт = 0 Тогда
							Изменено = УстановитьЗначение(ОбъектОплата.НачисленнаяСуммаВзноса,0) или Изменено;//!-- Полная страховая премия (Брутто), включающая все комиссии -->;		
							Изменено = УстановитьЗначение(ОбъектОплата.АВилиСкидкаСумма,0) или Изменено;//
							УстановитьЗначение(ОбъектОплата.ОплаченоФакт, 0);
							УстановитьЗначение(ОбъектОплата.КВСумма, 0);
							УстановитьЗначение(ОбъектОплата.КВСуммаДляАгента, 0);
							УстановитьЗначение(ОбъектОплата.КВСуммаДляОтчета, 0);
							УстановитьЗначение(ОбъектОплата.Баланс_Брокер_Поставщик,0);
							УстановитьЗначение(ОбъектОплата.ДБ,0);
						Иначе
							Изменено = УстановитьЗначение(ОбъектОплата.НачисленнаяСуммаВзноса,Число(Полис.GrossРremium)) или Изменено;//!-- Полная страховая премия (Брутто), включающая все комиссии -->;	
							Изменено = УстановитьЗначение(ОбъектОплата.АВилиСкидкаСумма,Окр(Число(Полис.AV)+Комиссия,2)) или Изменено;//
							УстановитьЗначение(ОбъектОплата.ОплаченоФакт, ОбъектОплата.НачисленнаяСуммаВзноса - ОбъектОплата.АВилиСкидкаСумма);
							//РТ+ добавлено после факта правки кв задним числом
							КВ = Число(Полис.KV);//;//Полное КВ	
							ОбъектОплата.НеМенятьКВ                    = Истина;
							//КВ = ОбъектОплата.АВилиСкидкаСумма+Число(Полис.KV);//Полное КВ
							
							КВПроцент = Окр(?(ОбъектОплата.НачисленнаяСуммаВзноса=0,0,КВ*100/ОбъектОплата.НачисленнаяСуммаВзноса),2);
							//КВПроцент = Цел(10*?(ОбъектОплата.НачисленнаяСуммаВзноса=0,0,КВ*100/ОбъектОплата.НачисленнаяСуммаВзноса))/10;
							//КВОкр = Окр(КВПроцент*ОбъектОплата.НачисленнаяСуммаВзноса/100,2);
							Изменено = УстановитьЗначение(ОбъектОплата.КВСумма,КВ) или Изменено;
							ОбъектОплата.КВПроцент                     = КВПроцент;
							ОбъектОплата.КВСуммаДляАгента              = КВ;
							ОбъектОплата.КВПроцентДляАгента            = КВПроцент;
							ОбъектОплата.КВСуммаДляОтчета              = КВ;
							ОбъектОплата.КВПроцентДляОтчета            = КВПроцент;
							ОбъектОплата.ДБ                            = ОбъектОплата.КВСумма- ОбъектОплата.АВилиСкидкаСумма;
							ОбъектОплата.Баланс_Брокер_Поставщик       = ОбъектОплата.НачисленнаяСуммаВзноса- ОбъектОплата.КВСумма;
							//РТ-
						КонецЕсли;
						УстановитьЗначение(ОбъектОплата.НачисленнаяСуммаВзносаВВалюте, ОбъектОплата.НачисленнаяСуммаВзноса);
						УстановитьЗначение(ОбъектОплата.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,  ОбъектОплата.НачисленнаяСуммаВзноса);
						
						
						УстановитьЗначение(ОбъектОплата.АВилиСкидкаПроцент    , ?(ОбъектОплата.НачисленнаяСуммаВзноса = 0,0,ОбъектОплата.АВилиСкидкаСумма*100/ОбъектОплата.НачисленнаяСуммаВзноса));
						УстановитьЗначение(ОбъектОплата.ПолнаяСтраховаяПремия , ОбъектОплата.НачисленнаяСуммаВзноса);
						
						Если ЕстьИзмененияСуществующегоОплата = Ложь Тогда
							ОбъектОплата.Дата                          = ОбъектПолиса.Дата;
							ОбъектОплата.СтраховойПродукт              = ОбъектПолиса.СтраховойПродукт;
							Если ЗначениеЗаполнено(ОбъектПолиса.СтраховойПродукт) Тогда
								ОбъектОплата.ВидСП                         = ОбъектПолиса.СтраховойПродукт.Вид;
							КонецЕсли;	
							
							
							ОбъектОплата.СК                            = ОбъектПолиса.СК;
							ОбъектОплата.Поставщик                     = ОбъектПолиса.Поставщик;
							ОбъектОплата.НомерВзноса = НомерВзноса;
							//Перенесено выше
							//Если ОплаченоФакт = 0 Тогда
							//	КВ = 0 ;
							//Иначе
							//	КВ = Число(Полис.KV);//;//Полное КВ	
							//КонецЕсли;
							//ОбъектОплата.НеМенятьКВ                    = Истина;
							////КВ = ОбъектОплата.АВилиСкидкаСумма+Число(Полис.KV);//Полное КВ
							//
							//КВПроцент = Окр(?(ОбъектОплата.НачисленнаяСуммаВзноса=0,0,КВ*100/ОбъектОплата.НачисленнаяСуммаВзноса),2);
							////КВПроцент = Цел(10*?(ОбъектОплата.НачисленнаяСуммаВзноса=0,0,КВ*100/ОбъектОплата.НачисленнаяСуммаВзноса))/10;
							////КВОкр = Окр(КВПроцент*ОбъектОплата.НачисленнаяСуммаВзноса/100,2);
							//Изменено = УстановитьЗначение(ОбъектОплата.КВСумма,КВ) или Изменено;
							//ОбъектОплата.КВПроцент                     = КВПроцент;
							//ОбъектОплата.КВСуммаДляАгента              = КВ;
							//ОбъектОплата.КВПроцентДляАгента            = КВПроцент;
							//ОбъектОплата.КВСуммаДляОтчета              = КВ;
							//ОбъектОплата.КВПроцентДляОтчета            = КВПроцент;
							//ОбъектОплата.ДБ                            = ОбъектОплата.КВСумма- ОбъектОплата.АВилиСкидкаСумма;
							//ОбъектОплата.Баланс_Брокер_Поставщик       = ОбъектОплата.НачисленнаяСуммаВзноса- ОбъектОплата.КВСумма;
							
							Если Аннулирован = Ложь и ОбъектОплата.ОплаченоФакт>0 Тогда
							Если ОбъектОплата.Баланс_Брокер_Поставщик<Число(Полис.NetPremium) Тогда
								Если НЕ ОбъектОплата.Ссылка = Документы.уб_ОплатаПолисов.ПустаяСсылка() Тогда
									//Превышение, но уже загружено
									Сообщить("Превышение КВ в загруженной оплате по полису "+Полис.PoliceNumber);
									ОбъектОплата.Баланс_Брокер_Поставщик = 0;
								Иначе
							
									//++error++
									ТекстОшибки = "Превышение КВ %s в отсутствующей оплате и полисе";
									
									СчетчикОшибок = СчетчикОшибок+1;
									
									Ошибка = Новый Структура("msg,num,args",
									ТекстОшибки,
									"2015042004",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
									Полис.PoliceNumber+" "+ОбъектОплата.Баланс_Брокер_Поставщик+"/"+Число(Полис.NetPremium));
									Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
									СтрокаОшибки = ОтветыПолис.Добавить();
									СтрокаОшибки.Error = Ошибка;
									//--error--
									Перейти ~ЗакрытиеПолиса;
									
								КонецЕсли;	
							КонецЕсли;
							КонецЕсли;
							
							ОбъектОплата.Валюта                        = ПараметрыОбмена.Валюта;
							ОбъектОплата.Курс                          = ПараметрыОбмена.Курс;
							ОбъектОплата.ДатаПроведенияБСО             = ОбъектОплата.Дата;
							ОбъектОплата.ЕстьКвитанция                 = Ложь;
							
							ОбъектОплата.Комментарий                   = "Загружено из шлюза. ";
							
							
							ОбъектОплата.СкидкаВыплаченаяКлиенту       = 0;
							
							ОбъектОплата.ФормаОплаты                   = Перечисления.уб_ФормыОплаты.Безнал;
							ОбъектОплата.ОкруглятьКВДо2Знаков          = Истина;
							ОбъектОплата.РазрядностьОкругления         = 2;
							ОбъектОплата.РежимОкругления               = Перечисления.уб_РежимОкругления.Окр15как20;
							ОбъектОплата.НаправлениеПлатежа            = Перечисления.уб_НаправленияПлатежа.ВБрокер;
						КонецЕсли;	
						
						Если ОбъектОплата.Модифицированность() = Истина Тогда
							Попытка
								Если ПараметрыОбмена.РабочийРежим = Истина Тогда
									ОбъектОплата.Записать(РежимЗаписиДокумента.Проведение);
									//ОЧЕРЕДЬ+ 
									Если НеобходимоДобавитьВОчередь(Полис) Тогда
										МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
										МенеджерЗаписи.Объект = ОбъектОплата.Ссылка;
										МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДокументыИзШлюза;
										МенеджерЗаписи.Записать();
									КонецЕсли;
									//ОЧЕРЕДЬ-
								КонецЕсли;
								
							Исключение
								Попытка
									Если ПараметрыОбмена.РабочийРежим = Истина Тогда
										ОбъектОплата.Записать();
										//ОЧЕРЕДЬ+ 
										Если НеобходимоДобавитьВОчередь(Полис) Тогда
											МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
											МенеджерЗаписи.Объект = ОбъектОплата.Ссылка;
											МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДокументыИзШлюза;
											МенеджерЗаписи.Записать();
										КонецЕсли;
										//ОЧЕРЕДЬ-
									КонецЕсли;	
								Исключение
									
									//++error++
									ТекстОшибки = "Ошибка при записи оплаты для полиса ID=%s. Оплата не записана.("+ОписаниеОшибки()+")";
									
									СчетчикОшибок = СчетчикОшибок+1;
									
									Ошибка = Новый Структура("msg,num,args",
									ТекстОшибки,
									"2015042005",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
									Полис.PoliceNumber);
									Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
									СтрокаОшибки = ОтветыПолис.Добавить();
									СтрокаОшибки.Error = Ошибка;
									//--error--
									Перейти ~ЗакрытиеПолиса;
								КонецПопытки;//Запись оплаты
							КонецПопытки;//Проведение оплаты
						КонецЕсли;//Модифицированность оплаты
					КонецЕсли;//Грузим оплату
				КонецЕсли; //Есть полис
				
				//Разбор приемок
				Если ПараметрыОбмена.ЗагружатьПриемки = Истина и не ОбъектОплата =Неопределено  Тогда
					ОтветыПлатежи.Очистить();
					ОбъектПриемка = Неопределено;
					Если Полис.Payments.Количество()>0 Тогда
						
					Иначе
						Перейти ~ЗакрытиеПолиса;
					КонецЕсли;
					
					Если Полис.Payments.Количество()>0 Тогда
						//++XML++
						Запись.ЗаписатьНачалоЭлемента("Payments");
						//--XML--
					КонецЕсли;
					
					КоличествоПРиемок = Полис.Payments.Количество();
					ДатаПриемки =Неопределено;
					Для каждого СтрокаПлатежей из Полис.Payments Цикл
						ОбъектПриемка = Неопределено;
						ПлатежP = СтрокаПлатежей.Значение;
						//	
						//++XML++
						Запись.ЗаписатьНачалоЭлемента("Payment");
						//--XML--
						Если ПлатежP.Свойство("UID1C") Тогда
							UID1CПриемка = ПлатежP.UID1C;
						Иначе
							UID1CПриемка = "TransactionID_"+ПлатежP.TransactionID;
						КонецЕсли;
						
						//1 вариант поиска приемки
						
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ
						|	уб_ПриемкаОплатПолисы.УИДСтроки,
						|	уб_ПриемкаОплатПолисы.Ссылка
						|ИЗ
						|	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
						|ГДЕ
						|	уб_ПриемкаОплатПолисы.УИДСтроки = &УИДСтроки";
						Запрос.УстановитьПараметр("УИДСтроки",UID1CПриемка);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда  
							СсылкаПриемка = Выборка.Ссылка;
							ОбъектПриемка = СсылкаПриемка.ПолучитьОбъект();
							КритическаОшибка = Ложь;
							СтрокаПриемки  = СтрокаПриемки(ОбъектПриемка,UID1CПриемка,ОтветыПлатежи,КритическаОшибка) ;	 
							Если КритическаОшибка = Истина Тогда
								Перейти ~ЗакрытиеПриемки;
							КонецЕсли;	
						Иначе
							////++error++
							//СчетчикОшибок = СчетчикОшибок+1;
							//ТекстОшибки = "Не найдена приемка с UID %s";
							//Ошибка = Новый Структура("msg,num,args",
							//ТекстОшибки,
							//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
							//UID1C);
							//Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
							//СтрокаОшибки = ОтветыПлатежи.Добавить();
							//СтрокаОшибки.Error = Ошибка;
							////--error--
							//Перейти ~ЗакрытиеПриемки;
						КонецЕсли;	  
						
						
						Если ОбъектПриемка = Неопределено и КоличествоПРиемок = 1 Тогда//Когда одна приемка, ищем по номеру полиса
							//2 вариант пописка приемки
							//Ищем по номеру полиса
							Запрос = Новый Запрос;
							Запрос.Текст = "ВЫБРАТЬ
							               |	уб_ПриемкаОплатПолисы.УИДСтроки,
							               |	уб_ПриемкаОплатПолисы.Ссылка
							               |ИЗ
							               |	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
							               |ГДЕ
							               |	уб_ПриемкаОплатПолисы.НомерПолиса = &НомерПолиса";
							Запрос.УстановитьПараметр("НомерПолиса",ДанныеПоБланку.НомерПолиса);
							Выборка = Запрос.Выполнить().Выбрать();
							Если Выборка.Следующий() Тогда  
								СсылкаПриемка = Выборка.Ссылка;
								ОбъектПриемка = СсылкаПриемка.ПолучитьОбъект();
								КритическаОшибка = Ложь;
								СтрокаПриемки  = СтрокаПриемки(ОбъектПриемка,Выборка.УИДСтроки,ОтветыПлатежи,КритическаОшибка) ;	 
								Если КритическаОшибка = Истина Тогда
									Перейти ~ЗакрытиеПриемки;
								КонецЕсли;
								UID1CПриемка = Выборка.УИДСтроки; //Подмена
							КонецЕсли;	
					    КонецЕсли;			
						Если ОбъектПриемка = Неопределено Тогда
							
							Если Число(ПлатежP.Amount)= 0  и  (ПлатежP.Свойство("PaySysFee")=Ложь или Число(ПлатежP.PaySysFee)=0)  Тогда
								Перейти ~ЗакрытиеПриемки;
							КонецЕсли;
							
							ОбъектПриемка = Документы.уб_ПриемкаОплат.СоздатьДокумент();
							ОбъектПриемка.Дата = ТекущаяДата();
							Если ДатаПриемки = ОбъектПриемка.Дата Тогда
								ОбъектПриемка.Дата = ОбъектПриемка.Дата+1;
							КонецЕсли;	
							СтрокаПриемки = ОбъектПриемка.Полисы.Добавить();
							СтрокаПриемки.УИДСтроки = UID1CПриемка;
						Иначе
							//уже есть
							Если ПараметрыОбмена.ПерезаписыватьСуществующиеПриемки = Истина Тогда
								
							Иначе
								//не перезаписываем
								//++XML++
								//Запись.ЗаписатьКонецЭлемента();//Payment;
								//--XML--
								//Продолжить;
								Перейти ~ЗакрытиеПриемки;
							КонецЕсли;	
						КонецЕсли;
						ДатаПриемки = ОбъектПриемка.Дата;//Последняя дата приемки
						
												
						//Строка документа
						СтрокаПриемки.Поставщик                   = ДанныеПоБланку.Поставщик;
						СтрокаПриемки.ОрганизацияАгент            = ДанныеПоБланку.ОрганизацияАгент;
						СтрокаПриемки.СК                          = ДанныеПоБланку.СК;
						СтрокаПриемки.ВидБСО                      = ДанныеПоБланку.ВидБСО;
						СтрокаПриемки.НомерБСО                    = ДанныеПоБланку.НомерБСО;
						СтрокаПриемки.НомерПолиса                 = ДанныеПоБланку.НомерПолиса;
						Если ПлатежP.Свойство("PaySysFee") Тогда
							КомиссияПриемка      = -Число(ПлатежP.PaySysFee);
						Иначе
							КомиссияПриемка      = 0;
						КонецЕсли;	
						
						СтрокаПриемки.Сумма                       = Число(ПлатежP.Amount) - КомиссияПриемка;//?(ПлатежP.Сancellation="0",Число(ПлатежP.Amount),-Число(ПлатежP.Amount))-Комиссия;
						СтрокаПриемки.ОплатаПолисаДляОтчетаАгента = ОбъектОплата.Ссылка;
						
						//СтрокаПлатежа
						
						//Всегда удаляем производные платежи
						Если ОбъектПриемка.Полисы.Количество()=1 Тогда
							//Все платежи относятся к одному полису
							ОбъектПриемка.Платежи.Очистить();
						Иначе
							ДлинаУид = СтрДлина(UID1CПриемка);
							ВсегоПлатежей = ОбъектПриемка.Платежи.Количество();
							Для Счетчик = 1 по ВсегоПлатежей Цикл
								ТекСтрока = ОбъектПриемка.Платежи[ВсегоПлатежей-Счетчик];
								Если Лев(ТекСтрока.УИДСтроки,ДлинаУид)= UID1CПриемка Тогда
									ОбъектПриемка.Платежи.Удалить(ТекСтрока);
								КонецЕсли;
							КонецЦикла;
	
						КонецЕсли;
						
						СтрокаПл = ОбъектПриемка.Платежи.Добавить();
						СтрокаПл.УИДСтроки = UID1CПриемка+"_1";
						
						СтрокаПл.ФормаОплаты                     = Перечисления.уб_ФормыОплаты.Безнал;
						СтрокаПл.Сумма                           = СтрокаПриемки.Сумма;
						СтрокаПл.СуммаВВалюте                    = СтрокаПриемки.Сумма;
						СтрокаПл.Валюта                          = ПараметрыОбмена.Валюта;
						СтрокаПл.Курс                            = ПараметрыОбмена.Курс;
						СтрокаПл.ДатаКурса                       = ОбъектПриемка.Дата;
						СтрокаПл.Кратность                       = 1;
						//СтрокаПл.НомерОбосновывающегоДокумента   = ;
						//СтрокаПл.ДатаОбосновывающегоДокумента    = ;
						СтрокаПл.ОбоснованиеРазницы              = "";
						СтрокаПл.Комментарий                     = "";
						СтрокаПл.ОтсутствуетВОплатах             = Ложь;
						//Убираем пока все
						//Если СтрокаПриемки.Разница<>0 Тогда
						//	СтрокаПл = ОбъектПриемка.Платежи.Добавить();
						//	СтрокаПл.УИДСтроки = UID1CПриемка+"_2";
						//	
						//	СтрокаПл.ФормаОплаты                     = Перечисления.уб_ФормыОплаты.Безнал;
						//	СтрокаПл.Сумма                           = -СтрокаПриемки.Разница;
						//	СтрокаПл.СуммаВВалюте                    = -СтрокаПриемки.Разница;
						//	СтрокаПл.Валюта                          = ПараметрыОбмена.Валюта;
						//	СтрокаПл.Курс                            = ПараметрыОбмена.Курс;
						//	СтрокаПл.ДатаКурса                       = ОбъектПриемка.Дата;
						//	СтрокаПл.Кратность                       = 1;
						//	//СтрокаПл.НомерОбосновывающегоДокумента   = ;
						//	//СтрокаПл.ДатаОбосновывающегоДокумента    = ;
						//	
						//	СтрокаПл.Комментарий                     = "";
						//	Если ПлатежP.FeeBy = "1" Тогда
						//		СтрокаПл.ОтсутствуетВОплатах             = Истина;
						//		СтрокаПл.ОбоснованиеРазницы              = "Эквайринг за счет брокера";
						//	ИначеЕсли ПлатежP.FeeBy = "3" Тогда
						//		СтрокаПл.ОтсутствуетВОплатах             = Истина;
						//		СтрокаПл.ОбоснованиеРазницы              = "Эквайринг за счет клиента";
						//	Иначе
						//		СтрокаПл.ОтсутствуетВОплатах             = Ложь;
						//		СтрокаПл.ОбоснованиеРазницы              = "В скидку";
						//	КонецЕсли;	
						//КонецЕсли;
						
						//Шапка документа
						Если ОбъектПриемка.Полисы.Количество()=1 Тогда
							//Перезаписываем шапку смело
							//иначе возможны корректировки
							Если ПустаяСтрока(ПлатежP.Official) Тогда
								Если ПлатежP.PaymentSystemID ="2" Тогда
									ОбъектПриемка.ПринятоОТ = 	Справочники.Контрагенты.НайтиПоНаименованию("МОНЕТА.РУ");
								ИначеЕсли ПлатежP.PaymentSystemID ="3" Тогда	
									ОбъектПриемка.ПринятоОТ = 	Справочники.Контрагенты.НайтиПоНаименованию("Филиал N 7711 ВТБ 24 (ЗАО)");
								КонецЕсли;	
								//ОбъектПриемка.ПринятоОТ =	Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию(Полис.Site);
							Иначе
								ОбъектПриемка.ПринятоОТ                  = уб_temp.СсылкаСправочникаПоНаименованию("ФизическиеЛица",ПлатежP.Official,Ложь);
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ОбъектПриемка.ПринятоОТ) = Ложь Тогда 
								Если ПлатежP.Свойство("OfficialValue") Тогда
									OfficialID = ПлатежP.OfficialValue;
									ОбъектПриемка.ПринятоОТ = НайтиАгентаПоУИД(OfficialID);
								Иначе
									Сообщить("Отсутствует свойство OfficialID "+ПлатежP.Official);
									ОбъектПриемка.ПринятоОТ = Справочники.ФизическиеЛица.ПустойАгент;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(ОбъектПриемка.ПринятоОТ) = Ложь Тогда 
									//++error++
									ТекстОшибки = "Не найден агент по ID=%s. Приемка не создана.("+ПлатежP.Official+")";
									
									СчетчикОшибок = СчетчикОшибок+1;
									
									Ошибка = Новый Структура("msg,num,args",
									ТекстОшибки,
									"2015042006",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
									ПлатежP.Official);
									Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
									Сообщить(Полис.PoliceNumber);
									СтрокаОшибки = ОтветыПлатежи.Добавить();
									СтрокаОшибки.Error = Ошибка;
									//--error--
									Перейти ~ЗакрытиеПриемки;
									//Продолжить;
								КонецЕсли;
							КонецЕсли;
							ОбъектПриемка.Сумма                           = ОбъектПриемка.Полисы.Итог("Сумма");
							ОбъектПриемка.СуммаВВалюте                    = ОбъектПриемка.Сумма;
							ОбъектПриемка.СуммаПоСтрокам                  = ОбъектПриемка.Сумма;
							//!!Доразбираться в реальных условиях
							ОбъектПриемка.Разница                         = ОбъектПриемка.Полисы.Итог("Разница");
							ОбъектПриемка.ИтогСуммаПлатежи                = ОбъектПриемка.Платежи.Итог("Сумма");
							//ОбъектПриемка.СуммыНеРавны                    = ;
							ОбъектПриемка.Валюта                          = ПараметрыОбмена.Валюта;
							ОбъектПриемка.Курс                            = ПараметрыОбмена.Курс;
							ОбъектПриемка.ДатаКурса                       = ОбъектПриемка.Дата;
							ОбъектПриемка.ОбоснованиеРазницы              = "";
							ОбъектПриемка.Комментарий                     = "Загружено из шлюза";
							//ОбъектПриемка.НеНайденоБСО                    = Ложь;
							//ОбъектПриемка.НетПривязкиКОплате              = ;
							//ОбъектПриемка.НетКвитовкиПоСуммамОплат        = ;
							//ОбъектПриемка._Отвязка_Оплаты_                = ;
							ОбъектПриемка.ФормаОплаты                     = Перечисления.уб_ФормыОплаты.Безнал;
							//ОбъектПриемка.НомерОбосновывающегоДокумента   = ;
							//ОбъектПриемка.ДатаОбосновывающегоДокумента    = ;
							//ОбъектПриемка.ОтчетКассира                    = ;
							//ОбъектПриемка.Подтверждено                    = Ложь;
							//ОбъектПриемка.СозданНаОсновании             = ;
							ОбъектПриемка.ВознаграждениеКурьераКлиентом   = 0;
							//ОбъектПриемка.Заявка                       = ;
							ОбъектПриемка.НетПривязкиКОплате = Ложь;
						КонецЕсли;
						Попытка
							Если ПараметрыОбмена.РабочийРежим = Истина Тогда
								ОбъектПриемка.Записать();
								ОбъектПриемка.ОбменДанными.Загрузка =Ложь;
								
								Попытка
									ОбъектПриемка.Записать(РежимЗаписиДокумента.Проведение);	
								Исключение
									
								КонецПопытки;
								
							КонецЕсли;	
						Исключение
							//++error++
							ТекстОшибки = "При записи приемки. TransactionID = %s";
							
							СчетчикОшибок = СчетчикОшибок+1;
							
							Ошибка = Новый Структура("msg,num,args",
							ТекстОшибки,
							"2015042007",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
							ПлатежP.TransactionID);
							Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
							Сообщить(ОписаниеОшибки());
							Сообщить(ОбъектПриемка);
							Сообщить(Полис.PoliceNumber);
							Сообщить("Количество строк "+ОбъектПриемка.Полисы.Количество());
							Сообщить(ОбъектПриемка.Полисы.Количество());
							
							СтрокаОшибки = ОтветыПлатежи.Добавить();
							СтрокаОшибки.Error = Ошибка;
							//--error--
							Перейти ~ЗакрытиеПриемки;
							
						КонецПопытки;
						
						Если ПараметрыОбмена.РабочийРежим = Истина и ЗначениеЗаполнено(СтрокаПриемки.ОплатаПолисаДляОтчетаАгента) Тогда
							//Два ключевых поля в регистре Оплата и УИДСтроки
							Если СоздатьКвитовку(СтрокаПриемки.ОплатаПолисаДляОтчетаАгента,ОбъектПриемка.Ссылка, СтрокаПриемки.УИДСтроки) = Ложь Тогда
								//++error++
								ТекстОшибки = "Создании квитовки. TransactionID = %s";
								
								СчетчикОшибок = СчетчикОшибок+1;
								
								Ошибка = Новый Структура("msg,num,args",
								ТекстОшибки,
								"2015042008",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
								ПлатежP.TransactionID);
								Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
								СтрокаОшибки = ОтветыПлатежи.Добавить();
								СтрокаОшибки.Error = Ошибка;
								//--error--
								Перейти ~ЗакрытиеПриемки;
							КонецЕсли;
						КонецЕсли;
						
						
						~ЗакрытиеПриемки: 
						//++XML++
						Если ОтветыПлатежи.Количество()>0  Тогда
							Запись.ЗаписатьНачалоЭлемента("Errors");
							Для каждого СтрокаОтвета Из ОтветыПлатежи Цикл
								Запись.ЗаписатьНачалоЭлемента("Error");
								Запись.ЗаписатьАтрибут("num",СтрокаОтвета.Error.num);
								Запись.ЗаписатьАтрибут("msg",СтрокаОтвета.Error.msg);
								Запись.ЗаписатьАтрибут("args",СтрокаОтвета.Error.args);
								Запись.ЗаписатьКонецЭлемента();//Error
							КонецЦикла;
							Запись.ЗаписатьКонецЭлемента();//Error
						КонецЕсли;
						//++XML++
						Если ПараметрыОбмена.ОтправлятьОтветПриемки =Истина Тогда
							
							Если ОтветыПлатежи.Количество() = 0 Тогда
								Запись.ЗаписатьНачалоЭлемента("TransactionID");
								Запись.ЗаписатьТекст(ПлатежP.TransactionID);
								Запись.ЗаписатьКонецЭлемента();
								Запись.ЗаписатьКомментарий("ID платежной операции, служащее для идентификации данных в ответе 1С");
								//
								Запись.ЗаписатьНачалоЭлемента("UID1C");
								Запись.ЗаписатьТекст(UID1CПриемка);
								Запись.ЗаписатьКонецЭлемента();
								Запись.ЗаписатьКомментарий("ID строки приемки сигнализирует, что строка загружена");
							КонецЕсли;
						КонецЕсли;
						Запись.ЗаписатьКонецЭлемента();//Payment
						//--XML--
					КонецЦикла;
					Запись.ЗаписатьКонецЭлемента();//Payments
					//--XML--
				КонецЕсли;
				~ЗакрытиеПолиса: ;
				
				//++XML++
				Если ОтветыПолис.Количество()>0  Тогда
					Запись.ЗаписатьНачалоЭлемента("Errors");
					Для каждого СтрокаОтвета Из ОтветыПолис Цикл
						Запись.ЗаписатьНачалоЭлемента("Error");
						Запись.ЗаписатьАтрибут("num",СтрокаОтвета.Error.num);
						Запись.ЗаписатьАтрибут("msg",СтрокаОтвета.Error.msg);
						Запись.ЗаписатьАтрибут("args",СтрокаОтвета.Error.args);
						Запись.ЗаписатьКонецЭлемента();//Error
					КонецЦикла;
					Запись.ЗаписатьКонецЭлемента();//Error
				КонецЕсли;
				Запись.ЗаписатьКонецЭлемента();
				ЗакрытПолис = Истина;
				//--XML--
				
				//!!ОТЛАДКА
				//Прервать;
				//!!ОТЛАДКА
				КонецЦикла;
				Если ЗакрытПолис = Ложь Тогда
					Запись.ЗаписатьКонецЭлемента();
				КонецЕсли;
			Запись.ЗаписатьКонецЭлемента();//Polices
		Иначе  
			//++error++
			ТекстОшибки = "Неверный формат элемента Polices";
			
			СчетчикОшибок = СчетчикОшибок+1;
			
			Ошибка = Новый Структура("msg,num,args",
			ТекстОшибки,
			"2015042009",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
			"");
			Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
			СтрокаОтвета.Error = Ошибка;
			//--error--
			Сообщить("Неверный тип полисов");
			//Возврат;
		КонецЕсли;	
	Иначе
		Сообщить ("Неверное содержимое нет body или Polices");
		//СообщитьИзФайла()
	КонецЕсли;	
	
	//++XML++
	//Запись глобальные ошибки
	Если Ответ.Количество()>0 Тогда
		
		Запись.ЗаписатьНачалоЭлемента("Errors");
		Для каждого СтрокаОтвета Из Ответ Цикл
			Запись.ЗаписатьНачалоЭлемента("Error");
			Запись.ЗаписатьАтрибут("num",СтрокаОтвета.Error.num);
			Запись.ЗаписатьАтрибут("msg",СтрокаОтвета.Error.msg);
			Запись.ЗаписатьАтрибут("args",СтрокаОтвета.Error.args);
			Запись.ЗаписатьКонецЭлемента();//Error
		КонецЦикла;
	
		Запись.ЗаписатьКонецЭлемента();//Error
		
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();//body
	Запись.ЗаписатьКонецЭлемента();//rq
	Запись.Закрыть();
	
	Если ПараметрыОбмена.ПоказатьОтвет = Истина Тогда
		СообщитьИзФайла(ИмяОтвета," нашего ответа");
	КонецЕсли;	
		
    //--XML--
	Если ПараметрыОбмена.ОтправлятьОтвет = Истина Тогда
		Сервер = "www.sluice";
		//Сервер = "sluice.loc";
		Порт = 80 ;
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		
		ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("xml");
		//ИмяФайла = ИмяОтвета;
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
		
		Ресурс ="";
		Попытка
			HTTP.ОтправитьДляОбработки(ИмяОтвета, Ресурс, ИмяПолученногоФайла, ЗаголовокHTTP);
		Исключение
			Сообщить("Ошибка "+ОписаниеОшибки());
		КонецПопытки;
		СообщитьИзФайла(ИмяПолученногоФайла,"Ответ об уи");
	КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьПараметры() Экспорт 
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("СоздаватьПолисыСНеНайденнымУИД",Истина);
	ПараметрыОбмена.Вставить("Валюта",Константы.ВалютаРегламентированногоУчета.Получить());
	ПараметрыОбмена.Вставить("Курс",1);
	ПараметрыОбмена.Вставить("ПерезаписыватьСуществующиеПриемки",Ложь);
	ПараметрыОбмена.Вставить("ПерезаписыватьСуществующиеПолисы",Ложь);
	ПараметрыОбмена.Вставить("ЗагружатьПриемки",Истина);
	ПараметрыОбмена.Вставить("ОтправлятьОтвет",Истина);
	ПараметрыОбмена.Вставить("ОтправлятьОтветПриемки",Истина);
	ПараметрыОбмена.Вставить("ОграничениеСписков",5000);
	ПараметрыОбмена.Вставить("НомерПолисаОтбор","");
	ПараметрыОбмена.Вставить("ПеречитатьСоШлюза",Истина);
	ПараметрыОбмена.Вставить("ИмяФайла","");
	ПараметрыОбмена.Вставить("ИзФайла",Ложь);
	ПараметрыОбмена.Вставить("ПоказатьОтвет",Ложь);
	ПараметрыОбмена.Вставить("РабочийРежим",Истина);
КонецПроцедуры	


Функция СтрокаПриемки(ОбъектПриемка,UID1C,ОтветыПлатежи,КритическаяОшибка = Ложь)
	
	МассивСтрок = ОбъектПриемка.Полисы.НайтиСтроки(НОвый Структура("УИДСтроки",UID1C));
	Если МассивСтрок.Количество() = 0 Тогда
		//++error++
		СчетчикОшибок = СчетчикОшибок+1;
		ТекстОшибки = "Не найдена строка в приемке с UID %s";
		Ошибка = Новый Структура("msg,num,args",
		ТекстОшибки,
		"2015042010",//Формат(ТекущаяДата(),"ДФ=yyyyMMddhhmmss")+Формат(СчетчикОшибок,"ЧГ="),
		UID1C);
		Сообщить(СтрЗаменить(ТекстОшибки,"%s",Ошибка.args));
		СтрокаОшибки = ОтветыПлатежи.Добавить();
		СтрокаОшибки.Error = Ошибка;
		//--error--
		
		//Перейти ~ЗакрытиеПриемки;
		КритическаяОшибка = Истина;
		СтрокаПриемки = Неопределено;
	Иначе
		СтрокаПриемки = МассивСтрок[0];
	КонецЕсли;
	Возврат СтрокаПриемки;
КонецФункции
						
Функция ПолучитьДанныеПоСтраховке(Параметр)
	
	//Параметр СК,ТипСтрахования,СтраховойПродукт
	Если Параметр.СтраховойПродукт ="Стационар" Тогда
	ИначеЕсли Параметр.СтраховойПродукт = "№4"  Тогда
		//Уралсиб
		Параметр.СтраховойПродукт = "Мигранты";
	ИначеЕсли Параметр.ТипСтрахования = "ВЗР" Тогда
		//РСС
		Параметр.СтраховойПродукт = "ВЗР";
	ИначеЕсли Параметр.СтраховойПродукт = "Стандарт" или Параметр.СтраховойПродукт = "Выгода" или Параметр.СтраховойПродукт = "Экстра" Тогда
		//РСС
		Параметр.СтраховойПродукт = "ДМС44";	
	ИначеЕсли Параметр.СтраховойПродукт ="Мед. помощь" Тогда
		//ВТБ
		Если ЗначениеЗаполнено(Параметр.СК) Тогда
		//Создадим
			уб_temp.СсылкаСправочникаПоНаименованию("уб_СтраховыеПродукты",Параметр.СтраховойПродукт,Истина, Параметр.СК)
		КонецЕсли;	
		//	Параметр.СтраховойПродукт
	Иначе
		Сообщить("Неизвестный продукт "+Параметр.СтраховойПродукт+"/"+Параметр.ТипСтрахования);
	КонецЕсли;	
		
	//Если НЕ Параметр.СтраховойПродукт = "№4" 
	//	 и НЕ Параметр.СтраховойПродукт = "Стационар" Тогда
	//	 Параметр.СтраховойПродукт = "ДМС44";
	//ИначеЕсли Параметр.СтраховойПродукт ="Стационар" Тогда
	//Иначе
	//	Параметр.СтраховойПродукт ="Мигранты";
	//КонецЕсли;
	
	_СтраховойПродукт = уб_temp.СсылкаСправочникаПоНаименованию("уб_СтраховыеПродукты",Параметр.СтраховойПродукт,ЛОЖЬ, Параметр.СК);//Сред(Операция.program,2)//Так правильней, но пока кидаем на один СП
	
	Если _СтраховойПродукт =Неопределено или _СтраховойПродукт.Пустая() Тогда
		_ВидСП  = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка();
		_Риск   = Справочники.уб_СтраховыеРиски.ПустаяСсылка();
	Иначе
		_ВидСП = _СтраховойПродукт.Вид;
		ТипыОбъектовИРиски = _СтраховойПродукт.ТипыОбъектовИРиски;
		Если ТипыОбъектовИРиски.Количество()>0 Тогда
			_Риск = ТипыОбъектовИРиски[0].Риск;
		Иначе
			_Риск = уб_temp.СсылкаСправочникаПоНаименованию("уб_СтраховыеРиски", ""+_ВидСП + " (все риски)",Ложь);
		КонецЕсли;
	КонецЕсли;
	//
	_ОбъектСтрахования = уб_temp.СсылкаСправочникаПоНаименованию("уб_ОбъектыСтрахования", Параметр.СтраховойПродукт,ЛОЖЬ);
	
	Если ЗначениеЗаполнено(_ОбъектСтрахования) = Ложь Тогда
		_ОбъектСтрахования = уб_temp.СсылкаСправочникаПоНаименованию("уб_ОбъектыСтрахования", "ДМС44",ЛОЖЬ);
	КонецЕсли;	
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("СтраховойПродукт",_СтраховойПродукт);
	СтруктураРезультат.Вставить("СтраховойПродуктСтрока",Параметр.СтраховойПродукт);
	СтруктураРезультат.Вставить("ВидСП",_ВидСП);
	СтруктураРезультат.Вставить("Риск",_Риск);
	СтруктураРезультат.Вставить("ОбъектСтрахования",_ОбъектСтрахования);
	СтруктураРезультат.Вставить("Организация",Параметр.Организация);//
	Возврат СтруктураРезультат;
	
КонецФункции

Функция НайтиСтраховуюКомпанию(Наименование,ИНН=Неопределено)
	Если Наименование = "In-touch" Тогда
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Интач",Ложь);
	ИначеЕсли Наименование = "Русский Стандарт" Тогда	
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт",Ложь);
	ИначеЕсли Наименование = "ЗАО Русский Стандарт Страхование" Тогда	
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт",Ложь);	
	ИначеЕсли Наименование = "УралСиб" Тогда	
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","УралСиб",Ложь);
	ИначеЕсли Наименование = "КупиПолис" Тогда	
		_СК  = СПравочники.Контрагенты.ПустаяСК;
	Иначе
		Если ЗначениеЗаполнено(ИНН) Тогда
			Запрос = Новый Запрос ;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
			               |	Контрагенты.Ссылка
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	Контрагенты.ИНН = &ИНН";
			Запрос.УстановитьПараметр("ИНН",ИНН);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				_СК =Выборка.Ссылка;
			Иначе
				_СК  = СПравочники.Контрагенты.ПустаяСК;
			КонецЕсли;
		Иначе
			_СК  = СПравочники.Контрагенты.ПустаяСК;	
		КонецЕсли;
		Если _СК  = СПравочники.Контрагенты.ПустаяСК Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не известная СК в загрузке с сайта "+Наименование;
			Сообщение.Сообщить();
			_СК  = СПравочники.Контрагенты.ПустаяСК;
		КонецЕсли;
			
		
	КонецЕсли;
	Возврат _СК;
КонецФункции

Функция ДанныеПоБланку(НомерПолиса,СтраховаяКомпания,СтраховойПродукт,Организация)
	
	КодОргПоУмолчанию = "000000016";
	ЕСли ЗначениеЗаполнено(Организация) = Ложь Тогда
		Организация = Справочники.Организации.НайтиПоКоду(КодОргПоУмолчанию); 
	Иначе
		Если ТипЗнч(Организация)= Тип("Строка") Тогда
			ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("ИНН",Организация); 
			Если ОрганизацияСсылка.Пустая() Тогда
				Организация = Справочники.Организации.НайтиПоКоду(КодОргПоУмолчанию); 
			Иначе
				Организация = ОрганизацияСсылка; 	
			КонецЕсли;
		ИначеЕсли ТипЗнч(Организация)= Тип("СправочникСсылка.Организации") Тогда	
		Иначе	
			Организация = Справочники.Организации.НайтиПоКоду(КодОргПоУмолчанию); 
		КонецЕсли;	
	КонецЕсли;	
	//Если ФормаОплаты = Неопределено Тогда //От формы оплаты зависит организация
	//	ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал;
	//КонецЕсли;
	//_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт");
	//_Поставщик = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Компания Банковского Страхования");
	
	НомерБСО                    = СтрЗаменить(СтрЗаменить(НомерПолиса,"TRS № ","")," ","");	
	НомерБСО                    = СтрЗаменить(НомерБСО,"№","");	
	Если СокрЛП(СтраховойПродукт) = "ДМС44"	Тогда
		НомерПолиса = НомерБСО;
		_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО,СК",
		СтраховаяКомпания,
		//Справочники.Организации.НайтиПоКоду("000000012"),//СБ
		Организация,  //Новый 
		НомерПолиса,
		Справочники.уб_ВидыБСО.НайтиПоНаименованию("ДМС44",Истина,,СтраховаяКомпания),
		СтраховаяКомпания);

	ИначеЕсли СокрЛП(СтраховойПродукт) = "Мигранты" или СокрЛП(СтраховойПродукт) = "Стационар" Тогда
		НомерПолиса = НомерБСО;
		_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО,СК",
		СтраховаяКомпания,
		//Справочники.Организации.НайтиПоКоду("000000012"),//СБ
		Организация,  //Новый 
		НомерПолиса,
		Справочники.уб_ВидыБСО.НайтиПоНаименованию("Мигранты",Истина,,СтраховаяКомпания),
		СтраховаяКомпания);
	ИначеЕсли СокрЛП(СтраховойПродукт) = "№4"	Тогда
		НомерПолиса = НомерБСО;
		_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО,СК",
		СтраховаяКомпания,
		//Справочники.Организации.НайтиПоКоду("000000012"),//СБ
		Организация,  //Новый 
		НомерПолиса,
		Справочники.уб_ВидыБСО.НайтиПоНаименованию("Мигранты",Истина,,СтраховаяКомпания),
		СтраховаяКомпания);	
	//ИначеЕсли СокрЛП(СтраховойПродукт) ="ВЗР" Тогда	
		
	Иначе
	//Поиск по номерным
		_СтруктураБСО = ПолучитьДанныеБСОПоНомеруИСК(НомерБСО,СтраховаяКомпания);	
	КонецЕсли;
	_СтруктураБСО.Вставить("НомерБСО",НомерБСО);
	Возврат _СтруктураБСО;
КонецФункции	

Функция СоздатьКвитовку(ОплатаСсылка,Приемка, УИДСтрокиТЧ)
	
	НачатьТранзакцию();
	Результат =  уб_СС.ДобавитьКвитовкуОплат(УИДСтрокиТЧ, Приемка, ОплатаСсылка, Неопределено);	
	Если Результат Тогда
		ЗафиксироватьТранзакцию();
		//УстановитьФлагКвитовки();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;	
	Возврат Результат
	
КонецФункции	

Функция НайтиАгентаПоУИД(КодCRM)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.КодCRM,
	               |	ФизическиеЛица.Ссылка
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.КодCRM = &КодCRM";
	Запрос.УстановитьПараметр("КодCRM",КодCRM);			   
	Выборка = Запрос.выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка
	Иначе
		Возврат  Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция Чтение(Чтение,Знач ИмяОкончанияРекурсии="",Знач ОжидаемоеИмя ="",Знач Родитель ="",ОбъектРодитель = Неопределено)
	
	
	//Узлы с вложениями
	СложныеУзлы = "Insured,Insurer,Person,Identification,Legal,AdditionalFields,Payments,Payment,Address,body,Polices,Police,Field,";
	//Узлы с повторяющимися именами
	Списки = "Payments,Polices,AdditionalFields,";
	
	//ОтладочныйРежим = Истина;
	ТребуетсяЧтение = Истина;
	
	ТипУзлаXMLНачалоЭлемента = ТипУзлаXML.НачалоЭлемента;
	ТипУзлаXMLТекст = ТипУзлаXML.Текст;
	ТипУзлаXMLКонецЭлемента = ТипУзлаXML.КонецЭлемента;
	ТипУзлаXMLНичего = ТипУзлаXML.Ничего;
	ТипУзлаXMLАтрибут = ТипУзлаXML.Атрибут;
	
	Пока Истина Цикл
		Если ТребуетсяЧтение = Ложь Тогда
		Иначе
			Попытка
				Прочитано = Чтение.Прочитать();
				Если НЕ Прочитано = Истина ТОгда
					Прервать;
				КонецЕсли;	
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат ?(ОбъектРодитель= Неопределено,Новый Структура,ОбъектРодитель);
			КонецПопытки;	
		КонецЕсли;	
		ТребуетсяЧтение = Истина;
		ЛокальноеИмя = ""+Чтение.ЛокальноеИмя;
		Если Чтение.ТипУзла = ТипУзлаXMLНачалоЭлемента Тогда
			
			ЭтоСписок  = Найти(Списки,ЛокальноеИмя+",")>0;
			ЭтоСложный = Найти(СложныеУзлы,ЛокальноеИмя+",") > 0;
			
			Если ЭтоСложный Тогда
				
				ОбъектРезультат = Неопределено;
				Если ЭтоСписок Тогда
					ОбъектРезультат = Новый ТаблицаЗначений;
					ОбъектРезультат.Колонки.Добавить("Ключ");
					ОбъектРезультат.Колонки.Добавить("Значение");
				Иначе	
					ОбъектРезультат = Новый Структура();
				КонецЕсли;
				
				ЭтоТЗ =  ТипЗнч(ОбъектРодитель) = Тип("ТаблицаЗначений");
				//Если ЭтоТЗ  и ОбъектРодитель.Количество() >ОграничениеСписков Тогда //Надо пропускать разобраться по мере возможности
				//Иначе
					ОбъектВлож = Чтение(Чтение,""+ЛокальноеИмя,"--ЗАГРУЗКА--",""+ЛокальноеИмя,ОбъектРезультат);//!!!Рекурсия
				//КонецЕсли;
			
				
				//<!--
				Если флОтладка  = Истина Тогда
					Сообщить(ЛокальноеИмя+"="+ОбъектВлож);
				КонецЕсли;
				//-->
				
				Если  ОбъектРодитель = Неопределено Тогда
					ОбъектРодитель = Новый Структура;//Подумать: есть другие варианты что это не структура, и не сработает, скорее всего да 
				КонецЕсли;	
				Если ЭтоТЗ Тогда
					//Если ОбъектРодитель.Количество() <=ОграничениеСписков Тогда //!!!! не грузим больше 50, теперь фильтруем после загрузки
						СтрокаСписка = ОбъектРодитель.Добавить();
						СтрокаСписка.Ключ     = ЛокальноеИмя; 
						СтрокаСписка.Значение = ОбъектВлож;
					//КонецЕсли;
				
				Иначе	
					ОбъектРодитель.Вставить(ЛокальноеИмя,ОбъектВлож);
				КонецЕсли;
				
			Иначе
				ВсегоАтрибутов = Чтение.КоличествоАтрибутов();
				ВставленоЗначение = Ложь;
				Если НЕ ТипЗнч(ОбъектРодитель) = Тип("ТаблицаЗначений") Тогда
					Для СчетчикАтр = 0 по ВсегоАтрибутов-1 Цикл
						ИмяАтрибута      = Чтение.ЛокальноеИмяАтрибута(СчетчикАтр);
						ЗначениеАтрибута = Чтение.ПолучитьАтрибут(СчетчикАтр);
						Если ИмяАтрибута ="t" Тогда
							ОбъектРодитель.Вставить(ЛокальноеИмя,ЗначениеАтрибута);
							//<!--
							Если флОтладка  = Истина Тогда
								Сообщить(ЛокальноеИмя+"="+ЗначениеАтрибута);
							КонецЕсли;
							ВставленоЗначение = Истина;
						Иначе
							//<!--
							Если флОтладка  = Истина Тогда
								Сообщить(ЛокальноеИмя+ИмяАтрибута+"="+ЗначениеАтрибута);
							КонецЕсли;
							//-->
							ОбъектРодитель.Вставить(ЛокальноеИмя+ИмяАтрибута,ЗначениеАтрибута);
						КонецЕсли;	
					КонецЦикла;
				Иначе
				//Не куда записывать свойства таблицы
				//<!--
					Если флОтладка  = Истина Тогда
					КонецЕсли;	
				//-->
 				КонецЕсли;	
				Прочитано = Чтение.Прочитать();
				Если Прочитано = Ложь Тогда 
					Прервать;//Врядли возможно
				ИначеЕсли Чтение.ТипУзла = ТипУзлаXMLТекст Тогда
					//
					Если НЕ ТипЗнч(ОбъектРодитель) = Тип("ТаблицаЗначений") Тогда
						Если Чтение.ИмеетЗначение = Истина Тогда
							Если ВставленоЗначение = Ложь Тогда
								//<!--
								Если флОтладка  = Истина Тогда
									Сообщить(ЛокальноеИмя+"="+Чтение.Значение);
								КонецЕсли;	
								//-->
								ОбъектРодитель.Вставить(ЛокальноеИмя,Чтение.Значение);
							Иначе	
								//<!--
								//Если флОтладка  = Истина Тогда
									//Сообщить("!"+ЛокальноеИмя+"="+Чтение.Значение);
									ОбъектРодитель.Вставить(ЛокальноеИмя+"Value",Чтение.Значение);
								//КонецЕсли;
								//-->
							КонецЕсли;	
							
						КонецЕсли;	
					Иначе
						//!!!!
						//<!--
						Если флОтладка  = Истина Тогда
						КонецЕсли;	
						//-->
					КонецЕсли;	
				Иначе
					ТребуетсяЧтение = Ложь;//уже прочитано
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXMLКонецЭлемента Тогда	
			Если ЛокальноеИмя = ИмяОкончанияРекурсии Тогда
				Возврат ОбъектРодитель;
			КонецЕсли;	
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXMLТекст Тогда		
		ИначеЕсли Чтение.ТипУзла =ТипУзлаXMLНичего Тогда	
			
		Иначе
			Сообщить("!"+"Тип узла:"+Чтение.ТипУзла);
		КонецЕсли;
		
	КонецЦикла;
	Возврат ОбъектРодитель;
КонецФункции	

Функция СообщитьИзФайла(ИмяФ,Заголовок="",Кодировка="")
	Если Кодировка  = "" Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;	
	Если Заголовок="" Тогда
	Иначе
		Сообщить("Чтение "+Заголовок);
	КонецЕсли;	
	Текст = Новый ТекстовыйДокумент;
	Попытка
		Текст.Прочитать(ИмяФ,Кодировка);
	Исключение
		Сообщить("Ошибка при чтении файла "+ИмяФ+" "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;	
	
	Сообщить(Текст.ПолучитьТекст());
	Возврат Истина;
КонецФункции

Процедура ОсновныеДействияФормыИзБазы(Кнопка)
	
	//Пока Выборка.Следующий() Цикл
	//	ОбъектПриемки = Истина;
	//	Приемка = НайтиПриемку (Выборка,ОбъектПриемки);
	//	ОбъектПриемки ="" 
	//КонецЦикла;
	
КонецПроцедуры

Функция СоздатьФизлицо(Персона,ПрежнееФизлицо)
	//Физлицо
	
	
		
	ФИО = Персона.LastName+" "+?(Персона.Свойство("FirstName"),Персона.FirstName+" ","")+?(Персона.Свойство("MiddleName"),Персона.MiddleName,"");
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Фамилия",Персона.LastName);
	СтруктураЗаполнения.Вставить("Имя",?(Персона.Свойство("FirstName"),Персона.FirstName,""));
	
	Персона.Вставить("Отчество",?(Персона.Свойство("MiddleName"),Персона.MiddleName,""));
		
	СтруктураЗаполнения.Вставить("ДатаРождения",?(Персона.Свойство("BirthDate"),ДатаИзСтроки(Персона.BirthDate),Дата(1,1,1)));
	
	СтруктураЗаполнения.Вставить("Телефон",?(Персона.Свойство("Phone"),Персона.Phone,""));
	СтруктураЗаполнения.Вставить("Пол",?(Персона.Свойство("Gender")=Ложь или Персона.Gender="М",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский));
	естьИзменения = Ложь;
	Если ЗначениеЗаполнено(ПрежнееФизлицо) = Ложь Тогда
		Физлицо           = уб_temp.СсылкаСправочникаПоНаименованию("ФизическиеЛица",ФИО,Истина,,СтруктураЗаполнения);
	Иначе
		Физлицо       = ПрежнееФизлицо; 
		ОбъектФизлицо = ПрежнееФизлицо.ПолучитьОбъект();
		УстановитьЗначение(ОбъектФизлицо.Наименование,ФИО);
		УстановитьЗначение(ОбъектФизлицо.ДатаРождения,СтруктураЗаполнения.ДатаРождения);
		УстановитьЗначение(ОбъектФизлицо.Пол,СтруктураЗаполнения.Пол);
		Если ОбъектФизлицо.Модифицированность() = Истина Тогда
			естьИзменения = Истина;
			ОбъектФизлицо.Записать();
		КонецЕсли;
	КонецЕсли;
	//Гражданство
	Если Персона.Свойство("Citizenship") = Истина и ПустаяСтрока(Персона.Citizenship) = Ложь  и Физлицо.Пустая() = Ложь Тогда
		Страна = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(Персона.Citizenship);
		Если Страна.Пустая() =Ложь Тогда
			Запрос  = Новый Запрос("ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.Период,
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
			|	ГражданствоФизЛицСрезПоследних.Страна,
			|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию,
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних");
			Запрос.УстановитьПараметр("Физлицо",Физлицо);
			ВыборкаГр = Запрос.Выполнить().выбрать();
			Грузим = Ложь;
			Если ВыборкаГр.Следующий()  Тогда
				Если ВыборкаГр.Страна <> Страна Тогда
					Грузим =Истина;
				КонецЕсли;			
			Иначе
				Грузим = Истина;	
			КонецЕсли;
			Если Грузим = Истина Тогда
				
				МзГр  = РегистрыСведений.ГражданствоФизЛиц.СоздатьМенеджерЗаписи();
				МзГр.Период = НачалоДня(ТекущаяДата());
				МзГр.ФизЛицо = Физлицо;
				МзГр.Страна = Страна;
				МзГр.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	//Паспортные данные
	Если Персона.Свойство("Identification") = Истина и Физлицо.Пустая() = Ложь Тогда
		
		Если Персона.Identification.Свойство("IDTypeValue")и не ПустаяСтрока(Персона.Identification.IDTypeValue) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
		Запрос.УстановитьПараметр("ФизЛицо",);			   
		
		ВыборкаПаспорт = Запрос.Выполнить().Выбрать();
		Если ВыборкаПаспорт.Следующий() Тогда
		Иначе
			МЗ = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
			МЗ.ФизЛицо = Физлицо; 
			МЗ.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность["ИМНС"+Персона.Identification.IDTypeValue];
			
			Если Персона.Identification.Свойство("IDDate") Тогда
				МЗ.ДокументДатаВыдачи = ДатаИзСтроки(Персона.Identification.IDDate);
			КонецЕсли;	
			Если Персона.Identification.Свойство("IssuingAgency") Тогда
				МЗ.ДокументКемВыдан = Персона.Identification.IssuingAgency;
			КонецЕсли;	
			Identification = 0;
			Если Персона.Identification.Свойство("IDNum") Тогда
				МЗ.ДокументНомер  = Персона.Identification.IDNum;
				Identification = Identification+1;
			КонецЕсли;	
			Если Персона.Identification.Свойство("IDSeries") Тогда
				МЗ.ДокументСерия  = Персона.Identification.IDSeries;
				Identification = Identification+1;
			КонецЕсли;
			
			МЗ.Период = НачалоГода(ТекущаяДата());
			Если Identification < 1 Тогда
				Сообщить(""+ФизЛицо+"Мало данных для записи паспортных данных");
			Иначе
				МЗ.Записать();
			КонецЕсли;	
		КонецЕсли;	
		Иначе
			Сообщить(""+Физлицо+" отсутствует код вида документа удостоверяющего личность");
		КонецЕсли;	
	КонецЕсли;
	
	//ФИО
	Если Физлицо.Пустая() = Ложь  Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ФИО_Физлиц.Период,
		|	ФИО_Физлиц.ФизЛицо,
		|	ФИО_Физлиц.Фамилия,
		|	ФИО_Физлиц.Имя,
		|	ФИО_Физлиц.Отчество
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИО_Физлиц";
		Запрос.УстановитьПараметр("ФизЛицо",Физлицо);			   
		ВыборкаФИО = Запрос.Выполнить().Выбрать();
		Если ВыборкаФИО.Следующий() и естьИзменения = Ложь Тогда
		Иначе
			МЗ = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
			МЗ.ФизЛицо = Физлицо; 
			//Сообщить(МЗ.ФизЛицо);
			Если Персона.Свойство("LastName") Тогда
				МЗ.Фамилия = Персона.LastName;
			КонецЕсли;	
			Если Персона.Свойство("FirstName") Тогда
				МЗ.Имя = Персона.FirstName;
			КонецЕсли;	
			Если Персона.Свойство("MiddleName") Тогда
				МЗ.Отчество = Персона.MiddleName;
			КонецЕсли;	
			МЗ.Период = НачалоГода(ТекущаяДата());
			МЗ.Записать();
		КонецЕсли;	
	КонецЕсли;
	
	//Адрес
	Если Персона.Свойство("Address") и ЗначениеЗаполнено(Физлицо) = Истина Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.УИД,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Комментарий,
		|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
		|	КонтактнаяИнформация.ПользовательЛичногоКонтакта
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Вид = Значение(Справочник.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке)";
		Запрос.УстановитьПараметр("Объект",Физлицо);
		
		ВыборкаАдр = Запрос.Выполнить().Выбрать();
		Если ВыборкаАдр.Следующий()=Ложь или ИСТИНА //ВыборкаАдр.Представление<>Персона.Address.AddressLine 
			Тогда
			//Сообщить(ОбъектПолиса.Страхователь);
			Address = Персона.Address;
			Если Address.Свойство("AddressLine") = Истина Тогда
				МЗ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				МЗ.Объект = Физлицо;
				МЗ.Тип    = Перечисления.ТипыКонтактнойИнформации.Адрес;
				МЗ.Вид    = Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке;
				
				
				//МЗ.Представление =Address.AddressLine; 
				МЗ.УИД = ?(ВыборкаАдр.Количество()=0,0,ВыборкаАдр.УИД);
				
				Если Address.Свойство("ZIP") Тогда
					МЗ.Поле1  = Address.ZIP; //Индекс
				КонецЕсли;
				Если Address.Свойство("Region") Тогда
					МЗ.Поле2  = Address.Region;//Регион
				КонецЕсли;	
				Если Address.Свойство("Area") Тогда
					МЗ.Поле3  = Address.Area;//Район
				КонецЕсли;	
				Если Address.Свойство("City") Тогда
					МЗ.Поле4  = Address.City; //Город
					Если МЗ.Поле4="Москва" Тогда//Идет как регион
						МЗ.Поле4 = "";
						МЗ.Поле2 = "Москва";
					КонецЕсли;
				КонецЕсли;	
				Если Address.Свойство("Settlement") Тогда
					МЗ.Поле5  = Address.Settlement; //Населенный пункт
				КонецЕсли;	
				Если Address.Свойство("Street") Тогда
					МЗ.Поле6  = Address.Street;
				КонецЕсли;	
				Если Address.Свойство("House") Тогда
					МЗ.Поле7  = Address.House;
				КонецЕсли;	
				Если Address.Свойство("Block") Тогда
					МЗ.Поле8  = Address.Block;
				КонецЕсли;	
				Если Address.Свойство("Flat") Тогда
					МЗ.Поле9  = Address.Flat;
				КонецЕсли;	
				//Если Address.Свойство("") Тогда
				//	МЗ.Поле10  = Address.;
				//КонецЕсли;	
				МЗ.Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(МЗ);
				мз.Записать();
				//Прервать;
			Иначе
				
				//Сообщить("AddressLine "+ОбъектПолиса.Страхователь);
				
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;		
	Возврат Физлицо
КонецФункции	
//мДОМ=новый ПостроительDOM;
	
	//чтение=Новый ЧтениеXML ;
	//чтение.ОткрытьФайл(сокрЛП(ИмяФайла));
	// мДокументДОМ=мДОМ.Прочитать(чтение);
	//мРазыменовательПИ=мДокументДОМ.СоздатьРазыменовательПИ(мДокументДОМ);
	//мЗапрос="./*";
	//мХПуть2=мДокументДОМ.СоздатьВыражениеXPath(мЗапрос,мРазыменовательПИ);
	//мДанные= новый Структура;
	//мРезультатЗапроса=мХПуть2.Вычислить(мДокументДОМ);
	//мОбход=мРезультатЗапроса.ПолучитьСледующий();
	//пока мОбход <>неопределено цикл 
	//	мДанные.Вставить(мОбход.ИмяЭлемента,мОбход.ТекстовоеСодержимое);
	//	мОбход=мРезультатЗапроса.ПолучитьСледующий();
	//конеццикла;
	//чтение.Закрыть();
	//Возврат;
	
Функция ПреобразоватьНОмерПолиса(_НомерПолиса)
	НомерПолиса = СтрЗаменить(СтрЗаменить(_НомерПолиса,"№","")," ","");
	НомерПолиса = СтрЗаменить(НомерПолиса,"TRS","");//--Временно
	Возврат НомерПолиса;
КонецФункции
	


Функция НайтиПриемку (СтрокаДанных,ОбъектПриемки = Ложь,НеОбрезатьУИД36) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст  = "ВЫБРАТЬ
	|	уб_ПриемкаОплатПолисы.Ссылка
	|ИЗ
	|	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	|ГДЕ
	|	уб_ПриемкаОплатПолисы.УИДСтроки = &УИДСтроки";
	Запрос.УстановитьПараметр("УИДСтроки",""+?(НеОбрезатьУИД36=Истина,СтрокаДанных.PayId,Лев(СтрокаДанных.PayId,36)));
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Приемка =  Выборка.Ссылка;
		Если ОбъектПриемки = Истина Тогда
			ОбъектПриемки = Приемка.ПолучитьОбъект();
			ОбъектПриемки.ДополнительныеСвойства.Вставить("НеДвигатьСтатусы");
		КонецЕсли;	
	Иначе
		//Поиск приемки по сумме и дате
		Запрос.Текст  = "ВЫБРАТЬ
		|	уб_ПриемкаОплатПолисы.НомерБСО,
		|	уб_ПриемкаОплатПолисы.НомерПолиса,
		|	уб_ПриемкаОплатПолисы.Сумма,
		|	уб_ПриемкаОплатПолисы.Ссылка.Дата КАК Дата,
		|	уб_ПриемкаОплатПолисы.Ссылка,
		|	уб_ПриемкаОплатПолисы.УИДСтроки
		|ИЗ
		|	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
		|ГДЕ
		|	уб_ПриемкаОплатПолисы.НомерБСО = &НомерБСО
		|	И уб_ПриемкаОплатПолисы.Сумма = &Сумма
		|	И уб_ПриемкаОплатПолисы.ВидБСО = &ВидБСО
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		Запрос.УстановитьПараметр("НомерБСО",СтрокаДанных.НомерБСО); //009260515 
		Запрос.УстановитьПараметр("ВидБСО",СтрокаДанных.ВидБСО); //
		Запрос.УстановитьПараметр("Сумма",Окр(СтрокаДанных.СуммаПлатежа+СтрокаДанных.Комиссия,2)); //477.72
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Приемка =  Выборка.Ссылка;
			Если ОбъектПриемки = Истина Тогда
				ОбъектПриемки = Приемка.ПолучитьОбъект();
			КонецЕсли;	
			//Подмена УИД
			СтрокаПриемки = ОбъектПриемки.Полисы.Найти(Выборка.УИДСтроки);
			СтрокаПриемки.УИДСтроки = СтрокаДанных.PayId;
		Иначе
			//Создание
			Приемка = Документы.уб_ПриемкаОплат.ПустаяСсылка();	
			Если ОбъектПриемки = Истина Тогда
				
				ОбъектПриемки = Документы.уб_ПриемкаОплат.СоздатьДокумент();
				Попытка
					ОбъектПриемки.ПринятоОТ = Подмена(СтрокаДанных.Эквайер);
				Исключение
					ОбъектПриемки.ПринятоОТ = Справочники.Контрагенты.НайтиПоНаименованию("МОНЕТА.РУ");
				КонецПопытки;	
				ОбъектПриемки.Дата = ТекущаяДата();
				ОбъектПриемки.УстановитьСсылкуНового(Документы.уб_ПриемкаОплат.ПолучитьСсылку());
				ОбъектПриемки.Валюта             = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
				ОбъектПриемки.Курс               = 1;
				ОбъектПриемки.ФормаОплаты        = Перечисления.уб_ФормыОплаты.Безнал;
				ОбъектПриемки.ДатаКурса          = ОбъектПриемки.Дата;
				ОбъектПриемки.ДополнительныеСвойства.Вставить("НеДвигатьСтатусы");
				Попытка
					ОбъектПриемки.Комментарий =СтрокаДанных.Фио; 
				Исключение
				КонецПопытки;
				//
				//Сообщить("--------------------");
				//Сообщить(СтрокаДанных.НомерБСО);
				//Сообщить(СтрокаДанных.ДатаОплаты);
				//Сообщить(СтрокаДанных.СуммаПлатежа+СтрокаДанных.Комиссия);
			КонецЕсли;	
		КонецЕсли;	
		
		
	КонецЕсли;
	
	
	Возврат Приемка;
КонецФункции	

Функция ДанныеПоБланкуВПриемке(Операция) Экспорт
	//_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт");
	//_Поставщик = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Компания Банковского Страхования");
	Если Операция.СтраховаяКомпания = "In-touch" Тогда
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Интач",Ложь);
	ИначеЕсли Операция.СтраховаяКомпания = "Русский Стандарт" Тогда	
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","Русский Стандарт",Ложь);
	ИначеЕсли Операция.СтраховаяКомпания = "УралСиб" Тогда	
		_СК = уб_temp.СсылкаСправочникаПоНаименованию("Контрагенты","УралСиб",Ложь);
	ИначеЕсли Операция.СтраховаяКомпания = "КупиПолис" Тогда	
		_СК  = СПравочники.Контрагенты.ПустаяСК;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не известная СК в загрузке с сайта "+Операция.СтраховаяКомпания;
		Сообщение.Сообщить();
		_СК  = СПравочники.Контрагенты.ПустаяСК;
	КонецЕсли;
	Операция.СК = _СК;
	Операция.НомерБСО                    = СтрЗаменить(СтрЗаменить(Операция.НомерПолиса,"TRS № ","")," ","");	
	Операция.НомерБСО                    = СтрЗаменить(Операция.НомерБСО,"№","");	
	Если Операция.СтраховойПродукт = 	"ДМС44"	Тогда
		Операция.НомерПолиса = Операция.НомерБСО;
		_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО",
		Операция.СК,
		//Справочники.Организации.НайтиПоКоду("000000012"),//СБ
		Справочники.Организации.НайтиПоКоду("000000013"),  //Новый 
		
		Операция.НомерПолиса,
		Справочники.уб_ВидыБСО.НайтиПоНаименованию("ДМС44",Истина,,Операция.СК));
	ИначеЕсли Операция.СтраховойПродукт = 	"Мигранты"	Тогда
		Операция.НомерПолиса = Операция.НомерБСО;
		_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО",
		Операция.СК,
		//Справочники.Организации.НайтиПоКоду("000000012"),//СБ
		Справочники.Организации.НайтиПоКоду("000000013"),  //Новый 
		Операция.НомерПолиса,
		Справочники.уб_ВидыБСО.НайтиПоНаименованию("Мигранты",Истина,,Операция.СК));
	Иначе
		_СтруктураБСО = ПолучитьДанныеБСОПоНомеруИСК(Операция.НомерБСО,_СК);	
		Операция.СК  = _СтруктураБСО.СК;
	КонецЕсли;
	
	
	
	Операция.ВидБСО                      = _СтруктураБСО.ВидБСО;//ПолучитьБСОПоНаименованию ("Бланк полиса ВЗР",СК);
	Операция.ОрганизацияАгент            = _СтруктураБСО.ОрганизацияАгент;
	Операция.ОрганизацияАгентКвитанции   = Операция.ОрганизацияАгент;//Совпадает
	Операция.Поставщик                   = _СтруктураБСО.Поставщик;
	Операция.ПоставщикКвитанции          = _СтруктураБСО.Поставщик;
	
	Возврат Истина 
КонецФункции	

Функция ПолучитьДанныеБСОПоНомеруИСК (НомерБСО,СК,ГодПолиса = Неопределено) экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДБ.Период КАК Период,
	|	ДБ.Регистратор,
	|	ДБ.НомерСтроки,
	|	ДБ.Активность,
	|	ДБ.ВидБСО,
	|	ДБ.НомерБСО,
	|	ДБ.Подтверждено,
	|	ДБ.Активность КАК Активность,
	|	ДБ.СК,
	|	ДБ.Поставщик,
	|	ДБ.ОрганизацияАгент,
	|	ДБ.АгентОтправитель,
	|	ДБ.Агент,
	|	ДБ.ПоложениеБСО,
	|	ДБ.СостояниеБСО,
	|	ДБ.НомерПолиса,
	|	ДБ.ГодПолиса,
	|	ДБ.СтраховойПолис,
	|	ДБ.НаОснованииБумажногоДокумента,
	|	ДБ.ДатаВозврата,
	|	ДБ.Заявка,
	|	ДБ.КодОперации,
	|	ДБ.Комментарий
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК ДБ
	|ГДЕ
	|	(ДБ.НомерБСО = &НомерБСО или ДБ.НомерБСО = &НомерБСО2 или ДБ.НомерБСО = &НомерБСО3)
	//|	И ДБ.СК = &СК
	|	И ДБ.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ, Выбор когда ДБ.СК = &СК тогда 1 иначе 0 конец");
	Запрос.УстановитьПараметр("НомерБСО",	НомерБСО);						  
	Запрос.УстановитьПараметр("НомерБСО2",	СтрЗаменить(НомерБСО,"-","/"));						  
	Запрос.УстановитьПараметр("НомерБСО3",	"ССС"+НомерБСО);						  
	Запрос.УстановитьПараметр("СК",			СК);						  
	//Поставил в первом Пустую ссылку, чтобы не забывали править поставщика у печатных, понаблюдать
	_СтруктураБСО = Новый Структура("Поставщик,ОрганизацияАгент,НомерПолиса,ВидБСО,СК", Справочники.Контрагенты.ПустаяСсылка(), Справочники.Организации.НайтиПоКоду("000000001"), НомерБСО, Справочники.уб_ВидыБСО.ПустаяСсылка(),Справочники.Контрагенты.ПустаяСК);
	Выборка = Запрос.Выполнить().Выбрать();					  
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(_СтруктураБСО, Выборка);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдено БСО с параметрами " + СК + "/" + НомерБСО;
		Сообщение.Сообщить();	
	КонецЕсли;	
	Возврат _СтруктураБСО;
	
КонецФункции	

Функция ПолучитьДанные(Вариант = 0, ИзФайла = Ложь,ИмяФайла = "") Экспорт
	//	СтрокаJson = СобратьДанные(ДатаС,ФильтрНазначения);
	Если ИзФайла = Истина Тогда
		Попытка
			Excel     = Новый COMОбъект("Excel.Application");
			WB         = Excel.Workbooks.Open(ИмяФайла);
			WS         = WB.Worksheets(1); //указываем номер листа - 1
			arr     = WS.UsedRange.Value;  //передаём таблицу в переменную
			WB.Close(0);
		Исключение
			//Предупреждение("Внимание! Файл не открыт."+Символы.ПС+"Попробуйте открыть и пересохранить данный файл программой Эксель.");
			Возврат Неопределено;
		КонецПопытки;
		
		тз = Новый ТаблицаЗначений;
		тз.Колонки.Добавить("СтраховойПродукт"); //"ВЗР"	
		тз.Колонки.Добавить("СтраховаяКомпания");//"Русский Стандарт"	
		тз.Колонки.Добавить("Источник");		 //"Kupipolis.ru"	
		тз.Колонки.Добавить("НомерПолиса");	     //"TRS № 009 260 496"
		тз.Колонки.Добавить("ПериодСтрахования");//Структура	
		тз.Колонки.Добавить("Страхователь");	 //Структура
		тз.Колонки.Добавить("Застрахованные");	 //ТаблицаЗначений или Структура
		тз.Колонки.Добавить("Выгодоприобретатель");	//"Александр Пистолетов Певец"
		тз.Колонки.Добавить("СтраховаяПремия");	    //12.26
		тз.Колонки.Добавить("СтраховаяСумма");	    //5000
		тз.Колонки.Добавить("Валюта");	            //"USD"
		тз.Колонки.Добавить("ДатаОплаты");	        //"2014-10-21 13:15:26"
		тз.Колонки.Добавить("PayID");	            //"vzr_4644d11cc3e023ab703789dd85ae33f6"
		тз.Колонки.Добавить("НомерКарты");	        //"404266******8243"
		тз.Колонки.Добавить("AdditionalFields");	//Структура
		тз.Колонки.Добавить("СуммаПлатежа");	    //12.26
		тз.Колонки.Добавить("Комиссия");	        //-0.34
		тз.Колонки.Добавить("СуммаПлатежаЗаМинусомКомиссии");//11.92	
		тз.Колонки.Добавить("Эквайер");	                  //"MONETA.RU"
		тз.Колонки.Добавить("Выводы");	                  //ТаблицаЗначений
		тз.Колонки.Добавить("КоличествоВыводов");	      //1
		
		//Узнаём выходные данные об листе ексель	
		МассивКолонок = arr.Выгрузить(); //Выгружаем таблицу в массив
		всегоКолонок = МассивКолонок.ВГраница();
		колСтр = МассивКолонок.Получить(0).Количество();
		всегоСтрок   = колСтр - 1;
		//
		
		ВысотаШапки = 1;
		СтруктураИскомойСтроки = Новый Структура("НачалоДиапазонаИ, КонецДиапазонаИ");
		
		Для СчКолонок=1 по всегоКолонок Цикл
			МассивТекКолонки = МассивКолонок.Получить(СчКолонок);
			Для строкаТП = 0+ВысотаШапки По всегоСтрок Цикл //Работаем со строкой
				Если СчКолонок = 1 Тогда
					ТекСтрока = Тз.Добавить();
					ТекСтрока.СтраховаяСумма    = 130000; 
					ТекСтрока.СтраховаяКомпания = "УралСиб"; 
					ТекСтрока.Источник          = "Kupipolis.ru";
					ТекСтрока.Источник          = "Kupipolis.ru";
					ТекСтрока.Валюта            = "RUB";
					ТекСтрока.НомерКарты        = "";
					ТекСтрока.AdditionalFields  = Новый Структура;
					ТекСтрока.Эквайер           = ""; 
					ТекСтрока.Выводы = Новый ТаблицаЗначений;
					ТекСтрока.КоличествоВыводов = 0;
					ТекСтрока.СтраховойПродукт  = "Мигранты";
				Иначе
					ТекСтрока = тз[строкаТП-ВысотаШапки];
				КонецЕсли;
				Знач0 = МассивТекКолонки.Получить(строкаТП);
				Если СчКолонок = 1 Тогда
					ТекСтрока.Страхователь = Новый Структура("Name",Знач0);
					ТекСтрока.Выгодоприобретатель = Знач0;
				ИначеЕсли СчКолонок = 2 Тогда
					ТекСтрока.НомерПолиса = СокрЛП(Знач0);
				ИначеЕсли СчКолонок = 3 Тогда
					ТекСтрока.ДатаОплаты = Знач0;	
				ИначеЕсли СчКолонок = 4 Тогда
					ТекСтрока.ПериодСтрахования = Новый Структура("BeginDate,EndDate",ТекСтрока.ДатаОплаты,СокрЛП(СтрЗаменить(Знач0,"до","")));
				ИначеЕсли СчКолонок = 5 Тогда	
					ТекСтрока.СтраховаяПремия = Число(СтрЗаменить(Знач0,"р",""));
					ТекСтрока.СуммаПлатежа = ТекСтрока.СтраховаяПремия;
					ТекСтрока.Комиссия = 0;
					//Иначе
					//	Продолжить;
				КонецЕсли;	
				
				Если СчКолонок = всегоКолонок Тогда	
					ТекСтрока.PayID       = ОбщегоНазначения.MD5Хэш(""+СокрЛП(ТекСтрока.НомерПолиса)+ТекСтрока.Страхователь);
					ТекСтрока.СуммаПлатежаЗаМинусомКомиссии = ТекСтрока.СуммаПлатежа - ТекСтрока.Комиссия;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Возврат  тз;
	ИначеЕсли Вариант = 1 Тогда
		Попытка
		ПараметрыСоединенияБаза = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
		ПараметрыСоединенияБаза.СтрокаСоединения= "DRIVER={SQL Server Native Client 10.0};SERVER=mssql.kupipolis.ru;UID=DMS44R;PWD=R44SMD;DATABASE=KPP";
		ВнешниеИсточникиДанных.База.УстановитьОбщиеПараметрыСоединения(ПараметрыСоединенияБаза);
		ВнешниеИсточникиДанных.База.УстановитьСоединение();
	Исключение
		Сообщить("Ошибка соединения "+ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	V_Payments.id,
	                      |	V_Payments.name КАК ФИО,
	                      |	V_Payments.email,
	                      |	V_Payments.order_num,
	                      |	V_Payments.agrmnt_num КАК НомерПолиса,
	                      //|	V_Payments.agrmnt_num КАК НомерБСО,
	                      |	"""" КАК СтраховаяКомпания,
	                      |	V_Payments.amount КАК СуммаПлатежа,
	                      |	V_Payments.crtime КАК ДатаВыставления,
	                      |	V_Payments.lifetime,
	                      |	V_Payments.status,
	                      |	V_Payments.link,
	                      |	V_Payments.paytime КАК ДатаОплаты,
	                      |	V_Payments.OfficialID КАК КодАгента,
	                      |	V_Payments.CardNumber как НомерКарты,
	                      |	V_Payments.TransactionID КАК TransactionID,
	                      |	V_Payments.OperationTime,
	                      |	V_Payments.PaymentSystemID,
	                      |	V_Payments.PaySysID,
	                      |	V_Payments.Account,
	                      |	V_Payments.OperationTypeID,
	                      |	V_Payments.DebtToBroker,
	                      |	V_Payments.DebtToBroker - V_Payments.amount КАК Комиссия,
	                      |	V_Payments.UndistributedDebt,
	                      |	V_Payments.Confirmed, ""КАСКО"" как СтраховойПродукт
	                      |ИЗ
	                      |	ВнешнийИсточникДанных.База.Таблица.pay_V_Payments_tmp КАК V_Payments
	                      |ГДЕ
	                      |	НЕ V_Payments.TransactionID ЕСТЬ NULL 
	                      |	И V_Payments.amount > 0");
						  
						  тз =  Запрос.Выполнить().Выгрузить();
						  тз.Колонки.Добавить("PayID");
						  Для Каждого СтрокаТЗ из Тз Цикл
							  СтрокаТЗ.PayID = "TransactionID"+Формат(СтрокаТЗ.TransactionID,"ЧГ=");
							  
						  КонецЦикла;
						  Возврат  тз;
		
	Иначе
		//УидПользователя = "a19dce94-dd5c-41a0-8bd5-42a2b4b15ca3";
		////УидПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID");
		//ИмяФ = "1234.txt";
		//ИмяФайлаОтправки = "D:\temp\"+ИмяФ;
		//ДатаС  = Лев(XMLСтрока(НачПериода),10);
		//ДатаПо = Лев(XMLСтрока(КонецДня(КонПериода)+1),10);
		//Строка = "<?xml version=""1.0"" encoding=""UTF-8""?>
		//|<rq type='Request1C' task='GetOperationsByPeriod' comp_name='"+ИмяКомпьютера()+"' sessid='' uid='"+УидПользователя+"' hash='"+уб_СЕРВЕРНЫЕ.SID()+"' data='{""date_from"":"""+ДатаС+""",""date_to"":"""+ДатаПо+"""}'"+"/>";
		//Сообщить (Строка);
		//Текст = Новый ТекстовыйДокумент;
		//Текст.ДобавитьСтроку(Строка);
		//Текст.Записать(ИмяФайлаОтправки);
		////Сообщить(ИмяФайлаОтправки);
		//
		//Сервер = "www.sluice";
		////	Сервер = "sluice.loc";
		//Порт = 80 ;
		//
		//HTTP = Новый HTTPСоединение(Сервер, Порт);
		//
		//ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("tmp");
		//
		//ЗаголовокHTTP = Новый Соответствие();
		//ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
		//
		//Ресурс = "/test2.php";
		//Ресурс ="";
		//Попытка
		//	HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, Ресурс, ИмяПолученногоФайла, ЗаголовокHTTP);
		//Исключение
		//	
		//	//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
		//КонецПопытки;
		////УдалитьФайлы(ИмяФайлаОтправки,);
		//
		//
		//Текст = Новый ТекстовыйДокумент; 
		//Текст.Прочитать(ИмяПолученногоФайла,"utf-8");// "windows-1251"
		////Запрос = Новый COMОбъект("MSXML2.DOMDocument");
		//json = Текст.ПолучитьТекст();
		//Если json = "" Тогда
		//	#Если Клиент Тогда
		//		Сообщить("Пустой ответ");
		//	#КонецЕсли
		//Иначе
		//	json = уб_B2B.UnJson(json,Истина);//
		//	
		//	Если ТипЗнч(json) = Тип("Строка") Тогда
		//		Текст.Прочитать(ИмяПолученногоФайла,"windows-1251");
		//		json = Текст.ПолучитьТекст();
		//		Сообщить(json);
		//		Возврат Неопределено;
		//	Иначе	
		//		тз  = ПривестивТЗ(json[0]);
		//		тз2 = ПривестивТЗ(json[1]);
		//		тз.Колонки.Добавить("Выводы");
		//		тз.Колонки.Добавить("КоличествоВыводов");
		//		Для каждого Строка из тз Цикл
		//			Строка.Выводы = ТЗ2.Скопировать(Новый Структура("ClientTransaction",Строка.PayID));
		//			Строка.КоличествоВыводов = Строка.Выводы.Количество();
		//			Если ТипЗнч(Строка.Застрахованные)= Тип("Массив") Тогда
		//				Строка.Застрахованные = ПривестивТЗ(Строка.Застрахованные);
		//			КонецЕсли;
		//		КонецЦикла;	
		//		//
		//		Возврат тз;
		//	КонецЕсли;	
		//КонецЕсли;	
		////Иначе
		////	Сообщить("Неизвестный запрос "+ТипЗапроса);
		////КонецЕсли;	
		
	КонецЕсли;
	
	
КонецФункции	


Функция ПривестиВТЗ(МС)
	Тз = Новый ТаблицаЗначений;
	Для каждого Соот из МС Цикл
		СтрокаТ = Тз.Добавить();
		Для каждого ЭлСоот Из Соот Цикл
			НашКлюч = Подмена(ЭлСоот.Ключ);
			Если тз.Колонки.Найти(НашКлюч) = Неопределено Тогда
				тз.Колонки.Добавить(НашКлюч);
			КонецЕсли;	
			СтрокаТ[НашКлюч] = ЭлСоот.Значение;
		КонецЦикла;	
	КонецЦикла;	
	Возврат Тз;
КонецФункции	

Функция Подмена(Значение)
	Результат = ""+Значение;
	Если Результат = "InsPeriod" Тогда
		Результат = "ПериодСтрахования";
	ИначеЕсли Результат = "Site" Тогда
		Результат = "Источник";	
	ИначеЕсли Результат = "InsSum" Тогда
		Результат = "СтраховаяСумма";	
	ИначеЕсли Результат = "InsType" Тогда
		Результат = "СтраховойПродукт";	
	ИначеЕсли Результат = "Insurer" Тогда
		Результат = "Страхователь";	
	ИначеЕсли Результат = "InsCurr" Тогда
		Результат = "Валюта";	
	ИначеЕсли Результат = "CardNumber" Тогда
		Результат = "НомерКарты";	
	ИначеЕсли Результат = "Insured" Тогда
		Результат = "Застрахованные";		
	ИначеЕсли Результат = "PayTime" Тогда
		Результат = "ДатаОплаты";			
	ИначеЕсли Результат = "Supplier" Тогда
		Результат = "СтраховаяКомпания";				
	ИначеЕсли Результат = "InsPrem" Тогда
		Результат = "СтраховаяПремия";					
	ИначеЕсли Результат = "PoliceNumber" Тогда
		Результат = "НомерПолиса";						
	ИначеЕсли Результат = "SourceAmountFee" Тогда
		Результат = "Комиссия";							
	ИначеЕсли Результат = "Beneficiary" Тогда
		Результат = "Выгодоприобретатель";								
	ИначеЕсли Результат = "SourceAmountTotal" Тогда
		Результат = "СуммаПлатежаЗаМинусомКомиссии";									
	ИначеЕсли Результат = "SourceAmount" Тогда
		Результат = "СуммаПлатежа";										
	ИначеЕсли Результат = "Acquirer" Тогда
		Результат = "Эквайер";										
	ИначеЕсли Результат = "MONETA.RU" Тогда
		Результат = Справочники.Контрагенты.НайтиПоНаименованию("МОНЕТА.РУ");
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции	

Процедура ДобавитьСтрокуТЗЛогВЗР(ТЗЛог, Текст, Ошибка = Ложь, ТекстИсточника = "") Экспорт
	Если ТЗЛог = Неопределено Тогда
		ТЗЛог = Новый ТаблицаЗначений();
		ТЗЛог.Колонки.Добавить("Текст", 			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1024)));
		ТЗЛог.Колонки.Добавить("Ошибка",    		Новый ОписаниеТипов("Булево"));
		ТЗЛог.Колонки.Добавить("ТекстИсточника",	Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1024)));
	КонецЕсли;
	СтрокаТЗ = ТЗЛог.Добавить();
	СтрокаТЗ.Текст 			= Текст;
	СтрокаТЗ.Ошибка			= Ошибка;
	СтрокаТЗ.ТекстИсточника = ТекстИсточника;
	
КонецПроцедуры

Функция ДатаИзСтроки(дата,Вариант=1) Экспорт
	Попытка
		Если Вариант=1 Тогда
			Возврат Дата(Лев(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Дата,"-","")," ",""),":",""),"T",""),14));
			//2014-11-08 00:00:00
			//2014-11-08T00:00:00.001
		Иначе
			Возврат Дата( Сред (Дата,7,4)+Сред (Дата,4,2)+Сред (Дата,1,2));
		КонецЕсли;	
	Исключение
		Попытка
			Возврат Дата( Сред (Дата,7,4)+Сред (Дата,4,2)+Сред (Дата,1,2));
		Исключение
			Возврат Дата(1,1,1);
		КонецПопытки;
		
	КонецПопытки;
КонецФункции



Функция УстановитьЗнач(Реквизит, НовоеЗначение,ИмяРеквизита="") Экспорт
	
	СтароеЗначение = Неопределено;
	Установлено = УстановитьЗначение(Реквизит, НовоеЗначение, СтароеЗначение);
	Если флОтладка = Истина  и Установлено = Истина Тогда
		Если ЗначениеЗаполнено(СтароеЗначение) =  Ложь Тогда
			СтароеЗначение = "<..>";
		КонецЕсли;	
		Сообщить("Изменено "+ИмяРеквизита+" с " + СтароеЗначение + " на " + НовоеЗначение);
	КонецЕсли;	
	Возврат Установлено;
КонецФункции


Функция НеобходимоДобавитьВОчередь(Полис)
	КоличествоПРиемок = Полис.Payments.Количество();
	Если КоличествоПРиемок > 0 Тогда
		Для каждого СтрокаПлатежей из Полис.Payments Цикл
			ОбъектПриемка = Неопределено;
			ПлатежP = СтрокаПлатежей.Значение;	
			Если ПлатежP.PaymentSystemID ="2" Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	
		

Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") 
     
    Позиция = НайтиНедопустимыеСимволыXML(Текст); 
    Пока Позиция > 0 Цикл 
        ТекущийСимвол = Сред(Текст, Позиция, 1); 
        Если КодСимвола(ТекущийСимвол) = 21 Тогда    // Параграф. 
            Текст = СтрЗаменить(Текст, ТекущийСимвол, Символ(167)); 
            Позиция = НайтиНедопустимыеСимволыXML(Текст); 
            Продолжить; 
        КонецЕсли; 
        Текст = СтрЗаменить(Текст, ТекущийСимвол, СимволЗамены); 
        Позиция = НайтиНедопустимыеСимволыXML(Текст); 
    КонецЦикла; 
     
    Возврат Текст; 
     
КонецФункции 
