Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
	
	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Запись банковского счета (" + Владелец + ") " + Наименование + ", код " + Код;
	
	Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) Тогда 
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("В номере банковского счета присутствуют не только цифры. 
		|Возможно, номер указан неправильно","Сообщить", , , , , , , ,Заголовок)
		//ОбщегоНазначения.СообщитьОбОшибке("В номере банковского счета присутствуют не только цифры. 
		//|Возможно, номер указан неправильно", , Заголовок);
	КонецЕсли;

	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не выбрана валюта.","Сообщить", , , , , , , ,Заголовок);
		Отказ=Истина;
		//ОбщегоНазначения.СообщитьОбОшибке("Не выбрана валюта.", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидСчета) Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не выбран вид счета.","Сообщить", , , , , , , ,Заголовок);
		//ОбщегоНазначения.СообщитьОбОшибке("Не выбран вид счета.", Отказ, Заголовок);
		Отказ=Истина;
	КонецЕсли;
	Если ВалютаДенежныхСредств = мВалютаРегламентированногоУчета Тогда
	
		Если НЕ ЗначениеЗаполнено(НомерСчета) Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не указан номер счета.","Сообщить", , , , , , , ,Заголовок);
			//ОбщегоНазначения.СообщитьОбОшибке("Не указан номер счета.", Отказ, Заголовок);
			Отказ=Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Банк) Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не выбран банк.","Сообщить", , , , , , , ,Заголовок);
			//ОбщегоНазначения.СообщитьОбОшибке("Не выбран банк.", Отказ, Заголовок);
			Отказ=Истина;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

//мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
мВалютаРегламентированногоУчета = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;