////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения строк табличной части.
//
// Параметры: 
//  Отказ		- флаг отказа в проведении.
//  Заголовок	- строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиБСО()

// Формируем движения по регистрам.
//
Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	СтруктураПараметров.Вставить("ДатаСреза", Неопределено);
	СтруктураПараметров.Вставить("АгентВТЧДокумента", Истина);
	СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Истина);
	СтруктураПараметров.Вставить("Агент", "Агент");
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);
	//СтруктураПараметров.Вставить("Ссылка", Ссылка);
//	СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.ВводОстатковБСО);
	//СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Неопределено);
	СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Истина);
	//СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Истина);
	СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", ВидДвиженияНакопления.Приход);
	СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Поставщик", Поставщик);
	СтруктураПараметров.Вставить("ОрганизацияАгент", ОрганизацияАгент);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	СтруктураПараметров.Вставить("ПроверкаПоложения", Ложь);
	СтруктураПараметров.Вставить("СКВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("СК", СК);
	СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Истина);
	СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО", "СостояниеБСО");
	СтруктураПараметров.Вставить("ИмяКолонкиПоложениеБСО", "ПоложениеБСО");

	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, Режим)
	 
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	ОбязательныеПоля = "СК";
	//Если РежимЗагрузкиИзФайла Тогда
	//	ОбязательныеПоля = ОбязательныеПоля + ",ГлавноеПодразделение";
	//КонецЕсли;
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеПоля);
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли
	
	// Вставить содержимое обработчика.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("СК");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	

КонецПроцедуры