Функция ОбработчикРассылки(Очередь) Экспорт
	
	Запрос = Новый Запрос;
	
	КэшРуководителей = Новый Соответствие;
	КэшЭлектроннойПочты = Новый Соответствие;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЖурналУспеваемостиСотрудников.Ссылка,
	               |	уб_ЖурналУспеваемостиСотрудников.Сотрудник,
	               |	уб_ЖурналУспеваемостиСотрудников.Подразделение,
	               |	уб_ЖурналУспеваемостиСотрудников.Балл,
	               |	уб_ЖурналУспеваемостиСотрудников.ОпросЗавершен,
	               |	уб_ЖурналУспеваемостиСотрудников.Дата,
	               |	уб_ЖурналУспеваемостиСотрудников.ПометкаУдаления,
	               |	уб_ЖурналУспеваемостиСотрудников.Тема
	               |ИЗ
	               |	Документ.уб_ЖурналУспеваемостиСотрудников КАК уб_ЖурналУспеваемостиСотрудников
	               |ГДЕ
	               |	уб_ЖурналУспеваемостиСотрудников.Ссылка В(&Документы)";
			   
	Запрос.УстановитьПараметр("Документы",Очередь);
	
	ТекДата   = ТекущаяДата();
	ТекДатаН  = НачалоДня(ТекущаяДата());
	ТекДата8  = ТекДатаН+8*3600;
	//Завтра12 = КонецДня(ТекДата)+1+12*3600;
	
	пРассылка = Перечисления.уб_ТипыОчереди.Рассылка;
	Выборка = Запрос.Выполнить().Выбрать();
	ДопТекстЦветФона ="";
	Пока Выборка.Следующий() Цикл
		
		ТекстHTML = "";
		Если Выборка.ПометкаУдаления Тогда
			Если ТекДата > ТекДата8 Тогда
				//Информируем сразу в начале рабочего дня
				
				ТекстHTML = "<html><body" + ДопТекстЦветФона + ">"+
					"<b>Опрос по теме " + Выборка.Тема+" для "+Выборка.Сотрудник +" отменен <br>"+
			"</body></html>";
			ИначеЕсли Выборка.Дата<ТекДата Тогда
				//Уже не актуально
				уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
				Продолжить;
			Иначе	
				Продолжить;
			КонецЕсли;
		Иначе
			ДатаОповещения =  НачалоДня(Выборка.Дата)-12*3600;
			Если ТекДата > Выборка.Дата Тогда
				//Уже не актуально
				Если Выборка.ОпросЗавершен Тогда
				Иначе
					уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);	
					Продолжить;
				КонецЕсли;	
				
			ИначеЕсли ТекДата > ДатаОповещения Тогда
				//ТекстОповещения = "Опрос по теме " + Выборка.Тема+" для "+Выборка.Сотрудник +" запланирован на "+Формат(Выборка.Дата,"ДФ='dd.MM.yyyy HH:mm'");
			Иначе
				//еще не пришло время
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстHTML = "" Тогда
			ТекстHTML = "<html><body" + ДопТекстЦветФона + ">"
			//+"<br> " + ДопТекстСрочно + 
			"<b>"+?(Выборка.Балл=0,"Назначено","Проведено")+" тестирование по теме :</b>            " + Выборка.Тема + "<br>
				|<b>Сотрудник :</b>            " + Выборка.Сотрудник + "<br>
				|"+?(Выборка.Балл=0,"","<b>Результат: </b>"+Выборка.Балл+"<br>")+"  
				|<b>Дата :</b>            " + Формат(Выборка.Дата,"ДФ='dd.MM.yyyy HH:mm'") + "<br>
			|</body></html>";
		Конецесли;	
			
		СтруктураРуководителей = КэшРуководителей.Получить(Выборка.Сотрудник);
		
		Если СтруктураРуководителей = Неопределено Тогда
			СтруктураРуководителей = уб_temp.РуководительПодразделенияПоАгенту(Выборка.Сотрудник);
		КонецЕсли;
		
		
		МассивОбъектов = Новый  Массив;
		МассивОбъектов.Добавить(Выборка.Сотрудник);
		Если Не СтруктураРуководителей.Руководитель.Пустая() Тогда
			МассивОбъектов.Добавить(СтруктураРуководителей.Руководитель)
		КонецЕсли;
		Если Не СтруктураРуководителей.Заместитель.Пустая() Тогда
			МассивОбъектов.Добавить(СтруктураРуководителей.Заместитель)
		КонецЕсли;	
		МассивПолучателей = Новый Массив;
		Индекс = 0;
		Для Каждого Объект Из МассивОбъектов Цикл
			Индекс = Индекс + 1;
			ЭлПочта = уб_temp.КонтактнаяИнформация(Объект, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
			Если Не ПустаяСтрока(ЭлПочта) Тогда
				//Сообщить(ЭлПочта);
				МассивПолучателей.Добавить(ЭлПочта)
			КонецЕсли;
		КонецЦикла;
		
		Если МассивПолучателей.Количество() > 0 Тогда
			//добавляем в список получателей электронную почту для копий
			СистемнаяПочта = ПараметрыСеанса.уб_Константы.ЭлектроннаяПочтаДляКопий;
			ДопТекстПодвал = "";//<br><br><font color = ""#ff0000"">" + ?(ШтрафПоТекущейДате = 0, "", "<b>Начисленный штраф: " + ШтрафПоТекущейДате + " руб.</b><br><br>") + "<i>За неисправление ошибки, начиная с даты " + Формат(КритическаяДата + 1, "ДФ=dd.MM.yyyy") + " г. в " + Формат(КритическаяДата + 1, "ДЛФ=T") + " будет начислен ежедневный штраф " + ЕжедневныйШтраф + " руб. за каждый день просрочки!</i></font>";
			ДопТекстЦветФона = " bgcolor = ""#ffcccc""";
			ДопТекстСрочно = "";
			Если ТипЗнч(СистемнаяПочта) = Тип("Строка") Тогда
				МассивПолучателей.Добавить(СистемнаяПочта)
			КонецЕсли;
			
			ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина, Истина);
			
			Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
				Параметры.ОбратныйАдрес = ОбратныйАдрес;
			КонецЕсли;
			Параметры.Получатели					= МассивПолучателей;
			Параметры.Тема							= ""+Выборка.Сотрудник+ ?(Выборка.Балл=0," назначено "+Формат(Выборка.Дата,"ДФ='dd.MM.yyyy HH:mm'")," проведено")+" тестирование";
			Параметры.ТекстHTML						= ТекстHTML;
			Параметры.ПисатьВЖурналТемуПриОшибке    = Ложь;
			Параметры.ТипСообщенияПриИсключении		= "Предупреждение";
			Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
				Параметры.ОбратныйАдрес = ОбратныйАдрес
			КонецЕсли;
			ЗаписыватьВРегистр = уб_ОбменДанными.SendMail(Параметры);
			Если ЗаписыватьВРегистр Тогда
				уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
			Иначе
				уб_МодульРегламентныхЗаданий.ОшибкаОчереди(Выборка.Ссылка,пРассылка);
			КонецЕсли;
		КонецЕсли;	
		
		//ЗакрытьОчередь(Ссылка,ТипОчереди)
	КонецЦикла;
	
КонецФункции






Функция ПоказательУспеваемостиСотрудника(Сотрудник,ДатаПроверки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если ДатаПроверки = Неопределено или ТипЗнч(ДатаПроверки)<>Тип("Дата") Тогда
		
		ДатаПроверки  = КонецМесяца(ТекущаяДата());
	Иначе	
	КонецЕсли;
	
	//Пытаемся найти нужный период ЗП
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_НачислениеЗП.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.уб_НачислениеЗП КАК уб_НачислениеЗП
	                      |ГДЕ
	                      |	уб_НачислениеЗП.Проведен
	                      |	И уб_НачислениеЗП.Дата < &Дата2
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Запрос.УстановитьПараметр("Дата2",ДатаПроверки);							  
	ВсеНачисления = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дата");
	Если ВсеНачисления.Найти(НачалоМесяца(ДатаПроверки)) = Неопределено Тогда
		_ДатаПроверки = ?(ВсеНачисления.Количество()= 0,ДатаПроверки,ВсеНачисления[0]); 
	Иначе
		_ДатаПроверки = НачалоМесяца(ДатаПроверки);
	КонецЕсли;	
	
	
	
	Запрос.Текст = СтрЗаменить(ТекстЗАпросаУспеваемости(),"1 = 1","Журнал.Сотрудник = &Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата2",_ДатаПроверки);
	//Запрос.УстановитьПараметр("СВС",ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС);
	
	СтруктураПоказателей = Новый Структура("Сотрудник,Балл,СредБаллМесяц,СредБаллКвартал,БаллМесяц,БаллКвартал,КолМесяц,КолКвартал,ТочкаПродаж,ЭтоРуководитель",Сотрудник,0,0,0,0,0,0,0,Ложь,Ложь);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПоказателей,Выборка);
	КонецЕсли;	
	
	Возврат СтруктураПоказателей;
	
КонецФункции

Функция ТекстЗАпросаУспеваемости()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Журнал.Сотрудник,
	        |	Журнал.Балл,
	        |	ВЫБОР
	        |		КОГДА Журнал.КолМесяц = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВЫРАЗИТЬ(Журнал.БаллМесяц / Журнал.КолМесяц КАК ЧИСЛО(10, 0))
	        |	КОНЕЦ КАК СредБаллМесяц,
	        |	&Дата2,
	        |	ДОБАВИТЬКДАТЕ(&Дата2, МЕСЯЦ, 1) КАК Поле1,
	        |	ВЫБОР
	        |		КОГДА Журнал.КолКвартал = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ВЫРАЗИТЬ(Журнал.БаллКвартал / Журнал.КолКвартал КАК ЧИСЛО(10, 0))
	        |	КОНЕЦ КАК СредБаллКвартал,
	        |	Журнал.БаллМесяц,
	        |	Журнал.БаллКвартал,
	        |	Журнал.КолМесяц,
	        |	Журнал.КолКвартал,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.ТипПодразделения, """") = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.ТочкаПродаж)
	        |				И НЕ уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Родитель.Наименование=""ОП-Мастер""
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ТочкаПродаж,
	        |	ВЫБОР
	        |		КОГДА уб_РуководителиПодразделенийСрезПоследних.Сотрудник ЕСТЬ NULL 
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЭтоРуководитель,
	        |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		уб_ЖурналУспеваемостиСотрудников.Сотрудник КАК Сотрудник,
	        |		СУММА(уб_ЖурналУспеваемостиСотрудников.Балл) КАК Балл,
	        |		СУММА(ВЫБОР
	        |				КОГДА ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.Пересдача <> ЗНАЧЕНИЕ(Документ.уб_ЖурналУспеваемостиСотрудников.ПустаяСсылка)
	        |								ТОГДА 0
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ >= &Дата2
	        |						И ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ < ДОБАВИТЬКДАТЕ(&Дата2, МЕСЯЦ, 1)
	        |					ТОГДА уб_ЖурналУспеваемостиСотрудников.Балл
	        |				ИНАЧЕ 0
	        |			КОНЕЦ) КАК БаллМесяц,
	        |		СУММА(ВЫБОР
	        |				КОГДА ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.Пересдача <> ЗНАЧЕНИЕ(Документ.уб_ЖурналУспеваемостиСотрудников.ПустаяСсылка)
	        |								ТОГДА 0
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ >= &Дата2
	        |						И ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ < ДОБАВИТЬКДАТЕ(&Дата2, МЕСЯЦ, 1)
	        |					ТОГДА уб_ЖурналУспеваемостиСотрудников.Количество
	        |				ИНАЧЕ 0
	        |			КОНЕЦ) КАК КолМесяц,
	        |		СУММА(ВЫБОР
	        |				КОГДА ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.Пересдача <> ЗНАЧЕНИЕ(Документ.уб_ЖурналУспеваемостиСотрудников.ПустаяСсылка)
	        |								ТОГДА 0
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ >= ДОБАВИТЬКДАТЕ(&Дата2, МЕСЯЦ, -3)
	        |						И ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ <= &Дата2
	        |					ТОГДА уб_ЖурналУспеваемостиСотрудников.Балл
	        |				ИНАЧЕ 0
	        |			КОНЕЦ) КАК БаллКвартал,
	        |		СУММА(ВЫБОР
	        |				КОГДА ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.Пересдача <> ЗНАЧЕНИЕ(Документ.уб_ЖурналУспеваемостиСотрудников.ПустаяСсылка)
	        |								ТОГДА 0
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ >= ДОБАВИТЬКДАТЕ(&Дата2, МЕСЯЦ, -3)
	        |						И ВЫБОР
	        |							КОГДА уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод = ДАТАВРЕМЯ(1, 1, 1)
	        |								ТОГДА уб_ЖурналУспеваемостиСотрудников.Дата
	        |							ИНАЧЕ уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод
	        |						КОНЕЦ <= &Дата2
	        |					ТОГДА уб_ЖурналУспеваемостиСотрудников.Количество
	        |				ИНАЧЕ 0
	        |			КОНЕЦ) КАК КолКвартал,
	        |		КОЛИЧЕСТВО(уб_ЖурналУспеваемостиСотрудников.Количество) КАК Ссылка
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			уб_ЖурналУспеваемостиСотрудников.Сотрудник КАК Сотрудник,
	        |			уб_ЖурналУспеваемостиСотрудников.Проведен КАК Проведен,
	        |			уб_ЖурналУспеваемостиСотрудников.Балл КАК Балл,
	        |			уб_ЖурналУспеваемостиСотрудников.Пересдача КАК Пересдача,
	        |			уб_ЖурналУспеваемостиСотрудников.ТемаПрослушана КАК ТемаПрослушана,
	        |			уб_ЖурналУспеваемостиСотрудников.ЗарплатныйПериод КАК ЗарплатныйПериод,
	        |			уб_ЖурналУспеваемостиСотрудников.Дата КАК Дата,
	        |			1 КАК Количество
	        |		ИЗ
	        |			Документ.уб_ЖурналУспеваемостиСотрудников КАК уб_ЖурналУспеваемостиСотрудников
	        |		
	        |		ОБЪЕДИНИТЬ ВСЕ
	        |		
	        |		ВЫБРАТЬ
	        |			&Сотрудник,
	        |			ИСТИНА,
	        |			0,
	        |			ЗНАЧЕНИЕ(Документ.уб_ЖурналУспеваемостиСотрудников.ПустаяСсылка),
	        |			ИСТИНА,
	        |			&Дата2,
	        |			&Дата2,
	        |			0) КАК уб_ЖурналУспеваемостиСотрудников
	        |	ГДЕ
	        |		уб_ЖурналУспеваемостиСотрудников.Проведен
	        |		И уб_ЖурналУспеваемостиСотрудников.ТемаПрослушана
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		уб_ЖурналУспеваемостиСотрудников.Сотрудник) КАК Журнал
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	        |		ПО Журнал.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(КОНЕЦПЕРИОДА(&Дата2, МЕСЯЦ), ) КАК уб_РуководителиПодразделенийСрезПоследних
	        |		ПО Журнал.Сотрудник = уб_РуководителиПодразделенийСрезПоследних.Сотрудник
	        |			И (уб_РуководителиПодразделенийСрезПоследних.Заместитель = ЛОЖЬ)
	        |			И (уб_РуководителиПодразделенийСрезПоследних.Уход = ЛОЖЬ)
	        |ГДЕ
	        |	1 = 1
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие";
		
КонецФункции

