
Процедура ПриЗаписи(Отказ)
	
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	
	ТребуетсяОповещение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЖурналУспеваемостиСотрудников.Ссылка,
	               |	уб_ЖурналУспеваемостиСотрудников.ПометкаУдаления,
	               |	уб_ЖурналУспеваемостиСотрудников.Дата,
	               |	уб_ЖурналУспеваемостиСотрудников.Сотрудник,
	               |	уб_ЖурналУспеваемостиСотрудников.Тема,
	               |	уб_ЖурналУспеваемостиСотрудников.Балл,
	               |	уб_ЖурналУспеваемостиСотрудников.ОпросЗавершен
	               |ИЗ
	               |	Документ.уб_ЖурналУспеваемостиСотрудников КАК уб_ЖурналУспеваемостиСотрудников
	               |ГДЕ
	               |	уб_ЖурналУспеваемостиСотрудников.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Структура = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		ИзменилисьВажныеДанные = Выборка.ПометкаУдаления<>ПометкаУдаления 
		                         или (ОпросЗавершен = Истина и Выборка.Балл<>Балл) 
								 или Выборка.Сотрудник<>Выборка.Сотрудник
								 или (Выборка.Дата<>Дата и ТекущаяДата()<Дата);
	Иначе
		//Новый	
		ИзменилисьВажныеДанные = Ложь;
	КонецЕсли;
	
	Если ИзменилисьВажныеДанные Тогда
		ТребуетсяОповещение = Истина;
	ИначеЕсли ТекущаяДата()<Дата Тогда
		ТребуетсяОповещение = Истина;
	Иначе
		
	КонецЕсли;
	
	Если ТребуетсяОповещение Тогда
		Запись = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		Если ЭтоНовый() Тогда 
			СсылкаНового = Документы.уб_ЖурналУспеваемостиСотрудников.ПолучитьСсылку(Новый  УникальныйИдентификатор);
			УстановитьСсылкуНового(СсылкаНового);
			Запись.Объект = СсылкаНового;
		Иначе
			Запись.Объект = Ссылка;	
		КонецЕсли;
		
		
		Запись.ТипОчереди = Перечисления.уб_ТипыОчереди.Рассылка;
		
		//Пока не будем сохранять попытки обработки
		//Запись.Прочитать();
		//Если Запись.Выбран()= Ложь Тогда
		//	Запись.Объект = Ссылка;
		//	Запись.ТипОчереди = Перечисления.уб_ТипыОчереди.Рассылка;
		//КонецЕсли;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры
