// Функция получает файлы с сервера с указанными параметрами и сохраняет на диск
//
// Параметры:
//  HTTP - HTTPСоединение, если приходится использовать данную функцию в цикле, то тут передается
//         переменная с созданным в предыдущей итерации цикла HTTPСоединением
// СерверИсточникПараметр - Строка, сервер, с которого необходимо получить файлы
// СтрокаПараметраПолученияПараметр - Строка, адрес ресурса на сервере.
// ИмяВходящегоФайлаПараметр - Имя файла, в который помещаются данные полученного ресурса.
//
// Возвращаемое значение:
//  Булево - Успешно получены файлы или нет.
//
Функция ЗапроситьФайлыССервера(СерверИсточникПараметр, СтрокаПараметраПолученияПараметр, ИмяВходящегоФайлаПараметр, HTTP = Неопределено) Экспорт

	СерверИсточник           = СерверИсточникПараметр;
	СтрокаПараметраПолучения = СтрокаПараметраПолученияПараметр;
	ИмяВходящегоФайла        = ИмяВходящегоФайлаПараметр;
	
	Если ТипЗнч(HTTP) <> Тип("HTTPСоединение") Тогда
		HTTP = Новый HTTPСоединение(СерверИсточник)
	КонецЕсли; 
	
	Попытка
		HTTP.Получить(СтрокаПараметраПолучения, ИмяВходящегоФайла);
		Возврат Истина;
	Исключение
		Возврат Ложь;	
	КонецПопытки;
	
КонецФункции

//Используется для отправки почтового сообщения
//Параметры:
//	SendTo - адресат (mail@mail.com)
//  subject - тема
//	attachment - вложение
//Все настройки хранятся в справочнике уб_Константы
Функция SendMail(
	Получатели
	, subject
	, Body = ""
	, attachment = ""
	, Отправитель = ""
	, ИмяОтправителя = Неопределено
	, Организация = ""
	, ОбратныйАдрес = ""
	) Экспорт
	//Создаем профиль
	//СК = ПараметрыСеанса.уб_Константы;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.EMail Как SystemEMail,
	|   *
	|ИЗ
	|	Справочник.уб_УчетныеЗаписи КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &SystemEMail";
	Запрос.УстановитьПараметр("SystemEMail", ПараметрыСеанса.уб_Константы.SystemEMail);
	СК = Запрос.Выполнить().Выбрать();
	СК.Следующий();
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.POP3ПередSMTP		= Ложь;
	ВрОжидания = СК.Timeout;
	Если ТипЗнч(ВрОжидания) = Тип("Число") И ВрОжидания > 0 Тогда
		Профиль.ВремяОжидания	=  ВрОжидания;
	КонецЕсли;
	
	ПортPOP3 = СК.POP3Port;
	Если ТипЗнч(ПортPOP3) = Тип("Число") И ПортPOP3 > 0 Тогда
		Профиль.ПортPOP3	=  ПортPOP3;
	Иначе
		Профиль.ПортPOP3	=  110;
	КонецЕсли;
	Профиль.АдресСервераPOP3	= СК.POP3Server;
	Профиль.Пользователь		= СК.POP3User;
	Профиль.Пароль				= СК.POP3Password;
	
	ПортSMTP = СК.SMTPPort;
	Если ТипЗнч(ПортSMTP) = Тип("Число") И ПортSMTP > 0 Тогда
		Профиль.ПортSMTP	=  ПортSMTP;
	Иначе
		Профиль.ПортSMTP	=  25;
	КонецЕсли;
	Профиль.АдресСервераSMTP	= СК.SMTPServer;
	Профиль.ПользовательSMTP	= СК.SMTPUser;
	Профиль.ПарольSMTP			= СК.SMTPPassword;
	
	чАутентификацияSMTP = СК.SMTPAuthentication;
	Если чАутентификацияSMTP = 0 Тогда
		АутентификацияSMTP = СпособSMTPАутентификации.CramMD5;
	ИначеЕсли чАутентификацияSMTP = 1 Тогда
		АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ИначеЕсли чАутентификацияSMTP = 2 Тогда
		АутентификацияSMTP = СпособSMTPАутентификации.Plain;
	ИначеЕсли чАутентификацияSMTP = 3 Тогда
		АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
	ИначеЕсли чАутентификацияSMTP = 4 Тогда
		АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Иначе
		АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
	КонецЕсли;

	чАутентификацияPOP3 = СК.POP3Authentication;
	Если чАутентификацияPOP3 = 0 Тогда
		АутентификацияPOP3 = СпособPOP3Аутентификации.APOP;
	ИначеЕсли чАутентификацияPOP3 = 1 Тогда
		АутентификацияPOP3 = СпособPOP3Аутентификации.CramMD5;
	ИначеЕсли чАутентификацияPOP3 = 2 Тогда
		АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	Иначе
		АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
	КонецЕсли;
	
	Профиль.АутентификацияSMTP	= АутентификацияSMTP;
	Профиль.АутентификацияPOP3	= АутентификацияPOP3;

	//Формируем письмо
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Если ТипЗнч(Получатели) = Тип("Массив") Тогда
		Для каждого Получатель Из Получатели Цикл
			Письмо.Получатели.Добавить(Получатель);
		КонецЦикла;
	Иначе	
		Письмо.Получатели.Добавить(Получатели);
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(attachment) Тогда
		Письмо.Вложения.Добавить(attachment);
	КонецЕсли;

	Письмо.ИмяОтправителя = ?(ИмяОтправителя = Неопределено,"1С - ITC:Управление Брокером",ИмяОтправителя);
	Письмо.Отправитель = ?(ЗначениеНеЗаполнено(Отправитель),СК.SystemEMail,Отправитель);
	
	ОбратныйАдрес = ?(ЗначениеНеЗаполнено(ОбратныйАдрес),СК.SystemEMail,Отправитель);
	Письмо.ОбратныйАдрес.Добавить(ОбратныйАдрес);
	
	Если НЕ ЗначениеНеЗаполнено(Организация) Тогда
		Письмо.Организация = Организация;
	КонецЕсли;
	
	Письмо.Кодировка = "windows-1251"; 
	Письмо.Тема = subject; 
	Письмо.Тексты.Добавить(Body + "
							|
							|====================================================================================
							|Это письмо сформированно автоматически в конфигурации 1C ""ITC:Управление Брокером"",
							|Отвечать на него н нужно. По всем возникшим вопросам обращаться к администратору.");//,ТипТекстаПочтовогоСообщения.HTML); 
	//Письмо.ОбработатьТексты();

	//Отправляем
	Почта = Новый ИнтернетПочта; 
	Попытка
		Почта.Подключиться(Профиль);
		Почта.Послать(Письмо);
		Почта.Отключиться();
		Возврат 1;
	Исключение
		Сообщить("Возникли проблемы при отправке почтового сообщения: " + ОписаниеОшибки(),СтатусСообщения.Важное);
		Возврат 0;
	КонецПопытки;
КонецФункции

