
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ошибки") Тогда
		Ошибки.Очистить();
		Для каждого Ошибка из Параметры.Ошибки Цикл
			НоваяОшибка = Ошибки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОшибка,Ошибка);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОшибке(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
