#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Объект.ФизическоеЛицо = ПараметрыСеанса.уб_ТекущееФизЛицо;
	КонецЕсли;	
	
	
	Элементы.ФизическоеЛицо.ВыбиратьТип = Ложь;
	//ЭлементыФормы.ФизическоеЛицо.ОграничениеТипа=Новый ОписаниеТипов(МассивТипов);	
	НачПериода = НачалоГода(ТекущаяДата() - (60 * 60 * 24 * 92));
	КонПериода = ТекущаяДата();
	Период = Новый СтандартныйПериод(НачПериода,КонПериода);
	ЭтоПолныеПрава = РольДоступна("уб_ЗП_ПолныйДоступ");
	Если ЭтоПолныеПрава Тогда
		
		Если Объект.ВариантФормирования = 0 Тогда
			СписокСотрудниковАктуальныхВЭтомМесяце = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.ДатаФиксацииРасчетов);
		Иначе
			СписокСотрудниковАктуальныхВЭтомМесяце = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.РасчетныйПериод);
		КонецЕсли;	
		Элементы.ФизическоеЛицо.СписокВыбора.ЗагрузитьЗначения( СписокСотрудниковАктуальныхВЭтомМесяце.ВыгрузитьЗначения());
		Элементы.ФизическоеЛицо.КнопкаВыбора = Ложь;
		Элементы.ФизическоеЛицо.РедактированиеТекста = Истина;
	Иначе
		РедактированиеТекста = уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ИзменениеАгентаВПолисахИОплатах",ЛОЖЬ) и РольДоступна("ПолныеПрава");
		Если Не РедактированиеТекста Тогда
			Элементы.ФизическоеЛицо.РедактированиеТекста = РедактированиеТекста;
		КонецЕсли;	
		
		ОбновитьСписокСотрудников();	
		
	КонецЕсли;
	ЗаполнитьПериоды();
	
	ТабличныйДокумент = Сформировать();
	
КонецПроцедуры

#КонецОбласти


#Область КомандыФормы
&НаКлиенте
Процедура ОтобразитьВыбранныйРЛ(Команда)
	ТекущиеДанные = Элементы.Периоды.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Объект.ДатаФиксацииРасчетов 	= ТекущаяДата();
	Иначе		
		Объект.ДатаФиксацииРасчетов 	= ТекущиеДанные.Период;
	КонецЕсли;	
	ТабличныйДокумент = Сформировать();
КонецПроцедуры

Функция Сформировать()
	ОбработкаЛистов  = РеквизитФормыВЗначение("Объект");	
	ОбработкаЛистов.ВариантФормирования 	= 0;
	//ОбработкаЛистов.РасчетныйПериод 		= НачалоМесяца(ТекущаяДата());
	//ОбработкаЛистов.ДатаФиксацииРасчетов 	= ДатаФиксацииРасчетов;
	//ОбработкаЛистов.Организация 			= Справочники.Организации.ОсновнаяОрганизация();
	ОбработкаЛистов.Детально 				= Истина;
	//Если ЗначениеЗаполнено(Физлицо) Тогда
		ТабличныйДокумент = ОбработкаЛистов.СформироватьРасчетныеЛистки();
		ТабличныйДокумент.РазмерСтраницы = "A5";
		ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.ЭкземпляровНаСтранице=1;
		ТабличныйДокумент.Автомасштаб=истина;
	//Иначе
	//	ТабличныйДокумент = Новый ТабличныйДокумент;
	//	
	//КонецЕсли;
	Возврат ТабличныйДокумент;

КонецФункции	
#КонецОбласти

#Область СобытияЭлементовФорм
&НаКлиенте
Процедура ФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьПериоды()
КонецПроцедуры


&НаКлиенте
Процедура ПериодыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтобразитьВыбранныйРЛ(Элемент);
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеФункции

&НаСервере
Процедура ОбновитьСписокСотрудников()
	
	Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("Скрывать для замов ЗП сотрудников", Ложь) Тогда
		Элементы.ФизическоеЛицо.КнопкаСпискаВыбора = Ложь;
		Элементы.ФизическоеЛицо.КнопкаВыбора = Ложь;
		Элементы.ФизическоеЛицо.РедактированиеТекста = ЛОЖЬ;
		ФизическоеЛицо = ПараметрыСеанса.уб_ТекущееФизЛицо;
		Возврат
	КонецЕсли;	
	ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	//ПараметрыПодчиненных.ВключаяВыбывших 	= Истина;		
	уб_СС.ПодчиненныеРуководителя(,НачалоМесяца(НачалоМесяца(Период.ДатаОкончания-1)), ПараметрыПодчиненных);
	
	ПараметрыПодчиненных0 = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	//ПараметрыПодчиненных.ВключаяВыбывших 	= Истина;		
	
	уб_СС.ПодчиненныеРуководителя(,Период.ДатаОкончания, ПараметрыПодчиненных0);
	Элементы.ФизическоеЛицо.СписокВыбора.ЗагрузитьЗначения(ПараметрыПодчиненных.СписокСотрудников.ВыгрузитьЗначения());
	Для каждого ТекСотрудник из ПараметрыПодчиненных0.СписокСотрудников Цикл
		Если Элементы.ФизическоеЛицо.СписокВыбора.НайтиПоЗначению(ТекСотрудник.Значение) =Неопределено Тогда
			Элементы.ФизическоеЛицо.СписокВыбора.Добавить(ТекСотрудник);
		КонецЕсли;	
	КонецЦикла;	
	Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь) и не уб_КЭШируемые.ДоступностьРоли("уб_СотрудникОтделаБСО")  Тогда
		//Добавим курьеров
		ПоискПодразделение = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("СВС внешняя");
		СписокКурьеров = уб_кэшируемые.СписокСотрудниковПодразделения(ПоискПодразделение,КонецМесяца(ТекущаяДата()));
		Для каждого ТекСотрудник из СписокКурьеров Цикл
			Если Элементы.ФизическоеЛицо.СписокВыбора.НайтиПоЗначению(ТекСотрудник) = Неопределено Тогда
				Элементы.ФизическоеЛицо.СписокВыбора.Добавить(ТекСотрудник);
			КонецЕсли;	
		КонецЦикла;	
	Иначе	
	КонецЕсли;
	Для каждого ТекСотрудник из Элементы.ФизическоеЛицо.СписокВыбора Цикл
		ТекСотрудник.Представление = ""+ТекСотрудник.Значение;
	КонецЦикла;	
	Элементы.ФизическоеЛицо.СписокВыбора.СортироватьПоПредставлению();
	Если ПараметрыПодчиненных<>Неопределено Тогда
		Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			ФизическоеЛицо	= ПараметрыПодчиненных.Сотрудник;
			Подразделение 	= ПараметрыПодчиненных.ПодразделениеСотрудника;
			Организация		= ПараметрыПодчиненных.ОрганизацияСотрудника;
		КонецЕсли;
		
		Если ПараметрыПодчиненных.СписокСотрудников.Количество() <= 1 Тогда
			Элементы.ФизическоеЛицо.ТолькоПросмотр = Истина;
			Элементы.ФизическоеЛицо.КнопкаСпискаВыбора = Ложь;
		Иначе
			Элементы.ФизическоеЛицо.КнопкаСпискаВыбора = Истина;
		КонецЕсли;
	КонецЕсли;
	Элементы.ФизическоеЛицо.КнопкаВыбора = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериоды()
	
	Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	Нпериода = Период.ДатаНачала;
	Кпериода = КонецДня(Период.ДатаОкончания);
	Если Период.ДатаНачала = Дата(1,1,1)  Тогда
		Нпериода = Дата(1,1,1,0,0,1);	
	КонецЕсли;	
	Если Период.ДатаОкончания = Дата(1,1,1)  Тогда
		Кпериода = Макс(Дата(2020,1,1,0,0,1),КонецМесяца(ТекущаяДата()));
	КонецЕсли;	
	Если Кпериода >= Нпериода Тогда
	Иначе
		Сообщить("Ошибка в датах");
		Возврат;
	КонецЕсли;	
	ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	//ПараметрыПодчиненных.ВключаяВыбывших 	= Истина;		
	уб_СС.ПодчиненныеРуководителя(,НачалоМесяца(НачалоМесяца(Период.ДатаОкончания-1)), ПараметрыПодчиненных);
	
	Если ПараметрыПодчиненных <> Неопределено 
		И ПараметрыПодчиненных.СписокСотрудников.Количество() > 1 
		И ПараметрыПодчиненных.Сотрудник <> Объект.ФизическоеЛицо
		Тогда
		//это руководитель, но выбран его подчиненный - нужно определить его дату вступления в должность (последнюю)
		//СтрокаТЗ = ПараметрыПодчиненных.ТЗ.Найти(Объект.ФизическоеЛицо, "Сотрудник");
		Для Каждого СтрокаТЗ из ПараметрыПодчиненных.ТЗ Цикл
			Если СтрокаТЗ.Сотрудник = Объект.ФизическоеЛицо Тогда
				
				Если СтрокаТЗ <> Неопределено Тогда
					Запрос = Новый Запрос(
					"ВЫБРАТЬ
					|	РП.Период,
					|	РП.Подразделение
					|ИЗ
					|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Период, Подразделение = &Подразделение) КАК РП
					|ГДЕ
					|	РП.Сотрудник = &Сотрудник
					|	И НЕ РП.Уход");
					Запрос.УстановитьПараметр("Период", 		КПериода);
					Запрос.УстановитьПараметр("Подразделение", 	СтрокаТЗ.Подразделение);
					Запрос.УстановитьПараметр("Сотрудник",		ПараметрыПодчиненных.Сотрудник);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ПериодВступленияВДолжностьРуководителя = Выборка.Период
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДР.Период КАК Период
	|ИЗ
	|	РегистрСведений.уб_ДатыРасчетовССотрудниками КАК ДР
	|ГДЕ
	|	ДР.Активность
	|	И ДР.ФизическоеЛицо = &ФизическоеЛицо
	|	И ДР.Период >= &Дата1
	|	И ДР.Период <= &Дата2
	|	И &Условие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Объект.ФизическоеЛицо);					  
	Запрос.УстановитьПараметр("Дата1",			?(ЭтоПолныеПрава,Нпериода,Макс(Нпериода,Дата(2011,12,1))));					  
	Запрос.УстановитьПараметр("Дата2",			Кпериода);
	Если ПериодВступленияВДолжностьРуководителя <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ДР.Период >= &ПериодВступленияВДолжностьРуководителя");
		Запрос.УстановитьПараметр("ПериодВступленияВДолжностьРуководителя", ПериодВступленияВДолжностьРуководителя);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ИСТИНА");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	СписокВыплатЗП = Запрос.Выполнить().Выгрузить();	
	Строка = СписокВыплатЗП.Добавить();
	Строка.Период = КонецДня(ТекущаяДата());
	СписокВыплатЗП.Сортировать("Период");
	Периоды.Загрузить(СписокВыплатЗП);
	Если Периоды.Количество()>0 Тогда
		ТекущиеДанные = Периоды[Периоды.Количество() - 1];
		Элементы.Периоды.ТекущаяСтрока  = ТекущиеДанные.ПолучитьИдентификатор();
		Объект.ДатаФиксацииРасчетов 	= ТекущиеДанные.Период;
	Иначе
		Объект.ДатаФиксацииРасчетов 	= ТекущаяДата();;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОСравнении(Команда)
	
	
	ТекущаяОбласть 	= Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Расшифровка 	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх,1,ТекущаяОбласть.Верх,1).Расшифровка;	
	Структура = Новый Структура;
	Структура.Вставить("ЗарплатныйПериод", 	Расшифровка.РасчетныйПериод);
	Структура.Вставить("Менеджер",			Расшифровка.Менеджер);
	УИД = УникальныйИдентификатор2(Структура.Менеджер);
	УИД = УИД + Структура.ЗарплатныйПериод;
	Если Расшифровка.Период <> Расшифровка.РасчетныйПериод Тогда
		//В режиме сравнения
		ПриведеннаяДатаСреза1 = Расшифровка.ПредДатаФиксации;
		ПриведеннаяДатаСреза2 = Расшифровка.ДатаФиксации;
		ТД = ТекущаяДата();
		Если Не ЗначениеЗаполнено(ПриведеннаяДатаСреза1) Тогда
			ПриведеннаяДатаСреза1 = ТД;
		Конецесли;	
		Если Не ЗначениеЗаполнено(ПриведеннаяДатаСреза2) Тогда
			ПриведеннаяДатаСреза2 = ТД;
		Конецесли;	
		Минимум 	= Мин(ПриведеннаяДатаСреза1,	ПриведеннаяДатаСреза2);
		Максимум    = Макс(ПриведеннаяДатаСреза1,   ПриведеннаяДатаСреза2);
		Если НачалоДня(Максимум) = НачалоДня(ТекущаяДата()) Тогда
			Максимум = Дата(1, 1, 1)
		КонецЕсли;
		//Ограничение по дате началаведения истории
		Минимум = Макс(Минимум, Дата(2011,12,25,1,1,1));
		Структура.Вставить("ДатаСреза", 		Минимум);
		Структура.Вставить("РежимОтчета",   	1);
		Структура.Вставить("датаСреза1",		Минимум);
		Структура.Вставить("датаСреза2",		Максимум);
		Структура.Вставить("ТолькоСОтличиями",  Истина);
		Структура.Вставить("Сформровать",  Истина);
		
		УИД = УИД + Минимум + Максимум;
	Конецесли;
	ОткрытьФорму("Обработка.уб_РасчетВМ.Форма.ФормаУправляемая",Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюОплат(Команда)
	ТекущаяОбласть 	= Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Расшифровка 	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх,1,ТекущаяОбласть.Верх,1).Расшифровка;	
	Доступно 		= ТипЗНЧ(Расшифровка) = Тип("Структура");
	Если Доступно Тогда
		Структура = Новый Структура;
		Структура.Вставить("Менеджер", 			Расшифровка.Менеджер);
		Структура.Вставить("РасчетныйПериод",   Расшифровка.РасчетныйПериод);
		УИД = Строка(УникальныйИдентификатор2(Структура.Менеджер)) + Структура.РасчетныйПериод;
		Структура.Вставить("ФильтрПоПериоду",	Истина);
		ПриведеннаяДатаСреза1 = Расшифровка.ПредДатаФиксации;
		ПриведеннаяДатаСреза2 = Расшифровка.ДатаФиксации;
		ТД = ТекущаяДата();
		Если Не ЗначениеЗаполнено(ПриведеннаяДатаСреза1) Тогда
			ПриведеннаяДатаСреза1 = ТД;
		Конецесли;	
		Если Не ЗначениеЗаполнено(ПриведеннаяДатаСреза2) Тогда
			ПриведеннаяДатаСреза2 = ТД;
		Конецесли;	
		Минимум = Мин(ПриведеннаяДатаСреза1,ПриведеннаяДатаСреза2);
		Максимум = Макс(ПриведеннаяДатаСреза1,ПриведеннаяДатаСреза2);
		//Ограничение по дате началаведения истории
		Минимум = Макс(Минимум,Дата(2011,12,25,1,1,1));
		Максимум = Макс(Максимум,Дата(2011,12,25,1,1,1));
		Структура.Вставить("НачПериода", Минимум);
		Структура.Вставить("КонПериода", Максимум);
		Структура.Вставить("Сформровать",  Истина);
		УИД = УИД + Минимум + Максимум;
		
		ОткрытьФорму("Отчет.уб_ОтчетПоПравкамОплатДляЗП.Форма.ФормаУправляемая",Структура);
		//Форма = Отчеты.уб_ОтчетПоПравкамОплатДляЗП.ПолучитьФорму(,, УИД);
		//ЗаполнитьЗначенияСвойств(Форма, Структура);
		//Если Форма.Открыта() Тогда
		//	Форма.Активизировать();
		//Иначе
		//	Форма.Открыть();
		//КонецЕсли;
	Конецесли;
	

КонецПроцедуры


&НаСервереБезКонтекста
Функция УникальныйИдентификатор2(Менеджер)
	Возврат Строка(Менеджер.УникальныйИдентификатор())
КонецФункции	


#КонецОбласти


