Функция СформироватьРасчетныйЛисток(Физлицо, ИмяФайла = "",какPDF = Ложь) экспорт
	УстановитьПривилегированныйРежим(Истина);
	ОбработкаЛистов  = Обработки.уб_РасчетныеЛистки.Создать();	
	ОбработкаЛистов.ВариантФормирования 	= 0;
	ОбработкаЛистов.РасчетныйПериод 		= НачалоМесяца(ТекущаяДата());
	ОбработкаЛистов.ДатаФиксацииРасчетов 	= ТекущаяДата();
	ОбработкаЛистов.Организация 			= Справочники.Организации.ОсновнаяОрганизация();
	ОбработкаЛистов.ФизическоеЛицо 			= Физлицо;
	ОбработкаЛистов.Детально 				= Истина;
	Если ЗначениеЗаполнено(Физлицо) Тогда
		ТабличныйДокумент = ОбработкаЛистов.СформироватьРасчетныеЛистки();
		ТабличныйДокумент.РазмерСтраницы = "A5";
		ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.ЭкземпляровНаСтранице=1;
		ТабличныйДокумент.Автомасштаб=истина;
	Иначе
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
	КонецЕсли;	
	Если ИмяФайла = "" Тогда
		Возврат ТабличныйДокумент;
	Иначе
		Попытка
			Если какPDF = Истина Тогда
				ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
			Иначе
				ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
			КонецЕсли;	
			Возврат Истина
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
КонецФункции	