
// Процедура дополняет массив отсутствующими элементами
//
// Параметры:
// МассивФизлиц  - массив, который дополняем
// Источник      - таблица, из которой берутся значения
// ИмяКолонки    - имя колонки, в которой содержатся проверяемые значения
Процедура ДополнитьМассивПоТаблице(МассивФизлиц, Источник, ИмяКолонки)
	
	ВремТаблица	= Источник.Скопировать(,ИмяКолонки	);	
	ВремТаблица.Свернуть (ИмяКолонки);
	Для каждого Строка из ВремТаблица Цикл
		Если МассивФизлиц.Найти(Строка[ИмяКолонки]) = Неопределено Тогда
			МассивФизлиц.Добавить(Строка[ИмяКолонки]);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьМассивФизлицПоОстаткамНаДату(Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФормирования();
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаОстатка", Параметры.ДатаФиксацииРасчетов);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_РасчетыСФЛПоЗПОстатки.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.уб_РасчетыСФЛПоЗП.Остатки(&ДатаОстатка, 1 = 1) КАК уб_РасчетыСФЛПоЗПОстатки
	|ГДЕ
	|	уб_РасчетыСФЛПоЗПОстатки.СуммаОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	уб_РасчетыСФЛПоЗПОстатки.ФизическоеЛицо.Наименование";
	// TODO в данный момент не получает по организации 
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
	   Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Организация = &Организация");
	 КонецЕсли;	   
	СписокФизЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");			   
	Возврат СписокФизЛиц;
	
КонецФункции	

Функция СформироватьПоДатеФиксации(ТабличныйДокумент = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФормирования();
	КонецЕсли;	
	Если ТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;	
	ТабличныйДокумент.ТолькоПросмотр 		= Истина;
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	ТабличныйДокумент.ОтображатьСетку 		= Ложь;
	ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
	
	СписокФизЛиц = ПолучитьСписокЛиц(Параметры.ФизическоеЛицо);
	ВсегоВМассиве  = СписокФизЛиц.Количество();
	Если ВсегоВМассиве = 0 Тогда
		#Если Клиент Тогда
			Предупреждение("Пустой список физлиц!");
		#КонецЕсли
		Возврат ТабличныйДокумент;
	КонецЕсли;	
	Макет 	= ПолучитьМакет("РасчетныйЛисток");
	Шапка	= Макет.ПолучитьОбласть("ШапкаФиксация|ОсновнаяКолонка");
	Инфо	= Макет.ПолучитьОбласть("Инфострока|ОсновнаяКолонка");
	Если  Параметры.Модифицированность Тогда
		Инфо.Параметры.Инфострока = "Документ модифицирован. Дата печати: " + ТекущаяДата();
	Иначе
		Инфо.Параметры.Инфострока = "Дата печати: " + ТекущаяДата();
	КонецЕсли;	
	Заголовок 	= Макет.ПолучитьОбласть("РазделРасчетногоЛиста|ОсновнаяКолонка");
	Строка		= Макет.ПолучитьОбласть("СтрокаРаздела|ОсновнаяКолонка");
	Разрыв    	= Макет.ПолучитьОбласть("Разрыв|ОсновнаяКолонка");	
	Для СчетчикФл = 1 по ВсегоВМассиве Цикл
		Сотрудник 		= СписокФизЛиц[СчетчикФл - 1];
		_Подразделение  = Уб_СС.ПолучитьПодразделениеАгента(Сотрудник);
		_Организация 	= _Подразделение.Владелец;
		Шапка.Параметры.ФизическоеЛицо 	= Сотрудник;
		Шапка.Параметры.Подразделение 	= _Подразделение;
		Шапка.Параметры.Организация 	= _Организация;
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_ДатыРасчетовССотрудникамиСрезПоследних.Дата как ДатаФиксации
		|ИЗ
		|	РегистрСведений.уб_ДатыРасчетовССотрудниками.СрезПоследних(&ДатаСреза, ФизическоеЛицо = &ФизическоеЛицо) КАК уб_ДатыРасчетовССотрудникамиСрезПоследних";
		//Берем границу на момент до новой даты фиксации		
		ГраницаНовая   = Новый Граница(Параметры.ДатаФиксацииРасчетов, ВидГраницы.Исключая);
		Запрос.УстановитьПараметр("ДатаСреза",		ГраницаНовая);
		Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
		ПредыдущаяДатаФиксации = Дата(1, 1, 1, 1, 1, 1);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПредыдущаяДатаФиксации = Выборка.ДатаФиксации;
		КонецЕсли;	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Isnull(уб_РасчетыСФЛПоЗПОстатки.СуммаОстаток,0)) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уб_РасчетыСФЛПоЗП.Остатки(&ДатаОстатка, 1 = 1 И ФизическоеЛицо=&ФизическоеЛицо) КАК уб_РасчетыСФЛПоЗПОстатки";
		Если Параметры.ВестиУчетЗПВРазрезеОрганизаций Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		КонецЕсли;	
		//Берем остаток на момент после предыдущей даты фиксации, с учетом выплаты
		ГраницаПредыдущая   = Новый Граница(ПредыдущаяДатаФиксации, ВидГраницы.Включая);
		Запрос.УстановитьПараметр("ДатаОстатка", 	ГраницаПредыдущая);
		Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
		Выборка = Запрос.Выполнить().Выбрать();
		СальдоНаПредДатуФиксации = 0;
		Если  Выборка.Следующий() Тогда
			СальдоНаПредДатуФиксации = Выборка.СуммаОстаток;
		КонецЕсли;			
		Шапка.Параметры.ДатаФиксацииРасчетов 		= ?(ПредыдущаяДатаФиксации = Дата(1,1,1,1,1,1), " не фиксировалась", ПредыдущаяДатаФиксации);
		Шапка.Параметры.СальдоНаПредДатуФиксации 	= СальдоНаПредДатуФиксации;
		ТабличныйДокумент.Вывести(Шапка);
		ТабличныйДокумент.Вывести(Инфо);
		Заголовок.Параметры.Период 				= "Дата операции";
		Заголовок.Параметры.ЗаголовокРаздела 	= "Примечание";	
		
		ОстатокНаТекущуюДатуФиксации = СальдоНаПредДатуФиксации;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_РасчетыСФЛПоЗП.Организация,
		|	уб_РасчетыСФЛПоЗП.ФизическоеЛицо,
		|	уб_РасчетыСФЛПоЗП.Период КАК Период,
		|	уб_РасчетыСФЛПоЗП.РасчетныйПериод КАК РасчетныйПериод,
		|	СУММА(ВЫБОР
		|			КОГДА уб_РасчетыСФЛПоЗП.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -уб_РасчетыСФЛПоЗП.Сумма
		|			ИНАЧЕ уб_РасчетыСФЛПоЗП.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|			ТОГДА 0
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Раздел,
		|	ВЫБОР
		|		КОГДА &Детально
		|			ТОГДА ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|					ТОГДА ""Начисления""
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|					ТОГДА ""Удержания""
		|				ИНАЧЕ ""Выплаты""
		|			КОНЕЦ
		|	КОНЕЦ КАК Описание,
		|	уб_РасчетыСФЛПоЗП.Раздел КАК РазделФакт,
		|	уб_РасчетыСФЛПоЗП.ВидДвижения,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел = 21
		|			ТОГДА ""Выплачено""
		|		КОГДА уб_РасчетыСФЛПоЗП.ВидНачисления = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ уб_РасчетыСФЛПоЗП.ВидНачисления
		|	КОНЕЦ КАК ВидНачисления,
		|	уб_РасчетыСФЛПоЗП.Активность
		|ИЗ
		|	РегистрНакопления.уб_РасчетыСФЛПоЗП КАК уб_РасчетыСФЛПоЗП
		|ГДЕ
		|	уб_РасчетыСФЛПоЗП.Период > &НачПериода
		|	И уб_РасчетыСФЛПоЗП.Период <= &КонПериода
		|	И уб_РасчетыСФЛПоЗП.ФизическоеЛицо = &ФизическоеЛицо
		|	И 1 = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_РасчетыСФЛПоЗП.Организация,
		|	уб_РасчетыСФЛПоЗП.ФизическоеЛицо,
		|	уб_РасчетыСФЛПоЗП.Период,
		|	уб_РасчетыСФЛПоЗП.РасчетныйПериод,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|			ТОГДА 0
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &Детально
		|			ТОГДА ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|					ТОГДА ""Начисления""
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|					ТОГДА ""Удержания""
		|				ИНАЧЕ ""Выплаты""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	уб_РасчетыСФЛПоЗП.Раздел,
		|	уб_РасчетыСФЛПоЗП.ВидДвижения,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел = 21
		|			ТОГДА ""Выплачено""
		|		КОГДА уб_РасчетыСФЛПоЗП.ВидНачисления = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ уб_РасчетыСФЛПоЗП.ВидНачисления
		|	КОНЕЦ,
		|	уб_РасчетыСФЛПоЗП.Активность";
		Если Параметры.ВестиУчетЗПВРазрезеОрганизаций Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "уб_РасчетыСФЛПоЗП.Организация = &Организация");			   
			Запрос.УстановитьПараметр("КонПериода", Параметры.Организация);
		КонецЕсли;	
		Запрос.УстановитьПараметр("НачПериода",	ПредыдущаяДатаФиксации);
		Запрос.УстановитьПараметр("КонПериода",	Параметры.ДатаФиксацииРасчетов);		
		Запрос.УстановитьПараметр("Детально",	Параметры.Детально);		
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		ВидыНачислений = ТаблицаДвижений.Скопировать();
		ВидыНачислений.Свернуть("ВидНачисления","Сумма");
		ВидыНачислений.Сортировать("ВидНачисления,Сумма");
		ИндексНачисления = Новый  Соответствие;
		ШиринаТаблицы = ТабличныйДокумент.ШиринаТаблицы;
		ВсегоНачислений = 0;
		Если НеРазворачивать = Ложь Тогда
		Для каждого строкаВида из ВидыНачислений Цикл
			Если строкаВида.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			ВсегоНачислений=ВсегоНачислений+1;
			Область = Макет.ПолучитьОбласть("ИнфоСтрока|ДопКолонка");
			ТабличныйДокумент.Присоединить(Область);
			ИндексНачисления.Вставить(строкаВида.ВидНачисления,ВсегоНачислений);
		КонецЦикла;	
		Если ВсегоНачислений > 0 Тогда
			Область = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы,ШиринаТаблицы+1,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы);
			Область.Объединить();
			Область.Текст = "Разворот по видам начислений и удержаний";
			Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Заголовок);
		Если НеРазворачивать = Ложь Тогда
		Для каждого строкаВида из ВидыНачислений Цикл
			Если строкаВида.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("РазделРасчетногоЛиста|ДопКолонка");
			Область.Параметры.ВидНачисления = строкаВида.ВидНачисления;
			
			ТабличныйДокумент.Присоединить(Область);
		КонецЦикла;	
		КонецЕсли;
		//Выборка = Запрос.Выполнить().Выбрать();		
		//Пока Выборка.Следующий() Цикл 
		Для каждого Выборка из ТаблицаДвижений Цикл
			//Раздел 0 - Начисления
			//Раздел 1 - Удержания
			//Раздел 2 - Выплаты
			Если ВключатьАВ = Ложь  Тогда
				Если Выборка.Активность = Ложь Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Если Выборка.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;	

			
			Строка.Параметры.Период  				= Выборка.Период;
			Строка.Параметры.НаименованиеПоказателя = СокрЛП(Выборка.Описание) + ?(Выборка.Раздел = 2, "", " за " + Формат(Выборка.РасчетныйПериод, "ДФ='MMMM yyyy'"));
			СуммаСтроки = (Выборка.Сумма);// * ?(Выборка.ВидДвижения = ВидДвиженияНакопления.Расход, -1, 1));//знак в запросе
			Строка.Параметры.ЗначениеПоказателя = СуммаСтроки; 
			Подобласть = Строка.Область("Сумма");
			Расшифровка ="";
			Если Выборка.РазделФакт = 2 Или Выборка.РазделФакт = 12 Или Выборка.РазделФакт = 3 Тогда
				Расшифровка = Новый Структура;
				Расшифровка.Вставить("ДатаФиксации",		Параметры.ДатаФиксацииРасчетов);
				Расшифровка.Вставить("Период",				Выборка.Период);
				Расшифровка.Вставить("ПредДатаФиксации",	ПредыдущаяДатаФиксации);
				Расшифровка.Вставить("РасчетныйПериод",		Выборка.РасчетныйПериод);
				Расшифровка.Вставить("Менеджер",			Сотрудник);
				Расшифровка.Вставить("РазделФакт",			Выборка.РазделФакт);
				Подобласть.Примечание.Текст = "Доступна расшифровка (см. правой кнопкой)";
			Иначе
				Подобласть.Примечание.Текст = "";
			КонецЕсли;	
			Строка.Параметры.Расшифровка = Расшифровка;
			Если Выборка.Активность = Ложь Тогда
				Строка.Область().ЦветТекста = Новый Цвет(100,100,100); 
			Иначе
				Строка.Область().ЦветТекста = Новый Цвет(); 
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Строка);
			Если Выборка.Активность = Истина Тогда
				ОстатокНаТекущуюДатуФиксации = ОстатокНаТекущуюДатуФиксации + СуммаСтроки;
			Иначе
			КонецЕсли;	
			Если НеРазворачивать = Ложь Тогда
			Для каждого строкаВида из ВидыНачислений Цикл
				Если строкаВида.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				допКСтроке		= Макет.ПолучитьОбласть("СтрокаРаздела|ДопКолонка");
				Если строкаВида.ВидНачисления = Выборка.ВидНачисления Тогда
					допКСтроке.Параметры.ЗначениеПоказателя =СуммаСтроки 
				КонецЕсли;
				ТабличныйДокумент.Присоединить(допКСтроке);
			КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Разрыв.Параметры.ДатаФиксацииРасчетов 			= Параметры.ДатаФиксацииРасчетов;
		Разрыв.Параметры.ОстатокНаТекущуюДатуФиксации 	= ОстатокНаТекущуюДатуФиксации;
     	ТабличныйДокумент.Вывести(Разрыв);
		Если НеРазворачивать = Ложь Тогда
			ИтогоБезВыплат = 0;
			ЕстьВыплаты = Ложь;
			Для каждого строкаВида из ВидыНачислений Цикл
				Если строкаВида.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				допКРазрыв		= Макет.ПолучитьОбласть("Разрыв|ДопКолонка");
				допКРазрыв.Параметры.ИтогоПоВиду = строкаВида.Сумма;
				ТабличныйДокумент.Присоединить(допКРазрыв);
				Если НЕ строкаВида.ВидНачисления = "Выплачено" Тогда
					ИтогоБезВыплат = ИтогоБезВыплат + строкаВида.Сумма;
				Иначе
					ЕстьВыплаты	= Истина;
				Конецесли;	
			КонецЦикла;
			Если ВидыНачислений.Количество()> 0 Тогда
				Область = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы-2,ШиринаТаблицы+1+?(ЕстьВыплаты =Истина,1,0),ТабличныйДокумент.ВысотаТаблицы-2,ТабличныйДокумент.ШиринаТаблицы);
				Область.Объединить();
				Область.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Точечная);
				Область.Текст = "Начислено всего: "+ Формат(ИтогоБезВыплат,"ЧЦ=15; ЧДЦ=2");
				Область.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьСписокЛиц(_ФизическоеЛицо = Неопределено)
	
	Если _ФизическоеЛицо = Неопределено Тогда
		_ФизическоеЛицо = ФизическоеЛицо
	КонецЕсли;
	Если ЗначениеЗаполнено(_ФизическоеЛицо) Тогда
		Если _ФизическоеЛицо.ЭтоГруппа Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И НЕ ФизическиеЛица.ЭтоГруппа");
			Запрос.УстановитьПараметр("Ссылка", Неопределено);
			Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Иначе	
			Если _ФизическоеЛицо.Пустая() Тогда
				Результат = ПолучитьМассивФизлицПоОстаткамНаДату();
			Иначе
				Результат  = Новый Массив;
				Результат.Добавить(_ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;	
	Иначе
		Результат = ПолучитьМассивФизлицПоОстаткамНаДату();	
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

Функция ДвиженияСовершенныеЗаПериод(ТабличныйДокумент = Неопределено, Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФормирования();
	КонецЕсли;
	Если ТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	ТабличныйДокумент.ТолькоПросмотр 		= Истина;
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	ТабличныйДокумент.ОтображатьСетку 		= Ложь;
	ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
	СписокФизЛиц = ПолучитьСписокЛиц(Параметры.ФизическоеЛицо);
	ВсегоВМассиве = СписокФизЛиц.Количество();
	Если ВсегоВМассиве = 0 Тогда
		#Если Клиент Тогда
			Предупреждение("Пустой список физлиц!");
		#КонецЕсли
		Возврат ТабличныйДокумент;
	КонецЕсли;	
	Макет 		= ПолучитьМакет("ДвиженияСовершенныеЗаПериод");	
	Шапка     	= Макет.ПолучитьОбласть("ШапкаДвижения");
	Инфо      	= Макет.ПолучитьОбласть("Инфострока");
	Заголовок 	= Макет.ПолучитьОбласть("РазделРасчетногоЛиста");
	Строка    	= Макет.ПолучитьОбласть("СтрокаРаздела");
	Разрыв    	= Макет.ПолучитьОбласть("Разрыв");	
	Если Параметры.Модифицированность Тогда
		Инфо.Параметры.Инфострока = "Документ модифицирован. Дата печати: " + ТекущаяДата();
	Иначе
		Инфо.Параметры.Инфострока = "Дата печати: " + ТекущаяДата();
	КонецЕсли;
	Для СчетчикФл = 1 по ВсегоВМассиве Цикл
		Сотрудник = СписокФизЛиц[СчетчикФл - 1];		
		_Подразделение  = Уб_СС.ПолучитьПодразделениеАгента(Сотрудник);
		_Организация = _Подразделение.Владелец;		
		//--------------------ШАПКА-------------------------------------
		Запрос = Новый Запрос();
		НачальнаяДата = НачалоМесяца(Параметры.РасчетныйПериод);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Isnull(уб_РасчетыСФЛПоЗПОстатки.СуммаОстаток,0)) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уб_РасчетыСФЛПоЗП.Остатки(&ДатаОстатка, Организация = &Организация И ФизическоеЛицо=&ФизическоеЛицо) КАК уб_РасчетыСФЛПоЗПОстатки";		
		//Берем остаток на начало месяца 
		//ГраницаПредыдущая   = Новый Граница(НачальнаяДата,ВидГраницы.Исключая);
		//
		Запрос.УстановитьПараметр("ДатаОстатка",	НачальнаяДата);
		Запрос.УстановитьПараметр("Организация",	Параметры.Организация);
		Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
		Выборка = Запрос.Выполнить().Выбрать();
		СальдоНачальное = 0;
		Если  Выборка.Следующий() Тогда
			СальдоНачальное = Выборка.СуммаОстаток;
		КонецЕсли;	
		Шапка.Параметры.ФизическоеЛицо 				= Сотрудник;
		Шапка.Параметры.Подразделение 				= _Подразделение;
		Шапка.Параметры.Организация 				= _Организация;
		Шапка.Параметры.РасчетныйПериод 			= Формат(Параметры.РасчетныйПериод,"ДФ='MMMM yyyy'");
		Шапка.Параметры.НачалоПериода 				= Формат(НачальнаяДата,"ДЛФ=DD");
		Шапка.Параметры.СальдоНаПредДатуФиксации 	= СальдоНачальное;
		ТабличныйДокумент.Вывести(Шапка);		
		//--------------------ИНФО-------------------------------------
		ТабличныйДокумент.Вывести(Инфо);		
		//--------------------ЗАГОЛОВОК-------------------------------------
		Заголовок.Параметры.Период 				= "Дата операции";
		Заголовок.Параметры.ЗаголовокРаздела 	= "Примечание";
		ТабличныйДокумент.Вывести(Заголовок);
		ОстатокНаКонецПериода = СальдоНачальное;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_РасчетыСФЛПоЗП.Организация,
		|	уб_РасчетыСФЛПоЗП.ФизическоеЛицо,
		|	уб_РасчетыСФЛПоЗП.Период КАК Период,
		|	уб_РасчетыСФЛПоЗП.РасчетныйПериод КАК РасчетныйПериод,
		|	СУММА(уб_РасчетыСФЛПоЗП.Сумма) КАК Сумма,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|			ТОГДА 0
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Раздел,
		|	ВЫБОР
		|		КОГДА &Детально
		|			ТОГДА ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|					ТОГДА ""Начисления""
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|					ТОГДА ""Удержания""
		|				ИНАЧЕ ""Выплаты""
		|			КОНЕЦ
		|	КОНЕЦ КАК Описание
		|ИЗ
		|	РегистрНакопления.уб_РасчетыСФЛПоЗП КАК уб_РасчетыСФЛПоЗП
		|ГДЕ
		|	уб_РасчетыСФЛПоЗП.Период >= &НачПериода
		|	И уб_РасчетыСФЛПоЗП.Период <= &КонПериода
		|	И уб_РасчетыСФЛПоЗП.ФизическоеЛицо = &ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_РасчетыСФЛПоЗП.Организация,
		|	уб_РасчетыСФЛПоЗП.ФизическоеЛицо,
		|	уб_РасчетыСФЛПоЗП.Период,
		|	уб_РасчетыСФЛПоЗП.РасчетныйПериод,
		|	ВЫБОР
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|			ТОГДА 0
		|		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &Детально
		|			ТОГДА ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
		|					ТОГДА ""Начисления""
		|				КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
		|					ТОГДА ""Удержания""
		|				ИНАЧЕ ""Выплаты""
		|			КОНЕЦ
		|	КОНЕЦ";
		Запрос.УстановитьПараметр("НачПериода",	НачальнаяДата);
		Запрос.УстановитьПараметр("КонПериода",	КонецМесяца(НачальнаяДата));
		Запрос.УстановитьПараметр("Детально",	Параметры.Детально);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//--------------------СТРОКА-------------------------------------
			Строка.Параметры.Период  				= Выборка.Период;
			Строка.Параметры.НаименованиеПоказателя = СокрЛП(Выборка.Описание) + ?(Выборка.Раздел = 2, "", " за " + Формат(Выборка.РасчетныйПериод, "ДФ='MMMM yyyy'"));
			СуммаСтроки = (Выборка.Сумма * ?(Выборка.Раздел = 0, 1, -1));
			Строка.Параметры.ЗначениеПоказателя = СуммаСтроки; 
			ТабличныйДокумент.Вывести(Строка);
			ОстатокНаКонецПериода = ОстатокНаКонецПериода+СуммаСтроки;
		КонецЦикла;
		Разрыв.Параметры.ДатаФиксацииРасчетов 			= Формат(КонецМесяца(НачальнаяДата),"ДЛФ=DD");
		Разрыв.Параметры.ОстатокНаТекущуюДатуФиксации 	= ОстатокНаКонецПериода;
     	ТабличныйДокумент.Вывести(Разрыв);
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
КонецФункции	
// Функция возвращает сформированный табличный документ с расчетными листками
//
// Параметры:
// РасчетныйПериод - расчетный период, по которуму выводятся листки
// СписокФизЛиц    - список физлиц или само физлицо, для которых(ого) выводятся расчетные листки,
//                   если не задан для всех
Функция СформироватьРасчетныеЛистки(ТабличныйДокумент = Неопределено, Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФормирования();
	КонецЕсли;
	Если Параметры.ВариантФормирования = 0 Тогда
		//Стандартные расчетные листки, от последней даты выплаты
		Результат = СформироватьПоДатеФиксации(ТабличныйДокумент, Параметры)
	ИначеЕсли Параметры.ВариантФормирования = 1 Тогда
		//все изменения, которые произошли за календарный месяц
		Результат = ДвиженияСовершенныеЗаПериод(ТабличныйДокумент, Параметры)	
	Иначе
		//все изменения, которые относятся к зарплатному периоду
		Результат = СформироватьПоПериоду(ТабличныйДокумент, Параметры);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция СформироватьПоПериоду (ТабличныйДокумент = Неопределено, Параметры = Неопределено)

	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФормирования();
	КонецЕсли;
	СписокФизЛиц = ПолучитьСписокЛиц();	
	Если ТабличныйДокумент  = Неопределено Тогда
		ТабличныйДокумент  = Новый ТабличныйДокумент;
	КонецЕсли;
	ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
	
	Макет = ПолучитьМакет("ДвиженияОтносящиесяКПериоду");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьРаздел 	= Макет.ПолучитьОбласть("РазделРасчетногоЛиста");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("СтрокаРаздела");
	ОбластьРазрыв 	= Макет.ПолучитьОбласть("Разрыв1");
	ОбластьИнфо		= Макет.ПолучитьОбласть("Инфострока");
	Если Параметры.Модифицированность Тогда
		ОбластьИнфо.Параметры.Инфострока = "Документ модифицирован. Дата печати: " + ТекущаяДата();
	Иначе
		ОбластьИнфо.Параметры.Инфострока = "Дата печати: " + ТекущаяДата();
	КонецЕсли;	
	ВсегоФизЛиц = СписокФизЛиц.Количество();
	стрРасчетныйПериод = Формат(Параметры.РасчетныйПериод, "ДФ='MMMM yyyy'");
	ЗапросНачисления = Новый Запрос(
	"ВЫБРАТЬ
	|	Вложенный.Сотрудник,
	|	Вложенный.Начисление,
	|	Вложенный.Сумма,
	|	Вложенный.Период КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		Начисления.Сотрудник КАК Сотрудник,
	|		Начисления.Начисление КАК Начисление,
	|		СУММА(Начисления.Результат) КАК Сумма,
	|		Начисления.Период КАК Период
	|	ИЗ
	|		Документ.уб_НачислениеЗП.Начисления КАК Начисления
	|	ГДЕ
	|		Начисления.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начисления.Сотрудник,
	|		Начисления.Начисление,
	|		Начисления.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленияРазовые.Сотрудник,
	|		НачисленияРазовые.Начисление,
	|		СУММА(НачисленияРазовые.Результат),
	|		НачисленияРазовые.Период
	|	ИЗ
	|		Документ.уб_НачислениеЗП.НачисленияРазовые КАК НачисленияРазовые
	|	ГДЕ
	|		НачисленияРазовые.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачисленияРазовые.Сотрудник,
	|		НачисленияРазовые.Начисление,
	|		НачисленияРазовые.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВознаграждениеЗаПродажи.Сотрудник,
	|		ВознаграждениеЗаПродажи.Начисление,
	|		СУММА(ВознаграждениеЗаПродажи.Результат),
	|		ВознаграждениеЗаПродажи.Период
	|	ИЗ
	|		Документ.уб_НачислениеЗП.ВознаграждениеЗаПродажи КАК ВознаграждениеЗаПродажи
	|	ГДЕ
	|		ВознаграждениеЗаПродажи.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВознаграждениеЗаПродажи.Сотрудник,
	|		ВознаграждениеЗаПродажи.Начисление,
	|		ВознаграждениеЗаПродажи.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВознаграждениеКурьеров.Сотрудник,
	|		""Вознаграждение курьера"",
	|		СУММА(ВознаграждениеКурьеров.Результат),
	|		ВознаграждениеКурьеров.Период
	|	ИЗ
	|		Документ.уб_НачислениеЗП.ВознаграждениеКурьеров КАК ВознаграждениеКурьеров
	|	ГДЕ
	|		ВознаграждениеКурьеров.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВознаграждениеКурьеров.Сотрудник,
	|		ВознаграждениеКурьеров.Начисление,
	|		ВознаграждениеКурьеров.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВознаграждениеКурьеров.ИсточникФинансирования,
	|		""Удержание за курьеров"",
	|		СУММА(-ВознаграждениеКурьеров.РезультатДляИсточника),
	|		ВознаграждениеКурьеров.Период
	|	ИЗ
	|		Документ.уб_НачислениеЗП.ВознаграждениеКурьеров КАК ВознаграждениеКурьеров
	|	ГДЕ
	|		ВознаграждениеКурьеров.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВознаграждениеКурьеров.ИсточникФинансирования,
	|		ВознаграждениеКурьеров.Начисление,
	|		ВознаграждениеКурьеров.Период) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	//ДокументНачисления = Документы.уб_НачислениеЗП.СоздатьДокумент().ПолучитьДокументНачисленияЗаПериод(РасчетныйПериод,Организация,Ложь);
	ДокументНачисления = Документы.уб_НачислениеЗП.ПолучитьДокументНачисленияЗаПериод(Параметры.РасчетныйПериод, Параметры.Организация, Ложь);
	Если ДокументНачисления = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Не обнаружено начислений в этом расчетном периоде",5);
		#КонецЕсли	
		Возврат ТабличныйДокумент;
	КонецЕсли;	
	ДокументНачисления = ДокументНачисления.Ссылка;
	ЗапросНачисления.УстановитьПараметр("Ссылка",ДокументНачисления );								
	ТаблицаНачислений = ЗапросНачисления.Выполнить().Выгрузить();
	Для СчетчикФизЛиц = 0 по ВсегоФизЛиц-1 Цикл  
		ТекущееФизЛицо	= СписокФизЛиц[СчетчикФизЛиц];
		Подразделение  	= Уб_СС.ПолучитьПодразделениеАгента(ТекущееФизЛицо);
		Организация 	= Подразделение.Владелец;
		Параметры.Организация = Организация;
		ОбластьШапка.Параметры.ФизическоеЛицо 	= ТекущееФизЛицо.Ссылка;
		ОбластьШапка.Параметры.Подразделение 	= Подразделение;
		ОбластьШапка.Параметры.Организация 		= Параметры.Организация;
		ОбластьШапка.Параметры.РасчетныйПериод 	= стрРасчетныйПериод;
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьИнфо);		
		СтруктураПоиска = Новый Структура("Сотрудник", ТекущееФизЛицо);
		МассивСтрокНачислено 		= ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
		КоличествоСтрокНачислено 	= МассивСтрокНачислено.Количество() ;
		ИтогоНачислено = 0;
		Если КоличествоСтрокНачислено>0 Тогда			
			ОбластьРаздел.Параметры.ЗаголовокРаздела = "Вид начисления";
			ТабличныйДокумент.Вывести(ОбластьРаздел);
			Для счетчикНачислений = 0 по КоличествоСтрокНачислено-1 Цикл
				СтрокаНачисления = МассивСтрокНачислено[счетчикНачислений];
				ОбластьСтрока.Параметры.НаименованиеПоказателя 	= СокрЛП(СтрокаНачисления.Начисление);
				ОбластьСтрока.Параметры.ЗначениеПоказателя 		= СтрокаНачисления.Сумма;
				ОбластьСтрока.Параметры.Период 					= СтрокаНачисления.Период;
				ТабличныйДокумент.Вывести(ОбластьСтрока);				
				ИтогоНачислено = ИтогоНачислено + СтрокаНачисления.Сумма; 				
			КонецЦикла;	
		КонецЕсли;
		ОбластьРазрыв.Параметры.ИтогоНачислено = ИтогоНачислено;
		ТабличныйДокумент.Вывести(ОбластьРазрыв);			
	КонецЦикла;		
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	ТабличныйДокумент.ОтображатьСетку 		= Ложь;
	ТабличныйДокумент.ТолькоПросмотр 		= Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СтруктураПараметровФормирования() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("ВариантФормирования", 				ВариантФормирования);
	Структура.Вставить("ДатаФиксацииРасчетов",  			ДатаФиксацииРасчетов);
	Структура.Вставить("Детально",							Детально);
	Структура.Вставить("ФизическоеЛицо",					ФизическоеЛицо);
	Структура.Вставить("ВестиУчетЗПВРазрезеОрганизаций",	Ложь);
	Структура.Вставить("Модифицированность",				_Модифицированность);
	Структура.Вставить("Организация",						Организация);
	Структура.Вставить("РасчетныйПериод",					РасчетныйПериод);
	Возврат Структура;

КонецФункции // СтруктураПараметровФормирования()

// Функция возвращает сформированный в табличный документ свод заработной платы
//
// Параметры:
// РасчетныйПериод - расчетный период, по которуму выводятся листки
//Функция СформироватьСвод(РасчетныйПериод) Экспорт
//	
//	ТабличныйДокумент  = Новый ТабличныйДокумент;	
//	Макет = ПолучитьМакет("РасчетныйЛисток");
//	ОбластьШапка	= Макет.ПолучитьОбласть("ШапкаСвод");
//	ОбластьРаздел 	= Макет.ПолучитьОбласть("РазделРасчетногоЛиста");
//	ОбластьСтрока 	= Макет.ПолучитьОбласть("СтрокаРаздела");
//	ОбластьРазрыв 	= Макет.ПолучитьОбласть("Разрыв");
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	СУММА(НачальныеОстатки.СуммаОстаток) КАК Сумма
//	|ИЗ
//	|	РегистрНакопления.уб_РасчетыСФЛПоЗП.Остатки(&ДатаНачалаПериода, ) КАК НачальныеОстатки");
//	Запрос.УстановитьПараметр("ДатаНачалаПериода", 	НачалоМесяца(РасчетныйПериод));
//	Запрос.УстановитьПараметр("ДатаКонецПериода", 	КонецМесяца(РасчетныйПериод));	
//	//Запрос по начальным остаткам
//	ТаблицаНачальныхОстатков = Запрос.Выполнить().Выгрузить();
//	Запрос.Текст =
//	"ВЫБРАТЬ
//				  |	уб_РасчетыСФЛПоЗП.ВидДвижения КАК ВидДвижения,
//				  |	уб_РасчетыСФЛПоЗП.Организация,
//				  |	уб_РасчетыСФЛПоЗП.РасчетныйПериод КАК РасчетныйПериод,
//				  |	СУММА(уб_РасчетыСФЛПоЗП.Сумма) КАК Сумма,
//				  |	уб_РасчетыСФЛПоЗП.ПериодРегистрации КАК ПериодРегистрации,
//				  |	ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100)) КАК Описание,
//				  |	ВЫБОР
//				  |		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
//				  |			ТОГДА 0
//				  |		КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
//				  |			ТОГДА 1
//				  |		ИНАЧЕ 2
//				  |	КОНЕЦ КАК Раздел,
//				  |	уб_РасчетыСФЛПоЗП.Раздел КАК Подраздел
//				  |ИЗ
//				  |	РегистрНакопления.уб_РасчетыСФЛПоЗП КАК уб_РасчетыСФЛПоЗП
//				  |ГДЕ
//				  |	уб_РасчетыСФЛПоЗП.Период >= &ДатаНачалаПериода
//				  |	И уб_РасчетыСФЛПоЗП.Период <= &ДатаКонецПериода
//				  |	И уб_РасчетыСФЛПоЗП.ВидДвижения = &ВидДвижения
//				  |	И ВЫБОР
//				  |			КОГДА уб_РасчетыСФЛПоЗП.Раздел < 11
//				  |				ТОГДА 0
//				  |			КОГДА уб_РасчетыСФЛПоЗП.Раздел < 21
//				  |				ТОГДА 1
//				  |			ИНАЧЕ 2
//				  |		КОНЕЦ = &Раздел
//				  |
//				  |СГРУППИРОВАТЬ ПО
//				  |	уб_РасчетыСФЛПоЗП.ВидДвижения,
//				  |	уб_РасчетыСФЛПоЗП.Организация,
//				  |	уб_РасчетыСФЛПоЗП.РасчетныйПериод,
//				  |	уб_РасчетыСФЛПоЗП.ПериодРегистрации,
//				  |	ВЫРАЗИТЬ(уб_РасчетыСФЛПоЗП.Описание КАК СТРОКА(100)),
//				  |	уб_РасчетыСФЛПоЗП.Раздел
//				  |
//				  |УПОРЯДОЧИТЬ ПО
//				  |	ПериодРегистрации,
//				  |	Описание";
//	
//	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);
//	Запрос.УстановитьПараметр("Раздел",0);
//	
//	ТаблицаНачислений = Запрос.Выполнить().Выгрузить();
//	
//	
//	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
//	Запрос.УстановитьПараметр("Раздел",1);
//	
//	ТаблицаУдержаний = Запрос.Выполнить().Выгрузить();
//	
//	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
//	Запрос.УстановитьПараметр("Раздел",2);
//	
//	ТаблицаВыплат = Запрос.Выполнить().Выгрузить();
//	
//	
//	стрРасчетныйПериод = Формат(РасчетныйПериод,"ДФ='MMMM yyyy'");
//	
//	ОбластьШапка.Параметры.РасчетныйПериод = стрРасчетныйПериод;
//	ТабличныйДокумент.Вывести(ОбластьШапка);
//	
//	НачальныйОстаток = ТаблицаНачальныхОстатков.Итог("Сумма");
//	
//	Если НачальныйОстаток>=0 Тогда
//		ОбластьСтрока.Параметры.НаименованиеПоказателя = "   Задолженность организации на начало периода";
//		ОбластьСтрока.Параметры.ЗначениеПоказателя = НачальныйОстаток;
//	Иначе	
//		ОбластьСтрока.Параметры.НаименованиеПоказателя = "   Задолженность организации на конец периода";
//		ОбластьСтрока.Параметры.ЗначениеПоказателя = -НачальныйОстаток;
//	КонецЕсли;	
//	
//	ТабличныйДокумент.Вывести(ОбластьСтрока);
//	
//	КонечныйОстаток = НачальныйОстаток;
//	
//	КоличествоСтрокНачислено = ТаблицаНачислений.Количество() ;
//	
//	Если КоличествоСтрокНачислено>0 Тогда
//		
//		ОбластьРаздел.Параметры.ЗаголовокРаздела = "Начислено";
//		ТабличныйДокумент.Вывести(ОбластьРаздел);
//		Для счетчикНачислений = 0 по КоличествоСтрокНачислено-1 Цикл
//			
//			СтрокаНачисления = ТаблицаНачислений[счетчикНачислений];
//		//	Источник = СтрокаНачисления.Источник;
//			
//			ДопОписание=""+//?(Источник.Пустая(),""," от "+Источник)+
//			?(СтрокаНачисления.РасчетныйПериод=СтрокаНачисления.ПериодРегистрации,"", " за " + Формат(СтрокаНачисления.РасчетныйПериод,"ДФ='MMММ YYYY'"));
//			
//			ОбластьСтрока.Параметры.НаименованиеПоказателя = СокрЛП(СтрокаНачисления.Описание)+ДопОписание;
//			ОбластьСтрока.Параметры.ЗначениеПоказателя = СтрокаНачисления.Сумма;
//			
//			ТабличныйДокумент.Вывести(ОбластьСтрока);
//			
//			КонечныйОстаток = КонечныйОстаток + СтрокаНачисления.Сумма; 
//			
//		КонецЦикла;	
//	КонецЕсли;
//	
//	КоличествоСтрокУдержано = ТаблицаУдержаний.Количество() ;
//	
//	Если КоличествоСтрокУдержано>0 Тогда
//		
//		ОбластьРаздел.Параметры.ЗаголовокРаздела = "Удержано";
//		ТабличныйДокумент.Вывести(ОбластьРаздел);
//		Для счетчикУдержаний = 0 по КоличествоСтрокУдержано-1 Цикл
//			
//			СтрокаУдержания = ТаблицаУдержаний[счетчикУдержаний];
//			
//			ДопОписание=""+	?(СтрокаУдержания.РасчетныйПериод=СтрокаУдержания.ПериодРегистрации,"", " от " + Формат(СтрокаУдержания.РасчетныйПериод,"ДФ='MMММ YYYY'"));
//			
//			ОбластьСтрока.Параметры.НаименованиеПоказателя = СокрЛП(СтрокаУдержания.Описание)+" "+ДопОписание;
//			ОбластьСтрока.Параметры.ЗначениеПоказателя = СтрокаУдержания.Сумма;
//			
//			ТабличныйДокумент.Вывести(ОбластьСтрока);
//			
//			КонечныйОстаток = КонечныйОстаток - СтрокаУдержания.Сумма; 
//			
//		КонецЦикла;	
//	КонецЕсли;
//	
//	КоличествоСтрокВыплачено = ТаблицаВыплат.Количество() ;
//	
//	Если КоличествоСтрокВыплачено>0 Тогда
//		
//		ОбластьРаздел.Параметры.ЗаголовокРаздела = "Выплачено";
//		ТабличныйДокумент.Вывести(ОбластьРаздел);
//		Для счетчикВыплат = 0 по КоличествоСтрокВыплачено-1 Цикл
//			
//			ОбластьСтрока.Параметры.НаименованиеПоказателя = СокрЛП(ТаблицаВыплат[счетчикВыплат].Описание)+" ("+ Формат(ТаблицаВыплат[счетчикВыплат].ПериодРегистрации,"ДФ=dd.MM.yyyy")+")";
//			ОбластьСтрока.Параметры.ЗначениеПоказателя = ТаблицаВыплат[счетчикВыплат].Сумма;
//			
//			ТабличныйДокумент.Вывести(ОбластьСтрока);
//			
//			КонечныйОстаток = КонечныйОстаток - ТаблицаВыплат[счетчикВыплат].Сумма; 
//			
//		КонецЦикла;	
//	КонецЕсли;
//	
//	Если КоличествоСтрокНачислено=0 и КоличествоСтрокУдержано=0 и КоличествоСтрокВыплачено=0 Тогда
//		//Сальдо не изменилось
//	Иначе	
//		Если КонечныйОстаток>=0 Тогда
//			ОбластьСтрока.Параметры.НаименованиеПоказателя = "   Задолженность организации на конец периода";
//			ОбластьСтрока.Параметры.ЗначениеПоказателя = КонечныйОстаток;
//		Иначе	
//			ОбластьСтрока.Параметры.НаименованиеПоказателя = "   Задолженность сотрудников на конец периода";
//			ОбластьСтрока.Параметры.ЗначениеПоказателя = -КонечныйОстаток;
//		КонецЕсли;
//		ТабличныйДокумент.Вывести(ОбластьСтрока);	
//	КонецЕсли;
//	
//	ТабличныйДокумент.Вывести(ОбластьРазрыв);	
//	
//	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
//	ТабличныйДокумент.ОтображатьСетку = Ложь;
//	ТабличныйДокумент.ТолькоПросмотр = истина;
//	ТабличныйДокумент.Показать("Свод заработной платы");
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции	

НеРазворачивать = Истина;