
//если есть несколько страховых продуктов, и по одному из них не требуется заполнение марки/модели - вернет ложь
//Параметр либо ВидБСО, либо СтраховойПродукт
Функция ТребуетсяЗаполнениеМаркиМодели(Знач Параметр,Дата = Неопределено) Экспорт
	Если   Дата = Неопределено Тогда
		_Дата = ТекущаяДата();
	Иначе	
		_Дата = Дата;
	КонецЕсли;	

	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		Если Не (Параметр.Тип = Перечисления.уб_ТипыБСО.Полис 
			Или Параметр.Тип = Перечисления.уб_ТипыБСО.ПолисОсаго) Тогда
			Возврат Ложь
		Иначе
			Если Найти("ОСАГО,ЕОСАГО,Е-ОСАГО,КАСКО,ЕКАСКО,Е-КАСКО",""+Параметр) тогда
				Возврат Истина
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметр) = Тип ("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Если Параметр = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО 
			или Параметр = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО 
			или Параметр = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.КаскоПП")
			или Параметр = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО 
			или Параметр = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО 
			или Параметр = Перечисления.уб_ВидыСтраховыхПродуктов.ДСАГО
			Тогда
			Возврат Истина
		Иначе
			Возврат Ложь;
		КонецЕсли;	
			
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(ВЫБОР
	|				КОГДА СП.Ссылка.Вид В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДСАГО))
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ), ЛОЖЬ) КАК Требуется
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
	|ГДЕ
	|	&Условие
	|	И (СП.Ссылка.ДатаОкончанияДействия = ДатаВремя(1,1,1) или СП.Ссылка.ДатаОкончанияДействия >= &ДатаОкончанияДействия)");
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		ТекстУсловия = "СП.ВидБСО = &Параметр";
	Иначе
		ТекстУсловия = "СП.Ссылка = &Параметр";	
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", НачалоДня(_Дата));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Ложь
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Требуется;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ТребуетсяЗаполнениеМаркиМодели()

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
