 
//Событие выбор в форме списка
Процедура ВыборВСписке(ВыбраннаяСтрока,СтандартнаяОбработка,Форма,ИмяКолонки = "") Экспорт
	СтандартнаяОбработка = ЛОЖЬ;
	Если ИмяКолонки = "СтраховойПолисНомер" и ЗначениеЗаполнено(ВыбраннаяСтрока.СтраховойПолис) Тогда
		//
		Попытка
			ВыбраннаяСтрока.СтраховойПолис.ПолучитьФорму().Открыть();	
		Исключение
		КонецПопытки;
		
	Иначе
		Если НЕ ВыбраннаяСтрока.ПолноеИмя = Неопределено тогда
			уб_СЛ.ОповещениеФормыПросмотра(ВыбраннаяСтрока.ПолноеИмя, Форма, Форма);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаВыбораДляСписка(ВыбранноеЗначение,эуСписокФайлов) Экспорт
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Предупреждение("Не выбран полис");
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	УстановитьПривилегированныйРежим(Истина);
	
	обПолис = ВыбранноеЗначение.ПолучитьОбъект();
	ВыделенныеСтроки = эуСписокФайлов.ВыделенныеСтроки;
	Для Каждого Строка Из ВыделенныеСтроки Цикл 
		СтрокаФайлов = обПолис.СписокФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаФайлов, Строка);
		СтрокаФайлов.Размещен = ИСТИНА;
		СтрокаФайлов.Опубликован = СтрокаФайлов.СсылкаСправочника.Опубликован;
		СтрокаФайлов.ДатаПубликации = ТекущаяДата();
	КонецЦикла;
	
	КоличествоФайловКПолису = обПолис.ПолучитьКоличествоФайловКПолису();
	
	Если КоличествоФайловКПолису = обПолис.КоличествоФайловB2B Тогда
	Иначе
		обПолис.КоличествоФайловB2B =  КоличествоФайловКПолису;
	КонецЕсли;
	
	//запись при открытой форме приводит к несоответствию объекта версии конфы
	обПолис.ОбменДанными.Загрузка = Истина;
	обПолис.Записать();
	обПолис.ОбменДанными.Загрузка = ЛОЖЬ;
	
	Предупреждение("Файл(ы) скопированы в полис", 3);
	
	ЗафиксироватьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


//мСписокФайлов-ТаблицаЗначений,СписокФайлов - ТЧ документа, эуСписокФайлов - табличное поле
Процедура ОбновитьСписок(пСписокФайлов,Документ,эуСписокФайлов,эуИнфо,ПараметрыОбновления = Неопределено,ВидДокумента = "уб_СтраховойПолис",ТекстОтборПоТЧ="1 = 1") Экспорт
	
	Если ПараметрыОбновления=Неопределено Тогда
		ПараметрыОбновления = Новый Структура;
		ПараметрыОбновления.Вставить("ПоказыватьВсе",Истина);
		ПараметрыОбновления.Вставить("ИнойСтрахователь",Неопределено);
		ПараметрыОбновления.Вставить("ПоказыватьДСП",Ложь);
		ПараметрыОбновления.Вставить("ВидГруппировки",0);
		ПараметрыОбновления.Вставить("ОбъектСтрахования",Неопределено);
		ПараметрыОбновления.Вставить("ВсеОбъекты",Истина);
		ПараметрыОбновления.Вставить("ФильтроватьВиды",Ложь);
		ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Истина);
		ПараметрыОбновления.Вставить("ФильтроватьАрхив",Истина);
		
	Иначе
		//Дополнение отсутствующих
		Если ПараметрыОбновления.Свойство("ПоказыватьВсе") = Ложь Тогда
			ПараметрыОбновления.Вставить("ПоказыватьВсе",Истина);
		КонецЕсли;	
		Если ПараметрыОбновления.Свойство("ИнойСтрахователь") = Ложь Тогда
			ПараметрыОбновления.Вставить("ИнойСтрахователь",Неопределено);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ПоказыватьДСП") = Ложь Тогда
			ПараметрыОбновления.Вставить("ПоказыватьДСП",Ложь);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ВидГруппировки") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВидГруппировки",0);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ОбъектСтрахования") = Ложь Тогда
			ПараметрыОбновления.Вставить("ОбъектСтрахования",Неопределено);
		КонецЕсли;
		Если ПараметрыОбновления.Свойство("ВсеОбъекты") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВсеОбъекты", Истина);
		КонецЕсли;
		Если ПараметрыОбновления.Свойство("ФильтроватьВиды") = Ложь Тогда
			ПараметрыОбновления.Вставить("ФильтроватьВиды", Ложь);
		КонецЕсли;
		
		Если ПараметрыОбновления.Свойство("ВсеПоСтрахователю") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Истина);
		КонецЕсли;
		
		Если ПараметрыОбновления.Свойство("ФильтроватьАрхив") = Ложь Тогда
			ПараметрыОбновления.Вставить("ФильтроватьАрхив",Истина);
		КонецЕсли;	
		
	КонецЕсли;
	
	тзСписокФайлов = ГенерацияСпискаФайлов();
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	
	СписокФайлов  = Документ.СписокФайлов;
	Ссылка        = Документ.Ссылка;
	Страхователь  = Документ.Страхователь; 
	Попытка
		ОбъектСтрахования = Документ.ОбъектСтрахования	
	Исключение
		ОбъектСтрахования = Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
	КонецПопытки;
	
	Если НЕ эуСписокФайлов.ТекущаяСтрока = Неопределено тогда
		мПозиционирование = эуСписокФайлов.ТекущаяСтрока.СсылкаСправочника;
	Иначе
		мПозиционирование = Неопределено;
	КонецЕсли;
	ПозиционированиеСтрока = Неопределено;
	
	мСтрахователь = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ПараметрыОбновления.ИнойСтрахователь) Тогда 
		мСтрахователь.Добавить(ПараметрыОбновления.ИнойСтрахователь);
	КонецЕсли;
	
	мПусто = Новый СписокЗначений;
	мПусто.Добавить(Справочники.ФизическиеЛица.ПустаяСсылка());
	мПусто.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	мПусто.Добавить(Неопределено);
	
	Отбор = Новый Структура;
	Отбор.Вставить("СсылкаСправочника",); 
	Если ТекстОтборПоТЧ="1 = 1" Тогда
	Иначе
		Если Найти(ТекстОтборПоТЧ,"УидСтроки")>0 Тогда
			Отбор.Вставить("УидСтроки",Сред(ТекстОтборПоТЧ,Найти(ТекстОтборПоТЧ,"=""")+2,36)); 
		КонецЕсли;	
	КонецЕсли;	
	Текст = "";
	ЗапросФайлов = Новый Запрос;
	
	//TODO реализовать по другому
	//Если ПоказыватьВсе = Истина тогда					
	//	ТекстПоОбъекту = "ВЫБОР
	//	|КОГДА уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования
	//	|	ТОГДА ИСТИНА
	//	|ИНАЧЕ уб_ФайлыКПолисам.ОбъектСтрахования = &ОбъектСтрахования
	//	|КОНЕЦ";
	//	ЗапросФайлов.УстановитьПараметр("ОбъектСтрахования", ОбъектСтрахования);
	//	эуИнфоЗаголовок = "Отбор по Объекту страхования";
	//Иначе 
		ТекстПоОбъекту = "2 = 2";
		эуИнфоЗаголовок = "Нет отбора по Объекту страхования";		
	//КонецЕсли;
	
	Если не эуИнфо = Неопределено Тогда
		эуИнфо.Заголовок = эуИнфоЗаголовок;
	КонецЕсли;
	
	Если какСправочник Тогда
		ВТ = "ВЫБРАТЬ
		     |	СписокФайлов.СсылкаСправочника КАК УИД,
		     |	ВЫБОР
		     |		КОГДА СписокФайлов.СсылкаСправочника.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ВЫБОР
		     |					КОГДА НЕ СписокФайлов.Ссылка ССЫЛКА Документ.уб_СтраховойПолис
		     |						ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |					ИНАЧЕ СписокФайлов.Ссылка.ОбъектСтрахования
		     |				КОНЕЦ
		     |		ИНАЧЕ СписокФайлов.СсылкаСправочника.ОбъектСтрахования
		     |	КОНЕЦ КАК ОбъектСтрахования
		     |ПОМЕСТИТЬ ВТ_Файлы
		     |ИЗ
		     |	Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
		     |ГДЕ
		     |	СписокФайлов.Ссылка = &Ссылка
		     |	И 1 = 1
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.Ссылка,
		     |	уб_ФайлыКПолисам.ОбъектСтрахования
		     |ИЗ
		     |	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Архив = ЛОЖЬ
		     |	И уб_ФайлыКПолисам.Страхователь В(&Страхователь)
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)
		     |	И 2 = 2
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.Ссылка,
		     |	уб_ФайлыКПолисам.ОбъектСтрахования
		     |ИЗ
		     |	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Страхователь В(&ИнойСтрахователь)
		     |	И ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)"
		 Иначе
			 
		ВТ = "ВЫБРАТЬ
		     |	СписокФайлов.СсылкаСправочника КАК УИД,
		     |	ВЫБОР
		     |		КОГДА СписокФайлов.СсылкаСправочника.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ВЫБОР
		     |					КОГДА ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка) = ТИП(Документ.уб_СтраховойПолис)
		     |						ТОГДА СписокФайлов.Ссылка.ОбъектСтрахования
			 |					КОГДА 8 = 9
			 |		                ТОГДА 989
		     |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |				КОНЕЦ
		     |		ИНАЧЕ СписокФайлов.СсылкаСправочника.ОбъектСтрахования
		     |	КОНЕЦ КАК ОбъектСтрахования
		     |ПОМЕСТИТЬ ВТ_Файлы
		     |ИЗ
		     |	Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
		     |ГДЕ
		     |	СписокФайлов.Ссылка = &Ссылка
		     |	И 1 = 1
		     |
			 |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	
		     |	 уб_ФайлыКПолисам.УИД В (&УИДЫ)
		     |	И 5 = 5
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И уб_ФайлыКПолисам.Страхователь В(&Страхователь)
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)
		     |	И 2 = 2
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Страхователь В(&ИнойСтрахователь)
		     |	И ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)"
		 КонецЕсли;
	ЗапросФайлов.УстановитьПараметр("ФильтроватьАрхив",ПараметрыОбновления.ФильтроватьАрхив);
	
	Если Найти(ТекстОтборПоТЧ,"УидСтроки")>0 Тогда
		//чтобы включить вновь добавленные, но еще не записанные		
		ЗапросФайлов.УстановитьПараметр("УИДЫ",Документ.СписокФайлов.Выгрузить(Новый Структура("УидСтроки",Отбор.УидСтроки)).ВыгрузитьКолонку("СсылкаСправочника"));
	Иначе
		ЗапросФайлов.УстановитьПараметр("УИДЫ",Новый Массив);
	КонецЕсли;	
		
	
	ЗапросФайлов.Текст = ВТ+" ; "+"ВЫБРАТЬ
	                              |	уб_ФайлыКПолисам.УИД КАК СсылкаСправочника,
	                              |	ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПубликации,
	                              |	уб_ФайлыКПолисам.ВидФайлаB2B КАК ВидФайлаB2B,
	                              |	уб_ФайлыКПолисам.ФайлИмя КАК Имя,
	                              |	уб_ФайлыКПолисам.Хранилище.Путь КАК ХранилищеПуть,
	                              |	уб_ФайлыКПолисам.ПутьКПапке КАК ПутьКПапке,
	                              |	уб_ФайлыКПолисам.Страхователь КАК Страхователь,
	                              |	уб_ФайлыКПолисам.Размещен КАК Опубликован,
								  |	уб_ФайлыКПолисам.Архив КАК Архив,
	                              |	уб_ФайлыКПолисам.СтраховойПолис КАК СтраховойПолис,
	                              |	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """") КАК СтраховойПолисНомер,
	                              |	ВЫБОР
	                              |		КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ЛОЖЬ
	                              |	КОНЕЦ КАК ЭтотОбъект,
	                              |	ЗаписьСправочник.ОбъектСтрахования,
	                              |	ВЫБОР
	                              |		КОГДА &ВсеОбъекты = ИСТИНА
	                              |				ИЛИ уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования = ИСТИНА
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ВЫБОР
	                              |				КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ
	                              |	КОНЕЦ КАК УсловноЭтотОбъект,
	                              |	уб_ФайлыКПолисам.ВидДокумента
	                              |ИЗ
	                              |	(ВЫБРАТЬ
								  |    ВТ_Файлы.УИД КАК УИД,
								  |    МАКСИМУМ(ВТ_Файлы.ОбъектСтрахования) КАК ОбъектСтрахования
								  |  ИЗ
								  |	   ВТ_Файлы КАК ВТ_Файлы
								  |
								  |СГРУППИРОВАТЬ ПО
								  |	ВТ_Файлы.УИД) КАК ЗаписьСправочник
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	                              |		ПО ЗаписьСправочник.УИД = уб_ФайлыКПолисам.УИД
								  |	И ВЫБОР
								  |			КОГДА &ФильтроватьАрхив = ИСТИНА
								  |					И уб_ФайлыКПолисам.Архив = ИСТИНА
								  |				ТОГДА ЛОЖЬ
								  |			ИНАЧЕ ИСТИНА
								  |		КОНЕЦ
	                              |			И (&ПоказыватьДСП = ИСТИНА
	                              |				ИЛИ (уб_ФайлыКПолисам.Размещен = ИСТИНА
	                              |					ИЛИ НЕ(уб_ФайлыКПолисам.ВидФайлаB2B = ЗНАЧЕНИЕ(Перечисление.уб_ВидыФайловB2B.ДСП)
	                              |							И уб_ФайлыКПолисам.СтраховойПолис <> &Ссылка)))
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			СписокФайлов.СсылкаСправочника КАК СсылкаСправочника,
	                              |			СписокФайлов.ДатаПубликации КАК ДатаПубликации,
	                              |			СписокФайлов.Размещен КАК Размещен,
	                              |			СписокФайлов.Опубликован КАК Опубликован
	                              |		ИЗ
	                              |			Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
	                              |		ГДЕ
	                              |			СписокФайлов.Ссылка = &Ссылка
	                              |			И 1 = 1) КАК ПолисДатаРазм
	                              |		ПО ЗаписьСправочник.УИД = ПолисДатаРазм.СсылкаСправочника
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	уб_ФайлыКПолисам.УИД,
	                              |	уб_ФайлыКПолисам.ВидФайлаB2B,
	                              |	уб_ФайлыКПолисам.ФайлИмя,
	                              |	уб_ФайлыКПолисам.Хранилище.Путь,
	                              |	уб_ФайлыКПолисам.ПутьКПапке,
	                              |	уб_ФайлыКПолисам.Страхователь,
	                              |	уб_ФайлыКПолисам.Размещен,
								  |	уб_ФайлыКПолисам.Архив,
	                              |	уб_ФайлыКПолисам.СтраховойПолис,
	                              |	ЗаписьСправочник.ОбъектСтрахования,
	                              |	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """"),
	                              |	ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	                              |	ВЫБОР
	                              |		КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ЛОЖЬ
	                              |	КОНЕЦ,
	                              |	ВЫБОР
	                              |		КОГДА &ВсеОбъекты = ИСТИНА
	                              |				ИЛИ уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования = ИСТИНА
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ВЫБОР
	                              |				КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ
	                              |	КОНЕЦ,
	                              |	уб_ФайлыКПолисам.ВидДокумента
								  |Упорядочить по Выбор Когда уб_ФайлыКПолисам.ВидДокумента = Значение(Справочник.уб_ВидыДокументовКПолисам.ПустаяСсылка) Тогда Ложь Иначе Истина Конец УБЫВ,ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) убыв";
								  
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"Документ.уб_СтраховойПолис.СписокФайлов","Документ."+ВидДокумента+".СписокФайлов");
	Если ВидДокумента = "уб_ЗаявкаНаЗаказВыездногоСпециалиста" Тогда
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"8 = 9","ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка) = ТИП(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста)  и ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка.НомерДоговора)= ТИП(Документ.уб_СтраховойПолис)");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"989","СписокФайлов.Ссылка.НомерДоговора.ОбъектСтрахования");
	КонецЕсли;
	
	Если какСправочник Тогда
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам","ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ФайлыКПолисам");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.Размещен","уб_ФайлыКПолисам.Опубликован");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.СтраховойПолис ","&Ссылка");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.СтраховойПолис,","&Ссылка");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """")","""""");
		
	КонецЕсли;	
	
	Если ПараметрыОбновления.ВсеПоСтрахователю  = Истина Тогда
		
	Иначе
		ТекстПоОбъекту = "2 = 1";
	КонецЕсли;
	
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"2 = 2",ТекстПоОбъекту);
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"1 = 1",ТекстОтборПоТЧ);
	
	ЗапросФайлов.УстановитьПараметр("Страхователь", Страхователь);
	ЗапросФайлов.УстановитьПараметр("ИнойСтрахователь", мСтрахователь);
	ЗапросФайлов.УстановитьПараметр("ПоказыватьДСП", ПараметрыОбновления.ПоказыватьДСП);//Показываются только выбранные или дсп текущего документа (сканы квитанций, других полисов)
	ЗапросФайлов.УстановитьПараметр("ВсеОбъекты", ПараметрыОбновления.ВсеОбъекты);
	ЗапросФайлов.УстановитьПараметр("ОбъектСтрахования", ПараметрыОбновления.ОбъектСтрахования);
	ЗапросФайлов.УстановитьПараметр("ПустойСправочник", мПусто);
	ЗапросФайлов.УстановитьПараметр("Ссылка", Ссылка);
	ФильтроватьВиды = ПараметрыОбновления.ФильтроватьВиды<>Ложь;
	
	АвтоРазмещение = ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_СтраховойПолис");  
	Выборка = ЗапросФайлов.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		Массив = СписокФайлов.НайтиСтроки(Отбор);
		
		УжеРазмещен = Массив.Количество()>0;
		Если УжеРазмещен = Ложь и ФильтроватьВиды = Истина Тогда
			Если ПараметрыОбновления.ФильтроватьВиды.Найти(Выборка.ВидДокумента) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		Если АвтоРазмещение и Выборка.Опубликован и Выборка.СтраховойПолис = Ссылка Тогда
			Если УжеРазмещен = Ложь Тогда
				УжеРазмещен = Истина;
				ТЧСтрокаДокумента = СписокФайлов.Добавить();
				ЗаполнитьЗначенияСвойств(ТЧСтрокаДокумента,Выборка);		
				ТЧСтрокаДокумента.ДатаПубликации = Выборка.ДатаПубликации;
				ТЧСтрокаДокумента.Размещен = ИСТИНА;
				ТЧСтрокаДокумента.СсылкаСправочника = Выборка.СсылкаСправочника;
				ТЧСтрокаДокумента.Опубликован = Выборка.Опубликован;
				//Попытка
				//	ТЧСтрокаДокумента.Архив = Выборка.Архив;				
				//Исключение
				//КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОбновления.ПоказыватьВсе = Ложь и УжеРазмещен = Ложь Тогда
			Продолжить;
		КонецЕсли;	
		Если Выборка.УсловноЭтотОбъект = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = тзСписокФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Размещен = УжеРазмещен;
		
		//Если НЕ ЗначениеЗаполнено(Выборка.ВидФайлаB2B) тогда
		//	ПутьКФайлу = Выборка.ПутьКПапке + "\" + Выборка.Имя;
		//Иначе
		//	ПутьКФайлу = Выборка.ХранилищеПуть +"\"+ Выборка.ПутьКПапке + "\" + Выборка.Имя;
		//КонецЕсли;
		ПутьКФайлу  = ?(ПустаяСтрока(Выборка.ХранилищеПуть),"",Выборка.ХранилищеПуть+"\")+
					  ?(ПустаяСтрока(Выборка.ПутьКПапке),"",Выборка.ПутьКПапке+"\")+Выборка.Имя;
		НоваяСтрока.ПолноеИмя = ПутьКФайлу;
		
		
	КонецЦикла;
	//Формирование дерева
	Если ПараметрыОбновления.ВидГруппировки = 0  Тогда
		//эуСписокФайлов.
		//тзСписокФайлов.Сортировать("Размещен убыв,Имя");
		дзСписокФайлов = ГенерацияСпискаФайлов(Истина);
		Для каждого СтрокаФайла Из тзСписокФайлов Цикл
			Строка1 = дзСписокФайлов.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(Строка1,СтрокаФайла);
			Если СтрокаФайла.СсылкаСправочника = мПозиционирование Тогда
				мПозиционированиеСтрока = Строка1;
			КонецЕсли;
		КонецЦикла;
		//дзСписокФайлов.Строки.Сортировать("Размещен убыв,Имя");
	Иначе
		Если ПараметрыОбновления.ВидГруппировки = 1 Тогда
			ИмяГруппировки = "СтраховойПолис";
		ИначеЕсли ПараметрыОбновления.ВидГруппировки = 2 Тогда
			ИмяГруппировки = "ВидФайлаB2B";
		ИначеЕсли ПараметрыОбновления.ВидГруппировки = 3 Тогда
			ИмяГруппировки = "ОбъектСтрахования";	
		КонецЕсли;
		 
		тзГруппировки = тзСписокФайлов.Скопировать(,ИмяГруппировки); 
		тзГруппировки.Свернуть(ИмяГруппировки);
		Если ПараметрыОбновления.ВидГруппировки = 1 Тогда
			тзГруппировки.Колонки.Добавить("ЭтотПолис");
			Для каждого стрГруппировки Из тзГруппировки Цикл
				стрГруппировки.ЭтотПолис = стрГруппировки.СтраховойПолис = Ссылка; 
			КонецЦикла;	
			тзГруппировки.Сортировать("ЭтотПолис УБЫВ,СтраховойПолис");	//Текущий полис вверх
		Иначе
			тзГруппировки.Сортировать(ИмяГруппировки);	
		КонецЕсли;
		
		дзСписокФайлов = ГенерацияСпискаФайлов(Истина);
		Для каждого стрГруппировки Из тзГруппировки Цикл
			Строка0 = дзСписокФайлов.Строки.Добавить();
			Строка0.Имя = стрГруппировки[ИмяГруппировки];
			Если ИмяГруппировки = "СтраховойПолис" Тогда //Для раскраскки при выводе
				Строка0.СтраховойПолис = стрГруппировки[ИмяГруппировки];
				Строка0.СтраховойПолисНомер = стрГруппировки[ИмяГруппировки].Номер;
			КонецЕсли;	
			Для каждого СтрокаФайла Из тзСписокФайлов.Скопировать(Новый Структура(ИмяГруппировки,Строка0.Имя)) Цикл
				Строка1 = Строка0.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(Строка1,СтрокаФайла);
				Если СтрокаФайла.СсылкаСправочника = мПозиционирование Тогда
					мПозиционированиеСтрока = Строка1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		//пСписокФайлов = дзСписокФайлов;
		
	КонецЕсли;	
	
	пСписокФайлов = дзСписокФайлов;
	Если Не мПозиционирование = Неопределено Тогда 
		Если Не мПозиционированиеСтрока = Неопределено Тогда
			эуСписокФайлов.ТекущаяСтрока = мПозиционированиеСтрока;
		КонецЕсли;	
	//	СтрокаПозиционирования = мСписокФайлов.Найти(мПозиционирование, "СсылкаСправочника");
	//	Если НЕ СтрокаПозиционирования = Неопределено Тогда 
	//		эуСписокФайлов.ТекущаяСтрока = СтрокаПозиционирования;
	//	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция ДиалогДобавленияФайла(Документ,СтруктураЗаполнения  = Неопределено,Хранилище = Неопределено)   Экспорт
	Если Хранилище = Неопределено Тогда
		Хранилище = Справочники.уб_ХранилищаФайловБ2Б.ЗаявкаНаПечать;
	КонецЕсли;	
	
	Добавлено = Ложь;
	Попытка
		Страхователь = Документ.Страхователь;
	Исключение
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.уб_ОтчетПоставщику") Тогда
			Страхователь	 = Документ.Поставщик;
		Иначе
			Страхователь = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;	
	КонецПопытки;
	Попытка
		ОбъектСтрахования = Документ.ОбъектСтрахования;	
	Исключение
		ОбъектСтрахования = Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
	КонецПопытки;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//ОбщийПуть = "\\ALPHA\Common\USERS";
	//КаталогПользователя = Новый Файл(ОбщийПуть + "\" + ПараметрыСеанса.ТекущийПользователь.Наименование);
	//Если КаталогПользователя.Существует() Тогда
	//	Каталог = КаталогПользователя
	//Иначе
	//	Каталог = ОбщийПуть;
	//КонецЕсли;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
//	ДиалогОткрытияФайла.Каталог = Каталог;
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Фильтр = уб_temp.ПолучитьФильтрФайлов();
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	КонецЕсли;
	
	ТЗФайлов = Новый ТаблицаЗначений;
	ТЗФайлов.Колонки.Добавить("Справочник");
	ТЗФайлов.Колонки.Добавить("ВидФайлаB2B");
	
	Если МассивФайлов = Неопределено Тогда 
		Возврат Добавлено;
	КонецЕсли;
	
	Сч = 0;
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	
	Для Каждого Строка Из МассивФайлов Цикл 
		ПолноеИмяФайла = Строка;
		Сч = Сч +1;
		Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда 
			Продолжить;
		КонецЕсли;
		
		оФайлОткуда = Новый Файл(ПолноеИмяФайла);
		ИмяИсходящегоФайла = СтрЗаменить(уб_temp.УбратьСимволы(СокрЛП(Документ.Номер)), Символ(160), "") + "_" + оФайлОткуда.Имя;
		Если какСправочник = Истина Тогда 
			//проверем наличие
			мЗапрос = Новый Запрос;
			мЗапрос.Текст = "ВЫБРАТЬ
			|	уб_ФайлыКПолисам.Ссылка,
			|	уб_ФайлыКПолисам.ВидФайлаB2B
			|ИЗ
			|	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	уб_ФайлыКПолисам.ФайлРазмер = &ФайлРазмер
			|	И уб_ФайлыКПолисам.ФайлРасширение = &ФайлРасширение
			|	И уб_ФайлыКПолисам.Страхователь = &Страхователь";
			мЗапрос.УстановитьПараметр("Страхователь", Страхователь);
			мЗапрос.УстановитьПараметр("ФайлРазмер", оФайлОткуда.Размер());
			мЗапрос.УстановитьПараметр("ФайлРасширение", Сред(оФайлОткуда.Расширение, 2));
			
			Результат = мЗапрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда 
				Запись = Результат.Ссылка;
				мВидФайлаB2B = Результат.ВидФайлаB2B;
			Иначе 
				
				мФорма = Справочники.уб_ВидыДокументовКПолисам.ПолучитьФормуВыбора();
				мФорма.Заголовок = "Выбор вида документа к файлу: "+ПолноеИмяФайла+"";
				ЗначениеВыбора = мФорма.ОткрытьМодально();
				
				Если ЗначениеВыбора <> Неопределено Тогда 
					мВидФайлаB2B = ЗначениеВыбора.ВидФайлаB2B;
				Иначе 
					Возврат Добавлено;
				КонецЕсли;
				// получить путь новой папки файла
				Если ТипЗнч(Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
					НаименованиеСтрахователя = Страхователь.folder;
				ИначеЕсли ТипЗнч(Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
					НаименованиеСтрахователя = ОбщегоНазначения.ФИО_ФизЛица(Страхователь.Наименование, , , , Истина);
				Иначе
					НаименованиеСтрахователя = "НЕИЗВЕСТНЫЙ_СТРАХОВАТЕЛЬ";
				КонецЕсли;
				КлПапка = уб_temp.УбратьСимволы(НаименованиеСтрахователя);
				
				Если мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.ФОТО Тогда 
					КатНазнач = Справочники.уб_ХранилищаФайловБ2Б.FOTO.Путь + "\" + КлПапка;
					Хранилище = Справочники.уб_ХранилищаФайловБ2Б.FOTO;
				Иначе
					КлПапка = КлПапка + ?(мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.БСО_ДОК,"", "\" + мВидФайлаB2B);
					КатНазнач = Справочники.уб_ХранилищаФайловБ2Б.DOC.Путь + "\" + КлПапка;
					Хранилище = Справочники.уб_ХранилищаФайловБ2Б.DOC; 
				КонецЕсли;
				
				оКаталогКуда = Новый Файл(КатНазнач);
				ИмяКонечногоФайлаБезРасширения = ?(уб_ВызовСервера.ЭтоИзображение(оФайлОткуда.Расширение), КлПапка, оФайлОткуда.ИмяБезРасширения) 
				+ ?(Не ЗначениеЗаполнено(ЗначениеВыбора), "", "_[" + Строка(ЗначениеВыбора) + "]_"+Сч+"");	
				ИмяКонечногоФайлаБезРасширения = уб_temp.УбратьЗапрещенныеСимволыИзИмениФайла(ИмяКонечногоФайлаБезРасширения);
				
				оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения + оФайлОткуда.Расширение);
				
				Если НЕ оФайлКуда.Существует() Тогда
					оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"2"+ оФайлОткуда.Расширение);
					Если НЕ оФайлКуда.Существует() Тогда
						оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"3"+ оФайлОткуда.Расширение);
						Если НЕ оФайлКуда.Существует() Тогда
							оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"4"+ оФайлОткуда.Расширение);
							Если НЕ оФайлКуда.Существует() Тогда
								оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"5"+ оФайлОткуда.Расширение);
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
				
				
				Если НЕ оКаталогКуда.Существует() Тогда
					уб_Серверные._СоздатьКаталог(КатНазнач);
				КонецЕсли;
				
				
				уб_серверные._КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
				
				Запись = Справочники.уб_ФайлыКПолисам.СоздатьЭлемент();
				Запись.Наименование = ИмяИсходящегоФайла;
				Запись.ФайлИмя = ИмяИсходящегоФайла;
				
				//Путь к папке без хранилища
				Запись.ПутьКПапке = КлПапка;
				Запись.Хранилище = Хранилище.Ссылка;
				Запись.Страхователь = Страхователь;
				Запись.ВидДокумента = ЗначениеВыбора;
				Запись.ВидФайлаB2B = мВидФайлаB2B;
				Если Запись.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда
					Запись.Опубликован = Истина;
				КонецЕсли;
				Запись.ФайлРазмер = оФайлКуда.Размер();
				Запись.ФайлРасширение = НРег(Прав(оФайлКуда.Расширение, СтрДлина(оФайлКуда.Расширение)-1));
				Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
				Запись.ДатаПубликации = ТекущаяДата();
				Запись.ОбъектСтрахования = ОбъектСтрахования;
				Запись.ОбменДанными.Загрузка = ИСТИНА;
				Запись.УстановитьНовыйКод();
				Попытка
					Запись.Записать();
					Добавлено = Истина;
				Исключение
					Сообщить(ОписаниеОшибки());
					Возврат Добавлено;
				КонецПопытки;
				Запись.ОбменДанными.Загрузка = ЛОЖЬ;
				
			КонецЕсли;
			нСтрока = ТЗФайлов.Добавить();
			нСтрока.Справочник = Запись.Ссылка;
			нСтрока.ВидФайлаB2B = мВидФайлаB2B;
		Иначе
			//Регистр
			
			//Запрос = Новый Запрос(
			//"ВЫБРАТЬ
			//|	Ф.СтраховойПолис,
			//|	Ф.УИД,
			//|	Ф.СК,
			//|	Ф.ВидБСО,
			//|	Ф.НомерБСО
			//|ИЗ
			//|	РегистрСведений.уб_ФайлыКПолисам КАК Ф
			//|ГДЕ
			//|	Ф.СтраховойПолис = &Ссылка
			//|	И Ф.ФайлИмя = &ИмяИсходящегоФайла");
			//Запрос.УстановитьПараметр("Ссылка",				Ссылка);
			//Запрос.УстановитьПараметр("ИмяИсходящегоФайла", ИмяИсходящегоФайла);
			//РезультатЗапроса = Запрос.Выполнить();
			//Если Не РезультатЗапроса.Пустой() Тогда
			//	Выборка = РезультатЗапроса.Выбрать();
			//	Пока Выборка.Следующий() Цикл
			//		Запись = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
			//		ЗаполнитьЗначенияСвойств(Запись, Выборка);
			//		Запись.Прочитать();
			//		Если Запись.Выбран() Тогда
			//			Запись.Удалить();
			//		КонецЕсли;
			//	КонецЦикла;;
			//КонецЕсли;
			мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.ПРОЧЕЕ;
			Запись = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
			Запись.СтраховойПолис 	= Документ.Ссылка;
			Запись.УИД				= Новый УникальныйИдентификатор;
			//Запись.СК               =
			//Запись.ВидБСО           =
			//Запись.НомерБСО         =
			
			Запись.ПутьКПапке       = Формат(Документ.Дата,"ДФ=yyMM")+"\"+Формат(Документ.Номер,"ЧГ=")+"-"+СокрЛП(уб_B2B.УбратьСимволы(Страхователь));//+++;//+++
			//Запись.ДеньПолиса       =
			Запись.Хранилище       	= Хранилище;
			//Запись.ВидДокумента
			//!!Запись.Размещен
			
			Попытка
				Запись.ФайлРазмер 		= оФайлОткуда.Размер();
			Исключение
				Продолжить;
			КонецПопытки;	
			Запись.ФайлРасширение   = оФайлОткуда.Расширение;
			
			КатНазнач = уб_СЛ.ПроверитьИмяКаталога(Хранилище.Путь+"\"+Запись.ПутьКПапке, Истина);
			//ПолноеИмяИсходящегоФайла = КатНазнач + Запись.ФайлИмя;
			
			
			ИмяКонечногоФайлаБезРасширения = оФайлОткуда.ИмяБезРасширения;	
			
			ИмяКонечногоФайлаБезРасширения = уб_temp.УбратьЗапрещенныеСимволыИзИмениФайла(ИмяКонечногоФайлаБезРасширения);
			
			оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения + оФайлОткуда.Расширение);
			Если оФайлКуда.Существует() Тогда
				оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"2"+ оФайлОткуда.Расширение);
				Если оФайлКуда.Существует() Тогда
					оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"3"+ оФайлОткуда.Расширение);
					Если оФайлКуда.Существует() Тогда
						оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"4"+ оФайлОткуда.Расширение);
						Если оФайлКуда.Существует() Тогда
							оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"5"+ оФайлОткуда.Расширение);
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			Запись.ФайлИмя			= оФайлКуда.Имя;

			
			//Запись.Архив            =
			
			Запись.Страхователь		= Страхователь;
			//Запись.Агент            =
			Запись.ВидФайлаB2B      = мВидФайлаB2B;
			Запись.Автор			= ПараметрыСеанса.ТекущийПользователь;
			Запись.ДатаПубликации	= ТекущаяДата();
			
			
			
			//ДопПапка = "\"+Формат(Документ.Дата,"ДФ=yyMM")+"\"+Документ.Номер+"-"+Страхователь;
			//Сообщить(Справочники.уб_ХранилищаФайловБ2Б.ЗаявкаНаПечать.Путь);
			//Сообщить(ДопПапка);
			  КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
			//уб_серверные._КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
			//КопироватьФайл(ПолноеИмяФайла, ПолноеИмяИсходящегоФайла);
			ЗаполнитьЗначенияСвойств(Запись,СтруктураЗаполнения);		
			Запись.Записать();
			Добавлено = Истина;
			нСтрока = ТЗФайлов.Добавить();
			нСтрока.Справочник = Запись.УИД;
			нСтрока.ВидФайлаB2B = мВидФайлаB2B;
			
		КонецЕсли;
	КонецЦикла;
	
	
	
	Для Каждого Стр Из ТЗФайлов Цикл 
		ТЧСтрокаДокумента = Документ.СписокФайлов.Добавить();
		ТЧСтрокаДокумента.ДатаПубликации = ТекущаяДата();
		ТЧСтрокаДокумента.Размещен = ИСТИНА;
		ТЧСтрокаДокумента.СсылкаСправочника = Стр.Справочник;
		Если Стр.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
			ТЧСтрокаДокумента.Опубликован = ИСТИНА;
		КонецЕсли;
		Если НЕ СтруктураЗаполнения  = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТЧСтрокаДокумента,СтруктураЗаполнения);		
		КонецЕсли;
	КонецЦикла;
	Документ.ОбменДанными.Загрузка = ИСТИНА;
	
	Попытка
		Документ.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Документ.ОбменДанными.Загрузка = ЛОЖЬ;
	Возврат Добавлено;
КонецФункции


Процедура ПриНажатииФлажкаРазмещения(Элемент, Колонка, Документ, СтруктураЗаполнения = Неопределено) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("СсылкаСправочника",);
	Если НЕ СтруктураЗаполнения = Неопределено Тогда
		Попытка
			Для каждого Зн из СтруктураЗаполнения Цикл
				Отбор.Вставить(Зн.Ключ,Зн.Значение);		
			КонецЦикла;		
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	Если ТекущаяСтрока.СсылкаСправочника = Неопределено Тогда
		ТекущаяСтрока[Колонка.Имя] = Ложь;
		Возврат;	
	КонецЕсли;	
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	Если Колонка.Имя = "Размещен" И ТекущаяСтрока <> Неопределено Тогда
		Если ТекущаяСтрока.Размещен тогда
			НоваяСтрока = Документ.СписокФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ДатаПубликации = ТекущаяДата();
			ТекущаяСтрока.ДатаПубликации = НоваяСтрока.ДатаПубликации;
			
			Если какСправочник Тогда
				Если НоваяСтрока.СсылкаСправочника.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					НоваяСтрока.Опубликован = ИСТИНА;
					ТекущаяСтрока.Опубликован = НоваяСтрока.Опубликован;
				КонецЕсли;
				НоваяСтрока.Размещен = ИСТИНА;
				мСпрФайл = НоваяСтрока.СсылкаСправочника.ПолучитьОбъект();
				мСпрФайл.Опубликован = НоваяСтрока.Опубликован;
				Попытка
					мСпрФайл.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			Если НЕ СтруктураЗаполнения = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураЗаполнения);
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
			ТекущаяСтрока.ДатаПубликации = Дата(0001,01,01);
			Массив = Документ.СписокФайлов.НайтиСтроки(Отбор);
			Если Массив.Количество()>0 тогда
				Документ.СписокФайлов.Удалить(Массив[0]);
			КонецЕсли;
			Если какСправочник = Ложь Тогда
				Набор = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
				Набор.Отбор.УИД.Установить(ТекущаяСтрока.СсылкаСправочника);
				Набор.Прочитать();
				Если Набор.Количество() = 1 Тогда
					Для каждого МЗ Из Набор  Цикл
						МЗ.Размещен = Ложь;
					КонецЦикла;
					Набор.Записать();
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Колонка.Имя = "Опубликован" Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
		Массив = Документ.СписокФайлов.НайтиСтроки(Отбор);
		Если Массив.Количество()>0 тогда
			Строка = Массив[0];
			Строка.Опубликован = ТекущаяСтрока.Опубликован;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура ПриВыводеСтроки(ОформлениеСтроки,ДанныеСтроки,ПараметрыВывода = Неопределено) Экспорт
	Если ЗначениеЗаполнено(ДанныеСтроки.СсылкаСправочника) Тогда 
		//Если ДанныеСтроки.СсылкаСправочника.Страхователь = ИнойСтрахователь Тогда 
		//	ОформлениеСтроки.ЦветТекста = WebЦвета.ТемноФиолетовый;
		//КонецЕсли;
		
		Если ДанныеСтроки.Размещен Тогда
			ОформлениеСтроки.Шрифт = Новый Шрифт(,,Истина);
		КонецЕсли;
		Если НЕ ПараметрыВывода = Неопределено Тогда
			Если ПараметрыВывода.Свойство("СтраховойПолисНомер") = Ложь Тогда
				ПараметрыВывода.Вставить("СтраховойПолисНомер","");
			КонецЕсли;
			Если ПараметрыВывода.Свойство("ВидГруппировки") = Ложь Тогда
				ПараметрыВывода.Вставить("ВидГруппировки",0);
			КонецЕсли;
			ЭтотПолис = ПустаяСтрока(ДанныеСтроки.СтраховойПолисНомер) или ДанныеСтроки.СтраховойПолисНомер=ПараметрыВывода.СтраховойПолисНомер;
			ОформлениеСтроки.Ячейки.Имя.УстановитьТекст(ДанныеСтроки.Имя + ?(ЭтотПолис,"", " ("+СокрЛП(ДанныеСтроки.СтраховойПолисНомер)+")"));	
			Если Не ЭтотПолис Тогда
				Если НЕ ДанныеСтроки.Размещен Тогда //Неразмещенные из других документов не показываем
					ОформлениеСтроки.ЦветТекста = Новый Цвет (90,90,90);
				КонецЕсли;
			Иначе
				Если ПараметрыВывода.ВидГруппировки = 1 и ДанныеСтроки.Уровень()=0 Тогда //Полис
					ОформлениеСтроки.Шрифт = Новый Шрифт(,,Истина);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;	
	Иначе
		//Выводится родитель группировки
		Если НЕ ПараметрыВывода = Неопределено Тогда
			Если ПараметрыВывода.Свойство("ВидГруппировки") = Ложь Тогда
				ПараметрыВывода.Вставить("ВидГруппировки",0);
			КонецЕсли;
			ЭтотПолис = ПустаяСтрока(ДанныеСтроки.СтраховойПолисНомер) или ДанныеСтроки.СтраховойПолисНомер=ПараметрыВывода.СтраховойПолисНомер;
			Если ЭтотПолис Тогда
				Если ПараметрыВывода.ВидГруппировки = 1 и ДанныеСтроки.Уровень()=0 Тогда //Полис
					ОформлениеСтроки.Шрифт = Новый Шрифт(,,Истина);
				КонецЕсли;	
			КонецЕсли;
			//ОформлениеСтроки.ЦветФона = Новый Цвет(245,242,221);
			ОформлениеСтроки.ЦветФона = Новый Цвет(204,192,133);
			ОформлениеСтроки.Шрифт  = Новый Шрифт(ОформлениеСтроки.Шрифт,,10);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

	   
	
Функция ГенерацияСпискаФайлов(какДерево =  Ложь) Экспорт
	Если какДерево =  Истина Тогда 
		СписокФайлов = Новый ДеревоЗначений;
	Иначе	
		СписокФайлов = Новый ТаблицаЗначений;
	КонецЕсли;	
	
	СписокФайлов.Колонки.Добавить("Размещен");
	СписокФайлов.Колонки.Добавить("Имя");
	СписокФайлов.Колонки.Добавить("ДатаПубликации");
	СписокФайлов.Колонки.Добавить("Опубликован");
	СписокФайлов.Колонки.Добавить("СсылкаСправочника");	
	СписокФайлов.Колонки.Добавить("ПолноеИмя");
	СписокФайлов.Колонки.Добавить("СтраховательИной");
	СписокФайлов.Колонки.Добавить("ОбъектСтрахования");
	СписокФайлов.Колонки.Добавить("ВидФайлаB2B");
	СписокФайлов.Колонки.Добавить("СтраховойПолис");
	СписокФайлов.Колонки.Добавить("СтраховойПолисНомер");
	//
	СписокФайлов.Колонки.Добавить("ВидДокумента",Новый ОписаниеТипов("СправочникСсылка.уб_ВидыДокументовКПолисам"));
	СписокФайлов.Колонки.Добавить("Архив");
	Возврат СписокФайлов;
КонецФункции

Функция СинхронизацияПубликации(СписокФайлов) Экспорт
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	Если какСправочник = Ложь Тогда
		Для каждого ТекущаяСтрока из СписокФайлов Цикл
			Набор = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
			Набор.Отбор.УИД.Установить(ТекущаяСтрока.СсылкаСправочника);
			Набор.Прочитать();
			Если Набор.Количество() = 1 Тогда
				//Если файл в документе есть, то должен быть опубликован в регистре
				Для каждого МЗ Из Набор  Цикл
					Если Не МЗ.Размещен = Истина Тогда
						МЗ.Размещен = Истина;
						Набор.Записать();
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецФункции	

Функция ДоступностьДействийМеню(Меню) экспорт
	
	Доступные = "ДобавитьФайл, ПроверитьПутьКФайлам, ПечатьДокументов, Действие, Действие1, "
	+?(уб_Кэшируемые.ДоступностьРоли("ПолныеПрава"),"СкопироватьПутьКФайлуВБуферОбмена,СкопироватьПутьККаталогуВБуферОбмена,","")
	+?(уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке,уб_СотрудникОтделаБСО"),"СохранитьКак,","")
	+?(уб_Кэшируемые.ДоступностьРоли("ПолныеПрава"),"СохранитьКак,УдалитьФайл,Скопировать,","")
	+?(уб_Кэшируемые.ДоступностьРоли("ПолныеПрава")и ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА, "МенюФайловОткрытьСправочник,","");
	Для каждого Действие Из Меню Цикл
		Попытка
			Доступность = Найти(Доступные,Действие.Имя+",")>0;	
			Действие.Доступность = Доступность;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;
КонецФункции

Функция ВидыДокументовКПолисам()  Экспорт
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	виды.Ссылка
	               |ИЗ
	               |	Справочник.уб_ВидыДокументовКПолисам КАК виды
	               |ГДЕ
	               |	виды.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ виды.Наименование ПОДОБНО ""я%""
	               |	И виды.НеИспользуется = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	виды.Наименование";
	Сз = Новый СписокЗначений;
	Сз.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СЗ;
КонецФункции	


