Функция ПолучитьДанныеДляКомпоновки(Параметры) Экспорт 
	//----Группировки----
	//Организация
	//Контрагент
	//ОтчетПоставщику
	//Представление
	//Сортировка
	//Регистратор
	//ПредставлениеРегистратора
	//----Используемые поля----
	//Пустышка
	//Элементов2
	//ЗадолженностьПередПоставщиком
	//СуммаПоВзносам
	//КВПоВзносам
	//КВДоп
	//ПеречисленоПоставщику
	//ПоступилоОтПоставщика
	//Задолженность
	//Задолженность2
	//КомментарийВнутренний
	//КомментарийДляСК
	//---Для отборов
	//ОтчетПоставщикуДата
	//ВидСП
	
	//СуммаПоВзносам-КВПоВзносам-КВДоп-ПеречисленоПоставщику+ПоступилоОтПоставщика//Задолженность
	//СуммаПоВзносам-КВПоВзносам-ЗадолженностьПередПоставщиком                    //Разница
	ПоказыватьЗакрытыеВзаиморасчеты = Параметры.ПоказыватьЗакрытыеВзаиморасчеты;
	Диапазон  = Параметры.Диапазон;
	СтадииДанных  = Параметры.СтадииДанных;
	Поставщик  = Параметры.Поставщик;
	ОрганизацияАгент  = Параметры.ОрганизацияАгент;
	ДатаДо  = Параметры.ДатаДо;
	БезДопКВ  = Параметры.БезДопКВ;
	ДетализироватьОП = Параметры.ДетализироватьОП;
	НеПоказыватьОтчетыБезЗадолженности = Параметры.НеПоказыватьОтчетыБезЗадолженности;
	ИсключатьНесогласованные = Параметры.ИсключатьНесогласованные;
	ВидСП = Параметры.ВидСП;
	НамДолжны = Параметры.НамДолжны;
	МыДолжны = Параметры.МыДолжны;
	
	ТолькоПоставщику = Параметры.ТолькоПоставщику;
	ТолькоОплатыБрокеру = Параметры.ТолькоОплатыБрокеру;
	//Если ТолькоПоставщику = Истина Тогда
	//	ДетализироватьОП = Истина;
	//КонецЕсли;
	
	
	
	ЗапросПоВзаиморасчетам = Новый Запрос();
	ЗапросПоВзаиморасчетам.Текст = ТекстЗапроса(Параметры);
	ЗапросПоВзаиморасчетам.УстановитьПараметр("ПоказыватьЗакрытыеВзаиморасчеты",ПоказыватьЗакрытыеВзаиморасчеты);
	
	
	Если СтадииДанных = "Только актуальные ОП" Тогда
		Стадия = 2;
	ИначеЕсли СтадииДанных = "Только ОП (актуальные  и неактуальные)" Тогда
		Стадия = 1;
	ИначеЕсли СтадииДанных = "Все ОП + оплаты не вошедшие в отчеты" Тогда
		Стадия = 0;
	КонецЕсли;	
	
	ЗапросПоВзаиморасчетам.УстановитьПараметр("Стадия",						Стадия);
	ЗапросПоВзаиморасчетам.УстановитьПараметр("Контрагент",					Поставщик);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("Организации",				ОрганизацияАгент);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("ДоДаты",						ДатаДо);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("ИсключатьНесогласованные",	ИсключатьНесогласованные);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("БезДопКВ",					БезДопКВ);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("ДетализироватьОП",			ДетализироватьОП);								   
	ЗапросПоВзаиморасчетам.УстановитьПараметр("ДатаСреза",			КонецДня(ТекущаяДата()));								   
	#Если Клиент Тогда
	Состояние("Получение данных");
	#КонецЕсли
	Результат = ЗапросПоВзаиморасчетам.Выполнить();	
	
	ТаблицаЗначений = Результат.Выгрузить();
	ТаблицаЗначений.Колонки.Добавить("ПредставлениеРегистратора");	
	
	ТипОплата = Тип("ДокументСсылка.уб_ОплатаПолисов");
	ТипОП     = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	ТипПлатеж = Тип("ДокументСсылка.уб_ВзаиморасчетСПоставщиком");
	ТипДВОУ = Тип("ДокументСсылка.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы");
	пВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов;
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	ТаблицаЗначений.Индексы.Добавить("ОтчетПоставщику");//Добавляем индекс для быстрого поиска
	//Для оптимизации Представления
	ПредОтчет = Неопределено;
	ПредПредставлениеОтчета = Неопределено;
	
	#Если Клиент Тогда
//		Состояние("Обработка данных");
	Состояние("Контроль задолженностей");
	#КонецЕсли	
	ТаблицаЗначений.Индексы.Добавить("Регистратор");	
	
	ВремТЗ = ТаблицаЗначений.Скопировать(,"ОтчетПоставщику,ОтчетПоставщикуДата,ТипПоляОтчетПоставщику,Задолженность2,ЗадолженностьПередПоставщиком,СуммаПоВзносам,КВПоВзносам,КВДоп,ПеречисленоПоставщику,ПоступилоОтПоставщика");
	
	//		ВремТЗ.СОртировать("ОтчетПоставщику");
	//ВремТЗ.Свернуть("ОтчетПоставщику,ВидСП","Задолженность2");
	ВремТЗ.Свернуть("ОтчетПоставщику,ОтчетПоставщикуДата,ТипПоляОтчетПоставщику","Задолженность2,ЗадолженностьПередПоставщиком,СуммаПоВзносам,КВПоВзносам,КВДоп,ПеречисленоПоставщику,ПоступилоОтПоставщика");
	ТаблицаЗначений.Индексы.Добавить("ОтчетПоставщику");
	//ТаблицаЗначений.Индексы.Добавить("ВидСП");
	
	ТаблицаЗначений.Колонки.Добавить("ЗадолженностьОтчета");
//	ТаблицаЗначений.Колонки.Добавить("ФормаОплаты");
	
	МассивУчтенныхОП = Новый Массив;
	Для каждого строка из ВремТЗ Цикл
		УдаляемСтроку = Ложь;
		ФактЗадолженность = строка.Задолженность2;
		УдаляемСтроку  = (НеПоказыватьОтчетыБезЗадолженности И ФактЗадолженность >= -Диапазон И ФактЗадолженность <= Диапазон) ИЛИ (ЗначениеЗаполнено(ВидСП)И(Строка.ВидСП <> ВидСП));
		//Если НЕ УдаляемСтроку и НамДолжны = ИСТИНА Тогда
		//	Если строка.Задолженность2<0 и (строка.Задолженность2+  строка.КВПоВзносам+строка.КВДоп) = 0 Тогда
		//	Иначе	
		//		УдаляемСтроку  =Истина;
		//	КонецЕсли	
		//КонецЕсли;	
		//
		//Если НЕ УдаляемСтроку и МыДолжны = ИСТИНА Тогда
		//	Если строка.Задолженность2<0 и (строка.Задолженность2+  строка.КВПоВзносам+строка.КВДоп) = 0 Тогда
		//	Иначе	
		//		УдаляемСтроку  =Истина;
		//	КонецЕсли	
		//КонецЕсли;	
		Если НЕ УдаляемСтроку Тогда
			
			//Если строка.Задолженность2<0 и (строка.Задолженность2+  строка.КВПоВзносам+строка.КВДоп) = 0 и НамДолжны = ИСТИНА Тогда
			Если строка.Задолженность2<0 и НамДолжны = ИСТИНА Тогда
			ИначеЕсли строка.Задолженность2>0 и МыДолжны = ИСТИНА Тогда	
			Иначе
				УдаляемСтроку = Истина;
			КонецЕсли;	
			
		КонецЕсли;	
		
				
		Если УдаляемСтроку Тогда
			ПозОтчета = ТаблицаЗначений.Найти(Строка.ОтчетПоставщику, "ОтчетПоставщику");
			Если ПозОтчета = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			Пока НЕ ПозОтчета = Неопределено Цикл
				ТаблицаЗначений.Удалить(ПозОтчета);
				ПозОтчета = ТаблицаЗначений.Найти(Строка.ОтчетПоставщику,  "ОтчетПоставщику");
			КонецЦикла;	
		Иначе
			//Если МассивУчтенныхОП.Найти(Строка.ОтчетПоставщику) = Неопределено Тогда
			//	МассивУчтенныхОП.Добавить(Строка.ОтчетПоставщику);
	//			Строки = ТаблицаЗначений.НайтиСтроки(Новый Структура("ОтчетПоставщику,ВидСП", Строка.ОтчетПоставщику,Строка.ВидСП));
				Строки = ТаблицаЗначений.НайтиСтроки(Новый Структура("ОтчетПоставщику", Строка.ОтчетПоставщику));
				ТипПоляОтчетПоставщику =  Строка.ТипПоляОтчетПоставщику;
				Если ТипПоляОтчетПоставщику = Тип("Строка") или Строка.ОтчетПоставщику.Пустая() Тогда
					НоваяДатаОтчета  = ТекущаяДата();
				Иначе		
					Попытка
						НоваяДатаОтчета = Строка.ОтчетПоставщикуДата;
					Исключение
						НоваяДатаОтчета  = ТекущаяДата();
					КонецПопытки;	
				КонецЕсли;
				//!Тут
				// в перем Строка нет доп. реквизитов, получение расширенных данных представления сложно, сделал в цикле
				ПредПредставлениеОтчета = Неопределено;
				
				ИтогиПоОплатам = Новый Структура("СуммаПоВзносам,КВПоВзносам,КВДоп,ПеречисленоПоставщику,ПоступилоОтПоставщика",
				0,0,0,0,0);
				КлючиПоОплатам = Новый ФиксированнаяСтруктура(ИтогиПоОплатам);
				Для каждого ПодСтрока из Строки Цикл
					
					ПодСтрока.ЗадолженностьОтчета 	= ФактЗадолженность;
					ПодСтрока.ОтчетПоставщикуДата 	= НоваяДатаОтчета;
					//ПодСтрока.Представление 		= "Отчет № " + СокрП(ПодСтрока.ОтчетПоставщикуНомерОтчетаПоставщику) + " (№ " + СтрЗаменить(ПодСтрока.ОтчетПоставщикуНомер, Символ(160),"") + ")" + " от " + Формат(НоваяДатаОтчета,"ДФ=dd.MM.yyyy");;
					Выборка = ПодСтрока;
					//Если ТаблицаЗначений.Найти(Выборка.Регистратор,"Регистратор") = Неопределено Тогда
					//НоваяСтрока = ТаблицаЗначений.Добавить();
					//ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);		
					//ТипПоляРегистратора = ТипЗНЧ(Выборка.Регистратор);
					ТипПоляРегистратора = Выборка.ТипПоляРегистратора;
					
					Если ПредОтчет = Выборка.ОтчетПоставщику Тогда
						ПодСтрока.Представление = ПредПредставлениеОтчета;
					ИначеЕсли ТипПоляОтчетПоставщику = ТипОП Тогда
						ПодСтрока.Представление = "№ "+СокрП(Выборка.ОтчетПоставщикуНомерОтчетаПоставщику)+" (№ "+СтрЗаменить(Выборка.ОтчетПоставщикуНомер,Символ(160),"")+")"+" от "+Формат(Выборка.ОтчетПоставщикуДата,"ДФ=dd.MM.yy");
					ИначеЕсли ТипПоляОтчетПоставщику = ТипПлатеж И Выборка.ОтчетПоставщику = Выборка.Регистратор Тогда	
						ПодСтрока.Представление = ПредставлениеПлатежа(Выборка);
					КонецЕсли;	
					ПредОтчет = Выборка.ОтчетПоставщику;
					ПредПредставлениеОтчета = ПодСтрока.Представление;
					Если ТипПоляРегистратора = ТипПлатеж Тогда
						ПодСтрока.ПредставлениеРегистратора= ПредставлениеПлатежа(Выборка);
						//Если ТипПоляОтчетПоставщику = ТипПлатеж и НЕ Выборка.ОтчетПоставщику = Выборка.Регистратор Тогда
						//Возвраты ошибочно перечисленные, связаны друг с другом
						нСтроки = ТаблицаЗначений.НайтиСтроки(Новый Структура("ОтчетПоставщику",Выборка.Регистратор));
						Для каждого нСтрока из нСтроки Цикл
							нСтрока.Представление = ПодСтрока.ПредставлениеРегистратора;
						КонецЦикла;	
						
						//Иначе	
						//КонецЕсли;	
					ИначеЕсли ДетализироватьОП И ТипПоляРегистратора = ТипОплата Тогда
						Если ТолькоПоставщику Тогда
							ПодСтрока.ПредставлениеРегистратора = "Оплата полиса № "+СокрЛП(Выборка.НОмерПолиса)+" ("+Выборка.НомерОплаты+" от "+Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")+") "+Выборка.Страхователь;
						Иначе	
							ПодСтрока.ПредставлениеРегистратора = "Оплата полиса № "+СокрЛП(Выборка.НОмерПолиса)+" ("+Выборка.НомерОплаты+") "+Выборка.Страхователь;
						КонецЕсли;	
						
						
						ИдетВИтоги = Ложь;
						
						Если ТолькоПоставщику = Истина Тогда
							//дСтрока.ФормаОплаты = Выборка.ФормаОплаты;
							Если ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда 
								ИдетВИтоги = Истина;
							КонецЕсли;	
						ИначеЕсли ТолькоОплатыБрокеру Тогда
							//ПодСтрока.ФормаОплаты = Выборка.ФормаОплаты;
							Если ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал 
								//или ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ВКредит
								или ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.НаКарту
								или ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Терминал
								или ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПоСсылкеБрокеру
								Тогда
								//подмена формы
								ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса; 
								ИдетВИтоги = Истина;
							ИначеЕсли ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Тогда	
								ИдетВИтоги = Истина;
							КонецЕсли;	
						КонецЕсли;	
						
						Если ИдетВИтоги  Тогда
							Для каждого Ключ из КлючиПоОплатам Цикл
								ИтогиПоОплатам[Ключ.Ключ] = ИтогиПоОплатам[Ключ.Ключ]+ ПодСтрока[Ключ.Ключ];
							КонецЦикла;
						КонецЕсли;
					Иначе 
						Если ТипПоляРегистратора = ТипОП Тогда
							Если Выборка.Регистратор = Выборка.ОтчетПоставщику Тогда
								ПодСтрока.ПредставлениеРегистратора = ПредПредставлениеОтчета;
							Иначе	
								ПодСтрока.ПредставлениеРегистратора= "Отчет № "+СокрП(Выборка.ОтчетПоставщикуНомерОтчетаПоставщику)+" (№ "+СтрЗаменить(Выборка.ОтчетПоставщикуНомер,Символ(160),"")+")";
							КонецЕсли;	
						Иначе	
							ПодСтрока.ПредставлениеРегистратора	= Выборка.Регистратор;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
				//
				//Если ДетализироватьОП = Истина Тогда
				Если ТолькоПоставщику = Истина или ТолькоОплатыБрокеру Тогда
					Если ИтогиПоОплатам.СуммаПоВзносам = 0 Тогда
						Алго=1;
					ИначеЕсли ИтогиПоОплатам.СуммаПоВзносам = Строка.СуммаПоВзносам  Тогда
						//Все взносы совпали значит все перечисления относятся к виду
						Алго=2;
						Для каждого ПодСтрока из Строки Цикл
							Если ПодСтрока.ПеречисленоПоставщику<>0  или ПодСтрока.ПоступилоОтПоставщика<>0 Тогда
								Если ТолькоПоставщику = Истина Тогда
									ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
								ИначеЕсли ТолькоОплатыБрокеру Тогда
									ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса;
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;	
					Иначе
						Если Строка.ПеречисленоПоставщику = 0 Тогда
						ИначеЕсли Строка.ПеречисленоПоставщику = ИтогиПоОплатам.СуммаПоВзносам Тогда
							Алго = 3;
							Для каждого ПодСтрока из Строки Цикл
								Если ПодСтрока.ПеречисленоПоставщику<>0 и ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка() Тогда
									Если ТолькоПоставщику = Истина Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
									ИначеЕсли ТолькоОплатыБрокеру Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса;
									КонецЕсли;	
								КонецЕсли;	
							КонецЦикла;		
						//ИначеЕсли (Строка.СуммаПоВзносам-Строка.КВПоВзносам)= Строка.ПеречисленоПоставщику Тогда
						//	Алго = 7;
						//	//перечислили все, но взносов по выбраному виду меньше
						ИначеЕсли Строка.ПеречисленоПоставщику <>0 Тогда
							Алго = 8; //что-то перечислили берем пропорционально
							КоэффициентПеречисления = ИтогиПоОплатам.СуммаПоВзносам/Строка.СуммаПоВзносам;
							Для каждого ПодСтрока из Строки Цикл
								Если ПодСтрока.ПеречисленоПоставщику<>0 и ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка() Тогда
									Если ТолькоПоставщику = Истина Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
									ИначеЕсли ТолькоОплатыБрокеру Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса;
									КонецЕсли;	
									ПодСтрока.ПеречисленоПоставщику = ПодСтрока.ПеречисленоПоставщику*КоэффициентПеречисления;
								КонецЕсли;	
							КонецЦикла;
						Иначе
							Алго = 4;
						КонецЕсли;
						Если Строка.ПоступилоОтПоставщика = 0 Тогда
							
						ИначеЕсли Строка.ПоступилоОтПоставщика = ИтогиПоОплатам.КВПоВзносам 
							//или (ИтогиПоОплатам.СуммаПоВзносам+Строка.ПоступилоОтПоставщика) = 0 трудно исключить в другом режиме пусть пропорционально, хоть и не точно
							Тогда
							Для каждого ПодСтрока из Строки Цикл
								Если ПодСтрока.ПоступилоОтПоставщика<>0 и ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка() Тогда
									Алго = 5; 
									Если ТолькоПоставщику = Истина Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
									ИначеЕсли ТолькоОплатыБрокеру Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса;
									КонецЕсли;	
								КонецЕсли;
							КонецЦикла
					//	ИначеЕсли (ИтогиПоОплатам.СуммаПоВзносам+Строка.ПоступилоОтПоставщика) = 0   Тогда	
						ИначеЕсли Строка.ПоступилоОтПоставщика <>0 Тогда
							Алго = 9; //что-то перечислили берем пропорционально
							КоэффициентПеречисления = ИтогиПоОплатам.СуммаПоВзносам/Строка.СуммаПоВзносам;
							Для каждого ПодСтрока из Строки Цикл
								Если ПодСтрока.ПоступилоОтПоставщика<>0 и ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка() Тогда
									Если ТолькоПоставщику = Истина Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику;
									ИначеЕсли ТолькоОплатыБрокеру Тогда
										ПодСтрока.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса;
									КонецЕсли;	
									ПодСтрока.ПоступилоОтПоставщика = ПодСтрока.ПоступилоОтПоставщика*КоэффициентПеречисления;
								КонецЕсли;	
							КонецЦикла
	
						Иначе
							Алго = 6; 
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			//КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если ТолькоПоставщику = Истина Тогда
		ТаблицаЗначений = ТаблицаЗначений.Скопировать(Новый Структура("ФормаОплаты",Перечисления.уб_ФормыОплаты.Поставщику));	
	ИначеЕсли ТолькоОплатыБрокеру = Истина Тогда
		
		ТаблицаЗначений = ТаблицаЗначений.Скопировать(Новый Структура("ФормаОплаты",Перечисления.уб_ФормыОплаты.Касса));	
	КонецЕсли;	
	Если Не ОрганизацияАгент.Пустая() Тогда
		Возврат ТаблицаЗначений.Скопировать(Новый Структура("Организация",ОрганизацияАгент));	
	КонецЕсли;	
	#Если Клиент Тогда
	Состояние("Вывод формы");
	#КонецЕсли
	
	Возврат ТаблицаЗначений;
	
КонецФункции	
Функция ТекстЗапросаОрагнизацияОтчет(Параметры)
	
	ТекстБазовый = "ВЫБРАТЬ
	               |	СпрОрганизации.Ссылка
	               |ПОМЕСТИТЬ Организации
	               |ИЗ
	               |	Справочник.Организации КАК СпрОрганизации
	               |ГДЕ
	               |	СпрОрганизации.СкрыватьВБалансах = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.ОрганизацияАгент
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ КАК Организация,
	               |	ОплатыПолисов.Поставщик КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК Сортировка,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Представление,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК ЗадолженностьПередПоставщиком,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК СуммаПоВзносам,
	               |	СУММА(ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))) КАК КВПоВзносам,
	               |	СУММА(ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма - ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК КВДоп,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |				ТОГДА ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПеречисленоПоставщику,
	               |	СУММА(0) КАК ПоступилоОтПоставщика,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Регистратор,
	               |	1 КАК КоличествоВГруппе,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Стадия,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ КАК ВидСП,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации КАК НаправлениеРасчетов,
	               |	"""" КАК НомерВходящегоДокумента,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	               |	ОплатыПолисов.Номер КАК НомерОплаты,
	               |	ОплатыПолисов.Дата,
	               |	ПРЕДСТАВЛЕНИЕ(ОплатыПолисов.СтраховойПолис.Страхователь) КАК Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.Номер КАК НомерПолиса
	               |ПОМЕСТИТЬ ВТ_Взаиморасчеты
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект.СрезПоследних КАК уб_ИсторияОбъектСрезПоследних
	               |		ПО ОплатыПолисов.ОтчетПоставщику = уб_ИсторияОбъектСрезПоследних.ОбъектИстории
	               |ГДЕ
	               |	1 = 1
	               |	И ВЫБОР
	               |			КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ТОГДА ОплатыПолисов.ОрганизацияАгент
				   |			ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ОрганизацияАгент
	               |		КОНЕЦ В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ОплатыПолисов.ОрганизацияАгент
	               |						ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ОрганизацияАгент
	               |					КОНЕЦ = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &ИсключатьНесогласованные = ИСТИНА
	               |					И ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ИСТИНА
	               |						ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата > ДАТАВРЕМЯ(2013, 8, 1)
	               |					КОНЕЦ
	               |				ТОГДА ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ЛОЖЬ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |									ТОГДА ЛОЖЬ
	               |								ИНАЧЕ ИСТИНА
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
	               |	И НЕ ОплатыПолисов.ИсключенаИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |						ТОГДА ОплатыПолисов.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |					ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатыПолисов.Поставщик,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.ОрганизацияАгент
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.ФормаОплаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ОплатыПолисов.Номер,
	               |	ОплатыПолисов.Дата,
	               |	ОплатыПолисов.СтраховойПолис.Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.Номер,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |ВЫБОР
	               |	КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.ОрганизацияАгент
				   |		КОГДА ПлатежныеВедомости.ОтчетПоставщику Ссылка Документ.уб_ОплатаПолисов Тогда
				   |               ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ как ОрганизацияАгент,
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	               |						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	               |					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	ПлатежныеВедомости.Ссылка,
	               |	1,
	               |	1,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	1,
	               |	2,
	               |	3,
	               |	4
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	               |ГДЕ
	               |	2 = 2
	               |	И ПлатежныеВедомости.Ссылка.Дата <= &ДатаСреза
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ВЫБОР
	               |	КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.ОрганизацияАгент
				   |		КОГДА ПлатежныеВедомости.ОтчетПоставщику Ссылка Документ.уб_ОплатаПолисов Тогда
				   |               ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |	КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.ОрганизацияАгент
				   |		КОГДА ПлатежныеВедомости.ОтчетПоставщику Ссылка Документ.уб_ОплатаПолисов Тогда
				   |               ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ПлатежныеВедомости.Ссылка.Проведен
	               |	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |	КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.ОрганизацияАгент
				   |		КОГДА ПлатежныеВедомости.ОтчетПоставщику Ссылка Документ.уб_ОплатаПолисов Тогда
				   |               ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ОрганизацияАгент
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ДВОУ.ОрганизацияАгент,
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	ДВОУ.Ссылка,
	               |	1,
	               |	1,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Дата,
	               |	ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка),
	               |	ДВОУ.ВидОперации,
	               |	"""",
	               |	ДВОУ.Дата,
	               |	1,
	               |	2,
	               |	3,
	               |	4
	               |ИЗ
	               |	Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
	               |ГДЕ
	               |	3 = 3
	               |	И ДВОУ.Дата <= &ДатаСреза
	               |	И ДВОУ.Ссылка.Проведен
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ДВОУ.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ДВОУ.ОрганизацияАгент В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ВЫБОР
	               |			КОГДА ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ДВОУ.Дата >= ДВОУ.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.ОрганизацияАгент,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.ВидОперации,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.Организация,
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.ОтчетПоставщику КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(Взаиморасчеты.ОтчетПоставщику) = ТИП(СТРОКА)
	               |			ТОГДА """"
	               |		ИНАЧЕ Взаиморасчеты.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	Взаиморасчеты.Сортировка,
	               |	Взаиморасчеты.Представление,
	               |	Взаиморасчеты.ЗадолженностьПередПоставщиком КАК ЗадолженностьПередПоставщиком,
	               |	Взаиморасчеты.СуммаПоВзносам,
	               |	Взаиморасчеты.КВПоВзносам,
	               |	Взаиморасчеты.КВДоп,
	               |	Взаиморасчеты.ПеречисленоПоставщику КАК ПеречисленоПоставщику,
	               |	Взаиморасчеты.ПоступилоОтПоставщика КАК ПоступилоОтПоставщика,
	               |	(ВЫРАЗИТЬ(Взаиморасчеты.СуммаПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВДоп КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(Взаиморасчеты.ПоступилоОтПоставщика КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.ПеречисленоПоставщику КАК ЧИСЛО(15, 2))) КАК Задолженность2,
	               |	Взаиморасчеты.Регистратор,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	               |	Взаиморасчеты.Стадия,
	               |	Взаиморасчеты.ОтчетПоставщикуНомерОтчетаПоставщику,
	               |	Взаиморасчеты.ОтчетПоставщикуНомер,
	               |	Взаиморасчеты.ОтчетПоставщикуДата КАК ОтчетПоставщикуДата1,
	               |	Взаиморасчеты.ВидСП,
	               |	Взаиморасчеты.НаправлениеРасчетов КАК НаправлениеРасчетов,
	               |	Взаиморасчеты.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	Взаиморасчеты.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	Взаиморасчеты.НомерОплаты,
	               |	Взаиморасчеты.Дата,
	               |	Взаиморасчеты.Страхователь КАК Страхователь,
	               |	Взаиморасчеты.НомерПолиса КАК НомерПолиса
	               |ИЗ
	               |	ВТ_Взаиморасчеты КАК Взаиморасчеты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	               |		ПО Взаиморасчеты.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ
	               |ГДЕ
	               |	Взаиморасчеты.ОтчетПоставщикуДата > ДАТАВРЕМЯ(2011, 1, 1)
	               |	И ВЫБОР
	               |			КОГДА &ПоказыватьЗакрытыеВзаиморасчеты = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЕСТЬNULL(Взаиморасчеты.ОтчетПоставщику.Статус, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыОстаткиВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ИсключенИзВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыеПоДавности), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ПересортОрганизаций))
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетПоставщику";
	ВыбранКонтрагент = НЕ Параметры.Поставщик.Пустая();	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = СтрЗаменить(ТекстБазовый,"1 = 1","ОплатыПолисов.Поставщик = (&Контрагент)");
	КонецЕсли;	
	//Если ДетализироватьОП Тогда
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	//	|	КОНЕЦ","ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.Ссылка
	//	|	КОНЕЦ");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"847 КАК ДопПоле"," ОплатыПолисов.Номер  как НомерОплаты,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь как Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер как НомерПолиса");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"КОНЕЦ
	//	|;","КОНЕЦ,
	//	| ОплатыПолисов.Номер,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер
	//	|;							   
	//	|");							   
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"947 КАК ДопПоле","ВзаиморасчетыПоОплатам.НомерОплаты,
	//	|	ВзаиморасчетыПоОплатам.Дата,
	//	|	ВзаиморасчетыПоОплатам.Страхователь как Страхователь,
	//	|	ВзаиморасчетыПоОплатам.НомерПолиса как НомерПолиса");							     
	//	
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"848 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"849 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");	
	//
	//	//Для каждого Поле из СхемаКомпоновкиДанных.ВычисляемыеПоля
	//КонецЕсли;							   
	//ТекстВыписки  = "ВЫБРАТЬ
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент КАК Организация,
	//								|	ПлатежныеВедомости.Ссылка.Контрагент КАК Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ КАК ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК Сортировка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ КАК Представление,
	//								|	СУММА(0) КАК ЗадолженностьПередПоставщиком,
	//								|	СУММА(0) КАК СуммаПоВзносам,
	//								|	СУММА(0) КАК КВПоВзносам,
	//								//|	СУММА(0) КАК КВПоВзносамОплаченнымПоставщику,
	//								|	СУММА(0) КАК КВДоп,
	//						   //     |	СУММА(0) КАК КВ,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	//								|						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	//								|				ТОГДА -ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	//								|					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПеречисленоПоставщику,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПоступилоОтПоставщика,
	//								|	ПлатежныеВедомости.Ссылка КАК Регистратор,
	//								|	1 КАК КоличествоВГруппе,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК ОтчетПоставщикуДата,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ КАК ВидСП,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер
	//								|ПОМЕСТИТЬ ВзаиморасчетыПоПлатежам
	//								|ИЗ
	//								|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	//								|ГДЕ
	//								|	1 = 1
	//								|	И ПлатежныеВедомости.Ссылка.Проведен
	//								|	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	//								|	И ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	//								|				ТОГДА ИСТИНА
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	//								|					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|		КОНЕЦ
	//								|	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	//								|
	//								|СГРУППИРОВАТЬ ПО
	//								|	ПлатежныеВедомости.Ссылка.Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ
	//								|;
	//								|
	//								|////////////////////////////////////////////////////////////////////////////////
	//								|ВЫБРАТЬ
	//								|	ВзаиморасчетыПоПлатежам.Организация,
	//								|	ВзаиморасчетыПоПлатежам.Контрагент,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.Сортировка,
	//								|	ВзаиморасчетыПоПлатежам.Представление,
	//								|	ВзаиморасчетыПоПлатежам.ЗадолженностьПередПоставщиком,
	//								|	ВзаиморасчетыПоПлатежам.СуммаПоВзносам,
	//								|	ВзаиморасчетыПоПлатежам.КВПоВзносам,
	//								//|	ВзаиморасчетыПоПлатежам.КВПоВзносамОплаченнымПоставщику,
	//							 //   |	ВзаиморасчетыПоПлатежам.КВ,
	//								|	ВзаиморасчетыПоПлатежам.КВДоп,
	//								|	ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика - ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику КАК Задолженность2,
	//								|	ВзаиморасчетыПоПлатежам.Регистратор,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	//								//|	ВзаиморасчетыПоПлатежам.КоличествоВГруппе КАК Элементов,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомерОтчетаПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомер,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуДата,
	//								|	ВзаиморасчетыПоПлатежам.ВидСП,
	//								|	ВзаиморасчетыПоПлатежам.ФормаОплаты,
	//								|	ВзаиморасчетыПоПлатежам.НаправлениеРасчетов,
	//								|	ВзаиморасчетыПоПлатежам.НомерВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.ДатаВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.Дата,
	//								|	ВзаиморасчетыПоПлатежам.Номер
	//								|ИЗ
	//								|	ВзаиморасчетыПоПлатежам КАК ВзаиморасчетыПоПлатежам
	//								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	//								|		ПО ВзаиморасчетыПоПлатежам.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ";	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = Стрзаменить(ТекстБазовый,"2 = 2","ПлатежныеВедомости.Ссылка.Контрагент = &Контрагент");
		ТекстБазовый = Стрзаменить(ТекстБазовый,"3 = 3","ДВОУ.Поставщик = &Контрагент");
	КонецЕсли;
	Возврат ТекстБазовый;//+"
	//|Объединить 
	//|"+ТекстВыписки;
	
КонецФункции	

Функция ТекстЗапроса0(Параметры)
	
	ТекстБазовый = "ВЫБРАТЬ
	               |	СпрОрганизации.Ссылка
	               |ПОМЕСТИТЬ Организации
	               |ИЗ
	               |	Справочник.Организации КАК СпрОрганизации
	               |ГДЕ
	               |	СпрОрганизации.СкрыватьВБалансах = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОплатыПолисов.ОрганизацияАгент КАК Организация,
	               |	ОплатыПолисов.Поставщик КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК Сортировка,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Представление,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК ЗадолженностьПередПоставщиком,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК СуммаПоВзносам,
	               |	СУММА(ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))) КАК КВПоВзносам,
	               |	СУММА(ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма - ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК КВДоп,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |				ТОГДА ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПеречисленоПоставщику,
	               |	СУММА(0) КАК ПоступилоОтПоставщика,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Регистратор,
	               |	1 КАК КоличествоВГруппе,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Стадия,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ КАК ВидСП,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации КАК НаправлениеРасчетов,
	               |	"""" КАК НомерВходящегоДокумента,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	               |	ОплатыПолисов.Номер КАК НомерОплаты,
	               |	ОплатыПолисов.Дата,
	               |	ПРЕДСТАВЛЕНИЕ(ОплатыПолисов.СтраховойПолис.Страхователь) КАК Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.Номер КАК НомерПолиса
	               |ПОМЕСТИТЬ ВТ_Взаиморасчеты
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект.СрезПоследних КАК уб_ИсторияОбъектСрезПоследних
	               |		ПО ОплатыПолисов.ОтчетПоставщику = уб_ИсторияОбъектСрезПоследних.ОбъектИстории
	               |ГДЕ
	               |	1 = 1
	               |	И ОплатыПолисов.ОрганизацияАгент В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ОплатыПолисов.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &ИсключатьНесогласованные = ИСТИНА
	               |					И ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ИСТИНА
	               |						ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата > ДАТАВРЕМЯ(2013, 8, 1)
	               |					КОНЕЦ
	               |				ТОГДА ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ЛОЖЬ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |									ТОГДА ЛОЖЬ
	               |								ИНАЧЕ ИСТИНА
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
	               |	И НЕ ОплатыПолисов.ИсключенаИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |						ТОГДА ОплатыПолисов.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |					ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатыПолисов.Поставщик,
	               |	ОплатыПолисов.ОрганизацияАгент,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.ФормаОплаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ОплатыПолисов.Номер,
	               |	ОплатыПолисов.Дата,
	               |	ОплатыПолисов.СтраховойПолис.Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.Номер,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ""По оплатам в СК не включенным в отчет""
	               |					ИНАЧЕ ""По оплатам брокеру не включенным в отчет""
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	               |						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	               |					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	ПлатежныеВедомости.Ссылка,
	               |	1,
	               |	1,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	1,
	               |	2,
	               |	3,
	               |	4
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	               |ГДЕ
	               |	2 = 2
	               |	И ПлатежныеВедомости.Ссылка.Дата <= &ДатаСреза
				   |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ПлатежныеВедомости.Ссылка.ОрганизацияАгент В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ПлатежныеВедомости.Ссылка.Проведен
	               |	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ДВОУ.ОрганизацияАгент,
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	ДВОУ.Ссылка,
	               |	1,
	               |	1,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Дата,
	               |	ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка),
	               |	ДВОУ.ВидОперации,
	               |	"""",
	               |	ДВОУ.Дата,
	               |	1,
	               |	2,
	               |	3,
	               |	4
	               |ИЗ
	               |	Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
	               |ГДЕ
	               |	3 = 3
	               |	И ДВОУ.Дата <= &ДатаСреза
	               |	И ДВОУ.Ссылка.Проведен
				   |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ДВОУ.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ДВОУ.ОрганизацияАгент В
	               |			(ВЫБРАТЬ
	               |				Организации.Ссылка
	               |			ИЗ
	               |				Организации)
	               |	И ВЫБОР
	               |			КОГДА ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ДВОУ.Дата >= ДВОУ.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.ОрганизацияАгент,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.ВидОперации,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.Организация,
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.ОтчетПоставщику КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(Взаиморасчеты.ОтчетПоставщику) = ТИП(СТРОКА)
	               |			ТОГДА """"
	               |		ИНАЧЕ Взаиморасчеты.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	Взаиморасчеты.Сортировка,
	               |	Взаиморасчеты.Представление,
	               |	Взаиморасчеты.ЗадолженностьПередПоставщиком КАК ЗадолженностьПередПоставщиком,
	               |	Взаиморасчеты.СуммаПоВзносам,
	               |	Взаиморасчеты.КВПоВзносам,
	               |	Взаиморасчеты.КВДоп,
	               |	Взаиморасчеты.ПеречисленоПоставщику КАК ПеречисленоПоставщику,
	               |	Взаиморасчеты.ПоступилоОтПоставщика КАК ПоступилоОтПоставщика,
	               |	(ВЫРАЗИТЬ(Взаиморасчеты.СуммаПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВДоп КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(Взаиморасчеты.ПоступилоОтПоставщика КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.ПеречисленоПоставщику КАК ЧИСЛО(15, 2))) КАК Задолженность2,
	               |	Взаиморасчеты.Регистратор,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	               |	Взаиморасчеты.Стадия,
	               |	Взаиморасчеты.ОтчетПоставщикуНомерОтчетаПоставщику,
	               |	Взаиморасчеты.ОтчетПоставщикуНомер,
	               |	Взаиморасчеты.ОтчетПоставщикуДата КАК ОтчетПоставщикуДата1,
	               |	Взаиморасчеты.ВидСП,
	               |	Взаиморасчеты.НаправлениеРасчетов КАК НаправлениеРасчетов,
	               |	Взаиморасчеты.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	Взаиморасчеты.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	Взаиморасчеты.НомерОплаты,
	               |	Взаиморасчеты.Дата,
	               |	Взаиморасчеты.Страхователь КАК Страхователь,
	               |	Взаиморасчеты.НомерПолиса КАК НомерПолиса
	               |ИЗ
	               |	ВТ_Взаиморасчеты КАК Взаиморасчеты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	               |		ПО Взаиморасчеты.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ
	               |ГДЕ
	               |	Взаиморасчеты.ОтчетПоставщикуДата > ДАТАВРЕМЯ(2011, 1, 1)
	               |	И ВЫБОР
	               |			КОГДА &ПоказыватьЗакрытыеВзаиморасчеты = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЕСТЬNULL(Взаиморасчеты.ОтчетПоставщику.Статус, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыОстаткиВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ИсключенИзВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыеПоДавности), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ПересортОрганизаций))
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетПоставщику";
	ВыбранКонтрагент = НЕ Параметры.Поставщик.Пустая();	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = СтрЗаменить(ТекстБазовый,"1 = 1","ОплатыПолисов.Поставщик = (&Контрагент)");
	КонецЕсли;	
	//Если ДетализироватьОП Тогда
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	//	|	КОНЕЦ","ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.Ссылка
	//	|	КОНЕЦ");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"847 КАК ДопПоле"," ОплатыПолисов.Номер  как НомерОплаты,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь как Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер как НомерПолиса");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"КОНЕЦ
	//	|;","КОНЕЦ,
	//	| ОплатыПолисов.Номер,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер
	//	|;							   
	//	|");							   
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"947 КАК ДопПоле","ВзаиморасчетыПоОплатам.НомерОплаты,
	//	|	ВзаиморасчетыПоОплатам.Дата,
	//	|	ВзаиморасчетыПоОплатам.Страхователь как Страхователь,
	//	|	ВзаиморасчетыПоОплатам.НомерПолиса как НомерПолиса");							     
	//	
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"848 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"849 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");	
	//
	//	//Для каждого Поле из СхемаКомпоновкиДанных.ВычисляемыеПоля
	//КонецЕсли;							   
	//ТекстВыписки  = "ВЫБРАТЬ
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент КАК Организация,
	//								|	ПлатежныеВедомости.Ссылка.Контрагент КАК Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ КАК ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК Сортировка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ КАК Представление,
	//								|	СУММА(0) КАК ЗадолженностьПередПоставщиком,
	//								|	СУММА(0) КАК СуммаПоВзносам,
	//								|	СУММА(0) КАК КВПоВзносам,
	//								//|	СУММА(0) КАК КВПоВзносамОплаченнымПоставщику,
	//								|	СУММА(0) КАК КВДоп,
	//						   //     |	СУММА(0) КАК КВ,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	//								|						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	//								|				ТОГДА -ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	//								|					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПеречисленоПоставщику,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПоступилоОтПоставщика,
	//								|	ПлатежныеВедомости.Ссылка КАК Регистратор,
	//								|	1 КАК КоличествоВГруппе,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК ОтчетПоставщикуДата,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ КАК ВидСП,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер
	//								|ПОМЕСТИТЬ ВзаиморасчетыПоПлатежам
	//								|ИЗ
	//								|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	//								|ГДЕ
	//								|	1 = 1
	//								|	И ПлатежныеВедомости.Ссылка.Проведен
	//								|	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	//								|	И ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	//								|				ТОГДА ИСТИНА
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	//								|					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|		КОНЕЦ
	//								|	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	//								|
	//								|СГРУППИРОВАТЬ ПО
	//								|	ПлатежныеВедомости.Ссылка.Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ
	//								|;
	//								|
	//								|////////////////////////////////////////////////////////////////////////////////
	//								|ВЫБРАТЬ
	//								|	ВзаиморасчетыПоПлатежам.Организация,
	//								|	ВзаиморасчетыПоПлатежам.Контрагент,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.Сортировка,
	//								|	ВзаиморасчетыПоПлатежам.Представление,
	//								|	ВзаиморасчетыПоПлатежам.ЗадолженностьПередПоставщиком,
	//								|	ВзаиморасчетыПоПлатежам.СуммаПоВзносам,
	//								|	ВзаиморасчетыПоПлатежам.КВПоВзносам,
	//								//|	ВзаиморасчетыПоПлатежам.КВПоВзносамОплаченнымПоставщику,
	//							 //   |	ВзаиморасчетыПоПлатежам.КВ,
	//								|	ВзаиморасчетыПоПлатежам.КВДоп,
	//								|	ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика - ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику КАК Задолженность2,
	//								|	ВзаиморасчетыПоПлатежам.Регистратор,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	//								//|	ВзаиморасчетыПоПлатежам.КоличествоВГруппе КАК Элементов,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомерОтчетаПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомер,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуДата,
	//								|	ВзаиморасчетыПоПлатежам.ВидСП,
	//								|	ВзаиморасчетыПоПлатежам.ФормаОплаты,
	//								|	ВзаиморасчетыПоПлатежам.НаправлениеРасчетов,
	//								|	ВзаиморасчетыПоПлатежам.НомерВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.ДатаВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.Дата,
	//								|	ВзаиморасчетыПоПлатежам.Номер
	//								|ИЗ
	//								|	ВзаиморасчетыПоПлатежам КАК ВзаиморасчетыПоПлатежам
	//								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	//								|		ПО ВзаиморасчетыПоПлатежам.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ";	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = Стрзаменить(ТекстБазовый,"2 = 2","ПлатежныеВедомости.Ссылка.Контрагент = &Контрагент");
		ТекстБазовый = Стрзаменить(ТекстБазовый,"3 = 3","ДВОУ.Поставщик = &Контрагент");
	КонецЕсли;
	Возврат ТекстБазовый;//+"
	//|Объединить 
	//|"+ТекстВыписки;
	
КонецФункции	

Функция ТекстЗапроса(Параметры)
	//БезОрганизации
	ТекстБазовый = "ВЫБРАТЬ
	               |	СпрОрганизации.Ссылка
	               |ПОМЕСТИТЬ Организации
	               |ИЗ
	               |	Справочник.Организации КАК СпрОрганизации
	               |ГДЕ
	               |	СпрОрганизации.СкрыватьВБалансах = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ОплатыПолисов.Поставщик КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ПОДСТРОКА(""По оплатам в СК не включенным в отчет"", 1, 255)
	               |					ИНАЧЕ ПОДСТРОКА(""По оплатам брокеру не включенным в отчет"", 1, 255)
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК Сортировка,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ПОДСТРОКА(""По оплатам в СК не включенным в отчет"", 1, 255)
	               |					ИНАЧЕ ПОДСТРОКА(""По оплатам брокеру не включенным в отчет"", 1, 255)
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Представление,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК ЗадолженностьПередПоставщиком,
	               |	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК СуммаПоВзносам,
	               |	СУММА(ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))) КАК КВПоВзносам,
	               |	СУММА(ВЫБОР
	               |			КОГДА &БезДопКВ
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма - ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
	               |		КОНЕЦ) КАК КВДоп,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |				ТОГДА ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПеречисленоПоставщику,
	               |	СУММА(0) КАК ПоступилоОтПоставщика,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ КАК Регистратор,
	               |	1 КАК КоличествоВГруппе,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Стадия,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ КАК ВидСП,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации КАК НаправлениеРасчетов,
	               |	"""" КАК НомерВходящегоДокумента,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	               |	ОплатыПолисов.Номер КАК НомерОплаты,
	               |	ОплатыПолисов.Дата,
	               |	ПРЕДСТАВЛЕНИЕ(ОплатыПолисов.СтраховойПолис.Страхователь) КАК Страхователь,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.ФормаОплаты
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)
	               |	КОНЕЦ КАК ФормаОплаты,
	               |	ОплатыПолисов.СтраховойПолис.Номер КАК НомерПолиса
	               |ПОМЕСТИТЬ ВТ_Взаиморасчеты
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект.СрезПоследних КАК уб_ИсторияОбъектСрезПоследних
	               |		ПО ОплатыПолисов.ОтчетПоставщику = уб_ИсторияОбъектСрезПоследних.ОбъектИстории
	               |ГДЕ
	               |	1 = 1
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ОплатыПолисов.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &ИсключатьНесогласованные = ИСТИНА
	               |					И ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ИСТИНА
	               |						ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата > ДАТАВРЕМЯ(2013, 8, 1)
	               |					КОНЕЦ
	               |				ТОГДА ВЫБОР
	               |						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |							ТОГДА ЛОЖЬ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |									ТОГДА ЛОЖЬ
	               |								ИНАЧЕ ИСТИНА
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
	               |	И НЕ ОплатыПолисов.ИсключенаИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |						ТОГДА ОплатыПолисов.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |					ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатыПолисов.Поставщик,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.ФормаОплаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА &ДоДаты
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Ссылка
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ОплатыПолисов.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.Дата
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ОплатыПолисов.Дата
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ОплатыПолисов.ОтчетПоставщику.ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА 0
	               |		КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ПОДСТРОКА(""По оплатам в СК не включенным в отчет"", 1, 255)
	               |					ИНАЧЕ ПОДСТРОКА(""По оплатам брокеру не включенным в отчет"", 1, 255)
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ОплатыПолисов.Номер,
	               |	ОплатыПолисов.Дата,
	               |	ОплатыПолисов.СтраховойПолис.Страхователь,
	               |	ОплатыПолисов.СтраховойПолис.Номер,
	               |	ВЫБОР
	               |		КОГДА &ДетализироватьОП = ИСТИНА
	               |			ТОГДА ОплатыПолисов.ФормаОплаты
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОплатыПолисов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |						ТОГДА ПОДСТРОКА(""По оплатам в СК не включенным в отчет"", 1, 255)
	               |					ИНАЧЕ ПОДСТРОКА(""По оплатам брокеру не включенным в отчет"", 1, 255)
	               |				КОНЕЦ
	               |		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	               |						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	               |				ТОГДА -ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	               |					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	               |					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ТОГДА ПлатежныеВедомости.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	ПлатежныеВедомости.Ссылка,
	               |	1,
	               |	1,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	1,
	               |	2,
	               |	3,
	               |	ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка),
	               |	4
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	               |ГДЕ
	               |	2 = 2
	               |	И ПлатежныеВедомости.Ссылка.Дата <= &ДатаСреза
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ПлатежныеВедомости.Ссылка.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ПлатежныеВедомости.Ссылка.Проведен
	               |	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	               |	И ВЫБОР
	               |			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПлатежныеВедомости.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	               |			ТОГДА ""Начальный остаток""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |					ТОГДА ПлатежныеВедомости.Ссылка
	               |				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	               |	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |				ИЛИ НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	               |	КОНЕЦ,
	               |	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	               |	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	               |			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	               |		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	               |				ТОГДА ДВОУ.СуммаДокумента
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	ДВОУ.Ссылка,
	               |	1,
	               |	1,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Дата,
	               |	ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка),
	               |	ДВОУ.ВидОперации,
	               |	"""",
	               |	ДВОУ.Дата,
	               |	1,
	               |	2,
	               |	3,
	               |	ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка),
	               |	4
	               |ИЗ
	               |	Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
	               |ГДЕ
	               |	3 = 3
	               |	И ДВОУ.Дата <= &ДатаСреза
	               |	И ДВОУ.Ссылка.Проведен
	               |	И ВЫБОР
	               |			КОГДА &Организации = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ ДВОУ.ОрганизацияАгент = &Организации
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ДВОУ.Дата >= ДВОУ.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДВОУ.Поставщик,
	               |	ДВОУ.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.ВнешнийНомер,
	               |	ДВОУ.ВидОперации,
	               |	ДВОУ.Номер,
	               |	ДВОУ.Ссылка.Дата,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Ссылка,
	               |	ДВОУ.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.Организация,
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.ОтчетПоставщику КАК ОтчетПоставщику,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(Взаиморасчеты.ОтчетПоставщику) = ТИП(СТРОКА)
	               |			ТОГДА """"
	               |		ИНАЧЕ Взаиморасчеты.ОтчетПоставщику.Дата
	               |	КОНЕЦ КАК ОтчетПоставщикуДата,
	               |	Взаиморасчеты.Сортировка,
	               |	Взаиморасчеты.Представление,
	               |	Взаиморасчеты.ЗадолженностьПередПоставщиком КАК ЗадолженностьПередПоставщиком,
	               |	Взаиморасчеты.СуммаПоВзносам,
	               |	Взаиморасчеты.КВПоВзносам,
	               |	Взаиморасчеты.КВДоп,
	               |	Взаиморасчеты.ПеречисленоПоставщику КАК ПеречисленоПоставщику,
	               |	Взаиморасчеты.ПоступилоОтПоставщика КАК ПоступилоОтПоставщика,
	               |	(ВЫРАЗИТЬ(Взаиморасчеты.СуммаПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВПоВзносам КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.КВДоп КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(Взаиморасчеты.ПоступилоОтПоставщика КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(Взаиморасчеты.ПеречисленоПоставщику КАК ЧИСЛО(15, 2))) КАК Задолженность2,
	               |	Взаиморасчеты.Регистратор,
	               |	ТИПЗНАЧЕНИЯ(Взаиморасчеты.Регистратор) КАК ТипПоляРегистратора,
	               |	Взаиморасчеты.ФормаОплаты,
	               |	ТИПЗНАЧЕНИЯ(Взаиморасчеты.ОтчетПоставщику) КАК ТипПоляОтчетПоставщику,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	               |	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	               |	Взаиморасчеты.Стадия,
	               |	Взаиморасчеты.ОтчетПоставщикуНомерОтчетаПоставщику,
	               |	Взаиморасчеты.ОтчетПоставщикуНомер,
	               |	Взаиморасчеты.ОтчетПоставщикуДата КАК ОтчетПоставщикуДата1,
	               |	Взаиморасчеты.ВидСП,
	               |	Взаиморасчеты.НаправлениеРасчетов КАК НаправлениеРасчетов,
	               |	Взаиморасчеты.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	Взаиморасчеты.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	Взаиморасчеты.НомерОплаты,
	               |	Взаиморасчеты.Дата,
	               |	Взаиморасчеты.Страхователь КАК Страхователь,
	               |	Взаиморасчеты.НомерПолиса КАК НомерПолиса
	               |ИЗ
	               |	ВТ_Взаиморасчеты КАК Взаиморасчеты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	               |		ПО Взаиморасчеты.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ
	               |ГДЕ
	               |	Взаиморасчеты.ОтчетПоставщикуДата > ДАТАВРЕМЯ(2011, 1, 1)
	               |	И ВЫБОР
	               |			КОГДА &ПоказыватьЗакрытыеВзаиморасчеты = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЕСТЬNULL(Взаиморасчеты.ОтчетПоставщику.Статус, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыОстаткиВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ИсключенИзВзаиморасчетов), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ЗакрытыеПоДавности), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыОтчетаПоставщику.ПересортОрганизаций))
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И (Взаиморасчеты.ЗадолженностьПередПоставщиком <> 0
	               |			ИЛИ Взаиморасчеты.СуммаПоВзносам <> 0
	               |			ИЛИ Взаиморасчеты.КВПоВзносам <> 0
	               |			ИЛИ Взаиморасчеты.КВДоп <> 0
	               |			ИЛИ Взаиморасчеты.ПеречисленоПоставщику <> 0
	               |			ИЛИ Взаиморасчеты.ПоступилоОтПоставщика <> 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетПоставщику";
	ВыбранКонтрагент = НЕ Параметры.Поставщик.Пустая();	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = СтрЗаменить(ТекстБазовый,"1 = 1","ОплатыПолисов.Поставщик = (&Контрагент)");
	КонецЕсли;	
	//Если ДетализироватьОП Тогда
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
	//	|	КОНЕЦ","ВЫБОР
	//	|		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//	|			ТОГДА ОплатыПолисов.Ссылка
	//	|		ИНАЧЕ ОплатыПолисов.Ссылка
	//	|	КОНЕЦ");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"847 КАК ДопПоле"," ОплатыПолисов.Номер  как НомерОплаты,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь как Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер как НомерПолиса");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"КОНЕЦ
	//	|;","КОНЕЦ,
	//	| ОплатыПолисов.Номер,
	//	|	ОплатыПолисов.Дата,
	//	|	ОплатыПолисов.СтраховойПолис.Страхователь,
	//	|	ОплатыПолисов.СтраховойПолис.Номер
	//	|;							   
	//	|");							   
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"947 КАК ДопПоле","ВзаиморасчетыПоОплатам.НомерОплаты,
	//	|	ВзаиморасчетыПоОплатам.Дата,
	//	|	ВзаиморасчетыПоОплатам.Страхователь как Страхователь,
	//	|	ВзаиморасчетыПоОплатам.НомерПолиса как НомерПолиса");							     
	//	
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"848 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");
	//	ТекстБазовый = СтрЗаменить(ТекстБазовый,"849 КАК ДопПоле"," 1  как НомерОплаты,
	//	|	2,
	//	|	3,
	//	|	4");	
	//
	//	//Для каждого Поле из СхемаКомпоновкиДанных.ВычисляемыеПоля
	//КонецЕсли;							   
	//ТекстВыписки  = "ВЫБРАТЬ
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент КАК Организация,
	//								|	ПлатежныеВедомости.Ссылка.Контрагент КАК Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ КАК ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК Сортировка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ КАК Представление,
	//								|	СУММА(0) КАК ЗадолженностьПередПоставщиком,
	//								|	СУММА(0) КАК СуммаПоВзносам,
	//								|	СУММА(0) КАК КВПоВзносам,
	//								//|	СУММА(0) КАК КВПоВзносамОплаченнымПоставщику,
	//								|	СУММА(0) КАК КВДоп,
	//						   //     |	СУММА(0) КАК КВ,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
	//								|						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
	//								|				ТОГДА -ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
	//								|					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПеречисленоПоставщику,
	//								|	СУММА(ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
	//								|					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	//								|				ТОГДА ПлатежныеВедомости.Сумма
	//								|			ИНАЧЕ 0
	//								|		КОНЕЦ) КАК ПоступилоОтПоставщика,
	//								|	ПлатежныеВедомости.Ссылка КАК Регистратор,
	//								|	1 КАК КоличествоВГруппе,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ КАК ОтчетПоставщикуДата,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ КАК ВидСП,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер
	//								|ПОМЕСТИТЬ ВзаиморасчетыПоПлатежам
	//								|ИЗ
	//								|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	//								|ГДЕ
	//								|	1 = 1
	//								|	И ПлатежныеВедомости.Ссылка.Проведен
	//								|	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	//								|	И ВЫБОР
	//								|			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
	//								|				ТОГДА ИСТИНА
	//								|			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	//								|					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
	//								|		КОНЕЦ
	//								|	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу),ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
	//								|
	//								|СГРУППИРОВАТЬ ПО
	//								|	ПлатежныеВедомости.Ссылка.Контрагент,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.ОтчетПоставщику,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	//								|			ТОГДА ""Начальный остаток""
	//								|		ИНАЧЕ ВЫБОР
	//								|				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|					ТОГДА ПлатежныеВедомости.Ссылка
	//								|				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
	//								|			КОНЕЦ
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
	//								|	ПлатежныеВедомости.ОтчетПоставщику.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
	//								|	КОНЕЦ,
	//								|	ПлатежныеВедомости.Ссылка.ФормаОплаты,
	//								|	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
	//								|	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента,
	//								|	ПлатежныеВедомости.Ссылка.Дата,
	//								|	ПлатежныеВедомости.Ссылка.Номер,
	//								|	ВЫБОР
	//								|		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	//								|			ТОГДА ПлатежныеВедомости.Ссылка.Дата
	//								|		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
	//								|	КОНЕЦ
	//								|;
	//								|
	//								|////////////////////////////////////////////////////////////////////////////////
	//								|ВЫБРАТЬ
	//								|	ВзаиморасчетыПоПлатежам.Организация,
	//								|	ВзаиморасчетыПоПлатежам.Контрагент,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.Сортировка,
	//								|	ВзаиморасчетыПоПлатежам.Представление,
	//								|	ВзаиморасчетыПоПлатежам.ЗадолженностьПередПоставщиком,
	//								|	ВзаиморасчетыПоПлатежам.СуммаПоВзносам,
	//								|	ВзаиморасчетыПоПлатежам.КВПоВзносам,
	//								//|	ВзаиморасчетыПоПлатежам.КВПоВзносамОплаченнымПоставщику,
	//							 //   |	ВзаиморасчетыПоПлатежам.КВ,
	//								|	ВзаиморасчетыПоПлатежам.КВДоп,
	//								|	ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика,
	//								|	ВзаиморасчетыПоПлатежам.ПоступилоОтПоставщика - ВзаиморасчетыПоПлатежам.ПеречисленоПоставщику КАК Задолженность2,
	//								|	ВзаиморасчетыПоПлатежам.Регистратор,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
	//								|	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
	//								//|	ВзаиморасчетыПоПлатежам.КоличествоВГруппе КАК Элементов,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомерОтчетаПоставщику,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуНомер,
	//								|	ВзаиморасчетыПоПлатежам.ОтчетПоставщикуДата,
	//								|	ВзаиморасчетыПоПлатежам.ВидСП,
	//								|	ВзаиморасчетыПоПлатежам.ФормаОплаты,
	//								|	ВзаиморасчетыПоПлатежам.НаправлениеРасчетов,
	//								|	ВзаиморасчетыПоПлатежам.НомерВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.ДатаВходящегоДокумента,
	//								|	ВзаиморасчетыПоПлатежам.Дата,
	//								|	ВзаиморасчетыПоПлатежам.Номер
	//								|ИЗ
	//								|	ВзаиморасчетыПоПлатежам КАК ВзаиморасчетыПоПлатежам
	//								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
	//								|		ПО ВзаиморасчетыПоПлатежам.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ";	
	Если ВыбранКонтрагент Тогда
		ТекстБазовый = Стрзаменить(ТекстБазовый,"2 = 2","ПлатежныеВедомости.Ссылка.Контрагент = &Контрагент");
		ТекстБазовый = Стрзаменить(ТекстБазовый,"3 = 3","ДВОУ.Поставщик = &Контрагент");
	КонецЕсли;
	Возврат ТекстБазовый;//+"
	//|Объединить 
	//|"+ТекстВыписки;
	
КонецФункции	


Функция ТекстЗапросДляСИсторией(Параметры)
	Возврат "  ВЫБРАТЬ
|	ВЫРАЗИТЬ(ИР.ОбъектИстории КАК Документ.уб_ОплатаПолисов) КАК ОбъектИстории,
|	ИР.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
|	ИР.ЗначениеРеквизита
|ПОМЕСТИТЬ ВТ_ИР
|ИЗ
|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
|			&ДатаСреза,
|			ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
|				И РеквизитОбъекта <> ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)
|				И РеквизитОбъекта.Наименование В (""ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"", ""КВСуммаДляОтчета"", ""КВСумма"", ""ОтчетПоставщику"", ""НеВключатьВОтчетыПоставщикам"", ""ПометкаУдаления"", ""ФормаОплаты"")) КАК ИР
|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ВТ_ИР.ОбъектИстории КАК оплата
|ПОМЕСТИТЬ Оплаты
|ИЗ
|	ВТ_ИР КАК ВТ_ИР
|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Оплаты.оплата,
|	ЕСТЬNULL(ир_Отчет.ЗначениеРеквизита, ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)) КАК ОтчетПоставщику,
|	ЕСТЬNULL(ир_СуммаВзносов.ЗначениеРеквизита, 0) КАК СуммаПоВзносам,
|	ЕСТЬNULL(ир_КВСуммаДляОтчета.ЗначениеРеквизита, 0) КАК КВПоВзносам,
|	ЕСТЬNULL(ир_КВСумма.ЗначениеРеквизита, 0) КАК КВСумма,
|	ВЫБОР
|		КОГДА уб_ОтчетПоставщику.ДатаСогласования ЕСТЬ NULL 
|				ИЛИ уб_ОтчетПоставщику.ДатаСогласования > &ДатаСреза
|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
|		ИНАЧЕ уб_ОтчетПоставщику.ДатаСогласования
|	КОНЕЦ КАК ДатаСогласования,
|	ЕСТЬNULL(ир_ПометкаУдаления.ЗначениеРеквизита, ЛОЖЬ) КАК ПометкаУдаления,
|	ЕСТЬNULL(ир_НеВключатьВОтчетыПоставщикам.ЗначениеРеквизита, ЛОЖЬ) КАК НеВключатьВОтчетыПоставщикам,
|	ЕСТЬNULL(ир_ФормаОплаты.ЗначениеРеквизита, ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)) КАК ФормаОплаты,
|	ЕСТЬNULL(уб_ОтчетПоставщику.Дата, Оплаты.оплата.Дата) КАК ОтчетПоставщикуДата
|ПОМЕСТИТЬ ОплатыРекв
|ИЗ
|	Оплаты КАК Оплаты
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_Отчет
|		ПО Оплаты.оплата = ир_Отчет.ОбъектИстории
|			И (ир_Отчет.НаименованиеРеквизита = ""ОтчетПоставщику"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_СуммаВзносов
|		ПО Оплаты.оплата = ир_СуммаВзносов.ОбъектИстории
|			И (ир_СуммаВзносов.НаименованиеРеквизита = ""ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_КВСуммаДляОтчета
|		ПО Оплаты.оплата = ир_КВСуммаДляОтчета.ОбъектИстории
|			И (ир_КВСуммаДляОтчета.НаименованиеРеквизита = ""КВСуммаДляОтчета"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_КВСумма
|		ПО Оплаты.оплата = ир_КВСумма.ОбъектИстории
|			И (ир_КВСумма.НаименованиеРеквизита = ""КВСумма"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_ПометкаУдаления
|		ПО Оплаты.оплата = ир_ПометкаУдаления.ОбъектИстории
|			И (ир_ПометкаУдаления.НаименованиеРеквизита = ""ПометкаУдаления"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_НеВключатьВОтчетыПоставщикам
|		ПО Оплаты.оплата = ир_НеВключатьВОтчетыПоставщикам.ОбъектИстории
|			И (ир_НеВключатьВОтчетыПоставщикам.НаименованиеРеквизита = ""НеВключатьВОтчетыПоставщикам"")
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИР КАК ир_ФормаОплаты
|		ПО Оплаты.оплата = ир_ФормаОплаты.ОбъектИстории
|			И (ир_ФормаОплаты.НаименованиеРеквизита = ""ФормаОплаты"")
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОтчетПоставщику КАК уб_ОтчетПоставщику
|		ПО (уб_ОтчетПоставщику.Ссылка = ЕСТЬNULL(ир_Отчет.ЗначениеРеквизита, ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)))
|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ОплатыРекв.оплата,
|	ОплатыРекв.оплата.ОтчетПоставщику КАК ТекОтчетПоставщику,
|	ОплатыРекв.ОтчетПоставщику,
|	ВЫРАЗИТЬ(ОплатыРекв.СуммаПоВзносам КАК ЧИСЛО(15, 2)) КАК СуммаПоВзносам,
|	ВЫРАЗИТЬ(ОплатыРекв.КВПоВзносам КАК ЧИСЛО(15, 2)) КАК КВПоВзносам,
|	ВЫРАЗИТЬ(ОплатыРекв.КВСумма КАК ЧИСЛО(15, 2)) КАК КВСумма,
|	(ВЫРАЗИТЬ(ОплатыРекв.КВСумма КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(ОплатыРекв.КВПоВзносам КАК ЧИСЛО(15, 2))) КАК КВДоп,
|	ОплатыРекв.ДатаСогласования,
|	ОплатыРекв.ПометкаУдаления,
|	ВЫБОР
|		КОГДА ОплатыРекв.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|			ТОГДА ""Не включены в отчет""
|		КОГДА ОплатыРекв.ДатаСогласования = ДАТАВРЕМЯ(1, 1, 1)
|			ТОГДА ""Не согласован""
|		ИНАЧЕ ""Согласован""
|	КОНЕЦ КАК Стадия,
|	ОплатыРекв.ОтчетПоставщикуДата,
|	0 КАК ПоступилоОтПоставщика,
|	ВЫБОР
|		КОГДА ОплатыРекв.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
|				И ОплатыРекв.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|			ТОГДА ВЫРАЗИТЬ(ОплатыРекв.СуммаПоВзносам КАК ЧИСЛО(15, 2))
|		ИНАЧЕ 0
|	КОНЕЦ КАК ПеречисленоПоставщику
|ПОМЕСТИТЬ Взаиморасчеты
|ИЗ
|	ОплатыРекв КАК ОплатыРекв
|ГДЕ
|	Выбор когда &ДетализироватьОП Тогда ОплатыРекв.Оплата.Дата>ДАТАВРЕМЯ(2011, 1, 1) Иначе ОплатыРекв.ОтчетПоставщикуДата > ДАТАВРЕМЯ(2011, 1, 1) Конец
|	И ОплатыРекв.ПометкаУдаления = ЛОЖЬ
|	И ОплатыРекв.оплата.ПометкаУдаления = ЛОЖЬ
|	И ОплатыРекв.НеВключатьВОтчетыПоставщикам = ЛОЖЬ
|	И ВЫБОР
|			КОГДА ОплатыРекв.оплата.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
|				ТОГДА ИСТИНА
|			ИНАЧЕ ВЫБОР
|					КОГДА ОплатыРекв.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|						ТОГДА ОплатыРекв.оплата.Дата >= ОплатыРекв.оплата.Поставщик.ДатаВеденияВзаиморасчётов
|					ИНАЧЕ ОплатыРекв.ОтчетПоставщикуДата >= ОплатыРекв.оплата.Поставщик.ДатаВеденияВзаиморасчётов
|				КОНЕЦ
|		КОНЕЦ
|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ различные
|	Взаиморасчеты.Стадия,
|	Взаиморасчеты.Оплата,
|	СУММА(Взаиморасчеты.СуммаПоВзносам - Взаиморасчеты.КВПоВзносам - Взаиморасчеты.КВДоп + Взаиморасчеты.ПоступилоОтПоставщика - Взаиморасчеты.ПеречисленоПоставщику) КАК Задолженность
|Поместить ИзИстории
|ИЗ
|	Взаиморасчеты КАК Взаиморасчеты

|СГРУППИРОВАТЬ ПО
|	Взаиморасчеты.Стадия,
|	Взаиморасчеты.Оплата
|;
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|				   	ОплатыПолисов.ОрганизацияАгент КАК Организация,
|				   	ОплатыПолисов.Поставщик КАК Контрагент,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА Выбор Когда ОплатыПолисов.ФормаОплаты = Значение(Перечисление.уб_ФормыОплаты.Поставщику) Тогда
|					   ""По оплатам в СК не включенным в отчет""
|				   	Иначе ""По оплатам брокеру не включенным в отчет"" Конец
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ КАК ОтчетПоставщику,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА &ДоДаты
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
|				   	КОНЕЦ КАК Сортировка,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА Выбор Когда ОплатыПолисов.ФормаОплаты = Значение(Перечисление.уб_ФормыОплаты.Поставщику) Тогда
|					   ""По оплатам в СК не включенным в отчет""
|				   	Иначе ""По оплатам брокеру не включенным в отчет"" Конец
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ КАК Представление,
|				   	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
|				   			КОГДА &БезДопКВ
|				   				ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
|				   			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
|				   		КОНЕЦ) КАК ЗадолженностьПередПоставщиком,
|				   	СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК СуммаПоВзносам,
|				   	СУММА(ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))) КАК КВПоВзносам,
|				   	СУММА(ВЫБОР
|				   			КОГДА &БезДопКВ
|				   				ТОГДА 0
|				   			ИНАЧЕ ВЫРАЗИТЬ(ОплатыПолисов.КВСумма - ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2))
|				   		КОНЕЦ) КАК КВДоп,
|				   	СУММА(Выбор когда ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка) и ОплатыПолисов.ФормаОплаты = Значение(Перечисление.уб_ФормыОплаты.Поставщику) Тогда ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику Иначе 0 Конец ) КАК ПеречисленоПоставщику,
|				   	СУММА(0) КАК ПоступилоОтПоставщика,
|				   	ВЫБОР
|				   		КОГДА &ДетализироватьОП = ИСТИНА
|				   			ТОГДА ОплатыПолисов.Ссылка
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.Ссылка
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ КАК Регистратор,
|				   	1 КАК КоличествоВГруппе,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ""Не включены в отчет""
|						//КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
|						//	ТОГДА 1
|						КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
|							""Не согласован""
|				   		ИНАЧЕ ""Согласован""
|				   	КОНЕЦ КАК Стадия,
|				   	ОплатыПолисов.ОтчетПоставщику.Номер,
|				   	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
|				   ВЫБОР
|				   		КОГДА &ДетализироватьОП = ИСТИНА
|				   			ТОГДА ОплатыПолисов.Дата
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.Дата
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
|				   	КОНЕЦ как ОтчетПоставщикуДата,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
|				   	КОНЕЦ КАК ВидСП,
|				   	ОплатыПолисов.ОтчетПоставщику.ВидОперации КАК НаправлениеРасчетов,
|				   	"""" КАК НомерВходящегоДокумента,
|				   	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
|				   	ОплатыПолисов.Номер КАК НомерОплаты,
|				   	ОплатыПолисов.Дата,
|				   	ПРЕДСТАВЛЕНИЕ(ОплатыПолисов.СтраховойПолис.Страхователь) КАК Страхователь,
|				   	ОплатыПолисов.СтраховойПолис.Номер КАК НомерПолиса
|				   ПОМЕСТИТЬ ВТ_Взаиморасчеты
|				   ИЗ
|				   	Документ.уб_ОплатаПолисов КАК ОплатыПолисов
|				   		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект.СрезПоследних КАК уб_ИсторияОбъектСрезПоследних
|				   		ПО ОплатыПолисов.ОтчетПоставщику = уб_ИсторияОбъектСрезПоследних.ОбъектИстории
|				   ГДЕ
|				   	1 = 2
|				   	И НЕ ОплатыПолисов.ПометкаУдаления
|				   	И ВЫБОР
|				   			КОГДА &ИсключатьНесогласованные = ИСТИНА
|				   					И ВЫБОР
|				   						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   							ТОГДА ИСТИНА
|				   						ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата > ДАТАВРЕМЯ(2013, 8, 1)
|				   					КОНЕЦ
|				   				ТОГДА ВЫБОР
|				   						КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   							ТОГДА ЛОЖЬ
|				   						ИНАЧЕ ВЫБОР
|				   								КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
|				   										И НЕ ОплатыПолисов.ОтчетПоставщику.ИтогОС_КПеречислениюПоставщику < 0
|				   									ТОГДА ЛОЖЬ
|				   								ИНАЧЕ ИСТИНА
|				   							КОНЕЦ
|				   					КОНЕЦ
|				   			ИНАЧЕ ИСТИНА
|				   		КОНЕЦ
|				   	И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
|				   	И ВЫБОР
|				   			КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
|				   				ТОГДА ИСТИНА
|				   			ИНАЧЕ ВЫБОР
|				   					КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   						ТОГДА ОплатыПолисов.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
|				   					ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
|				   				КОНЕЦ
|				   		КОНЕЦ
|				   
|				   СГРУППИРОВАТЬ ПО
|				   	ОплатыПолисов.Поставщик,
|				   	ОплатыПолисов.ОрганизацияАгент,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.ФормаОплаты
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА &ДоДаты
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.Ссылка
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА &ДетализироватьОП = ИСТИНА
|				   			ТОГДА ОплатыПолисов.Ссылка
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.Ссылка
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА 0
|				   		ИНАЧЕ 1
|				   	КОНЕЦ,
|				   	ОплатыПолисов.ОтчетПоставщику.НомерОтчетаПоставщику,
|				   	ОплатыПолисов.ОтчетПоставщику.Номер,
|				   	ВЫБОР
|				   		КОГДА &ДетализироватьОП = ИСТИНА
|				   			ТОГДА ОплатыПолисов.Дата
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ОплатыПолисов.Дата
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.ВидСП
|				   	КОНЕЦ,
|				   	ОплатыПолисов.ОтчетПоставщику.ВидОперации,
|				   ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ""Не включены в отчет""
|						//КОГДА НЕ ЕСТЬNULL(уб_ИсторияОбъектСрезПоследних.ВерсияАктуальна, ЛОЖЬ)
|						//	ТОГДА 1
|						КОГДА ЕСТЬNULL(ОплатыПолисов.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
|							""Не согласован""
|				   		ИНАЧЕ ""Согласован""
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА Выбор Когда ОплатыПолисов.ФормаОплаты = Значение(Перечисление.уб_ФормыОплаты.Поставщику) Тогда
|					   ""По оплатам в СК не включенным в отчет""
|				   	Иначе ""По оплатам брокеру не включенным в отчет"" Конец
|				   		ИНАЧЕ ОплатыПолисов.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ОплатыПолисов.Номер,
|				   	ОплатыПолисов.Дата,
|				   	ОплатыПолисов.СтраховойПолис.Страхователь,
|				   	ОплатыПолисов.СтраховойПолис.Номер
|				   
|				   ОБЪЕДИНИТЬ
|				   
|				   ВЫБРАТЬ
|				   	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
|				   	ПлатежныеВедомости.Ссылка.Контрагент,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
|				   			ТОГДА ""Начальный остаток""
|				   		ИНАЧЕ ВЫБОР
|				   				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   					ТОГДА ПлатежныеВедомости.Ссылка
|				   				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
|				   			КОНЕЦ
|				   	КОНЕЦ,
|				   	СУММА(0),
|				   	СУММА(0),
|				   	СУММА(0),
|				   	СУММА(0),
|				   	СУММА(ВЫБОР
|				   			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
|				   					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
|				   				ТОГДА ПлатежныеВедомости.Сумма
|				   			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
|				   					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Корректировка)
|				   						И ПлатежныеВедомости.Ссылка.Категория = ЗНАЧЕНИЕ(Перечисление.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят)
|				   				ТОГДА -ПлатежныеВедомости.Сумма
|				   			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ПриемкаОплат
|				   					И ПлатежныеВедомости.ОтчетПоставщику.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
|				   				ТОГДА ПлатежныеВедомости.Сумма
|				   			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
|				   					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
|				   				ТОГДА ПлатежныеВедомости.Сумма
|				   			ИНАЧЕ 0
|				   		КОНЕЦ),
|				   	СУММА(ВЫБОР
|				   			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
|				   				ТОГДА ПлатежныеВедомости.Сумма
|				   			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ВзаиморасчетСПоставщиком
|				   					И ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
|				   				ТОГДА ПлатежныеВедомости.Сумма
|				   			ИНАЧЕ 0
|				   		КОНЕЦ),
|				   	ПлатежныеВедомости.Ссылка,
|				   	1,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка) или ПлатежныеВедомости.ОтчетПоставщику = Неопределено
|				   		Тогда ""Не подвязан платеж"" 
|				   		Когда ЕСТЬNULL(ПлатежныеВедомости.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1) 
|				   		Тогда ""Не согласован"" 
|				   		Иначе ""Согласован"" 
|				   		Конец,
|				   	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
|				   	ПлатежныеВедомости.ОтчетПоставщику.Номер,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка) или НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
|				   			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
|				   	КОНЕЦ,
|				   	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
|				   	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
|				   	КОНЕЦ,
|				   	1,
|				   	2,
|				   	3,
|				   	4
|				   ИЗ
|				   	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
|				   ГДЕ
|				   	2 = 2
|				   	И ПлатежныеВедомости.Ссылка.Проведен
|				   	И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
|				   	И ВЫБОР
|				   			КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
|				   				ТОГДА ИСТИНА
|				   			КОГДА ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
|				   					И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   				ТОГДА ПлатежныеВедомости.ОтчетПоставщику.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
|				   			ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
|				   		КОНЕЦ
|				   	И НЕ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов В (ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу), ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу))
|				   
|				   СГРУППИРОВАТЬ ПО
|				   	ПлатежныеВедомости.Ссылка.Контрагент,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
|				   	КОНЕЦ,
|				   	ПлатежныеВедомости.ОтчетПоставщику,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
|				   	КОНЕЦ,
|				   	ПлатежныеВедомости.Ссылка,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
|				   			ТОГДА ""Начальный остаток""
|				   		ИНАЧЕ ВЫБОР
|				   				КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   					ТОГДА ПлатежныеВедомости.Ссылка
|				   				ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику
|				   			КОНЕЦ
|				   	КОНЕЦ,
|				   	ПлатежныеВедомости.Ссылка.ОрганизацияАгент,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка) или ПлатежныеВедомости.ОтчетПоставщику = Неопределено
|				   		Тогда ""Не подвязан платеж"" 
|				   		Когда ЕСТЬNULL(ПлатежныеВедомости.ОтчетПоставщику.ДатаСогласования, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1) 
|				   		Тогда ""Не согласован"" 
|				   		Иначе ""Согласован"" 
|				   		Конец,
|				   	ПлатежныеВедомости.ОтчетПоставщику.НомерОтчетаПоставщику,
|				   	ПлатежныеВедомости.ОтчетПоставщику.Номер,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка) или НЕ ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
|				   			ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.ВидСП
|				   	КОНЕЦ,
|				   	ПлатежныеВедомости.Ссылка.НаправлениеРасчетов,
|				   	ПлатежныеВедомости.Ссылка.НомерВходящегоДокумента,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.Ссылка.ДатаВходящегоДокумента
|				   	КОНЕЦ,
|				   	ВЫБОР
|				   		КОГДА ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
|				   			ТОГДА ПлатежныеВедомости.Ссылка.Дата
|				   		ИНАЧЕ ПлатежныеВедомости.ОтчетПоставщику.Дата
|				   	КОНЕЦ
|				   
|				   ОБЪЕДИНИТЬ
|				   
|				   ВЫБРАТЬ
|				   	ДВОУ.ОрганизацияАгент,
|				   	ДВОУ.Поставщик,
|				   	ДВОУ.Ссылка,
|				   	ДВОУ.Ссылка.Дата,
|				   	ДВОУ.Ссылка,
|				   	СУММА(0),
|				   	СУММА(ВЫБОР
|				   			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
|				   				ТОГДА ДВОУ.СуммаДокумента
|				   			ИНАЧЕ 0
|				   		КОНЕЦ),
|				   	СУММА(ВЫБОР
|				   			КОГДА ДВОУ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
|				   				ТОГДА ДВОУ.СуммаДокумента
|				   			ИНАЧЕ 0
|				   		КОНЕЦ),
|				   	СУММА(0),
|				   	СУММА(0),
|				   	СУММА(0),
|				   	ДВОУ.Ссылка,
|				   	1,
|				   	""Согласован"",
|				   	ДВОУ.ВнешнийНомер,
|				   	ДВОУ.Номер,
|				   	ДВОУ.Дата,
|				   	ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка),
|				   	ДВОУ.ВидОперации,
|				   	"""",
|				   	ДВОУ.Дата,
|				   	1,
|				   	2,
|				   	3,
|				   	4
|				   ИЗ
|				   	Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
|				   ГДЕ
|				   	3 = 3
|				   	И ДВОУ.Ссылка.Проведен
|				   	И ВЫБОР
|				   			КОГДА ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
|				   				ТОГДА ИСТИНА
|				   			ИНАЧЕ ДВОУ.Дата >= ДВОУ.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов
|				   		КОНЕЦ
|				   
|				   СГРУППИРОВАТЬ ПО
|				   	ДВОУ.Поставщик,
|				   	ДВОУ.Дата,
|				   	ДВОУ.Ссылка,
|				   	ДВОУ.ОрганизацияАгент,
|				   	ДВОУ.ВнешнийНомер,
|				   	ДВОУ.ВидОперации,
|				   	ДВОУ.Номер,
|				   	ДВОУ.Ссылка.Дата,
|				   	ДВОУ.Ссылка,
|				   	ДВОУ.Ссылка,""Согласован""
|				   ;
|				   
|				   ////////////////////////////////////////////////////////////////////////////////
|				   ВЫБРАТЬ
|				   	Взаиморасчеты.Организация,
|				   	Взаиморасчеты.Контрагент,
|				   	Взаиморасчеты.ОтчетПоставщику КАК ОтчетПоставщику,
|				   	Взаиморасчеты.Сортировка,
|				   	Взаиморасчеты.Представление,
|				   	Взаиморасчеты.ЗадолженностьПередПоставщиком КАК ЗадолженностьПередПоставщиком,
|				   	Взаиморасчеты.СуммаПоВзносам,
|				   	Взаиморасчеты.КВПоВзносам,
|				   	Взаиморасчеты.КВДоп,
|				   	Взаиморасчеты.ПеречисленоПоставщику КАК ПеречисленоПоставщику,
|				   	Взаиморасчеты.ПоступилоОтПоставщика КАК ПоступилоОтПоставщика,
|				   	Выразить (Взаиморасчеты.СуммаПоВзносам как Число (15,2)) - Выразить (Взаиморасчеты.КВПоВзносам как Число (15,2)) - Выразить (Взаиморасчеты.КВДоп  как Число (15,2))+ Выразить (Взаиморасчеты.ПоступилоОтПоставщика как Число (15,2)) - Выразить (Взаиморасчеты.ПеречисленоПоставщику как Число (15,2)) КАК Задолженность2,
|				   	Взаиморасчеты.Регистратор,
|				   	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийДляСК, """") КАК КомментарийДляСК,
|				   	ЕСТЬNULL(уб_КомментарииКВзаиморасчетам.КомментарийВнутренний, """") КАК КомментарийВнутренний,
|				   	Взаиморасчеты.Стадия,
|				   	Взаиморасчеты.ОтчетПоставщикуНомерОтчетаПоставщику,
|				   	Взаиморасчеты.ОтчетПоставщикуНомер,
|				   	Взаиморасчеты.ОтчетПоставщикуДата,
|				   	Взаиморасчеты.ВидСП,
|				   	Взаиморасчеты.НаправлениеРасчетов КАК НаправлениеРасчетов,
|				   	Взаиморасчеты.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
|				   	Взаиморасчеты.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
|				   	Взаиморасчеты.НомерОплаты,
|				   	Взаиморасчеты.Дата,
|				   	Взаиморасчеты.Страхователь КАК Страхователь,
|				   	Взаиморасчеты.НомерПолиса КАК НомерПолиса
|				   	Поместить ВЗ
|				   ИЗ
|				   	ВТ_Взаиморасчеты КАК Взаиморасчеты
|				   		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КомментарииКВзаиморасчетам КАК уб_КомментарииКВзаиморасчетам
|				   		ПО Взаиморасчеты.ОтчетПоставщику = уб_КомментарииКВзаиморасчетам.Документ
|				   ГДЕ
|				   	Взаиморасчеты.ОтчетПоставщикуДата > Датавремя(2011,1,1) 
|				   
|				   //УПОРЯДОЧИТЬ ПО
|				   //	ОтчетПоставщику
|			 	  ;
|			 	  Выбрать Стадия, Сумма(Задолженность) из (
|			 Выбрать Стадия, Сумма(Задолженность2) как Задолженность из ВЗ ГДЕ 1=1 
|			   	 Сгруппировать по Стадия
|			 Объединить ВСЕ 
|			 Выбрать Стадия,Сумма(Задолженность) из ИзИстории  ГДЕ 1=1  Сгруппировать по Стадия  
|			 ) как  Влож
|			 
|			 Сгруппировать по Стадия  ";
			 //;
			 //Выбрать //Первые 10 
			 //   изИстории.Стадия, Задолженность2,Задолженность,изИстории.Оплата,IsNull(ВЗ.Задолженность2,0) -IsNull(изИстории.Задолженность,0),ВЗ.Регистратор из  изИстории
			 //Полное Соединение
			 //ВЗ
			 // по изИстории.Оплата = ВЗ.Регистратор
			 //// 	//И изИстории.Стадия = ВЗ.Стадия
			 //ГДЕ  IsNull(ВЗ.Задолженность2,0) <> IsNull(изИстории.Задолженность,0)
			 	
			 
			 //;
			 //Выбрать Стадия, Сумма(Задолженность) как Задолженность из изИстории Сгруппировать по Стадия
			 
			 //////ВЗ.ОтчетПоставщикуДата > Датавремя(2011,1,1)
			 //// //и 
			 // Задолженность2 <>Задолженность
			 // //и (Задолженность2-Задолженность)>1
			 //	//ВЗ.ОтчетПоставщику  есть Null";
КонецФункции



Функция ПредставлениеПлатежа(Данные)
	
	Префикс = "Платеж";
	пВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов;
	Если Данные.НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщику Тогда
		Префикс = "Платеж поставщику";
	ИначеЕсли Данные.НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщикуСтрахователем Тогда		
		Префикс = "Оплата страхователем напрямую";
	ИначеЕсли Данные.НаправлениеРасчетов = пВидОперации.ПоступлениеКВОтПоставщика Тогда			
		Префикс = "Возврат КВ";
	ИначеЕсли Данные.НаправлениеРасчетов = пВидОперации.НачальныйОстаток Тогда			
		Префикс = "Начальный остаток";
	ИначеЕсли Данные.НаправлениеРасчетов = пВидОперации.Корректировка Тогда	
		Префикс = "Корректировка";
	КонецЕсли;	
	Номер=?(ЗначениеЗаполнено(Данные.НомерВходящегоДокумента)," № "+СокрЛП(Данные.НомерВходящегоДокумента),"");
	Возврат  Префикс + Номер +" от " + Формат(Данные.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
	
КонецФункции	




