Перем Организации;
Перем УИДБАЗЫ;
Процедура ЗагрузитьДокументы() Экспорт
	Организации = Новый Соответствие;
	Выборка = СправочниКи.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Организации.Вставить(Выборка.ИНН,Выборка.Ссылка);
	КонецЦикла;	
	СписокЗагруженных = Новый Массив;
	Если v="v82" Тогда
		ПараметрСоединения  = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии82;
		УИДБАЗЫ = Лев("БП20                    ",9);
		Дата1 = Дата(2011,1,1);
		Дата2 = КонецМесяца(ТекущаяДата());
	ИначеЕсли v="v81" Тогда
		ПараметрСоединения  = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии81;
		УИДБАЗЫ = Лев("БП16                    ",9);
		Дата1 = Дата(2001,1,1);
		Дата2 = Дата(2010,12,31,23,59,59);
	Иначе
		 #Если Клиент Тогда
		 	Предупреждение("Не известная база",4);
		 #КонецЕсли
		 Возврат;
	КонецЕсли;	
	
	Base_COM = Неопределено;
	Если уб_ОбменДанными.ПодключитьСоединение(Base_COM, ПараметрСоединения, v) Тогда
	Иначе
		Возврат;
	КонецЕсли;	
	ТаблицаИсключенийВрем  = ЗначениеизСтрокиВнутр(ТаблицаИсключенийСтрока); 
	ТаблицаИсключений = ТаблицаИсключенийВрем.СКопировать();
	
	ТаблицаИсключений.Очистить();
	
	Для каждого СтрокаИскл Из ТаблицаИсключенийВрем Цикл
		НоваяСтрока = ТаблицаИсключений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИскл);
		Если СтрокаИскл.Направление = "" Тогда
			НоваяСтрока.Направление ="ПоступлениеКВОтПоставщика";
			НоваяСтрока = ТаблицаИсключений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИскл);
			НоваяСтрока.Направление ="ПеречислениеПоставщику";
		КонецЕсли;	
	КонецЦикла;	
	//Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Валюта = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
	Запрос = Base_COM.NewObject("Запрос");
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	""Поступление на расчетный счет"" КАК Вид,
	|	""ПоступлениеКВОтПоставщика"" КАК Направление,
	|	""Безналично"" КАК ФормаОплаты,
	|	Документ.Ссылка,
	|	Документ.СуммаПлатежа,
	|	Документ.ДоговорКонтрагента,
	|	Документ.ДоговорКонтрагента.Владелец как Контрагент,
	|	Документ.КратностьВзаиморасчетов,
	|	Документ.СуммаВзаиморасчетов,
	|	Документ.СтатьяДвиженияДенежныхСредств,
	|	Документ.СчетУчетаРасчетовПоАвансам,
	|	Документ.СчетУчетаРасчетовСКонтрагентом,
	|	Документ.Ссылка.Дата как Дата,
	|	Документ.Ссылка.ВидОперации как ВидОперации,
	|	Документ.Ссылка.Организация как Организация,
	|	Документ.Ссылка.Проведен как Проведен,
	|	Документ.Ссылка.НазначениеПлатежа как Комментарий,
	|	Документ.Ссылка.СтатьяДвиженияДенежныхСредств как СтатьяДвиженияДенежныхСредств2,
	|   Документ.Ссылка.НомерВходящегоДокумента как НомерВходящегоДокумента,
	|   Документ.Ссылка.ДатаВходящегоДокумента как ДатаВходящегоДокумента
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК Документ
	|ГДЕ
	|	1 = 1
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""Списание с расчетного счета"" КАК Вид,
	|	""ПеречислениеПоставщику"" КАК Направление,
	|	""Безналично"" КАК ФормаОплаты,
	|	Документ.Ссылка,
	|	Документ.СуммаПлатежа,
	|	Документ.ДоговорКонтрагента,
	|	Документ.ДоговорКонтрагента.Владелец как Контрагент,
	|	Документ.КратностьВзаиморасчетов,
	|	Документ.СуммаВзаиморасчетов,
	|	Документ.СтатьяДвиженияДенежныхСредств,
	|	Документ.СчетУчетаРасчетовПоАвансам,
	|	Документ.СчетУчетаРасчетовСКонтрагентом,
	|	Документ.Ссылка.Дата как Дата,
	|	Документ.Ссылка.ВидОперации как ВидОперации,
	|	Документ.Ссылка.Организация как Организация,
	|	Документ.Ссылка.Проведен как Проведен,
	|	Документ.Ссылка.НазначениеПлатежа как Комментарий,
	|	Документ.Ссылка.СтатьяДвиженияДенежныхСредств как СтатьяДвиженияДенежныхСредств2,
	|   Документ.Ссылка.НомерВходящегоДокумента как НомерВходящегоДокумента, Документ.Ссылка.ДатаВходящегоДокумента как ДатаВходящегоДокумента
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК Документ
	|ГДЕ
	|	1 = 1
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	""Выдача ДС из кассы"" КАК Вид,
	|	""ПеречислениеПоставщику"" КАК Направление,
	|	""Наличными"" КАК ФормаОплаты,
	|	Документ.Ссылка,
	|	Документ.СуммаПлатежа,
	|	Документ.ДоговорКонтрагента,
	|	Документ.ДоговорКонтрагента.Владелец как Контрагент,
	|	Документ.КратностьВзаиморасчетов,
	|	Документ.СуммаВзаиморасчетов,
	|	Документ.СтатьяДвиженияДенежныхСредств,
	|	Документ.СчетУчетаРасчетовПоАвансам,
	|	Документ.СчетУчетаРасчетовСКонтрагентом,
	|	Документ.Ссылка.Дата как Дата,
	|	Документ.Ссылка.ВидОперации как ВидОперации,
	|	Документ.Ссылка.Организация как Организация,
	|	Документ.Ссылка.Проведен как Проведен,
	|	Документ.Ссылка.Основание как Комментарий,
	|	Документ.Ссылка.СтатьяДвиженияДенежныхСредств как СтатьяДвиженияДенежныхСредств2,Null,Null
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК Документ
	|ГДЕ
	|	1 = 1
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	""Поступление ДС в кассу"" КАК Вид,
	|	""ПоступлениеКВОтПоставщика"" КАК Направление,
	|	""Наличными"" КАК ФормаОплаты,
	|	Документ.Ссылка,
	|	Документ.СуммаПлатежа,
	|	Документ.ДоговорКонтрагента,
	|	Документ.ДоговорКонтрагента.Владелец как Контрагент,
	|	Документ.КратностьВзаиморасчетов,
	|	Документ.СуммаВзаиморасчетов,
	|	Документ.СтатьяДвиженияДенежныхСредств,
	|	Документ.СчетУчетаРасчетовПоАвансам,
	|	Документ.СчетУчетаРасчетовСКонтрагентом,
	|	Документ.Ссылка.Дата как Дата,
	|	Документ.Ссылка.ВидОперации как ВидОперации,
	|	Документ.Ссылка.Организация как Организация,
	|	Документ.Ссылка.Проведен как Проведен,
	|	Документ.Ссылка.Основание как Комментарий,
	|	Документ.Ссылка.СтатьяДвиженияДенежныхСредств как СтатьяДвиженияДенежныхСредств2,Null,Null
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК Документ
	|ГДЕ
	|	1 = 1";
	
	Запрос.УстановитьПараметр("ДатаНач",Макс(Дата1,НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаКон",Мин(Дата2,КонецДня(ДатаОкончания)));
	
	ТекстУсловия ="";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстУсловия =ТекстУсловия+" И Документ.Ссылка.Дата>=&ДатаНач";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстУсловия =ТекстУсловия+" И Документ.Ссылка.Дата<=&ДатаКон";
	КонецЕсли;	
	
	РежимПроверкиНаличия=Истина;
	Если ЗначениеЗаполнено(Поставщик) И ЗначениеЗаполнено(Поставщик.ИНН) Тогда
		ТекстУсловия =ТекстУсловия+" И Документ.ДоговорКонтрагента.Владелец.ИНН=&ИНН";
		Запрос.УстановитьПараметр("ИНН",Поставщик.ИНН);
		РежимПроверкиНаличия = Ложь;
	КонецЕсли;	
	
	
	МассивИсключаемыхВидовОпераций = Новый Массив;
	Если v = "v82" Тогда
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.РасчетыПоКредитамИЗаймам);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочиеРасчетыСКонтрагентами);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание);
	Иначе
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику);
		МассивИсключаемыхВидовОпераций.Добавить(Base_COM.Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств);
		ТекстЗапроса = Стрзаменить(ТекстЗапроса,"Документ.ПоступлениеНаРасчетныйСчет","Документ.ПлатежноеПоручениеВходящее");
		ТекстЗапроса = Стрзаменить(ТекстЗапроса,"Документ.СписаниеСРасчетногоСчета","Документ.ПлатежноеПоручениеИсходящее");
		ТекстЗапроса = Стрзаменить(ТекстЗапроса,"Документ.Ссылка.НомерВходящегоДокумента как НомерВходящегоДокумента, Документ.Ссылка.ДатаВходящегоДокумента как ДатаВходящегоДокумента","Null,Null");
		
	КонецЕсли;
	СтрокаЗагружаемыхВидовДокументов ="";
	Если РКО Тогда
		СтрокаЗагружаемыхВидовДокументов =СтрокаЗагружаемыхВидовДокументов+"Выдача ДС из кассы";
	КонецЕсли;	
	Если ПКО Тогда
		СтрокаЗагружаемыхВидовДокументов =СтрокаЗагружаемыхВидовДокументов+"Поступление ДС в кассу";
	КонецЕсли;	
	Если СписаниеБанк Тогда
		СтрокаЗагружаемыхВидовДокументов =СтрокаЗагружаемыхВидовДокументов+"Списание с расчетного счета";
	КонецЕсли;	
	Если ПоступлениеБанк Тогда
		СтрокаЗагружаемыхВидовДокументов =СтрокаЗагружаемыхВидовДокументов+"Поступление на расчетный счет,";
	КонецЕсли;	
	
	ТекстЗапроса =Стрзаменить(ТекстЗапроса,"1 = 1","1 = 1"+ТекстУсловия);
	Запрос.Текст = ТекстЗапроса;
	Автор = ? (СокрЛП(ПараметрыСеанса.ТекущийПользователь)="Не авторизован",Справочники.Пользователи.Robot,ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().выбрать();
	Пока Выборка.Следующий() Цикл
		
		УИД = Base_COM.String(Выборка.Ссылка.УникальныйИдентификатор());
		КодСтатьи=КодСтатьи (Выборка.СтатьяДвиженияДенежныхСредств);
		//КодСтатьи2=КодСтатьи (Выборка.СтатьяДвиженияДенежныхСредств2);
		
		ДокументГрузится = Истина;
		Если Найти(СтрокаЗагружаемыхВидовДокументов,Выборка.Вид) = 0 Тогда
			ДокументГрузится = 0;
		ИначеЕсли НЕ МассивИсключаемыхВидовОпераций.Найти(Выборка.ВидОперации) = Неопределено Тогда	
			ДокументГрузится = Ложь;
			//Сообщить("Пропущена по виду операции: "+?(Об.Поставщик.Пустая(),Выборка.Контрагент.Наименование,Об.Поставщик)+" "+Формат(Об.Дата,"ДФ=dd.MM.yyyy"));		
		Иначе
			//  Сообщить(КодСтатьи);
			СтруктураПоискаИсключений = Новый Структура("Направление,КодСтатьи",Выборка.Направление,КодСтатьи);
			//СтруктураПоискаИсключений2 = Новый Структура("Направление,КодСтатьи",Выборка.Направление,КодСтатьи2);
			Если ТаблицаИсключений.НайтиСтроки(СтруктураПоискаИсключений).Количество()>0 Тогда
				ДокументГрузится = Ложь;
				//Сообщить("Пропущена по виду операции: "+?(Об.Поставщик.Пустая(),Выборка.Контрагент.Наименование,Об.Поставщик)+" "+Формат(Об.Дата,"ДФ=dd.MM.yyyy"));		
			КонецЕсли;	
		КонецЕсли;
		
		Если v = "v81" И ДокументГрузится Тогда
			
			Попытка 
				ДокументГрузится = Выборка.Ссылка.Оплачено;	
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
		Документ = ПолучитьДокументПоУИД(УИД);
		
		ДокументИзменен = Ложь;
		
		Если Документ.Пустая() Тогда
			ДокументИзменен = Истина;
			Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
			Об.Автор = Автор;
			Об.ДатаСоздания = ТекущаяДата();
		Иначе
			Об = Документ.ПолучитьОбъект();
			Если Об.НеИзменятьПриЗагрузке Тогда
				Если РежимПроверкиНаличия Тогда
					СписокЗагруженных.Добавить(Об.Ссылка);
				Конецесли;	
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ДокументГрузится Тогда
			ДокументИзменен = ПроверитьЗаполнить(Об,"IDизБухДок",УИДБАЗЫ+"!"+УИД,ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"Дата",Выборка.Дата,ДокументИзменен);
			
			Попытка
				ДокументИзменен = ПроверитьЗаполнить(Об,"НаправлениеРасчетов",Перечисления.уб_ВидОперацииВзаиморасчетов[Выборка.Направление],ДокументИзменен);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка преобразования перечисления ""Вид операции"" "+Выборка.Направление);
			КонецПопытки;	
			
			Попытка
				ДокументИзменен = ПроверитьЗаполнить(Об,"ФормаОплаты",Перечисления.уб_ФормаОплатыВзаиморасчеты[Выборка.ФормаОплаты],ДокументИзменен);
			Исключение
				
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка преобразования перечисления ""Форма оплаты"" "+Выборка.ФормаОплаты);
			КонецПопытки;		
			
			
			//	Если ЭтоКВ(Выборка,КодСтатьи) Тогда
			////		Об.СуммаКВ         = Выборка.СуммаПлатежа;
			//		Об.СуммаДокумента  = 0;
			//	Иначе	
			//		Об.СуммаДокумента  = Выборка.СуммаПлатежа;
			//		//Об.СуммаКВ         = 0;
			//	КонецЕсли;
			ДокументИзменен = ПроверитьЗаполнить(Об,"СуммаДокумента",Окр(Выборка.СуммаПлатежа,2),ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"Поставщик",ПолучитьПоставщика(Выборка.Контрагент),ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"Контрагент",ПолучитьПоставщика(Выборка.Контрагент),ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"ДокументБух",Base_COM.String(Выборка.Ссылка),ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"ОрганизацияАгент",ПолучитьОрганизацию(Выборка.Организация),ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"Комментарий",Выборка.Комментарий,ДокументИзменен);
			
			ДокументИзменен = ПроверитьЗаполнить(Об,"НомерВходящегоДокумента",Выборка.НомерВходящегоДокумента,ДокументИзменен);
			ДокументИзменен = ПроверитьЗаполнить(Об,"ДатаВходящегоДокумента",Выборка.ДатаВходящегоДокумента,ДокументИзменен);
			//
			ДокументГрузится = НЕ Об.Поставщик.Пустая() И НЕ Об.ОрганизацияАгент.Пустая();
		КонецЕсли;	
		
		Если Об.Ссылка = Неопределено Тогда
			Если ДокументГрузится = 0 Тогда
				//Этот вид вообще не грузится - не трогаем его
				ДокументГрузится = Ложь;
			КонецЕсли;	
		Иначе
			Если ДокументГрузится = 0 Тогда
				//Этот вид вообще не грузится - не трогаем его
				ДокументГрузится = Ложь;
			Иначе	
				Если (НЕ Выборка.Проведен ИЛИ НЕ ДокументГрузится) И Об.Проведен Тогда
					ДокументИзменен = Истина;
					Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Если РежимПроверкиНаличия Тогда
						СписокЗагруженных.Добавить(Об.Ссылка);
					Конецесли;	
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;	
		
		
		Если Выборка.Проведен И ДокументГрузится Тогда
			
			ДокументИзменен = ПроверитьЗаполнить(Об,"ПометкаУдаления",Ложь,ДокументИзменен);
			
			Если ДокументИзменен Тогда
				Об.Записать(РежимЗаписиДокумента.Проведение);
			Конецесли;	
			Если РежимПроверкиНаличия Тогда
				СписокЗагруженных.Добавить(Об.Ссылка);
			Конецесли;	
			#Если Клиент Тогда
			Состояние(Об.ДокументБух);
			#КонецЕсли
		Иначе
			//Состояние("НЕ"+Об.ДокументБух);
		КонецЕсли;	
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
	КонецЦикла;
	
	Если РежимПроверкиНаличия Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	уб_ВзаиморасчетСПоставщиком.Ссылка,
		                      |	уб_ВзаиморасчетСПоставщиком.ДокументИсточникОтсутствует
		                      |ИЗ
		                      |	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
		                      |ГДЕ
		                      |	НЕ уб_ВзаиморасчетСПоставщиком.IDизБухДок = &IDизБухДок
		                      |	И НЕ уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов В (&НаправлениеРасчетов)
		                      |	И уб_ВзаиморасчетСПоставщиком.Дата >= &Дата1
							  |	И уб_ВзаиморасчетСПоставщиком.Дата <= &Дата2");
		Запрос.УстановитьПараметр("IDизБухДок","");
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
		МассивИскл = Новый Массив;
		
		МассивИскл.Добавить(Перечисления.уб_ВидОперацииВзаиморасчетов.Корректировка);
		МассивИскл.Добавить(Перечисления.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток);
		МассивИскл.Добавить(Перечисления.уб_ВидОперацииВзаиморасчетов.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("НаправлениеРасчетов",МассивИскл);
		Запрос.УстановитьПараметр("ПоБанку",Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично);
		Запрос.УстановитьПараметр("Налом",Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
		Запрос.УстановитьПараметр("Поставщику",Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику);
		Запрос.УстановитьПараметр("ОтПоставщика",Перечисления.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика);
		ДопУсловие =" И (";
		ФлЕстьДоп=Ложь;
		Если РКО Тогда
			ДопУсловие = ДопУсловие+ ?(ФлЕстьДоп," ИЛИ ","")+"(уб_ВзаиморасчетСПоставщиком.ФормаОплаты = &Налом И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов = &Поставщику)";
			ФлЕстьДоп = Истина;
		КонецЕсли;	
		Если ПКО Тогда
			ДопУсловие = ДопУсловие+ ?(ФлЕстьДоп," ИЛИ ","")+"(уб_ВзаиморасчетСПоставщиком.ФормаОплаты = &Налом И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов = &ОтПоставщика)";
			ФлЕстьДоп = Истина;
		КонецЕсли;	
		Если СписаниеБанк Тогда
			ДопУсловие = ДопУсловие+ ?(ФлЕстьДоп," ИЛИ ","")+"(уб_ВзаиморасчетСПоставщиком.ФормаОплаты = &ПоБанку И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов = &Поставщику)";
			ФлЕстьДоп = Истина;
		КонецЕсли;	
		Если ПоступлениеБанк Тогда
			ДопУсловие = ДопУсловие+ ?(ФлЕстьДоп," ИЛИ ","")+"(уб_ВзаиморасчетСПоставщиком.ФормаОплаты = &ПоБанку И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов = &ОтПоставщика)";
			ФлЕстьДоп = Истина;
		КонецЕсли;	
		ДопУсловие=ДопУсловие+")";
		Запрос.Текст = Запрос.Текст+ДопУсловие;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//
			Если СписокЗагруженных.Найти(Выборка.Ссылка) = Неопределено Тогда 
				//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Выборка.Ссылка);
	
				Если НЕ Выборка.ДокументИсточникОтсутствует = Истина Тогда
					Об = Выборка.Ссылка.ПолучитьОбъект();
					Об.ДокументИсточникОтсутствует = Истина;
					Об.Записать();
				КонецЕсли;	
			Конецесли;	
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьДокументПоУИД(УИД)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ВзаиморасчетСПоставщиком.Ссылка
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
	|ГДЕ
	//|	уб_ВзаиморасчетСПоставщиком.IDизБухДок = &УИД");
	|	уб_ВзаиморасчетСПоставщиком.IDизБухДок подобно &УИД");
	//Запрос.УстановитьПараметр("УИД",УИДБАЗЫ+"!"+УИД);
	Запрос.УстановитьПараметр("УИД","%"+УИД+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Документы.уб_ВзаиморасчетСПоставщиком.НайтиПоРеквизиту("IDизБухДок",УИД)
	//Документы.уб_ВзаиморасчетСПоставщиком.НайтиПоРеквизиту("IDизБухДок",УИДБАЗЫ+"!"+УИД)
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.уб_ВзаиморасчетСПоставщиком.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьПоставщика(Контрагент)
	Если ПоИНН Тогда
		Попытка
			ИНН = Контрагент.ИНН;
		Исключение
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецПопытки;	
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;	
		
		Возврат  Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
	Иначе
		//С учетом синхронизации
		
		Попытка
			Код = Контрагент.Код;
		Исключение
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецПопытки;	
		
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодБух = &Код");
		Запрос.УстановитьПараметр("Код",Код);					 
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()=1 Тогда
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
		ИначеЕсли Выборка.Количество()>1 Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить ("Контрагент с кодом бухгалтерии: "+Код +" "+Выборка.Количество() +" записей!!! Пропущен.");
		КонецЕсли;	
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

Функция ПолучитьОрганизацию(Организация)
	Попытка
		ИНН = Организация.ИНН;
	Исключение
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецПопытки;	
	Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	
	Ссылка = Организации[ИНН];
	Если Ссылка =Неопределено Тогда
		Ссылка = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	Возврат Ссылка;//Справочники.Организации.НайтиПоРеквизиту("ИНН", ИНН);
КонецФункции


//Функция ЭтоКВ(Выборка,КодСтатьи="Незадан параметр")

//Если Выборка.Направление="ПеречислениеПоставщику" Тогда
//	Возврат Ложь;
//Иначе
//	"ПоступлениеКВОтПоставщика"
//	Если Найти("000000008,000000012",КодСтатьи)>0 Тогда
//		//Коды статей перечисления КВ
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;	
//КонецЕсли;	
//КонецФункции	
Функция КодСтатьи (Статья)
	Если Статья.Пустая() Тогда
		КодСтатьи = "";
	Иначе	
		КодСтатьи = Статья.Код;
	КонецЕсли;		
	Возврат КодСтатьи;	
КонецФункции	


Процедура ЗагрузитьОстатки()  Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_РасчетыСПоставщикамиОстатки.ОрганизацияАгент КАК ОрганизацияАгент,
	|	уб_РасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
	|	уб_РасчетыСПоставщикамиОстатки.Валюта,
	|	-уб_РасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	-уб_РасчетыСПоставщикамиОстатки.СуммаКВОстаток КАК СуммаКВОстаток,
	|	уб_РасчетыСПоставщикамиОстатки.Категория
	|ИЗ
	|	РегистрНакопления.уб_РасчетыСПоставщиками.Остатки(&ДатаКорректировки, ) КАК уб_РасчетыСПоставщикамиОстатки");
	Запрос.УстановитьПараметр("ДатаКорректировки",ДатаНачала);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	ПараметрСоединения =  СтрокаПодключения+" Usr="+Пользователь+"; Pwd="+Пароль;
	
	Base_COM = Неопределено;
	Если уб_ОбменДанными.ПодключитьСоединение(Base_COM, ПараметрСоединения, v) Тогда
	Иначе
		Возврат;
	КонецЕсли;	
	Запрос = Base_COM.NewObject("Запрос");
	ТекстЗапроса="ВЫБРАТЬ
	|	Вложенный.Организация,
	|	Вложенный.Субконто1 КАК Контрагент,
	|	СУММА(Вложенный.Сумма) КАК Сумма,
	|	СУММА(Вложенный.СуммаКВ) КАК СуммаКВ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация КАК Организация,
	|		ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|		ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	|		0 КАК Сумма,
	|		ХозрасчетныйОстатки.СуммаОстаток КАК СуммаКВ
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В ИЕРАРХИИ (&СчетКВ), , ) КАК ХозрасчетныйОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация КАК Организация,
	|		ХозрасчетныйОстатки.Субконто1,
	|		ХозрасчетныйОстатки.Субконто2,
	|		ХозрасчетныйОстатки.СуммаОстаток,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В ИЕРАРХИИ (&Счет), , ) КАК ХозрасчетныйОстатки) КАК Вложенный
	
	|СГРУППИРОВАТЬ ПО
	|	Вложенный.Организация,
	|	Вложенный.Субконто1
	
	|УПОРЯДОЧИТЬ ПО
	|	Субконто1.Наименование";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата",ДатаНачала);
	Запрос.УстановитьПараметр("Счет",Base_COM.ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09"));
	Запрос.УстановитьПараметр("СчетКВ",Base_COM.ПланыСчетов.Хозрасчетный.НайтиПоКоду("62"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтроковоеПредставлениеКонтрагента = СокрЛП(Base_COM.String(Выборка.Контрагент));
		
		Если Найти(ИсключитьЗагрузкуОстатковПО,СтроковоеПредставлениеКонтрагента)>0 Тогда
			Продолжить;	
		КонецЕсли;	
		
		Контрагент = ПолучитьПоставщика(Выборка.Контрагент);
		
		Организация = ПолучитьОрганизацию(Выборка.Организация);
		Массив = ТаблицаОстатков.НайтиСтроки(Новый Структура("ОрганизацияАгент,Контрагент,Категория",Организация,Контрагент,Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят));
		Если Массив.Количество() = 1 Тогда
			СтрокаОстатка = Массив[0];
			//Корректировка
			СтрокаОстатка.СуммаОстаток       = - Выборка.Сумма+СтрокаОстатка.СуммаОстаток;
			СтрокаОстатка.СуммаКВОстаток     = Выборка.СуммаКВ+СтрокаОстатка.СуммаКВОстаток;
		ИначеЕсли Массив.Количество()>1 Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Более 1 строки по контрагенту "+Контрагент+" / "+Организация);
		Иначе
			СтрокаОстатка = ТаблицаОстатков.Добавить(); 
			СтрокаОстатка.ОрганизацияАгент = Организация;
			СтрокаОстатка.Контрагент = Контрагент; 
			//СтрокаОстатка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			СтрокаОстатка.Валюта = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
			СтрокаОстатка.СуммаОстаток       = - Выборка.Сумма;
			СтрокаОстатка.СуммаКВОстаток     = Выборка.СуммаКВ;
		КонецЕсли;	
	КонецЦикла;	
	Автор = ? (СокрЛП(ПараметрыСеанса.ТекущийПользователь)="Не авторизован",Справочники.Пользователи.Robot,ПараметрыСеанса.ТекущийПользователь);
	Для каждого СтрокаОстатка из  ТаблицаОстатков Цикл
		
		//Корректировка не подтвержденной ОП суммы
		Если (СтрокаОстатка.СуммаОстаток<>0) Тогда
			
			Документ = ПолучитьДокументОстатка(СтрокаОстатка.Контрагент,ДатаНачала-1,СтрокаОстатка.ОрганизацияАгент,Перечисления.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток);
			
			Если Документ.Пустая() Тогда
				Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
				Об.Автор = Автор;
				Об.ДатаСоздания = ТекущаяДата();
			Иначе
				Об = Документ.ПолучитьОбъект();
			КонецЕсли;	
			
			//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.ВалютаДокумента = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
			Об.Дата  = ДатаНачала-1;
			Об.ДатаИзменения = ТекущаяДата();
			Об.НаправлениеРасчетов = Перечисления.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток;
			Об.ФормаОплаты =  Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;
			
			Об.СуммаДокумента  = СтрокаОстатка.СуммаОстаток;
			Об.Поставщик        = СтрокаОстатка.Контрагент;
			Об.ОрганизацияАгент = СтрокаОстатка.ОрганизацияАгент;
			
			//Об.Комментарий = Выборка.Комментарий;
			//
			ДокументГрузится = НЕ Об.Поставщик.Пустая() И НЕ Об.ОрганизацияАгент.Пустая()  И (Об.СуммаДокумента<>0);
			
			Если ДокументГрузится Тогда
				//
				Об.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;		
		КонецЕсли;	
		
		Если (СтрокаОстатка.СуммаКВОстаток<>0) Тогда
			
			Документ = ПолучитьДокументОстатка(СтрокаОстатка.Контрагент,ДатаНачала-1,СтрокаОстатка.ОрганизацияАгент,Перечисления.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток);
			
			Если Документ.Пустая() Тогда
				Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
				Об.Автор = Автор;
				Об.ДатаСоздания = ТекущаяДата();
			Иначе
				Об = Документ.ПолучитьОбъект();
			КонецЕсли;	
			
			//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.ВалютаДокумента = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
			Об.Дата  = ДатаНачала-1;
			Об.ДатаИзменения = ТекущаяДата();
			Об.НаправлениеРасчетов = Перечисления.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток;
			Об.ФормаОплаты =  Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;
			
			Об.СуммаДокумента  = СтрокаОстатка.СуммаКВОстаток;
			Об.Поставщик        = СтрокаОстатка.Контрагент;
			Об.ОрганизацияАгент = СтрокаОстатка.ОрганизацияАгент;
			
			//Об.Комментарий = Выборка.Комментарий;
			//
			ДокументГрузится = НЕ Об.Поставщик.Пустая() И НЕ Об.ОрганизацияАгент.Пустая()  И (Об.СуммаДокумента<>0);
			
			Если ДокументГрузится Тогда
				//
				Об.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;		
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьДокументОстатка (Поставщик,Дата,ОрганизацияАгент,Направление)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ВзаиморасчетСПоставщиком.Ссылка
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
	|ГДЕ
	|	уб_ВзаиморасчетСПоставщиком.Поставщик = &Поставщик
	|	И уб_ВзаиморасчетСПоставщиком.Дата = &Дата
	|	И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов ПОДОБНО &НаправлениеРасчетов
	|	И уб_ВзаиморасчетСПоставщиком.ОрганизацияАгент = &ОрганизацияАгент");
	Запрос.УстановитьПараметр("ОрганизацияАгент",ОрганизацияАгент);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("НаправлениеРасчетов",Направление);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.уб_ВзаиморасчетСПоставщиком.ПустаяСсылка();
	КонецЕсли;
	
	
КонецФункции

Функция ПроверитьЗаполнить (Об,ИмяР,Значение,ДокументИзменен)
	Результат = ДокументИзменен;
	
	ЗначениеДляПроверки = Значение;
	
	//Исключенаем ситуации когда ""<>Null и 0001.01.01<>Null !!!TO DO
	Если ЗначениеДляПроверки = Null И ИмяР="НомерВходящегоДокумента" Тогда
		ЗначениеДляПроверки = "";
	ИначеЕсли ЗначениеДляПроверки = Null И ИмяР="ДатаВходящегоДокумента" Тогда
		ЗначениеДляПроверки = Дата(1,1,1);
	КонецЕсли;
		
	Если НЕ Об[ИмяР] = ЗначениеДляПроверки Тогда
		Попытка
			Если ЗначениеЗаполнено(Об.Ссылка) Тогда 
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(""+Об+""+ИмяР+"="+Об[ИмяР]+"/"+ЗначениеДляПроверки);
			Конецесли;
		Исключение
		КонецПопытки;	
		Об[ИмяР] = ЗначениеДляПроверки;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат
КонецФункции;	