

// Устанавливает свойство ТолькоПросмотр (для элементов у которых нет такого свойства - устанавливает Доступность)
// у всех элементы формы  если у них стоит свойство ИзменяетДанные
// Табличные поля - устанавливает ИзменятьСоставСтрок, и также устанавливает ТолькоПросмотр для элементов управления колонок
//
// Параметры
//  ЭлементыФормы  – Массив – элементы формы по которым ставим досупность
//                 
//  Доступность  – Булево – Истина - установить доступность, Ложь - снять доступность
//
Процедура УстановитьДоступностьЭлементовФормы(ЭлементыФормы, Доступность) Экспорт
	ТипТП = Тип("ТабличноеПоле");
	ТипФл = Тип("Флажок");
	ТипПр = Тип("Переключатель");
	ТипКп = Тип("КоманднаяПанель");
	ТипКн = Тип("Кнопка");
	ТипН  = Тип("Надпись");
	ТипIMG = Тип("ПолеКартинки");
	ТипПВ = Тип("ПолеВвода");
	Для Каждого Элемент Из ЭлементыФормы Цикл
		Если Элемент.ИзменяетДанные Тогда
			ТипЭлемента = ТипЗнч(Элемент);
			Если ТипЭлемента = ТипПВ Тогда
				Элемент.ТолькоПросмотр = Не Доступность;
			ИначеЕсли ТипЭлемента = ТипН ИЛИ ТипЭлемента = ТипФл Или ТипЭлемента = ТипПр Или ТипЭлемента = ТипКп Или ТипЭлемента = ТипКн Или ТипЭлемента = ТипIMG Тогда
				Элемент.Доступность = Доступность;
			ИначеЕсли ТипЭлемента = ТипТП Тогда
				//Элемент.ИзменятьСоставСтрок = Доступность;
				//Для каждого Колонка Из Элемент.Колонки Цикл
				//	ЭлементУправления = Колонка.ЭлементУправления;
				//	ТипЭлемента = ТипЗнч(ЭлементУправления);
				//	Если ЭлементУправления = Неопределено Тогда
				//		Колонка.Доступность = Доступность;
				//	Иначе
				//		Если ТипЭлемента = ТипПВ Тогда 	
				//			ЭлементУправления.ТолькоПросмотр = Не Доступность;
				//		ИначеЕсли ТипЭлемента = ТипФл Или ТипЭлемента = ТипПр Тогда
				//			ЭлементУправления.Доступность = Доступность;
				//		Иначе
				//			ЭлементУправления.ТолькоПросмотр = Не Доступность;
				//		КонецЕсли;
				//	КонецЕсли;
				//КонецЦикла; 
				Элемент.ТолькоПросмотр = Не Доступность;
			Иначе 
				Элемент.ТолькоПросмотр = Не Доступность;
			КонецЕсли;
			//	
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры // УстановитьДоступностьЭлементовФормы


/////////////////////////////////////
//   Работа с пользователями
/////////////////////////////////////


// Устанавливает отбор в форме по подразделению, если это необходимо
//
// Параметры
//     Форма - форма, где находится элемент управления
//     УчетБСОПоВсемПодразделениям - Истина - если для пользователя учет ведется по всем подразделениям
//     ОсновноеПодразделение - основное подразделение пользователя
//     ИмяРеквизитаСписка - имя реквизита списка, по которому будет установлен отбор
//     СкрыватьКолонку - Истина - надо скрыть колонку, Ложь - нет
//     ИмяОтбора - текстовая строка, имя отбора
Процедура УстановитьОтборПоПодразделению(Форма, УчетБСОПоВсемПодразделениям, ОсновноеПодразделение, ИмяРеквизитаСписка, СкрыватьКолонку = Истина, ИмяОтбора = "Подразделение") Экспорт

	Если НЕ УчетБСОПоВсемПодразделениям Тогда

		Если НЕ (ТипЗнч(Форма[ИмяРеквизитаСписка]) = Тип("ТаблицаЗначений")) Тогда // Элемент - табличное поле

			// Проверим - Если это связанный регитср сведений тогда не нужно устанавливать отбор - 
			// он уже установлен системой автоматически

			Если ИмяРеквизитаСписка = "РегистрСведенийСписок" Тогда

				// Возвможно это переход по кнопке ПЕрейти
				Если ТипЗнч(Форма.ПараметрОтборПоИзмерению) = Тип("Структура") Тогда
					Если НЕ ЗначениеНеЗаполнено(Форма.ПараметрОтборПоИзмерению) Тогда
						Возврат; // Это переход по кнопке Перейти - не нужно устанавливать отбор
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].ВидСравнения  = ВидСравнения.Равно;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Использование = Истина;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Значение      = ОсновноеПодразделение;

			Форма.ЭлементыФормы[ИмяРеквизитаСписка].НастройкаОтбора[ИмяОтбора].Доступность = Ложь;

		КонецЕсли;

		Если СкрыватьКолонку Тогда

			Если НЕ Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки.Найти(ИмяОтбора) = Неопределено Тогда

				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].Видимость         = Ложь;
				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].ИзменятьВидимость = Ложь;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Возвращает список доступных для пользователя подразделений
//
// Параметры
//  ОсновноеПодразделение - основное подразделение пользователя
//
// Возвращаемое значение
//  Список значений - подразделения, с которыми может работать пользователь
//
Функция ПолучитьСписокДоступныхПодразделений(ОсновноеПодразделение) Экспорт
	
	СписокПодразделений = Новый СписокЗначений;
	ТочкаПродаж = ПолучитьТочкуПродаж(ОсновноеПодразделение);
	Если НЕ ЗначениеНеЗаполнено(ТочкаПродаж) Тогда
		Если ТочкаПродаж.ИспользованиеВМониторинге Тогда
			СписокПодразделений.Добавить(ТочкаПродаж);
		КонецЕсли;
		Выборка = Справочники.ПодразделенияОрганизаций.ВыбратьИерархически(ТочкаПродаж);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИспользованиеВМониторинге Тогда
				СписокПодразделений.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокПодразделений;
	
КонецФункции

// Возвращает список наименований подразделений доступных для пользователя
//
// Параметры
//  ОсновноеПодразделение - основное подразделение пользователя
//
// Возвращаемое значение
//  Список значений - наименования подразделений, с которыми может работать пользователь
//
Функция ПолучитьСписокНаименованийДоступныхПодразделений(ОсновноеПодразделение) Экспорт
	
	СписокНаименований = Новый СписокЗначений;
	СписокПодразделений = ПолучитьСписокДоступныхПодразделений(ОсновноеПодразделение);
	Для Каждого СтрокаСЗ из СписокПодразделений Цикл
		СписокНаименований.Добавить(СтрокаСЗ.Значение.Наименование);
	КонецЦикла;
	
	Возврат СписокНаименований;
	
КонецФункции



/////////////////////////////////////
//   Учет БСО
/////////////////////////////////////

// убирает в строке лидирующие нули
//
// Параметры
//  Стр - текстовая строка
//
// Возвращаемое значение
//  Текстовая строка - исходная строка без лидирующих нулей
//
Функция УбратьЛидирующиеНулиВСтроке(Знач Стр)
	Для Сч = 1 По СтрДлина(Стр) - 1 Цикл
		Если Лев(Стр, 1) = "0" Тогда
			Стр = Сред(Стр, 2);
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	Возврат Стр;
КонецФункции

Функция ДобавитьНулиСлева(Стр, ДоПолнойДлиныСтроки) Экспорт
	ДС = СтрДлина(Стр);
	Для й = ДС по ДоПолнойДлиныСтроки - 1 Цикл
		Стр = "0" + Стр;
		ДС = СтрДлина(Стр);
	КонецЦикла;
	Возврат Стр;
КонецФункции

// возвращает строку с лидирующими нулями из строки
//
// Параметры
//  Стр  – Строка 
//
// Возвращаемое значение:
//   Строка   – 
//
Функция ПолучитьЛидирующиеНулиИзСтроки(Знач Стр)
	СтрНули = "";
	Для Сч = 1 По СтрДлина(Стр) - 1 Цикл
		Если Лев(Стр, 1) = "0" Тогда
			Стр = Сред(Стр, 2);
			СтрНули = СтрНули + "0";
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	Возврат СтрНули;	
КонецФункции

Функция ДобавитьЛидирующиеНули(Знач Текст, ПривестиКДлине) Экспорт
	
	Текст = СокрЛП(Текст);
	Префикс = "";
	Номер = "";
	ВыделитьПрефиксИНомер(Текст, Префикс, Номер);
	ДлинаПрефикса = СтрДлина(Префикс);
	ДлинаНомера = СтрДлина(Номер);
	ДобавитьНулей = ПривестиКДлине - ДлинаПрефикса - ДлинаНомера;
	ЛидирующиеНули = "";
	Если ДобавитьНулей > 0 Тогда
		Для Сч = 1 По ДобавитьНулей Цикл
			ЛидирующиеНули = ЛидирующиеНули + "0";
		КонецЦикла;
	КонецЕсли;
	Возврат Префикс + ЛидирующиеНули + Номер;
	
КонецФункции

Процедура ВыделитьПрефиксИНомер(Текст, Префикс, Номер)
	
	ДлинаТекста = СтрДлина(Текст);
	Цифры = "0123456789";
	Для Сч = 1 По ДлинаТекста Цикл
		Символ = Сред(Текст, Сч, 1);
		ЭтоЦифра = Найти(Цифры, Символ) <> 0;
		Если ЭтоЦифра Тогда
			Прервать;
		Иначе
			Префикс = Префикс + Символ;
		КонецЕсли;
	КонецЦикла;
	Если Префикс <> "" Тогда
		Номер = СтрЗаменить(Текст, Префикс, "");
	Иначе
		Номер = Текст;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыделитьПрефикс(фНомерБСО) Экспорт
	
	СтрЦифры = "0123456789";
	КолСим = СтрДлина(фНомерБСО);
	ЕстьПрефикс = Ложь;
	Для Сч = 1 По КолСим Цикл
		ПравСч = КолСим - Сч + 1;
		Если Найти(СтрЦифры, Сред(фНомерБСО, ПравСч, 1)) = 0 Тогда
			ЕстьПрефикс = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ЕстьПрефикс Тогда
		Возврат Лев(фНомерБСО, ПравСч);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Проверяем на наличие в строке любых символов кроме цифр.
//
// Параметры
//  Стр  – Строка 
//
// Возвращаемое значение:
//   Булево   – Истина - есть, Ложь - нет
//
Функция ПроверитьНаНаличиеСимволовВСтроке(Стр)
	СтрЦифры = "0123456789";
	Для Сч = 1 По СтрДлина(Стр) Цикл
		Если Найти(СтрЦифры, Сред(Стр, Сч, 1)) = 0 Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла; 
	Возврат Ложь;
КонецФункции
//Функция возвращает только цифры из переданной строки (например, для очистки телефонного номера от разделителей)
Функция ТолькоЦифрыСтроки(Стр,ДлинаСтроки = 0) Экспорт
	_стрЦифры = "0123456789";
	_ДлинаИсхСтроки = СтрДлина(Стр);
	Результат = "";
	Для _Сч = 1 По _ДлинаИсхСтроки Цикл
		_Символ = Сред(Стр, _Сч, 1);
		Если Найти(_стрЦифры,_Символ ) = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Результат = Результат + _Символ;
		ДлинаСтроки = ДлинаСтроки + 1;
	КонецЦикла; 
	Возврат Результат;
КонецФункции	
// Определяет максимальную длину номера, по переданным параметрам номера
//
// Параметры
//  Серия   - строка
//  НачНомер   - строка
//  КонНомер   - строка
//  Год   - строка
//
// Возвращаемое значение
//  Число
//
Функция ОпределитьМаксДлинуНомера(Серия, НачНомер, КонНомер, Год = "") Экспорт 
	
	ДлинаСерии = ?(ЗначениеНеЗаполнено(Серия),0,СтрДлина(СокрЛП(Серия)));
	ДлинаНомера = Макс(СтрДлина(НачНомер), СтрДлина(УбратьЛидирующиеНулиВСтроке(КонНомер)));
	ДлинаГода = ?(ЗначениеНеЗаполнено(Год),0,СтрДлина(СокрЛП(Год)));
	
	Возврат ДлинаСерии + ДлинаНомера + ДлинаГода;
	
КонецФункции

// Проверяет правильность введенного диапазона номеров БСО
//
// Параметры
//  Начало  - строка, начало диапазона
//  Конец   - строка, конец диапазона
//
// Возвращаемое значение
//  Истина - диапазон установлен корректно, Ложь - не корректно
//
Функция ПроверитьДиапазонБСО(Начало, Конец, ДопускатьОбратнуюНумерацию = Ложь) Экспорт
	
	// сначала проверим на правильность заполнения (чтобы не было ничего кроме цифр)
	Если ПроверитьНаНаличиеСимволовВСтроке(Начало) 
	 или ПроверитьНаНаличиеСимволовВСтроке(Конец) Тогда
		Сообщить("В значениях диапазона не должно быть других символов кроме цифр!");
		Возврат Ложь;	
	КонецЕсли; 
	КонецЧ = УбратьЛидирующиеНулиВСтроке(Конец);
	Если КонецЧ = "" Тогда // т.к. пустая строка к числу не преобразуется
		КонецЧ = 0;
	Иначе
		КонецЧ = Число(КонецЧ);
	КонецЕсли; 
	НачалоЧ = УбратьЛидирующиеНулиВСтроке(Начало);
	Если НачалоЧ = "" Тогда
		НачалоЧ = 0;
	Иначе
		НачалоЧ = Число(НачалоЧ);
	КонецЕсли; 
	Если НЕ ДопускатьОбратнуюНумерацию Тогда
		Если КонецЧ <> 0 И (НачалоЧ > КонецЧ И НЕ ДопускатьОбратнуюНумерацию) Тогда
			Сообщить("Не верно указано значение диапазона!");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Рассчитывает количество номеров БСО в диапазоне
//
// Параметры
//  Начало  - строка, начало диапазона
//  Конец   - строка, конец диапазона
//
// Возвращаемое значение
//  Число, величина диапзона
//
Функция РассчитатьКоличествоБСО(Начало, Конец) Экспорт
	НачалоЧ = УбратьЛидирующиеНулиВСтроке(Начало);
	Если НачалоЧ = "" Тогда
		НачалоЧ = 0;
	Иначе
		НачалоЧ = Число(НачалоЧ);
	КонецЕсли; 
	КонецЧ = УбратьЛидирующиеНулиВСтроке(Конец);
	Если КонецЧ = "" Тогда // т.к. пустая строка к числу не преобразуется
		КонецЧ = НачалоЧ;
	Иначе
		КонецЧ = Число(КонецЧ);
	КонецЕсли; 
	
	Если КонецЧ = 0 и НачалоЧ = 0 Тогда
		Возврат 0;
	ИначеЕсли КонецЧ >= НачалоЧ Тогда
		Возврат КонецЧ - НачалоЧ + 1;
	Иначе
		Возврат НачалоЧ - КонецЧ + 1;
	КонецЕсли;
КонецФункции

// Формирует таблицу с номерами БСО и номерами полисов
//
// Параметры
//  СтрокаТЧ - строка табличной части документа ПоступлениеБСО
//
// Возвращаемое значение
//  Таблица значений
//

Функция СформироватьСписокНомеровБСО(СтрокаТЧ) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерБСО");
	ТЗ.Колонки.Добавить("НомерПолиса");
	
	ЕстьНомераПолисов = уб_СЛ.НомерПолисаЗаполняетсяПриПоступлении(СтрокаТЧ.ВидБСО);
	
	сНачНомерБСО = СтрокаТЧ.НачНомерБСО;
	сКонНомерБСО = СтрокаТЧ.КонНомерБСО;
	КолличествоБСО = СтрокаТЧ.КоличествоБСО;
	чНомерБСО = Число2(сНачНомерБСО);
	МаксДлинаНомераБСО  = Макс(СтрДлина(сНачНомерБСО),СтрДлина(сКонНомерБСО));
	
	Если ЕстьНомераПолисов Тогда
		сНачНомерСП = СтрокаТЧ.НачНомерПолиса;
		сКонНомерСП = СтрокаТЧ.КонНомерПолиса;
		КолличествоСП = СтрокаТЧ.КоличествоПолисов;
		чНомерСП = Число2(сНачНомерСП);
		МаксДлинаНомераСП  = Макс(СтрДлина(сНачНомерСП),СтрДлина(сКонНомерСП));
		
		Если КолличествоСП > 1 И Число2(сНачНомерСП) > Число2(сКонНомерСП) Тогда
			Дельта = -1; //Обратная нумерация полисов
		Иначе	 
			Дельта = 1; //Прямая нумерация полисов
		КонецЕсли;
	КонецЕсли;

	Для N=0 По КолличествоБСО - 1 Цикл
		СтрокаТЗ = ТЗ.Добавить();
		сНомерБСО = Формат(чНомерБСО,"ЧГ=");
		ДобавитьНулиСлева(сНомерБСО, МаксДлинаНомераБСО);
		СерияБСО = СокрЛП(СтрокаТЧ.СерияБСО);
		СтрокаТЗ.НомерБСО = СерияБСО + сНомерБСО;
		чНомерБСО = чНомерБСО + 1;
		
		Если ЕстьНомераПолисов Тогда
			сНомерСП = Формат(чНомерСП,"ЧГ=");
			ДобавитьНулиСлева(сНомерСП, МаксДлинаНомераСП);
			СерияСП = СокрЛП(СтрокаТЧ.СерияПолиса);
			СуффиксСП = СокрЛП(СтрокаТЧ.СуффиксПолиса);
			СтрокаТЗ.НомерПолиса = СерияСП + сНомерСП + СуффиксСП;
			чНомерСП = чНомерСП + Дельта;
		КонецЕсли;
	КонецЦикла;
	Возврат ТЗ;
КонецФункции 

// Формирует таблицу с номерами полисов
//
// Параметры
//  СтрокаТЧ - строка табличной части документа НомерПолиса
//
// Возвращаемое значение
//  Таблица значений
//
Функция СформироватьСписокНомеровПолисов0(СтрокаТЧ) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерПолиса");
	
	ДлинаНачНомераПолиса = СтрДлина(СтрокаТЧ.НачНомерПолиса);
	НачНомерПолиса = УбратьЛидирующиеНулиВСтроке(СтрокаТЧ.НачНомерПолиса);
	НачНомерПолиса = Число(?(НачНомерПолиса="","0",НачНомерПолиса));
	КонНомерПолиса = УбратьЛидирующиеНулиВСтроке(СтрокаТЧ.КонНомерПолиса);
	КонНомерПолиса = Число(?(КонНомерПолиса="","0",КонНомерПолиса));
	НулиНомераПолиса = ПолучитьЛидирующиеНулиИзСтроки(СтрокаТЧ.НачНомерПолиса); 
	Для Сч = 0 По СтрокаТЧ.КоличествоПолисов-1 Цикл
		СтрокаТЗ = ТЗ.Добавить();
		
		СерияПолиса = СокрЛП(СтрокаТЧ.СерияПолиса);
		НомерПолиса = Формат(НачНомерПолиса+Сч, "ЧГ=");
		СуффиксПолиса	= СокрЛП(СтрокаТЧ.СуффиксПолиса);
		Если СтрДлина(НомерПолиса) >= ДлинаНачНомераПолиса Тогда
			СтрокаТЗ.НомерПолиса = СерияПолиса + НомерПолиса + СуффиксПолиса;
		Иначе
			СтрокаТЗ.НомерПолиса = СерияПолиса + Прав(НулиНомераПолиса + НомерПолиса, ДлинаНачНомераПолиса) + СуффиксПолиса;
		КонецЕсли;
	КонецЦикла; 	
	
	Возврат ТЗ;
	
КонецФункции 

Функция СформироватьСписокНомеровПолисов(СтрокаТЧ) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерПолиса");
	
	сНачНомерСП = СтрокаТЧ.НачНомерПолиса;
	сКонНомерСП = СтрокаТЧ.КонНомерПолиса;
	КолличествоСП = СтрокаТЧ.КоличествоПолисов;
	чНомерСП = Число2(сНачНомерСП);
	МаксДлинаНомераСП  = Макс(СтрДлина(сНачНомерСП),СтрДлина(сКонНомерСП));
	
	Если КолличествоСП > 1 И Число2(сНачНомерСП) > Число2(сКонНомерСП) Тогда
		Дельта = -1; //Обратная нумерация полисов
	Иначе	 
		Дельта = 1; //Прямая нумерация полисов
	КонецЕсли;

	Для N=0 По КолличествоСП - 1 Цикл
		СтрокаТЗ = ТЗ.Добавить();
		сНомерСП = Формат(чНомерСП,"ЧГ=");
		ДобавитьНулиСлева(сНомерСП, МаксДлинаНомераСП);
		СерияСП = СокрЛП(СтрокаТЧ.СерияПолиса);
		СуффиксСП = СокрЛП(СтрокаТЧ.СуффиксПолиса);
		СтрокаТЗ.НомерПолиса = СерияСП + сНомерСП + СуффиксСП;
		чНомерСП = чНомерСП + Дельта;
	КонецЦикла;
	Возврат ТЗ;
КонецФункции 

//-------------------------------------------------------
//  Разделение номеров БСО и полисов на серию и номер
//-------------------------------------------------------

//Вспомогательная функция. Получает полный номер и список серий в виде выборки.
//Находит из списка подходящую серию и выделяет ее.
//Дефис на конце серии удаляется
Процедура Получить_Серию_и_Номер_по_полному_номеру_и_выборке_серий(СерияИНомер, ВыборкаСерий, Серия = "", Номер = "");
	
	//В случае, если серию не найдем, вернем пустую серию и в номере - полный номер
	Номер = СокрЛП(СерияИНомер); 
	
	Пока ВыборкаСерий.Следующий() Цикл
		Сер = СокрЛП(ВыборкаСерий.Серия);
		
		//Если серия найдена не с первой позиции, то это не наш вариант
		Если Найти(СерияИНомер, Сер) <> 1 Тогда
			Продолжить;	
		КонецЕсли;
		
		//Вычленяем номер, удаляя серию 
		Номер = СтрЗаменить(Номер,Сер,"" ); 
		
		//Удаляем конечный дефис у серии, если он есть
		Серия = ?(Прав(Сер,1) = "-", СтрЗаменить(Сер + "@","-@","" ), Сер);
	КонецЦикла;
КонецПроцедуры

// Возвращает значение Серии и Номера полиса ИЛИ БСО по виду и номеру БСО
// В зависимости от типа учета БСО: 
// Если номер полиса отсутствует (квитанция), то вернутся серия и номер БСО
// Если номер полиса есть (указывается при поступлении, соответствует номеру БСО, свободный или указывается вручную),
// то вернется серия и номер ПОЛИСА.
// (если серию выделить не получится, вернется пустая серия и полный номер в номере, например для номеров полисов, указываемых вручную)
// 
//Параметры: ВидБСО, НомерБСО
// Возвращаемые значения: СерияП, НомерП
//
// Использование:
//СерияП = "";
//НомерП = "";
//Имя_функции(ВидБСО, НомерБСО, СерияП, НомерП);
//
Процедура Получить_Серию_и_Номер_БСО_или_ПОЛИСА_по_НомеруБСО(ВидБСО, НомерБСО, СерияП = "", НомерП = "") Экспорт
	//Остается случай, когда номер БСО есть, но нет номера полиса (например, карточки)
	//В этом случае оставляем серию и номер пустыми - по факту их просто нет

	Если ВидБСО.ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.НомернойНетПолиса Тогда
		Выделить_Серию_и_Номер_в_НомереБСО(ВидБСО, НомерБСО, СерияП, НомерП)
	Иначе
		Получить_Серию_и_Номер_ПОЛИСА_по_НомеруБСО(ВидБСО, НомерБСО, СерияП, НомерП);
	КонецЕсли;
	
КонецПроцедуры 

// Возвращает значение Серии и Номера !ПОЛИСА! по Виду и Номеру БСО
// Параметры: ВидБСО, НомерБСО
// Возвращаемые значения: СерияП, НомерП
//
// Использование:
//СерияП = "";
//НомерП = "";
//Имя_функции(ВидБСО, НомерБСО, СерияП, НомерП);
//
Процедура Получить_Серию_и_Номер_ПОЛИСА_по_НомеруБСО(ВидБСО, НомерБСО, СерияП = "", НомерП = "") Экспорт
	
	//Если номерной учет по номеру бланка не ведется,
	//то по номеру БСО и нечего искать.
	Если НЕ уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСО) Тогда 
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СК", ВидБСО.Владелец); //Нужно для попадания в индекс в запросах - существенно быстрее!
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
	
	
	//Если используются свободные номера полисов или номер полиса заполняется вручную, 
	//то надо искать номер ПОЛИСА по Номеру БСО
	бНомерПолисаСвободный = уб_СЛ.ОпределитьИспользуютсяСвободныеНомераПолисов(ВидБСО);
	бНомерПолисаВручную = уб_СЛ.НомерПолисаЗаполняетсяВручную(ВидБСО);

	Если бНомерПолисаСвободный ИЛИ бНомерПолисаВручную Тогда 
		
		// Находим номер полиса, соответствующего данному номеру БСО
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Т.НомерПолиса
		               |ИЗ
		               |	РегистрСведений.уб_ДвиженияБСО КАК Т
		               |ГДЕ
		               |	Т.ВидБСО = &ВидБСО
		               |	И Т.НомерБСО = &НомерБСО
					   |	И Т.Регистратор ССЫЛКА Документ.уб_СтраховойПолис
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Т.Активность УБЫВ";
					   //|	Т.ДокПроведен УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		//Номер полиса не найден - выходим без результата
		Если НЕ Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		//Найдено движение, сделанное полисом
		НомерП =  Выборка.НомерПолиса;
		
		//Если номер полиса вписан вручную, то серию у него выделить не представляется возможным (нет ни серий в системе ни четкого алгоритма, по которому можно выделить серию)
		Если бНомерПолисаВручную Тогда 
			Возврат;
		КонецЕсли;
		
		//Остается случай, когда номер полиса получается из списка свободных
		//Тогда в системе было поступление этого свободного номера (если в полисе не накосячили)
		Выделить_Серию_и_Номер_Полиса_в_Свободном_Номере(ВидБСО.Владелец, НомерП, СерияП = "", НомерП = "");
		
		Возврат;
	КонецЕсли;
	
	
	//Если номер полиса заполняется при поступлении:
	Если уб_СЛ.НомерПолисаЗаполняетсяПриПоступлении(ВидБСО) Тогда
		Выделить_Серию_и_Номер_ПОЛИСА_по_НомеруБСО_для_номера_полиса_заполняющегося_при_поступлении(ВидБСО, НомерБСО, СерияП, НомерП);
		Возврат;
	КонецЕсли;
	
	//Остается случай, когда номер БСО есть, но нет номера полиса (например, карточки)
	//В этом случае оставляем серию и номер пустыми - по факту их просто нет
	
КонецПроцедуры 

// Возвращает значение Серии и Номера !ПОЛИСА! по виду и номеру БСО для БСО, у которого 
// номер полиса заполняется при поступлении 
// (когда соответствует номеру БСО или указывается отдельным диапазоном номеров полисов со своими сериями): 
// Для всех остальных типов учета БСО вернутся пустая серия и номер 
// 
//Параметры: ВидБСО, НомерБСО
// Возвращаемые значения: СерияП, НомерП
//
// Использование:
//СерияП = "";
//НомерП = "";
//Имя_функции(ВидБСО, НомерБСО, СерияП, НомерП);
//
Процедура Выделить_Серию_и_Номер_ПОЛИСА_по_НомеруБСО_для_номера_полиса_заполняющегося_при_поступлении(ВидБСО, НомерБСО, Серия = "", Номер = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
	
	// Находим документ поступления для переданного номра БСО
	// А из него выбираем набор серий ПОЛИСА
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиПоступления.СерияПолиса как Серия,
	|	ДокПоступления.НомерПолиса
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК СтрокиПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			Т2.Регистратор КАК Ссылка,
	|			Т2.НомерПолиса КАК НомерПолиса
	|		ИЗ
	|			РегистрСведений.уб_ДвиженияБСО КАК Т2
	|		ГДЕ
	|			Т2.ВидБСО = &ВидБСО
	|			И Т2.НомерБСО = &НомерБСО
	|			И Т2.Подтверждено
	|			И Т2.Активность
	|			И Т2.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО) КАК ДокПоступления
	|		ПО СтрокиПоступления.Ссылка = ДокПоступления.Ссылка
	|			И (СтрокиПоступления.ВидБСО = &ВидБСО)";
	ВыборкаСерий = Запрос.Выполнить().Выбрать(); 
	Если ВыборкаСерий.Следующий() Тогда			   
		НомерПолиса = ВыборкаСерий.НомерПолиса;	
		ВыборкаСерий.Сбросить();
		Получить_Серию_и_Номер_по_полному_номеру_и_выборке_серий(НомерПолиса, ВыборкаСерий, Серия, Номер);
	КонецЕсли;
КонецПроцедуры

// Возвращает значение Серии и Номера БСО по Виду и полному НомеруБСО
// Параметры: ВидБСО, НомерБСО
// Возвращаемые значения: СерияБСО, НомерБСО
//
// Использование:
//Серия = "";
//Номер = "";
//Имя_функции(ВидБСО, НомерБСО, Серия, Номер);
//
Процедура Выделить_Серию_и_Номер_в_НомереБСО(ВидБСО, НомерБСО, Серия = "", Номер = "", ВидБСОВладелец = Неопределено) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
	
	// Находим документ поступления для переданного номра БСО
	// А из него выбираем набор серий БСО
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиПоступления.СерияБСО КАК Серия
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК СтрокиПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			Т2.Регистратор КАК Ссылка
	|		ИЗ
	|			РегистрСведений.уб_ДвиженияБСО КАК Т2
	|		ГДЕ
	|			Т2.ВидБСО = &ВидБСО
	|			И Т2.НомерБСО = &НомерБСО
	|			И Т2.Подтверждено
	|			И Т2.Активность
	|			И Т2.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО) КАК ДокПоступления
	|		ПО СтрокиПоступления.Ссылка = ДокПоступления.Ссылка
	|			И (СтрокиПоступления.ВидБСО = &ВидБСО)";
	ВыборкаСерий = Запрос.Выполнить().Выбрать();
	
	Получить_Серию_и_Номер_по_полному_номеру_и_выборке_серий(НомерБСО, ВыборкаСерий, Серия, Номер);
КонецПроцедуры

Процедура ПолучитьТаблицу_Серий_в_НомерахБСО(Таблица) Экспорт
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	// Находим документ поступления для переданного номра БСО
	// А из него выбираем набор серий БСО
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.НомерБСО,
	|	Таблица.ВидБСО,
	|	Таблица.ВидБСОВладелец КАК ВидБСОВладелец
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.НомерБСО <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиПоступления.СерияБСО КАК Серия,
	|	СтрокиПоступления.ВидБСО,
	|	СтрокиПоступления.СК КАК ВидБСОВладелец,
	|	ДокПоступления.НомерБСО КАК НомерБСО
	|ИЗ
	|	Документ.уб_ПоступлениеБСО.БСО КАК СтрокиПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(Т2.Регистратор) КАК Ссылка,
	|			ВТ_Таблица.НомерБСО КАК НомерБСО,
	|			ВТ_Таблица.ВидБСО КАК ВидБСО,
	|			ВТ_Таблица.ВидБСОВладелец КАК СК
	|		ИЗ
	|			РегистрСведений.уб_ДвиженияБСО КАК Т2
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Таблица КАК ВТ_Таблица
	|				ПО Т2.СК = ВТ_Таблица.ВидБСОВладелец
	|					И Т2.ВидБСО = ВТ_Таблица.ВидБСО
	|					И Т2.НомерБСО = ВТ_Таблица.НомерБСО
	|					И (Т2.Подтверждено)
	|					И (Т2.Активность)
	|					И (Т2.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_Таблица.НомерБСО,
	|			ВТ_Таблица.ВидБСО,
	|			ВТ_Таблица.ВидБСОВладелец) КАК ДокПоступления
	|		ПО СтрокиПоступления.Ссылка = ДокПоступления.Ссылка
	|			И СтрокиПоступления.ВидБСО = ДокПоступления.ВидБСО
//	|			И СтрокиПоступления.СК = ДокПоступления.СК
	|ИТОГИ ПО
	|	НомерБСО";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Отбор = Новый Структура("НомерБСО, ВидБСО, ВидБСОВладелец");
	Отбор = Новый Структура("НомерБСО");
	Пока Выборка.Следующий() Цикл			   
		Серия = "";
		Номер = "";
		ВыборкаСерий = Выборка.Выбрать();					
		Получить_Серию_и_Номер_по_полному_номеру_и_выборке_серий(Выборка.НомерБСО, ВыборкаСерий, Серия, Номер);
		Если Серия <> "" Тогда
			Отбор.НомерБСО = Выборка.НомерБСО;
			//Отбор.ВидБСО = Выборка.ВидБСО;
			//Отбор.ВидБСОВладелец = Выборка.ВидБСОВладелец;
			СтрокиТЗ = Таблица.НайтиСтроки(Отбор);
			Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
				СтрокаТЗ.Серия = Серия;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает значение Серии и Номера свободного номера полиса по СК и полному свободному номеру полиса
// Параметры: СК, НомерПолиса
// Возвращаемые значения: Серия, Номер
//
// Если серия не выделена, вернется пустая серия, а номер - полный номер
//
// Использование:
//Серия = "";
//Номер = "";
//Имя_функции(СК, НомерПолиса, Серия, Номер);
//
Процедура Выделить_Серию_и_Номер_ПОЛИСА_в_Свободном_Номере(СК, НомерПолиса, СерияП = "", НомерП = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СК", СК); //Нужно для попадания в индекс в запросах - существенно быстрее!
	Запрос.УстановитьПараметр("НомерПолиса", НомерПолиса);
	
	//Вложенным запросом находим движение заданного номера полиса, 
	//сделанное документом уб_ПоступлениеНомеровПолисов
	//В полученном документе находим список серий 			   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Т.СерияПолиса КАК Серия
	               |ИЗ
	               |	Документ.уб_ПоступлениеНомеровПолисов.НомераПолисов КАК Т
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	               |			С.Регистратор КАК Регистратор,
	               |			С.ВидНумерации КАК ВидНумерации
	               |		ИЗ
	               |			РегистрСведений.уб_СвободныеНомераПолисов КАК С
	               |		ГДЕ
	               |			С.СК = &СК
	               |			И С.НомерПолиса = &НомерПолиса
	               |			И С.Регистратор ССЫЛКА Документ.уб_ПоступлениеНомеровПолисов) КАК СВ
	               |		ПО Т.Ссылка = СВ.Регистратор
	               |			И Т.ВидНумерации = СВ.ВидНумерации";
				   
	ВыборкаСерий = Запрос.Выполнить().Выбрать(); 
	Получить_Серию_и_Номер_по_полному_номеру_и_выборке_серий(НомерПолиса, ВыборкаСерий, СерияП, НомерП);
КонецПроцедуры

//-------------------------------------------------------
//  Учет БСО - функции проверки назначения Вида БСО
//-------------------------------------------------------

// Определяет допустимую длину номера БСО
//
// Параметры
//  нет
//
// Возвращаемое значение
//  число
//
Функция ПолучитьДопустимуюДлинуНомераБСО() Экспорт
	Возврат Метаданные.РегистрыСведений.уб_ДвиженияБСО.Измерения.НомерБСО.Тип.КвалификаторыСтроки.Длина;
КонецФункции

// Определяет допустимую длину номера полиса
//
// Параметры
//  нет
//
// Возвращаемое значение
//  число
//
Функция ПолучитьДопустимуюДлинуНомераПолиса() Экспорт
	Возврат Метаданные.РегистрыСведений.уб_ДвиженияБСО.Ресурсы.НомерПолиса.Тип.КвалификаторыСтроки.Длина;
КонецФункции


// Создает служебную структуру для "Свободного номера полиса"
//
// Параметры
//  нет
//
// Возвращаемое значение
//  Структура
//
Функция ПолучитьСтруктуруНомеровПолисов() Экспорт
	СтруктураСНП = Новый Структура("Период, СК, Поставщик, НомерПолиса, ВидНумерации, ГодПолиса, НомерИспользован, НомерЗаблокирован, НомерЗарезервирован, НомерВыданАгенту, Коментарий, КодОперации");
	СтруктураСНП.Вставить("Существует",Ложь);
	Возврат СтруктураСНП;
КонецФункции

// Читает состояние "Свободного номера полиса"
//
// Параметры
//  СтруктураНомера - структура
//
//Процедура ПрочитатьСостояниеНомераПолиса0(СтруктураСНП) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				   |	СНП.ВидНумерации,
//				   |	СНП.ГодПолиса,
//				   |	СНП.НомерИспользован,
//				   |	СНП.НомерЗаблокирован,
//				   |	СНП.НомерЗарезервирован,
//				   |	СНП.НомерВыданАгенту,
//				   |	СНП.Поставщик
//				   |ИЗ
//				   |	РегистрСведений.уб_СвободныеНомераПолисов.СрезПоследних(
//				   |			&Период,
//				   |			СК = &СК
//				   |				И НомерПолиса = &НомерПолиса) КАК СНП";
//	
//	Запрос.УстановитьПараметр("Период", СтруктураСНП.Период);
//	Запрос.УстановитьПараметр("СК", СтруктураСНП.СК);
//	Запрос.УстановитьПараметр("НомерПолиса", СтруктураСНП.НомерПолиса);
//	
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Если Выборка.Следующий() Тогда
//		СтруктураСНП.Существует = Истина;
//		СтруктураСНП.Поставщик 			= Выборка.Поставщик;
//		СтруктураСНП.ВидНумерации 		= Выборка.ВидНумерации;
//		СтруктураСНП.ГодПолиса			= Выборка.ГодПолиса;
//		СтруктураСНП.НомерИспользован 	= Выборка.НомерИспользован;
//		СтруктураСНП.НомерЗаблокирован	= Выборка.НомерЗаблокирован;
//		СтруктураСНП.НомерЗарезервирован= Выборка.НомерЗарезервирован;
//		СтруктураСНП.НомерВыданАгенту	= Выборка.НомерВыданАгенту;
//		СтруктураСНП.КодОперации	= Выборка.КодОперации;
//	Иначе
//		СтруктураСНП.Существует = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

Процедура ПрочитатьСостояниеНомераПолиса(СтруктураСНП) Экспорт
	
	Если СтруктураСНП.Период = Неопределено Тогда
		СтруктураСНП.Период = Новый Граница(ТекущаяДата(), ВидГраницы.Исключая);
	КонецЕсли;
	СтруктураОтбора = Новый Структура("СК, НомерПолиса",СтруктураСНП.СК, СтруктураСНП.НомерПолиса);		
	//тзРег = РегистрыСведений.уб_СвободныеНомераПолисов.СрезПоследних(СтруктураСНП.Период, СтруктураОтбора);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_СвободныеНомераПолисовСрезПоследних.Поставщик,
	|	уб_СвободныеНомераПолисовСрезПоследних.НомерПолиса,
	|	уб_СвободныеНомераПолисовСрезПоследних.ГодПолиса,
	|	уб_СвободныеНомераПолисовСрезПоследних.НомерИспользован,
	|	уб_СвободныеНомераПолисовСрезПоследних.НомерЗаблокирован,
	|	уб_СвободныеНомераПолисовСрезПоследних.НомерЗарезервирован,
	|	уб_СвободныеНомераПолисовСрезПоследних.НомерВыданАгенту,
	|	уб_СвободныеНомераПолисовСрезПоследних.КодОперации,
	|	ВложенныйЗапрос.ВидНумерации
	|ИЗ
	|	РегистрСведений.уб_СвободныеНомераПолисов.СрезПоследних(
	|			&Период,
	|			СК = &СК
	|				И НомерПолиса = &НомерПолиса) КАК уб_СвободныеНомераПолисовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уб_СвободныеНомераПолисовСрезПервых.ВидНумерации КАК ВидНумерации,
	|			уб_СвободныеНомераПолисовСрезПервых.Регистратор КАК Регистратор,
	|			уб_СвободныеНомераПолисовСрезПервых.СК КАК СК,
	|			уб_СвободныеНомераПолисовСрезПервых.НомерПолиса КАК НомерПолиса
	|		ИЗ
	|			РегистрСведений.уб_СвободныеНомераПолисов.СрезПервых(
	|					,
	|					СК = &СК
	|						И НомерПолиса = &НомерПолиса
	|						И Регистратор ССЫЛКА Документ.уб_ПоступлениеНомеровПолисов) КАК уб_СвободныеНомераПолисовСрезПервых) КАК ВложенныйЗапрос
	|		ПО уб_СвободныеНомераПолисовСрезПоследних.СК = ВложенныйЗапрос.СК
	|			И уб_СвободныеНомераПолисовСрезПоследних.НомерПолиса = ВложенныйЗапрос.НомерПолиса");
	Запрос.УстановитьПараметр("Период", 		СтруктураСНП.Период);
	Запрос.УстановитьПараметр("СК",				СтруктураСНП.СК);
	Запрос.УстановитьПараметр("НомерПолиса",    СтруктураСНП.НомерПолиса);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтруктураСНП.Существует = Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураСНП.Существует 		= Истина;
		СтруктураСНП.Поставщик 			= Выборка.Поставщик;
		СтруктураСНП.ВидНумерации 		= Выборка.ВидНумерации;
		СтруктураСНП.ГодПолиса			= Выборка.ГодПолиса;
		СтруктураСНП.НомерИспользован 	= Выборка.НомерИспользован;
		СтруктураСНП.НомерЗаблокирован	= Выборка.НомерЗаблокирован;
		СтруктураСНП.НомерЗарезервирован= Выборка.НомерЗарезервирован;
		СтруктураСНП.НомерВыданАгенту	= Выборка.НомерВыданАгенту;
		СтруктураСНП.КодОперации		= Выборка.КодОперации;
		СтруктураСНП.Существует 		= Истина;
	КонецЕсли;
	//Если тзРег.Количество() < 1 Тогда
	//	СтруктураСНП.Существует = Ложь;
	//Иначе
	//	тз = тзРег[0];
	//	СтруктураСНП.Существует = Истина;
	//	СтруктураСНП.Поставщик 			= тз.Поставщик;
	//	СтруктураСНП.ВидНумерации 		= тз.ВидНумерации;
	//	СтруктураСНП.ГодПолиса			= тз.ГодПолиса;
	//	СтруктураСНП.НомерИспользован 	= тз.НомерИспользован;
	//	СтруктураСНП.НомерЗаблокирован	= тз.НомерЗаблокирован;
	//	СтруктураСНП.НомерЗарезервирован= тз.НомерЗарезервирован;
	//	СтруктураСНП.НомерВыданАгенту	= тз.НомерВыданАгенту;
	//	СтруктураСНП.КодОперации		= тз.КодОперации;
	//	СтруктураСНП.Существует 		= Истина;
	//КонецЕсли;
	
КонецПроцедуры

// Возвращает список положений БСО, которые соответствуют наличию БСО
//
// Параметры
//  ПоложениеБСО - ссылка на перечисление ПоложенияБСО
//
// Возвращаемое значение
//  Булево
//
Функция ПоложениеЕстьВНаличие(ПоложениеБСО) Экспорт 
	Если ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПолученИзСК
	 или ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ВозвращенИзСК
	 или ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданНаТочку
	 или ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ВозвращенСТочки
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


// Получает точку продаж по подразделению
//
// Параметры
//  Подразделение - ссылка на элемент справочника ПодразделенияОрганизации
//
// Возвращаемое значение
//  Ссылка на элемент справочника ПодразделенияОрганизации
//
Функция ПолучитьТочкуПродаж(Подразделение) Экспорт
	
	Если ЗначениеНеЗаполнено(Подразделение) Тогда
		Возврат Подразделение;
	КонецЕсли;
	
	Если Подразделение.УчетБСО Тогда
		Возврат Подразделение;
	Иначе
		Возврат ПолучитьТочкуПродаж(Подразделение.Родитель);
	КонецЕсли;
	
КонецФункции

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа,
//  ТекПользователь                - ссылка на справочник, определяет текущего пользователя  
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  ТипОперации                    - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                   если не передан, то реквизиты, зависящие от вида операции, не заполняются
//
Процедура ЗаполнитьШапкуДокументаСтрБрокер(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "") Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
    оПодразделениеПользователя = уб_СС.ПолучитьПодразделениеАгента(ТекПользователь.ФизЛицо);
	Если ЗначениеНеЗаполнено(оПодразделениеПользователя) Тогда
    	оПодразделениеПользователя = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
	  И ЗначениеНеЗаполнено(ДокументОбъект.Организация) Тогда
		ДокументОбъект.Организация = оПодразделениеПользователя.Владелец;
		Если ДокументОбъект.Организация.Пустая() Тогда
			ДокументОбъект.Организация = ПараметрыСеанса.уб_ОсновнаяОрганизация;
		КонецЕсли;	
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОрганизацияАгент", МетаданныеДокумента) 
	  И ЗначениеНеЗаполнено(ДокументОбъект.ОрганизацияАгент) Тогда
	  #Если Клиент Тогда
		  Если ТекПользователь = ПараметрыСеанса.ТекущийПользователь Тогда
			  ДокументОбъект.ОрганизацияАгент = ПараметрыСеанса.уб_ОсновнаяОрганизация
			  
		  Иначе  
			  
			  ДокументОбъект.ОрганизацияАгент = оПодразделениеПользователя.Владелец;
		  Конецесли;	
	  #Иначе
		  ДокументОбъект.ОрганизацияАгент = оПодразделениеПользователя.Владелец
	  #КонецЕсли
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПодразделениеОрганизации", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.ПодразделениеОрганизации) Тогда
		ДокументОбъект.ПодразделениеОрганизации = оПодразделениеПользователя;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
	  ДокументОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.Склад) Тогда
		ДокументОбъект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.БанковскийСчет) Тогда
		ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
		ДокументОбъект.СчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		ДокументОбъект.ВалютаДокумента = ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.КурсДокумента) Тогда
	    СтруктураКурсаДокумента      = ОбщегоНазначения.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаС", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.ДатаС) Тогда
		ДокументОбъект.ДатаС = ДокументОбъект.Дата;
	КонецЕсли;
	# Если Клиент Тогда
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПериодРегистрации", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.ПериодРегистрации) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(РабочаяДата);
	КонецЕсли;
	#КонецЕсли
	//{{ Добавлено Управление страховым брокером
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента)
	   И ЗначениеНеЗаполнено(ДокументОбъект.Подразделение) Тогда
		ДокументОбъект.Подразделение = ПолучитьТочкуПродаж(оПодразделениеПользователя);
	КонецЕсли;
	Если Метаданные.Последовательности.уб_УчетБСО.Документы.Содержит(МетаданныеДокумента) Тогда
		ДокументОбъект.Дата = ТекущаяДата();
	КонецЕсли;
	ЗаполнитьОбщиеРеквизитыДокумента(ДокументОбъект, МетаданныеДокумента, ТекПользователь);

КонецПроцедуры

Процедура ЗаполнитьОбщиеРеквизитыДокумента(ДокументОбъект, МетаданныеДокумента, ТекПользователь) Экспорт
	
	ОбщиеРеквизиты 	= Метаданные.ОбщиеРеквизиты;
	ИмяДокумента	= МетаданныеДокумента.Имя;	
	//
	ОбщийРеквизит = ОбщиеРеквизиты.Автор;
	Если Не ОбщийРеквизит.Состав.Найти(ИмяДокумента) = Неопределено Или ОбщегоНазначения.ЕстьРеквизитДокумента("Автор", МетаданныеДокумента) Тогда
		ДокументОбъект.Автор = ТекПользователь;
	КонецЕсли;	
	ОбщийРеквизит = ОбщиеРеквизиты.ДатаСоздания;
	Если Не ОбщийРеквизит.Состав.Найти(ИмяДокумента) = Неопределено Или ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаСоздания", МетаданныеДокумента) Тогда
		ДокументОбъект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	ОбщийРеквизит = ОбщиеРеквизиты.ДатаИзменения;
	Если Не ОбщийРеквизит.Состав.Найти(ИмяДокумента) = Неопределено Или ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаИзменения", МетаданныеДокумента) Тогда
		ДокументОбъект.ДатаИзменения = ТекущаяДата();
	КонецЕсли;	
	ОбщийРеквизит = ОбщиеРеквизиты.Модификатор;
	Если Не ОбщийРеквизит.Состав.Найти(ИмяДокумента) = Неопределено Или ОбщегоНазначения.ЕстьРеквизитДокумента("Модификатор", МетаданныеДокумента) Тогда
		ДокументОбъект.Модификатор = ТекПользователь;
	КонецЕсли;	
	
КонецПроцедуры	
// Получает марку транспортного средства по объекту страхования
//
// Параметры
//  Подразделение - ссылка на элемент справочника ОбъектСтрахования
//
// Возвращаемое значение
//  Ссылка на элемент справочника МаркаТС или Неопределено
//
Функция ПолучитьМаркуТС(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТранспортныеСредства.МаркаТС
	|ИЗ
	|	РегистрСведений.уб_ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	ТранспортныеСредства.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаркаТС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Получает направление по переданным параметрам
//
// Параметры
//  Подразделение - ссылка на элемент справочника ПодразделенияОрганизации
//  МаркаТС - ссылка на элемент справочника МаркиТС
//  ЧужоеТС - булево
//
// Возвращаемое значение
//  Ссылка на элемент справочника Направления или Неопределено
//
Функция ПолучитьНаправление(Подразделение, МаркаТС, ЧужоеТС=Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаправленияНастройки.Направление,
	               |	НаправленияНастройки.МаркаТС,
	               |	ВЫБОР
	               |		КОГДА НаправленияНастройки.МаркаТС = &МаркаТС
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Приоритет
	               |ИЗ
	               |	РегистрСведений.уб_НаправленияНастройки КАК НаправленияНастройки
	               |ГДЕ
	               |	НаправленияНастройки.Подразделение = &Подразделение
	               |	И (НаправленияНастройки.МаркаТС = &МаркаТС
	               |			ИЛИ НаправленияНастройки.МаркаТС = &Остальные
	               |			ИЛИ НаправленияНастройки.МаркаТС = &Все)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Если ЧужоеТС Тогда
		Запрос.УстановитьПараметр("МаркаТС", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("МаркаТС", МаркаТС);
	КонецЕсли;
	Запрос.УстановитьПараметр("Остальные", Перечисления.уб_ВидыВыбораМаркиТС.ОстальныеТС);
	Запрос.УстановитьПараметр("Все", Перечисления.уб_ВидыВыбораМаркиТС.ВсеТС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Направление;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Устанавливает номер документа с префиксом "00"
//
// Параметры
//  ДокументОбъект - объект документа
//
Процедура УстановитьНомерДокументаСтрБрокер(ДокументОбъект) Экспорт 
	ДокументОбъект.УстановитьНовыйНомер("00");
КонецПроцедуры

Функция УстановитьСледующийПорядковыйНомер(ВидДокумента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МАКСИМУМ(П.Номер) КАК ПоследнийНомер
				   |ИЗ
				   |	Документ."+ВидДокумента+" КАК П";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Номер = Выборка.ПоследнийНомер + 1;
	Иначе
		Номер = 1; 
	КонецЕсли;	
	Возврат Номер;	
КонецФункции

// Определяет, установлен ли запрет на дату мониторинга
//
// Параметры
//  ДатаМ - дата
//
// Возвращаемое значение
//  Истина - можно использовать, Ложь - нет
//
Функция МожноИспользоватьДатуМониторинга(ДатаМ) Экспорт
	
	ДатаЗапрета = ПараметрыСеанса.уб_Константы.уб_ДатаЗапретаДляМониторинга;	
	Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПраваНаИзменениеДатыМониторинга, Ложь) Тогда
		Возврат Истина;
	КонецЕсли;	
	Если ТипЗнч(ДатаЗапрета) = Тип("Дата") И ДатаЗапрета <> '00010101000000' Тогда
		Если ДатаМ <= ДатаЗапрета Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает дату запрета мониторинга
//
// Параметры
//  нет
//
// Возвращаемое значение
//  Строка
//
Функция ПолучитьДатуЗапретаМ() Экспорт 
	
	ДатаЗапрета = ПараметрыСеанса.уб_Константы.уб_ДатаЗапретаДляМониторинга;
	Если ТипЗнч(ДатаЗапрета) = Тип("Дата") Тогда
		ДатаЗапрета = Формат(ДатаЗапрета, "ДФ=dd.MM.yyyy");
	Иначе
		ДатаЗапрета = '00010101';
	КонецЕсли;
	Возврат ДатаЗапрета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////
// Вспомогательные функции для получения значений из регистров 
// по нескольким измерениям, имеющим приоритет
////////////////////////////////////////////////////////////////////////

Процедура ДобавитьИзмерение(
	соотвИзмРС
	,Знач ИмяПоля
	,Аргумент
	,ЕстьГруппа = Ложь
	,ОбязательныйКритерий = Ложь
	,Важность = -1
	,Пусто = Неопределено
	,ПустоКакЗначение = Ложь //Если передано пустое значение измерения и в выборке есть пустое значение - специфичность будет назначаться как для совпадения 
	)
	ДанныеИзмерения = Новый Структура("ИмяПоля, Аргумент, Пусто, ЕстьГруппа, ОбязательныйКритерий, Важность, ПустоКакЗначение",
									   ИмяПоля, Аргумент, Пусто, ЕстьГруппа, ОбязательныйКритерий, Важность, ПустоКакЗначение); 
									   
	Если ЕстьГруппа Тогда
		СписокГрупп = Новый Массив;
		//>>>!!!TODEL
		//УправлениеВзаиморасчетами.ПолучитьСписокВышестоящихГрупп(СписокГрупп, Аргумент);	
		ДанныеИзмерения.Вставить("СписокГрупп",СписокГрупп);
	КонецЕсли;
	
	Если ДанныеИзмерения.Важность = -1 Тогда
		ДанныеИзмерения.Важность = Pow(2,соотвИзмРС.Количество());
	КонецЕсли;
	
	соотвИзмРС.Вставить(ИмяПоля,ДанныеИзмерения);
КонецПроцедуры

Функция ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра, СписокПолейНеВлияющихНаПриоритет = Неопределено, Запрос = Неопределено)
	
	ПустаяЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос();
	КонецЕсли;
	Запрос.УстановитьПараметр("наДату",наДату);
	Запрос.Текст = ПостояннаяЧастьЗапроса;
	Рез = ЯдроПолученияДанных(Запрос, соотвИзмРС, РезультатЗапроса, ПустаяЗапись, СписокПолейНеВлияющихНаПриоритет);	
	ТекстЗапроса = Запрос.Текст;
	Возврат Рез; 
	
КонецФункции

Функция ЯдроПолученияДанных(ЗапросЯдроПолученияДанных, соотвИзмРС, РезультатЗапроса, ПустаяЗапись, СписокПолейНеВлияющихНаПриоритет = Неопределено) Экспорт
	
	ФиктивноеЗначение = "фиктивное значение";	
	ТекстЗапроса = ЗапросЯдроПолученияДанных.Текст; 
	//Устанавливаем параметры для тех реквизитов, у которых указан признак ОбязательныйКритерий
	//Формируем пустые значения
	Для Каждого Элемент Из соотвИзмРС Цикл 
		Изм = Элемент.Значение;
		Изм.Пусто = ПустаяЗапись[Изм.ИмяПоля];
		Если  Изм.ОбязательныйКритерий Тогда
			ЗапросЯдроПолученияДанных.УстановитьПараметр(Изм.ИмяПоля, Изм.Аргумент);
			ТекстЗапроса = ТекстЗапроса +" И Т." + Изм.ИмяПоля + " = &" + Изм.ИмяПоля + " ";	
		КонецЕсли;
	КонецЦикла; 	
    ЗапросЯдроПолученияДанных.Текст = ТекстЗапроса;
 	РезультатЗапроса = ЗапросЯдроПолученияДанных.Выполнить();
	//ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		ИмяПоля = Колонка.Имя;
		Элемент = соотвИзмРС[ИмяПоля];
		Если Элемент = Неопределено Тогда
			
			//Если НЕ ПустаяЗапись.Метаданные().Реквизиты.Найти(ИмяПоля) = Неопределено Тогда
				Попытка
					ЗначениеПустого  = ПустаяЗапись[ИмяПоля];
				Исключение
					Если Найти(ИмяПоля,"Строка") Тогда
						ЗначениеПустого = "";
					ИначеЕсли Найти(ИмяПоля,"Число") Тогда
						ЗначениеПустого = 0;	
					Иначе
						ЗначениеПустого = Неопределено;
					КонецЕсли;	
				КонецПопытки;	
			//Иначе
			//	Если Найти(ИмяПоля,"Строка") Тогда
			//		ЗначениеПустого = "";
			//	ИначеЕсли Найти(ИмяПоля,"Число") Тогда
			//		ЗначениеПустого = 0;	
			//	Иначе
			//		ЗначениеПустого = Неопределено;
			//	КонецЕсли;	
			//КонецЕсли;	
				
			ДобавитьИзмерение(соотвИзмРС,ИмяПоля,ФиктивноеЗначение,Ложь,Ложь,0,ЗначениеПустого);
 		КонецЕсли;
	КонецЦикла;
	ТаблицаРезультата.Колонки.Вставить(0,"Приоритет",,,15);
	ТаблицаРезультата.Колонки.Добавить("Специфичность",,,30);
	ТаблицаРезультата.Колонки.Добавить("Совпадения",,,30);
	СписокПолейНеВлияющихНаПриоритетЭтоМассив = ТипЗнч(СписокПолейНеВлияющихНаПриоритет) = Тип("Массив");
	Для Каждого Стр Из ТаблицаРезультата Цикл
		Совпадения = 0;
		Специфичность = 0;
		Важность = 0;
		сСпец = "";
		сСовп = "";
		Стр.Приоритет = 0;
		Для Каждого Элемент Из соотвИзмРС Цикл 
			//Если Стр.Приоритет = -1 Тогда
			//	//Пропускаем строки, у которых было найдено неравенство значения переданного измерения и значения поля 
			//	Прервать;//Продолжить;
			//КонецЕсли;
			Изм 			= Элемент.Значение;
			Аргумент 		= Изм.Аргумент;
			ПустоеЗначение 	= Изм.Пусто;
			ЗначениеПоля 	= Стр[Изм.ИмяПоля];
			ИмяПоля 		= Изм.ИмяПоля;
			Если Аргумент = ФиктивноеЗначение
				ИЛИ Аргумент = ПустоеЗначение 
				ИЛИ Аргумент = Неопределено 
				 Тогда
				//Передано пустое значение Измерения или не передано вовсе	
				Если СписокПолейНеВлияющихНаПриоритетЭтоМассив 
					И СписокПолейНеВлияющихНаПриоритет.Найти(ИмяПоля) <> Неопределено Тогда
					// Обрабатываемое поле входит в список (массив) полей, которые не должны влиять на приоритет
					// это никак не тражается на приоритете выбора
				ИначеЕсли ЗначениеПоля <> ПустоеЗначение Тогда
					//Устанавливаем специфичность 
					Специфичность = Специфичность + 1;
					сСпец = сСпец + ИмяПоля + "/"; //%%%%%
				ИначеЕсли ЗначениеПоля = ПустоеЗначение Тогда
					Если Изм.ПустоКакЗначение И ЗначениеПоля = Аргумент Тогда
						//Совпадения c пустым значением измерения
						//Устанавливаем специфичность 
						//Специфичность = Специфичность + 1;
						//сСпец = сСпец + ИмяПоля + "/"; //%%%%%
						//И, поскольку значение поля и измерения совпадают,
						//устанавливаем совпадение и важность
						Совпадения = Совпадения + Изм.Важность;
						сСовп = сСовп + ИмяПоля + "/"; //%%%%%
						Важность = Важность + Изм.Важность;
					Иначе
						// это никак не тражается на приоритете выбора
					КонецЕсли;
				Иначе
					// это никак не тражается на приоритете выбора
				КонецЕсли;
			Иначе
				//Передано действительное значение Измерения	
				Если ЗначениеПоля <> ПустоеЗначение Тогда
					//Если занчение поля не пусто 
					//и не совпадает с переданным,
					//Исключаем поле из рассмотрения
					Если ЗначениеПоля <> Аргумент Тогда
						Стр.Приоритет = -1;
						Прервать;//Продолжить;
					КонецЕсли;
					//Если значение поля не пусто
					//Устанавливаем специфичность
					Специфичность = Специфичность + 1;
					сСпец = сСпец + Изм.ИмяПоля + "/"; //%%%%%
					//И, поскольку значение поля и измерения совпадают,
					//устанавливаем совпадение и важность
					Совпадения = Совпадения + Изм.Важность;
					сСовп = сСовп + ИмяПоля + "/"; //%%%%%
					Важность = Важность + Изм.Важность;
				Иначе
					//Если занчение поля ПУСТО (то есть, оно не специфицировано и может быть подходящим по другим критериям..) 
					//Специфичность не устанавливаем
					//Важность - устанавливаем (значение измерения не пусто)
					Важность = Важность + Изм.Важность;
				КонецЕсли;
			КонецЕсли;
			Стр.Приоритет = Совпадения * 1000000000 + Специфичность * 1000000 + Важность;
			Стр.Специфичность = сСпец; //%%%%%
			Стр.Совпадения = сСовп; //%%%%%
		КонецЦикла;	
	КонецЦикла;
	ТаблицаРезультата.Сортировать("Приоритет Убыв");
	//Создаем колонки в последовательности по убыванию приоритета
	ТЗколонок = Новый ТаблицаЗначений;
	ТЗколонок.Колонки.Добавить("Важность");
	ТЗколонок.Колонки.Добавить("ИмяПоля");
	Для каждого Элемент Из соотвИзмРС Цикл 
		Изм = Элемент.Значение;
		НовСтр = ТЗколонок.Добавить();
		НовСтр.Важность = ?(Изм.ОбязательныйКритерий = Истина,-1,Изм.Важность);
		НовСтр.ИмяПоля = Изм.ИмяПоля;
	КонецЦикла;
	ТЗколонок.Сортировать("Важность Убыв");
	ТЗРез = Новый ТаблицаЗначений;
	Для каждого стрКол из ТЗколонок Цикл 
		ТЗРез.Колонки.Добавить(стрКол.ИмяПоля);
	КонецЦикла;
	//В результирующую таблицу добавляются строки с наивысшим значением приоритета (и только с одним значением приоритета!)
	Первый = Истина;
	ПоследнийПриоритет = 0;
	Для Каждого Стр Из ТаблицаРезультата Цикл
		Если Стр.Приоритет = -1 Тогда
			Продолжить;
		КонецЕсли;
		Если Первый Или Стр.Приоритет = ПоследнийПриоритет Тогда
			Первый = Ложь;
			ПоследнийПриоритет = Стр.Приоритет;
			НовСтрока = ТЗРез.Добавить();
			Для каждого Кол Из ТЗРез.Колонки Цикл
				НовСтрока[Кол.Имя] = Стр[Кол.Имя];
			КонецЦикла; 	
		КонецЕсли;
	КонецЦикла;
	Возврат ТЗРез;
	
КонецФункции


//Функция ЯдроПолученияДанных(ЗапросЯдроПолученияДанных, соотвИзмРС, РезультатЗапроса, ПустаяЗапись, СписокПолейНеВлияющихНаПриоритет = Неопределено) Экспорт
//	
//	ФиктивноеЗначение = "фиктивное значение";	
//	ТекстЗапроса = ЗапросЯдроПолученияДанных.Текст; 
//	//Устанавливаем параметры для тех реквизитов, у которых указан признак ОбязательныйКритерий
//	//Формируем пустые значения
//	Для Каждого Элемент Из соотвИзмРС Цикл 
//		Изм = Элемент.Значение;
//		Изм.Пусто = ПустаяЗапись[Изм.ИмяПоля];
//		Если  Изм.ОбязательныйКритерий Тогда
//			ЗапросЯдроПолученияДанных.УстановитьПараметр(Изм.ИмяПоля, Изм.Аргумент);
//			ТекстЗапроса = ТекстЗапроса +" И Т." + Изм.ИмяПоля + " = &" + Изм.ИмяПоля + " ";	
//		КонецЕсли;
//	КонецЦикла; 	
//	ЗапросЯдроПолученияДанных.Текст = ТекстЗапроса;
// 	РезультатЗапроса = ЗапросЯдроПолученияДанных.Выполнить();
//	//ТаблицаРезультата = Новый ТаблицаЗначений;
//	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
//	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
//		ИмяПоля = Колонка.Имя;
//		Элемент = соотвИзмРС[ИмяПоля];
//		Если Элемент = Неопределено Тогда
//			Попытка
//				ЗначениеПустого  = ПустаяЗапись[ИмяПоля];
//			Исключение
//				Если Найти(ИмяПоля,"Строка") Тогда
//					ЗначениеПустого = "";
//				ИначеЕсли Найти(ИмяПоля,"Число") Тогда
//					ЗначениеПустого = 0;	
//				Иначе
//					ЗначениеПустого = Неопределено;
//				КонецЕсли;	
//			КонецПопытки;	
//			ДобавитьИзмерение(соотвИзмРС,ИмяПоля,ФиктивноеЗначение,Ложь,Ложь,0,ЗначениеПустого);
// 		КонецЕсли;
//	КонецЦикла;
//	ТаблицаРезультата.Колонки.Вставить(0,"Приоритет",Новый ОписаниеТипов("Число"),,15);
//	ТаблицаРезультата.Колонки.Добавить("Специфичность",Новый ОписаниеТипов("Строка"),,30);
//	ТаблицаРезультата.Колонки.Добавить("Совпадения",Новый ОписаниеТипов("Строка"),,30);
//	СписокПолейНеВлияющихНаПриоритетЭтоМассив = ТипЗнч(СписокПолейНеВлияющихНаПриоритет) = Тип("Массив");
//	ЭтоОтладка = Ложь;
//	Для Каждого Стр Из ТаблицаРезультата Цикл
//		Совпадения = 0;
//		Специфичность = 0;
//		Важность = 0;
//		сСпец = "";
//		сСовп = "";
//		Стр.Приоритет = 0;
//		Для Каждого Элемент Из соотвИзмРС Цикл 
//			//Если Стр.Приоритет = -1 Тогда
//			//	//Пропускаем строки, у которых было найдено неравенство значения переданного измерения и значения поля 
//			//	Прервать;//Продолжить;
//			//КонецЕсли;
//			Изм 			= Элемент.Значение;
//			Аргумент 		= Изм.Аргумент;
//			ПустоеЗначение 	= Изм.Пусто;
//			ЗначениеПоля 	= Стр[Изм.ИмяПоля];
//			ИмяПоля 		= Изм.ИмяПоля;
//			Если Аргумент = ФиктивноеЗначение
//				ИЛИ Аргумент = ПустоеЗначение 
//				ИЛИ Аргумент = Неопределено 
//				 Тогда
//				//Передано пустое значение Измерения или не передано вовсе	
//				Если СписокПолейНеВлияющихНаПриоритетЭтоМассив 
//					И СписокПолейНеВлияющихНаПриоритет.Найти(ИмяПоля) <> Неопределено Тогда
//					// Обрабатываемое поле входит в список (массив) полей, которые не должны влиять на приоритет
//					// это никак не тражается на приоритете выбора
//				ИначеЕсли ЗначениеПоля <> ПустоеЗначение Тогда
//					//Устанавливаем специфичность 
//					Специфичность = Специфичность + 1;
//					сСпец = сСпец + ИмяПоля + "/"; //%%%%%
//				ИначеЕсли ЗначениеПоля = ПустоеЗначение Тогда
//					Если Изм.ПустоКакЗначение И ЗначениеПоля = Аргумент Тогда
//						//Совпадения c пустым значением измерения
//						//Устанавливаем специфичность 
//						//Специфичность = Специфичность + 1;
//						//сСпец = сСпец + ИмяПоля + "/"; //%%%%%
//						//И, поскольку значение поля и измерения совпадают,
//						//устанавливаем совпадение и важность
//						Совпадения = Совпадения + Изм.Важность;
//						сСовп = сСовп + ИмяПоля + "/"; //%%%%%
//						Важность = Важность + Изм.Важность;
//					Иначе
//						// это никак не тражается на приоритете выбора
//					КонецЕсли;
//				Иначе
//					// это никак не тражается на приоритете выбора
//				КонецЕсли;
//			Иначе
//				//Передано действительное значение Измерения	
//				Если ЗначениеПоля <> ПустоеЗначение Тогда
//					//Если занчение поля не пусто 
//					//и не совпадает с переданным,
//					//Исключаем поле из рассмотрения
//					Если ЗначениеПоля <> Аргумент Тогда
//						Стр.Приоритет = -1;
//						Прервать;//Продолжить;
//					КонецЕсли;
//					//Если значение поля не пусто
//					//Устанавливаем специфичность
//					Специфичность = Специфичность + 1;
//					сСпец = сСпец + Изм.ИмяПоля + "/"; //%%%%%
//					//И, поскольку значение поля и измерения совпадают,
//					//устанавливаем совпадение и важность
//					Совпадения = Совпадения + Изм.Важность;
//					сСовп = сСовп + ИмяПоля + "/"; //%%%%%
//					Важность = Важность + Изм.Важность;
//				Иначе
//					//Если занчение поля ПУСТО (то есть, оно не специфицировано и может быть подходящим по другим критериям..) 
//					//Специфичность не устанавливаем
//					//Важность - устанавливаем (значение измерения не пусто)
//					Важность = Важность + Изм.Важность;
//				КонецЕсли;
//			КонецЕсли;
//			Стр.Приоритет = Совпадения + Специфичность * 1000000 + Важность;
//			//Стр.Приоритет = уб_Кэшируемые.Приоритет(Совпадения,Специфичность,Важность);
//			//Если ЭтоОтладка = Истина Тогда
//				Стр.Специфичность = сСпец; //%%%%%
//				Стр.Совпадения = сСовп; //%%%%%
//			//КонецЕсли;
//		КонецЦикла;	
//	КонецЦикла;
//	ТаблицаРезультата.Сортировать("Приоритет Убыв");
//	//Создаем колонки в последовательности по убыванию приоритета
//	ТЗколонок = Новый ТаблицаЗначений;
//	ТЗколонок.Колонки.Добавить("Важность");
//	ТЗколонок.Колонки.Добавить("ИмяПоля");
//	Для каждого Элемент Из соотвИзмРС Цикл 
//		Изм = Элемент.Значение;
//		НовСтр = ТЗколонок.Добавить();
//		НовСтр.Важность = ?(Изм.ОбязательныйКритерий = Истина,-1,Изм.Важность);
//		НовСтр.ИмяПоля = Изм.ИмяПоля;
//	КонецЦикла;
//	ТЗколонок.Сортировать("Важность Убыв");
//	ТЗРез = Новый ТаблицаЗначений;
//	Для каждого стрКол из ТЗколонок Цикл 
//		ТЗРез.Колонки.Добавить(стрКол.ИмяПоля);
//	КонецЦикла;
//	//В результирующую таблицу добавляются строки с наивысшим значением приоритета (и только с одним значением приоритета!)
//	Первый = Истина;
//	ПоследнийПриоритет = 0;
//	Для Каждого Стр Из ТаблицаРезультата Цикл
//		Если Стр.Приоритет = -1 Тогда
//			Продолжить;
//		КонецЕсли;
//		Если Первый Или Стр.Приоритет = ПоследнийПриоритет Тогда
//			Первый = Ложь;
//			ПоследнийПриоритет = Стр.Приоритет;
//			НовСтрока = ТЗРез.Добавить();
//			Для каждого Кол Из ТЗРез.Колонки Цикл
//				НовСтрока[Кол.Имя] = Стр[Кол.Имя];
//			КонецЦикла; 	
//		КонецЕсли;
//	КонецЦикла;
//	Возврат ТЗРез;
//	
//КонецФункции

/////////////////////////////////////////////////
// Получение значений из регистров 
/////////////////////////////////////////////////

//////// КВ, АВ ,ВМ


Функция Получить_КВ_Брокера(
	Знач наДату, 
	Знач СК, 
	Знач Поставщик, 
	Знач ОрганизацияАгент, 
	Знач ВидСП, 
	Знач СтраховойПродукт, 
	Знач Риск = Неопределено
	) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	
	//4-й парам: ЕстьГруппа - булево. Если ИСТИНА, то для данного измерения надо искать записи,
	// в которых значения совпадают со значениями вышестоящих групп
	
	//5-й парам: ОбязательныйКритерий - булево. 
	//Если ИСТИНА, то в критерии выборки добавляется жесткое условие по этому измерению 	
	
	//Добавление измерений - в порядке возрастания важности
	//Важность - самый весомый параметр подбора. Поэтому в первую очередь будут выбраны
	// совпадения аргумента с наиболее важными параметрами
	
	ДобавитьИзмерение(соотвИзмРС,"СК",СК,Ложь,Истина);
	Если Поставщик <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС,"Поставщик",Поставщик);
	КонецЕсли;
	Если ОрганизацияАгент <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС,"ОрганизацияАгент",ОрганизацияАгент);
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС,"ВидСП",ВидСП);
	ДобавитьИзмерение(соотвИзмРС,"СтраховойПродукт",СтраховойПродукт);
	
	// В СписокПолейНеВлияющихНаПриоритет передаются имена полей, которые не будут учавствовать в процедуре выбора 
	// в качестве критериев отбора. Они никак не повлияют на приоритет выбора тех или иных записей.
	// И если по прочим критериям отбора найдется несколько строк с различными значениями в этих полях,
	// то все они будут возвращены.
	СписокПолейНеВлияющихНаПриоритет = Новый Массив;
	СписокПолейНеВлияющихНаПриоритет.Добавить("Процент");
	СписокПолейНеВлияющихНаПриоритет.Добавить("ПроцентДляОтчета");
	СписокПолейНеВлияющихНаПриоритет.Добавить("Условие");
	СписокПолейНеВлияющихНаПриоритет.Добавить("Банк");
	СписокПолейНеВлияющихНаПриоритет.Добавить("БанкСтрока");
	СписокПолейНеВлияющихНаПриоритет.Добавить("Код");
	СписокПолейНеВлияющихНаПриоритет.Добавить("ПролонгацияПоПредыдущемуПроценту");
	
	Если Риск = Неопределено Тогда
		СписокПолейНеВлияющихНаПриоритет.Добавить("Риск");
	Иначе	
		ДобавитьИзмерение(соотвИзмРС,"Риск",Риск,Истина);
	КонецЕсли;	
	ПостояннаяЧастьЗапроса = 
	"ВЫБРАТЬ
	|	Т.СК,
	|	Т.Поставщик,
	|	Т.ОрганизацияАгент,
	|	Т.ВидСП,
	|	Т.СтраховойПродукт,
	|	Т.Риск,
	|	Т.Условие,
	|	Т.Банк,
	|	ЕСТЬNULL(Т.Банк.Наименование, """") КАК БанкСтрока,
	|	Т.Процент,
	|	Т.ПроцентДляОтчета,
	|	Т.Код,
	|	Т.Ссылка,
	|	Т.ПролонгацияПоПредыдущемуПроценту
	|ИЗ
	|	Справочник.уб_КВ КАК Т
	|ГДЕ
	|	Т.ДатаНачалаДействия <= &наДату
	|	И (Т.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ Т.ДатаОкончанияДействия > &наДату)";					
	Запрос = Новый Запрос();
	Запрос.Текст = ПостояннаяЧастьЗапроса;
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Неопределено;
	ПустаяЗапись = Справочники.уб_КВ.ПустаяСсылка();
	Возврат ЯдроПолученияДанных(Запрос, соотвИзмРС, РезультатЗапроса, ПустаяЗапись, СписокПолейНеВлияющихНаПриоритет);	
	
КонецФункции

Функция Получить_АВ(
	Знач наДату 
	, Знач СсылкаНаКВ 
	, Знач Организация = Неопределено
	, Знач Подразделение = Неопределено 
	, Знач Агент
	) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	
	ДобавитьИзмерение(соотвИзмРС,"СсылкаНаКВ",СсылкаНаКВ,Ложь,Истина);
	
	Если Организация <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС,"Организация",Организация);
	КонецЕсли;
	Если Подразделение <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,Истина);
	КонецЕсли;
	Если Агент <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС,"Агент",Агент,Истина);
	КонецЕсли;
	
	СписокПолейНеВлияющихНаПриоритет = Новый Массив;
	СписокПолейНеВлияющихНаПриоритет.Добавить("СсылкаНаКВ");
	СписокПолейНеВлияющихНаПриоритет.Добавить("ДатаНачалаДействия");
	СписокПолейНеВлияющихНаПриоритет.Добавить("ДатаОкончанияДействия");
	СписокПолейНеВлияющихНаПриоритет.Добавить("Процент");
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ
	                         |	Т.*
	                         |ИЗ
	                         |	РегистрСведений.уб_КВ_Агентов КАК Т
	                         |ГДЕ
	                         |	Т.ДатаНачалаДействия <= &наДату
	                         |	И (Т.ДатаОкончанияДействия = &НульДата
	                         |			ИЛИ Т.ДатаОкончанияДействия > &наДату)";
					
	Запрос = Новый Запрос();
	Запрос.Текст = ПостояннаяЧастьЗапроса;
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("НульДАта", Дата("00010101000000"));
	
	РезультатЗапроса = Неопределено;
	ПустаяЗапись = РегистрыСведений.уб_КВ_Агентов.СоздатьМенеджерЗаписи();
	Возврат ЯдроПолученияДанных(Запрос, соотвИзмРС, РезультатЗапроса, ПустаяЗапись, СписокПолейНеВлияющихНаПриоритет);	
КонецФункции

Функция ПолучитьДельтуКВ(
	Знач наДату, 
	Знач НазначениеКВ,
	Знач Организация, 
	Знач Подразделение 		= Неопределено, 
	Знач Агент 				= Неопределено, 
	Знач Поставщик 			= Неопределено, 
	Знач ОрганизацияАгент 	= Неопределено, 
	Знач СК 				= Неопределено, 
	Знач ВидСП 				= Неопределено, 
	Знач СтраховойПродукт 	= Неопределено 
	) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_КВ_ДельтыАгентовИМенеджеров";	
	Если Не ЗначениеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС, "Организация", Организация,,,,, Истина);
	Если ОрганизацияАгент <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС, "ОрганизацияАгент", ОрганизацияАгент);
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС,"Подразделение", Подразделение,,,4,, Истина);
	Если НЕ ЗначениеНеЗаполнено(Агент) Тогда
		ДобавитьИзмерение(соотвИзмРС, "Агент", Агент, Ложь,,4,, Истина);
	КонецЕсли;

	Если Поставщик <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС, "Поставщик", Поставщик);
	КонецЕсли;
	
	Если СК <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС, "СК", СК);
	КонецЕсли;
	Если ВидСП <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС, "ВидСП", ВидСП);
	КонецЕсли;
	Если СтраховойПродукт <> Неопределено Тогда
		ДобавитьИзмерение(соотвИзмРС, "СтраховойПродукт", СтраховойПродукт);
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС,"НазначениеКВ",НазначениеКВ);
	ПостояннаяЧастьЗапроса =
	"ВЫБРАТЬ
	|	Т.*
	|ИЗ
	|	РегистрСведений.уб_КВ_ДельтыАгентовИМенеджеров.СрезПоследних(&наДату, ) КАК Т
	|ГДЕ
	|	Т.НеДействует = ЛОЖЬ";					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
	
КонецФункции


/////// Руководитель подразделения
//эта функция вернет только руководителя, НЕ заместителя
Функция ПолучитьРуководителяПодразделения(наДату, Подразделение = Неопределено,ЗАМ = Ложь) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_РуководителиПодразделений";
	
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение);

	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&наДату, "+?(ЗАМ=Ложь,"НЕ","")+" Заместитель) КАК Т
					|	ГДЕ Т.Уход = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	ТЗРез = ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
		
	Если ТЗРез.Количество() > 0 Тогда
		Возврат ТЗРез[0];
	Иначе
		Возврат РегистрыСведений.уб_РуководителиПодразделений.СоздатьМенеджерЗаписи();		
	КонецЕсли;
КонецФункции

/////// Параметры договоров
Функция ПолучитьПараметрДоговора(
	НаДату 						= Неопределено, 
	Наименование 				= Неопределено, 
	Поставщик 					= Неопределено, 
	ОрганизацияАгент 			= Неопределено, 
	Объект 						= Неопределено,
	Знач РольКонтактногоЛица	= ""
	) Экспорт
	
	РольКонтактногоЛица = НРег(СокрЛП(РольКонтактногоЛица));
	Если РольКонтактногоЛица <> "" И РольКонтактногоЛица <> "рук" Тогда
		//получаем данные из контактного лица напрямую по реквизиту РольКонтактногоЛица
		//TODO параметр ОрганизацияАгент игнорируется в этом случае (у справочника КонтактныеЛица нет реквизита ОрганизацияАгент)
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	КЛ.Ссылка,
		|	КЛ.Должность,
		|	КЛ.ОснованиеДействия
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КЛ
		|ГДЕ
		|	НЕ КЛ.ПометкаУдаления
		|	И КЛ.Роль.Наименование = &РольКонтактногоЛица
		|	И КЛ.ВидКонтактногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента)
		|	И &УсловиеГде
		|
		|УПОРЯДОЧИТЬ ПО
		|	КЛ.ДатаСоздания УБЫВ";
		Если ЗначениеЗаполнено(Поставщик) Тогда
			УсловиеГде = "КЛ.ОбъектВладелец = &Поставщик";
			Запрос.УстановитьПараметр("Поставщик", Поставщик);
		Иначе
			УсловиеГде = Истина;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
		Запрос.УстановитьПараметр("РольКонтактногоЛица", РольКонтактногоЛица);
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Наименование = "ЛицоПринципала" Тогда
				Возврат Выборка.Ссылка
			ИначеЕсли Наименование = "ЛицоПринципала_Должность" Тогда
				Возврат Выборка.Должность
			ИначеЕсли Наименование = "ЛицоПринципала_ОснованиеДействия" Тогда
				Возврат Выборка.ОснованиеДействия
			ИначеЕсли Наименование = "Структура" Тогда
				Структура = Новый Структура;
				Структура.Вставить("ЛицоПринципала", 					Выборка.Ссылка);
				Структура.Вставить("ЛицоПринципала_Должность", 			Выборка.Должность);
				Структура.Вставить("ОргАгент_Доверенность", 			"");
				Структура.Вставить("ЛицоПринципала_ОснованиеДействия", 	Выборка.ОснованиеДействия);
				Возврат Структура;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();	
	КонецЕсли;
	Если Поставщик = Неопределено Тогда
		Поставщик = Справочники.Контрагенты.ПустаяСсылка();	
	КонецЕсли;
	Если ОрганизацияАгент = Неопределено Тогда
		ОрганизацияАгент = Справочники.Организации.ПустаяСсылка();	
	КонецЕсли;
	Если Объект <> Неопределено И НЕ Объект.Метаданные().Реквизиты.Найти("КонтактноеЛицо") = Неопределено И ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		Если Наименование = "ЛицоПринципала_Должность" Тогда
			Если ЗначениеЗаполнено(Объект.ДолжностьКонтактногоЛица) Тогда
				Возврат Объект.ДолжностьКонтактногоЛица;
			Иначе
				Возврат Объект.КонтактноеЛицо.Должность;
			КонецЕсли;
		ИначеЕсли Наименование = "ОргАгент_Доверенность" Тогда
			Если ЗначениеЗаполнено(Объект.ДоверенностьКонтрагента) Тогда
				Возврат Объект.ДоверенностьКонтрагента;
			Иначе
				Возврат Объект.Поставщик.Доверенность;
			КонецЕсли;
		ИначеЕсли Наименование = "ЛицоПринципала_ОснованиеДействия" Тогда
			Если ЗначениеЗаполнено(Объект.ОснованиеДействияКонтактногоЛица) Тогда
				Возврат Объект.ОснованиеДействияКонтактногоЛица;
			Иначе
				Возврат Объект.КонтактноеЛицо.ОснованиеДействия;
			КонецЕсли;
		Иначе
			Если Наименование = "ЛицоПринципала" Тогда
				Возврат Объект.КонтактноеЛицо;
			Иначе
				ЗапросКЛ = Новый Запрос;
				ЗапросКЛ.Текст = "ВЫБРАТЬ
				|	КонтактныеЛица.Должность,
				|	КонтактныеЛица.ОснованиеДействия,
				|	КонтактныеЛица.ОбъектВладелец.Доверенность КАК Доверенность
				|ИЗ
				|	Справочник.КонтактныеЛица КАК КонтактныеЛица
				|ГДЕ
				|	КонтактныеЛица.Ссылка = &Ссылка";
				ЗапросКЛ.УстановитьПараметр("Ссылка", Объект.КонтактноеЛицо);
				ВыборкаКЛ = ЗапросКЛ.Выполнить().Выбрать();
				ВыборкаКЛ.Следующий();
				Структура = Новый Структура;
				Структура.Вставить("ЛицоПринципала", Объект.КонтактноеЛицо);
				Если ЗначениеЗаполнено(Объект.ДолжностьКонтактногоЛица) Тогда
					Структура.Вставить("ЛицоПринципала_Должность", Объект.ДолжностьКонтактногоЛица);
				Иначе
					Структура.Вставить("ЛицоПринципала_Должность", ВыборкаКЛ.Должность);
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ДоверенностьКонтрагента) Тогда
					Структура.Вставить("ОргАгент_Доверенность", Объект.ДоверенностьКонтрагента);
				Иначе
					Структура.Вставить("ОргАгент_Доверенность", ВыборкаКЛ.Доверенность);
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ОснованиеДействияКонтактногоЛица) Тогда
					Структура.Вставить("ЛицоПринципала_ОснованиеДействия", Объект.ОснованиеДействияКонтактногоЛица);
				Иначе
					Структура.Вставить("ЛицоПринципала_ОснованиеДействия", ВыборкаКЛ.ОснованиеДействия);
				КонецЕсли;
				Возврат Структура;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Ссылка = ДоговорыКонтрагентов.Владелец.ОсновнойДоговорКонтрагента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОсновнойДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Поставщик
	|	И ДоговорыКонтрагентов.Организация = &ОрганизацияАгент
	|	И (ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора > &ТекДата)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Договоры.ЭтоОсновнойДоговорКонтрагента, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок2,
	|	ВЫБОР
	|		КОГДА уб_ПараметрыДоговоровИОтчетовСрезПоследних.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок1,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.ОснованиеДействия, """") КАК ОснованиеДействия,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.Поставщик.Доверенность, """") КАК Доверенность,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Должность, """") КАК Должность,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Имя, """") КАК Имя,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Наименование, """") КАК КонтактноеЛицоНаименование
	|ИЗ
	|	РегистрСведений.уб_ПараметрыДоговоровИОтчетов.СрезПоследних(
	|			&ТекДата,
	|			Поставщик = &Поставщик
	|				И ОрганизацияАгент = &ОрганизацияАгент
	|				И (Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ИЛИ Договор В
	|						(ВЫБРАТЬ
	|							Т.Договор
	|						ИЗ
	|							ВТ_Договоры КАК Т))) КАК уб_ПараметрыДоговоровИОтчетовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
	|		ПО уб_ПараметрыДоговоровИОтчетовСрезПоследних.Договор = ВТ_Договоры.Договор
	|ГДЕ
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок1,
	|	Порядок2";	
	Запрос.УстановитьПараметр("Поставщик",			Поставщик);
	Запрос.УстановитьПараметр("ОрганизацияАгент",	ОрганизацияАгент);
	Запрос.УстановитьПараметр("ТекДата",			НаДату);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Наименование = "ЛицоПринципала" Тогда
			Возврат Выборка.КонтактноеЛицо;
		ИначеЕсли Наименование = "ЛицоПринципала_Должность" Тогда
			Возврат Выборка.Должность;
		ИначеЕсли Наименование = "ОргАгент_Доверенность" Тогда
			Возврат Выборка.Доверенность;
		ИначеЕсли Наименование = "ЛицоПринципала_ОснованиеДействия" Тогда
			Возврат Выборка.ОснованиеДействия;
		Иначе
			Структура = Новый Структура;
			Структура.Вставить("ЛицоПринципала", 					Выборка.КонтактноеЛицо);
			Структура.Вставить("ЛицоПринципала_Должность", 			Выборка.Должность);
			Структура.Вставить("ОргАгент_Доверенность", 			Выборка.Доверенность);
			Структура.Вставить("ЛицоПринципала_ОснованиеДействия", 	Выборка.ОснованиеДействия);
			Возврат Структура;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат Новый Структура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


//////// Получение Схемы Расчета с Менеджером
Функция ПолучитьСхемуРасчетаСМенеджером(Знач наДату, Знач Организация, Знач Подразделение = Неопределено, Знач Агент = Неопределено, Знач ВидСП = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_СхемыРасчетовСМенеджерами";
	
	Если ЗначениеНеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Подразделение) И  НЕ ЗначениеНеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация);
	ДобавитьИзмерение(соотвИзмРС,"ВидСП",        ВидСП,              ,,,,Истина); //ПустоКакЗначение = Истина
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,      ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",        Агент,        Истина,,,,Истина);
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_СхемыРасчетовСМенеджерами.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции

//////// Получение Схемы Расчета с Руководителем ОП
Функция ПолучитьСхемуРасчетаСРуководителемОП(Знач наДату, Знач Организация, Знач Подразделение = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_СхемыВознагражденияРуководителейОП";
	
	Если ЗначениеНеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация);
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,      ,,,,Истина);
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_СхемыВознагражденияРуководителейОП.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции

//////// Получение Вознаграждения Курьера
Функция ПолучитьВознаграждениеКурьера(
	Знач наДату, 
	Знач Организация, 
	Знач Подразделение = Неопределено, 
	Знач Агент = Неопределено, 
	Знач ТипПлательщика = Неопределено, 
	Знач Курьер = Неопределено, 
	Знач ВидСП = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_СтавкиВознагражденияКурьеров";
	
	Если ЗначениеНеЗаполнено(Подразделение) И  НЕ ЗначениеНеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(Организация) Тогда
		ДобавитьИзмерение(соотвИзмРС,"Организация",Организация);
	КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение);
	КонецЕсли;
	//ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,      ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",		Агент,		Истина	,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"ТипПлательщика",	ТипПлательщика,			,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Курьер",		Курьер,				,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"ВидСП",		ВидСП,				,,,,Истина); //ПустоКакЗначение = Истина
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_СтавкиВознагражденияКурьеров.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции

//////// Схема "Процент" //////////////
Функция ПолучитьПроцентнуюСтавкуДляСхемы_Процент_(Знач наДату, Знач Организация, Знач Подразделение = Неопределено,	Знач Агент = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_Схема_Процент_ПроцентныеСтавки";
	
	Если ЗначениеНеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Подразделение) И  НЕ ЗначениеНеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация    ,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",Агент                , Истина,,,,Истина);
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_Схема_Процент_ПроцентныеСтавки.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции


//////// Схема "План по СКВ" //////////////

//////// План по СКВ
Функция ПолучитьПланПоСКВ(Знач наДату, Знач Организация, Знач Подразделение = Неопределено, Знач Агент = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_Схема_ПланПоСКВ_Планы";	
	Если Не ЗначениеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация    ,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",Агент                , Истина,,,,Истина);
	ПостояннаяЧастьЗапроса = 
	"ВЫБРАТЬ
	|	Т.*
	|ИЗ
	|	РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_Планы.СрезПоследних(&наДату, ) КАК Т
	|ГДЕ
	|	НЕ Т.НеДействует";
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
	
КонецФункции

//////// СуперПлан по СКВ
Функция ПолучитьСуперПланПоСКВ(Знач наДату, Знач Организация, Знач Подразделение = Неопределено, Знач Агент = Неопределено,ДопУсловие ="") Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_Схема_ПланПоСКВ_СуперПланы";
	
	Если ЗначениеНеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Подразделение) И  НЕ ЗначениеНеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация    ,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",Агент                , Истина,,,,Истина);
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_СуперПланы.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ"+" "+ДопУсловие;
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции

//////// Процентные ставки по СКВ
Функция ПолучитьПроцентныеСтавкиПоСКВ(Знач наДату, Знач Организация, Знач Подразделение = Неопределено, Знач Агент = Неопределено) Экспорт
	
	соотвИзмРС = Новый Соответствие; 
	ИмяРегистра = "уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки";
	
	Если ЗначениеНеЗаполнено(наДату) Тогда
		наДату = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Подразделение) И  НЕ ЗначениеНеЗаполнено(Агент) Тогда
		Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, НаДату,Ложь);
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) И НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
		Организация = Подразделение.Владелец;
	КонецЕсли;
	
	ДобавитьИзмерение(соотвИзмРС,"Организация",Организация    ,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Подразделение",Подразделение,       ,,,,Истина);
	ДобавитьИзмерение(соотвИзмРС,"Агент",Агент                , Истина,,,,Истина);
	
	ПостояннаяЧастьЗапроса = "ВЫБРАТЬ Т.*
					|	ИЗ РегистрСведений.уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки.СрезПоследних(&наДату) КАК Т
					|	ГДЕ Т.НеДействует = ЛОЖЬ";
					
	ТекстЗапроса = "";
	РезультатЗапроса = Неопределено;
	Возврат ЯдроПолученияДанных_РЕГИСТР(наДату, соотвИзмРС, ТекстЗапроса, ПостояннаяЧастьЗапроса, РезультатЗапроса, ИмяРегистра);
КонецФункции


//----------------------------------------

Функция Число2(Стр)
	Возврат Число(?(Стр="","0",Стр));
КонецФункции

Процедура РазобратьРазностьДат(ДатаОкончания, ДатаНачала, Лет = 0, Месяцев = 0, Дней = 0) Экспорт
    
    Лет     = 0;
    Месяцев = 0;
    Дней    = 0;
    Если ДатаОкончания > ДатаНачала Тогда
        
        ВременнаяДата = ДатаОкончания;
        Если День(ВременнаяДата) < День(ДатаНачала) Тогда
            Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
            ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
        КонецЕсли;
        Если Месяц(ВременнаяДата) < Месяц(ДатаНачала) Тогда
            ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
            Месяцев = 12;
        КонецЕсли;
        Лет     = Макс(             Год(ВременнаяДата)        - Год(ДатаНачала),    0);
        Месяцев = Макс(Месяцев    + Месяц(ВременнаяДата)    - Месяц(ДатаНачала),    0);
        Дней    = Макс(Дней        + День(ВременнаяДата)    - День(ДатаНачала),    0);
        
        // скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах
 
        Если ДатаНачала <> (ДобавитьМесяц(ДатаОкончания,-Лет*12-Месяцев)-Дней*86400) Тогда
            Дней = Дней + (День(КонецМесяца(ДатаНачала)) - День(НачалоМесяца(ДатаНачала))) - (День(КонецМесяца(ДобавитьМесяц(ДатаОкончания,-1))) - День(НачалоМесяца(ДобавитьМесяц(ДатаОкончания,-1))));
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры// РазобратьРазностьДат
//----------------------------------------
// Действия для пунктов меню в интерфейсах
Процедура ОткрытьФормуВыдачиСвободногоНомера() Экспорт 
	Документы.уб_ДвиженияНомераПолиса.ПолучитьФорму("ФормаВыдачи").Открыть();
КонецПроцедуры

// Вернуть ключ для позиционирования в регистре сведений по найденным параметрам
Функция глВернутьКлючДляПозиционирования(ТЗ, Рег) Экспорт
	Отбор = Новый Структура;
	Для НомерКолонки=0 По тз.колонки.Количество()-1 Цикл
		Отбор.Вставить(тз.колонки[НомерКолонки].имя,тз[0][НомерКолонки]); 
	КонецЦикла;
	Возврат Рег.СоздатьКлючЗаписи(Отбор);
КонецФункции

&НаКлиенте
Процедура ВыполнитьОтложенноеДействие(Форма,ИмяПроцедуры, Интервал = 0.5) Экспорт
	
	Форма.ОтключитьОбработчикОжидания(ИмяПроцедуры);
	Форма.ПодключитьОбработчикОжидания(ИмяПроцедуры, Интервал, Истина);
	
КонецПроцедуры

Функция ЕстьЭксклюзивноеКВ ()  Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_КВ_Агентов.*
	                      |ИЗ
	                      |	РегистрСведений.уб_КВ_Агентов КАК уб_КВ_Агентов");
	
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Процедура БСОПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки, СтруктураПараметров) Экспорт
	
	#Если Клиент Тогда
		ЗначениеПараметра = Неопределено;
		ЭтоПоступлениеБСО = ?(СтруктураПараметров.Свойство("ЭтоПоступлениеБСО", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
		ЭтоСверка 		  = ?(СтруктураПараметров.Свойство("ЭтоСверка", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
		ЭтаФорма 		  = ?(СтруктураПараметров.Свойство("ЭтаФорма", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
		
		Если ЭтоСверка = Истина Тогда//док. сверка БСО
			
			ОЯ = ОформлениеСтроки.Ячейки.Отклонение;
			Отклонение = ДанныеСтроки.Количество - ДанныеСтроки.КоличествоУчет;
			Если Отклонение<>0 Тогда
				ОЯ.УстановитьТекст(Отклонение);
				Если Отклонение < 0 Тогда
					ОЯ.ЦветТекста = Новый Цвет(255,0,0);
				КонецЕсли;	
			КонецЕсли;	
			Если НЕ ДанныеСтроки.ДанныеСверкиИзСК Тогда
				ОформлениеСтроки.ЦветФона = Новый Цвет(255,255,0);
			КонецЕсли;	
			ОформлениеСтроки.Ячейки.Подразделение.УстановитьТекст(СтруктураПараметров.Подразделение);
			
		ИначеЕсли ЭтоПоступлениеБСО = Истина Тогда//док. поступление БСО
			
			ВидБСО	 	= ДанныеСтроки.ВидБСО;
			Если НЕ ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
				возврат
			КонецЕсли;
			ТипУчБСО 	= ВидБСО.ТипУчетаБСО;
			Прч 		= Перечисления.уб_ТипыУчетаБСО;
			ОЯ = ОформлениеСтроки.Ячейки;
			баПолисов = (ТипУчБСО = Прч.НомернойЕстьПолис);
			НесоответствиеКоличества = Не ДанныеСтроки.ВидБСО.Пустая()
			И (ТипУчБСО = Прч.НомернойПолисСоответствуетНомеруБСО Или баПолисов)
			И (ДанныеСтроки.КоличествоБСО <> ДанныеСтроки.КоличествоПолисов);
			ОЯ.КоличествоПолисов.ЦветТекста = ?(НесоответствиеКоличества,гЦветКрасный,гЦветАвто);
			ТекТипУчетаБСО = ВидБСО.ТипУчетаБСО;
			ОЯ.КоличествоПолисов.ЦветФона = ?(уб_СЛ.ОпределитьВедетсяКоличественныйУчет(ВидБСО, ТекТипУчетаБСО),гЦветАвто,гЦветФонаПоляТДЧ);
			цБСО = ?(уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСО),гЦветАвто,гЦветФонаПоляТДЧ);
			цПолисов = ?(баПолисов,гЦветАвто,гЦветФонаПоляТДЧ);
			ОЯ.СерияПолиса.ЦветФона		= цПолисов;
			ОЯ.НачНомерПолиса.ЦветФона	= цПолисов;
			ОЯ.КонНомерПолиса.ЦветФона	= цПолисов;
			ОЯ.СуффиксПолиса.ЦветФона	= цПолисов;
			ОЯ.СерияБСО.ЦветФона		= цБСО;
			ОЯ.НачНомерБСО.ЦветФона		= цБСО;
			ОЯ.КонНомерБСО.ЦветФона		= цБСО;
			ОЯ.ГодПолиса.ЦветФона		= цБСО;
			
		Иначе																	
			
			ЭтоСписание = ?(СтруктураПараметров.Свойство("ЭтоСписание", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			ТекСостояниеБСО = ?(СтруктураПараметров.Свойство("ТекСостояниеБСО", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			ФлагТекСостояние = ?(СтруктураПараметров.Свойство("ФлагТекСостояние", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			НеКонтролироватьНаличиеБСОПриПроведении = ?(СтруктураПараметров.Свойство("НеКонтролироватьНаличиеБСОПриПроведении", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			КолонкиТЧ = ?(СтруктураПараметров.Свойство("КолонкиТЧ", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			Проведен = ?(СтруктураПараметров.Свойство("Проведен", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			УстанавливатьКоличествоЕдиницуПриНомерномУчете = ?(СтруктураПараметров.Свойство("УстанавливатьКоличествоЕдиницуПриНомерномУчете", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			ЭтоВозвратОтПоставщика = ?(СтруктураПараметров.Свойство("ЭтоВозвратОтПоставщика", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			УчитыватьКолонкуПодтверждено = ?(СтруктураПараметров.Свойство("УчитыватьКолонкуПодтверждено", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			ПрочитатьТекущееСостояниеИзФормы = ?(СтруктураПараметров.Свойство("ПрочитатьТекущееСостояниеИзФормы", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
			
			ПодрПередающего = Неопределено;
			ПодрПринимающего = Неопределено;
			ОрганизацияАгент = Неопределено;
			Поставщик = Неопределено;
			Агент = Неопределено;
									
			ЭтоПеремещение = СтруктураПараметров.Свойство("ПодрПередающего",ПодрПередающего) И
							 СтруктураПараметров.Свойство("ПодрПринимающего",ПодрПринимающего);
			
			ОрганизацияАгентИПоставщикВШапке = СтруктураПараметров.Свойство("ОрганизацияАгент",ОрганизацияАгент) И
											   СтруктураПараметров.Свойство("Поставщик",Поставщик);
											   
			СтруктураПараметров.Вставить("ОрганизацияАгентИПоставщикВШапке",ОрганизацияАгентИПоставщикВШапке);								   
											   
			ЕстьКолонкаАгент = КолонкиТЧ.Найти("Агент") <> Неопределено;
			ЕстьКолонкаКоличество = КолонкиТЧ.Найти("Количество") <> Неопределено;
			
			СтруктураПараметров.Вставить("ЕстьКолонкаАгент",ЕстьКолонкаАгент);
			
			АгентВШапкеИТЧ = СтруктураПараметров.Свойство("Агент",Агент) И
							 ЕстьКолонкаАгент;
							 
			ОЯ = ОформлениеСтроки.Ячейки;
			Если ПрочитатьТекущееСостояниеИзФормы = Истина Тогда
				СтруктураБСО = ЭтаФорма.ПрочитатьТекущееСостояниеБСО(ДанныеСтроки);
			ИначеЕсли ЭтоВозвратОтПоставщика = Истина Тогда
				СтруктураБСО = ПрочитатьТекущееСостояниеБСО(ДанныеСтроки, СтруктураПараметров, "НаДатуДокумента");
			Иначе
				СтруктураБСО = ПрочитатьТекущееСостояниеБСО(ДанныеСтроки, СтруктураПараметров, "");
			КонецЕсли;
			бКоличественныйУчет = СтруктураБСО.КоличественныйУчет;
			
			Если ЭтоПеремещение = Истина Тогда
				
				бПеремешениеРазрешено = Проведен ИЛИ ЭтаФорма.ПеремещениеРазрешено(СтруктураБСО.Владелец, ПодрПередающего, ПодрПринимающего, СтруктураБСО.Регистратор, СтруктураБСО.АгентОтправитель,СтруктураБСО.ПодразделениеОтправитель);
				Покрасить = НЕ СтруктураБСО.Существует
				ИЛИ НЕ бПеремешениеРазрешено
				ИЛИ (СтруктураБСО.Количество < ДанныеСтроки.Количество И бКоличественныйУчет = Истина);
				Если ДанныеСтроки.Подтверждено ИЛИ Покрасить Тогда
					ЦветТекстаСтроки = ?(ДанныеСтроки.Подтверждено, ?(Покрасить, гЦветКрасный, гЦветАвто), ?(Покрасить, гЦветОранжевый, гЦветВторостепенный));
				Иначе
					ЦветТекстаСтроки = гЦветАвто;
				КонецЕсли;
				
			ИначеЕсли АгентВШапкеИТЧ Тогда
				
				Покрасить = Не СтруктураБСО.Существует
				Или (СтруктураБСО.Количество < 1 И СтруктураБСО.КоличественныйУчет);
				ЦветТекстаСтроки = ?(Покрасить, гЦветКрасный, гЦветАвто);
				ОЯ.ТекСостояниеБСО.УстановитьТекст(СтруктураБСО.сСостояниеБСО);
				
			Иначе
				
				Если ЭтоВозвратОтПоставщика = Истина Тогда
					Покрасить = НЕ СтруктураБСО.Существует;
					ОЯ.НомерПолиса.УстановитьТекст(?(СтруктураБСО.НомернойУчет,СтруктураБСО.НомерПолиса,""));
				Иначе
					Покрасить = НЕ СтруктураБСО.Существует
					ИЛИ (бКоличественныйУчет И ( СтруктураБСО.Количество < ДанныеСтроки.Количество
					ИЛИ ДанныеСтроки.Количество < 1
					ИЛИ (Не ОрганизацияАгентИПоставщикВШапке И ЗначениеНеЗаполнено(ДанныеСтроки.Агент))
					ИЛИ ?(ОрганизацияАгентИПоставщикВШапке,СтруктураБСО.ОрганизацияАгент <> ОрганизацияАгент И ЗначениеЗаполнено(ОрганизацияАгент),ЗначениеНеЗаполнено(ДанныеСтроки.ОрганизацияАгент))
					ИЛИ ?(ОрганизацияАгентИПоставщикВШапке,СтруктураБСО.Поставщик <> Поставщик И ЗначениеЗаполнено(Поставщик),ЗначениеНеЗаполнено(ДанныеСтроки.Поставщик))
					));
					Если Не ОрганизацияАгентИПоставщикВШапке И Не ЭтоСписание = Истина Тогда
						Если НеКонтролироватьНаличиеБСОПриПроведении = Неопределено Тогда
							бАктивностьПиО = бКоличественныйУчет
							ИЛИ (СтруктураБСО.НомернойУчет И НЕ СтруктураБСО.Существует);
						Иначе
							бАктивностьПиО = СтруктураБСО.НомернойУчет И НЕ СтруктураБСО.Существует И НеКонтролироватьНаличиеБСОПриПроведении = Истина;
						КонецЕсли;
						Если бАктивностьПиО Тогда
							ОЯ.Поставщик.ЦветФона 			= гЦветАвто;
							ОЯ.ОрганизацияАгент.ЦветФона	= гЦветАвто;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если УчитыватьКолонкуПодтверждено = Истина Тогда
					ЦветТекстаСтроки =  ?(ДанныеСтроки.Подтверждено, ?(Покрасить, гЦветКрасный, гЦветАвто), ?(Покрасить, гЦветОранжевый, гЦветВторостепенный));
				Иначе
					ЦветТекстаСтроки =  ?(Покрасить, гЦветКрасный, гЦветАвто);
				КонецЕсли;
																				
			КонецЕсли;
			
			Если бКоличественныйУчет Тогда
				Если Не ЭтоВозвратОтПоставщика = Истина Тогда
					Если ЭтоСписание = Истина Тогда
						ОЯ.Агент.ЦветФона 				= гЦветАвто;
						ОЯ.Поставщик.ЦветФона 			= гЦветАвто;
						ОЯ.ОрганизацияАгент.ЦветФона	= гЦветАвто;
					ИначеЕсли АгентВШапкеИТЧ Тогда
						ОЯ.Агент.ЦветФона 		= ЦветаСтиля.ЦветФонаПоля;
						ОЯ.НомерБСО.ЦветФона 	= гЦветФонаПоляТДЧ;
						ОЯ.ТекущийВладелец.УстановитьТекст(Строка(ДанныеСтроки.Агент));
					КонецЕсли;
					
					Если ЭтоПеремещение = Истина Тогда
						
						ОЯ.ОрганизацияАгент.ЦветФона	= гЦветАвто;
						ОЯ.Поставщик.ЦветФона 			= гЦветАвто;
						ОЯ.ЗаявкаОт.ЦветФона 			= гЦветАвто;
						
					ИначеЕсли Не ОрганизацияАгентИПоставщикВШапке Тогда
						Если ЕстьКолонкаКоличество Тогда
							ОЯ.Количество.ЦветФона 			= гЦветАвто;
						КонецЕсли;
						Если ЗначениеНеЗаполнено(ДанныеСтроки.Агент) Тогда
							ОЯ.Агент.УстановитьТекст("<все>");
						Иначе
							//ОЯ.Агент.УстановитьТекст(ДанныеСтроки.Агент.Наименование);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли АгентВШапкеИТЧ Тогда
				
				Если ЗначениеНеЗаполнено(ДанныеСтроки.Агент) Тогда
					ОЯ.Агент.УстановитьТекст(Строка(Агент));
				КонецЕсли;
				ОЯ.Агент.ЦветФона		= гЦветФонаПоляТДЧ;
				ОЯ.НомерБСО.ЦветФона 	= ЦветаСтиля.ЦветФонаПоля;
				ОЯ.ТекущийВладелец.УстановитьТекст(Строка(СтруктураБСО.сВладелец));
				
			ИначеЕсли Не ЭтоПеремещение = Истина Тогда
				
				Если Не ОрганизацияАгентИПоставщикВШапке Тогда
					Если Не СтруктураБСО.Существует И НЕ НеКонтролироватьНаличиеБСОПриПроведении = Истина Тогда
						ОЯ.Поставщик.УстановитьТекст(СтруктураБСО.сПоставщик);
						ОЯ.ОрганизацияАгент.УстановитьТекст(СтруктураБСО.сОрганизацияАгент);
					ИначеЕсли ЭтоСписание = Истина Тогда
						Если НЕ СтруктураБСО.Существует Тогда
							ОЯ.Поставщик.УстановитьТекст(СтруктураБСО.сПоставщик);
							ОЯ.ОрганизацияАгент.УстановитьТекст(СтруктураБСО.сОрганизацияАгент);
						Иначе
							ОЯ.Поставщик.УстановитьТекст(ДанныеСтроки.Поставщик.Наименование);
							ОЯ.ОрганизацияАгент.УстановитьТекст(ДанныеСтроки.ОрганизацияАгент.Наименование);
						КонецЕсли;
					Иначе
						ОЯ.Поставщик.УстановитьТекст(ДанныеСтроки.Поставщик.Наименование);
						ОЯ.ОрганизацияАгент.УстановитьТекст(ДанныеСтроки.ОрганизацияАгент.Наименование);
					КонецЕсли;
				КонецЕсли;
				Если ЕстьКолонкаАгент Тогда
					ОЯ.Агент.УстановитьТекст(СтруктураБСО.сВладелец);
				КонецЕсли;
				Если УстанавливатьКоличествоЕдиницуПриНомерномУчете = Истина Тогда
					ОЯ.Количество.УстановитьТекст("1");
				КонецЕсли;
			КонецЕсли;
			Если ФлагТекСостояние = Истина Тогда
				ОЯ.ТекСостояниеБСО.УстановитьТекст(СтруктураБСО.сСостояниеБСО);
				Если ЭтоПеремещение Тогда
					ОЯ.ТекущийВладелец.УстановитьТекст(СтруктураБСО.сВладелец);
					ОЯ.ТекДатаВозврата.УстановитьТекст(СтруктураБСО.сДатаВозврата);
				Иначе
					Если ЭтоВозвратОтПоставщика = Истина Тогда
						ОЯ.ТекущийВладелец.УстановитьТекст(СтруктураБСО.сВладелец);
					Иначе
						ОЯ.ТекПоложениеБСО.УстановитьТекст(СтруктураБСО.сПоложениеБСО);
					КонецЕсли;
				КонецЕсли;
				Если ОрганизацияАгентИПоставщикВШапке И Не ЭтоВозвратОтПоставщика = Истина Тогда
					ОЯ.ТекущаяОрганизацияАгент.УстановитьТекст(СтруктураБСО.сОрганизацияАгент);
					ОЯ.ТекущийПоставщик.УстановитьТекст(СтруктураБСО.сПоставщик);
				КонецЕсли;
			КонецЕсли;
			Если АгентВШапкеИТЧ Тогда
				Покрасить = СтруктураБСО.КоличественныйУчет И СокрЛП(ДанныеСтроки.НомерБСО) <> "";
				ОЯ.НомерБСО.ЦветТекста = ?(Покрасить, гЦветОранжевый, ЦветТекстаСтроки);
			Иначе
				ОЯ.НомерБСО.ЦветТекста = ?(СтруктураБСО.НомернойУчет, ЦветТекстаСтроки, гЦветОранжевый);
				ОформлениеСтроки.ЦветТекста = ЦветТекстаСтроки;
			КонецЕсли;
			Если ОрганизацияАгентИПоставщикВШапке И Не ЭтоВозвратОтПоставщика = Истина Тогда
				ОЯ.НомерПолиса.ЦветТекста = ОЯ.НомерБСО.ЦветТекста;
				ОЯ.СостояниеБСО.ЦветФона = ?(КолонкиТЧ.СостояниеБСО.ТолькоПросмотр, гЦветФонаПоляТДЧ, гЦветАвто);
			КонецЕсли;
			Если ЭтоПеремещение = Истина Тогда
				Если НЕ ДанныеСтроки.ЗаявкаКуда.Пустая() Тогда
					Ячейка = ОЯ.ЗаявкаКуда;
					Ячейка.УстановитьТекст(ЭтаФорма.НомерЗаявкиИзПредставления(Ячейка.Текст));
				КонецЕсли;
				Если НЕ ДанныеСтроки.ЗаявкаОт.Пустая() Тогда
					Ячейка = ОЯ.ЗаявкаОт;
					Ячейка.УстановитьТекст(ЭтаФорма.НомерЗаявкиИзПредставления(Ячейка.Текст));
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры//БСОПриВыводеСтроки()

Функция ПрочитатьТекущееСостояниеБСО(ТекСтрока, Параметры, Документ)
	
	ЗначениеПараметра				 = Неопределено;
	ТекСостояниеБСО					 = ?(Параметры.Свойство("ТекСостояниеБСО", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ЭтотОбъект						 = ?(Параметры.Свойство("ЭтотОбъект", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ФлагСостояниеНаДатуДокумента	 = ?(Параметры.Свойство("ФлагСостояниеНаДатуДокумента", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ЕстьКолонкаАгент				 = ?(Параметры.Свойство("ЕстьКолонкаАгент", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ПолучатьПодразделениеОтправителя = ?(Параметры.Свойство("ПолучатьПодразделениеОтправителя", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	Поставщик						 = ?(Параметры.Свойство("Поставщик", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ОрганизацияАгент				 = ?(Параметры.Свойство("ОрганизацияАгент", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ОрганизацияАгентИПоставщикВШапке = ?(Параметры.Свойство("ОрганизацияАгентИПоставщикВШапке", ЗначениеПараметра), ЗначениеПараметра, Неопределено);	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекСтрока",		ТекСтрока);
	СтруктураПараметров.Вставить("ТекСостояниеБСО",	ТекСостояниеБСО);
	Агент = ?(Параметры.Свойство("Агент", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	Если "НаДатуДокумента" = Документ Тогда
		Дт = уб_temp.ДатаАктуальностиОбъекта(ЭтотОбъект);
		СтруктураПараметров.Вставить("НаДату",	Дт);
		СтруктураПараметров.Вставить("тсАгент",	Агент);
		Поставщик = ?(Параметры.Свойство("Поставщик", ЗначениеПараметра), ЗначениеПараметра, Неопределено);
		СтруктураПараметров.Вставить("тсПоставщик", Поставщик);
		ОрганизацияАгент = ?(Параметры.Свойство("ОрганизацияАгент", ЗначениеПараметра), ЗначениеПараметра, Неопределено);				
		СтруктураПараметров.Вставить("тсОрганизацияАгент",ОрганизацияАгент);
	Иначе	
		СтруктураПараметров.Вставить("НаДату",уб_temp.ДатаАктуальностиОбъекта(ЭтотОбъект, ФлагСостояниеНаДатуДокумента));
		Если ЕстьКолонкаАгент = Истина Тогда
			СтруктураПараметров.Вставить("тсАгент", ТекСтрока.Агент);
		Иначе
			СтруктураПараметров.Вставить("тсАгент", Агент);
		КонецЕсли;	
		Если ОрганизацияАгентИПоставщикВШапке = Истина Тогда
			СтруктураПараметров.Вставить("тсПоставщик",			Поставщик);
			СтруктураПараметров.Вставить("тсОрганизацияАгент",	ОрганизацияАгент);
		Иначе			
			СтруктураПараметров.Вставить("тсПоставщик",			ТекСтрока.Поставщик);
			СтруктураПараметров.Вставить("тсОрганизацияАгент",	ТекСтрока.ОрганизацияАгент);
		КонецЕсли;
	КонецЕсли;	
	СтруктураПараметров.Вставить("хВидГраницы",ВидГраницы.Исключая);
	Если ПолучатьПодразделениеОтправителя = Истина Тогда
		СтруктураПараметров.Вставить("ПолучатьПодразделениеОтправителя",Истина);
	КонецЕсли;	
	Результат = уб_СС.ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ(СтруктураПараметров);
	ТекСостояниеБСО = СтруктураПараметров.ТекСостояниеБСО;
	Возврат Результат;
	
КонецФункции//ПрочитатьТекущееСостояниеБСО()

Процедура УстановкаПараметраСеансаВнешниеСервисы() Экспорт
	
	Структура = Новый Структура("ДоступенШлюзCRM, ДоступенСерверSVS, ДоступенСерверB2B", Истина, Истина, Истина);
	ПараметрыСеанса.уб_ВнешниеСервисы = Новый ФиксированнаяСтруктура(Структура);
	Возврат;
	
	#Если НЕ (ВнешнееСоединение) И КЛИЕНТ Тогда
		Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
	Попытка//проверка 1 параметра
		//ЗаголовокHTTP = Новый Соответствие();
		//ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
		Сервер = "www.sluice";
		Порт = 80;
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		HTTP.Получить("", ПолучитьИмяВременногоФайла());
		Структура.ДоступенШлюзCRM = Истина;
	Исключение
	КонецПопытки;
	
	//Попытка//проверка 2 параметра
	//	//Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	//	//ЗаголовокHTTP = Новый Соответствие();
	//	//ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary);
	//	Сервер = ПараметрыСеанса.уб_Константы.СерверB2B;
	//	Порт = ПараметрыСеанса.уб_Константы.Порт;
	//	НТТР = Новый HTTPСоединение(Сервер, Порт);
	//	HTTP.Получить("", ПолучитьИмяВременногоФайла());
	//	Структура.ДоступенСерверB2B = Истина;
	//Исключение
	//КонецПопытки;
	КонецЕсли;
	
	Попытка//проверка 3 параметра
		Сервер = "svs.local";
		Порт = 80;
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		HTTP.Получить("", ПолучитьИмяВременногоФайла());
		Структура.ДоступенСерверSVS = Истина;
	Исключение
	КонецПопытки;
	#КонецЕсли
	ПараметрыСеанса.уб_ВнешниеСервисы = Новый ФиксированнаяСтруктура(Структура);
	
КонецПроцедуры

//Транзитная для конвертации в мутабельные значения
Функция Подчиненные(Знач Сотрудник, ТипРезультата = "сз") Экспорт
	Список = уб_КЭШируемые.Подчиненные(Сотрудник);
	Если ТипРезультата = "сз" Тогда
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(Список);
		Возврат СЗ
	Иначе
		Возврат Список;
	КонецЕсли;	
КонецФункции



Функция ПолучитьЛимитыНаСтрахование(СтраховаяКомпания,СтраховаяСумма) Экспорт
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Период,
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.СК,
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.УсловиеПрименения,
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.ТипЛимита,
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Лимит,
	                       |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Комментарий
	                       |ИЗ
	                       |	РегистрСведений.уб_ЛимитыРазрешенийНаСтрахование.СрезПоследних(, СК = &СК) КАК уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних
	                       |ГДЕ
	                       |	&Лимит>=уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Лимит ");     
Запрос.УстановитьПараметр("СК",СтраховаяКомпания);
Запрос.УстановитьПараметр("Лимит",СтраховаяСумма);

Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ПроставитьСтрахователяВФайлахПоЗаявке(Полис) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка КАК Заявка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.Страхователь КАК ЗаявкаСтрахователь,
	               |	уб_СтраховойПолис.Страхователь КАК ПолисСтрахователь,
	               |	уб_ФайлыКПолисам.УИД,
	               |	уб_ФайлыКПолисам.СтраховойПолис,
	               |	уб_ФайлыКПолисам.СК,
	               |	уб_ФайлыКПолисам.ВидБСО,
	               |	уб_ФайлыКПолисам.НомерБСО
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка = уб_СтраховойПолис.Заявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника = уб_ФайлыКПолисам.УИД
	               |ГДЕ
	               |	уб_ФайлыКПолисам.Страхователь = НЕОПРЕДЕЛЕНО
	               |	И уб_СтраховойПолис.Ссылка = &Полис
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка.МоментВремени";
				   
	Запрос.УстановитьПараметр("Полис",Полис);
	Счетчик = 0;
	Выборка =  Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик+1;
		МЗ = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();	
		МЗ.СтраховойПолис =  Выборка.СтраховойПолис;
		МЗ.УИД            =  Выборка.УИД;
		МЗ.СК             =  Выборка.СК;
		МЗ.ВидБСО         =  Выборка.ВидБСО;
		МЗ.НомерБСО       =  Выборка.НомерБСО; 
		МЗ.Прочитать();
		Если  Мз.Выбран() = Истина и Мз.Страхователь = Неопределено Тогда
			МЗ.Страхователь = Выборка.ПолисСтрахователь;
			МЗ.Записать();
		КонецЕсли;

	КонецЦикла;
	
КонецФункции


//Добавляем запись в журнал регистрации и выводим сообщение
//
//														ПАРАМЕТРЫ:
//*************************************************************************************************************************
//	ТекстСообщение			- Строка                                                                                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	ТипСообщение			- Строка						Сообщить, Предупреждение	                                  *
//															Значение по умолчанию: Сообщить                               *
//*************************************************************************************************************************
//	ДобавлятьЗаписьВЖурнал  - Булево						Значение по умолчанию: Ложь							          *
//															                                                              *
//*************************************************************************************************************************
//															Информация, Ошибка, Предупреждение, Примечание                *
//	УровеньРегистрации   	- УровеньЖурналаРегистрации		Значение по умолчанию: Ошибка. Для информационного сообщения  *
//															будем использовать "Примечание"                               *
//*************************************************************************************************************************
//	ОбъектМетаданных		- ОбъектМетаданных                                                                            *
//                                                                                                                        *
//*************************************************************************************************************************
//															Данные, с которыми связано событие.                           *
//	СсылкаНаОбъект			- Произвольный					Рекомендуется указывать ссылки на объекты данных (элементы    *
//															справочников, документы, к которым относится событие).        *
//*************************************************************************************************************************
//	КомментарийЖурнала		- Строка						Комментарий к записи журнала регистрации                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	Статус					- СтатусСообщения				БезСтатуса, Важное, Внимание, Информация, Обычное, ОченьВажное*
//															Значение по умолчанию: Обычное                                *
//*************************************************************************************************************************
//	Таймаут					- Число							Таймаут предупреждения                                        *
//															Значение по умолчанию: 0                                      *
//*************************************************************************************************************************
//	Заголовок				- Строка						Заголовок предупреждения                                      *
//															Значение по умолчанию: "1С:Предприятие"                       *
//*************************************************************************************************************************
Функция ЗаписатьОшибкуИСообщить(
	ТекстСообщения,
	ТипСообщения = "Сообщить", 
	ДобавлятьЗаписьВЖурнал = Ложь,  //3
	УровеньРегистрации = "",        //4
	ОбъектМетаданных = "",          //5
	СсылкаНаОбъект = "",            //6
	СобытиеЖурнала = "Логирование", //7
	Статус = "",                    //8
	Таймуат = 0,                    //9
	Заголовок = "") Экспорт         //10
	//Выводим информацию на экран
	Если ТипСообщения = "Сообщить" Тогда
		Если Статус = "" Тогда 
			Статус = СтатусСообщения.Обычное;
		КонецЕсли;
		//#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения; 
			Сообщение.Сообщить();
			//Сообщить(ТекстСообщения, Статус);
		//КонецЕсли
	ИначеЕсли ТипСообщения = "Предупреждение" Тогда
		//Предупреждение возможно выдавать только в режиме клиента
		#Если Клиент Тогда
			Предупреждение(ТекстСообщения, Таймуат, Заголовок);
		#Иначе	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения; 
			Сообщение.Сообщить();
		#КонецЕсли
	КонецЕсли;
	//Создаем запись в журнале регистрации
	Если ДобавлятьЗаписьВЖурнал Тогда
		Если УровеньРегистрации = "" Тогда 
			УровеньРегистрации = УровеньЖурналаРегистрации.Ошибка;
		КонецЕсли;
		Если ОбъектМетаданных = "" и ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Попытка
				ОбъектМетаданных = СсылкаНаОбъект.Метаданные();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Передан объект не имеющий Метаданные() "+СсылкаНаОбъект; 
				Сообщение.Сообщить();
			КонецПопытки;	
		КонецЕсли;	
		ЗаписьЖурналаРегистрации("ITC."+СобытиеЖурнала, УровеньРегистрации, ОбъектМетаданных, СсылкаНаОбъект, ТекстСообщения);
	КонецЕсли;
КонецФункции
//Опубликовал ildarovich http://infostart.ru/public/310732/
//Проверить!!!
Функция  ОбъединениеТаблиц(Таблица1,Таблица2) Экспорт
	ОбъединениеТаблиц = Таблица2.Скопировать();
	Для ё = 1 По Таблица1.Количество() Цикл ОбъединениеТаблиц.Вставить(0) КонецЦикла;
	Для ё = 0 По Таблица1.Колонки.Количество() - 1 Цикл 
		ОбъединениеТаблиц.ЗагрузитьКолонку(Таблица1.ВыгрузитьКолонку(ё), ё) 
	КонецЦикла;
	Возврат ОбъединениеТаблиц;
КонецФункции

Функция СписокПоследнихЗначений(ИмяРеквизита,Дней = 7, ВидДока = "уб_ЗаявкаНаЗаказВыездногоСпециалиста") Экспорт
	Попытка
		Запрос = Новый  Запрос;
		ЗапроС.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВидДокумента."+ИмяРеквизита+" КАК Реквизит
			|ИЗ
			|	Документ."+ВидДока+" КАК ВидДокумента
			|ГДЕ
			|	ВидДокумента.Дата >= &Дата1
			|
			|УПОРЯДОЧИТЬ ПО
		|	"+ИмяРеквизита;
		Запрос.УстановитьПараметр("Дата1",ТекущаяДата()-Дней*24*3600);		   
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Реквизит");		   	
		Массив2 = Новый Массив;
		Для Каждого Эл Из Массив Цикл
			Если ЗначениеЗаполнено(Массив2)  Тогда
				Массив2.Добавить(Эл);
			КонецЕсли;	
		КонецЦикла;
		Возврат Массив2;
	Исключение
		Возврат Новый  Массив;
	КонецПопытки;
	
КонецФункции	

Функция ЗаполнитьВидБСОПолиса(Дата = Неопределено) Экспорт
	Запрос =новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	уб_ОплатаПолисов.Ссылка,
	              |	уб_ОплатаПолисов.СтраховойПолис,
	              |	уб_ОплатаПолисов.ВидБСОПолиса,
	              |	уб_СтраховойПолисБСО.ВидБСО как ВидБСО
	              |ИЗ
	              |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	              |		ПО (уб_СтраховойПолисБСО.Ссылка = уб_ОплатаПолисов.СтраховойПолис)
	              |			И (уб_СтраховойПолисБСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОСАГО)))
	              |ГДЕ
	              |	уб_ОплатаПолисов.Дата >= &Дата
	              |	И уб_ОплатаПолисов.ВидБСОПолиса <> уб_СтраховойПолисБСО.ВидБСО
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	уб_ОплатаПолисов.Дата";
				  Если Дата = Неопределено Тогда
					 Дата = Дата(2018,1,1);
					КонецЕсли; 
					
					Запрос.УстановитьПараметр("Дата",Дата);
				  Выборка= Запрос.Выполнить().Выбрать();
				  Пока Выборка.Следующий() Цикл
					  Об = Выборка.Ссылка.ПолучитьОбъект();
					  Об.ОбменДанными.Загрузка =Истина;
					  Об.ВидБСОПолиса = Выборка.ВидБСО;
					  #Если Клиент Тогда
					  ОбработкаПрерыванияПользователя();
					  Состояние(Выборка.Ссылка);
					  #КонецЕсли
					  Об.Записать();
					 КонецЦикла; 
	
КонецФункции