//ОБЩЕГО НАЗНАЧЕНИЯ
Функция Приоритет (Совпадения,Специфичность,Важность) Экспорт
	Приоритет = Совпадения * 1000000000 + Специфичность * 1000000 + Важность;
	Возврат Приоритет;
КонецФункции	

&НаСервере
Функция ПолучитьИнформациюОПодразделении(оПодразделение,Разделитель) Экспорт
	
	Владелец = оПодразделение.Владелец;
	
	Возврат оПодразделение.Наименование + ?(ЗначениеЗаполнено(Владелец),Разделитель + Владелец.Наименование,"");
КонецФункции	

&НаСервере
Функция ФИОФизлицаСтрокой(Знач ФизЛицо, НаДату = Неопределено, ФИОКратко = Истина, Падеж = Неопределено, ВыводитьОшибки=Истина) Экспорт 
	
	Возврат уб_СС.ФИОФизлицаСтрокой(ФизЛицо,НаДату, ФИОКратко, Падеж, ВыводитьОшибки);
	//Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
	//	Возврат "";
	//Иначе
	//	ТипЗнчФизЛицо = ТипЗнч(ФизЛицо);
	//	Если ТипЗнчФизЛицо = Тип("СправочникСсылка.ФизическиеЛица") Тогда
	//		//пропускаем
	//	ИначеЕсли ТипЗнчФизЛицо = Тип("СправочникСсылка.Пользователи") Тогда
	//		_ФизЛицо = ФизЛицо.ФизЛицо;
	//		Если _ФизЛицо.Пустая() Тогда
	//			Возврат	ОбщегоНазначения.ФИО_ФизЛица(ФизЛицо.Наименование);
	//		Иначе
	//			ФизЛицо = _ФизЛицо;
	//		КонецЕсли;
	//	ИначеЕсли ТипЗнчФизЛицо = Тип("СправочникСсылка.КонтактныеЛица") Тогда
	//		//пропускаем
	//	ИначеЕсли ТипЗнчФизЛицо = Тип("Строка") Тогда
	//		//пропускаем
	//	Иначе
	//		//передан неверный параметр. TODO - откуда передается?
	//		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("В функцию ФИОФизЛицаСтрокой передан неверный параметр ФизЛицо: " + ФизЛицо + ". тип: " + ТипЗнчФизЛицо, "НеСообщать", Истина);
	//		Возврат Физлицо
	//	КонецЕсли;	
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(НаДату) Тогда
	//	НаДату = ТекущаяДата();
	//КонецЕсли;
	//////Получим ФИО на заданную дату
	//Если ТипЗнчФизЛицо = Тип("Строка") Тогда
	//	Фамилия		= "";
	//	Имя			= "";
	//	Отчество	= "";
	//	ФамилияИмяОтчество = ФизЛицо;
	//	ФизЛицоПол = Неопределено;
	//Иначе
	//	Если ТипЗнчФизЛицо = Тип("СправочникСсылка.ФизическиеЛица") Тогда
	//		ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(НаДату ,Новый Структура("ФизЛицо", ФизЛицо));
	//		ТекстДляОшибки = "физлица";
	//	Иначе
	//		ФИОСрез = ФизЛицо;
	//		ТекстДляОшибки = "контактного лица";
	//	КонецЕсли;
	//	Фамилия	 = ФИОСрез.Фамилия;
	//	Имя		 = ФИОСрез.Имя;
	//	Отчество = ФИОСрез.Отчество;
	//	ФизЛицоНаименование = СокрЛП(ФизЛицо.Наименование);
	//	Если ПустаяСтрока(Фамилия + Имя + Отчество) Тогда
	//		ФамилияИмяОтчество = ФизЛицоНаименование;
	//	Иначе
	//		ФамилияИмяОтчество = "";           //TODO Почему? Тип параметра ФизЛицо передан неверный
	//	КонецЕсли;
	//	Если ВыводитьОшибки И ФизЛицо.Пол.Пустая() Тогда
	//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не указан пол " + ТекстДляОшибки + " '" + ФизЛицоНаименование + "' (Код = '" + ФизЛицо.Код + "'). Функция склонения может работать неправильно!",
	//		"Сообщить",
	//		Истина,
	//		УровеньЖурналаРегистрации.Информация,
	//		ФизЛицо.Метаданные(),
	//		ФизЛицо);
	//	КонецЕсли;
	//	ФизЛицоПол = ФизЛицо.Пол;
	//КонецЕсли;
	//Возврат ФИО_Склонение(ФамилияИмяОтчество, Фамилия, Имя, Отчество, ФизЛицоПол, Падеж, ФИОКратко);
	
КонецФункции

Функция SID() Экспорт
	Возврат уб_СЕРВЕРные.SID();
КонецФункции

//НЕЧЕТКИЙ ПОИСК
&НаСервере
Функция НечеткийПоиск(
	Подстрока, 
	ВидСправочника		= "Контрагенты",
	НомерКэша			= 111,
	КоличествоВТопЛисте	= 10,
	ВыводитьСообщения	= Ложь,
	ИсключаемыйЭлемент	= Неопределено,
	Соединение			= Неопределено
	) Экспорт
	//ОчиститьСообщения();
	
	Внешнее = НЕ Соединение=Неопределено;
	
	//ЭтоМассив = ТипВозвращаемого ="Массив";
	//Если ЭтоМассив Тогда
		//Если Внешнее Тогда
		//	МассивДублей = Соединение.NewObject("Массив");
		//Иначе	
			МассивДублей = Новый Массив;
//		КонецЕсли;	
	//Иначе
	//	Если Внешнее Тогда
	//		МассивДублей = Соединение.NewObject("СписокЗначений");
	//	Иначе	
	// 		МассивДублей = Новый СписокЗначений;
	//	КонецЕсли;	
	//КонецЕсли;
	ТекстОшибки ="";
	strmatch = уб_Кэшируемые.strmatch(ТекстОшибки);
	Если  strmatch = Неопределено Тогда
		Возврат МассивДублей;
	Иначе	
		strmatch.СравнитьСКэшем(НомерКэша, Строка(Подстрока), КоличествоВТопЛисте);
	КонецЕсли;	
	
	ВидСправочникаВКоде = ВидСправочника = "";
	ДлинаКода = 9;
	
	Для СчПодбора = 1 по КоличествоВТопЛисте Цикл
		Имя = "";
		КоэффициентСхожести = 0;
		Хэш = Strmatch.ПолучитьИзПодбора(СчПодбора,Имя,КоэффициентСхожести);
		Если ВидСправочникаВКоде Тогда
			ВидСправочника = СокрЛП(Сред(Имя,ДлинаКода+1));
			Код = Лев(Имя,ДлинаКода);
		Иначе	
			Код = Имя;
		КонецЕсли;	
		Если Внешнее Тогда
			Ссылка = Соединение.Справочники[ВидСправочника].НайтиПоКоду(Код);
		Иначе
			Ссылка = Справочники[ВидСправочника].НайтиПоКоду(Код);
		КонецЕсли;	
	
		Если ИсключаемыйЭлемент = Ссылка  Тогда
			Продолжить;
		КонецЕсли;	
		//Если ЭтоМассив Тогда
			Если МассивДублей.Найти(Ссылка) = Неопределено Тогда
				
				Если Ссылка.Пустая() Тогда
				Иначе	
					Если ВыводитьСообщения Тогда
						//ЗаписатьОшибкуИСообщить("" + Ссылка + "(" + КоэффициентСхожести + ")");
					КонецЕсли;
					МассивДублей.Добавить(Ссылка);
				КонецЕсли;
			КонецЕсли;
		//Иначе
		//	//СписокЗначений
		//	Если МассивДублей.НайтиПоЗначению(Ссылка)= Неопределено Тогда
		//		
		//		Если Ссылка.Пустая() Тогда
		//		Иначе	
		//			Если ВыводитьСообщения Тогда
		//				//ЗаписатьОшибкуИСообщить("" + Ссылка + "(" + КоэффициентСхожести + ")");
		//			КонецЕсли;	
		//			МассивДублей.Добавить(Ссылка,Ссылка.Наименование);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	Возврат МассивДублей;
КонецФункции	

&НаСервере
Процедура СоздатьКэшСправочника(ИндексКэша = 111,ВидСправочника="Контрагенты",Результат="",strmatch=Неопределено, ДобавитьВидСправочникаВКод = ложь) Экспорт
	
	//Если Запрос = Неопределено Тогда
	Запрос = Новый Запрос;
	//Конецесли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Справочник.Код,
	|	Справочник.Наименование
	|ИЗ
	|	Справочник."+ВидСправочника+" КАК Справочник
	|ГДЕ
	|	(НЕ Справочник.ЭтоГруппа)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстОшибки = "";
	Если strmatch=Неопределено Тогда
		strmatch = уб_Кэшируемые.strmatch(ТекстОшибки);
	КонецЕсли;	
	//Если ПересоздатьКэш Тогда
	////	//Кэш у компоненты	инициализуется с нуля
	Если  strmatch = Неопределено Тогда
		Результат = Результат+ТекстОшибки+Символы.ПС;
	Иначе	
		//		strmatch.ОчиститьКэш(ИндексКэша);
		strmatch.СоздатьКэш(ИндексКэша);
	КонецЕсли;	
	//КонецЕсли;	
	Счетчик = 0;
	//ВсегоВыборка = Выборка.Количество();
	Суффикс  = ?(ДобавитьВидСправочникаВКод,ВидСправочника,"");
	Пока Выборка.Следующий() Цикл
		//
		
		//Состояние("Инициализация кэша """+ВидСправочника+""""+Окр(100*Счетчик/(2*ВсегоВыборка),2)+"%");
		Счетчик=Счетчик+1;
		strmatch.ДобавитьВКэш(ИндексКэша, ""+Выборка.Наименование,счетчик , ""+Выборка.Код+Суффикс);
		//счетчик=счетчик+1;
		//Компонента.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.НаименованиеПолное),счетчик , Строка(Выборка.Код));
		
		//Добавляет в созданный кэш следующую строку.
		//@Параметры:
		//<Ид> - Идентификатор кэша. Положительное целое число переданное в СоздатьКэш.
		// <Строка> - Строка для добавления.
		//<Хеш> - Числовое значение, идентифицирующее строку.
		//<Имя> - Строковое значение, идентифицирующее строку. Тот же <Хеш>, но строковой.
		//Если Счетчик%20 Тогда
		//ОбработкаПрерыванияПользователя();
		//КонецЕсли;	
	КонецЦикла;	
	Результат = Результат+Счетчик+Символы.ПС;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКэшСправочника(ИндексКэша = 111,ВидСправочника="Контрагенты") Экспорт
	//Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	//Конецесли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Справочник.Код,
	|	Справочник.Наименование
	|ИЗ
	|	Справочник."+ВидСправочника+" КАК Справочник
	|ГДЕ
	|	(НЕ Справочник.ЭтоГруппа)
	|	И Справочник.ДатаСоздания >= &ДатаСеанса";
	Запрос.УстановитьПараметр("ДатаСеанса",ПараметрыСеанса.уб_ДатаНачалаСеанса);					  
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекстОшибки="";
	strmatch = уб_Кэшируемые.strmatch(ТекстОшибки);
	Если  strmatch = Неопределено Тогда
		Возврат;
	Иначе	
		//strmatch.СоздатьКэш(КодКэша);???????????
	КонецЕсли;	
	
	счетчик=0;
	ВсегоВыборка =Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		//
		
		//Состояние("Обновление кэша """+ВидСправочника+""""+Окр(100*Счетчик/(2*ВсегоВыборка),2)+"%");
		счетчик=счетчик+1;
		strmatch.ДобавитьВКэш(ИндексКэша, СокрЛП(Выборка.Наименование),счетчик , Строка(Выборка.Код));
		//счетчик=счетчик+1;
		//Компонента.ДобавитьВКэш(КодКэша, СокрЛП(Выборка.НаименованиеПолное),счетчик , Строка(Выборка.Код));
		
		//Добавляет в созданный кэш следующую строку.
		//@Параметры:
		//<Ид> - Идентификатор кэша. Положительное целое число переданное в СоздатьКэш.
		// <Строка> - Строка для добавления.
		//<Хеш> - Числовое значение, идентифицирующее строку.
		//<Имя> - Строковое значение, идентифицирующее строку. Тот же <Хеш>, но строковой.
		//Если Счетчик%20 Тогда
			//ОбработкаПрерыванияПользователя();
		//КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьНечеткийПоиск() Экспорт
	
	ТекстОшибки = "";
	//Целенаправленно используем внешний вызов для кэширования результата
	Strmatch = уб_Кэшируемые.StrMatch(ТекстОшибки);
	
	Возврат ?(НЕ Strmatch=Неопределено,Истина,ТекстОшибки);
КонецФункции

//&НаСервере
Функция StrMatch(Ошибка) Экспорт
	
	Ошибка ="Нет";	
	ИмяКомпоненты = "StrMatch.dll";
	КаталогКомпонент = ПараметрыСеанса.уб_Константы.КаталогВнешнихКомпонент;
	Путь = "";
	Если ТипЗнч(КаталогКомпонент) = Тип("Строка") Тогда
		ИмяКомпоненты = КаталогКомпонент + "\" + ИмяКомпоненты;
		ИмяКомпоненты = СтрЗаменить(ИмяКомпоненты,"\\","\");
		Путь = СтрЗаменить(ПараметрыСеанса.уб_Константы.КаталогВнешнихКомпонент + "\strmatch\StrMatch.dll","\\","\");
	КонецЕсли;
	//ПодключитьВнешнююКомпоненту("StrMatchExtension");
	Если ПодключитьВнешнююКомпоненту(Путь, "StrMatchExtension", ТипВнешнейКомпоненты.COM) = Истина Тогда
		Strmatch = Новый("AddIn.StrMatchExtension.StrMatchExtension");
	Иначе
	//	//
		Ошибка = "ПодключитьВнешнююКомпоненту вернуло ложь";
		Strmatch = Неопределено;
	КонецЕсли;	
		//Strmatch = Новый ("AddIn.StrMatchExtension");
		//Попытка	
		//	ЗагрузитьВнешнююКомпоненту(Путь);
		//	
		//	Strmatch = Новый ("AddIn.StrMatchExtension");
		//	
		//	Ошибка = "";
		//Исключение
		//	Ошибка = ОписаниеОшибки();
		//	Strmatch = Неопределено;
		//КонецПопытки;
		
		////Второй способ
		//Если Strmatch = Неопределено Тогда
			//Попытка                                          //COMОбъект
			//	ПодключитьВнешнююКомпоненту("AddIn.StrMatchExtension");
			//	Strmatch = Новый ("AddIn.StrMatchExtension");
			//Исключение	
			//	Ошибка = ОписаниеОшибки();
			//	Strmatch = Неопределено;
			//КонецПопытки;	
		//КонецЕсли;	

	//Исключение	
	//	Ошибка = ОписаниеОшибки()+Символы.ПС+Путь+Символы.ПС;
	//	Strmatch = Неопределено;
	//КонецПопытки;	
	КомпонентаИнициализирована = НЕ Strmatch = Неопределено;	
	Если КомпонентаИнициализирована Тогда
		//Если КэшироватьФизлиц  = Истина Тогда
		//	уб_temp.СоздатьКэшСправочника(222,"ФизическиеЛица");
		//КонецЕсли;	
		СтрокаКэширования = "";
		СоздатьКэшСправочника(111, "Контрагенты",		СтрокаКэширования, strmatch, Ложь);
		СоздатьКэшСправочника(222, "ФизическиеЛица",	СтрокаКэширования, strmatch, Ложь);
	Иначе	
		//_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При создании объекта AddIn.StrMatchExtension: " + Ошибка);
	КонецЕсли;	
	
	//гл_Расширение = Обработки.уб_Расширение.Создать();
	//гл_Расширение.Strmatch = Strmatch;
	
	Возврат Strmatch;
	
КонецФункции	

//ВИДЫ БСО
&НаСервере
Функция ВидБСОТипаКвА7ДляСК(СК, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВБ.Ссылка КАК ВидБСО,
	|	ВБ.ТипУчетаБСО КАК ТипУчетаБСО
	|ИЗ
	|	Справочник.уб_ВидыБСО КАК ВБ
	|ГДЕ
	|	ВБ.Владелец = &Владелец
	|	И ВБ.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7)
	|	И (ВБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ВБ.ДатаОкончанияДействия >= &Дата)
	|	И (ВБ.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ВБ.ДатаНачалаДействия <= &Дата)";	
	Запрос.УстановитьПараметр("Владелец", 	СК);
	Запрос.УстановитьПараметр("Дата",		Дата);
	Результат = Новый Структура("ВидБСО, ТипУчетаБСО");	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ВидБСО 		= Справочники.уб_ВидыБСО.ПустаяСсылка();
		Результат.ТипУчетаБСО 	= Перечисления.уб_ТипыУчетаБСО.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;	
	
КонецФункции

//Сотрудники и Физические лица
&НаСервере
//Все сотрудники
Функция  ПолучитьСписокСотрудниковАктуальныхВМесяце(Месяц,КакТЗ = ЛОЖЬ,ФактическаяОрганизация = Ложь,СортироватьПоТипам = Ложь) Экспорт
	ЗапросАктуальныхСотрудников = Новый Запрос;
	
	ЗапросАктуальныхСотрудников.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                    |	ВН.Агент,
	                                    |	ВН.Подразделение КАК Подразделение,
	                                    |	МАКСИМУМ(ВН.Период) КАК Период,
	                                    |	ВН.Организация,
	                                    |	ВН.Агент.Наименование КАК НаименованиеАгента,
	                                    |	ПодразделенияОрганизаций.ТипПодразделения,
	                                    |	ВЫБОР
	                                    |		КОГДА ПодразделенияОрганизаций.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя)
	                                    |			ТОГДА 0
										|		КОГДА ПодразделенияОрганизаций.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВС)
	                                    |			ТОГДА 1
										|		КОГДА ПодразделенияОрганизаций.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.ТочкаПродаж)
	                                    |			ТОГДА 2
	                                    |		ИНАЧЕ 10
	                                    |	КОНЕЦ КАК Сортировка
	                                    |ИЗ
	                                    |	(ВЫБРАТЬ
	                                    |		А.Агент КАК Агент,
	                                    |		А.Подразделение КАК Подразделение,
	                                    |		А.Период КАК Период,
	                                    |		ВЫБОР
	                                    |			КОГДА &ФактическаяОрганизация = ИСТИНА
	                                    |				ТОГДА А.Организация
	                                    |			ИНАЧЕ А.Подразделение.Владелец
	                                    |		КОНЕЦ КАК Организация
	                                    |	ИЗ
	                                    |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ), ) КАК А
	                                    |	ГДЕ
	                                    |		НЕ А.Выбытие
	                                    |	
	                                    |	ОБЪЕДИНИТЬ
	                                    |	
	                                    |	ВЫБРАТЬ
	                                    |		А.Агент,
	                                    |		А.Подразделение,
	                                    |		А.Период,
	                                    |		ВЫБОР
	                                    |			КОГДА &ФактическаяОрганизация = ИСТИНА
	                                    |				ТОГДА А.Организация
	                                    |			ИНАЧЕ А.Подразделение.Владелец
	                                    |		КОНЕЦ
	                                    |	ИЗ
	                                    |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
	                                    |	ГДЕ
	                                    |		НЕ А.Выбытие
	                                    |		И А.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаИзПериода, МЕСЯЦ)) КАК ВН
	                                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	                                    |		ПО ВН.Подразделение = ПодразделенияОрганизаций.Ссылка
	                                    |ГДЕ
	                                    |	НЕ ВН.Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
	                                    |	И ВН.Подразделение.Код <> ""000000014""
	                                    |	И ВН.Агент.Родитель.Код <> ""000005461""
	                                    |
	                                    |СГРУППИРОВАТЬ ПО
	                                    |	ВН.Агент,
	                                    |	ВН.Подразделение,
	                                    |	ВН.Организация,
	                                    |	ВН.Агент.Наименование,
	                                    |	ПодразделенияОрганизаций.ТипПодразделения
	                                    |
	                                    |УПОРЯДОЧИТЬ ПО
	                                    |	ВН.Агент.Наименование";
	ЗапросАктуальныхСотрудников.УстановитьПараметр("ФактическаяОрганизация", 	ФактическаяОрганизация);			   
	                          
	ЗапросАктуальныхСотрудников.УстановитьПараметр("ДатаИзПериода", 	Месяц);
	
	ТЗ = ЗапросАктуальныхСотрудников.Выполнить().Выгрузить();
	Если СортироватьПоТипам = Истина Тогда
		Тз.Сортировать("Сортировка,НаименованиеАгента"); 
	КонецЕсли;	
		
	Если КакТЗ Тогда
		Возврат ТЗ;
	Иначе	
		Возврат ТЗ.ВыгрузитьКолонку("Агент");
	КонецЕсли;	
	//Пока Выборка.Следующий() Цикл
	//	СписокСотрудниковАктуальныхВЭтомМесяце.Добавить(Выборка.Агент, Выборка.НаименованиеАгента);
	//КонецЦикла;
	
КонецФункции	

&НаСервере
Функция СписокСотрудниковПодразделения(Подразделение, Знач Месяц) Экспорт
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Если Не ЗначениеЗаполнено(Месяц) Тогда
			Месяц = ТекущаяДата()
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВН.Агент,
		|	ВН.Подразделение КАК Подразделение,
		|	ВН.Период,
		|	ВН.Организация,
		|	ВН.Агент.Наименование КАК НаименованиеАгента
		|ИЗ
		|	(ВЫБРАТЬ
		|		А.Агент КАК Агент,
		|		А.Подразделение КАК Подразделение,
		|		А.Период КАК Период,
		|		А.Организация КАК Организация
		|	ИЗ
		|		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ), ) КАК А
		|	ГДЕ
		|		НЕ А.Выбытие
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		А.Агент,
		|		А.Подразделение,
		|		А.Период,
		|		А.Организация
		|	ИЗ
		|		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК А
		|	ГДЕ
		|		НЕ А.Выбытие
		|		И А.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаИзПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаИзПериода, МЕСЯЦ)) КАК ВН
		|ГДЕ
		|	НЕ ВН.Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
		|	И ВН.Подразделение = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВН.Агент.Наименование";
		Запрос.УстановитьПараметр("Подразделение", 	Подразделение);                          
		Запрос.УстановитьПараметр("ДатаИзПериода", 	Месяц);
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Агент");
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	Возврат Результат
	
КонецФункции	


&НаСервере
Функция ПодразделениеГдеРуководитель(Сотрудник,Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	РП.Подразделение КАК Подразделение,
	|	РП.Подразделение.Владелец КАК Организация,
	|	РП.Заместитель КАК Заместитель
	//|ПОМЕСТИТЬ ПодразделениеГдеРуководитель
	|ИЗ
	|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	|ГДЕ
	|	НЕ РП.Уход
	|	И (РП.Сотрудник = &Сотрудник
	|			ИЛИ РП.Подразделение В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						РП.Подразделение КАК Подразделение
	|					ИЗ
	|						РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	|					ГДЕ
	|						НЕ РП.Уход
	|						И РП.Сотрудник = &Сотрудник)
	|				И РП.Заместитель = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка,
	|	ПодразделенияОрганизаций.Владелец,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				РП.Подразделение КАК Подразделение
	|			ИЗ
	|				РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	|			ГДЕ
	|				НЕ РП.Уход
	|				И РП.Сотрудник = &Сотрудник
	|				И РП.Заместитель = ЛОЖЬ)";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	
////////////////////////////////////////////////////////////////////////////////
// Блок функций для получения МОЛ по БСО и соотв. подразделения
// по иерархии подразделений. (в отличие от получения отв по БСО из списка ответственных лиц)
////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьМОЛпоБСОДляПользователя(оПользователь) Экспорт
	
	ОПП = уб_СС.ПолучитьПодразделениеАгента(оПользователь.ФизЛицо);
	МОЛпоБСО = ПолучитьМОЛпоБСО(ОПП);  
	Возврат МОЛпоБСО;
	
КонецФункции

//Получение МОЛ по БСО (!Ссылку на ФизЛицо!) для переданного подразделения
// начиная с переданного подразделения
// по иерархии подразделений вверх, ищем такое, у которого одновременно 
// указано "Учет БСО" и установлен МОЛ по БСО
Функция ПолучитьМОЛпоБСО(Подразделение) Экспорт
	
	ИскомоеПодразделение = уб_СС.ПолучитьПодразделениеМОЛпоБСО(Подразделение);
	Если ИскомоеПодразделение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ИскомоеПодразделение.МОЛпоБСО;
	
КонецФункции

Функция ДоступностьРоли(Роль, ТипСравненияИ = Ложь) Экспорт
	
	МассивРолей = РазложитьСтрокуВМассивПодстрок(Роль);
	Результат = ?(МассивРолей.Количество() = 0, Ложь, ТипСравненияИ);
	Для Каждого ЭлементМассива Из МассивРолей Цикл
		Если ТипСравненияИ Тогда
			Попытка
				Если Не РольДоступна(СокрЛП(ЭлементМассива)) Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
			Исключение
				Результат = Ложь;
			КонецПопытки	
		Иначе
			//Или
			Попытка
				Если РольДоступна(СокрЛП(ЭлементМассива)) Тогда
					Результат = Истина;
					Прервать;
				КонецЕсли;
			Исключение
				Результат = Ложь;
			КонецПопытки	
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

Функция ЦветаСправочникаЦветов(Знач Цвета, ПроверятьКоличество = Истина, ИскатьПоРодителю = Ложь) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ц.Красный,
	|	Ц.Зеленый,
	|	Ц.Синий,
	|	Ц.Абсолютный,
	|	Ц.Ссылка,
	|	ВЫБОР
	|		КОГДА Ц.Web = """"
	|			ТОГДА ""000000""
	|		ИНАЧЕ Ц.Web
	|	КОНЕЦ КАК Web
	|ИЗ
	|	Справочник.уб_Цвета КАК Ц
	|ГДЕ
	|	Ц.Предопределенный
	|	И &Условие");
	ТипЗнчЦвета = ТипЗнч(Цвета);
	ИмяСправочника  = "Ц";
	ИмяПоляЗамены 	= ?(ИскатьПоРодителю, "Родитель", "Ссылка");
	Если ТипЗнчЦвета = Тип("Строка") Тогда
		Попытка
			Условие = Справочники.уб_Цвета[Цвета];
		Исключение
			Возврат Неопределено;
		КонецПопытки;	
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " = &Условие";
		Если Не ИскатьПоРодителю Тогда
			Количество = 1
		КонецЕсли;
	ИначеЕсли ТипЗнчЦвета = Тип("СправочникСсылка.уб_Цвета") Тогда
		Условие = Цвета;
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " = &Условие";
		Если Не ИскатьПоРодителю Тогда
			Количество = 1
		КонецЕсли;
	Иначе
		//массив или список значений
		Массив = Новый Массив;
		Для Каждого Элемент Из Цвета Цикл
			Массив.Добавить(Справочники.уб_Цвета[Элемент.Ключ]);
		КонецЦикла;
		Условие = Массив;
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " В (&Условие)";
		Если Не ИскатьПоРодителю Тогда
			Количество = Цвета.Количество()
		КонецЕсли;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Замена);
	Запрос.УстановитьПараметр("Условие", Условие);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ПроверятьКоличество И Количество <> Неопределено И ТЗ.Количество() <> Количество Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найдены все необходимые данные справочника цветов!", ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина)
	Иначе
		ТЗ.Колонки.Добавить("Имя");
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			СтрокаТЗ.Имя = Справочники.уб_Цвета.ПолучитьИмяПредопределенного(СтрокаТЗ.Ссылка)
		КонецЦикла;
		Возврат ТЗ
	КонецЕсли;

КонецФункции // ЦветаСправочникаЦветов()

Функция Подчиненные(Знач Сотрудник = Неопределено,Знач Дата = Неопределено) Экспорт
	
	Параметры = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	Параметры.ВключаяВыбывших   = Истина;	
	Параметры.ТолькоТочкиПродаж = Истина;	
	Параметры.ТипРезультата     = "массив";
	СписокСотрудников = уб_СС.ПодчиненныеРуководителя(Сотрудник,Дата, Параметры);
	уб_temp.ДополнитьСписокСотрудниковПредшественниками(СписокСотрудников);
	Возврат СписокСотрудников;
	
КонецФункции	

Функция Приемники() Экспорт
	ЗапросДополненияПреемниками = Новый Запрос;
	ЗапросДополненияПреемниками.Текст = 
	"ВЫБРАТЬ
	|	ФЛ.Ссылка,
	|	ФЛ.Наименование,
	|	ФЛ.Преемник
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФЛ
	|ГДЕ
	|	ФЛ.Ссылка <> ФЛ.Преемник
	|	И НЕ ФЛ.ПометкаУдаления
	|	И НЕ ФЛ.Преемник.ПометкаУдаления";
	Возврат ЗапросДополненияПреемниками.Выполнить().Выгрузить();//Выбрать();
КонецФункции	
	
Функция СписокПоставщиков(СК = Неопределено) Экспорт
	Запрос = Новый Запрос;	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ПоступлениеБСО.Ссылка.Поставщик КАК Поставщик,
	               |	уб_ПоступлениеБСО.Ссылка.Поставщик.Наименование КАК Наименование
	               |ПОМЕСТИТЬ Врем
	               |ИЗ
	               |	Документ.уб_ПоступлениеБСО.БСО КАК уб_ПоступлениеБСО
	               |ГДЕ
	               |	уб_ПоступлениеБСО.Ссылка.Дата >= &Дата
	               |	И (уб_ПоступлениеБСО.СК = &СК
	               |			ИЛИ &СК = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |ОБЪЕДИНИТЬ 
				   |Выбрать Ссылка,
				   |	Ссылка.Наименование
				   | из справочник.Контрагенты где ссылка =&СК
				   |
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ РАЗЛИЧНЫЕ
				   //|	уб_ПоступлениеБСО.Поставщик,
				   //|	уб_ПоступлениеБСО.Поставщик.Наименование
				   //|ИЗ
				   //|	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПоступлениеБСО
				   //|ГДЕ
				   //|	уб_ПоступлениеБСО.Ссылка.Дата >= &Дата2
				   //|	И (уб_ПоступлениеБСО.СК = &СК
				   //|			ИЛИ &СК = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Врем.Поставщик,
	               |	Врем.Наименование КАК Наименование
	               |ИЗ
	               |	Врем КАК Врем
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
				   
   Запрос.УстановитьПараметр("Дата", Дата(2023,3,1));
   Запрос.УстановитьПараметр("Дата2", Дата(2023,3,1));
   
   Если СК = Неопределено Тогда
	    Запрос.УстановитьПараметр("СК", Справочники.Контрагенты.ПустаяСсылка());
   Иначе
	    Запрос.УстановитьПараметр("СК", СК);
   КонецЕсли;
	
   Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Поставщик");
   УстановитьПривилегированныйРежим(Ложь);
   возврат Массив;	
КонецФункции

Функция СписокКонтролеров(КакМассив = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НастройкиПользователей.Пользователь.ФизЛицо КАК ФизЛицо
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |		ПО НастройкиПользователей.Пользователь.ФизЛицо = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент и уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ЛОЖЬ
	               |ГДЕ
	               |	НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.КонтрольЗаявок)
	               |	И ЕСТЬNULL(НастройкиПользователей.Значение, ЛОЖЬ) = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ГрафикДежурства.Сотрудник
	               |ИЗ
	               |	РегистрСведений.ГрафикДежурства КАК ГрафикДежурства
	               |ГДЕ
	               |	ГрафикДежурства.ПравоКонтроля
	               |	И ГрафикДежурства.ДатаДежурства = &ТекДата";
				   
Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));				   
    МассивКонтролеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");//Пользователь");
	
	Если  КакМассив = Ложь Тогда
		
		Список = Новый СписокЗначений;				   
		Список.ЗагрузитьЗначения(МассивКонтролеров);
		
		Возврат Список;		
	Иначе
		Возврат МассивКонтролеров;
	КонецЕсли;	
	
	
КонецФункции


Функция ЕстьСобытиеВхода(Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	журналСобытий.Ссылка
	|ИЗ
	|	Справочник.журналСобытий КАК журналСобытий
	|ГДЕ
	|	журналСобытий.Событие = &Событие
	|	И НачалоПериода(журналСобытий.Дата,ДЕНЬ) = &Дата  
	|	И журналСобытий.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Событие",Справочники.ВидСобытия.Вход);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина
	Иначе
		Возврат Ложь;
	КонецЕсли;  
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции	


Функция СписокГородов() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АК.Наименование КАК Наименование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АК.ТипАдресногоЭлемента = 3
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЭтоГород
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АК
	|ГДЕ
	|	АК.КодРегионаВКоде В (50, 77)
	|	И АК.ТипАдресногоЭлемента В (3, 4)
	|	И АК.Наименование <> ""Москва""
	|
	|СГРУППИРОВАТЬ ПО
	|	АК.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	СписокВыбора 	= Новый Массив;
	СписокВыбора.Добавить("Москва");
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГород Тогда
			СписокВыбора.Добавить(Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВыбора;

КонецФункции	


Функция СписокСтанцийМетро() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.уб_СтанцииМетро.ВернутьВсеСтанцииМетро();
	//Список = Новый СписокЗначений;
	//Список.ЗагрузитьЗначения();			   
	//Возврат Список;
КонецФункции


Функция ПолучитьПодразделенияВС(ТипПодразделения = Неопределено,КакСтруктура = Ложь) Экспорт
	возврат Уб_УСЗ.ПолучитьПодразделенияВС(ТипПодразделения,КакСтруктура);
КонецФункции