
Процедура ВыполнитьВыборНомераПолисаИзСпискаСвободных(
	Форма,
	Ссылка, 
	ВидБСО,
	Знач НомерПолиса,
	СписокНумераций					= Неопределено,
	ДублированиеНомера				= Ложь,
	Агент							= Неопределено,
	ПолисВзаменКоторогоВыданЭтот    = Неопределено,
	Знач ДатаДвиженияБСО			= Неопределено
	) Экспорт
		
	Если ДатаДвиженияБСО = Неопределено И Ссылка.Пустая() Тогда
		//нет возможности определить дату документа
		Возврат
	КонецЕсли;
	НомерПолиса = уб_СЛ.ДайНомерПолисаБезПометкиАннулирования(СокрЛП(НомерПолиса));
	Если СписокНумераций = Неопределено Тогда
		СписокНумераций = Справочники.уб_ВидыНумерации.СписокДоступныхВидовНумераций(ВидБСО);
	КонецЕсли;
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СП.НомерПолиса,
	|	СП.НомерВыданАгенту,
	|	ВЫБОР
	|		КОГДА СП.НомерВыданАгенту.Наименование ЕСТЬ NULL 
	|				ИЛИ СП.НомерВыданАгенту.Наименование = """"
	|			ТОГДА ""яяяяяя""
	|		ИНАЧЕ СП.НомерВыданАгенту.Наименование
	|	КОНЕЦ КАК Сортировка,
	|	ВложенныйЗапрос.ВидНумерации
	|ИЗ
	|	РегистрСведений.уб_СвободныеНомераПолисов.СрезПоследних(&Период, ) КАК СП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уб_СвободныеНомераПолисовСрезПервых.СК КАК СК,
	|			уб_СвободныеНомераПолисовСрезПервых.ВидНумерации КАК ВидНумерации,
	|			уб_СвободныеНомераПолисовСрезПервых.НомерПолиса КАК НомерПолиса
	|		ИЗ
	|			РегистрСведений.уб_СвободныеНомераПолисов.СрезПервых(, Регистратор ССЫЛКА Документ.уб_ПоступлениеНомеровПолисов) КАК уб_СвободныеНомераПолисовСрезПервых) КАК ВложенныйЗапрос
	|		ПО СП.СК = ВложенныйЗапрос.СК
	|			И СП.НомерПолиса = ВложенныйЗапрос.НомерПолиса
	|ГДЕ
	|	ВложенныйЗапрос.ВидНумерации В(&СписокНумераций)
	|	И НЕ СП.НомерИспользован
	|	И НЕ СП.НомерЗаблокирован
	|	И НЕ СП.НомерЗарезервирован
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка";				   
	Если Не ЗначениеЗаполнено(ПолисВзаменКоторогоВыданЭтот) И ЗначениеЗаполнено(Ссылка) Тогда
		//Попытка
			Запрос.УстановитьПараметр("Период", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая))
		//Исключение
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ВыполнитьВыборНомераПолисаИзСпискаСвободных() ошибка: " + ОписаниеОшибки() + ", Ссылка: " + Ссылка,, Истина);
		//	Возврат;
		//КонецПопытки;
	Иначе
		//48: для полисов, созданных на основе аннулированных, использутся период = ДатаДвиженияБСО
		Запрос.УстановитьПараметр("Период", ДатаДвиженияБСО);
	КонецЕсли;					   				   
	Запрос.УстановитьПараметр("СписокНумераций", СписокНумераций);
	ЗаголовокФормыВыбора = "Выбор номера полиса";	
	ФормаСвободныхНомеров = Документы.уб_СтраховойПолис.ПолучитьФорму("ФормаВыбораСвободныхНомеров", Форма);
	ФормаСвободныхНомеров.РежимВыбора 			= Истина;
	ФормаСвободныхНомеров.МножественныйВыбор	= Ложь;
	ФормаСвободныхНомеров.Заголовок 			= ЗаголовокФормыВыбора;
	ФормаСвободныхНомеров.ТЗБезОтбора			= Запрос.Выполнить().Выгрузить();
	ФормаСвободныхНомеров.НомерПолиса			= НомерПолиса;
	ФормаСвободныхНомеров.СК					= Форма.СК;
	ФормаСвободныхНомеров.Поставщик				= Форма.Поставщик;
	ФормаСвободныхНомеров.ОрганизацияАгент		= Форма.ОрганизацияАгент;
	ФормаСвободныхНомеров.ЭтоСтраховойПолис		= ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_СтраховойПолис");
	Если ДатаДвиженияБСО = Неопределено Тогда
		ДатаДвиженияБСО = Ссылка.Дата
	КонецЕсли;
	ФормаСвободныхНомеров.ДатаДвиженияБСО = ДатаДвиженияБСО;
	Если Агент <> Неопределено Тогда
		ФормаСвободныхНомеров.эуПоискНомерВыданАгенту = Агент
	КонецЕсли;
	ФормаСвободныхНомеров.ФормаВладелец	= Форма;
	//Форма.ДублированиеНомера		= Найти(ЭлементыФормы.СостояниеНомераПолиса.Подсказка, "уже был использован документом") <> 0;
	ФормаСвободныхНомеров.ДублированиеНомера = ДублированиеНомера;
	ФормаСвободныхНомеров.Открыть();
	
КонецПроцедуры