//Формируем имя группы. Если один из реквизитов не заполнен возвращаем ложь
Функция СформироватьИмя() Экспорт
	Если ЗначениеНеЗаполнено(ОргАгент) ИЛИ ЗначениеНеЗаполнено(Поставщик) Тогда
		Наименование = "";
		Возврат Ложь;
	Иначе
		Наименование = Поставщик.folder + " - [" + ОргАгент.folder + "]";
		Возврат Истина;
	КонецЕсли;
КонецФункции

//Проверяем чтоб не было дублирование записей
//Если запись дублируется возвращаем Истина, иначе ложь
Функция ДоговорУжеЕсть() Экспорт
	Если СформироватьИмя() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ГруппыДоговораB2B.Ссылка
		               |ИЗ
		               |	Справочник.уб_ГруппыДоговораB2B КАК уб_ГруппыДоговораB2B
		               |ГДЕ
		               |	уб_ГруппыДоговораB2B.ОргАгент = &ОргАгент
		               |	И уб_ГруппыДоговораB2B.Поставщик = &Поставщик
		               |	И уб_ГруппыДоговораB2B.Код <> &Код";
		Запрос.УстановитьПараметр("ОргАгент",ОргАгент);
		Запрос.УстановитьПараметр("Поставщик",Поставщик);
		Запрос.УстановитьПараметр("Код",Код);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
		Если РезультатЗапроса.Количество() > 0 Тогда 
			//Договор уже есть, отказываем в записи
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Данный договор уже есть в базе! В записи отказано",,,,,,,СтатусСообщения.Важное,,);
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		//Не все поля заполнены, отказываем в записи
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Перед записью необходимо заполнить все поля!",,,,,,,СтатусСообщения.Важное,,);
		Возврат Истина;
	КонецЕсли;
КонецФункции

Процедура ПередЗаписью(Отказ)
	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
КонецПроцедуры


