Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	// Очистим начальный документ
	ДокументРезультат.Очистить();	
	Макет = ПолучитьМакет("Макет");	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	Запрос.УстановитьПараметр("СК", ?(СК.Пустая(),Null,СК));	
	Запрос.УстановитьПараметр("СтраховойПродукт", ?(СтраховойПродукт.Пустая(),Null,СтраховойПродукт));	
	Запрос.УстановитьПараметр("ВидСтраховогоПродукта", ?(ВидСтраховогоПродукта.Пустая(),Null,ВидСтраховогоПродукта));	
	Запрос.УстановитьПараметр("Подразделение", ?(Подразделение.Пустая(),Null,Подразделение));	
	Запрос.УстановитьПараметр("Агент", ?(ЗначениеНеЗаполнено(Агент),Null,Агент));	
	Запрос.УстановитьПараметр("Организация", ?(Организация.Пустая(),Null,Организация));	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид КАК ВидСтраховогоПродукта,
	|	СУММА(уб_ОплатыПолисов.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	СУММА(уб_ОплатыПолисов.КВСумма) КАК КВСумма,
	|	СУММА(уб_ОплатыПолисов.АВилиСкидкаСумма) КАК АВилиСкидкаСумма,
	|	уб_ОплатыПолисов.СтраховойПолис.СК КАК СК
	|ИЗ
	|	РегистрСведений.уб_ОплатыПолисов КАК уб_ОплатыПолисов
	|ГДЕ
	|	уб_ОплатыПолисов.Период >= &ДатаНач
	|	И уб_ОплатыПолисов.Период <= &ДатаКон
	|	И (уб_ОплатыПолисов.СтраховойПолис.Подразделение = &Подразделение
	|			ИЛИ &Подразделение ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.СК = &СК
	|			ИЛИ &СК ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.Организация = &Организация
	|			ИЛИ &Организация ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.Агент = &Агент
	|			ИЛИ &Агент ЕСТЬ NULL )
	|	И (уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид = &ВидСтраховогоПродукта
	|			ИЛИ &ВидСтраховогоПродукта ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ОплатыПолисов.СтраховойПолис.СК,
	|	уб_ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид";
	Обл 									= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтНач 					= Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДтКон 					= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК						= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	Обл.Параметры.ПечВидСтраховогоПродукта	= ?(ЗначениеНеЗаполнено(ВидСтраховогоПродукта),"все страховые продукты",ВидСтраховогоПродукта);
	ДокументРезультат.Вывести(Обл);	
	РезЗапроса 	= Запрос.Выполнить();
	ВыборкаВСП 	= РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ИтДоход 		= 0;
	ИтОборот 		= 0;
	ИтПрямыеРасходы = 0;
	ИтОтдаемВСК		= 0;
	Ном = 0;
	Пока ВыборкаВСП.Следующий() Цикл
		Ном = 	Ном + 1;
		//
		Обл 												= Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном									= Ном;
		Обл.Параметры.СК									= ВыборкаВСП.СК;
		Обл.Параметры.ВидСтраховогоПродукта					= ВыборкаВСП.ВидСтраховогоПродукта;
		Обл.Параметры.Оборот								= ВыборкаВСП.НачисленнаяСуммаВзноса;
		Обл.Параметры.Доход									= ВыборкаВСП.КВСумма;
		Обл.Параметры.ПрямыеРасходы							= ВыборкаВСП.АВилиСкидкаСумма;
		Обл.Параметры.ОтдаемВСК								= ВыборкаВСП.НачисленнаяСуммаВзноса - ВыборкаВСП.КВСумма;
		Обл.Параметры.МаржинальнаяПрибыль					= ВыборкаВСП.КВСумма - ВыборкаВСП.АВилиСкидкаСумма;
		Обл.Параметры.ПроцентДоходаОтОборота				= ?(ВыборкаВСП.НачисленнаяСуммаВзноса=0,0,Окр(ВыборкаВСП.КВСумма*100/ВыборкаВСП.НачисленнаяСуммаВзноса,2));
		Обл.Параметры.ПроцентПрямыхРасходовОтОборота		= ?(ВыборкаВСП.НачисленнаяСуммаВзноса=0,0,Окр(ВыборкаВСП.АВилиСкидкаСумма*100/ВыборкаВСП.НачисленнаяСуммаВзноса,2));
		Обл.Параметры.ПроцентПрямыхРасходовОтДохода			= ?(ВыборкаВСП.КВСумма=0,0,Окр(ВыборкаВСП.АВилиСкидкаСумма*100/ВыборкаВСП.КВСумма,2));
		Обл.Параметры.ПроцентМаржинальнойПрибылиОтОборота	= ?(ВыборкаВСП.НачисленнаяСуммаВзноса=0,0,Окр(Обл.Параметры.МаржинальнаяПрибыль*100/ВыборкаВСП.НачисленнаяСуммаВзноса,2));
		Обл.Параметры.ПроцентМаржинальнойПрибылиОтДохода	= ?(ВыборкаВСП.КВСумма=0,0,Окр(Обл.Параметры.МаржинальнаяПрибыль*100/ВыборкаВСП.КВСумма,2));
		//
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		//
		ИтОборот 		= ИтОборот + ВыборкаВСП.НачисленнаяСуммаВзноса;
		ИтДоход 		= ИтДоход + ВыборкаВСП.КВСумма;		
		ИтПрямыеРасходы = ИтПрямыеРасходы + ВыборкаВСП.АВилиСкидкаСумма;
	КонецЦикла;
	
	Обл 								= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтОборот				= ИтОборот;
	Обл.Параметры.ИтДоход				= ИтДоход;
	Обл.Параметры.ИтМаржинальнаяПрибыль	= ИтДоход - ИтПрямыеРасходы;
	Обл.Параметры.ИтОтдаемВСК			= ИтОборот - ИтДоход;
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху      = 8;

	ДокументРезультат.Показать("Подведение финансовых итогов по страховым компаниям");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли
