///////////////////////////////////////////////////////////////////////////
// Процедуры и функции для печати отчетов и актов п/п
///////////////////////////////////////////////////////////////////////////

Функция кПризнакНеименованнойОбласти() Экспорт
	
	Возврат "#"
	
КонецФункции

Функция кПризнакСвободногоКода() Экспорт
	
	Возврат "="
	
КонецФункции

Функция СтруктураОтветственногоЛица() Экспорт 
	
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Организация",				Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("ОтветственноеЛицо",		Новый ОписаниеТипов("ПеречислениеСсылка.ОтветственныеЛицаОрганизаций"));
	ТЗ.Колонки.Добавить("ФизическоеЛицо", 			Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("Должность");
	ТЗ.Колонки.Добавить("ОснованиеДействия", 		ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(150));
	ТЗ.Колонки.Добавить("АгентОснованиеДействия", 	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(150));
	ТЗ.Колонки.Добавить("ПаспортныеДанные");
	ТЗ.Колонки.Добавить("АдресПрописки");
	НС = ТЗ.Добавить();
	НС.Должность = Новый Структура("Наименование,НаименованиеКратко","","");
	Возврат НС;
	
КонецФункции

Функция ПолучитьЧисловойТипОбласти(ТипОбласти) Экспорт
	
	//Тип области. 0 - вне области, 1 - таблица, 2 - строки, 3 - колонки, 4 - прямоугольник
	Если ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Таблица Тогда
		Возврат 1;	
	ИначеЕсли ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда	
		Возврат 2;	
	ИначеЕсли ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
		Возврат 3;	
	ИначеЕсли ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
		Возврат 4;	
	Иначе
		Возврат 0;	
	КонецЕсли;
	
КонецФункции

//Ищет в табличном документе все параметры и возвращает в виде таблицы значений с полями:
// Параметр - имя параметра;
// Область - имя области таб. документа, в котором найден параметр
// ИмяОъединенияЯчеек - адрес объединения ячеек, в котором найден параметр
// Строка - номер строки ячейки, в которой найден параметр (или левой верхней ячейки объединения ячеек)
// Колонка - номер колонки ячейки, в которой найден параметр (или левой верхней ячейки объединения ячеек)
// Тип - тип ячейки, содержащей параметр: Параметр или Шаблон
// Порядок - порядок сортировки - в том порядке, в котором расположены параметры в табличном документе
//
Функция ПолучитьСписокПараметровТабличногоДокумента(ТабДок) Экспорт
	
	//Цель - получить двумерную таблицу, в которой бубут перечислены все сочетания
	//[Имя области] - [Имя Параметра].
	//Такая таблица позволяет сделать выборку всех параметров, входящих в заданную именованную область.	
	//Инициализируем объект RegExp для поиска параметров
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Ложь; // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина; // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	RegExp.Pattern = "\[([^[]*)\]"; // шаблон (регулярное выражение) для поиска параметра	
	ТипТекст = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ТипШаблон = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
	ТипПараметр = ТипЗаполненияОбластиТабличногоДокумента.Параметр;	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоСтолбцов = ТабДок.ШиринаТаблицы;	
	//Создаем соответствие [Имя Области Объединения Ячееек] - [Массив имен параметров, входящих в ООЯ]
	Соотв_ООЯ_Параметры = Новый Соответствие;	
	//Создаем аналогичное соответствие (на данном этапе - копия)
	//но впоследствие отсюда будут удалены все ООЯ, входящие в именованные области
	//И останутся только ООЯ вне каких-либо областей.
	Соотв_ООЯ_Параметры_ВнеОбластей = Новый Соответствие;	
	Для Строчка = 1 по КоличествоСтрок цикл
		Для Колонка = 1 по КоличествоСтолбцов цикл			
			//Получаем ячейку или область объединенных ячеек (ООЯ). 
			//Для всех ячеек (сочетаний строка, колонка), входящих в ООЯ, 
			//будет получена одна и та же область.
			//Поэтому при первом случае получения адреса (имени) ООЯ,
			//парсим ее содержимое, находя массив параметров,
			//и добавляем в соответствие, где ключем является имя ООЯ
			//(что бы не парсить ООЯ больше одного раза)			
			ООЯ = ТабДок.Область(Строчка,Колонка);			
			типЗаполнения = ООЯ.Заполнение;			
			//Пропускаем текстовые ООЯ
			Если типЗаполнения = ТипТекст тогда
				Продолжить;
			КонецЕсли;			
			адресООЯ = ООЯ.Имя;			
			Если Соотв_ООЯ_Параметры.Получить(адресООЯ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			мПарам = Новый Массив;
			Если типЗаполнения = ТипПараметр тогда
				мПарам.Добавить(ООЯ.Параметр);
			ИначеЕсли типЗаполнения = ТипШаблон тогда
				РезультатАнализаСтроки = RegExp.Execute(СокрЛП(ООЯ.Текст));
				Для Каждого Выражение Из РезультатАнализаСтроки Цикл
					мПарам.Добавить(Выражение.SubMatches(0));
			    КонецЦикла;
			КонецЕсли;			
			Соотв_ООЯ_Параметры.Вставить(адресООЯ, мПарам);
			Соотв_ООЯ_Параметры_ВнеОбластей.Вставить(адресООЯ, мПарам);
		КонецЦикла;    
	КонецЦикла;    	
	//На этом этапе заполним таблицу соответствий 
	//[Имя области] - [Имя ООЯ].	
	тзОО = Новый ТаблицаЗначений;
	тзОО.Колонки.Добавить("ИмяОбласти");
	тзОО.Колонки.Добавить("ТипОбласти");
	тзОО.Колонки.Добавить("ПорядокОбласти"); 
	//Тип области. 0 - вне области, 1 - таблица, 2 - строки, 3 - колонки, 4 - прямоугольник
	тзОО.Колонки.Добавить("ИмяООЯ");	
	сч = 0;
	Для Каждого Обл из ТабДок.Области цикл
		сч = сч + 1;		
		//Пропускаются рисунки, в них нет параметров
		Если ТипЗнч(Обл) = Тип("РисунокТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;			
		//Для каждой именованной области табличного документа 
		//соберем список входящих в нее ООЯ.		
		//При этом учитываем, что:
		// - если тип области "Колонки", то в нее НЕ войдут параметры 
		// из объединений ячеек, левая ячейка которых не входит в область колонок.
		// - если тип области "Строки", то в нее НЕ войдут параметры 
		// из объединений ячеек, верхняя ячейка которых не входит в область строк.		
		ИмяОбласти = Обл.Имя;
		ТипОбласти = Обл.ТипОбласти;
		чТипОбл = ПолучитьЧисловойТипОбласти(ТипОбласти);		
		Если ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда				
			Верх = Обл.Верх;
			Низ = Обл.Низ;			
			Для Строчка = Верх по Низ цикл
				Для Колонка = 1 по КоличествоСтолбцов цикл
					ООЯ = ТабДок.Область(Строчка,Колонка);
					Если ООЯ.Верх < Верх Тогда
						Продолжить;	
					КонецЕсли;
					Если ООЯ.Заполнение = ТипТекст тогда
						Продолжить;
					КонецЕсли;				
					НС = тзОО.Добавить();
					НС.ИмяОбласти = ИмяОбласти;
					НС.ИмяООЯ = ООЯ.Имя;
					НС.ТипОбласти = чТипОбл; 
					НС.ПорядокОбласти = чТипОбл * 1000000 + Верх * 1000;
				КонецЦикла;    
			КонецЦикла;    			
		ИначеЕсли ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда			
			Лево = Обл.Лево;
			Право = Обл.Право;			
			Для Строчка = 1 по КоличествоСтрок цикл
				Для Колонка = Лево по Право цикл
					ООЯ = ТабДок.Область(Строчка,Колонка);
					Если ООЯ.Лево < Лево Тогда
						Продолжить;	
					КонецЕсли;
					Если ООЯ.Заполнение = ТипТекст тогда
						Продолжить;
					КонецЕсли;					
					НС = тзОО.Добавить();
					НС.ИмяОбласти = ИмяОбласти;
					НС.ИмяООЯ = ООЯ.Имя;
					НС.ТипОбласти = чТипОбл;
					НС.ПорядокОбласти = чТипОбл * 1000000 + Лево;
				КонецЦикла;    
			КонецЦикла;    			
		ИначеЕсли ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
			ИЛИ  ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Таблица
			Тогда				
			Лево = Обл.Лево;
			Право = Обл.Право;
			Верх = Обл.Верх;
			Низ = Обл.Низ;			
			Для Строчка = Верх по Низ цикл
				Для Колонка = Лево по Право цикл
					ООЯ = ТабДок.Область(Строчка,Колонка);
					Если ООЯ.Заполнение = ТипТекст тогда
						Продолжить;
					КонецЕсли;					
					НС = тзОО.Добавить();
					НС.ИмяОбласти = ИмяОбласти;
					НС.ИмяООЯ = ООЯ.Имя;
					НС.ТипОбласти = чТипОбл;
					НС.ПорядокОбласти = чТипОбл * 1000000 + Верх * 1000 + Лево;
				КонецЦикла;    
			КонецЦикла;    			
		КонецЕсли; 		
	КонецЦикла;    	
	//Получим набор уникальных сочетаний 
	тзОО.Свернуть("ИмяОбласти,ТипОбласти,ПорядокОбласти,ИмяООЯ");
	//Создаем уникальный список ООЯ, входящих в именованные области 
	тзИменООЯ = тзОО.Скопировать();
	тзИменООЯ.Свернуть("ИмяООЯ");	
	//Получаем список ООЯ вне именованных областей 
	Для Каждого СтрТЗ из тзИменООЯ Цикл
		Если Неопределено <> Соотв_ООЯ_Параметры_ВнеОбластей.Получить(СтрТЗ.ИмяООЯ) Тогда
			Соотв_ООЯ_Параметры_ВнеОбластей.Удалить(СтрТЗ.ИмяООЯ);	
		КонецЕсли;
	КонецЦикла;		
	RegExp.Pattern = "^R\d+C\d+:R\d+C\d+$"; // шаблон (регулярное выражение) для поиска имени оласти, созданной автоматически	
	//Подготавливаем результирующую таблицу	
	ТЗПараметров = Новый ТаблицаЗначений;
	ТЗПараметров.Колонки.Добавить("ТипОбласти", 			ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1));
	ТЗПараметров.Колонки.Добавить("Область", 				ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	ТЗПараметров.Колонки.Добавить("Параметр", 				ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(150));
	ТЗПараметров.Колонки.Добавить("ИмяООЯ", 				ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20));
	ТЗПараметров.Колонки.Добавить("Строка", 				ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(6));
	ТЗПараметров.Колонки.Добавить("Колонка", 				ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(6));
	ТЗПараметров.Колонки.Добавить("СтрокаВОбласти", 		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(6));
	ТЗПараметров.Колонки.Добавить("КолонкаВОбласти", 		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(6));
	ТЗПараметров.Колонки.Добавить("АдресЯчейкиВОбласти", 	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20));
	ТЗПараметров.Колонки.Добавить("Тип", 					ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(8));
	ТЗПараметров.Колонки.Добавить("Порядок", 				ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18));
	ТЗПараметров.Колонки.Добавить("ПорядокОбласти", 		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18));
	ТЗПараметров.Колонки.Добавить("ИД", 					ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(200));
	ТЗПараметров.Колонки.Добавить("Количество", 			ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(2));	
	//Заполняем таблицу строками для параметров, входящих в именованные области
	Для Каждого СтрТЗ из тзОО Цикл
		ИмяООЯ = СтрТЗ.ИмяООЯ;		
		мПарам = Соотв_ООЯ_Параметры.Получить(ИмяООЯ);
		Если Неопределено = мПарам Тогда
			Сообщить("Ошибка в функции ""ПолучитьСписокПараметровТабличногоДокумента"": не найдена область объединения ячеек " + ИмяООЯ, СтатусСообщения.Внимание);
			Продолжить;	
		КонецЕсли;
		ИмяОбласти = СтрТЗ.ИмяОбласти;
		Если RegExp.Test(ИмяОбласти) Тогда
			Продолжить;	
		КонецЕсли;
		ООЯ = ТабДок.Область(ИмяООЯ);
		Стр = ООЯ.Верх;
		Кол = ООЯ.Лево;
		оОбласть = ТабДок.Область(ИмяОбласти); 
		СтрВОбласти = Стр - ?(оОбласть.Верх = 0, 1, оОбласть.Верх) + 1; 
		КолВОбласти = Кол - ?(оОбласть.Лево = 0, 1, оОбласть.Лево) + 1; 
		АдресЯчейкиВОбласти = "R" + СтрВОбласти + "C" + КолВОбласти; 
		
		типЗаполнения = ООЯ.Заполнение;
		ТипОбласти = СтрТЗ.ТипОбласти;
		ПорядокОбласти = СтрТЗ.ПорядокОбласти;
		Сч = 0;
		Для Каждого Параметр из мПарам Цикл
			Сч = Сч + 1;
			ИД = ИмяОбласти + "@" + Параметр;
			НС = ТЗПараметров.Найти(ИД,"ИД");
			Если Неопределено <> НС Тогда
				НС.Количество = НС.Количество + 1;
				Продолжить;	
			КонецЕсли;
			НС = ТЗПараметров.Добавить();
			НС.ТипОбласти = ТипОбласти;
			НС.Область = ИмяОбласти;
			НС.Параметр = Параметр;
			НС.ИмяООЯ = ИмяООЯ;
			НС.Строка = Стр;
			НС.Колонка = Кол;
			НС.СтрокаВОбласти = СтрВОбласти;
			НС.КолонкаВОбласти = КолВОбласти;
			НС.АдресЯчейкиВОбласти = АдресЯчейкиВОбласти;
			НС.Тип = типЗаполнения;
			НС.Порядок = ПорядокОбласти * 1000000000 + Стр * 1000000 + Кол * 1000 + Сч;
			НС.ПорядокОбласти = ПорядокОбласти;
			НС.ИД = ИД;
			НС.Количество = 1;
		КонецЦикла;		
	КонецЦикла; // по тзОО	
	мПризнакНеименованнойОбласти = кПризнакНеименованнойОбласти();	
	//Заполняем таблицу строками для параметров, НЕ входящих в именованные области
	Для Каждого КлючЗнач из Соотв_ООЯ_Параметры_ВнеОбластей Цикл
		ИмяООЯ = КлючЗнач.Ключ;
		ООЯ = ТабДок.Область(ИмяООЯ);
		Стр = ООЯ.Верх;
		Кол = ООЯ.Лево;
		типЗаполнения = ООЯ.Заполнение;		
		мПарам = КлючЗнач.Значение;		
		Сч = 0;
		Для Каждого Параметр из мПарам Цикл
			Сч = Сч + 1;
			ИД = "@" + Параметр;
			НС = ТЗПараметров.Найти(ИД,"ИД");
			Если НС <> Неопределено Тогда
				НС.Количество = НС.Количество + 1;
				Продолжить;	
			КонецЕсли;
			НС = ТЗПараметров.Добавить();
			НС.ТипОбласти = 1;
			НС.Область = мПризнакНеименованнойОбласти;
			НС.Параметр = Параметр;
			НС.ИмяООЯ = ИмяООЯ;
			НС.Строка = Стр;
			НС.Колонка = Кол;
			НС.СтрокаВОбласти = Стр;
			НС.КолонкаВОбласти = Кол;
			НС.АдресЯчейкиВОбласти = ИмяООЯ;
			НС.Тип = типЗаполнения;
			НС.Порядок = Стр * 1000000 + Кол * 1000 + Сч;
			НС.ПорядокОбласти = 1000000;
			НС.ИД = ИД;
			НС.Количество = 1;
		КонецЦикла;		
	КонецЦикла; // по тзОО	
	RegExp = Null;	
	//Перенумеровывваем порядок;
	ТЗПараметров.Сортировать("Порядок");
	i = 0;
	Для Каждого СтрТЗ из ТЗПараметров Цикл
		i = i + 1;
		СтрТЗ.Порядок = i;
	КонецЦикла;
	Возврат ТЗПараметров;
	
КонецФункции

//Возвращает наименование договора между заданными Поставщиком и Оргагентом, действующий на заданную дату
// Получает данные из справочника ДоговорыКонтрагентов
// В имени договора возвращается расширение названия договора
// используется во внешней ПФ заявки
Функция ДайНаименованиеДоговора(Поставщик, ОрганизацияАгент, НаДату = Неопределено, Предупреждать = Ложь, МесяцПрописью = Ложь) Экспорт 
	
	Договор = уб_СС.ДайДоговорМеждуПоставщикомИОргАгентом(Поставщик, ОрганизацияАгент, НаДату, Предупреждать);
	Если Договор.Пустая() Тогда
		Возврат "";	
	КонецЕсли;
	РасширениеНазвания = ?(ПустаяСтрока(СокрЛП(Договор.РасширениеНазвания)),"",Договор.РасширениеНазвания + " ");	
	ФС = ?(МесяцПрописью = Истина,"ДФ='dd MMMM yyyy'","ДФ='dd.MM.yyyy'");
	сДог = РасширениеНазвания + "№ " + Договор.Наименование + " от "	+ Формат(Договор.ДатаЗаключенияДоговора,ФС) + "г.";	
	Возврат сДог;
	
КонецФункции

//Общ
Функция ДайОтветственноеЛицоОрганизации(ОтветственноеЛицо, ОрганизацияАгент, НаДату = Неопределено, Предупреждать = Истина) Экспорт 
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();	
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	О.СтруктурнаяЕдиница КАК Организация,
	|	О.ОтветственноеЛицо,
	|	О.ФизическоеЛицо,
	|	О.Должность КАК Должность,
	|	О.ОснованиеДействия
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&НаДату,
	|			СтруктурнаяЕдиница = &ОрганизацияАгент
	|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК О";	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("ОрганизацияАгент", ОрганизацияАгент);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда
		Возврат ТЗ[0];	
	КонецЕсли;	
	
	#Если Клиент Тогда
	Фрм = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьФормуСписка();
	Если Предупреждать И НЕ Фрм.Открыта() Тогда
		Заг = "Необходимо указать ответсвенное лицо организации!";
		СОО = "На дату " + Формат(НаДату,"ДФ='dd.MM.yyyy'") + " не найдено ответственное лицо '" 
			+ Строка(ОтветственноеЛицо) + "' для организации '" + Строка(ОрганизацияАгент)  + "'
			|
			|Зайдите в регистр сведений 'Ответственные Лица Организаций' и внесите необходимые данные.
			|
			|Открыть регистр сведений 'Ответственные Лица Организаций' для внесения изменений?";
		Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Фрм.Открыть();
			ТЗ = Запрос.Выполнить().Выгрузить();
			Если ТЗ.Количество() > 0 Тогда
				Возврат ТЗ[0];	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	Возврат Неопределено;
	
КонецФункции

Функция ОбъектДолжностьОтветственногоЛица(СтруктураОтветственноеЛицо, Предупреждать = Истина) Экспорт 
	
	Если СтруктураОтветственноеЛицо = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	Должность = СтруктураОтветственноеЛицо.Должность;	
	Если ЗначениеНеЗаполнено(Должность) Тогда
		Фрм = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьФормуСписка();
		#Если Клиент Тогда
		Если Предупреждать И НЕ Фрм.Открыта() Тогда
			Заг = "Необходимо указать должность ответсвенного лица организации!";
			СОО = "Не указана должность ответственного лица '" + Строка(СтруктураОтветственноеЛицо.ОтветственноеЛицо) + "' организации  '" 
			    + Строка(СтруктураОтветственноеЛицо.Организация) + "'
				|
				|Зайдите в регистр сведений 'Ответственные Лица Организаций' и внесите необходимые данные.
				|
				|Открыть регистр сведений 'Ответственные Лица Организаций' для внесения изменений?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Фрм.Открыть();
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		Возврат Неопределено;	
	КонецЕсли;	
	Возврат Должность;
	
КонецФункции

Функция ОснованиеДействияОтветственногоЛица(СтруктураОтветственноеЛицо, Предупреждать = Истина) Экспорт 
	
	Если СтруктураОтветственноеЛицо = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	ОснованиеДействия = СтруктураОтветственноеЛицо.ОснованиеДействия;	
	Если ЗначениеНеЗаполнено(ОснованиеДействия) Тогда
		#Если Клиент Тогда
		Фрм = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьФормуСписка();
		Если Предупреждать И НЕ Фрм.Открыта() Тогда
			Заг = "Необходимо указать основание действия ответсвенного лица организации!";
			СОО = "Не указано основание действия ответственного лица '" + Строка(СтруктураОтветственноеЛицо.ОтветственноеЛицо) + "' организации  '" 
			    + Строка(СтруктураОтветственноеЛицо.Организация) + "'
				|
				|Зайдите в регистр сведений 'Ответственные Лица Организаций' и внесите необходимые данные.
				|
				|Открыть регистр сведений 'Ответственные Лица Организаций' для внесения изменений?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Фрм.Открыть();
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		Возврат Неопределено;	
	КонецЕсли;	
	Возврат ОснованиеДействия;
	
КонецФункции

Функция ОснованиеДействияОргАгента(СтруктураОтветственноеЛицо, Предупреждать = Истина) Экспорт 
	
	Если СтруктураОтветственноеЛицо = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	АгентОснованиеДействия = СтруктураОтветственноеЛицо.АгентОснованиеДействия;	
	Если ЗначениеНеЗаполнено(АгентОснованиеДействия) Тогда
		Фрм = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьФормуСписка();
		#Если Клиент Тогда
		Если Предупреждать И НЕ Фрм.Открыта() Тогда
			Заг = "Необходимо указать основание действия ответсвенного лица организации!";
			СОО = "Не указано основание действия организации агента '" + Строка(СтруктураОтветственноеЛицо.ОтветственноеЛицо) + "' организации  '" 
			    + Строка(СтруктураОтветственноеЛицо.Организация) + "'
				|
				|Зайдите в регистр сведений 'Ответственные Лица Организаций' и внесите необходимые данные.
				|
				|Открыть регистр сведений 'Ответственные Лица Организаций' для внесения изменений?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Фрм.Открыть();
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		Возврат Неопределено;	
	КонецЕсли;
	Возврат АгентОснованиеДействия;
	
КонецФункции

Функция ДайДолжностьОтветственногоЛица(ОрганизацияАгент, ОтветственноеЛицо, НаДату = Неопределено, Предупреждать = Истина) Экспорт 
	
	СтруктураОтветственноеЛицо = ДайОтветственноеЛицоОрганизации(ОтветственноеЛицо, ОрганизацияАгент, НаДату, Предупреждать);	
	Если СтруктураОтветственноеЛицо <> Неопределено Тогда
		Возврат ОбъектДолжностьОтветственногоЛица(СтруктураОтветственноеЛицо, Предупреждать = Истина)
	КонецЕсли;	
	
КонецФункции

//Общ  //Падеж
Функция ДайНаименованиеДолжностиОтветственногоЛица(ОрганизацияАгент, ОтветственноеЛицо, НаДату = Неопределено, Падеж = 1, Предупреждать = Истина) Экспорт 
	
	Должность = ДайДолжностьОтветственногоЛица(ОрганизацияАгент, ОтветственноеЛицо, НаДату, Предупреждать);
	НаименованиеДолжности = ?(Должность = Неопределено, "", Должность.Наименование);	
	Возврат ФункцииРасширения.Должность_Склонение(НаименованиеДолжности, Падеж);
	
КонецФункции

//Частное для Руководителя
Функция ДайРуководителя(ОрганизацияАгент, Знач НаДату = Неопределено, Предупреждать = Истина) Экспорт 
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();	
	КонецЕсли;
	ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;	
	Руководитель = ДайОтветственноеЛицоОрганизации(ОтветственноеЛицо, ОрганизацияАгент, НаДату, Предупреждать);
	Если Руководитель <> Неопределено Тогда
		Возврат Руководитель;
	КонецЕсли;	
	Если ОрганизацияАгент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Возврат Неопределено; 
	Иначе
		НС = СтруктураОтветственногоЛица();
		НС.Организация = ОрганизацияАгент;
		НС.ОтветственноеЛицо = ОтветственноеЛицо;
		НС.ФизическоеЛицо = ОрганизацияАгент.ИндивидуальныйПредприниматель;
		Если ОрганизацияАгент.ЭтоИндивидуальныйПредприниматель Тогда
			НС.Должность.Наименование = "Индивидуальный Предприниматель";
			НС.Должность.НаименованиеКратко = "Индивидуальный Предприниматель";
			НС.ОснованиеДействия = "Устав";
		Иначе
			НС.ОснованиеДействия = "";
		КонецЕсли;
		Возврат НС;
	КонецЕсли;
	
КонецФункции

//Частное для Руководителя
Функция ДайНаименованиеДолжностиРуководителя(ОрганизацияАгент, НаДату = Неопределено, Падеж = 1, Предупреждать = Истина) Экспорт 
	
	Руководитель = ДайРуководителя(ОрганизацияАгент, НаДату, Предупреждать);
	Если Руководитель = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат ФункцииРасширения.Должность_Склонение(Руководитель.Должность.Наименование, Падеж);
	
КонецФункции

Функция ДайОтветственноеЛицоДляФизлица(Физлицо, Предупреждать = Ложь) Экспорт 
	
	НС = СтруктураОтветственногоЛица();
	НС.Организация 			= Физлицо;
	НС.ОтветственноеЛицо 	= Физлицо;
	НС.ФизическоеЛицо 		= Физлицо;
	НС.Должность 			= "";
	НС.ОснованиеДействия 	= "";
	НС.ПаспортныеДанные 	= ДайПаспортныеДанныеФизлица(Физлицо, Предупреждать);	
	НС.АдресПрописки 		= АдресПоПропискеФизлица(Физлицо, Предупреждать);	
	Возврат НС;
	
КонецФункции
		
//Частное для Руководителя
Функция ДайФИОРуководителя(ОрганизацияАгент, НаДату = Неопределено, ФИОКратко = Истина, Падеж = Неопределено, Предупреждать = Истина) Экспорт 
	
	Руководитель = ДайРуководителя(ОрганизацияАгент, НаДату, Предупреждать);	
	Если Руководитель = Неопределено Тогда
		Возврат "";	
	КонецЕсли;
	Возврат уб_Кэшируемые.ФИОФизлицаСтрокой(Руководитель.ФизическоеЛицо, НаДату, ФИОКратко, Падеж);
	
КонецФункции

//Общ
Функция ДайПолФизлица(ФизЛицо, Предупреждать = Истина) Экспорт 
	
	Если ЗначениеНеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	ФизЛицоПол = ФизЛицо.Пол;
	ТипФизЛица = ТипЗнч(ФизЛицо);
	Если ФизЛицоПол = Перечисления.ПолФизическихЛиц.ПустаяСсылка() ИЛИ ФизЛицоПол = Неопределено Тогда
		Фрм = ФизЛицо.ПолучитьФорму();
		#Если Клиент Тогда
		Если Предупреждать И НЕ Фрм.Открыта() Тогда
			Если ТипФизЛица = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				Заг = "Необходимо указать пол контактного лица!";
				СОО = "Для контактного лица '" + Строка(ФизЛицо) + "' не указан пол.
				|
				|Зайдите в справочник контактных лиц и внесите необходимые данные.
				|
				|Открыть форму контактного лица?";
			Иначе
				Заг = "Необходимо указать пол физлица!";
				СОО = "Для физического лица '" + Строка(ФизЛицо) + "' не указан пол.
				|
				|Зайдите в справочник физлиц и внесите необходимые данные.
				|
				|Открыть форму физлица?";
			КонецЕсли;
			
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Фрм.Открыть();
				Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.Пол;
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	Возврат ФизЛицоПол;
	
КонецФункции

//Общ
Функция ДайПаспортныеДанныеФизлица(ФизЛицо, Предупреждать = Истина) Экспорт 
	
	Если ЗначениеНеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	ДанныеФизЛица = РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, Новый Структура("ФизЛицо", ФизЛицо));	
	#Если Клиент Тогда
	Если Предупреждать = Истина и ДанныеФизЛица.Количество() = 0 Тогда
		Фрм = ФизЛицо.ПолучитьФорму();
		Если НЕ Фрм.Открыта() Тогда
			Заг = "Необходимо указать все данные физ. лица!";
			СОО = "Не найдены паспортные данные физ. лица: '" + Строка(ФизЛицо)  + "' не заданы:
				|
				|Зайдите в справочник физлиц и внесите необходимые данные.
				|
				|Открыть форму физлица?";
			Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Фрм.Открыть();
				Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.Удостоверение;
				ДанныеФизЛица = РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, Новый Структура("ФизЛицо", ФизЛицо));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	Если ДанныеФизЛица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Возврат ДанныеФизЛица[0];
	
КонецФункции //

//Общ
Функция АдресПоПропискеФизлица(ФизЛицо, Предупреждать = Истина) Экспорт 
	
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	К.Объект,
	|	К.Тип,
	|	К.Вид,
	|	К.УИД,
	|	К.Представление,
	|	К.Поле1,
	|	К.Поле2,
	|	К.Поле3,
	|	К.Поле4,
	|	К.Поле5,
	|	К.Поле6,
	|	К.Поле7,
	|	К.Поле8,
	|	К.Поле9,
	|	К.Поле10,
	|	К.Комментарий,
	|	К.ЗначениеПоУмолчанию,
	|	К.ПользовательЛичногоКонтакта
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК К
	|ГДЕ
	|	К.Объект = &Объект
	|	И К.Вид = &Вид";	
	Запрос.УстановитьПараметр("Объект", ФизЛицо);
	Запрос.УстановитьПараметр("Вид", 	Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке);	
	Результат = Запрос.Выполнить();
	#Если Клиент Тогда
	Если Результат.Пустой() И Предупреждать Тогда
		Заг = "Необходимо указать Адрес по прописке физ. лица!";
		СОО = "Не найден Адрес по прописке физ. лица '" + Строка(ФизЛицо)  + "'
		|
		|Зайдите в справочник физлиц и внесите необходимые данные.
		|
		|Открыть форму физлица?";
		Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма = ФизЛицо.ПолучитьФорму();
			Форма.ЭлементыФормы.Панель1.ТекущаяСтраница = Форма.ЭлементыФормы.Панель1.Страницы.Дополнительно;
			Форма.ТекущийЭлемент 						= Форма.ЭлементыФормы.КонтактнаяИнформация;
			Форма.ТекущийЭлемент.ТекущаяКолонка 		= Форма.ТекущийЭлемент.Колонки.Представление;
			Форма.ТекущийЭлемент.ТекущаяСтрока 			= Форма.ТекущийЭлемент.Значение[3];
			Форма.ОткрытьМодально();
			Результат = Запрос.Выполнить();
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	Если Не Результат.Пустой() Тогда
		ТЗ = Результат.Выгрузить();
		Возврат ТЗ[0];
	КонецЕсли;
	
КонецФункции //

//Общ Получает пол и слово (в любом роде, но лучше в мужском). Ищет слово в словаре и, если находит, возвращает нужный род. 
Функция СклонениеСловаПоРоду(Пол, Слово) Экспорт
	
	//Словарь склонения слов по родам
	тзРод = Новый ТаблицаЗначений;
	тзРод.Колонки.Добавить("М");
	тзРод.Колонки.Добавить("Ж");
	тзРод.Колонки.Добавить("Д");
	НС = тзРод.Добавить(); НС.М = "зарегистрирован";	НС.Ж = "зарегистрирована"; 	НС.Д = "зарегистрирован(а)";
	НС = тзРод.Добавить(); НС.М = "передал"; 			НС.Ж = "передала"; 			НС.Д = "передал(а)";
	НС = тзРод.Добавить(); НС.М = "действующего"; 		НС.Ж = "действующей"; 		НС.Д = "действующего(ей)";
	НС = тзРод.Добавить(); НС.М = "действующий"; 		НС.Ж = "действующая"; 		НС.Д = "действующий(ая)";
	НС = тзРод.Добавить(); НС.М = "именуемый"; 			НС.Ж = "именуемая"; 		НС.Д = "именуемый(ая)";
	НС = тзРод.Добавить(); НС.М = "уважаемый"; 			НС.Ж = "уважаемая"; 		НС.Д = "уважаемый(ая)";
	НС = тзРод.Добавить(); НС.М = "сдал"; 				НС.Ж = "сдала"; 			НС.Д = "сдал(а)";
	НайденнаяСтрока = тзРод.Найти(Нрег(Слово));
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Слово;
	КонецЕсли;
	Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
		Результат = НайденнаяСтрока.М;
	ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
		Результат = НайденнаяСтрока.Ж;
	Иначе
		Результат = НайденнаяСтрока.Д;
	КонецЕсли;
	Возврат ТакойЖеРегистр(Слово, Результат);
	
КонецФункции

//Функция устанавливает такой же регистр 2-го слова, как и у эталона
Функция ТакойЖеРегистр(Эталон, Слово)
	
	Если Лев(Эталон,2) = ВРег(Лев(Эталон,2)) Тогда
		//Верхний регистр
		Возврат ВРег(Слово);
	ИначеЕсли Лев(Эталон,1) = ВРег(Лев(Эталон,1)) Тогда
		//Первая Заглавная
		Возврат ОбщегоНазначения.ПерваяЗаглавная(Слово);
	Иначе
		//Нижний регистр
		Возврат НРег(Слово);
	КонецЕсли;
	
КонецФункции

Функция ДайСловоЗависимоеОтПолаФизлица(Физлицо, Слово, Предупреждать = Истина) Экспорт 
	
	ТипФизЛицо = ТипЗнч(Физлицо);
	Если ТипФизЛицо = Тип("Строка") И Не ПустаяСтрока(Физлицо) Тогда
		Попытка 
			Компонента = Новый COMОбъект("Padeg.Declension");
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось подключить компоненту склонения для ФИО",,Истина,,,,"Не удалось подключить компоненту Padeg: " + ОписаниеОшибки());
			Компонента = Null;
		КонецПопытки;
		Если Компонента <> NULL Тогда
			iРод = Компонента.GetSex(Физлицо);
			Если iРод = 1 Тогда
				Пол = Перечисления.ПолФизическихЛиц.Мужской;
			ИначеЕсли iРод = 0 Тогда
				Пол = Перечисления.ПолФизическихЛиц.Женский;
			КонецЕсли;
		Иначе
			Пол = Неопределено;
		КонецЕсли;
	ИначеЕсли ТипФизЛицо = Тип("СправочникСсылка.КонтактныеЛица") И ЗначениеЗаполнено(Физлицо) Тогда
		Пол = ДайПолФизлица(Физлицо, Предупреждать);
	ИначеЕсли ТипФизЛицо <> Тип("СправочникСсылка.ФизическиеЛица") ИЛИ ЗначениеНеЗаполнено(Физлицо) Тогда
		Пол = Неопределено;	
	Иначе
		Пол = ДайПолФизлица(Физлицо, Предупреждать);
	КонецЕсли;
	Возврат СклонениеСловаПоРоду(Пол, Слово);
	
КонецФункции

Функция ДайСловоЗависимоеОтПолаРуководителя(ОрганизацияАгент, НаДату = Неопределено, Слово, Предупреждать = Истина) Экспорт 
	
	Руководитель = ДайРуководителя(ОрганизацияАгент, НаДату, Предупреждать);	
	Возврат ДайСловоЗависимоеОтПолаФизлица(Руководитель.ФизическоеЛицо, Слово, Предупреждать);
	
КонецФункции

Функция ДайНаименованиеКонтрагента(КонтрагентСсылка, НаДату = Неопределено, ФИОКратко = Ложь, Контрагент_ТипИмени = 1, Падеж = 1, Предупреждать = Истина) Экспорт 
	
	Тзч = ТипЗнч(КонтрагентСсылка);
	Если Контрагент_ТипИмени = Неопределено Тогда
		Контрагент_ТипИмени = 1;
	КонецЕсли;
	Если ФИОКратко = Неопределено Тогда
		ФИОКратко = Ложь;
	КонецЕсли;
	Если Тзч = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат уб_Кэшируемые.ФИОФизлицаСтрокой(КонтрагентСсылка, НаДату, ФИОКратко, Падеж);	
	ИначеЕсли Тзч = Тип("СправочникСсылка.Контрагенты") Тогда		
		Если КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Если Контрагент_ТипИмени = 1 Тогда
				КН = СокрЛП(КонтрагентСсылка.НаименованиеКраткое);
				КН = СокрЛП(КонтрагентСсылка.Наименование);
				КакоеНаименование = "краткое";
			ИначеЕсли Контрагент_ТипИмени = 2 Тогда
				КН = СокрЛП(КонтрагентСсылка.НаименованиеПолное);
				КакоеНаименование = "полное";
			Иначе
				КН = СокрЛП(КонтрагентСсылка.Наименование);
				КакоеНаименование = "";
			КонецЕсли;
			Если КН = "" Тогда
				Фрм = КонтрагентСсылка.ПолучитьФорму();
				#Если Клиент Тогда
				Если Предупреждать И НЕ Фрм.Открыта() Тогда
					Заг = "Необходимо указать " + КакоеНаименование + " наименование Контрагента!";
					СОО = "Для контрагента '" + КонтрагентСсылка.Наименование + "' не указано " + КакоеНаименование + " наименование
						|
						|Зайдите в справочник Контрагентов внесите необходимые данные.
						|
						|Открыть форму Контрагента?";
					Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						Фрм.Открыть();
						Если Контрагент_ТипИмени = 1 Тогда
							Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.НаименованиеКраткое;
						ИначеЕсли Контрагент_ТипИмени = 2 Тогда
							Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.НаименованиеПолное;
						Иначе
							Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.Наименование;
						КонецЕсли;						
						Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.НаименованиеКраткое;
					КонецЕсли;
				КонецЕсли;
				#КонецЕсли
			КонецЕсли;
			Возврат ФункцииРасширения.Должность_Склонение(КН, Падеж);
		Иначе
			ФизЛицо = КонтрагентСсылка.Физлицо;
			Если ЗначениеНеЗаполнено(Физлицо) Тогда
				Фрм = КонтрагентСсылка.ПолучитьФорму();
				#Если Клиент Тогда
				Если Предупреждать И НЕ Фрм.Открыта() Тогда
					Заг = "Необходимо связать Контрагента с физлицом!";
					СОО = "Контрагент '" + КонтрагентСсылка.Наименование + "' (тип ФизЛицо) не связан с физлицом" 
						+ Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС + "Зайдите в справочник Контрагентов внесите необходимые данные." 
						+ Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС + "Открыть форму Контрагента?";
					Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						Фрм.Открыть();
						Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.СвязанноеФизлицо;
					КонецЕсли;
				КонецЕсли;
				#КонецЕсли
			КонецЕсли;			
			Если Контрагент_ТипИмени = 1 Тогда
				Если КонтрагентСсылка.ЭтоИндивидуальныйПредприниматель Тогда
					Возврат "ИП """ + уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, НаДату, Истина, Падеж) + """";
				Иначе
					Возврат уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, НаДату, Истина, Падеж);	
				КонецЕсли;
			ИначеЕсли Контрагент_ТипИмени = 2 Тогда
				Если КонтрагентСсылка.ЭтоИндивидуальныйПредприниматель Тогда
					Рез = "Индивидуальный предприниматель """ + уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, НаДату, Ложь, Падеж) + """";	
				Иначе
					Возврат уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, НаДату, Ложь, Падеж);	
				КонецЕсли;
			Иначе
				Рез = КонтрагентСсылка.Наименование;
			КонецЕсли;
			Возврат ФункцииРасширения.Должность_Склонение(Рез, Падеж);		
		КонецЕсли;		
	ИначеЕсли Тзч = Тип("СправочникСсылка.Организации") Тогда
		Если КонтрагентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И НЕ КонтрагентСсылка.ЭтоИндивидуальныйПредприниматель Тогда
			Если Контрагент_ТипИмени = 1 Тогда
				Рез = уб_Кэшируемые.ФИОФизлицаСтрокой(КонтрагентСсылка.ИндивидуальныйПредприниматель, НаДату, Истина, Падеж);
			ИначеЕсли Контрагент_ТипИмени = 2 Тогда
				Рез = уб_Кэшируемые.ФИОФизлицаСтрокой(КонтрагентСсылка.ИндивидуальныйПредприниматель, НаДату, Ложь, Падеж);;
			Иначе
				Рез = КонтрагентСсылка.Наименование;
			КонецЕсли; 
		Иначе
			Если Контрагент_ТипИмени = 1 Тогда
				Рез = КонтрагентСсылка.НаименованиеДляДоговоровИПлатежныхДокументов;
			ИначеЕсли Контрагент_ТипИмени = 2 Тогда
				Рез = КонтрагентСсылка.НаименованиеПолное;
			Иначе
				Рез = КонтрагентСсылка.Наименование;
			КонецЕсли; 
		КонецЕсли;		
		Возврат ФункцииРасширения.Должность_Склонение(Рез, Падеж);
	КонецЕсли;	
	Возврат "";
	
КонецФункции

///////////////////////////////////////////////////////////////////////////
//     Функции получения параметров договоров
///////////////////////////////////////////////////////////////////////////

Функция ПолучитьПараметрДоговора_Тип_Строка(НаименованиеПараметра, Поставщик, ОрганизацияАгент, НаДату = Неопределено, Падеж = Неопределено
	, КоличествоПодчеркиванийЕслиНеУказан = 20) Экспорт
	
	ЗначениеПараметра = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, НаименованиеПараметра, Поставщик, ОрганизацияАгент);
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") И СокрЛП(ЗначениеПараметра) <> "" Тогда
		Если Падеж = Неопределено Тогда
			Возврат СокрЛП(ЗначениеПараметра);
		Иначе
			Возврат ФункцииРасширения.Должность_Склонение(ЗначениеПараметра, Падеж);
		КонецЕсли;
	КонецЕсли;	
	Прочерк = "";
	Для ч = 1 По КоличествоПодчеркиванийЕслиНеУказан Цикл
		Прочерк = Прочерк + "_";	  
	КонецЦикла;
	Возврат Прочерк;
	
КонецФункции

Функция Дай_ФИОЛицаКонтрагента(Поставщик, ОрганизацияАгент, НаДату = Неопределено, ФИОКратко, Падеж, КоличествоПодчеркиванийЕслиНеУказан = 40, Предупреждать = Истина) Экспорт
	
	ФизЛицоКонтрагента = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, "ЛицоПринципала", Поставщик, ОрганизацияАгент);	
	Если НЕ ЗначениеНеЗаполнено(ФизЛицоКонтрагента) Тогда
		Типз = ТипЗнч(ФизЛицоКонтрагента);
		Если Типз = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Возврат уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицоКонтрагента, НаДату, ФИОКратко, Падеж);
		ИначеЕсли Типз = Тип("Строка") Тогда	
			Возврат ФункцииРасширения.ФИО_Склонение(ФизЛицоКонтрагента, , , , , Падеж, ФИОКратко);
		КонецЕсли;
	КонецЕсли;	
	Прочерк = "";
	Для ч = 1 По КоличествоПодчеркиванийЕслиНеУказан Цикл
		Прочерк = Прочерк + "_";	  
	КонецЦикла;
	Возврат Прочерк;
	
КонецФункции

Функция Дай_ОснованиеДействияЛицаКонтрагента(Поставщик, ОрганизацияАгент, НаДату = Неопределено, КоличествоПодчеркиванийЕслиНеУказан = 20) Экспорт
	
	Возврат ПолучитьПараметрДоговора_Тип_Строка("ЛицоПринципала_ОснованиеДействия", Поставщик, ОрганизацияАгент, НаДату, ,КоличествоПодчеркиванийЕслиНеУказан);	
	
КонецФункции

Функция Дай_ДолжностьЛицаКонтрагента(Поставщик, ОрганизацияАгент, НаДату = Неопределено, Падеж = Неопределено, КоличествоПодчеркиванийЕслиНеУказан = 20) Экспорт
	
	Возврат ПолучитьПараметрДоговора_Тип_Строка("ЛицоПринципала_Должность", Поставщик, ОрганизацияАгент, НаДату, Падеж, КоличествоПодчеркиванийЕслиНеУказан);	
	
КонецФункции

//старая функция, но еще используется
Функция ДайОтветственноеЛицоКонтрагента(ОтветственноеЛицо, Контрагент, Организация, НаДату = Неопределено, Объект = Неопределено) Экспорт
	
	//Заготовка для будущей реализации функции, когда у контрагентов появится регистр ответственныых лиц так же как и у организаций
	//Пока что аргумент ОтветственноеЛицо - игнорируется	
	НС = СтруктураОтветственногоЛица();
	НС.Организация = Контрагент;
	НС.ОтветственноеЛицо = Неопределено;
	СтруктураПараметров = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, Неопределено, Контрагент, Организация, Объект);
	
	//ФизическоеЛицо = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, "ЛицоПринципала", Контрагент, Организация);
	ЗначениеЭлемента = Неопределено;
	ФизическоеЛицо = СтруктураПараметров.Свойство("ЛицоПринципала",ЗначениеЭлемента);
	Если ФизическоеЛицо = Неопределено Тогда
		Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ФизическоеЛицо = Контрагент.Физлицо;	
		КонецЕсли;
	КонецЕсли;
	НС.ФизическоеЛицо = ФизическоеЛицо;	
	Если Контрагент.ЭтоИндивидуальныйПредприниматель Тогда
		НС.Должность.НаименованиеКратко = "Индивидуальный Предприниматель";
		НС.Должность.Наименование = "Индивидуальный Предприниматель";
		НС.ОснованиеДействия = "Устав";
	Иначе
		//Должность = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, "ЛицоПринципала_Должность", Контрагент, Организация);
		Должность = СтруктураПараметров.Свойство("ЛицоПринципала_Должность",ЗначениеЭлемента);
		Если ЗначениеНеЗаполнено(Должность) Тогда
			//Сообщить("В регистре параметров договоров 
			//|отсутствует запись о должности ответственного лица (ЛицоПринципала_Должность) по договору между 
			//|организацией """ + Организация.Наименование + """ и контрагентом """ + Контрагент.Наименование + """ действующего на дату " + Формат(НаДату,"ДФ=dd.MM.yyyy") + ".",
			//СтатусСообщения.Внимание);	
		КонецЕсли;
		НС.Должность.НаименованиеКратко = Должность;
		НС.Должность.Наименование = Должность;
		//АгентОснованиеДействия = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, "ОргАгент_Доверенность", Контрагент, Организация);
		АгентОснованиеДействия = СтруктураПараметров.Свойство("ОргАгент_Доверенность",ЗначениеЭлемента);
		Если ЗначениеНеЗаполнено(АгентОснованиеДействия) Тогда
			//Сообщить("В регистре параметров договоров 
			//|отсутствует запись об основании действия ответственного лица (ЛицоПринципала_ОснованиеДействия) по договору между 
			//|организацией """ + Организация.Наименование + """ и контрагентом """ + Контрагент.Наименование + """ действующего на дату " + Формат(НаДату,"ДФ=dd.MM.yyyy") + ".",
			//СтатусСообщения.Внимание);	
		КонецЕсли;
		НС.АгентОснованиеДействия = АгентОснованиеДействия;
		//ОснованиеДействия = уб_СтраховойБрокер.ПолучитьПараметрДоговора(НаДату, "ЛицоПринципала_ОснованиеДействия", Контрагент, Организация);
		ОснованиеДействия = СтруктураПараметров.Свойство("ЛицоПринципала_ОснованиеДействия",ЗначениеЭлемента);
		Если ЗначениеНеЗаполнено(ОснованиеДействия) Тогда
			//Сообщить("В регистре параметров договоров 
			//|отсутствует запись об основании действия ответственного лица (ЛицоПринципала_ОснованиеДействия) по договору между 
			//|организацией """ + Организация.Наименование + """ и контрагентом """ + Контрагент.Наименование + """ действующего на дату " + Формат(НаДату,"ДФ=dd.MM.yyyy") + ".",
			//СтатусСообщения.Внимание);	
		КонецЕсли;
		НС.ОснованиеДействия = ОснованиеДействия;
	КонецЕсли;	
	Возврат НС;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////

Функция Дай_ТиповойНомер(Объект, ДобавлятьСистемныйНомер = Истина) Экспорт
	//
	//Ссылка = Объект.Ссылка;
	//Тзд = ТипЗнч(Ссылка);
	Ссылка = Объект;
	Тзд = ТипЗнч(Объект.Ссылка);
	//
	Если Тзд = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда 
		НомерОтчетаПоставщику = Ссылка.НомерОтчетаПоставщику;
		Номер = Ссылка.Номер;
		Возврат  ?(ДобавлятьСистемныйНомер,?(НомерОтчетаПоставщику <> "",НомерОтчетаПоставщику + " (" + Формат(Номер,"ЧГ=") + ")",Формат(Номер,"ЧГ=")), НомерОтчетаПоставщику);
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда 
		Возврат  ?(Ссылка.НомерДляОтчета <> "",Ссылка.НомерДляОтчета + " (" + Формат(Ссылка.Номер,"ЧГ=") + ")",Формат(Ссылка.Номер,"ЧГ="));
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_Доверенности") Тогда 
		Возврат  СокрЛП(?(ЗначениеЗаполнено(Ссылка.НомерДоверенности),Ссылка.НомерДоверенности,Формат(Ссылка.Номер,"ЧГ=")));	
	Иначе
		Если ТипЗнч(Ссылка.Номер) = Тип("Строка") Тогда 
			Возврат  СокрЛП(Ссылка.Номер);
		Иначе
			Возврат  Формат(Ссылка.Номер,"ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ДайСуммуЦифрамиИПрописью(Сумма) Экспорт	
	
	Возврат Формат(Сумма,"ЧЦ=14; ЧДЦ=2; ЧН=")+" руб. ("+ЧислоПрописью(Сумма,"Л = ru_RU; НП = Истина; ДП = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2")+")";
	
КонецФункции	

Функция ДайСуммуПрописью(Сумма) Экспорт	
	
	Возврат ЧислоПрописью(Сумма,"Л = ru_RU; НП = Истина; ДП = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
КонецФункции	

Функция ДайПериодПрописью(Количество, ЕдиницаИзмеренияСрокаДействия, ВозвращатьЦифру = Истина) Экспорт
	
	Если ЕдиницаИзмеренияСрокаДействия = Перечисления.уб_ЕдиницыИзмеренияСрокаДействия.День Тогда
		СрокПрописью = СокрЛП(Прав(ЧислоПрописью(Количество,"Л=ru_RU;НП=Истина;НД=Ложь;ДП=Ложь","день, дня, дней, м, , , , , 0"),4));
	ИначеЕсли	ЕдиницаИзмеренияСрокаДействия = Перечисления.уб_ЕдиницыИзмеренияСрокаДействия.Неделя Тогда
		СрокПрописью = СокрЛП(Прав(ЧислоПрописью(Количество,"Л=ru_RU;НП=Истина;НД=Ложь;ДП=Ложь","неделю, недели, недель, ж, , , , , 0"),6));
	ИначеЕсли	ЕдиницаИзмеренияСрокаДействия = Перечисления.уб_ЕдиницыИзмеренияСрокаДействия.Месяц Тогда
		Если Количество%10=1 и Количество<>11 тогда Отрезать = 5;Иначе Отрезать = 7;КонецЕсли;
		СрокПрописью = СокрЛП(Прав(ЧислоПрописью(Количество,"Л=ru_RU;НП=Истина;НД=Ложь;ДП=Ложь","месяц, месяца, месяцев, м, , , , , 0"),Отрезать));
	ИначеЕсли	ЕдиницаИзмеренияСрокаДействия = Перечисления.уб_ЕдиницыИзмеренияСрокаДействия.Год Тогда
		СрокПрописью = СокрЛП(Прав(ЧислоПрописью(Количество,"Л=ru_RU;НП=Истина;НД=Ложь;ДП=Ложь","год, года, лет, м, , , , , 0"),4));
	КонецЕсли;	
	Если ВозвращатьЦифру Тогда
		Возврат(строка(Количество) + " " + СрокПрописью);
	Иначе
		Возврат(СрокПрописью);
	КонецЕсли;
	
КонецФункции

Функция ДайЗаголовокДокументаПоставщику(Контекст) Экспорт	
	
	Объект = Контекст.Объект;	
	сНомер	= Дай_ТиповойНомер(Объект);
	сДата	= Формат(Объект.Дата,"ДФ=""dd.MM.yyyy 'г.'""");
	Тзд = ТипЗнч(Объект.Ссылка);	
	Если Тзд = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда 
		Заголовок = "Отчет для '" + Объект.Поставщик.НаименованиеКраткое + "' №" + сНомер + " от " + сДата + " от " 
		+ Объект.ОрганизацияАгент.НаименованиеДляДоговоровИПлатежныхДокументов + ".";
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда 
		Заголовок = "АКТ п-п №" + сНомер + " от " + сДата + ". Передает: " 
		+ Объект.ОрганизацияАгент.НаименованиеДляДоговоровИПлатежныхДокументов 
		+ ", принимает: " + Объект.Поставщик.НаименованиеКраткое;
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_СписаниеБСО") Тогда 
		Заголовок = "Списание БСО №" + сНомер + " от " + сДата + ".";
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_СписаниеБСО") Тогда 
		Заголовок = "Списание БСО №" + сНомер + " от " + сДата + ".";
	ИначеЕсли Тзд = Тип("ДокументСсылка.уб_Доверенности") Тогда 
		Заголовок = "Доверенность №" + сНомер + " от " + сДата + ".";
	Иначе
		Заголовок = Строка(Объект);
	КонецЕсли;	
	Возврат Заголовок;
	
КонецФункции	

/////////////////////////////////////////////////////////////////////////////////
//     ПРОЦЕССОРЫ ПОДСТАНОВОК 
/////////////////////////////////////////////////////////////////////////////////
 
//------------------------------------------------------------------------------
//     ПСП  : функции поддержки
//------------------------------------------------------------------------------

Процедура ДобавитьСвойствоВТЗ(ТЗ, ИмяСвойства, ОписаниеТипаСвойства = Неопределено,ЗначениеЗаполнения = Неопределено);
	
	Если ТЗ.Колонки.Найти(ИмяСвойства) = Неопределено Тогда
		ТЗ.Колонки.Добавить(ИмяСвойства, ОписаниеТипаСвойства);	
	Иначе
		Если НЕ ЗначениеЗаполнения  = Неопределено Тогда
			ТЗ.ЗаполнитьЗначения(ЗначениеЗаполнения,ИмяСвойства);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ДобавитьСвойствоВКонтейнер(Контейнер, ИмяСвойства, ЗначениеСвойства = Неопределено, ОписаниеТипаСвойства = Неопределено) Экспорт	
	
	Если ТипЗнч(Контейнер) = Тип("СтрокаТаблицыЗначений") Тогда
		ТЗ = Контейнер.Владелец();
		ДобавитьСвойствоВТЗ(ТЗ, ИмяСвойства, ОписаниеТипаСвойства);
		Контейнер[ИмяСвойства] = ЗначениеСвойства; 
	Иначе
		// структура
		Если Не Контейнер.Свойство(ИмяСвойства) Тогда
			Контейнер.Вставить(ИмяСвойства);
		КонецЕсли;
		Контейнер[ИмяСвойства] = ЗначениеСвойства;
	КонецЕсли;
		
КонецПроцедуры	

Процедура УстановитьТекущийКонтейнер(Контекст, ТипКонтейнера, СтрокаТЗ)
	отладка_Лог_НачалоПроцедуры(Контекст, "УстановитьТекущийКонтейнер");	
	
	Если ВРег(ТипКонтейнера) = "ДОКУМЕНТ" Тогда
		// TODO на всякий случай только для новой системы, потом убрать это условие
		// попробовать перейти на структуру на самом ранеем уровне
		Контекст.Контейнер_Документ = СтрокаТЗ;
	ИначеЕсли ВРег(ТипКонтейнера) = "ИТОГИ" Тогда
		Контекст.Контейнер_Итоги = СтрокаТЗ;
		Контекст.Контейнер = Контекст.Контейнер_Итоги;
	ИначеЕсли ВРег(ТипКонтейнера) = "СТРОКАТЧ" Тогда
		Контекст.Контейнер_СтрокаТЧ = СтрокаТЗ;
		Контекст.Контейнер 			= Контекст.Контейнер_СтрокаТЧ;
	Иначе
		//Порождаем ошибку, мимо которой не пройти
		Выполнить("Проверка = Контекст.Контейнер_"+ТипКонтейнера+";");		
		Перейти ~НаВыход;	
	КонецЕсли;
	ДобавитьСвойствоВКонтейнер(СтрокаТЗ, "Тип_", ВРег(ТипКонтейнера), ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(8));
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
КонецПроцедуры

Функция СтруктураКонтейнерДокументПоСтрокеТЗ(СтрокаТЗ)

	Результат = Новый Структура;
	ТЗ = СтрокаТЗ.Владелец;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, СтрокаТЗ);
	Возврат Результат;

КонецФункции // СтруктураКонтейнерДокументПоСтрокеТЗ()

//------------------------------------------------------------------------------
//     ПСП  : функции отладки
//------------------------------------------------------------------------------
	
Процедура отладка_Общее(Контекст)	
	Если Контекст.Отладка.Включена Тогда
		Если Контекст.ТекущаяОбластьТД = Неопределено Тогда
			Сообщить("Область '" + Контекст.ИмяТекущейОбластиТД + "' не найдена!");	
		КонецЕсли;
		//Показываем незадействованные места подстановки в режиме отладки
		ПараметрыОбластиПечати = Контекст.ТекущаяОбластьТД.Параметры;
		Для i = 0 По ПараметрыОбластиПечати.Количество() - 1 Цикл
			ПараметрыОбластиПечати.Установить(i, "#########################");	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры	

Процедура отладка_ПФ(Контекст, сОписаниеОшибки = "", СОО = "", Статус = Неопределено, Уровень = 0) Экспорт 
	
	//Процедура должна вызываться из всех мест, где могут возникать ошибки и несуразности
	//Результат выполнения функций заполнения параметра передается в параметр
	//в обычном режиме - результат
	//в режиме отладки - результат
	Если Контекст = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.БезСтатуса;	
		чСтатус = 0; //
	ИначеЕсли Статус = СтатусСообщения.Информация Тогда
		чСтатус = 1; //i
	//Результат выполнения функций заполнения параметра передается в параметр
	//в обычном режиме - результат
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Обычное Тогда
		чСтатус = 2; //>
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - пусто
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Внимание Тогда
		чСтатус = 3; //!
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - (### Ошибка! ###)
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Важное Тогда
		чСтатус = 4; //!!
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - (### Ошибка! ###)
	//в режиме отладки - ###########
	// + ОписаниеОшибки
	ИначеЕсли Статус = СтатусСообщения.ОченьВажное Тогда
		чСтатус = 5; //!!!
	КонецЕсли;	
	Контекст.Отладка.МаксСтатусОшибкиПриЗаполненииПараметра = Макс(Контекст.Отладка.МаксСтатусОшибкиПриЗаполненииПараметра, чСтатус);
	Если НЕ Контекст.Отладка.Включена Тогда
		Возврат;	
	КонецЕсли;	
	//Случай вызова не из процедуры заполнения параметров макета
	Если Контекст.Отладка.ТекущаяСтрокаПараметра = Неопределено Тогда
		Сообщить(СОО,Статус);
		Возврат;
	КонецЕсли;
	//Результат выполнения функций заполнения параметра передается в параметр
	//в обычном режиме - результат
	//в режиме отладки - результат
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.БезСтатуса;	
		чСтатус = 0; //
	ИначеЕсли Статус = СтатусСообщения.Информация Тогда
		чСтатус = 1; //i
	//Результат выполнения функций заполнения параметра передается в параметр
	//в обычном режиме - результат
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Обычное Тогда
		чСтатус = 2; //>
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - пусто
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Внимание Тогда
		чСтатус = 3; //!
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - (### Ошибка! ###)
	//в режиме отладки - ###########
	ИначеЕсли Статус = СтатусСообщения.Важное Тогда
		чСтатус = 4; //!!
	//Результат выполнения функций заполнения параметра НЕ передается в параметр
	//в обычном режиме - (### Ошибка! ###)
	//в режиме отладки - ###########
	// + ОписаниеОшибки
	ИначеЕсли Статус = СтатусСообщения.ОченьВажное Тогда
		чСтатус = 5; //!!!
	КонецЕсли;
	ТекСтрокаПараметра = Контекст.Отладка.ТекущаяСтрокаПараметра;
	ИмяПараметра = ТекСтрокаПараметра.Параметр;
	ИмяОбласти = ТекСтрокаПараметра.Область;
	ИмяООЯ = ТекСтрокаПараметра.ИмяООЯ;
	Свойство = Контекст.Отладка.ИмяТекущегоСвойства;
	ТипКонтейнера = Контекст.ОперативныйКонтейнер.Тип_;
	Табс25 = "																									";
	//Статусы Важное и ОченьВажное поступают из исключений
	Если Статус = СтатусСообщения.ОченьВажное Тогда
		СОО = СОО + ?(ЗначениеЗаполнено(СОО),Символы.ВК + Символы.ПС,"") + Лев(Табс25,Уровень + 1) + "Описание Ошибки: <" + ?(ЗначениеЗаполнено(сОписаниеОшибки),сОписаниеОшибки,"отсутствует") + ">";
	ИначеЕсли Статус = СтатусСообщения.Важное Тогда
		СОО = СОО + ?(ЗначениеЗаполнено(сОписаниеОшибки), Символы.ВК + Символы.ПС + Лев(Табс25,Уровень + 1) + "Описание Ошибки: <" + сОписаниеОшибки + ">","");
	КонецЕсли;
	Если ТекСтрокаПараметра.ЕстьКодЗаполнения Тогда
		Если ТекСтрокаПараметра.Параметр = кПризнакСвободногоКода() Тогда
			СОО = Лев(Табс25,Уровень + 1) + "Ошибка при выполнении свободного кода области '" + ИмяОбласти + "'";
		Иначе
			СОО = Лев(Табс25,Уровень + 1) + "Ошибка при выполнении кода заполнения параметра [" + ИмяПараметра + "] (область '" + ИмяОбласти + "')";
		КонецЕсли;
		СОО = СОО + Символы.ВК + Символы.ПС + Лев(Табс25,Уровень + 1) + "Описание Ошибки: <" + ?(ЗначениеЗаполнено(сОписаниеОшибки),сОписаниеОшибки,"отсутствует") + ">";
		СОО = СОО + Символы.ВК + Символы.ПС + Лев(Табс25,Уровень + 1) + "========= КОД =========" + Символы.ВК + Символы.ПС + ТекСтрокаПараметра.КодЗаполнения + Символы.ВК + Символы.ПС + "=======================" +Символы.ВК + Символы.ПС;	
	КонецЕсли;
	Преф = Символы.ВК + Символы.ПС + Лев(Табс25,Уровень + 1) + "0 "; //	 "? "
	СООКооодината = Преф + "Параметр: '" + ИмяОбласти + "' / '" + ИмяООЯ + "' / [" + ИмяПараметра + "]" 
	+ Преф + "Контейнер: '" + ТипКонтейнера + "', свойство: '" + Свойство + "'.";	
	СОО = Лев(Табс25,Уровень) + СОО + СООКооодината;
	//Раскраска ошибочных ячеек и установка примечания
	Обл = Контекст.ТекущаяОбластьТД.Область(ТекСтрокаПараметра.АдресЯчейкиВОбласти);
	Если чСтатус < 2 Тогда
		Цв = Новый Цвет(216, 255, 216);	// Светло-светло зеленый
	ИначеЕсли чСтатус = 2 Тогда
		Цв = Новый Цвет(252, 255, 200); // Светло-Желтый
	ИначеЕсли чСтатус = 3 Тогда
		Цв = Новый Цвет(243, 255, 115); // Желтый
	ИначеЕсли чСтатус = 4 Тогда
		Цв = Новый Цвет(255, 213, 213); // розовый
	ИначеЕсли чСтатус = 5 Тогда
		Цв = Новый Цвет(255, 150, 150); // красный
	КонецЕсли;
	Обл.ЦветФона = Цв;
	Обл.Примечание.Текст = Обл.Примечание.Текст + ?(ЗначениеЗаполнено(Обл.Примечание.Текст),Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС,"") + СОО;
	Обл.Примечание.АвтоРазмер = Ложь;
	Обл.Примечание.Ширина = 70;
	Обл.Примечание.Высота = СтрДлина(Обл.Примечание.Текст)/Обл.Примечание.Ширина * 9;
	Обл.ПараметрРасшифровки = ИмяООЯ;
	Контекст.ТекущаяОбластьТД.Параметры[ИмяООЯ] = Новый Структура("ГдеНайдено, Область, Параметр, Шаблон, СсылкаПФ" 
					,"Макет" 
					,ИмяООЯ 
					,ИмяПараметра 
					,"" 
					,Контекст.СсылкаПФ 
					);	
	Сообщить(СОО,Статус);	
	НС = Контекст.Отладка.ТЗОшибок.Добавить();
	НС.Область = ИмяОбласти;
	НС.Параметр = ИмяПараметра;
	НС.ИмяООЯ = ТекСтрокаПараметра.ИмяООЯ;
	НС.Свойство = Свойство;
	НС.ТипКонтейнера = ТипКонтейнера;
	НС.ОписаниеОшибки = сОписаниеОшибки;
	НС.СОО = СОО;
	НС.Статус = чСтатус;
		
КонецПроцедуры

Процедура отладка_Лог_НачалоПроцедуры(Контекст, ИмяПроцедуры) Экспорт
	
	Если Контекст = Неопределено ИЛИ НЕ Контекст.Отладка.Лог = Истина Тогда
		Возврат;	
	КонецЕсли;
	УВ = Контекст.Отладка.УовеньВложенностиПроцедуры + 1;
	Табс25 = "																									";
	Сообщить(Символ(9553) + Лев(Табс25,УВ) + ИмяПроцедуры);	
	Контекст.Отладка.УовеньВложенностиПроцедуры = УВ;
	
КонецПроцедуры	

Процедура отладка_Лог_КонецПроцедуры(Контекст) Экспорт
	
	Если НЕ Контекст.Отладка.Лог Тогда
		Возврат;	
	КонецЕсли;
	Контекст.Отладка.УовеньВложенностиПроцедуры = Контекст.Отладка.УовеньВложенностиПроцедуры - 1;
	
КонецПроцедуры	

//Эта процедура используется в режиме разработки и тестирования печати
//Если параметр сеанса уб_отладка_ПечататьТЕСТМакет пеерключен в ИСТИНУ,
//то в качестве макета, вместо макета из справочника,
//используется общий макет с именем "ТЕСТ", а вместо кода 
//из справочника запускается код процедуры ПечатьТЕСТ().
//
//Переключить параметр сеанса уб_отладка_ПечататьТЕСТМакет можно в Предприятии 
//в пункте меню SS -> Настройка параметров отладки
Процедура ОтладкаПечати(Контекст) Экспорт
	
	Инициализировать_данными_КонтекстПечати(Контекст, ПолучитьОбщийМакет("ТЕСТ"));
	ПечатьТЕСТ(Контекст);
	#Если Клиент Тогда
	Предупреждение("Печать тестового макета!",5);	
	#КонецЕсли

КонецПроцедуры	

//Предполагается, что при отладке в тело процедуры копируется код из справочника.
//Это позволяет поставить в нем точки останова и произвести отладку
Процедура ПечатьТЕСТ(Контекст) Экспорт
	// 	
	Сообщить("Привет из модуля уб_ПФ, процедуры ПечатьТЕСТ))");
	
КонецПроцедуры	

//------------------------------------------------------------------------------
//     Инициализация контекста
//------------------------------------------------------------------------------

Функция ИнициализироватьКонтекстПечати(Контекст = Неопределено) Экспорт
	
	//Формируем образ структуры контекста
	КТЕМП = Новый Соответствие();
	КТЕМП.Вставить("МассивОбъектов");
	КТЕМП.Вставить("Объект");
	КТЕМП.Вставить("Макет");
	КТЕМП.Вставить("ТЧДокумента");
	КТЕМП.Вставить("СсылкаПФ");
	КТЕМП.Вставить("СтруктураОбъектаПФ");//КТЕМП.Вставить("ОбъектПФ");	
	КТЕМП.Вставить("Контейнер_Документ");
	КТЕМП.Вставить("Контейнер_Итоги");
	КТЕМП.Вставить("Контейнер_СтрокаТЧ");
	КТЕМП.Вставить("ТекущаяОбластьТД");
	КТЕМП.Вставить("ИмяТекущейОбластиТД");	
	//Текущий контейнер, из которго по умолчанию заполняется обрабатываемая область
	КТЕМП.Вставить("Контейнер"); 
	//Оперативный контейнер - из которого заполняется конкретный параметр. 
	//При начале заполнения парамера равно текущему контейнеру, 
	//но может переключаться модификаторами Док() и Итог()   
	КТЕМП.Вставить("ОперативныйКонтейнер"); 
	КТЕМП.Вставить("ИспользоватьСохраненныеНастройкиПечати", Истина);
	КТЕМП.Вставить("ПовторятьШапкуТаблицыПриПечати", Истина);
	КТЕМП.Вставить("КоличествоСтрокПовторенияШапкиТЧ", 0); //0 - повторять вcю область ШапкаТаб 
	КТЕМП.Вставить("ПоказыватьЗаголовокДокументаВКолонтитле", Истина);
	//ТОДО Переименовать с СохранятьПараметрыПечатиИзДиалогаПечати
	КТЕМП.Вставить("АвтоУстанавливатьИмяПараметровПечати", Истина);
	КТЕМП.Вставить("ИмяПараметровПечати", "");
	КТЕМП.Вставить("ИмяМакета", "_неизвестный_макет_");
	КТЕМП.Вставить("ФиксацияСверху", Ложь);
	КТЕМП.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
	КТЕМП.Вставить("Итоги", Неопределено);
	КТЕМП.Вставить("ДФ_Полный_месяц_год","ДФ=""dd MMMM yyyy'г.'""");
	КТЕМП.Вставить("ДФ_Полный_год","ДФ=""dd.MM.yyyy'г.'""");
	КТЕМП.Вставить("ДФ_Полный","ДФ=dd.MM.yyyy");
	КТЕМП.Вставить("ДФ_Кратко","ДФ=dd.MM.yy");
	КТЕМП.Вставить("ЧФ","ЧЦ=14; ЧДЦ=2; ЧН=");	
	// параметры табличного документа по умолчанию
	КТЕМП.Вставить("ОтображатьЗаголовки", Истина);
	КТЕМП.Вставить("ОтображатьСетку", Ложь);
	КТЕМП.Вставить("ТолькоПросмотр", Ложь);
	КТЕМП.Вставить("КоличествоЭкземпляров", 2);
	КТЕМП.Вставить("РазборПоКопиям", Истина);
	КТЕМП.Вставить("ОриентацияСтраницы", ОриентацияСтраницы.Ландшафт);
	КТЕМП.Вставить("АвтоМасштаб", Истина);	
	КТЕМП.Вставить("ВыводитьВерхнийКолонтитл", Истина);
	КТЕМП.Вставить("ВыводитьНижнийКолонтитл", Истина);
	//Дополнительные параметры:
	//РазрешенныеТипыБСО. Используется для передачи БСО Поставщику
	//Присутствует в контексте всегда. Если список пуст, то считается, что разрешены все БСО
	//Если не пуст, то разрешены только перечисленные
	КТЕМП.Вставить("РазрешенныеТипыБСО", Новый СписокЗначений());
	КТЕМП.Вставить("СохранятьПФВФайл", Ложь);
	//Дополнительные праметры контекста
	КТЕМП.Вставить("Предупреждать", Ложь);
	КТЕМП.Вставить("Падеж", 1);
	КТЕМП.Вставить("ОрганизацияАгент");
	КТЕМП.Вставить("ЛицоНаше");	
	КТЕМП.Вставить("Поставщик");
	КТЕМП.Вставить("ЛицоИх");
	КТЕМП.Вставить("ИмяОбъекта");
	КТЕМП.Вставить("ЭтоИсторияОП");
	КТЕМП.Вставить("ОплатыСписок");
	//Структура контекста уже может быть передана
	//Это происходит в режиме групповой отладки.
	//В этом режиме нужно вызвать процедуру "Печать" из модуля объекта документа с контекстом, 
	//в котором нужным образом проинициализированы параметры отладки до вызова процедуры "Печать".
	//Но внутри функции происходи вызов процедуры инициализации контекста (этой)
	//Что бы при вызове процедуры инициализации контекста не произошел сброс установленных параметров отладки
	//проверим, какой сейчас режим. И, если режим группповой отладки, то сначала сохраним данные контекста, 
	//а потом восстановим:
	Если ТипЗнч(Контекст) <> Тип("Структура") Тогда 
		Контекст = Новый Структура();
	КонецЕсли;	
	Если Контекст.Свойство("Отладка") И Контекст.Отладка.Групповая Тогда 
		СтруктураОтладка = Контекст.Отладка;
	Иначе
		СтруктураОтладка = Новый Структура();
		СтруктураОтладка.Вставить("Включена", ПараметрыСеанса.уб_отладка_Печать);
		СтруктураОтладка.Вставить("ТекущаяСтрокаПараметра");
		СтруктураОтладка.Вставить("Групповая", Ложь);
		СтруктураОтладка.Вставить("НеПоказыватьРезультатПечати", Ложь);
		СтруктураОтладка.Вставить("МаксКоличествоОшибок", 100);
		СтруктураОтладка.Вставить("МаксКоличествоПФ", 10);
		СтруктураОтладка.Вставить("МаксКоличествоСтрокТЧ", 1);
		СтруктураОтладка.Вставить("МаксСтатусОшибкиПриЗаполненииПараметра", 1); 
		//В течении заполнения параметра накручивается и принимает максимальное значение из всех произошедших ошибок.
		//В начале заполнения очередного параметра - сбрасывается в 0;
		СтруктураОтладка.Вставить("Лог", Ложь);
		СтруктураОтладка.Вставить("УовеньВложенностиПроцедуры", 0);
		//Динамические свойства, изменяющиеся по ходу заполнения макета
		СтруктураОтладка.Вставить("ИмяТекущегоСвойства"); //Имя свойства, обрабатываемого в данный момент при заполнении параметра
	КонецЕсли;
	ТЗОшибок = Новый ТаблицаЗначений;
	ТЗОшибок.Колонки.Добавить("Область");
	ТЗОшибок.Колонки.Добавить("Параметр");
	ТЗОшибок.Колонки.Добавить("ИмяООЯ");
	ТЗОшибок.Колонки.Добавить("Свойство");
	ТЗОшибок.Колонки.Добавить("ТипКонтейнера");
	ТЗОшибок.Колонки.Добавить("ОписаниеОшибки");
	ТЗОшибок.Колонки.Добавить("СОО");
	ТЗОшибок.Колонки.Добавить("Статус");
	СтруктураОтладка.Вставить("ТЗОшибок", ТЗОшибок);	
	КТЕМП.Вставить("Отладка", СтруктураОтладка);
	//добавляем в контекст ТабПФ (ранее была переменной объекта печатаемого документа)
	КТЕМП.Вставить("ТабПФ", 			Новый ТаблицаЗначений);
	КТЕМП.Вставить("ЭтоПФСубагент", 	Ложь);
	КТЕМП.Вставить("ПроцентСубагента",	0);
	КТЕМП.Вставить("Субагент",			Справочники.Контрагенты.ПустаяСсылка());
	//Дозаполняем контекст параметрами, которых там еще нет. Существующие не трогаем.
	Для Каждого КлючЗнач Из КТЕМП Цикл
		Если НЕ Контекст.Свойство(КлючЗнач.Ключ) Тогда
			Контекст.Вставить(КлючЗнач.Ключ, КлючЗнач.Значение);
		КонецЕсли;
	КонецЦикла;
	Если Не Контекст.Свойство("Показатели") Тогда
		Структура = Новый Структура;
		ТЗПоказателей = Новый ТаблицаЗначений;
		ТЗПоказателей.Колонки.Добавить("ИмяПоказателя");
		Структура.Вставить("ТЗПоказателей", ТЗПоказателей);
		Контекст.Вставить("Показатели", Структура);
	КонецЕсли;
	Возврат Контекст;
	
КонецФункции

Процедура Инициализировать_данными_КонтекстПечати(Контекст, Макет = Неопределено) Экспорт
	отладка_Лог_НачалоПроцедуры(Контекст, "Инициализировать_данными_КонтекстПечати");	
	
	СсылкаПФ = Контекст.СтруктураОбъектаПФ;//СсылкаПФ = Контекст.ОбъектПФ;
	
	Если Макет = Неопределено Тогда
		Контекст.Макет = СсылкаПФ.МакетШаблона.Получить();
	Иначе
		Контекст.Макет = Макет;
	КонецЕсли;
	
	Если НЕ СсылкаПФ.ПП_ИспользоватьКоличествоЭкземпляровПоУмолчанию Тогда
		Контекст.КоличествоЭкземпляров = СсылкаПФ.ПП_КоличествоЭкземпляров;
	КонецЕсли;
	
	Если НЕ СсылкаПФ.ПП_ИспользоватьОриентациюСтраницыПоУмолчанию Тогда
		Контекст.ОриентацияСтраницы = ?(СсылкаПФ.ПП_Ориентация_Страницы = Истина,ОриентацияСтраницы.Портрет,ОриентацияСтраницы.Ландшафт);
	КонецЕсли;
	
	Контекст.ИспользоватьСохраненныеНастройкиПечати		= СсылкаПФ.ПП_ИспользоватьСохраненныеНастройкиПечати;
	Контекст.АвтоУстанавливатьИмяПараметровПечати		= СсылкаПФ.ПП_АвтоСохранятьНастройкиПечати;
	
	Контекст.ПовторятьШапкуТаблицыПриПечати				= СсылкаПФ.ПП_ПовторятьШапкуТаблицыПриПечати;
	Контекст.КоличествоСтрокПовторенияШапкиТЧ			= СсылкаПФ.ПП_КоличествоСтрокПовторенияШапкиТЧ;
	Контекст.ПоказыватьЗаголовокДокументаВКолонтитле	= СсылкаПФ.ПП_ПоказыватьЗаголовокДокументаВКолонтитле;
	Контекст.ВыводитьВерхнийКолонтитл					= СсылкаПФ.ПП_ВыводитьВерхнийКолонтитл;
	Контекст.ВыводитьНижнийКолонтитл					= СсылкаПФ.ПП_ВыводитьНижнийКолонтитл;
	Контекст.АвтоМасштаб								= СсылкаПФ.ПП_АвтоМасштаб;
	Попытка
		КонтекстСохранятьПФВФайл 							= ?(ТипЗнч(Контекст.СохранятьПФВФайл) = Тип("Флажок"),Контекст.СохранятьПФВФайл.Значение,Контекст.СохранятьПФВФайл);
	Исключение
		КонтекстСохранятьПФВФайл = Ложь;
	КонецПопытки;	
	Контекст.СохранятьПФВФайл							= СсылкаПФ.ПП_СохранятьПФВФайл ИЛИ (КонтекстСохранятьПФВФайл = Истина);
	// №№№№№  Контейнер Итогов   №№№№	
	ТЗКонтейнер_Итоги = Новый ТаблицаЗначений; 
	Контекст.Контейнер_Итоги = ТЗКонтейнер_Итоги.Добавить();		
	// Свойство, хранящее тип контейнера 
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "Тип_", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(8));
	Контекст.Контейнер_Итоги.Тип_ = "ИТОГИ";
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "НомерТекущейСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(5),0);
	//Для группировок:
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущаяСК");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийВидБСО");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийПоставщик");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийОрганизацияАгент");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийСтраховойПродукт");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийВидСП");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Итоги, "ТекущийДокумент");
	// №№№№№  Контейнер Свойств Документа   №№№№
	ТЗКонтейнер_Документ = Новый ТаблицаЗначений;
	Контекст.Контейнер_Документ = ТЗКонтейнер_Документ.Добавить();
	Для Каждого Реквизит из Контекст.Объект.Метаданные().Реквизиты Цикл
		ТЗКонтейнер_Документ.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
		Контекст.Контейнер_Документ[Реквизит.Имя] = Контекст.Объект[Реквизит.Имя]; 	
	КонецЦикла;
	Если Контекст.Свойство("ЭтоПФСубагент") И Контекст.ЭтоПФСубагент Тогда
		// меняем типы колонок и значения данных
		Колонка = ТЗКонтейнер_Документ.Колонки.Найти("Поставщик");
		ТЗКонтейнер_Документ.Колонки.Удалить(Колонка);
		Колонка = ТЗКонтейнер_Документ.Колонки.Найти("ОрганизацияАгент");
		ТЗКонтейнер_Документ.Колонки.Удалить(Колонка);
		ТЗКонтейнер_Документ.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТЗКонтейнер_Документ.Колонки.Добавить("ОрганизацияАгент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Контекст.Контейнер_Документ.Поставщик 			= Контекст.Объект.ОрганизацияАгент;
		Контекст.Контейнер_Документ.ОрганизацияАгент 	= Контекст.Субагент;
	КонецЕсли;
	// Свойство, хранящее тип контейнера 
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "Тип_", "ДОКУМЕНТ", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(8));
	//Даты и Номера нет в реквизитах	
	ДлинаНомера = Контекст.Объект.Метаданные().ДлинаНомера;
	Если Строка(Контекст.Объект.Метаданные().ТипНомера) = "Число" Тогда
		ОписТипаНом = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(ДлинаНомера);
	Иначе
		ОписТипаНом = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(ДлинаНомера);
	КонецЕсли;
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "Дата", Контекст.Объект.Дата, ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "Номер", Контекст.Объект.Номер, ОписТипаНом);	
	//ТОДО  перессмотреть, возможно уйти от этих свойств в Контексте - они есть в контейнере документа и в объекте.
	// а в коде и при формировании имен параметров мы всегда занем, что у нас есть в документе.
	
	//Добавляем искусственные свойства
	//Требуется для корректной отработки функции заполнения параметров макета
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Документ, "ЛицоНаше");
	ДобавитьСвойствоВТЗ(ТЗКонтейнер_Документ, "ЛицоИх");
	//Инициализируем переменные контекста, характерные для документов с поставщиками и оргагентами
	бЕстьПоставщик = ОбщегоНазначения.ЕстьРеквизит("Поставщик", Контекст.Объект);
	бЕстьОргАгент = ОбщегоНазначения.ЕстьРеквизит("ОрганизацияАгент", Контекст.Объект);
	Если Контекст.Свойство("ЭтоПФСубагент") И Контекст.ЭтоПФСубагент Тогда
		Контекст.Поставщик 			= ?(бЕстьОргАгент, Контекст.Объект.ОрганизацияАгент, Справочники.Организации.ПустаяСсылка());
		Контекст.ОрганизацияАгент   = Контекст.Субагент;
	Иначе
		Контекст.Поставщик = ?(бЕстьПоставщик, Контекст.Объект.Поставщик, Справочники.Контрагенты.ПустаяСсылка());
		Контекст.ОрганизацияАгент = ?(бЕстьОргАгент, Контекст.Объект.ОрганизацияАгент, Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	ОтвЛицо_Руководитель = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	Если бЕстьОргАгент Тогда
		Контекст.Контейнер_Документ.ЛицоНаше = ДайРуководителя(Контекст.ОрганизацияАгент, Контекст.Объект.Дата, Контекст.Предупреждать);
		Контекст.ЛицоНаше = Контекст.Контейнер_Документ.ЛицоНаше;
	КонецЕсли;
	Если бЕстьПоставщик Тогда
		Контекст.Контейнер_Документ.ЛицоИх = ДайОтветственноеЛицоКонтрагента(ОтвЛицо_Руководитель, Контекст.Поставщик, Контекст.ОрганизацияАгент, Контекст.Объект.Дата, Контекст.Объект);
		Контекст.ЛицоИх = Контекст.Контейнер_Документ.ЛицоИх;
	КонецЕсли;
    ////////////////////////////////////////////////////////////////////
	//Контекст.Контейнер_Документ = СтруктураКонтейнерДокументПоСтрокеТЗ(Контекст.КонтейнерДокумент)
	Контекст.ТекущаяОбластьТД = Контекст.Макет;
	Контекст.ИмяТекущейОбластиТД = "#";
	отладка_Общее(Контекст);
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

Функция КлонироватьКонтекст(Контекст) Экспорт
	
	Клон = Новый Структура();
	Для Каждого Эл из Контекст Цикл
		Клон.Вставить(Эл.Ключ,Эл.Значение);
	КонецЦикла;
	Возврат Клон;
	
КонецФункции

//Получает область макета и выполняет функцию отладки
Функция ПолучитьОбласть(Контекст, ИмяОбласти, Макет = Неопределено) Экспорт
	отладка_Лог_НачалоПроцедуры(Контекст, "ПолучитьОбласть ('" + ИмяОбласти + "')");	
	
	Если Макет = Неопределено Тогда
		Макет = Контекст.Макет;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяОбласти) Тогда
		ИмяОбласти = "#";
	КонецЕсли;
	
	Если ИмяОбласти = "#" Тогда
		ТекущаяОбластьТД = Макет;
	Иначе
		Если Макет.Области.Найти(ИмяОбласти) <> Неопределено Тогда
			ТекущаяОбластьТД = Макет.ПолучитьОбласть(ИмяОбласти);
		Иначе
			ТекущаяОбластьТД = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Контекст.ТекущаяОбластьТД = ТекущаяОбластьТД;
	Контекст.ИмяТекущейОбластиТД = ИмяОбласти;
	отладка_Общее(Контекст);
	
	отладка_Лог_КонецПроцедуры(Контекст);	

	Возврат ТекущаяОбластьТД;
КонецФункции	

//******************************************************************************
//     Функции, вызываемые из модуля объекта
//******************************************************************************

//******************************************************************************
//     ПСП 2-й УРОВЕНЬ детализации
//******************************************************************************

//Заполняет заданную область значениями параметров и вываодит в результат (Стандартный набор параметров)
Функция ПСП(Контекст, ИмяОбласти, Предупреждать = Истина, Макет = Неопределено, ОсновнойКонтейнер = "ДОКУМЕНТ") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП (Область: '" + ИмяОбласти + "', Котейнер: '" + ОсновнойКонтейнер + "')");	
	Если Предупреждать Тогда
		//все предупреждения только на отдел БСО
		Предупреждать = ПараметрыСеанса.уб_ОсновноеПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО
	КонецЕсли;
	Область = ПолучитьОбласть(Контекст, ИмяОбласти, Макет);
	Если Область = Неопределено Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	ПСП_ДокументовДляПоставщика(Контекст, Предупреждать, ОсновнойКонтейнер);
	
	Если Контекст.ИмяОбъекта = "уб_ЗаявкаНаПечать" Тогда		
		ТЗГрупп = Неопределено;
		
		ЗаполнитьВспомогательныеМассивы(ТЗГрупп);
		Для Каждого СтрокаТЗ Из ТЗГрупп Цикл
			ПрерватьЦикл = Ложь;
			Если СтрокаТЗ.Тип <> "" Тогда
				Для Каждого ОбластьМакета Из Макет.Области Цикл
					Если ТипЗнч(ОбластьМакета) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
						_Область = Макет.ПолучитьОбласть(ОбластьМакета.Имя);
						Для Каждого Рисунок Из _Область.Рисунки Цикл
							Если СтрокаТЗ.БратьЗначениеИзРисунка = Рисунок.Имя Тогда
								СтрокаТЗ.Значение 			= Рисунок[СтрокаТЗ.Тип];
								СтрокаТЗ.ЗначениеЗаполнено  = Истина;
								ПрерватьЦикл = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если ПрерватьЦикл Тогда
						Прервать
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;

		ЛинияНетЛинии = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		Для Каждого Рисунок Из Область.Рисунки Цикл
			Если Лев(Рисунок.Имя, 10) = "Скрываемое" Тогда
				Рисунок.ВыводитьНаПечать = ЛОЖЬ;
			КонецЕсли;	
			//	//СкрываемыеЭлементыФормы.Добавить(Рисунок);
			//Иначе	
				Если Рисунок.ТипРисунка = ТипРисункаТабличногоДокумента.Текст Тогда
					
					//Если Не Рисунок.Имя = "скрСерия" Тогда
						
						Рисунок.Линия = ЛинияНетЛинии;
						Для Каждого СтрокаТЗ Из ТЗГрупп Цикл
							Для Каждого ИмяРисунка Из СтрокаТЗ.Массив Цикл
								Если ИмяРисунка = Рисунок.Имя Тогда
									Если СтрокаТЗ.ЗначениеЗаполнено Тогда
										Рисунок[СтрокаТЗ.Тип] = СтрокаТЗ.Значение;
									Иначе
										//аа = 12;
									КонецЕсли;
									Рисунок.Верх = Рисунок.Верх + СтрокаТЗ.Верх;
									Рисунок.Лево = Рисунок.Лево + СтрокаТЗ.Лево;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					//Иначе
					//	;
					//КонецЕсли;
                    ВремСтрока = ""+Рисунок.Текст;
					СвойствоИлиМассив = ПолучитьМассивФункций(Контекст, ВремСтрока);
					//Возвращает строку, если это просто параметр, или массив, 
					//в котором первый элемент Имя функции, 
					//последующие параметры элемент значение параметра,
					//если параметром является функция, то возвращается массив с аналогичной структурой элементов
					ТипЗнчСвойствоИлиМассивСтрока = ТипЗнч(СвойствоИлиМассив) = Тип("Строка");
					                                         
					//Если Рисунок.Имя = "ДатаЗаполненияЗаявленияГод2" тогда
					//	Рисунок.Параметр = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, СвойствоИлиМассив, ТипЗнчСвойствоИлиМассивСтрока);
					//КонецЕсли;
					
					Рисунок.Параметр = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, СвойствоИлиМассив, ТипЗнчСвойствоИлиМассивСтрока);
				КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
		ЭтоЗаявлениеОСАГО = Контекст.СтруктураОбъектаПФ.Наименование = "Заявление ОСАГО";
		Если ЭтоЗаявлениеОСАГО Тогда
			ДопТекст 		= "ВидИспользованияТС";
			СЗ = Новый СписокЗначений;
			СЗ.Добавить("Личное");
			СЗ.Добавить("Учебная");
			СЗ.Добавить("Такси");
			СЗ.Добавить("ДорожныеИСпециальныеТС", "Дорожные и специальные ТС");
			СтрокаСЗ = НайтиЭлементСпискаПоПредставлению2(СЗ, Контекст.ДанныеЗаявки.ВидИспользованияТС);
			Если СтрокаСЗ = Неопределено Тогда
				ВидИспользованияТС = "Прочее";
			Иначе
				ВидИспользованияТС = СтрокаСЗ.Значение;
			КонецЕсли;
			Область.Области[ДопТекст + ВидИспользованияТС].Шрифт = Новый Шрифт(Область.Области[ДопТекст + ВидИспользованияТС].Шрифт,,,,, Истина);
			ДопТекст = ДопТекст + "Аренда";
			СЗ = Новый СписокЗначений;
			СЗ.Добавить("Аренда");
			СЗ.Добавить("Прочее");
			СтрокаСЗ = НайтиЭлементСпискаПоПредставлению2(СЗ, Контекст.ДанныеЗаявки.ВидИспользованияТС);
			Если СтрокаСЗ = Неопределено Тогда
				ВидИспользованияТС = "Прочее";
			Иначе
				ВидИспользованияТС = СтрокаСЗ.Значение;
			КонецЕсли;
			Область.Области[ДопТекст + ВидИспользованияТС].Шрифт = Новый Шрифт(Область.Области[ДопТекст + ВидИспользованияТС].Шрифт,,,,, Истина);				
		КонецЕсли;
	КонецЕсли;
	
	Контекст.ТабличныйДокумент.Вывести(Область);
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);
	
	Возврат Область;
КонецФункции

Процедура ЗаполнитьВспомогательныеМассивы(ТЗГрупп)
		ТЗГрупп = Новый ТаблицаЗначений;
		ТЗГрупп.Колонки.Добавить("Массив", 					Новый ОписаниеТипов("Массив"));
		ТЗГрупп.Колонки.Добавить("Тип",						Новый ОписаниеТипов("Строка")); // если не заполнено, выравнивание не происходит
		ТЗГрупп.Колонки.Добавить("Значение",				Новый ОписаниеТипов("Число"));
		ТЗГрупп.Колонки.Добавить("ЗначениеЗаполнено",   	Новый ОписаниеТипов("Булево"));
		ТЗГрупп.Колонки.Добавить("БратьЗначениеИзРисунка",	Новый ОписаниеТипов("Строка"));
		// сдвиг группы картинок
		ТЗГрупп.Колонки.Добавить("Верх",					Новый ОписаниеТипов("Число"));
		ТЗГрупп.Колонки.Добавить("Лево",					Новый ОписаниеТипов("Число"));
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Часов1");
		Массив.Добавить("Часов2");
		Массив.Добавить("Минут1");
		Массив.Добавить("Минут2");
		Массив.Добавить("НачалоДействия111");
		Массив.Добавить("НачалоДействия112");
		Массив.Добавить("НачалоДействия113");
		Массив.Добавить("НачалоДействия114");
		Массив.Добавить("НачалоДействия115");
		Массив.Добавить("НачалоДействия116");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка = Массив[0];
		СтрокаТЗ.Верх = 0;
		СтрокаТЗ.Лево = 0;
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("НачалоДействия11");
		Массив.Добавить("НачалоДействия12");
		Массив.Добавить("НачалоДействия13");
		Массив.Добавить("НачалоДействия14");
		Массив.Добавить("НачалоДействия15");
		Массив.Добавить("НачалоДействия16");
		Массив.Добавить("НачалоДействия21");
		Массив.Добавить("НачалоДействия22");
		Массив.Добавить("НачалоДействия23");
		Массив.Добавить("НачалоДействия24");
		Массив.Добавить("НачалоДействия25");
		Массив.Добавить("НачалоДействия26");
		Массив.Добавить("ОкончаниеДействия11");
		Массив.Добавить("ОкончаниеДействия12");
		Массив.Добавить("ОкончаниеДействия13");
		Массив.Добавить("ОкончаниеДействия14");
		Массив.Добавить("ОкончаниеДействия15");
		Массив.Добавить("ОкончаниеДействия16");
		Массив.Добавить("ОкончаниеДействия21");
		Массив.Добавить("ОкончаниеДействия22");
		Массив.Добавить("ОкончаниеДействия23");
		Массив.Добавить("ОкончаниеДействия24");
		Массив.Добавить("ОкончаниеДействия25");
		Массив.Добавить("ОкончаниеДействия26");
		
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка = Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("НачалоДействия31");
		Массив.Добавить("НачалоДействия32");
		Массив.Добавить("НачалоДействия33");
		Массив.Добавить("НачалоДействия34");
		Массив.Добавить("НачалоДействия35");
		Массив.Добавить("НачалоДействия36");
		Массив.Добавить("ОкончаниеДействия31");
		Массив.Добавить("ОкончаниеДействия32");
		Массив.Добавить("ОкончаниеДействия33");
		Массив.Добавить("ОкончаниеДействия34");
		Массив.Добавить("ОкончаниеДействия35");
		Массив.Добавить("ОкончаниеДействия36");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка = Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер1");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер2");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер3");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер4");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер5");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер6");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер7");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер8");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер9");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер10");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер11");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер12");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер13");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер14");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер15");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер16");
		Массив.Добавить("ОбъектСтрахованияИдентификационныйНомер17");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка = Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель1НомерСтроки");
		Массив.Добавить("Водитель1ФИО");
		Массив.Добавить("Водитель1НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//		
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель2НомерСтроки");
		Массив.Добавить("Водитель2ФИО");
		Массив.Добавить("Водитель2НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель3НомерСтроки");
		Массив.Добавить("Водитель3ФИО");
		Массив.Добавить("Водитель3НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель4НомерСтроки");
		Массив.Добавить("Водитель4ФИО");
		Массив.Добавить("Водитель4НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель5НомерСтроки");
		Массив.Добавить("Водитель5ФИО");
		Массив.Добавить("Водитель5НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив 				= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель1НомерСтроки");
		Массив.Добавить("Водитель2НомерСтроки");
		Массив.Добавить("Водитель3НомерСтроки");
		Массив.Добавить("Водитель4НомерСтроки");
		Массив.Добавить("Водитель5НомерСтроки");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Лево";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель1ФИО");
		Массив.Добавить("Водитель2ФИО");
		Массив.Добавить("Водитель3ФИО");
		Массив.Добавить("Водитель4ФИО");
		Массив.Добавить("Водитель5ФИО");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Лево";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("Водитель1НомерВодительскогоУдостоверения");
		Массив.Добавить("Водитель2НомерВодительскогоУдостоверения");
		Массив.Добавить("Водитель3НомерВодительскогоУдостоверения");
		Массив.Добавить("Водитель4НомерВодительскогоУдостоверения");
		Массив.Добавить("Водитель5НомерВодительскогоУдостоверения");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Лево";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("ДатаЗаполненияЗаявленияДень1");
		Массив.Добавить("ДатаЗаполненияЗаявленияМесяц1");
		Массив.Добавить("ДатаЗаполненияЗаявленияГод1");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("ДатаЗаполненияЗаявленияДень2");
		Массив.Добавить("ДатаЗаполненияЗаявленияМесяц2");
		Массив.Добавить("ДатаЗаполненияЗаявленияГод2");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("СтраховательФИО");
		Массив.Добавить("СобственникФИО");
		
		//Массив.Добавить("скрСерия");
		//Массив.Добавить("скрНомер");
		
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Лево";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("ВидДокументаТС");
		Массив.Добавить("ОбъектСтрахованияПаспортСерия");
		Массив.Добавить("ОбъектСтрахованияПаспортНомер");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Верх";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		//
		
		СтрокаТЗ = ТЗГрупп.Добавить();
		Массив = Новый Массив;
		Массив.Добавить("ТипОграниченияДопускаБезОграничений");
		Массив.Добавить("ТипОграниченияДопускаСОграничением");
		СтрокаТЗ.Массив					= Массив;
		СтрокаТЗ.Тип					= "Лево";
		СтрокаТЗ.БратьЗначениеИзРисунка	= Массив[0];
		КонецПроцедуры		
		

Процедура ПСПФ_КолонтитлыИНастройки(Контекст) Экспорт	
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСПФ_КолонтитлыИНастройки");	      
	ТабДокумент = Контекст.ТабличныйДокумент;
	Объект = Контекст.Объект;
	Если Контекст.АвтоУстанавливатьИмяПараметровПечати Тогда
		Контекст.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + Объект.Ссылка.Метаданные().Имя + "_" + Контекст.ИмяМакета;
	КонецЕсли;
	Если Контекст.ИмяПараметровПечати <> "" Тогда
		ТабДокумент.ИмяПараметровПечати = Контекст.ИмяПараметровПечати;
		//При установке имени параметров печати считываются настройки печати, ранее сохраненные под этим именем для данного пользователя.
		//Сохранение настроек происходит в момент вывода на печать
		//В настройках сохраняются параметры из диалога Файл - Параметры страницы.
		//А именно, свойства табличного/текстового документа:
		//	АвтоМасштаб
		//	ИмяПринтера 
		//	КоличествоЭкземпляров
		//	МасштабПечати
		//	ОриентацияСтраницы
		//	ПолеСверху
		//	ПолеСлева
		//	ПолеСправа
		//	ПолеСнизу
		//	РазмерКолонтитулаСверху
		//	РазмерКолонтитулаСнизу
		//	ЧерноБелаяПечать
		//	ЭкземпляровНаСтранице
	КонецЕсли;
	Если НЕ Контекст.ИспользоватьСохраненныеНастройкиПечати Тогда
		//Считаем, что установки, заданные для конкретной ПФ имеют более высокий приоритет
		//Надо отметить, что при очередной печати будут сохранены новые настройки
		ТабДокумент.КоличествоЭкземпляров	= Контекст.КоличествоЭкземпляров;
		ТабДокумент.ОриентацияСтраницы		= Контекст.ОриентацияСтраницы;
		ТабДокумент.АвтоМасштаб				= Контекст.АвтоМасштаб;
	КонецЕсли;
	ТабДокумент.ОтображатьЗаголовки		= Контекст.ОтображатьЗаголовки;
	ТабДокумент.ОтображатьСетку			= Контекст.ОтображатьСетку;
	ТабДокумент.РазборПоКопиям			= Контекст.РазборПоКопиям;
	ТабДокумент.ТолькоПросмотр			= Контекст.ТолькоПросмотр;
	ТабДокумент.РазмерКолонтитулаСверху = 6;
	ВКлн = ТабДокумент.ВерхнийКолонтитул;
	ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ВКлн.НачальнаяСтраница = 1;
	Если Контекст.ПоказыватьЗаголовокДокументаВКолонтитле Тогда
		ВКлн.ТекстСлева = ДайЗаголовокДокументаПоставщику(Контекст); 
	КонецЕсли;
	ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
	ВКлн.Шрифт = Новый Шрифт(,7);
	ВКлн.Выводить	= Контекст.ВыводитьВерхнийКолонтитл;
	ТабДокумент.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДокумент.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница = 1;
	HКлн.Выводить	= Контекст.ВыводитьНижнийКолонтитл;
	HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия + "." + Формат(ТекущаяДата(),"ДФ=yyMMdd.HHmm");
	HКлн.Шрифт = Новый Шрифт(,7);
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

Процедура ПСПФ_Показать(Контекст,ВыводКакЕсть = ЛОЖЬ) Экспорт
	//ВыводКакЕсть - не добавлять в колонтитулах служебную информацию
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСПФ_Показать");
	Если Контекст.Отладка.НеПоказыватьРезультатПечати Тогда
		Перейти ~НаВыход;
	КонецЕсли;
	//+сохранение при закрытии
	//Если Контекст.СохранятьПФВФайл = Истина Тогда
	//	Хранилище	= ПараметрыСеанса.уб_Константы.ПапкаДляОтчетаПоставщику;
	//	//если хранилище не существует, то не сохраняем ничего
	//	КаталогНаДиске = Новый Файл(Хранилище);
	//	Если КаталогНаДиске.Существует() Тогда
	//		ИмяФайла = ИмяФайлаПФ(Контекст);
	//		//перед тем как сохранять файл нужно проверить все ли существуют папки,
	//		//и если какие-то не существуют - создать их
	//		ДатаДокумента = Контекст.Объект.Дата;
	//		Папка1 = Формат(Год(ДатаДокумента),"ЧГ=0");//год
	//		Папка2 = Формат(ДатаДокумента,"ДФ=""ггММ""");//ггММ
	//		Папка3 = СокрЛП(уб_temp.УбратьСимволы(Контекст.Объект.Поставщик.Наименование, "")); //Поставщик
	//		Если НЕ ЗначениеЗаполнено(Папка3) Тогда
	//			Папка3 = "@Поставщик неопределен@";
	//		КонецЕсли;
	//		Попытка
	//			СоздатьКаталог(Хранилище+"\"+Папка1);
	//			СоздатьКаталог(Хранилище+"\"+Папка1+"\"+Папка2);
	//			СоздатьКаталог(Хранилище+"\"+Папка1+"\"+Папка2+"\"+Папка3);
	//			Контекст.ТабличныйДокумент.Записать("" + Хранилище+"\"+Папка1+"\"+Папка2+"\"+Папка3+"\"+ ИмяФайла + ".xls","xls");
	//			Сообщить("Сохранен документ " + Хранилище+"\"+Папка1+"\"+Папка2+"\"+Папка3+"\" + ИмяФайла + ".xls");
	//		Исключение
	//			Сообщить("Не удалось сохранить документ: " + Хранилище+"\"+Папка1+"\"+Папка2+"\"+Папка3+"\" + ИмяФайла + ".xls");
	//		КонецПопытки;
	//	Иначе
	//		Сообщить("Не удалось сохранить документ!");
	//	КонецЕсли;
	//КонецЕсли;
	//-сохранение при закрытии
	//Если Контекст.ИмяОбъекта = "уб_ЗаявкаНаПечать" И Контекст.СтруктураОбъектаПФ.Наименование = "ОСАГО пустое" Тогда
	//	Контекст.ТабличныйДокумент.АвтоМасштаб 				= Ложь;
	//	Контекст.ТабличныйДокумент.ПолеСверху				= 5;
	//	Контекст.ТабличныйДокумент.ПолеСлева				= 5;
	//	Контекст.ТабличныйДокумент.ПолеСправа				= 5;
	//	Контекст.ТабличныйДокумент.ПолеСнизу 				= 0;
	//	Контекст.ТабличныйДокумент.РазмерКолонтитулаСнизу 	= 0;
	//	ВыводКакЕсть = Истина;
	//Иначе
	//	ВыводКакЕсть = Ложь;
	//КонецЕсли;
	ЗаголовокТД = ДайЗаголовокДокументаПоставщику(Контекст);
	Если ВыводКакЕсть Тогда
		Контекст.ТабличныйДокумент.Показать(ЗаголовокТД);
	Иначе
		ЗаголовокФормы = ЗаголовокТД + " (" + Контекст.СтруктураОбъектаПФ.Наименование + ")";//ЗаголовокФормы = ЗаголовокТД + " (" + Контекст.ОбъектПФ.Наименование + ")";
		КлючУник = ЗаголовокФормы;
		Фрм = Справочники.уб_ПечатныеФормы.ПолучитьФорму("ФормаРамкаПечати",, КлючУник);
		Фрм.Заголовок 	= ЗаголовокФормы;
		Фрм.Контекст	= Контекст;
		ПТД = Фрм.ЭлементыФормы.ПТД;
		ПТД.Очистить();
		ТабДок = Контекст.ТабличныйДокумент;
		СкопироватьТабличныйДокументВПолеТабличногоДокумента(Контекст.ТабличныйДокумент, ПТД);
		Фрм.Открыть();	
	КонецЕсли;
	
~НаВыход:
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

Процедура СкопироватьТабличныйДокументВПолеТабличногоДокумента(ТД, ПТД) Экспорт
	

	ПТД.ВставитьОбласть(ТД.Область(), ПТД.Область(),,Ложь);

	ПТД.АвтоМасштаб = ТД.АвтоМасштаб;
	ПТД.Вывод = ТД.Вывод;
	ПТД.Защита = ТД.Защита;
	ПТД.ИмяПараметровПечати = ТД.ИмяПараметровПечати;
	ПТД.ИмяПринтера = ТД.ИмяПринтера;
	ПТД.ИмяСохраненияПоложенияОкна = ТД.ИмяСохраненияПоложенияОкна;
	ПТД.ИспользуемоеИмяФайла = ТД.ИспользуемоеИмяФайла;
	ПТД.ИтогиСнизу = ТД.ИтогиСнизу;
	ПТД.ИтогиСправа = ТД.ИтогиСправа;
	ПТД.КодЯзыкаМакета = ТД.КодЯзыкаМакета;
	ПТД.КоличествоЭкземпляров = ТД.КоличествоЭкземпляров;
	ПТД.МасштабПечати = ТД.МасштабПечати;
	ПТД.НаправлениеПерехода = ТД.НаправлениеПерехода;
	ПТД.ОбластьПечати = ТД.ОбластьПечати;
	ПТД.ОриентацияСтраницы = ТД.ОриентацияСтраницы;
	ПТД.ОтображатьГруппировки = ТД.ОтображатьГруппировки;
	ПТД.ОтображатьЗаголовки = ТД.ОтображатьЗаголовки;
	ПТД.ОтображатьСетку = ТД.ОтображатьСетку;
	ПТД.ПовторятьПриПечатиКолонки = ТД.ПовторятьПриПечатиКолонки;
	ПТД.ПовторятьПриПечатиСтроки = ТД.ПовторятьПриПечатиСтроки;
	ПТД.ПолеСверху = ТД.ПолеСверху;
	ПТД.ПолеСлева = ТД.ПолеСлева;
	ПТД.ПолеСнизу = ТД.ПолеСнизу;
	ПТД.ПолеСправа = ТД.ПолеСправа;
	ПТД.РазборПоКопиям = ТД.РазборПоКопиям;
	ПТД.РазмерКолонтитулаСверху = ТД.РазмерКолонтитулаСверху;
	ПТД.РазмерКолонтитулаСнизу = ТД.РазмерКолонтитулаСнизу;
	ПТД.СохранятьСвойстваОтображения = ТД.СохранятьСвойстваОтображения;
	ПТД.ТолькоПросмотр = ТД.ТолькоПросмотр;
	ПТД.ФиксацияСверху = ТД.ФиксацияСверху;
	ПТД.ФиксацияСлева = ТД.ФиксацияСлева;
	ПТД.ФиксированныйФон = ТД.ФиксированныйФон;
	ПТД.ФоноваяКартинка = ТД.ФоноваяКартинка;
	ПТД.ЧерноБелаяПечать = ТД.ЧерноБелаяПечать;
	ПТД.ЧерноБелыйПросмотр = ТД.ЧерноБелыйПросмотр;
	ПТД.ЭкземпляровНаСтранице = ТД.ЭкземпляровНаСтранице;
	ПТД.ИспользуемоеИмяФайла = Тд.ИспользуемоеИмяФайла;
	ПТД.Вывод  = ?(уб_Кэшируемые.ДоступностьРоли("уб_СотрудникОтделаБСО") ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.Андеррайтер, Ложь) = Истина,ИспользованиеВывода.Разрешить,ИспользованиеВывода.Авто);
	//ПТД_ВК = ПТД.ВерхнийКолонтитул;
	//ТД_ВК = ТД.ВерхнийКолонтитул;
	//ПТД_ВК.ВертикальноеПоложение = ТД_ВК.ВертикальноеПоложение;
	//ПТД_ВК.Выводить = ТД_ВК.Выводить;
	//ПТД_ВК.НачальнаяСтраница = ТД_ВК.НачальнаяСтраница;
	//ПТД_ВК.ТекстВЦентре = ТД_ВК.ТекстВЦентре;
	//ПТД_ВК.ТекстСлева = ТД_ВК.ТекстСлева;
	//ПТД_ВК.ТекстСправа = ТД_ВК.ТекстСправа;
	//ПТД_ВК.Шрифт = ТД_ВК.Шрифт;
	//ПТД_НК = ПТД.НижнийКолонтитул;
	//ТД_НК = ТД.НижнийКолонтитул;
	//ПТД_НК.ВертикальноеПоложение = ТД_НК.ВертикальноеПоложение;
	//ПТД_НК.Выводить = ТД_НК.Выводить;
	//ПТД_НК.НачальнаяСтраница = ТД_НК.НачальнаяСтраница;
	//ПТД_НК.ТекстВЦентре = ТД_НК.ТекстВЦентре;
	//ПТД_НК.ТекстСлева = ТД_НК.ТекстСлева;
	//ПТД_НК.ТекстСправа = ТД_НК.ТекстСправа;
	//ПТД_НК.Шрифт = ТД_НК.Шрифт;
	
КонецПроцедуры

//Выводит шапку организации из общего макета (указывается в стравочнике уб_Константы, константа "Макет Шапок Организаций")
//Шапку ищет по имени: "Шапка" + КодОрганизации. Н-р "Шапка000000001"
Функция ВывестиШапкуОрганизации(Контекст, Организация = Неопределено, бВыводитьТиповуюШапкуЕслиНетЧастной = Ложь) Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ВывестиШапкуОрганизации (Организация: '" + Строка(Организация) + "')");	
	Рез = Ложь;
	Если Организация = Неопределено Тогда
		Организация = Контекст.ОрганизацияАгент;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Организация) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	ПФ = ПараметрыСеанса.уб_Константы.МакетШапокОрганизаций;
	Макет = ПФ.МакетШаблона.Получить();
	ИмяОбласти = "Шапка" + Строка(Организация.Код);
	Если Макет.Области.Найти(ИмяОбласти) = Неопределено Тогда
		Если бВыводитьТиповуюШапкуЕслиНетЧастной Тогда
			ИмяОбласти = "ШапкаСтандарт";
			ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "Организация", Организация);
		Иначе	
			Перейти ~НаВыход;	
		КонецЕсли;
	КонецЕсли;
	Контекст2 = КлонироватьКонтекст(Контекст);
	Контекст2.Макет = Макет;
	Контекст2.СсылкаПФ = ПФ;
	Контекст2.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(ПФ);//Контекст2.ОбъектПФ = ПФ.ПолучитьОбъект();
	ПСП(Контекст2, ИмяОбласти, Контекст2.Предупреждать, Макет);
	Рез = Истина;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

//<<<<<*************************************************************************

//******************************************************************************
//     ПСП 3-й УРОВЕНЬ детализации
//******************************************************************************

//Заполняет параметры текущей области, для которых указан частный код заполнения
// и выполняет свободный код области.
// Последовательность обхода: 
// 1) Свободный код области, если есть
// 2) Параметры с частным кодом в том порядке, в котором они следуют в макете
Процедура ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду");		
	ТекущаяОбластьТД = Контекст.ТекущаяОбластьТД;
	Контекст.ОперативныйКонтейнер = Контекст.Контейнер;	
	// Выполнение частного кода заполнения параметров и свободного кода областей	
	//СтрокиПараметров = Контекст.ОбъектПФ.ПараметрыМакета.Выгрузить(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Истина, Ложь));
	//СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.Выгрузить(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Истина, Ложь));
	СтрокиОтбора = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Истина, Ложь));
	СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.Скопировать(СтрокиОтбора);
	СтрокиПараметров.Сортировать("Порядок,Область,Параметр");
	мПризнакСвободногоКода = кПризнакСвободногоКода();
	Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
		Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
		Если СтрокаПараметра.Параметр = мПризнакСвободногоКода Тогда
			КодПрограммы = СтрокаПараметра.КодЗаполнения;	
		Иначе
			КодПрограммы = "
			|	ЗначениеПараметра = Неопределено;
			|	" + СтрокаПараметра.КодЗаполнения + "
			|	ТекущаяОбластьТД.Параметры[СтрокаПараметра.Параметр] = ЗначениеПараметра;
			|";	
		КонецЕсли;
		Попытка
			Выполнить(КодПрограммы);
		Исключение 
			отладка_ПФ(Контекст, ОписаниеОшибки(), , СтатусСообщения.Важное);
			//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_ПФ.ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду() ошибка выполнения кода программы. КодПрограммы: 
			//|" + КодПрограммы, "НеСообщать", Истина);
		КонецПопытки;
	КонецЦикла;	
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

// Заполнение параметров по их именам
// Последовательность обхода: 
// 1) Свободный код области, если есть
// 2) Параметры с частным кодом в том порядке, в котором они следуют в макете

Процедура ПСП_ЗаполнениеПараметровОбласти_ПоИменам(Контекст)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ЗаполнениеПараметровОбласти_ПоИменам");		
	ТекущаяОбластьТД = Контекст.ТекущаяОбластьТД;
	//TODO если использовать ОбъектПФ - доверенности не работают!
	//СтрокиПараметров = Контекст.ОбъектПФ.ПараметрыМакета.Выгрузить(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Ложь, Ложь));
	//СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.Выгрузить(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Ложь, Ложь));
	СтрокиОтбора = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", Контекст.ИмяТекущейОбластиТД, Ложь, Ложь));
	СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.Скопировать(СтрокиОтбора);
	СтрокиПараметров.Сортировать("Порядок,Область,Параметр");
	RegExp = Новый COMОбъект("VBScript.RegExp");
	Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
		Контекст.ОперативныйКонтейнер = Контекст.Контейнер; //Восстанавливаем значение оперативного контейнера (может измениться модификатором при заполнении параметра)
		Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
		ОПТЧ(Контекст, ТекущаяОбластьТД.Параметры, RegExp);
	КонецЦикла;
	RegExp = Null;	
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

//// Процессор заполняет типовые места подстановки:
//1.1.1 ТекущееЧисло
//1.1.2 ТекущийМесяц
//1.1.3 ТекущийГод
//
//1.2.1.1 НомерДокумента
//1.2.1.2 НомерДокументаБезТипового
//1.2.2   ДатаДокумента
//1.2.3.1 ДатаДокумента_Прописью<_PП>
//1.2.4 ЧислоДокумента
//1.2.5 МесяцДокумента
//1.2.6 ГодДокумента
//
//1.3.1 НачалоОтчетногоПериода
//1.3.2 КонецОтчетногоПериода
//1.5   НаименованиеДоговора 
//
//2.1.1 ОрганизацияАгент_НаименованиеПолное
//2.1.2 ОрганизацияАгент_НаименованиеДляДоговоров
//
//2.2.1 Поставщик_НаименованиеПолное
//2.2.2 Поставщик_НаименованиеКраткое
//
//3.2.1 Руководитель_ФИОПолностью<_?П>
//3.2.2 Руководитель_ФИОКратко<_?П>
//3.1.1 Руководитель_Должность<_?П>
//3.4.1 Руководитель_<СловоЗависимоеОтПола>_пол
//
//4.1.1 ЛицоИх_ФИОПолностью<_?П>
//4.1.2 ЛицоИх_ФИОКратко<_?П>
//4.4.1 ЛицоИх_Должность<_?П>
//4.3.1 ЛицоИх_<СловоЗависимоеОтПола>_пол	
//4.3.2 ЛицоИх_ОснованиеДействия	
// ТОДО передвинуть аргумент Предупреждать на последнее место
Процедура ПСП_ДокументовДляПоставщика(Контекст, Предупреждать = Ложь, ОсновнойКонтейнер = "ДОКУМЕНТ") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ДокументовДляПоставщика (Контейнер:  '"+ ОсновнойКонтейнер +"')");	
	Контекст.Предупреждать = Предупреждать;	
	Если ВРег(ОсновнойКонтейнер) = "ИТОГИ" Тогда
		Контекст.Контейнер = Контекст.Контейнер_Итоги;
	ИначеЕсли ВРег(ОсновнойКонтейнер) = "СТРОКАТЧ" Тогда
		Контекст.Контейнер = Контекст.Контейнер_СтрокаТЧ;
	Иначе
		Контекст.Контейнер = Контекст.Контейнер_Документ;
	КонецЕсли;	
	ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст);
	ПСП_ЗаполнениеПараметровОбласти_ПоИменам(Контекст);		
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

//<<<<<*************************************************************************

/////////////////////////////////////////////////////////////////////////////////
//     процессор подстановок ТЧ Отчета Поставщику 
/////////////////////////////////////////////////////////////////////////////////

//Просто очищает таблицу итогов(//уже не очищает//) 
//TODO УЙТИ ОТ НЕЕ ВООБЩЕ, название не отражает производимых действий
//ранее производится инициализация с обнулением этих итогов, зачем это делать здесь 
//эти итоги должны инициализировать один раз, иметь возможность управляться из частного кода (добавляться новые итоги)
//не перетирать действия частного кода.
//ЗАМЕЧАНИЕ: состав итогов может определяться типом документа, общими показателями(также зависят от типа документа и могут отключаться в печатной форме) 
//и частным кодом перед выводом тч, 
//TODO УБРАТЬ добавление контейнеров из частного кода макета (это делалось из-за перетирания в начале вывода ТЧ, сейчас это должно быть в частном коде печатной формы)
Функция ПолучитьСтруктуруИтогов_Общее(Контекст)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПолучитьСтруктуруИтогов_Общее");	
	ТЗИтоги = Контекст.Контейнер_Итоги.Владелец();
	//ТЗИтоги.Очистить();
	Если ТЗИтоги.Количество() = 0 Тогда
		Контекст.Контейнер_Итоги = ТЗИтоги.Добавить();
		Контекст.Контейнер_Итоги.Тип_ = "ИТОГИ";
	КонецЕсли;	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Контекст.Контейнер_Итоги;
	
КонецФункции

Функция ПолучитьСтруктуруИтоговСтрокиТЧ_ОтчетаПоставщику(Контекст) Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПолучитьСтруктуруИтоговСтрокиТЧ_ОтчетаПоставщику");	
	Ч15_4 = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,4);
	ТЗ = ПолучитьСтруктуруИтогов_Общее(Контекст).Владелец();
	ДобавитьСвойствоВТЗ(ТЗ, "КВСумма",											Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "ПолнаяПремия",										Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "НачисленнаяСуммаВзноса",							Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "КВСуммаДляОтчета",									Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику",	Ч15_4, 0);
	//ДобавитьСвойствоВТЗ(ТЗ, "СуммаУдержаннаяАгентом",							Ч15_4);
	ДобавитьСвойствоВТЗ(ТЗ, "Баланс_Брокер_Поставщик",							Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "СуммаКПеречислениюАгенту",							Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "СуммаКПеречислениюПоставщику",						Ч15_4, 0);
	ДобавитьСвойствоВТЗ(ТЗ, "ЭтоДоговорСУдержаниемКВ", Новый ОписаниеТипов("Булево"));
    //--------------------------
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Контекст.Контейнер_Итоги;
	
КонецФункции

//// 2-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в ТЧ отчета Поставщику:
// ПечатьСтроки - Вывести область "Строка" на печать или нет
Процедура ПСП_ТЧ_ОП(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_ОП (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");	
	
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;
	Объект = Контекст.Объект;	
	ТЗ_ТЧДокумента = Контекст.ТЧДокумента;	
	ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);
	
	//Указываем, какую строку повторять на каждой странице при печати	
	ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
	Если ОблШапкаТаб <> Неопределено Тогда
		Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
			ВерхняяГраница = ОблШапкаТаб.Верх;
			НижняяГраница = ОблШапкаТаб.Низ;
			Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
				ОбластьПовторения = ОблШапкаТаб;
			Иначе
				ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
				ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
			КонецЕсли;
			ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
		КонецЕсли;
		Если Контекст.ФиксацияСверху Тогда
			ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
		КонецЕсли;
	КонецЕсли;
	Итоги = ПолучитьСтруктуруИтоговСтрокиТЧ_ОтчетаПоставщику(Контекст);	
	Если Контекст.ЭтоПФСубагент Тогда
		Итоги.ЭтоДоговорСУдержаниемКВ = Истина;
	Иначе
		Итоги.ЭтоДоговорСУдержаниемКВ = уб_СС.ОпределитьЭтоРасчетСУдержаниемКВ(Объект.Поставщик, Объект.ОрганизацияАгент, Объект.Дата, Ложь);
	КонецЕсли;
	Сортировка = "";	
	//не нужна попытка
	ОбластьГруппаСК = Макет.Области.Найти("ГруппаСК");
	Если ОбластьГруппаСК = Неопределено Тогда
		бОбрабатыватьГруппуСК = Ложь
	Иначе
		ОбластьМакета_ГруппаСК = Макет.ПолучитьОбласть("ГруппаСК");
		бОбрабатыватьГруппуСК = Истина;
		Если Контекст.ТЧДокумента.Колонки.Найти("СК") <> Неопределено Тогда
			Сортировка = "СК";
		КонецЕсли;
	КонецЕсли;
	ОбластьГруппаВидаСП = Макет.Области.Найти("ГруппаВидаСП");
	Если ОбластьГруппаВидаСП = Неопределено Тогда
		бОбрабатыватьГруппуВидаСП = Ложь
	Иначе
		ОбластьМакета_ГруппаВидаСП = Макет.ПолучитьОбласть("ГруппаВидаСП");
		бОбрабатыватьГруппуВидаСП = Истина;	
		Если Контекст.ТЧДокумента.Колонки.Найти("ВидСтраховогоПродукта") <> Неопределено Тогда
			Сортировка = Сортировка + ?(Сортировка = "","",",") + "ВидСтраховогоПродукта";
		КонецЕсли;	
	КонецЕсли;
	ОбластьГруппаСП = Макет.Области.Найти("ГруппаСП");
	Если ОбластьГруппаСП = Неопределено Тогда
		бОбрабатыватьГруппуСП = Ложь
	Иначе
		ОбластьМакета_ГруппаСП = Макет.ПолучитьОбласть("ГруппаСП");
		бОбрабатыватьГруппуСП = Истина;	
		Если Контекст.ТЧДокумента.Колонки.Найти("СтраховойПродукт") <> Неопределено Тогда
			Сортировка = Сортировка + ?(Сортировка = "","",",") + "СтраховойПродукт";
		КонецЕсли;
	КонецЕсли;
	Если Контекст.ТЧДокумента.Колонки.Найти("ДатаОплатыСтраховогоВзноса") <> Неопределено Тогда
		Сортировка = Сортировка + ?(Сортировка = "","",",ДатаОплатыСтраховогоВзноса");
	КонецЕсли;	
	Если Сортировка <> "" Тогда
		Контекст.ТЧДокумента.Сортировать(Сортировка);
	КонецЕсли;	
	//Добавим в TЗ производные колонки, что бы испоользовать их (единообразно) как свойства контейнера при заполнении параметров 
	Ч15_2 = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);	
	//Колонки = ТЗ_ТЧДокумента.Колонки; 
	//ДобавитьСвойствоВТЗ(ТЗ_ТЧДокумента, "СуммаУдержаннаяАгентом",		Ч15_2);
	ДобавитьСвойствоВТЗ(ТЗ_ТЧДокумента, "СуммаКПеречислениюАгенту",		Ч15_2);
	ДобавитьСвойствоВТЗ(ТЗ_ТЧДокумента, "СуммаКПеречислениюПоставщику",	Ч15_2);
	//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
	// Иттерации заполнения строк шаблона 
	СчетчикСтрок = 1;
	ВсегоСтрок = ТЗ_ТЧДокумента.Количество();
	Для Каждого СтрокаТЧ Из ТЗ_ТЧДокумента Цикл
		Если Контекст.Отладка.Групповая И Контекст.Контейнер_Итоги.НомерТекущейСтроки >= Контекст.Отладка.МаксКоличествоСтрокТЧ Тогда
			Прервать;	
		КонецЕсли;
		Если бОбрабатыватьГруппуСК Тогда
			Если Итоги.ТекущаяСК <> СтрокаТЧ.СК Тогда
				ОбластьМакета_ГруппаСК.Параметры.СК = Строка(СтрокаТЧ.СК);	
				ТабДок.Вывести(ОбластьМакета_ГруппаСК);				
				Если бОбрабатыватьГруппуВидаСП Тогда
					Итоги.ТекущийВидСП = Неопределено; //Для того, что бы после смены СК всегда выводилась группировка ВидаСП
				КонецЕсли;				
			КонецЕсли;
			Итоги.ТекущаяСК = СтрокаТЧ.СК;
		КонецЕсли;		
		Если бОбрабатыватьГруппуВидаСП Тогда
			Если Итоги.ТекущийВидСП <> СтрокаТЧ.ВидСтраховогоПродукта Тогда
				ОбластьМакета_ГруппаВидаСП.Параметры.ВидСтраховогоПродукта = Строка(СтрокаТЧ.ВидСтраховогоПродукта);	
				ТабДок.Вывести(ОбластьМакета_ГруппаВидаСП);
			КонецЕсли;
			Итоги.ТекущийВидСП = СтрокаТЧ.ВидСтраховогоПродукта;
		КонецЕсли;
		Если бОбрабатыватьГруппуСП Тогда
			Если Итоги.ТекущийСтраховойПродукт <> СтрокаТЧ.СтраховойПродукт Тогда
				ОбластьМакета_ГруппаСП.Параметры.СтраховойПродукт = Строка(СтрокаТЧ.СтраховойПродукт);	
				ТабДок.Вывести(ОбластьМакета_ГруппаСП);
			КонецЕсли;
			Итоги.ТекущийСтраховойПродукт = СтрокаТЧ.СтраховойПродукт;
		КонецЕсли;		
		УстановитьТекущийКонтейнер(Контекст,"СтрокаТЧ",СтрокаТЧ);
		#Если Клиент Тогда
		Состояние("Вывод строки " + СчетчикСтрок + " из " + ВсегоСтрок);
		СчетчикСтрок = СчетчикСтрок + 1;
		#КонецЕсли
		
		ПСП_СтрокиТЧ_ОП(Контекст, ИмяОбластиСтрока);	
	КонецЦикла;
	
	#Если Клиент Тогда
		Состояние("Вывод подвала печатной формы");
	#КонецЕсли
	
	Если Итоги.Баланс_Брокер_Поставщик >= 0 Тогда
		Итоги.СуммаКПеречислениюАгенту = 0;
		Итоги.СуммаКПеречислениюПоставщику = Итоги.Баланс_Брокер_Поставщик;
	Иначе
		Итоги.СуммаКПеречислениюАгенту = - Итоги.Баланс_Брокер_Поставщик;
		Итоги.СуммаКПеречислениюПоставщику = 0;
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

//// 3-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в СТРОКЕ ТЧ отчета Поставщику:
//1.1 		НомерСтроки
//2.1 Страхователь
//3.1 НомерПолиса
//3.2 НомерБСО
//3.3 НомерКвитанции
//4.1 ДатаОформленияПолиса
//4.2 ДатаОформленияПолиса_Кратко
//5.1 НачалоДействияПолиса
//5.2 НачалоДействияПолиса_Кратко
//6.1 ОкончаниеДействияПолиса
//6.2 ОкончаниеДействияПолиса_Кратко
//7.1 ПолнаяПремия
//7.2 СтраховаяСумма
//8.1 НачисленнаяСуммаВзноса
//8.2 НачисленнаяСуммаВзносаВВалюте
//8.3 Валюта
//8.4 Курс
//9.1 КВПроцентДляОтчета
//9.2 КВСуммаДляОтчета
//10.1 ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
//11.1 СуммаУдержаннаяАгентом
//12.1 Баланс_Брокер_Поставщик
//13.1 СуммаКПеречислениюАгенту
//14.1 СуммаКПеречислениюПоставщику
//15.1 ДатаОплатыСтраховогоВзноса
//15.2 ДатаОплатыСтраховогоВзноса_Кратко
//16.1 ПризнакПлатежа
//17.1 ВидСтраховогоПродукта
//17.2 СтраховойПродукт
//18.1 ПлатежныйДокумент_Номер
//18.2 ПлатежныйДокумент_Дата
Процедура ПСП_СтрокиТЧ_ОП(Контекст, ИмяОбласти = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_СтрокиТЧ_ОП (Область: '" + ИмяОбласти + "')");
	Область_Строка = ПолучитьОбласть(Контекст, ИмяОбласти);
	ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст);
	Итоги = Контекст.Контейнер_Итоги;
	Итоги.НомерТекущейСтроки = Итоги.НомерТекущейСтроки + 1;
	СтрокаТЧ = Контекст.Контейнер_СтрокаТЧ;
	//TODO почему забито здесь? убрать
	//СтрокаТЧ.КВСумма = СтрокаТЧ.НачисленнаяСуммаВзноса * СтрокаТЧ.КВПроцент / 100;
	//СтрокаТЧ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
	//Сумма взноса, отражаемая в Отчете Поставщику, как "полученная" с клиента.
	//При оплате клиентом напрямую в СК (форма оплаты "В СК" или "Терминал") равна фактической сумме оплаты - ОплаченоФакт.
	//А при оплате в брокер (в кассу или по безналу) принимается равной начисленной (полной) сумме взноса - НачисленнаяСуммаВзноса.
	//СтрокаТЧ.СуммаУдержаннаяАгентом = ?(Итоги.ЭтоДоговорСУдержаниемКВ,СтрокаТЧ.КВСуммаДляОтчета,0);
	//СтрокаТЧ.Баланс_Брокер_Поставщик;
	//Сумма, которую надо оплатить (по этой оплате) поставщику.
	//Завивит от вида расчета: при расчетах с удержанием уменьшается на сумму КВ для отчета
	//Зависит от того, куда оплатил Клиент (в брокер или Поставщику): уменьшается на сумму, оплаченную Поставщику
	//! Может быть отрицательной: случай оплаты Клиентом напрямую Поставщику полной суммы взноса при расчетах по удержанию
	//Она же - 
	// ??????? "Сумма поступившая Поставшику"
	// ??????? "Поступившая премия" (поставщику, после оплаты)
	// ??????? "Сумма переведенная на расчетный счет Страховщика".
	//Если СтрокаТЧ.Баланс_Брокер_Поставщик >= 0 Тогда
	//	СтрокаТЧ.СуммаКПеречислениюАгенту = 0;
	//	СтрокаТЧ.СуммаКПеречислениюПоставщику	= СтрокаТЧ.Баланс_Брокер_Поставщик;
	//	//TODO СуммаКПеречислениюПоставщику для разрядности 2
	//Иначе
	//	СтрокаТЧ.СуммаКПеречислениюАгенту = - СтрокаТЧ.Баланс_Брокер_Поставщик;
	//	СтрокаТЧ.СуммаКПеречислениюПоставщику = 0;
	//КонецЕсли;
	Итоги.ТекущаяСК = СтрокаТЧ.СК;
	Итоги.ТекущийСтраховойПродукт = СтрокаТЧ.СтраховойПродукт;
	Итоги.ТекущийВидСП = СтрокаТЧ.ВидСтраховогоПродукта;
	//===========================================================
	Если Область_Строка <> Неопределено Тогда
		Область_Строка.Области[ИмяОбласти].ПараметрРасшифровки = "Расшифровка";
		Если Область_Строка.Параметры.Количество() > 0 Тогда 
			Попытка
				//если в строке пусто - расшифровывать нечего, расшифровка не устанавливается
				Область_Строка.Параметры.Расшифровка = Контекст.Контейнер_СтрокаТЧ.Ссылка
			Исключение
				//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПСП_СтрокиТЧ_ОП(): ошибка установки расшифровки. " + ОписаниеОшибки(),, Истина);
			КонецПопытки;
		КонецЕсли;
		Прмт = Область_Строка.Параметры;
		СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
		RegExp = Новый COMОбъект("VBScript.RegExp");
		Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
			Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
			Контекст.ОперативныйКонтейнер = Контекст.Контейнер; //Восстанавливаем значение оперативного контейнера (может измениться модификатором при заполнении параметра)		
			ИмяПараметра = СтрокаПараметра.Параметр;
			Если ИмяПараметра = "" Тогда
			ИначеЕсли ИмяПараметра = "Баланс_Брокер_Поставщик" Тогда
				Прмт.Баланс_Брокер_Поставщик = Формат(СтрокаТЧ.Баланс_Брокер_Поставщик,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "Валюта" Тогда
				Прмт.Валюта = СтрокаТЧ.Валюта;
			ИначеЕсли ИмяПараметра = "ВидСтраховогоПродукта" Тогда
				Прмт.ВидСтраховогоПродукта = Строка(СтрокаТЧ.ВидСтраховогоПродукта);
			ИначеЕсли ИмяПараметра = "ДатаОплатыСтраховогоВзноса" Тогда
				Прмт.ДатаОплатыСтраховогоВзноса = Формат(СтрокаТЧ.ДатаОплатыСтраховогоВзноса,Контекст.ДФ_Полный);
			ИначеЕсли ИмяПараметра = "ДатаОплатыСтраховогоВзноса_Кратко" Тогда
				Прмт.ДатаОплатыСтраховогоВзноса_Кратко = Формат(СтрокаТЧ.ДатаОплатыСтраховогоВзноса,Контекст.ДФ_Кратко);
			ИначеЕсли ИмяПараметра = "КВПроцент" Тогда
				Прмт.КВПроцент = Строка(СтрокаТЧ.КВПроцент) + "%";
			ИначеЕсли ИмяПараметра = "КВПроцентДляОтчета" Тогда
				Прмт.КВПроцентДляОтчета = Строка(СтрокаТЧ.КВПроцентДляОтчета) + "%";
			ИначеЕсли ИмяПараметра = "КВСумма" Тогда
				Прмт.КВСумма = Формат(СтрокаТЧ.КВСумма, Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "КВСуммаДляОтчета" Тогда
				Прмт.КВСуммаДляОтчета = Формат(СтрокаТЧ.КВСуммаДляОтчета,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "Курс" Тогда
				Прмт.Курс = Формат(СтрокаТЧ.Курс,"ЧДЦ=4");
			ИначеЕсли ИмяПараметра = "НачалоДействияПолиса" Тогда
				Прмт.НачалоДействияПолиса = Формат(СтрокаТЧ.НачалоДействияПолиса,Контекст.ДФ_Полный);
			ИначеЕсли ИмяПараметра = "НачалоДействияПолиса_Кратко" Тогда
				Прмт.НачалоДействияПолиса_Кратко = Формат(СтрокаТЧ.НачалоДействияПолиса,Контекст.ДФ_Кратко);
			ИначеЕсли ИмяПараметра = "НачисленнаяСуммаВзноса" Тогда
				Прмт.НачисленнаяСуммаВзноса = Формат(СтрокаТЧ.НачисленнаяСуммаВзноса,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "НачисленнаяСуммаВзносаВВалюте" Тогда
				Прмт.НачисленнаяСуммаВзносаВВалюте = Формат(СтрокаТЧ.НачисленнаяСуммаВзносаВВалюте,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "НомерБСО" Тогда
				Прмт.НомерБСО = СокрЛП(СтрокаТЧ.НомерБСО);//СокрЛП(уб_СС.ДайНомерБСОПоСП(СтрокаТЧ.СтраховойПолис));
			ИначеЕсли ИмяПараметра = "НомерКвитанции" Тогда
				Прмт.НомерКвитанции = СокрЛП(СтрокаТЧ.НомерКвитанции);
			ИначеЕсли ИмяПараметра = "ОкончаниеДействияПолиса" Тогда
				Прмт.ОкончаниеДействияПолиса = Формат(СтрокаТЧ.ОкончаниеДействияПолиса,Контекст.ДФ_Полный);
			ИначеЕсли ИмяПараметра = "ОкончаниеДействияПолиса_Кратко" Тогда
				Прмт.ОкончаниеДействияПолиса_Кратко = Формат(СтрокаТЧ.ОкончаниеДействияПолиса,Контекст.ДФ_Кратко);
			ИначеЕсли ИмяПараметра = "ПлатежныйДокумент_Дата" Тогда
				Прмт.ПлатежныйДокумент_Дата = Формат(СтрокаТЧ.ПлатежныйДокумент_Дата,Контекст.ДФ_Полный);
			ИначеЕсли ИмяПараметра = "ПлатежныйДокумент_Номер" Тогда
				Прмт.ПлатежныйДокумент_Номер = СокрЛП(СтрокаТЧ.ПлатежныйДокумент_Номер);
			ИначеЕсли ИмяПараметра = "ПолнаяПремия" Тогда
				Прмт.ПолнаяПремия = Формат(СтрокаТЧ.ПолнаяПремия,Контекст.ЧФ)
			ИначеЕсли ИмяПараметра = "ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику" Тогда
				Прмт.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Формат(СтрокаТЧ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "ПризнакПлатежа" Тогда
				Если СтрокаТЧ.ПризнакПлатежа = 0 Тогда
					Прмт.ПризнакПлатежа = "П";
				Иначе	
					Прмт.ПризнакПлатежа = Строка(?(СтрокаТЧ.НомерВзноса = 0,1,СтрокаТЧ.НомерВзноса));//+"-й взнос";
				КонецЕсли;
			ИначеЕсли ИмяПараметра = "СтраховаяСумма" Тогда
				Прмт.СтраховаяСумма = Формат(СтрокаТЧ.СтраховаяСумма,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "СтраховойПродукт" Тогда
				Прмт.СтраховойПродукт = Строка(СтрокаТЧ.СтраховойПродукт);
			ИначеЕсли ИмяПараметра = "СуммаКПеречислениюАгенту" Тогда
				Прмт.СуммаКПеречислениюАгенту = Формат(СтрокаТЧ.СуммаКПеречислениюАгенту,Контекст.ЧФ);
			ИначеЕсли ИмяПараметра = "СуммаКПеречислениюПоставщику" Тогда
				Прмт.СуммаКПеречислениюПоставщику = Формат(СтрокаТЧ.СуммаКПеречислениюПоставщику,Контекст.ЧФ);
			//ИначеЕсли ИмяПараметра = "СуммаУдержаннаяАгентом" Тогда
			//	Прмт.СуммаУдержаннаяАгентом = Формат(СтрокаТЧ.СуммаУдержаннаяАгентом,Контекст.ЧФ);
			Иначе
				ОПТЧ(Контекст, Прмт, RegExp);
			КонецЕсли;
		КонецЦикла;
		RegExp = Null;
		Если СтрокаТЧ.Валюта <> ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета Тогда
			Область_Строка.Области[ИмяОбласти].ЦветФона = WebЦвета.Желтый;
		КонецЕсли;
			
		Если Контекст.Свойство("ЭтоИсторияОП") И Контекст.ЭтоИсторияОП <> Неопределено И Контекст.ЭтоИсторияОП Тогда
			//Если СтрокаТЧ.Удалить Тогда
			//	Область_Строка.Области[ИмяОбласти].ЦветФона = Новый Цвет(255, 173, 173);
			//ИначеЕсли СтрокаТЧ.Добавить Тогда	
			//	Если ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			//		Область_Строка.Области[ИмяОбласти].ЦветФона = Новый Цвет(204, 255, 204);
			//	Иначе
			//		Область_Строка.Области[ИмяОбласти].ЦветФона = Новый Цвет(255, 250, 200);
			//	КонецЕсли;	
			//Иначе
			Если СтрокаТЧ.Изменить.Количество() > 0 Тогда				
				Для Строчка = 1 По Область_Строка.ВысотаТаблицы Цикл
					Для Колонка = 1 По Область_Строка.ШиринаТаблицы Цикл
						Ячейка = Область_Строка.Область(Строчка,Колонка);						
						Если ЗначениеЗаполнено(Ячейка.Параметр) Тогда
							Для Каждого ЭлементСписка Из СтрокаТЧ.Изменить Цикл
								ИскомаяСтрока = ЭлементСписка.Значение;								
								Если ИскомаяСтрока <> "" Тогда
									Номер = Найти(Ячейка.Параметр,ИскомаяСтрока);
									Если Номер > 0 Тогда
										//Ячейка.Примечание.Текст = ТекущееСостояниеОплаты[Ячейка.Параметр];
										МассивДопустимыхСимволов = Новый Массив;
										МассивДопустимыхСимволов.Добавить("(");
										МассивДопустимыхСимволов.Добавить(")");
										МассивДопустимыхСимволов.Добавить(".");
										МассивДопустимыхСимволов.Добавить(",");
										МассивДопустимыхСимволов.Добавить(" ");
										МассивДопустимыхСимволов.Добавить("");
										Если СтрДлина(Ячейка.Параметр) = СтрДлина(ИскомаяСтрока)
											Или Номер = 1 И МассивДопустимыхСимволов.Найти(Сред(Ячейка.Параметр,Номер+СтрДлина(ИскомаяСтрока),1)) <> Неопределено
											Или Номер > 1 И МассивДопустимыхСимволов.Найти(Сред(Ячейка.Параметр,Номер-1,1)) <> Неопределено И СтрДлина(Ячейка.Параметр) > Номер + СтрДлина(ИскомаяСтрока) - 1 И МассивДопустимыхСимволов.Найти(Сред(Ячейка.Параметр,Номер + СтрДлина(ИскомаяСтрока),1)) <> Неопределено
											Или Номер > 1 И МассивДопустимыхСимволов.Найти(Сред(Ячейка.Параметр,Номер-1,1)) <> Неопределено И СтрДлина(Ячейка.Параметр) = Номер + СтрДлина(ИскомаяСтрока) - 1
											Тогда
											Строка = Контекст.ТабличнаяЧатьТекущегоСостоянияДокумента.Найти(СтрокаТЧ.Ссылка,"Ссылка");
											Если Строка <> Неопределено И Контекст.ТабличнаяЧатьТекущегоСостоянияДокумента.Колонки.Найти(ИскомаяСтрока) <> Неопределено Тогда
												Ячейка.Примечание.Текст = Строка[ИскомаяСтрока];
											Иначе
												Ячейка.Примечание.Текст = " ";
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;	
						КонецЕсли;							
					КонецЦикла;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
		Контекст.ТабличныйДокумент.Вывести(Область_Строка);
	КонецЕсли;
	//===========================================================
	//>>>>>>>> история >>>>>>>>>>>>>>>>>	
	КонтрольИтога = Контекст.Свойство("Оформить");
	//При выводе Истории считаем только строки текущей версии 
	Если Не КонтрольИтога или СтрокаТЧ.РасчетИтогов Тогда
		//TODO Вынести имена полей в отдельное свойство Контекста, как Контекст.Показатели.ТЗПоказателей
		Попытка
			Итоги.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = Итоги.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику + СтрокаТЧ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
		Исключение
		КонецПопытки;	
		Попытка
			Итоги.КВСумма 						= Итоги.КВСумма 						+ СтрокаТЧ.КВСумма;
		Исключение
		КонецПопытки;		
		Попытка	
			Итоги.ПолнаяПремия 					= Итоги.ПолнаяПремия 					+ СтрокаТЧ.ПолнаяПремия;
		Исключение
		КонецПопытки;		
		Попытка
			Итоги.НачисленнаяСуммаВзноса 		= Итоги.НачисленнаяСуммаВзноса 			+ СтрокаТЧ.НачисленнаяСуммаВзноса;
		Исключение
		КонецПопытки;		
		Попытка	
			Итоги.КВСуммаДляОтчета 				= Итоги.КВСуммаДляОтчета 				+ СтрокаТЧ.КВСуммаДляОтчета;
		Исключение
		КонецПопытки;		
		//Итоги.СуммаУдержаннаяАгентом 		= Итоги.СуммаУдержаннаяАгентом 			+ СтрокаТЧ.СуммаУдержаннаяАгентом;
		Попытка
			Итоги.Баланс_Брокер_Поставщик 		= Итоги.Баланс_Брокер_Поставщик 		+ СтрокаТЧ.Баланс_Брокер_Поставщик;
		Исключение
		КонецПопытки;		
		Попытка
			Итоги.СуммаКПеречислениюАгенту 		= Итоги.СуммаКПеречислениюАгенту 		+ СтрокаТЧ.СуммаКПеречислениюАгенту;
		Исключение
		КонецПопытки;		
		Попытка Итоги.СуммаКПеречислениюПоставщику 	= Итоги.СуммаКПеречислениюПоставщику 	+ СтрокаТЧ.СуммаКПеречислениюПоставщику;
		Исключение
		КонецПопытки;		
		Для Каждого СтрокаТЗ Из Контекст.Показатели.ТЗПоказателей Цикл
			Если СтрокаТЗ.РассчитыватьИтоги Тогда
				
					Имя = СтрокаТЗ.ИмяПоказателя;
				Попытка
					Итоги[Имя] = Итоги[Имя] + СтрокаТЧ[Имя];
				Исключение
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	
КонецПроцедуры	

/////////////////////////////////////////////////////////////////////////////////
//     процессор подстановок ТЧ Передачи БСО Поставщику 
/////////////////////////////////////////////////////////////////////////////////

//// 2-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в ТЧ Передачи БСО Поставщику:
Процедура ПСП_ТЧ_ПБП(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_ПБП (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");		
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;	
	ТЗ_ТЧДокумента = Контекст.ТЧДокумента;
	ТЗ_ТЧДокумента.Сортировать("СК,ВидБСО,НомерБСО");
	ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);
	//Указываем, какую строку повторять на каждой странице при печати
	ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
	Если ОблШапкаТаб <> Неопределено Тогда
		Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
			ВерхняяГраница = ОблШапкаТаб.Верх;
			НижняяГраница = ОблШапкаТаб.Низ;
			Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
				ОбластьПовторения = ОблШапкаТаб;
			Иначе
				ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
				ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
			КонецЕсли;
			ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
		КонецЕсли;	
		Если Контекст.ФиксацияСверху Тогда
			ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
		КонецЕсли;
	КонецЕсли;	
	Итоги = ПолучитьСтруктуруИтогов_Общее(Контекст);
	Сортировка = "";
	ОбластьМакета_ГруппаСК = Макет.Области.Найти("ГруппаСК");
	Если ОбластьМакета_ГруппаСК = Неопределено Тогда
		бОбрабатыватьГруппуСК = Ложь;
	Иначе
		ОбластьМакета_ГруппаСК 	= Макет.ПолучитьОбласть("ГруппаСК");
		бОбрабатыватьГруппуСК 	= Истина;
		Если Контекст.ТЧДокумента.Колонки.Найти("СК") <> Неопределено Тогда
			Сортировка = Сортировка + ?(Сортировка = "", "",",") + "СК";
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета_ГруппаВидБСО  = Макет.Области.Найти("ГруппаВидБСО");
	Если ОбластьМакета_ГруппаВидБСО = Неопределено Тогда
		бОбрабатыватьГруппуВидБСО = Ложь;
	Иначе
		ОбластьМакета_ГруппаВидБСО	= Макет.ПолучитьОбласть("ГруппаВидБСО");
		бОбрабатыватьГруппуВидБСО	= Истина;
		Если Контекст.ТЧДокумента.Колонки.Найти("ВидБСО") <> Неопределено Тогда
			Сортировка = Сортировка + ?(Сортировка = "", "",",") + "ВидБСО"; 
		КонецЕсли;
	КонецЕсли;	
	ЭтоПередачаБСО = Контекст.Объект.Метаданные() = Метаданные.Документы.уб_ПередачаБСОПоставщику И Контекст.Объект.ВидОперации = Перечисления.уб_ВидыОперацииПередачиБСОвСК.ПередачаБСО;
	Для Каждого СтрокаТЧ Из ТЗ_ТЧДокумента Цикл
		Если Контекст.Отладка.Групповая И Контекст.Контейнер_Итоги.НомерТекущейСтроки >= Контекст.Отладка.МаксКоличествоСтрокТЧ Тогда
			Прервать;	
		КонецЕсли;
		//не печатаем строки с БСО карточек
		Попытка
			Если ЭтоПередачаБСО И СтрокаТЧ.ВидБСО.Тип = Перечисления.уб_ТипыБСО.Карточка Тогда
				Продолжить
			КонецЕсли;
		Исключение
		КонецПопытки;
		Если бОбрабатыватьГруппуСК Тогда
			Если Итоги.ТекущаяСК <> СтрокаТЧ.СК Тогда
				ОбластьМакета_ГруппаСК.Параметры.СК = Строка(СтрокаТЧ.СК);	
				ТабДок.Вывести(ОбластьМакета_ГруппаСК);
			КонецЕсли;
			Итоги.ТекущаяСК = СтрокаТЧ.СК;
		КонецЕсли;
		Если бОбрабатыватьГруппуВидБСО Тогда
			Если Итоги.ТекущийВидБСО <> СтрокаТЧ.ВидБСО Тогда
				ОбластьМакета_ГруппаВидБСО.Параметры.ВидБСО = Строка(СтрокаТЧ.ВидБСО);	
				ТабДок.Вывести(ОбластьМакета_ГруппаВидБСО);
			КонецЕсли;
			Итоги.ТекущийВидБСО = СтрокаТЧ.ВидБСО;
		КонецЕсли;
		//Контекст.РазрешенныеТипыБСО - Присутствует в контексте всегда. 
		//Если список пуст, то считается, что разрешены все БСО
		//Если не пуст, то разрешены только перечисленные в списке. Только их строки и будут выводиться
		Если Контекст.РазрешенныеТипыБСО.Количество() = 0
		//ИЛИ Контекст.РазрешенныеТипыБСО.НайтиПоЗначению(СтрокаТЧ.ВидБСО.Тип) <> Неопределено 
		Тогда
			УстановитьТекущийКонтейнер(Контекст,"СтрокаТЧ",СтрокаТЧ);
			ПСП_СтрокиТЧ_ПБП(Контекст, ИмяОбластиСтрока);
		КонецЕсли;
	КонецЦикла;
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

//// 2-й УРОВЕНЬ |	Процессов заполняет типовые места подстановки в ТЧ Поступления БСО:
Процедура ПСП_ТЧ_ПБ(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка") Экспорт

	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_ПБП (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");	
	
	Контекст.Вставить("КоличествоПолисовВсего", 0);
	
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;
	
	ТЗ_ТЧДокумента = Контекст.Объект.БСО;
	
	ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);
	
	//Указываем, какую строку повторять на каждой странице при печати
	ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
	Если ОблШапкаТаб <> Неопределено Тогда
		Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
			ВерхняяГраница = ОблШапкаТаб.Верх;
			НижняяГраница = ОблШапкаТаб.Низ;
			Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
				ОбластьПовторения = ОблШапкаТаб;
			Иначе
				ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
				ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
			КонецЕсли;
			ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
		КонецЕсли;	
		Если Контекст.ФиксацияСверху Тогда
			ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
		КонецЕсли;
	КонецЕсли;	
	Счетчик = 1;
	Для Каждого Строка Из ТЗ_ТЧДокумента Цикл
		ОблСтрока = Макет.ПолучитьОбласть(ИмяОбластиСтрока);
		ОблСтрока.Параметры.НомерСтроки = Счетчик;
		ОблСтрока.Параметры.ВидБСО		= Строка.ВидБСО;
		ОблСтрока.Параметры.СерияБСО	= СокрЛП(Строка.СерияБСО);
		НачНомерБСО = Строка.НачНомерБСО;
		КонНомерБСО = ?(Строка.КонНомерБСО = 0, НачНомерБСО, Строка.КонНомерБСО);
		ОблСтрока.Параметры.НачНомерБСО = НачНомерБСО;
		ОблСтрока.Параметры.КонНомерБСО = КонНомерБСО;
		ОблСтрока.Параметры.КоличествоПолисов = Строка.КоличествоБСО;
		Контекст.КоличествоПолисовВсего = Контекст.КоличествоПолисовВсего + Строка.КоличествоБСО;
		ТабДок.Вывести(ОблСтрока);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры

//// 3-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в СТРОКЕ ТЧ Передачи БСО Поставщику:
//1.1 		НомерСтроки
//2.1 СК
//3.1 ВидБСО
//4.1 НомерБСО
//5.1 НомерПолиса
//6.1 Количество
//7.1 Комментарий
//8.1 ДатаУтратыПорчи
//8.2 ДатаУтратыПорчи_Кратко
//9.1 СостояниеБСО
//9.2 СостояниеДляПоставщика
//10.1 Страхователь
//10.2 Страхователь_Расширение
//11.1 ДатаОформленияПолиса
//11.2 ДатаОформленияПолиса_Кратко
Процедура ПСП_СтрокиТЧ_ПБП(Контекст, ИмяОбласти = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_СтрокиТЧ_ПБП (Область: '" + ИмяОбласти + "')");
	Область_Строка = ПолучитьОбласть(Контекст, ИмяОбласти);
	ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст);
	СтрокаТЧ = Контекст.Контейнер_СтрокаТЧ;
	Итоги = Контекст.Контейнер_Итоги;
	Итоги.НомерТекущейСтроки = Итоги.НомерТекущейСтроки + 1;
	Итоги.ТекущаяСК = СтрокаТЧ.СК;
	//===========================================================
	Если Область_Строка <> Неопределено Тогда
		Прмт = Область_Строка.Параметры;
		//СтрокиПараметров = Контекст.ОбъектПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
		СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
		RegExp = Новый COMОбъект("VBScript.RegExp");
		Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
			//здесь была частная функция для Ингосстраха
			Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
			Контекст.ОперативныйКонтейнер = Контекст.Контейнер; //Восстанавливаем значение оперативного контейнера (может измениться модификатором при заполнении параметра)
			ИмяПараметра = СтрокаПараметра.Параметр;
			Если ИмяПараметра <> "" Тогда
				ОПТЧ(Контекст, Прмт, RegExp);
			КонецЕсли;
		КонецЦикла;
		RegExp = Null;
		//===========================================================
		//для проверки частного случая по передаче Ингосстрах - квитанции не выводим
		Если Не Контекст.Свойство("Ингосстрах") Или Контекст.Ингосстрах.ВыводитьЭтуСтроку Тогда
			Контекст.ТабличныйДокумент.Вывести(Область_Строка);
		КонецЕсли;
		отладка_Лог_КонецПроцедуры(Контекст);
	КонецЕсли;
	
КонецПроцедуры	
/////////////////////////////////////////////////////////////////////////////////
//     процессор подстановок ТЧ Списания БСО 
/////////////////////////////////////////////////////////////////////////////////

//// 2-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в ТЧ Списание БСО :
Процедура ПСП_ТЧ_СБ(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_СБ (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");	
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;	
	ТЗ_ТЧДокумента = Контекст.ТЧДокумента;
	ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);
	//Указываем, какую строку повторять на каждой странице при печати
	ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
	Если ОблШапкаТаб <> Неопределено Тогда
		Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
			ВерхняяГраница = ОблШапкаТаб.Верх;
			НижняяГраница = ОблШапкаТаб.Низ;
			Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
				ОбластьПовторения = ОблШапкаТаб;
			Иначе
				ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
				ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
			КонецЕсли;
			ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
		КонецЕсли;
		Если Контекст.ФиксацияСверху Тогда
			ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
		КонецЕсли;	
	КонецЕсли;	
	Итоги = ПолучитьСтруктуруИтогов_Общее(Контекст);		
	Попытка
		ОбластьМакета_ГруппаПОА = Макет.ПолучитьОбласть("ГруппаПоставшик_ОрганизацияАгент");
		бОбрабатыватьГруппуПОА = Истина;	
	Исключение
		бОбрабатыватьГруппуПОА = Ложь;	
	КонецПопытки;
	Попытка
		ОбластьМакета_ГруппаСК = Макет.ПолучитьОбласть("ГруппаСК");
		бОбрабатыватьГруппуСК = Истина;	
	Исключение
		бОбрабатыватьГруппуСК = Ложь;	
	КонецПопытки;	
	Для Каждого СтрокаТЧ Из ТЗ_ТЧДокумента Цикл		
		Если Контекст.Отладка.Групповая И Контекст.Контейнер_Итоги.НомерТекущейСтроки >= Контекст.Отладка.МаксКоличествоСтрокТЧ Тогда
			Прервать;	
		КонецЕсли;		
		Если бОбрабатыватьГруппуПОА Тогда
			Если Итоги.ТекущийПоставщик <> СтрокаТЧ.Поставщик ИЛИ Итоги.ТекущийОрганизацияАгент <> СтрокаТЧ.ОрганизацияАгент Тогда
				ОбластьМакета_ГруппаПОА.Параметры.Поставщик = СтрокаТЧ.Поставщик.НаименованиеКраткое;	
				ОбластьМакета_ГруппаПОА.Параметры.ОрганизацияАгент = СтрокаТЧ.ОрганизацияАгент.НаименованиеДляДоговоровИПлатежныхДокументов;	
				ТабДок.Вывести(ОбластьМакета_ГруппаПОА);
			КонецЕсли;
			Итоги.ТекущийПоставщик = СтрокаТЧ.Поставщик;
			Итоги.ТекущийОрганизацияАгент = СтрокаТЧ.ОрганизацияАгент;
		КонецЕсли;		
		Если бОбрабатыватьГруппуСК Тогда
			Если Итоги.ТекущаяСК <> СтрокаТЧ.СК Тогда
				ОбластьМакета_ГруппаСК.Параметры.СК = Строка(СтрокаТЧ.СК);	
				ТабДок.Вывести(ОбластьМакета_ГруппаСК);
			КонецЕсли;
			Итоги.ТекущаяСК = СтрокаТЧ.СК;
		КонецЕсли;		
		УстановитьТекущийКонтейнер(Контекст,"СтрокаТЧ",СтрокаТЧ);
		ПСП_СтрокиТЧ_СБ(Контекст,ИмяОбластиСтрока);	
	КонецЦикла;
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

//// 3-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в СТРОКЕ ТЧ Списание БСО :
//1.1 		НомерСтроки
//2.1 Поставщик
//3.1 ОрганизацияАгент
//4.1 СК
//5.1 ВидБСО
//6.1 НомерБСО
//7.1 НомерПолиса
//8.1 Количество
//9.1 Комментарий
//10.1 ДатаУтратыПорчи
//10.2 ДатаУтратыПорчи_Кратко
//11.1 ТипСписания
//11.2 ТекСостояниеБСО
//11.3 ТекПоложениеБСО
//11.4 ВидУтратыБСО
//12.1 Страховател
//12.2 Страхователь_Расширение
//13.1 ДатаОформленияПолиса
//13.2 ДатаОформленияПолиса_Кратко
Процедура ПСП_СтрокиТЧ_СБ(Контекст, ИмяОбласти = "Строка") Экспорт
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_СтрокиТЧ_СБ (Область: '" + ИмяОбласти + "')");	
	
	Область_Строка = ПолучитьОбласть(Контекст, ИмяОбласти);
	ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст);
	
	СтрокаТЧ = Контекст.Контейнер_СтрокаТЧ;
	
	Итоги = Контекст.Контейнер_Итоги;
	Итоги.НомерТекущейСтроки = Итоги.НомерТекущейСтроки + 1;
	Итоги.ТекущийПоставщик = СтрокаТЧ.Поставщик;
	Итоги.ТекущийОрганизацияАгент = СтрокаТЧ.ОрганизацияАгент;
	Итоги.ТекущаяСК = СтрокаТЧ.ВидБСО.Владелец;
	
	//===========================================================
	Прмт = Область_Строка.Параметры;
	
	//СтрокиПараметров = Контекст.ОбъектПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
	СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
	RegExp = Новый COMОбъект("VBScript.RegExp");
	Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
		Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
		Контекст.ОперативныйКонтейнер = Контекст.Контейнер; //Восстанавливаем значение оперативного контейнера (может измениться модификатором при заполнении параметра)
		
		ИмяПараметра = СтрокаПараметра.Параметр;
		
		Если ИмяПараметра = "" Тогда
			
		//ИначеЕсли ИмяПараметра = "<особое имя параметра>" Тогда
		//	Прмт[ИмяПараметра] = <особый код заполнения параметра>;
		
		Иначе
			ОПТЧ(Контекст, Прмт, RegExp);
		КонецЕсли;
	КонецЦикла;
	RegExp = Null;
	
	//===========================================================
	
	Контекст.ТабличныйДокумент.Вывести(Область_Строка);
	
	отладка_Лог_КонецПроцедуры(Контекст);	
КонецПроцедуры
                   
Процедура ПеремещениеБСО_Акт(Контекст) Экспорт

	Агент 		= Контекст.Контейнер_Документ.Агент;
	АгентКуда 	= Контекст.Контейнер_Документ.АгентКуда;
	Автор		= Контекст.Объект.Автор;
	
	Если ТипЗнч(Агент)=Тип("СправочникСсылка.Контрагенты") Тогда
		ФИОАгента = СокрЛП(Агент.ОсновноеКонтактноеЛицо.Наименование);	
	ИначеЕсли ТипЗнч(Агент)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ФИОАгента = СокрЛП(Агент.Наименование);	
	КонецЕсли;
	
	Если ТипЗнч(АгентКуда)=Тип("СправочникСсылка.Контрагенты") Тогда
		ФИОАгентаКуда = СокрЛП(АгентКуда.ОсновноеКонтактноеЛицо.Наименование);	
	ИначеЕсли ТипЗнч(АгентКуда)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ФИОАгентаКуда = СокрЛП(АгентКуда.Наименование);	
	КонецЕсли;
	
	Если Не ЗначениеНеЗаполнено(Агент) Тогда
		Передающий		= " агента "+Агент;
		//TODO - глобальные переменные во внешнем соединении. Исправить на инициализированные параметры сеанса.
		#Если Клиент И Сервер Тогда
		Принимающий		= ОсновнаяОрганизация;
		#КонецЕсли
		ФИОПринимающего	= Автор;
		НаименованиеАгента = Агент.Наименование;
		ФИОПередающего	= ФИОАгента;
		Если ТипЗнч(Агент)=Тип("СправочникСсылка.Контрагенты") Тогда
			Если Агент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				НаименованиеАгента=НаименованиеАгента+" в лице "+ФИОАгента;
				ФИОПередающего	= ФИОАгента;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не ЗначениеНеЗаполнено(АгентКуда) Тогда
		//TODO - глобальные переменные во внешнем соединении. Исправить на инициализированные параметры сеанса.
		#Если Клиент И Сервер Тогда
		Передающий			= ОсновнаяОрганизация;
		#КонецЕсли
		Принимающий			= " агента " + АгентКуда;
		ФИОПередающего		= Автор;
		НаименованиеАгента 	= АгентКуда.Наименование;
		ФИОПринимающего		= ФИОАгентаКуда;
		Если ТипЗнч(АгентКуда)=Тип("СправочникСсылка.Контрагенты") Тогда
			Если АгентКуда.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				НаименованиеАгента=НаименованиеАгента+" в лице "+ФИОАгентаКуда;
				ФИОПринимающего	= ФИОАгентаКуда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПеремещениеБСО = Новый Структура;
	ПеремещениеБСО.Вставить("ФИОАгента",			ФИОАгента);
	ПеремещениеБСО.Вставить("ФИОАгентаКуда",		ФИОАгентаКуда);
	ПеремещениеБСО.Вставить("Передающий",			Передающий);
	ПеремещениеБСО.Вставить("Принимающий",			Принимающий);
	ПеремещениеБСО.Вставить("ФИОПередающего",		ФИОПередающего);
	ПеремещениеБСО.Вставить("ФИОПринимающего",		ФИОПринимающего);
	ПеремещениеБСО.Вставить("НаименованиеАгента",   НаименованиеАгента);
	
	Контекст.Вставить("ПеремещениеБСО", ПеремещениеБСО);	
	Контекст.ТЧДокумента.Сортировать("НомерСтроки");

КонецПроцедуры

Процедура ПеремещениеБСО_АктКСостоянием(Контекст) Экспорт

	Агент 		= Контекст.Контейнер_Документ.Агент;
	АгентКуда 	= Контекст.Контейнер_Документ.АгентКуда;
	Дата		= Контекст.Контейнер_Документ.Дата;
	
	//Устанавливаем количество экземпляров для печати
	
	НаправлениеПередачиБСО 	= "";
	ПодразделениеОт 		= уб_СС.ПолучитьПодразделениеАгента(Агент, Дата, Истина);
	ПодразделениеКуда 		= уб_СС.ПолучитьПодразделениеАгента(АгентКуда, Дата, Истина);
	
	Если ПодразделениеОт = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
		И ПодразделениеКуда <> ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
	  Тогда
		Если НЕ ЗначениеНеЗаполнено(АгентКуда) И ТипЗнч(АгентКуда.Ссылка) <> Тип("СправочникСсылка.Контрагенты") Тогда
			КоличествоЭкземпляров = 3;
		Иначе
			КоличествоЭкземпляров = 1;
		КонецЕсли;
		НаправлениеПередачиБСО = Символы.ВК + Символы.ПС + "(выдача отделом БСО " + ПодразделениеОт.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов + ")"; 
	ИначеЕсли ПодразделениеОт <> ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
		И ПодразделениеКуда = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
	  Тогда
		НаправлениеПередачиБСО = Символы.ВК + Символы.ПС + "(прием отделом БСО " + ПодразделениеКуда.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов + ")"; 
        КоличествоЭкземпляров = 1;
	ИначеЕсли ПодразделениеОт = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
		И ПодразделениеКуда = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
	  Тогда
		НаправлениеПередачиБСО = "(перемещение внутри отдела БСО " + ПодразделениеОт.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов + ")"; 
		КоличествоЭкземпляров = 1;
	ИначеЕсли ПодразделениеОт <> ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО
		И ПодразделениеКуда <> ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО 
	  Тогда
		НаправлениеПередачиБСО = "(перемещение между сотрудниками " + ПодразделениеОт.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов + ")"; 
		КоличествоЭкземпляров = 1;		
	КонецЕсли;
	
	// Создаем нужные данные по перемещению в контексте
	
	ПеремещениеБСО = Новый Структура;
	
	ПеремещениеБСО.Вставить("КоличествоЭкземпляров", КоличествоЭкземпляров);
	ПеремещениеБСО.Вставить("Экземпляр", 0);
	ПеремещениеБСО.Вставить("ПередающийДляШапки");
	ПеремещениеБСО.Вставить("ПринимающийДляШапки");
	ПеремещениеБСО.Вставить("Перемещение");
	ПеремещениеБСО.Вставить("ПеремещениеКуда");
	ПеремещениеБСО.Вставить("НаправлениеПередачиБСО", НаправлениеПередачиБСО);
	ПеремещениеБСО.Вставить("ПередающийДляПодписи");
	ПеремещениеБСО.Вставить("ФИОПередающего");
	ПеремещениеБСО.Вставить("ПринимающийДляПодписи");
	ПеремещениеБСО.Вставить("ФИОПринимающего");
	ПеремещениеБСО.Вставить("Выдавший");

	Контекст.Вставить("ПеремещениеБСО", ПеремещениеБСО);

КонецПроцедуры

Процедура ПСП_ПеремещениеБСО(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_ПеремещениеБСО (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");	
	 
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;
	
	КПБСО 					= Контекст.ПеремещениеБСО;
	Агент 					= Контекст.Контейнер_Документ.Агент;
	АгентКуда 				= Контекст.Контейнер_Документ.АгентКуда;
	Дата 					= Контекст.Контейнер_Документ.Дата;
	Экз 					= КПБСО.Экземпляр;
	Выдал 					= Контекст.Контейнер_Документ.Выдал;
	ПередающийФИО 			= "";
	ПередающийДляШапки 		= "";
	ПередающийДляПодписи 	= "";
	ПринимающийФИО 			= "";
	ПринимающийДляШапки 	= "";
	ПринимающийДляПодписи 	= "";
	
	Контекст.Объект.ПолучитьПодписиДляСтороны(Агент, 		Дата, ПередающийФИО, 	ПередающийДляШапки, 	ПередающийДляПодписи);	
	Контекст.Объект.ПолучитьПодписиДляСтороны(АгентКуда, 	Дата, ПринимающийФИО, 	ПринимающийДляШапки, 	ПринимающийДляПодписи);	

  	Если Найти(ИмяОбластиШапка, "ШапкаТаблицы") = 1 Тогда
		КПБСО.Экземпляр = КПБСО.Экземпляр + 1;
	КонецЕсли;
	
	КПБСО.НаправлениеПередачиБСО 	= "(передача выездному специалисту)";
	КПБСО.ПередающийДляШапки 		= ?(Экз = 0, ПередающийДляШапки,	ПринимающийДляШапки);
	КПБСО.ПринимающийДляШапки 		= ?(Экз = 0, ПринимающийДляШапки,	"Выездной специалист");
	КПБСО.ПередающийДляПодписи 		= ?(Экз = 0, ПередающийДляПодписи, 	ПринимающийДляПодписи);
	КПБСО.ФИОПередающего 			= ?(Экз = 0, ПередающийФИО, 		ПринимающийФИО);
	КПБСО.ПринимающийДляПодписи 	= ?(Экз = 0, ПринимающийДляПодписи, "Выездной специалист");
	КПБСО.ФИОПринимающего 			= ?(Экз = 0, ПринимающийФИО, 		"____________________");

	ТЗ_ТЧДокумента = Контекст.ТЧДокумента;
	
	ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);

	//Указываем, какую строку повторять на каждой странице при печати
	ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
	Если ОблШапкаТаб <> Неопределено Тогда
		Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
			ВерхняяГраница = ОблШапкаТаб.Верх;
			НижняяГраница = ОблШапкаТаб.Низ;
			Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
				ОбластьПовторения = ОблШапкаТаб;
			Иначе
				ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
				ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
			КонецЕсли;
			ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
		КонецЕсли;
		Если Контекст.ФиксацияСверху Тогда
			ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
		КонецЕсли;
	КонецЕсли;	
	Если Найти(ИмяОбластиШапка, "ШапкаТаблицы") = 1 Тогда		
		Итоги = ПолучитьСтруктуруИтогов_Общее(Контекст);
		Если ТЗ_ТЧДокумента.Колонки.Найти("Документ") <> Неопределено Тогда
			ТЗ_ТЧДокумента.Сортировать("Документ");
		КонецЕсли;
		Для Каждого СтрокаТЧ Из ТЗ_ТЧДокумента Цикл			
			Если Контекст.Отладка.Групповая И Контекст.Контейнер_Итоги.НомерТекущейСтроки >= Контекст.Отладка.МаксКоличествоСтрокТЧ Тогда
				Прервать;	
			КонецЕсли;
			//чкн
			ОбластьГруппаДокументов = Макет.Области.Найти("ГруппаДокументов");
			Если ОбластьГруппаДокументов = Неопределено Тогда
				бОбрабатыватьГруппуДокументов = Ложь
			Иначе
				ОбластьМакета_ГруппаДокументов = Макет.ПолучитьОбласть("ГруппаДокументов");
				бОбрабатыватьГруппуДокументов = Истина;
			КонецЕсли;
			Если бОбрабатыватьГруппуДокументов И Контекст.МассивОбъектов.Количество() > 1 Тогда
				Если Итоги.ТекущийДокумент <> СтрокаТЧ.Документ Тогда
					ОбластьМакета_ГруппаДокументов.Параметры.Документ = Строка(СтрокаТЧ.Документ);	
					ТабДок.Вывести(ОбластьМакета_ГруппаДокументов);
				КонецЕсли;
				Итоги.ТекущийДокумент = СтрокаТЧ.Документ;
			КонецЕсли;
			//чкн
			УстановитьТекущийКонтейнер(Контекст,"СтрокаТЧ",СтрокаТЧ);					
			ПСП_СтрокиТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст, ИмяОбластиСтрока);		        		
		КонецЦикла;
	КонецЕсли;
	Контекст.ТЧДокумента.Сортировать("НомерСтроки");
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
//     процессор подстановок ТЧ Уведомление поставщика об утрате БСО 
/////////////////////////////////////////////////////////////////////////////////

//// 2-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в ТЧ Списание БСО Поставщику:
Процедура ПСП_ТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст, ИмяОбластиШапка = "ШапкаТаб", ИмяОбластиСтрока = "Строка", ПоказыватьШапку = Истина) Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_ТЧ_УведомлениеПоставщикаОбУтратеБСО (Область шапки: '" + ИмяОбластиШапка + "', Область строки: '" + ИмяОбластиСтрока + "')");	
	ТабДок = Контекст.ТабличныйДокумент;
	Макет = Контекст.Макет;
	Если ПоказыватьШапку Тогда
		ПСП(Контекст, ИмяОбластиШапка, Контекст.Предупреждать);	
		//Указываем, какую строку повторять на каждой странице при печати
		ОблШапкаТаб = ТабДок.Области.Найти(ИмяОбластиШапка);
		Если ОблШапкаТаб <> Неопределено Тогда
			Если Контекст.ПовторятьШапкуТаблицыПриПечати Тогда
				ВерхняяГраница = ОблШапкаТаб.Верх;
				НижняяГраница = ОблШапкаТаб.Низ;
				Если Контекст.КоличествоСтрокПовторенияШапкиТЧ < 1 Тогда
					ОбластьПовторения = ОблШапкаТаб;
				Иначе
					ВыводитьВверхДо = Макс(ВерхняяГраница, НижняяГраница - Контекст.КоличествоСтрокПовторенияШапкиТЧ + 1);
					ОбластьПовторения = ТабДок.Область("R"+ВыводитьВверхДо+":R" + НижняяГраница);
				КонецЕсли;
				ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовторения;
			КонецЕсли;
			Если Контекст.ФиксацияСверху Тогда
				ТабДок.ФиксацияСверху = ОблШапкаТаб.Низ;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Итоги = ПолучитьСтруктуруИтогов_Общее(Контекст);		
	Если Не Контекст.Объект.Метаданные() = Метаданные.Документы.уб_УведомлениеОДосрочномПрекращенииДействияДоговора Тогда
		ТЗ_ТЧДокумента = Контекст.ТЧДокумента;
		Для Каждого СтрокаТЧ Из ТЗ_ТЧДокумента Цикл
			Если Контекст.Отладка.Групповая И Контекст.Контейнер_Итоги.НомерТекущейСтроки >= Контекст.Отладка.МаксКоличествоСтрокТЧ Тогда
				Прервать;	
			КонецЕсли;		
			УстановитьТекущийКонтейнер(Контекст,"СтрокаТЧ",СтрокаТЧ);				
			ПСП_СтрокиТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст,ИмяОбластиСтрока);	
		КонецЦикла;
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

//// 3-й УРОВЕНЬ |  Процессор заполняет типовые места подстановки в СТРОКЕ ТЧ Списание БСО Поставщику:
//1.1 		НомерСтроки
//2.1 Поставщик
//3.1 ОрганизацияАгент
//4.1 СК
//5.1 ВидБСО
//6.1 НомерБСО
//7.1 НомерПолиса
//8.1 Количество
//9.1 Комментарий
//10.1 ДатаУтратыПорчи
//10.2 ДатаУтратыПорчи_Кратко
//11.1 ТипСписания
//11.2 ТекСостояниеБСО
//11.3 ТекПоложениеБСО
//11.4 ВидУтратыБСО
//12.1 Страховател
//12.2 Страхователь_Расширение
//13.1 ДатаОформленияПолиса
//13.2 ДатаОформленияПолиса_Кратко
Процедура ПСП_СтрокиТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст, ИмяОбласти = "Строка") Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПСП_СтрокиТЧ_УведомлениеПоставщикаОбУтратеБСО (Область: '" + ИмяОбласти + "')");	
	
	Область_Строка = ПолучитьОбласть(Контекст, ИмяОбласти);
	ПСП_ЗаполнениеПараметровОбласти_ПоЧастномуКоду(Контекст);
	
	СтрокаТЧ = Контекст.Контейнер_СтрокаТЧ;
	
	Итоги = Контекст.Контейнер_Итоги;
	Итоги.НомерТекущейСтроки = Итоги.НомерТекущейСтроки + 1;
	
	//===========================================================
	Прмт = Область_Строка.Параметры;
	
	//СтрокиПараметров = Контекст.ОбъектПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
	СтрокиПараметров = Контекст.СтруктураОбъектаПФ.ПараметрыМакета.НайтиСтроки(Новый Структура("Область,ЕстьКодЗаполнения,НетВМакете", ИмяОбласти, Ложь, Ложь));
	RegExp = Новый COMОбъект("VBScript.RegExp");
	Для каждого СтрокаПараметра Из СтрокиПараметров Цикл
		Контекст.Отладка.ТекущаяСтрокаПараметра = СтрокаПараметра;
		Контекст.ОперативныйКонтейнер = Контекст.Контейнер; //Восстанавливаем значение оперативного контейнера (может измениться модификатором при заполнении параметра)
		ИмяПараметра = СтрокаПараметра.Параметр;		
		Если ИмяПараметра = "" Тогда
		//ИначеЕсли ИмяПараметра = "<особое имя параметра>" Тогда
		//	Прмт[ИмяПараметра] = <особый код заполнения параметра>;
		Иначе
			ОПТЧ(Контекст, Прмт, RegExp);
		КонецЕсли;
	КонецЦикла;
	RegExp = Null;
	
	//===========================================================	
	Контекст.ТабличныйДокумент.Вывести(Область_Строка);
	
	отладка_Лог_КонецПроцедуры(Контекст);
	
КонецПроцедуры	

// Рассчитывает итог по выбранной колонке
//
// Параметры:
//  ТабЗнач  - ТаблицаЗначений
//                 
//  Колонка  - строка,выбранная колонка 
//
// Возвращаемое значение:
//   <Число>   - итог по выбранной колонке
//
Функция РассчитатьИтогиТЗПоКолонке(ТабЗнач, Колонка) Экспорт
	
	Итог=0;
	Попытка
		Для Каждого Строка Из ТабЗнач Цикл
			Итог	= Итог + Строка[Колонка];
		КонецЦикла;
		Возврат Итог;
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции // РассчитатьИтогиЧЗПоКолонке()

/////////////////////////////////////////////////
///////////        ПФФ        ///////////////////
/////////////////////////////////////////////////

Функция ОПТЧ(Контекст, ПараметрыОбласти, RegExp = Неопределено) Экспорт
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПФ.ОПТЧ");
	Контекст.Отладка.МаксСтатусОшибкиПриЗаполненииПараметра = 0;
	//В процессе заполнения параметра содержит максимальный статус из всех произошедших ошибок
	ИмяПараметра = Контекст.Отладка.ТекущаяСтрокаПараметра.Параметр;
	Контейнер = Контекст.Контейнер;
	Свойство = ИмяПараметра;
	Контекст.ОперативныйКонтейнер = Контейнер;
	бНетРегВыр = (RegExp = Неопределено);
	Если бНетРегВыр Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
	КонецЕсли;
	RegExp.MultiLine = Ложь; // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Ложь; // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	//Для режима отладки
	Контекст.Отладка.ИмяТекущегоСвойства = Свойство;
	//Сначала обрабатываем зарезервированные имена параметров
	Рез = Истина;
	нСвойство = НРег(Свойство);
	Если Лев(нСвойство, 2) = "сп" Тогда
		аа = 12;
	КонецЕсли;
	Если нСвойство = "" Тогда
		ЗначениеСвойства = "";
		Перейти ~НаВыход;
	Иначе
		СвойствоИлиМассивФункций = ПолучитьМассивФункций(Контекст, Свойство, RegExp);
		ЗначениеСвойства = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, СвойствоИлиМассивФункций, Истина);
	КонецЕсли;
	чСтатус = Контекст.Отладка.МаксСтатусОшибкиПриЗаполненииПараметра;
	бРежимОтладки = Контекст.Отладка.Включена;
	_ЗаполнительОтладки_ = "___________________";
	//                   в режиме: | обычный           |  Отладки
	
	Если чСтатус < 2 Тогда       //| результат         |  результат
		ЗначениеПараметра = ЗначениеСвойства;
	ИначеЕсли чСтатус = 2 Тогда  //| результат         |  ###########
		ЗначениеПараметра = ?(бРежимОтладки,ЗначениеСвойства,_ЗаполнительОтладки_);
	ИначеЕсли чСтатус = 3 Тогда  //| пусто             |  ###########
		ЗначениеПараметра = ?(бРежимОтладки,"",_ЗаполнительОтладки_);
	ИначеЕсли чСтатус > 3 Тогда  //| (### Ошибка! ###) |  ###########
		Рез = Ложь;
		ЗначениеПараметра = ?(бРежимОтладки,"(### Ошибка! ###)",_ЗаполнительОтладки_);
	КонецЕсли;
	Если Контекст.Свойство("Показатели") И Контекст.Показатели.Свойство("ТЗПоказателей") Тогда
		СтрокаТЗПоказателей = Контекст.Показатели.ТЗПоказателей.Найти(ИмяПараметра, "ИмяПоказателя");
		Если СтрокаТЗПоказателей <> Неопределено Тогда
			//ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧДЦ=" + СтрокаТЗПоказателей.РазрядностьДробнойЧасти + "; ЧН=0.00");
			ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧДЦ=" + 2 + "; ЧН=0.00");
		КонецЕсли;
	КонецЕсли;
	Попытка
		ПараметрыОбласти[ИмяПараметра] = ЗначениеПараметра;	
	Исключение
		Рез = Ложь;
	КонецПопытки;
	
	Если бНетРегВыр Тогда
		RegExp = Null;
	КонецЕсли;
~НаВыход:
	отладка_Лог_КонецПроцедуры(Контекст);
	Возврат Рез;
	
КонецФункции

Функция ПолучитьСвойство(Контекст, Знач Свойство, НеИспользоватьЗаполнитель = Ложь)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПолучитьСвойство ('" + Свойство + "')");	
	ИнфоОЗаместителе = "";
	//Список параметров, значение которых - результат особых вычислений	
	нСвойство = НРег(Свойство);
	Если нСвойство = "текущийгод" Тогда
		Рез = Формат(ТекущаяДата(),"ДФ='yyyy'");
		Перейти ~НаВыход;	
	ИначеЕсли нСвойство = "номердокумента" Тогда
		Рез = Дай_ТиповойНомер(Контекст.Объект);
		Перейти ~НаВыход;	
	ИначеЕсли нСвойство = "номердокументабезтипового" Тогда
		Рез = Дай_ТиповойНомер(Контекст.Объект, Ложь);
		Перейти ~НаВыход;
	ИначеЕсли нСвойство = "версияуб" Тогда
		Рез = Метаданные.Версия;
		Перейти ~НаВыход;
	ИначеЕсли нСвойство = "всегострок" Или нСвойство = "номерстроки"  Тогда
		// ТОДО	 преобразовать Итог(НомерТекущейСтроки)
		ИнфоОЗаместителе = "(Алиас затребованного свойства """ + Свойство + """; вызов из контейнера '" + Контекст.ОперативныйКонтейнер.Тип_ + "')";
		Свойство = "номертекущейстроки";
		Контекст.ОперативныйКонтейнер = Контекст.Контейнер_Итоги;
	ИначеЕсли Свойство = "бла-бла-бла" Тогда
	КонецЕсли;
	Если Найти(нСвойство, ".") <> 0 Тогда
		//получение вложенных данных
		Массив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(нСвойство, ".");
		Корень = Массив[0];
		Если ЕстьСвойство(Контекст, Корень) Тогда
			текУровень 			= Контекст.ОперативныйКонтейнер[Корень];
			МассивКоличество 	= Массив.Количество();
			ВызваноИсключение 	= Ложь;
			Для Индекс = 1 По МассивКоличество - 1 Цикл
				//много проверок на встроенную функцию Найти различных типов
				Попытка
					текУровень = текУровень[Массив[Индекс]]
				Исключение
					Рез = Неопределено;
					СОО = "В контейнере '" + Контекст.ОперативныйКонтейнер.Тип_ + "' не найдено свойство '" + Свойство + "'" + ИнфоОЗаместителе + "."; 
					отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0 + 1);
					ВызваноИсключение = Истина;
				КонецПопытки;
			КонецЦикла;
			Если Не ВызваноИсключение Тогда
				Рез = текУровень
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Контекст.ИмяОбъекта = "уб_ЗаявкаНаПечать" Тогда
		СвойствоИлиМассив = ПолучитьМассивФункций(Контекст, Свойство);
		Рез = ПолучитьСвойствоЗаявкиНаПечать(Контекст, СвойствоИлиМассив,, НеИспользоватьЗаполнитель);
	ИначеЕсли ЕстьСвойство(Контекст, Свойство) Тогда
		Рез = Контекст.ОперативныйКонтейнер[Свойство];	
	Иначе
		//свойство может быть с символами, не подходящих для именования ключа структуры
		Попытка
			Если Контекст.Свойство("Показатели") И Контекст.Показатели.Свойство(Свойство) Тогда
				Рез = Контекст.Показатели[Свойство];
			КонецЕсли;
		Исключение
		КонецПопытки;
		Если Рез = Неопределено Тогда
			СОО = "В контейнере '" + Контекст.ОперативныйКонтейнер.Тип_ + "' не найдено свойство '" + Свойство + "'" + ИнфоОЗаместителе + "."; 
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0 + 1);	
		КонецЕсли;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьСвойствоЗаявкиНаПечать(Контекст, Свойство, СимволЗаполнителя = "-", НеИспользоватьЗаполнитель = Ложь)

	Если Свойство = "Водитель2ДатаРождения" Тогда
		аа = 12;
	КонецЕсли;
	Попытка
		ЕстьСвойство = Контекст.ДанныеЗаявки.Свойство(Свойство);
	Исключение
		ЕстьСвойство = Ложь
	КонецПопытки;
	Если ЕстьСвойство И ЗначениеЗаполнено(Контекст.ДанныеЗаявки[Свойство]) Тогда
		Результат = Контекст.ДанныеЗаявки[Свойство];
	ИначеЕсли Не НеИспользоватьЗаполнитель Тогда
		Попытка
			Результат = ЗаполнительЗаявкиНаПечать(Контекст, Свойство, СимволЗаполнителя);
		Исключение
			Сообщить(">>>ЗаполнительЗаявкиНаПечать " +Свойство);
			Результат = "--";
		КонецПопытки;	
	КонецЕсли;
	Возврат Результат;

КонецФункции // ЗаполнительЗаявкаНаПечать()

Функция ЗаполнительЗаявкиНаПечать(Контекст, Свойство, СимволЗаполнителя = "-") Экспорт 

	Результат = "";
	Если Контекст.Заполнитель.Свойство(Свойство) Тогда
		ЧислоСимволов = Контекст.Заполнитель[Свойство];
	Иначе
		ЧислоСимволов = Контекст.Заполнитель.Общий;
	КонецЕсли;
	Для Счетчик = 1 По ЧислоСимволов Цикл
		Результат = Результат + СимволЗаполнителя;
	КонецЦикла;
	Возврат Результат;

КонецФункции // ЗаполнительЗаявкиНаПечать()

Функция ЕстьСвойство(Контекст, Свойство)
	
	Возврат (Контекст.ОперативныйКонтейнер.Владелец().Колонки.Найти(Свойство) <> Неопределено);
	
КонецФункции

Функция ПолучитьМассивФункций(Контекст, СтрокаРазбора, RegExp = Неопределено)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ПолучитьМассивФункций (Строка разбора: '" + СтрокаРазбора + "')");		
	бНетРегВыр = (RegExp = Неопределено);
	Если бНетРегВыр Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.MultiLine = Ложь; // истина — текст многострочный, ложь — одна строка
		RegExp.Global = Ложь; // истина — поиск по всей строке, ложь — до первого совпадения
		RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	КонецЕсли;
	//---------------------------------------------------------
	//Ищем имя функции и перечень аргументов
	RegExp.Pattern = "^\s*([А-Яа-я][А-Яа-я0-9_]*)\((.*?)\)\s*$";
	Рез = RegExp.Execute(СтрокаРазбора);
	Если Рез.Count > 0 Тогда
		ИмяФункции = Рез.Item(0).SubMatches(0);
		ПереченьАргументов = СокрЛП(Рез.Item(0).SubMatches(1));
		массивВложеннойФункции = Новый Массив();
		массивВложеннойФункции.Добавить(ИмяФункции);
		//ТОДО внести в скобки
		массивВложеннойФункции = РазобратьАргументы(Контекст, массивВложеннойФункции, ПереченьАргументов, RegExp);
		МассивФункций = массивВложеннойФункции;
	Иначе
		МассивФункций = СокрЛП(СтрокаРазбора);
	КонецЕсли;
	//---------------------------------------------------------
	Если бНетРегВыр Тогда
		RegExp = Null;
	КонецЕсли;
	
	отладка_Лог_КонецПроцедуры(Контекст);	
	
	Возврат МассивФункций;
	
КонецФункции

Функция РазобратьАргументы(Контекст, массивВложеннойФункции, ПереченьАргументов, RegExp)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "РазобратьАргументы (Перечень аргументов: '" + ПереченьАргументов + "')");	
	
	ДлинаСтроки = СтрДлина(ПереченьАргументов);	
	Стек = Новый Массив();
	ЛевСтр = "";
	ПравСтр = ПереченьАргументов;
	Добавлять = Истина;
	ПредыдущийСимвол = "";
	Для Сч = 1 по ДлинаСтроки Цикл
		Симв = Сред(ПереченьАргументов,Сч,1);
		//ПравСтр = Сред(Стр,Сч);
		Если Симв = "," И ПредыдущийСимвол <> "\" И Добавлять Тогда
			АргументИлиМассив = ПолучитьМассивФункций(Контекст, ЛевСтр, RegExp);	
			массивВложеннойФункции.Добавить(АргументИлиМассив);	
			ЛевСтр = "";
		ИначеЕсли Симв = "(" Тогда
			Добавлять = Ложь;
			ЛевСтр = ЛевСтр + Симв;
			Стек.Вставить(0,Сч); 
		ИначеЕсли Симв = ")" Тогда
			Попытка
				Стек.Удалить(0);
				ЛевСтр = ЛевСтр + Симв;
				Добавлять = Стек.Количество() = 0;
			Исключение
			КонецПопытки;
			//ЛевСтр = ЛевСтр + Симв;
			//Добавлять = Стек.Количество() = 0;
		ИначеЕсли Симв <> "\" Тогда
			ЛевСтр = ЛевСтр + Симв;
		КонецЕсли;
		ПредыдущийСимвол = Симв;
	КонецЦикла;
	АргументИлиМассив = ПолучитьМассивФункций(Контекст, ЛевСтр, RegExp);	
	массивВложеннойФункции.Добавить(АргументИлиМассив);		
	отладка_Лог_КонецПроцедуры(Контекст);		
	Возврат массивВложеннойФункции;
	
КонецФункции

Функция ВычислитьАргументИлиСвойствоИлиФункцию(
	Контекст, 
	СвойствоИлиМассивФункции, 
	бИмяСвойстваЕслиСтрока, 
	НеИспользоватьЗаполнитель = Ложь
	)
	
	//Функция вызывается из частных функций в тот момент, когда обрабатываются значения аргументов.
	//Если из структуры аргументов частной функции следует, что значение аргумента типа "строка" является
	//параметром функции, то бИмяСвойстваЕслиСтрока = Ложь
	//Если значение аргумента типа "строка" в обрабатываемой позиции трактуется как имя свойства контейнера 
	//то бИмяСвойстваЕслиСтрока = Истина	
	отладка_Лог_НачалоПроцедуры(Контекст, "ВычислитьАргументИлиСвойствоИлиФункцию ('" + Строка(СвойствоИлиМассивФункции) + "')");		
	ТипЗ = ТипЗнч(СвойствоИлиМассивФункции);	
	Рез = "";
	Если ТипЗ = Тип("Строка") Тогда
		Если бИмяСвойстваЕслиСтрока Тогда
			Если ЗначениеЗаполнено(СвойствоИлиМассивФункции) Тогда
				Рез = ПолучитьСвойство(Контекст, СвойствоИлиМассивФункции, НеИспользоватьЗаполнитель);
			Иначе
				СОО = "В функцию 'ВычислитьАргументИлиСвойствоИлиФункцию' передано пустое имя свойства контейнера.";
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
			КонецЕсли;
		Иначе
			Рез = СвойствоИлиМассивФункции;
		КонецЕсли;
	ИначеЕсли ТипЗ = Тип("Массив") Тогда
		ИмяФункции = СвойствоИлиМассивФункции[0];
		//Если ИмяФункции = "СП" Тогда
		//	аа = 12;
		//КонецЕсли;
		Если Не ЗначениеЗаполнено(ИмяФункции) Тогда
			СОО = "В функцию 'ВычислитьАргументИлиСвойствоИлиФункцию' передан массв функции с пустым первым аргументом (именем функции).";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
			ПоказатьДеревоФункций(СвойствоИлиМассивФункции, 0);
		Иначе
			СвойствоИлиМассивФункции.Удалить(0);
			Рез = ВыполнитьФункцию(Контекст, ИмяФункции, СвойствоИлиМассивФункции);
		КонецЕсли;
	Иначе
		Сообщить("Ошибка: элемент маcсива разбора строки параметра неподходящего типа: '" + ТипЗ + "'!",СтатусСообщения.Важное);	
		отладка_ПФ(Контекст, "", "", СтатусСообщения.Важное, 0+1);
	КонецЕсли;	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ВыполнитьФункцию(Контекст, ИмяФункции, мАргументы)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ВыполнитьФункцию ('" + ИмяФункции + "')");	
	
	ИмяФ = ВРег(ИмяФункции);
	Рез = "";
	Если НЕ ЗначениеЗаполнено(ИмяФ) Тогда
		СОО = "В функцию 'ВыполнитьФункцию' передано пустое имя функции!";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
	ИначеЕсли ИмяФ = "ТЕКУЩАЯДАТА" ИЛИ ИмяФ = "ТДАТА"  Тогда
		отладка_Лог_НачалоПроцедуры(Контекст, "ТекущаяДата");	
		Рез = ТекущаяДата();
		отладка_Лог_КонецПроцедуры(Контекст);	
	ИначеЕсли ИмяФ = "НРЕГ" ИЛИ  ИмяФ = "ВРЕГ" ИЛИ ИмяФ = "ТРЕГ" ИЛИ  ИмяФ = "ПРЕГ" ИЛИ  ИмяФ = "СОКРЛП" Тогда
		Если ДостаточноАргументов(Контекст, ИмяФункции, мАргументы, 1, 1) Тогда
			Аргумент = мАргументы[0];	
			ЗначениеАргумента = Строка(ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, Аргумент, Истина));
			отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);	
			Попытка
				Выполнить("Рез = " + ИмяФункции + "(ЗначениеАргумента);")
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_ПФ.ВыполнитьФункцию() ошибка частного кода. Код:
				|" + ИмяФункции, "НеСообщать", Истина)
			КонецПопытки;
			отладка_Лог_КонецПроцедуры(Контекст);	
		КонецЕсли;
	ИначеЕсли ИмяФ = "ПАДЕЖ" ИЛИ ИмяФ = "П" Тогда
		Рез = ПадежПФФ(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ДАТАПРОПИСЬЮ" ИЛИ ИмяФ = "ДП" Тогда
		Рез = ДатаПрописью_(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "Город" Тогда
		Рез = Город(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ОКР" Тогда
		Рез = Окр_(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "НАИМЕНОВАНИЕ" ИЛИ ИмяФ = "Н" Тогда
		Рез = Наименование(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ОТВЕТСТВЕННОЕЛИЦО" ИЛИ ИмяФ = "ОЛ" Тогда
		Рез = ОтветственноеЛицо(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ЗАПОЛНИТЕЛЬ" ИЛИ ИмяФ = "З" Тогда
		Рез = Заполнитель(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "СУММАПРОПИСЬЮ" ИЛИ ИмяФ = "СП" Тогда
		Рез = СуммаПрописью(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ДФ" 	Тогда
		Рез = ДФ(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ЧФ" 	Тогда
		Рез = ЧФ(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "СЗП" 	Тогда
		Рез = СЗП(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ДОГОВОР" Тогда
		Рез = Договор(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ДОК" 	Тогда
		Рез = ПереключательКонтейнера(Контекст, мАргументы, "Док");
	ИначеЕсли ИмяФ = "ИТОГ" Тогда
		Рез = ПереключательКонтейнера(Контекст, мАргументы, "Итог");
	// 48
	ИначеЕсли ИмяФ = "РЕКВИЗИТ" Тогда
		Рез = Реквизит(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "ИНН" 	Тогда
		Рез = ИНН(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "ОГРН" Тогда
		Рез = ОГРН(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "БСО" Тогда
		Рез = БСО(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "А7" Тогда
		Рез = А7(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "ПОЛИС" Тогда
		Рез = Полис(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "ИТОГ2" Тогда
		Рез = ИтогиСРазрядностью2(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "БР" Тогда
		Рез = БанковскиеРеквизиты(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "КомуПеречислитьПоОтчету" Тогда
		Рез = КомуПеречислитьПоОтчету(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "КОНТАКТНОЕЛИЦО" Или ИмяФ = "КЛ" Тогда
		Рез = КонтактноеЛицо(Контекст, мАргументы)
	ИначеЕсли ИмяФ = "ИЛИ" Или ИмяФ = "ФУНКЦИЯИЛИ" Тогда
		Рез = ФункцияИли(Контекст, мАргументы);
	ИначеЕсли ИмяФ = "ДОКУМЕНТУДОСТОВЕРЯЮЩИЙЛИЧНОСТЬ" Или ИмяФ = "ДУ" Тогда
		Рез = ДокументУдостоверяющийЛичность(Контекст, мАргументы);
	Иначе	
		Попытка
			Выполнить("Рез = " + ИмяФункции + "(Контекст, мАргументы);");
		Исключение
			СОО = "Функция '" + ИмяФункции + "' отсутствует.";
			отладка_ПФ(Контекст, ОписаниеОшибки(), СОО, СтатусСообщения.ОченьВажное, 0+1);
		КонецПопытки;
	КонецЕсли;                                    
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Процедура ПоказатьДеревоФункций(АргументИлиМассив, Уровень)
	
	Если Уровень > 10 Тогда
		Возврат;	
	КонецЕсли;
	УровеньНов = Уровень + 1;
	ПРЕ = ДайТабс(УровеньНов);
	ТипЗ = ТипЗнч(АргументИлиМассив);
	Если ТипЗ = Тип("Массив") Тогда
		Сообщить(ДайТабс(УровеньНов) + "Функция:	" + АргументИлиМассив[0]);
		Для Сч = 1 По АргументИлиМассив.Количество() - 1 Цикл
			ПоказатьДеревоФункций(АргументИлиМассив[Сч], УровеньНов);
		КонецЦикла;
	ИначеЕсли ТипЗ = Тип("Строка") Тогда
		Сообщить(ДайТабс(УровеньНов) + "Арг:	" + АргументИлиМассив);
	Иначе
		Сообщить("Ошибка: элемент массива разбора строки параметра неподходящего типа: '" + ТипЗ + "'!", СтатусСообщения.Важное);	
	КонецЕсли;
	
КонецПроцедуры

Функция ДайТабс(СчТаб)
	Стр = "";
	Для Сч = 1 По СчТаб Цикл
		Стр = Стр + "	";	
	КонецЦикла;
	Возврат Стр;
КонецФункции

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//        ЧАСТНЫЕ ФУНКЦИИ
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

//%%%%%%%%%%%%%%  Собственно частные функции %%%%%%%%%%%%%%%%%%%%%%

Функция ПереключательКонтейнера(Контекст, мАрг, ИмяФункции)
	
	//(<АРГ>)
	отладка_Лог_НачалоПроцедуры(Контекст, "ПереключательКонтейнера (" + ИмяФункции + ")");		
	Рез = "";
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 1) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	//Должен быть исключительно именем свойства контейнера
	ИмяСвойства = мАрг[0];
	ТипЗ = ТипЗнч(ИмяСвойства);	
	Если ТипЗ <> Тип("Строка") Тогда
		СОО = "В функцию '" + ИмяФункции + "' (ПереключательКонтейнера) передан аргумент '" + Строка(ИмяСвойства) + "' не являющийся строкой и поэтому не являющийся именем свойства контейнера.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
	Иначе
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.MultiLine = Ложь;
		RegExp.Global = Истина;
		RegExp.IgnoreCase = Истина;
		RegExp.Pattern = "^[A-Za-zА-Яа-я_][A-Za-zА-Яа-я0-9_]*$";
		Если RegExp.Test(ИмяСвойства) Тогда
			Если ВРег(ИмяФункции) = "ДОК" Тогда
				Контекст.ОперативныйКонтейнер = Контекст.Контейнер_Документ;
			ИначеЕсли ВРег(ИмяФункции) = "ИТОГ" Тогда
				Контекст.ОперативныйКонтейнер = Контекст.Контейнер_Итоги;
			Иначе
				//если и произойдет, то контейнер останется без изменений
			КонецЕсли;
			Рез = ПолучитьСвойство(Контекст, ИмяСвойства);
		Иначе	
			RegExp.Pattern = "[A-Za-zА-Яа-я0-9_]+";
			НедопустимыеСимволы = RegExp.Replace(ИмяСвойства,"");
			СОО = "В функцию '" + ИмяФункции + "' (ПереключательКонтейнера) передан аргумент '" + Строка(ИмяСвойства) + "' содержащий недопустимые символы '" + НедопустимыеСимволы + "' и поэтому неявляющийся именем свойства контейнера.";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		КонецЕсли;
		RegExp = Null;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез; 
	
КонецФункции    

Функция ПадежПФФ(Контекст, мАрг)
	
	//(<АРГ>, <ПАДЕЖ>, <ТИП АРГУМЕНТА>*, <ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>*)
	ИмяФункции = "Падеж";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);	
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 2, 3) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	АРГ = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	// 2-й аргумент <ПАДЕЖ>
	Падеж = ДайАргумент_Падеж(Контекст, мАрг, ИмяФункции, 2, , Истина);
	// 3-й аргумент <ТИП АРГУМЕНТА>
	
	//По умолчанию тип аргумента "Ф"
	ТипАргумента_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<ТИП АРГУМЕНТА>","Ф"));
	ТипАргумента = ВРег(Лев(ТипАргумента_,1));	
	Если ТипАргумента <> "Ф" и ТипАргумента <> "Д" Тогда
		ТипАргумента = "Ф";  //по умолчанию - ФИО
		СОО = "В функцию 'Падеж' передан неверный 3-й аргумент <ТИП АРГУМЕНТА>: """ + ТипАргумента_ + """.
		|		Должно быть: [должность|Д|фио|Ф]. (Использовано 'Ф')";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;
	Если ТипАргумента = "Ф" Тогда
		// 4-й аргумент <ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>*
		ФИОКратко = ДайАргумент_ПредставлениеФизлица(Контекст, мАрг, ИмяФункции, 4, "Полно");
		ТипЗнчАРГ = ТипЗнч(АРГ);
		Если ТипЗнчАРГ = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Рез = уб_Кэшируемые.ФИОФизлицаСтрокой(АРГ, Контекст.Объект.Дата, ФИОКратко, Падеж);
		ИначеЕсли ТипЗнчАРГ = Тип("СправочникСсылка.КонтактныеЛица") Тогда 	
			Рез = ФункцииРасширения.ФИО_Склонение(АРГ.Наименование, , , ,АРГ.Пол , Падеж, ФИОКратко); 
		Иначе
			Рез = ФункцииРасширения.ФИО_Склонение(Строка(АРГ), , , , , Падеж, ФИОКратко); 
		КонецЕсли;
	Иначе //ТипАргумента = "Д"
		Рез = ФункцииРасширения.Должность_Склонение(Строка(АРГ), Падеж);
	КонецЕсли;	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ДатаПрописью_(Контекст, мАрг)
	
	//(<ДАТА>)
	ИмяФункции = "ДатаПрописью";
	отладка_Лог_НачалоПроцедуры(Контекст, "ДатаПрописью_");	
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 1) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	ДАТА_ = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	Если ТипЗнч(ДАТА_) <> Тип("Дата") Тогда
		СОО = "В функцию 'ДатаПрописью' передан аргумент типа '" + ТипЗнч(ДАТА_) + "'. Допустим тип 'Дата'.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
	Иначе
		Рез = ПФ_ДатаПрописью(ДАТА_, , );
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

//чкн
Функция Город(Контекст, мАрг)
	
	//(<Контрагент>)
	ИмяФункции = "Город";
	отладка_Лог_НачалоПроцедуры(Контекст, "Город");	
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 1) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	Контрагент = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	Если НЕ (ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") ИЛИ 
		 ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации")) Тогда
		СОО = "В функцию 'Город' передан аргумент типа '" + ТипЗнч(Контрагент) + "'. Допустим тип 'СправочникСсылка.Контрагенты'.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
	Иначе
		мЗапрос = Новый Запрос;
        
        мЗапрос.УстановитьПараметр("Объект", Контрагент);
        мЗапрос.УстановитьПараметр("Вид"   , ?(ТипЗнч(Контрагент)=Тип("СправочникСсылка.Организации"), 
		                           Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Справочники.ВидыКонтактнойИнформации.АдресКонтрагентаФактический));
        
        мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |       КонтактнаяИнформация.Поле2 КАК Регион,
        |       КонтактнаяИнформация.Поле3 КАК Район,
        |       КонтактнаяИнформация.Поле4 КАК Город,
        |       КонтактнаяИнформация.Поле5 КАК НаселенныйПункт,
        |       КонтактнаяИнформация.Поле6 КАК Улица,
        |       КонтактнаяИнформация.Поле7 КАК Дом,
        |       КонтактнаяИнформация.Поле8 КАК Корпус,
        |       КонтактнаяИнформация.Представление
        |ИЗ
        |       РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |ГДЕ
        |       КонтактнаяИнформация.Объект = &Объект
        |       И КонтактнаяИнформация.Вид = &Вид";
        РезультатЗапроса = мЗапрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда 
			Рез = ""+?(ЗначениеЗаполнено(РезультатЗапроса.Город), РезультатЗапроса.Город, РезультатЗапроса.Регион)+"";
			мДлинна = СтрДлина(Рез);
			Рез = "г. "+СокрЛП(Лев(Рез, мДлинна-2))+"";
		Иначе 
			Рез = "";
		КонецЕсли;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции
//чкн

Функция СуммаПрописью(Контекст, мАрг)
	
	//(<ЧИСЛО>, <ВАЛЮТА>*, <ФОРМАТНАЯ СТРОКА>*)
	ИмяФункции = "СуммаПрописью";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если Не	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 4) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	ЧИСЛО_ = Неопределено;
	Если Не ДайАргумент_Типа_Число(Контекст, мАрг, ИмяФункции, 1, ЧИСЛО_) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 2-й аргумент <ВАЛЮТА>*
	Валюта = ОбщегоНазначения.ПолучитьВалютуРубли();  //по умолчанию - рубли
	Если мАрг.Количество() > 1 Тогда
		Валюта = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[1], Не ПустаяСтрока(мАрг[1]));
		Если ТипЗнч(Валюта) <> Тип("СправочникСсылка.Валюты") Или Не ЗначениеЗаполнено(Валюта) Тогда
			//Ищем валюту в справочнике валют
			ВалютаРубли = ОбщегоНазначения.ПолучитьВалютуРубли();
			Если Не ЗначениеЗаполнено(Валюта) Тогда
				СОО = "В функцию 'СуммаПрописью' передано пустое значение валюты. Использована валюта 'RUB'.";
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Информация, 0+1);
				Валюта = ВалютаРубли;	
			ИначеЕсли Строка(Валюта) = ВалютаРубли.Наименование Тогда
				Валюта = ВалютаРубли;	
			Иначе	
		 		вхВалюта = Строка(Валюта);
		 		стрВалюта = ВРег(вхВалюта);				
				Валюта = Справочники.Валюты.НайтиПоКоду(стрВалюта);
				Если Не ЗначениеЗаполнено(Валюта) Тогда
					Валюта = Справочники.Валюты.НайтиПоРеквизиту("КодС", стрВалюта);
					Если Не ЗначениеЗаполнено(Валюта) Тогда
						Валюта = Справочники.Валюты.НайтиПоНаименованию(стрВалюта);
						Если Не ЗначениеЗаполнено(Валюта) Тогда
							//Если не находим валюту, сообщаем 
							//ТОДО проверить!
							СОО = "В функцию 'СуммаПрописью' передана неизвестная валюта '" + вхВалюта + "'. Использована валюта 'RUB'.";
							отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
							Валюта = ВалютаРубли;	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	// 3-й аргумент <ФОРМАТНАЯ СТРОКА>*
	ФорматнаяСтрока = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<ФОРМАТНАЯ СТРОКА>", ФорматнаяСтрока));
	Если ПустаяСтрока(ФорматнаяСтрока) Тогда
		ФорматнаяСтрока = "Л = ru_RU; НП = Истина; НД = Истина; ДП = Истина";
	КонецЕсли;
	// 4-й аргумент <ПАРАМЕТРЫ ПРЕДМЕТА ИСЧИСЛЕНИЯ>*
	//запятая в ПФ заменяется символом ";"
	ППИ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 4, "<ПАРАМЕТРЫ ПРЕДМЕТА ИСЧИСЛЕНИЯ>")); 
	Если ПустаяСтрока(ППИ) Тогда
		ППИ = Валюта.ПараметрыПрописиНаРусском;
	Иначе
		ППИ = СтрЗаменить(ППИ, ";", ",");
	КонецЕсли;
	Рез = ЧислоПрописью(ЧИСЛО_, ФорматнаяСтрока, ППИ);
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция Окр_(Контекст, мАрг)
	
	//(<ЧИСЛО>, <РАЗРЯДНОСТЬ>*, <РЕЖИМ ОКРУГЛЕНИЯ>*)
	ИмяФункции = "Окр";
	отладка_Лог_НачалоПроцедуры(Контекст, "Окр_");		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 3) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 1-й аргумент <АРГ>
	ЧИСЛО_ = Неопределено;
	Если НЕ ДайАргумент_Типа_Число(Контекст, мАрг, ИмяФункции, 1, ЧИСЛО_) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 2-й аргумент <РАЗРЯДНОСТЬ>*
	РазрядностьОкругл = 2;  //по умолчанию
	Разрядность_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<РАЗРЯДНОСТЬ>",РазрядностьОкругл));
	Попытка
		//Если строка аргумента - число, то используем его как есть
		РазрядностьОкругл = Число(Разрядность_);
	Исключение
		СОО = "В функцию 'Окр' передан 2-й аргумент <РАЗРЯДНОСТЬ>, который не может быть представлен в виде числа: """ 
		+ Строка(Разрядность_) + """ (Использовано 2).";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецПопытки;   	
	// 3-й аргумент <РЕЖИМ ОКРУГЛЕНИЯ>*
	РежимОкругл = РежимОкругления.Окр15как20; //по умолчанию
	РО_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<РЕЖИМ ОКРУГЛЕНИЯ>","ОКР15КАК20"));
	РО = ВРег(РО_);
	Если РО = "0" ИЛИ РО = "ОКР15КАК10" Тогда
		РежимОкругл = РежимОкругления.Окр15как10;	
	ИначеЕсли РО = "1" ИЛИ РО = "ОКР15КАК20" Тогда
		//	
	Иначе
		СОО = "В функцию 'Окр' передан неправильный 3-й аргумент <РЕЖИМ ОКРУГЛЕНИЯ>: """ + РО_ + """. (Использовано Окр15как20)";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;	
	Рез = Окр(ЧИСЛО_, РазрядностьОкругл, РежимОкругл);
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ДФ(Контекст, мАрг)
	
	//(<ДАТА>, <ФОРМАТНАЯ СТРОКА ДАТЫ>*)
	ИмяФункции = "ДФ";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);	
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 2) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	ДАТА_ = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	Если ТипЗнч(ДАТА_) <> Тип("Дата") Тогда
		//СОО = "В функцию 'ДФ' передан аргумент типа '" + ТипЗнч(ДАТА_) + "'. Допустим тип 'Дата'.";
		//отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Рез = ДАТА_;
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 3-й аргумент <Я САМ ВВЕДУ ФОРМАТНУЮ СТРОКУ>
	БезОбработки = ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "asddaf");
	Если НРег(Лев(БезОбработки, 1)) = "и" Тогда
		ФорматнаяСтрока = мАрг[1];
	Иначе
		// 2-й аргумент <ФОРМАТНАЯ СТРОКА ДАТЫ>*
		ФорматнаяСтрока = ДайАргумент_ФорматнаяСтрокаДаты(Контекст, мАрг, ИмяФункции, 2);	
	КонецЕсли;
	Рез = Формат(ДАТА_, ФорматнаяСтрока);
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез; 
	
КонецФункции

Функция ЧФ(Контекст, мАрг)
	
	//(<ЧИСЛО>, <ФОРМАТНАЯ СТРОКА>*)
	ИмяФункции = "ЧФ";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 2) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	ЧИСЛО_ = Неопределено;
	Если НЕ ДайАргумент_Типа_Число(Контекст, мАрг, ИмяФункции, 1, ЧИСЛО_) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 2-й аргумент <ФОРМАТНАЯ СТРОКА>*
	ФрматнаяСтрока = Контекст.ЧФ; //по умолчанию
	ФС_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<ФОРМАТНАЯ СТРОКА>",ФрматнаяСтрока));
	ФСН = НРег(ФС_);
	Если ФСН = "" ИЛИ ФСН = "стд" Тогда
		//используем по умолчанию	
	ИначеЕсли ФСН = "процент" Тогда
		Рез = Строка(ЧИСЛО_) + "%";
		Перейти ~НаВыход;	
	Иначе 	
 		ФрматнаяСтрока = ФС_;
	КонецЕсли;	
	Рез = Формат(ЧИСЛО_, ФрматнаяСтрока);	
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция Наименование(Контекст, мАрг)
	
	//(<АРГ>, <ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>*, <ПРЕДСТАВЛЕНИЕ ЮРЛИЦА>*, <ПАДЕЖ>*)
	ИмяФункции = "Наименование";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 4) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 1-й аргумент <АРГ>
	АРГ = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	ТипЗ = ТипЗнч(АРГ);
	Если ТипЗ = Тип("СправочникСсылка.Организации") ИЛИ ТипЗ = Тип("СправочникСсылка.Контрагенты") Тогда
		бЮрлицо = Истина;
	ИначеЕсли ТипЗ = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		бЮрлицо = Ложь;
	ИначеЕсли ТипЗ = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		бЮрлицо = Ложь;
	ИначеЕсли ТипЗ = Тип("Строка") Тогда
		//бЮрлицо = Ложь;
		//если передана строка - возвращаем ее не в измененном виде
		Рез = Арг;
		Перейти ~НаВыход
	Иначе
		СОО = "В функцию 'Наименование' передан 1-й аргумент типа '" + ТипЗ + "'. Допустимы типы справочников Организаций, Контрагентов, Физлиц.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 2-й аргумент <ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>*
	ФИОКратко = ДайАргумент_ПредставлениеФизлица(Контекст, мАрг, ИмяФункции, 2, "Кратко");		
	// 4-й аргумент <ПАДЕЖ>*
	Падеж = ДайАргумент_Падеж(Контекст, мАрг, ИмяФункции, 4);	
	Если бЮрлицо Тогда
		// 3-й аргумент <ПРЕДСТАВЛЕНИЕ ЮРЛИЦА>*
		ТипНаименЮрлица = ДайАргумент_ПредставлениеЮрлица(Контекст, мАрг, ИмяФункции, 3, "Кратко");
		Рез = ДайНаименованиеКонтрагента(АРГ, Контекст.Объект.Дата, ФИОКратко, ТипНаименЮрлица, Падеж);
	Иначе
		Рез = уб_Кэшируемые.ФИОФизлицаСтрокой(АРГ, Контекст.Объект.Дата, ФИОКратко, Падеж);
	КонецЕсли;
	// 5-й аргумент  - Ф, И, О, (без учета падежей и кратко/полно!), по умолчанию - как обычно	
	Если Не бЮрлицо Тогда
		РаздИм = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 5, "<РаздИм>")));		
		Запрос = Новый Запрос;
		Если ТипЗ = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
			ТекстЗапроса = "ВЫБРАТЬ
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
			|ГДЕ
			|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
		ИначеЕсли ТипЗ = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	КонтактныеЛица.Фамилия,
			|	КонтактныеЛица.Имя,
			|	КонтактныеЛица.Отчество
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛица
			|ГДЕ
			|	КонтактныеЛица.Ссылка = &ФизЛицо";
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ФизЛицо", АРГ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если РаздИм = "ф" Или РаздИм = "фамилия" Тогда
				Рез = Выборка.Фамилия;
			ИначеЕсли РаздИм = "и" или РаздИм = "имя" Тогда
				Рез = Выборка.Имя;
			ИначеЕсли РаздИм = "о" Или РаздИм = "отчество" Тогда
				Рез = Выборка.Отчество;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез; 
	
КонецФункции

Функция СЗП(Контекст, мАрг)
	
	//(<СЛОВО>, <ФИЗЛИЦО>)
	ИмяФункции = "СЗП";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 2, 2) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 1-й аргумент <СЛОВО>
	СЛОВО = ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<СЛОВО>");
	Если НЕ ЗначениеЗаполнено(СЛОВО) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;	
	// 2-й аргумент <ФИЗЛИЦО>
	ФИЗЛИЦО = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[1], Истина);
	ТипЗ = ТипЗнч(ФИЗЛИЦО);	
	Если ТипЗ <> Тип("СправочникСсылка.ФизическиеЛица") И ТипЗ <> Тип("Строка") И ТипЗ <> Тип("СправочникСсылка.КонтактныеЛица") Тогда
		СОО = "В функцию 'СЗП' передан 2-й аргумент <ФИЗЛИЦО> типа '" + ТипЗ + "'. Допустим тип справочника Физлиц, Контактных лиц, строка";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
	ИначеЕсли ЗначениеНеЗаполнено(ФИЗЛИЦО) Тогда
		//ТОДО Переделать на нейтральное название
		СОО = "В функцию 'СЗП' передан пустой 2-й аргумент <ФИЗЛИЦО>.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
	КонецЕсли;
	Рез =  ДайСловоЗависимоеОтПолаФизлица(ФИЗЛИЦО, СЛОВО, Контекст.Предупреждать);
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

//по получении данных контрагентов 2ой параметр совершенно игнорируется
Функция ОтветственноеЛицо(Контекст, мАрг)
	
	//ВАРИАНТ 1:
	//ОТВЕТСТВЕННОЕЛИЦО(<ВИДЗНАЧЕНИЯ>, <ОТВЕТСТВЕННОЕЛИЦО>, <ОРГАНИЗАЦИЯ>, <КОНТРАГЕНТ>, <ПРЕДСТАВЛЕНИЕ ДОЛЖНОСТИ>*)
	// если тип ОРГАНИЗАЦИЯ - организация, то параметр контрагент игнорируется
	//ВАРИАНТ 2:
	//ОТВЕТСТВЕННОЕЛИЦО(<ВИДЗНАЧЕНИЯ>, <ОТВЕТСТВЕННОЕЛИЦО>, <КОНТРАГЕНТ>, <ОРГАНИЗАЦИЯ-ПАРТНЕР>, <ПРЕДСТАВЛЕНИЕ ДОЛЖНОСТИ>*)
	ИмяФункции = "ОтветственноеЛицо";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 3, 4) Тогда
		//ТОДО проверить совместно с др функциями
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <ВИДЗНАЧЕНИЯ>
	ВЗ_ = мАрг[0];
	Вид_Значения = ВРег(Лев(ВЗ_,1));
	// 2-й аргумент <ОТВЕТСТВЕННОЕЛИЦО>
	ОЛ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<ОТВЕТСТВЕННОЕЛИЦО>"));
	// 3-й аргумент <КОНТРАГЕНТ|ОРГАНИЗАЦИЯ>
	КилиО = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[2], Истина);
	ТипЗ = ТипЗнч(КилиО);
	Если Не ЗначениеЗаполнено(КилиО) Тогда
		СОО = "В функцию 'ОтветственноеЛицо' передан пустой 3-й аргумент <КОНТРАГЕНТ|ОРГАНИЗАЦИЯ> (тип '" + ТипЗ + "').";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
		Перейти ~НаВыход;	
	КонецЕсли;
	Если ТипЗ = Тип("СправочникСсылка.Организации") Тогда
		//ВАРИАНТ 1:
		ОЛ = НРег(ОЛ);
		Если Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления.Найти(ОЛ) = Неопределено Тогда
			Если ОЛ = "рук"  ИЛИ ОЛ = "" Тогда ОЛ = "Руководитель" 
			ИначеЕсли ОЛ = "гбух" Тогда ОЛ = "ГлавныйБухгалтер"
			ИначеЕсли ОЛ = "бсо" Тогда ОЛ = "ОтветственныйЗаБСО"
			ИначеЕсли ОЛ = "кадровик" Тогда ОЛ = "РуководительКадровойСлужбы"
			ИначеЕсли ОЛ = "уп" Тогда ОЛ = "УполномоченныйПредставитель"
			ИначеЕсли ОЛ = "исп" Тогда ОЛ = "Исполнитель"
			ИначеЕсли ОЛ = "фо" Тогда ОЛ = "ФинОтветственный"		
			Иначе
				СОО = "В функцию 'ОтветственноеЛицо' передан неправильный 2-й аргумент <ОТВЕТСТВЕННОЕЛИЦО>: """ + ОЛ + """. Должно быть одно из:";
				Для Каждого ЗП ИЗ Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления Цикл
					СОО = СОО + Символы.ВК + Символы.ПС + "		" + ЗП.Имя;	
				КонецЦикла;
				СОО = СОО + Символы.ВК + Символы.ПС + "Либо сокращения (см. справку)";	
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
				Перейти ~НаВыход;	
			КонецЕсли;
		КонецЕсли;
		ОтветствЛицо = Перечисления.ОтветственныеЛицаОрганизаций[ОЛ];
		Организация = КилиО;
		структураОтвЛицо = ДайОтветственноеЛицоОрганизации(ОтветствЛицо, Организация, Контекст.Объект.Дата, Контекст.Предупреждать);
		ДляОрганизаци = " '" + Строка(ОтветствЛицо) + "' для организации '" + Организация.Наименование 
				+ "' на " + Формат(Контекст.Объект.Дата,"ДФ=dd.MM.yyyy") + ".";
		Если структураОтвЛицо = Неопределено Тогда
			СОО = "Отсутствует ответственное лицо " + ДляОрганизаци;
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
			Перейти ~НаВыход;	
		КонецЕсли;
		Если Вид_Значения = "О" Тогда
			ОснованиеДействия = ОснованиеДействияОтветственногоЛица(структураОтвЛицо, Контекст.Предупреждать);
			Если ОснованиеДействия = Неопределено Тогда
				СОО = "Нет сведений об ОСНОВАНИИ ДЕЙСТВИЯ отв. лица " + ДляОрганизаци;   
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
				Перейти ~НаВыход;	
			Иначе
				Рез = ОснованиеДействия;
				Перейти ~НаВыход;	
			КонецЕсли;
		ИначеЕсли Вид_Значения = "Д" Тогда 
			оДолжность = ОбъектДолжностьОтветственногоЛица(структураОтвЛицо, Контекст.Предупреждать);
			Если оДолжность = Неопределено Тогда
				СОО = "Нет сведений о ДОЛЖНОСТИ отв. лица " + ДляОрганизаци;   
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
				Перейти ~НаВыход;	
			Иначе
				// 4-й аргумент <ПРЕДСТАВЛЕНИЕ ДОЛЖНОСТИ>
				ДолжностьКратко = ДайАргумент_ПредставлениеФизлица(Контекст, мАрг, ИмяФункции, 5, "Полно");
				Рез = СокрЛП(?(ДолжностьКратко,оДолжность.НаименованиеКратко,оДолжность.Наименование));
				Перейти ~НаВыход;	
			КонецЕсли;
		Иначе // Вид_Значения = "Ф" 
			Рез = структураОтвЛицо.ФизическоеЛицо;
			Если Рез = Неопределено Тогда
				СОО = "Нет сведений об Ответственном ЛИЦЕ " + ДляОрганизаци;   
				отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0 + 1);
			КонецЕсли;
			Перейти ~НаВыход;	
		КонецЕсли;
	ИначеЕсли ТипЗ = Тип("СправочникСсылка.Контрагенты") Тогда
		//ВАРИАНТ 2:
		Контрагент = КилиО;
		// 4-й аргумент <ОРГАНИЗАЦИЯ-ПАРТНЕР>
		Если мАрг.Количество() < 4 Тогда
			СОО = "В функцию 'ОтветственноеЛицо' не передан 4-й аргумент <ОРГАНИЗАЦИЯ-ПАРТНЕР>, обязательный при использовании функции в 'Варианте 2' (3-й аргумент - Контрагент).";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
			Перейти ~НаВыход;	
		КонецЕсли;
		Организация = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[3], Истина);
		Если Вид_Значения = "О" Тогда			
			ИмяПараметра = "ЛицоПринципала_ОснованиеДействия"
		ИначеЕсли Вид_Значения = "Д" Тогда 
			ИмяПараметра = "ЛицоПринципала_Должность"
		ИначеЕсли Вид_Значения = "А" Тогда 
			ИмяПараметра = "ОргАгент_Доверенность"
		ИначеЕсли Вид_Значения = "Ф" Тогда 
			ИмяПараметра = "ЛицоПринципала"
		Иначе
			ИмяПараметра = ОЛ;
		КонецЕсли;
		Рез = уб_СтраховойБрокер.ПолучитьПараметрДоговора(Контекст.Объект.Дата, ИмяПараметра, Контрагент, Организация, ?(Контекст.ЭтоПФСубагент, Неопределено, Контекст.Объект), ОЛ);
	Иначе
		СОО = "В функцию 'ОтветственноеЛицо' передан 3-й аргумент <КОНТРАГЕНТ|ОРГАНИЗАЦИЯ> неверного типа типа '" + ТипЗ + "'. Допустимы типы справочников Организаций или Контрагентов.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Перейти ~НаВыход;	
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция КонтактноеЛицо(Контекст, мАрг)

	ИмяФункции = "КонтактноеЛицо";
	Рез = "";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);
	Если Не	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 2, 4) Тогда
		Перейти ~НаВыход
	КонецЕсли;
	Принудительное = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<ПРИНУДИТЕЛЬНОЕ>"));
	Если ПустаяСтрока(Принудительное) Тогда
		Поставщик 	= ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
		ОргАгент	= ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[1], Истина);
		Основное	= НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 4, "<ОСНОВНОЕ>")));
		Если Лев(Основное, 1) = "о" Тогда
			Рез = Поставщик.ОсновноеКонтактноеЛицо
		Иначе
			Рез = уб_СтраховойБрокер.ПолучитьПараметрДоговора(Контекст.Объект.Дата, "ЛицоПринципала", Поставщик, ОргАгент, Контекст.Объект);
		КонецЕсли;
	Иначе
		Рез = Принудительное
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;

КонецФункции // КонтактноеЛицо()

Функция Договор(Контекст, мАрг)
	
	//(<ВИДЗНАЧЕНИЯ>, <КОНТРАГЕНТ>, <ОРГАНИЗАЦИЯ-ПАРТНЕР>, <ФОРМАТНАЯ СТРОКА ДАТЫ>*)
	ИмяФункции = "Договор";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);	
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 3, 4) Тогда
		//ТОДО проверить совместно с др функциями
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <ВИДЗНАЧЕНИЯ>
	ВЗ_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ВИДЗНАЧЕНИЯ>"));
	Если НЕ ЗначениеЗаполнено(ВЗ_) Тогда
		СОО = "В функцию 'Договор' передан пустой 1-й аргумент <ВИДЗНАЧЕНИЯ>.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Перейти ~НаВыход;	
	КонецЕсли;
	Вид_Значения = ВРег(Лев(ВЗ_,1));
	Если Найти("ПРНД",Вид_Значения) = 0 Тогда
		СОО = "В функцию 'Договор' передан неправильный 1-й аргумент <ВИДЗНАЧЕНИЯ>: """ + ВЗ_ 
		+ """. Должно быть: ПолноеНаименование|ПН|П|Расширение|Р|Номер|Н|Дата|Д";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Перейти ~НаВыход;	
	КонецЕсли;
	// 2-й и 3-й аргумент <КОНТРАГЕНТ> ИЛИ <ОРГАНИЗАЦИЯ-АГЕНТ>
	Для Счетчик = 1 По 2 Цикл
		Аргумент = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[Счетчик], Истина);
		ТипЗнчАргумент = ТипЗнч(Аргумент);
		Если Не ЗначениеЗаполнено(Аргумент) Тогда
			СОО = "В функцию 'Договор' передан пустой " + Счетчик + "-й аргумент <КОНТРАГЕНТ> ИЛИ <ОРГАНИЗАЦИЯ-АГЕНТ> (тип '" + ТипЗнчАргумент + "').";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
		КонецЕсли;
		Если ТипЗнчАргумент = Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагент = Аргумент;
		ИначеЕсли ТипЗнчАргумент = Тип("СправочникСсылка.Организации") Тогда
			ОрганизацияАгент = Аргумент;
		Иначе
			СОО = "В функцию 'Договор' передан " + Счетчик + "-й аргумент <КОНТРАГЕНТ> ИЛИ <ОРГАНИЗАЦИЯ-АГЕНТ> неверного типа типа '" + ТипЗнчАргумент + "'. Допустим тип справочника Контрагентов.";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
			Перейти ~НаВыход;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Контрагент) Или Не ЗначениеЗаполнено(ОрганизацияАгент) Тогда
		Перейти ~НаВыход;
	КонецЕсли;
	//добавлен параметр Вида страхования - возможно изменение данных ПФ (раньше не было)
	Попытка
		ВидСП = ?(Контекст.Контейнер.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка(), Неопределено, Контекст.Контейнер.ВидСП);
	Исключение
		ВидСП = Неопределено;
	КонецПопытки;
	// TODO оптимизировать
	Договор = уб_СС.ДайДоговорМеждуПоставщикомИОргАгентом(Контрагент, ОрганизацияАгент, Контекст.Объект.Дата, Контекст.Предупреждать, ВидСП);
	Если Договор.Пустая() Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 4-й аргумент <ФОРМАТНАЯ СТРОКА ДАТЫ>*
	ФрматнаяСтрока = ДайАргумент_ФорматнаяСтрокаДаты(Контекст, мАрг, ИмяФункции, 4, Контекст.ДФ_Полный_год);
	Если Вид_Значения = "Д" Тогда
		Рез = ?(Не ЗначениеЗаполнено(Договор.ДатаЗаключенияДоговора), "", Формат(Договор.ДатаЗаключенияДоговора, ФрматнаяСтрока));	
	ИначеЕсли Вид_Значения = "Р" Тогда
		Рез = СокрЛП(Договор.РасширениеНазвания);	
	ИначеЕсли Вид_Значения = "Н" Тогда
		Рез = СокрЛП(Договор.Наименование);	
	Иначе // Вид_Значения = "П"
		РасширениеНазвания = ?(ПустаяСтрока(СокрЛП(Договор.РасширениеНазвания)), "", Договор.РасширениеНазвания + " ");
		ДатаДоговора = ?(Не ЗначениеЗаполнено(Договор.ДатаЗаключенияДоговора), "", " от " + Формат(Договор.ДатаЗаключенияДоговора,ФрматнаяСтрока));
		Рез = РасширениеНазвания + "№ " + Договор.Наименование + ДатаДоговора;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция Заполнитель(Контекст, мАрг)
	
	//(<АРГ>, <СИМВОЛ>*, <КОЛИЧЕСТВО>*)
	ИмяФункции = "Заполнитель";
	отладка_Лог_НачалоПроцедуры(Контекст, ИмяФункции);		
	Рез = ""; 	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 3) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	// 1-й аргумент <АРГ>
	АРГ = Строка(ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина));
	Если ЗначениеЗаполнено(Строка(АРГ)) Тогда
		Рез = Строка(АРГ);
		Перейти ~НаВыход;	
	КонецЕсли;
	// 2-й аргумент <СИМВОЛ>
	Симв = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<СИМВОЛ>"));
	Если НЕ ЗначениеЗаполнено(Симв) Тогда
		Симв = "_";
	КонецЕсли;
	// 2-й аргумент <КОЛИЧЕСТВО>
	КоличествоПовторений = 20;
	КП = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<КОЛИЧЕСТВО>"));
	Попытка
		КоличествоПовторений = Число(КП);
	Исключение
	КонецПопытки;   
	Рез = "";
	Для ч = 1 По КоличествоПовторений Цикл
		Рез = Рез + Симв;	  
	КонецЦикла;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция Реквизит(Контекст, мАрг)
	
	ИмяФункции = "Реквизит";
	Рез = "";
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 1) Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	
	// 1 аргумент - имя реквизита	
	Реквизит = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<РЕКВИЗИТ>")));
	// 2 аргумент - чей реквизит 	
	Орг = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ОРГ>")));
	// по умолчанию - ИНН агента, если аргумент - "Поставщик", тогда поставщика
	Если Контекст.Свойство(Орг) Тогда
		Рез = Контекст[Орг][Реквизит];
	Иначе
		Рез = Контекст.Контейнер[Орг][Реквизит];
	КонецЕсли;
	
~НаВыход:
	Возврат Рез;
	
КонецФункции

Функция ДокументУдостоверяющийЛичность(Контекст, мАрг)

	Рез = "";
	ИмяФункции = "ДокументУдостоверяющийЛичность";
	Если Не ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 2, 2) Тогда
		Перейти ~НаВыход
	КонецЕсли;
	// 1 аргумент - физическое лицо или контрагент ИП с заполненным в нем физлицом
	ФизЛицо = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[0], Истина);
	Если ТипЗнч(ФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ФизЛицо = ФизЛицо.ФизЛицо;
	КонецЕсли;
	Если ЗначениеЗаполнено(ФизЛицо) Тогда		
		ИмяРеквизита = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<ИМЯРЕКВИЗИТА>"));
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПД." + ИмяРеквизита + " КАК " + ИмяРеквизита + "
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&Период, ФизЛицо = &ФизЛицо) КАК ПД");
		Запрос.УстановитьПараметр("ФизЛицо", 	ФизЛицо);
		Запрос.УстановитьПараметр("Период",		Контекст.Объект.Дата);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Рез = Выборка[ИмяРеквизита];
		КонецЕсли;
	КонецЕсли;
	
	~НаВыход:
	
	Возврат Рез;

КонецФункции // ДокументУдостоверяющийЛичность()

Функция ИНН(Контекст, мАрг)
	
	ИмяФункции = "Реквизит";
	
	Рез = "";
	
	// 1 аргумент - чей реквизит 
	Орг = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ОРГ>")));
	// по умолчанию - ИНН агента, если аргумент - "Поставщик", тогда поставщика
	Если Контекст.Свойство(Орг) Тогда
		Рез = Контекст[Орг].ИНН;
	Иначе
		Рез = Контекст.Контейнер[Орг].ИНН;
	КонецЕсли;
	
~НаВыход:
	Возврат Рез;
	
КонецФункции

Функция КПП(Контекст, мАрг)
	
	ИмяФункции = "КПП";
	Орг = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ОРГ>")));
	Если Орг = "" Тогда
		Орг = "ОрганизацияАгент"
	КонецЕсли;
	Рез = Контекст[Орг].КПП;
	Возврат Рез;
	
КонецФункции

Функция ОГРН(Контекст, мАрг)

	ИмяФункции = "ОГРН";
	
	// 1 аргумент - чье ИНН
	Орг = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ОРГ>")));
	
	Если Орг = "" Тогда
		Орг = "ОрганизацияАгент"
	КонецЕсли;
	
	// по умолчанию - ИНН агента, если аргумент - "Поставщик", тогда поставщика
	Рез = Контекст[Орг].ОГРН;
	
	Возврат Рез;

КонецФункции // ОГРН()

Функция БСО(Контекст, мАрг)
	
	ИмяФункции = "БСО";	
	// 1 аргумент - "Серия", "Номер", "Вид", иначе полностью Серия + Номер	
	Тип = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ТИП>")));	
	СерияПроверки = Новый Массив;
	Если Контекст.Свойство("СерияПроверки") Тогда
		СерияПроверки = Контекст.СерияПроверки
	Иначе
		Контекст.Вставить("СерияПроверки", СерияПроверки);
		СерияПроверки = Контекст.СерияПроверки;
	КонецЕсли;		
	ТипОтчетПоставщику	= "ДокументОбъект.уб_ОтчетПоставщику";
	СерияБСО			= "";
	НомерБСОБезСерии	= "";		
	// устанавливаем НомерБСО и ВидБСО
	ДопНомерБСО = "";
	Если ТипЗнч(Контекст.Объект) <> Тип(ТипОтчетПоставщику) Тогда
		// если это уведомление поставщика об утрате БСО
		НомерБСО 	= Контекст.Контейнер_СтрокаТЧ.НомерБСО;
		ВидБСО 		= Контекст.Контейнер_СтрокаТЧ.ВидБСО;
	Иначе
		// если это Отчет поставщику. ДайНомерБСОПоСП также возвращает ВидБСО
		//НомерБСО = СокрЛП(уб_СС.ДайНомерБСОПоСП(Контекст.Контейнер.СтраховойПолис, ВидБСО,));
		тзБСО = уб_СС.БСОПоРегистратору(Контекст.Контейнер.СтраховойПолис);
		Для каждого Строка из тзБСО Цикл
			Если Строка.ВидБСОТип = Перечисления.уб_ТипыБСО.Полис или Строка.ВидБСОТип = Перечисления.уб_ТипыБСО.ПолисОсаго Тогда
				НомерБСО    = Строка.НомерБСО;
				ДопНомерБСО = Строка.ДопНомерБСО;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	// сделать для других документов...
	// ПеремещениеБСО 		- ок
	// ВозвратБСО			- ок
	// ЗаявлениеОбУтрате    - ок
	// ОбъявлениеВСМИ		- нет
	// ПередачаБСО			- ок
	// ПоступлениеБСО		- ок
	// СверкаБСО			- ок
	// СписаниеБСО			- ок	
	уб_СтраховойБрокер.Выделить_Серию_и_Номер_в_НомереБСО(ВидБСО, НомерБСО, СерияБСО, НомерБСОБезСерии);	
	СерияПроверки.Добавить(СерияБСО);	
	// 2 аргумент - Н - получает полис, если нет номера БСО	
	Тип2 = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<ПОЛИС>")));	
	//если номер бсо заполнен вручную
	Если НомерБСО = "" И Тип2 <> "н" Тогда
		НомерБСО = СокрЛП(Контекст.Контейнер_СтрокаТЧ.НомерПолиса);
		Для Индекс = 0 По СерияПроверки.Количество() - 1 Цикл
			Если СерияПроверки[Индекс] <> "" И Найти(НомерБСО, СерияПроверки[Индекс]) <> Неопределено Тогда
				СерияБСО = СерияПроверки[Индекс];
				НомерБСОБезСерии = Сред(НомерБСО, СтрДлина(СерияБСО) + 1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если Тип = "серия" Или Тип = "с" Тогда
		Рез = СерияБСО
	ИначеЕсли Тип = "номер" Или Тип = "н" Тогда
		Рез = НомерБСОБезСерии
	ИначеЕсли Тип = "вид" Или Тип = "в" Тогда
		Рез = ВидБСО.Наименование
	ИначеЕсли Тип = "доп" Или Тип = "д" Тогда
		Рез = ДопНомерБСО;	
	Иначе
		Рез = НомерБСО
	КонецЕсли;	
	Возврат Рез;

КонецФункции

Функция Полис(Контекст, мАрг)

	НомерПолиса = СокрЛП(Контекст.Контейнер.НомерПолиса);	
	ИмяФункции = "Полис";
	//1 аргумент - "Серия", "Номер", иначе полностью Серия + Номер
	Тип = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ТИП>")));
	//2 аргумент - тип обработки. "п" - по поступлениям БСО, "с" - по справочнику серий, "пс" и "сп" соответственно
	Тип2 = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<ТИП>")));	
	Структура = уб_temp.ПолучитьСериюИНомерПолиса(НомерПолиса);
	Если Тип = "с" или Тип = "серия" Тогда
		Если Структура = Неопределено Тогда
			Возврат ""
		Иначе
			Возврат Структура.СерияПолиса
		КонецЕсли;
	ИначеЕсли Тип = "н" или Тип = "номер" Тогда
		Если Структура = Неопределено Тогда
			Возврат НомерПолиса
		Иначе
			Возврат Структура.НомерПолиса
		КонецЕсли;
	Иначе
		Возврат НомерПолиса
	КонецЕсли;
	
КонецФункции // Полис()

Функция А7(Контекст, мАрг)

	ИмяФункции = "А7";
	
	// 1 аргумент - "Серия", "Номер", иначе полностью Серия + Номер
	
	Тип = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ТИП>")));
	
	ТипОтчетПоставщику = "ДокументОбъект.уб_ОтчетПоставщику";
	
	Если ТипЗнч(Контекст.Объект) <> Тип(ТипОтчетПоставщику) Тогда
		Попытка
			А7 = уб_temp.ВернутьНомерКвитанцииА7ПоНомеруПолиса(Контекст.Контейнер_СтрокаТЧ.НомерПолиса);
		Исключение
			Возврат "";
		КонецПопытки;
	Иначе
		А7 = Контекст.Контейнер_СтрокаТЧ.НомерКвитанции;
	КонецЕсли;
	
	НомерА7 = "";
	СерияА7 = "";
	
	//работает для отчета поставщику. проверить для других документов.
	Если Тип = "серия" Или Тип = "с" Тогда
		уб_temp.ПолучитьСериюИНомерКвитанцииА7(А7, НомерА7, СерияА7);
		Рез = СерияА7
	ИначеЕсли Тип = "номер" Или Тип = "н" Тогда
		уб_temp.ПолучитьСериюИНомерКвитанцииА7(А7, НомерА7, СерияА7);
		Рез = НомерА7
	Иначе
		Рез = А7
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // А7()

// Возвращает ПЕРВЫЙ заполненный параметр вызова этой функции
Функция ФункцияИли(Контекст, мАрг)

	ИмяФункции = "Или";
	// 1 аргумент - 1 параметр
	Счетчик = 0;
	Для Каждого ЭлементМассива Из мАрг Цикл
		Счетчик = Счетчик + 1;
		//Параметр = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, Счетчик, "<ПАРАМЕТР" + Счетчик + ">"));
		//Рез = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, Параметр, Истина, Истина);
		//Разрешены вложенные функции
		Если Найти(ЭлементМассива,"""") >0 Тогда //!!!Из-за этого могут проблемы быть при вложенной функции
			Рез = Стрзаменить(ЭлементМассива,"""","");
		Иначе	
			Рез = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, ЭлементМассива, Истина, Истина);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Рез) и Не найти(Рез, "--")>0 Тогда
			Прервать
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;

КонецФункции // Или()

//возвращает строкое представление переданных параметров в зависимости от формы оплаты
Функция КомуПеречислитьПоОтчету(Контекст, мАрг)

	ИмяФункции = "КомуПеречислитьПоОтчету";
	//1 параметр - представление оргагента, 2ой - поставщика
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Если СистемаНаправлениеПлатежа Тогда
		Если Контекст.Контейнер_СтрокаТЧ.НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.Поставщику Тогда
			Индекс = 2;
			ЗначениеПоУмолчанию = "Поставщику";
		Иначе
			Индекс = 1;
			ЗначениеПоУмолчанию = "Агенту";
		КонецЕсли;
	Иначе
		Если Контекст.Контейнер_СтрокаТЧ.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
			Индекс = 2;
			ЗначениеПоУмолчанию = "Поставщику";
		Иначе
			Индекс = 1;
			ЗначениеПоУмолчанию = "Агенту";
		КонецЕсли;
	КонецЕсли;
	Рез = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, Индекс, "КОМУ"));
	Если ПустаяСтрока(Рез) Тогда
		Рез = ЗначениеПоУмолчанию
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;

КонецФункции // КомуПеречислитьПоОтчету()

Функция ИтогиСРазрядностью2(Контекст, мАрг)

	ИмяФункции = "ИтогиСРазрядностью2";
	Рез = 0;
	// 1 аргумент - наименование итога	
	Имя = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ИМЯ>")));
	
	// 2 аргумент - разрядность. По умолчанию 2
	Разрядность = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<РАЗРЯДНОСТЬ>")));
	Если Разрядность = "" Тогда
		Разрядность = "2"
	КонецЕсли;
	
	// 3 аргумент - для точной настройки показателей
	Слагаемое = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 3, "<СЛАГАЕМОЕ>")));
	Попытка
		Слагаемое = Число(Слагаемое)
	Исключение
		Слагаемое = 0
	КонецПопытки;
	
	Если НЕ	ДостаточноАргументов(Контекст, ИмяФункции, мАрг, 1, 1) Или Имя = "" Тогда
		Перейти ~НаВыход;	
	КонецЕсли;
	
	Для Каждого Строка Из Контекст.ТЧДокумента Цикл
		Если Имя <> "суммакперечислениюпоставщику2" Тогда
			Показатель = Формат(Строка[Имя], "ЧН=; ЧДЦ = " + Разрядность);
		Иначе
			//TOD любой расчет, если придется еще чтолибо добавлять помимо суммы к перечислению поставщику
			//частные
			//пересчет суммы к перечислению поставщику
			Показатель = Формат(Строка.НачисленнаяСуммаВзноса, "ЧН=; ЧДЦ = " + Разрядность) - Формат(Строка.КВСуммаДляОтчета, "ЧН=; ЧДЦ = " + Разрядность)
		КонецЕсли;
		Рез = Рез + Показатель;
	КонецЦикла;
	
~НаВыход:
	Возврат Рез + Слагаемое;

КонецФункции // ИтогиСРазрядностью2()

Функция БанковскиеРеквизиты(Контекст, мАрг)
	
	ИмяФункции 	= "БАНК";
	Организация = НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 1, "<ОРГАНИЗАЦИЯ>")));
	Реквизит 	= НРег(СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, 2, "<РЕКВИЗИТ>")));
	Рез = "";
	Если Реквизит = "номерсчета" Тогда
		ПутьКРеквизиту = Контекст[Организация].ОсновнойБанковскийСчет
	Иначе
		ПутьКРеквизиту = Контекст[Организация].ОсновнойБанковскийСчет.Банк
	КонецЕсли;	
	Рез = ПутьКРеквизиту[Реквизит];
	Возврат Рез;
	
КонецФункции

//%%%%%%%%%%%%%%  Вспомогательные функции %%%%%%%%%%%%%%%%%%%%%%
Функция ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, ИмяАргумента, ЗначениеПоУмолчанию = "", Обязательный = Ложь)
	
	Рез = ЗначениеПоУмолчанию;
	Если мАрг.Количество() >= НомерАргумента Тогда	
		АргументИлиМассивФункции = мАрг[НомерАргумента - 1];		
		ТипЗ = ТипЗнч(АргументИлиМассивФункции);		
		Если ТипЗ = Тип("Строка") Тогда
			Если ЗначениеЗаполнено(АргументИлиМассивФункции) Тогда
				Рез = АргументИлиМассивФункции;
			Иначе
				Если Обязательный Тогда
					СОО = "В функцию '" + ИмяФункции + "' передан пустой обязательный аргумент № " + НомерАргумента + " " + ИмяАргумента + ".";
					отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
					Рез = АргументИлиМассивФункции;
				КонецЕсли; //Иначе - по умолчанию
			КонецЕсли;
		ИначеЕсли ТипЗ = Тип("Массив") Тогда
			СОО = "В функции '" + ИмяФункции + "' аргумент № " + НомерАргумента + " " + ИмяАргумента + " не может быть функцией.";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
		Иначе
			Сообщить("В функции '" + ИмяФункции + "' аргумент № " + НомерАргумента + " " + ИмяАргумента 
			+ " неподходящего типа: '" + ТипЗ + "'!",СтатусСообщения.Важное);
			отладка_ПФ(Контекст, "", "", СтатусСообщения.Внимание, 0+1);
		КонецЕсли;
	Иначе
		Если Обязательный Тогда
			СОО = "В функцию '" + ИмяФункции + "' не передан обязательный аргумент № " + НомерАргумента + " " + ИмяАргумента + ".";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		КонецЕсли;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ДостаточноАргументов(Контекст, ИмяФункции, мАрг, минКолАрг, максКолАрг)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДостаточноАргументов");	
	Рез = Истина;
	Если мАрг.Количество() = 0 Тогда
		СОО = "В функцию '" + ИмяФункции + "' не передано ни одного аргумента.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Рез = Ложь;	
	ИначеЕсли мАрг.Количество() < минКолАрг Тогда
		СОО = "В функцию '" + ИмяФункции + "' передано недостаточно аргументов (" + мАрг.Количество() + "). Должно быть " 
		+ ?(минКолАрг = максКолАрг, минКолАрг, "от " + минКолАрг + " до " + максКолАрг) + ".";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Рез = Ложь;	
	ИначеЕсли мАрг.Количество() > максКолАрг Тогда	
		СОО = "В функцию '" + ИмяФункции + "' передано больше аргументов (" + мАрг.Количество() + "), чем требуется (" + максКолАрг + ").";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Информация, 0+1);
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции
	
Функция ДайАргумент_ФорматнаяСтрокаДаты(Контекст, мАрг, ИмяФункции, НомерАргумента, ФорматПоУмолчанию = Неопределено)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_ФорматнаяСтрокаДаты");		
	ФрматнаяСтрока = ?(ФорматПоУмолчанию = Неопределено, Контекст.ДФ_Полный, ФорматПоУмолчанию); //по умолчанию
	Если мАрг.Количество() >= НомерАргумента Тогда
		ФС_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, "<ФОРМАТНАЯ СТРОКА ДАТЫ>"));
		ФСН = НРег(ФС_);
		Если ФСН = "кратко" Тогда
			ФрматнаяСтрока = Контекст.ДФ_Кратко;	
		ИначеЕсли ФСН = "полно" ИЛИ ФСН = "полный" Тогда
			ФрматнаяСтрока = Контекст.ДФ_Полный;	
		ИначеЕсли ФСН = "полныйгод" Тогда
			ФрматнаяСтрока = Контекст.ДФ_Полный_год;	
		ИначеЕсли ФСН = "полныймесяцгод" Тогда
			ФрматнаяСтрока = Контекст.ДФ_Полный_месяц_год;
		ИначеЕсли ФСН = "" Тогда 	
			//используем по умолчанию	
		Иначе 	
			Если Найти(ФС_,"""") > 0 Тогда
				RegExp = Новый COMОбъект("VBScript.RegExp");
				RegExp.MultiLine = Ложь;
				RegExp.Global = Истина;
				RegExp.IgnoreCase = Истина;
				//Заменяем кавычки вокруг даты на парные кавычки
				RegExp.Pattern = """([dд]+)""";
				ФС_ = RegExp.Replace(ФС_,"«$1»");
				//Заменяем оставшиеся двойные кавычки на похожие
				RegExp.Pattern = """";
				ФС_ = RegExp.Replace(ФС_,Символ(8243)); //Внимание! Между крайними двойными кавычками не двойная кавычка, а похожий символ (2033 в WORD)
				RegExp = Null;
			КонецЕсли;
			ФрматнаяСтрока = "ДФ=""" + ФС_ + """";
		КонецЕсли;
	КонецЕсли;	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат ФрматнаяСтрока;
	
КонецФункции

Функция ДайАргумент_ПредставлениеФизлица(Контекст, мАрг, ИмяФункции, НомерАргумента, ПоУмолчанию = "К")
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_ПредставлениеФизлица");		
	ТНФ_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, "<ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>",ПоУмолчанию));
	ТНФ = ВРег(Лев(ТНФ_,1));
	Если ТНФ <> "П" и ТНФ <> "К" Тогда
		ТНФ = ВРег(Лев(ПоУмолчанию,1)); //по умолчанию
		СОО = "В функцию '" + ИмяФункции + "' передан неверный " + НомерАргумента + "-й аргумент <ПРЕДСТАВЛЕНИЕ ФИЗЛИЦА>: """ + ТНФ_ + """.
		|		Должно быть: [Полно|П|Кратко|К]. (Использовано '" + ПоУмолчанию + "')";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат (ТНФ <> "П"); //ФИОКратко
	
КонецФункции

Функция ДайАргумент_ПредставлениеЮрлица(Контекст, мАрг, ИмяФункции, НомерАргумента, ПоУмолчанию = "К")
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_ПредставлениеЮрлица");		
	ТНЮ_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, "<ПРЕДСТАВЛЕНИЕ ЮРЛИЦА>",ПоУмолчанию));
	ТНЮ = Найти("СКП",ВРег(Лев(ТНЮ_,1)))-1;
	Если ТНЮ < 0 Тогда
		ТНЮ = Найти("СКП",ВРег(Лев(ПоУмолчанию,1)))-1;
		СОО = "В функцию '" + ИмяФункции + "' передан неверный " + НомерАргумента + "-й аргумент <ПРЕДСТАВЛЕНИЕ ЮРЛИЦА>: """ + ТНЮ_ + """.
		|		Должно быть: [Полно|П|Кратко|К|Справочник|С]. (Использовано '" + ПоУмолчанию + "')";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат ТНЮ;
	
КонецФункции

Функция ДайАргумент_ПредставлениеДолжности(Контекст, мАрг, ИмяФункции, НомерАргумента, ПоУмолчанию = "П")
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_ПредставлениеДолжности");		
	ПД_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, "<ПРЕДСТАВЛЕНИЕ ДОЛЖНОСТИ>",ПоУмолчанию));
	ПД = ВРег(Лев(ПД_,1));
	Если ПД <> "П" и ПД <> "К" Тогда
		ПД = ВРег(Лев(ПоУмолчанию,1)); //по умолчанию
		СОО = "В функцию '" + ИмяФункции + "' передан неверный " + НомерАргумента + "-й аргумент <ПРЕДСТАВЛЕНИЕ ДОЛЖНОСТИ>: """ + ПД_ + """.
		|		Должно быть: [Полно|П|Кратко|К]. (Использовано '" + ПоУмолчанию + "')";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);		
	Возврат (ПД <> "П"); //ДолжностьКратко
	
КонецФункции

Функция ДайАргумент_Падеж(Контекст, мАрг, ИмяФункции, НомерАргумента, ПоУмолчанию = "Именительный", Обязательный = Ложь)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_Падеж");		
	Падеж_ = СокрЛП(ДолженБытьАргументСтрока(Контекст, мАрг, ИмяФункции, НомерАргумента, "<ПАДЕЖ>", ПоУмолчанию, Обязательный));
	Падеж = Найти("ИРДВТП",ВРег(Лев(Падеж_,1)));
	Если Падеж = 0 Тогда
		Падеж = Найти("ИРДВТП",ВРег(Лев(ПоУмолчанию,1))); //по умолчанию
		СОО = "В функцию '" + ИмяФункции + "' передан неверный " + НомерАргумента + "-й аргумент <ПАДЕЖ>: """ + Падеж_ + """.
		|		Должно быть полное название или сокращенное (вплоть до 1 буквы) название падежа. (Использовано '" + ПоУмолчанию + "').";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Обычное, 0+1);
	КонецЕсли;
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Падеж;
	
КонецФункции

Функция ДайАргумент_Типа_Число(Контекст, мАрг, ИмяФункции, НомерАргумента, ЧИСЛО_)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_Типа_Число");		
	Рез = Истина;
	ЧИСЛО_ = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[НомерАргумента - 1], Истина);
	Если ТипЗнч(ЧИСЛО_) = Тип("Строка") Тогда
		Попытка
			ЧИСЛО_ = Число(ЧИСЛО_);
		Исключение
			СОО = "В функцию '" + ИмяФункции + "' передан " + НомерАргумента + "-й аргумент, который не может быть представлен в виде числа: """ + Строка(ЧИСЛО_) + """.";
			отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
			Рез = Ложь;
			Перейти ~НаВыход;	
		КонецПопытки;   
	КонецЕсли;		
	Если ТипЗнч(ЧИСЛО_) <> Тип("Число") Тогда
		СОО = "В функцию '" + ИмяФункции + "' передан " + НомерАргумента + "-й аргумент типа '" + ТипЗнч(ЧИСЛО_) + "'. Допустим тип 'Число' или строка, приводимая к типу 'Число'.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Рез = Ложь;
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ДайАргумент_Типа_СправочникОрганизация(Контекст, мАрг, ИмяФункции, НомерАргумента, Организация)
	
	отладка_Лог_НачалоПроцедуры(Контекст, "ДайАргумент_Типа_СправочникОрганизация");		
	Рез = Истина;	
	Организация = ВычислитьАргументИлиСвойствоИлиФункцию(Контекст, мАрг[НомерАргумента - 1], Истина);
	ТипЗ = ТипЗнч(Организация);
	Если ТипЗ <> Тип("СправочникСсылка.Организации") Тогда
		СОО = "В функцию '" + ИмяФункции + "' передан " + НомерАргумента + "-й аргумент <ОРГАНИЗАЦИЯ-ПАРТНЕР> неверного типа типа '" + ТипЗ + "'. Допустим тип справочника Организаций.";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Важное, 0+1);
		Рез = Ложь;
		Перейти ~НаВыход;	
	КонецЕсли;	
	Если ЗначениеНеЗаполнено(Организация) Тогда
		СОО = "В функцию '" + ИмяФункции + "' передан пустой " + НомерАргумента + "-й аргумент <ОРГАНИЗАЦИЯ-ПАРТНЕР> (обязательный).";
		отладка_ПФ(Контекст, "", СОО, СтатусСообщения.Внимание, 0+1);
		Рез = Ложь;
		Перейти ~НаВыход;	
	КонецЕсли;
	
~НаВыход:	
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

/////////////////////////////////////////////////
///////////     уб_ПФФ      /////////////////////
/////////////////////////////////////////////////

Функция Регистр(Знач Фраза, Флаг_регистр) Экспорт 
	
	Если Флаг_регистр = "Н" Тогда
		Возврат НРег(Фраза);  
	ИначеЕсли Флаг_регистр = "В" Тогда
		Возврат ВРег(Фраза); 
	ИначеЕсли Флаг_регистр = "П" Тогда
		Возврат ФункцииРасширения.ПРег(Фраза); 
	ИначеЕсли Флаг_регистр = "Т" Тогда
		Возврат ТРег(Фраза); 
	Иначе 
		Возврат Фраза; 
	КонецЕсли;
	
КонецФункции

//функция заполняет стандартный код, чтобы при отсутствии кода в странице "Код программы" элемента справочника "Печатные формы", ПФ печаталась
//Два варианта:
//Контекст заполнен - при печати ПФ
//Контекст не заполнен - из справочника ПФ
Функция ЗаполнитьСтандартныйКодПФ(Контекст = Неопределено) Экспорт

	Текст = "";
	ЭтоСтруктура = ТипЗнч(Контекст) = Тип("Структура");
	Области = ?(ЭтоСтруктура, Контекст.Макет.Области, Контекст.МакетШаблона.Получить().Области);
	//отсортируем имена областей по их положению в ПФ
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяОбласти");
	ТЗ.Колонки.Добавить("Верх");
	Для Каждого Область Из Области Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента")
			И Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки
			Тогда
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.ИмяОбласти = Область.Имя;
			СтрокаТЗ.Верх		= Область.Верх;
		КонецЕсли;
	КонецЦикла;
	ТЗ.Сортировать("Верх");
	Счетчик = 0;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Счетчик = Счетчик + 1;
		Отступ = ?(Счетчик = 1, "
		|", "
		|
		|");
		ИмяОбласти = СтрокаТЗ.ИмяОбласти;
		Если ИмяОбласти = "ШапкаТаб" Тогда
		ИначеЕсли ИмяОбласти = "Строка" Тогда
			//ДокументКонфигурации = ?(ЭтоСтруктура, Контекст.ОбъектПФ.ДокументКонфигурации, Контекст.ДокументКонфигурации);
			ДокументКонфигурации = ?(ЭтоСтруктура, Контекст.СтруктураОбъектаПФ.ДокументКонфигурации, Контекст.ДокументКонфигурации);
			//TODO доверенности, заявление об утрате, объявления в сми, перемещение БСО, сверка БСО, уведомление о досрочном действии договора
			Если ДокументКонфигурации = "уб_ОтчетПоставщику" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_ОП(Контекст);"
			ИначеЕсли ДокументКонфигурации = "уб_ВозвратБСООтПоставщика" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст);"
			ИначеЕсли ДокументКонфигурации = "уб_ПередачаБСОПоставщику" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_ПБП(Контекст);"
			ИначеЕсли ДокументКонфигурации = "уб_ПоступлениеБСО" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_ПБ(Контекст);"
			ИначеЕсли ДокументКонфигурации = "уб_СписаниеБСО" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_СБ(Контекст);"
			ИначеЕсли ДокументКонфигурации = "уб_УведомлениеПоставщикаОбУтратеБСО" Тогда
				Текст = Текст + Отступ + "уб_ПФ.ПСП_ТЧ_УведомлениеПоставщикаОбУтратеБСО(Контекст);"
			КонецЕсли;
		Иначе
			Текст = Текст + Отступ + "уб_ПФ.ПСП(Контекст,""" + ИмяОбласти + """);"
		КонецЕсли;
	КонецЦикла;
	Если Текст <> "" Тогда
		Текст = Текст + Отступ + "уб_ПФ.ПСПФ_КолонтитлыИНастройки(Контекст);
		|
		|уб_ПФ.ПСПФ_Показать(Контекст);"
	КонецЕсли;
	Возврат Текст;

КонецФункции // ЗаполнитьСтандартныйКодПФ()

//TODO ПараметрПринадлежности перенести в шапку запроса из отчета поставщику, только добавить проверок на пустые ссылки всех типов составного типа
Функция ПолучитьСтруктуруПечатныхФорм(Объект, ТолькоУниверсальные = Ложь, ДобавлятьСубагентскиеПФ = Ложь) Экспорт
	
	ИмяОбъекта 	= Объект.Метаданные().Имя;
	ТабПФ		= ПустаяТЗСтруктурыПФ();
	Ссылка 		= Объект.Ссылка;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПФ.Ссылка,
	|	ЕСТЬNULL(ПФ.Родитель.ДобавлятьВМенюПечати, ЛОЖЬ) КАК ДобавлятьВМенюПечатиРодитель,
	|	ПФ.ДобавлятьВМенюПечати КАК ДобавлятьВМенюПечати,
	|	ПФ.ПараметрПринадлежности.Ссылка,
	|	ПФ.Код,
	|	Выбор Когда ПФ.ПредставлениеКнопки <> """" Тогда ПФ.ПредставлениеКнопки Иначе ПФ.Наименование Конец Как Наименование,
	|	ПФ.ПоУмолчанию,
	|	ПФ.УниверсальнаяПечатнаяФорма,
	|	ВЫБОР
	|			КОГДА ПФ.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА &Дата >= ПФ.ДатаНачалаДействия
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА ПФ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА ПФ.ДатаОкончанияДействия >= &Дата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК Действует,
	|	ВЫБОР
	|		КОГДА ПФ.ДатаОкончанияДействия <= &Дата
	|				И НЕ ПФ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Действовала,
	|	ПФ.ДатаОкончанияДействия,
	|	ПФ.ДатаНачалаДействия,
	|	ПФ.Статус
	|ИЗ
	|	Справочник.уб_ПечатныеФормы КАК ПФ
	|ГДЕ
	|	(ПФ.ДобавлятьВМенюПечати
	|			ИЛИ ПФ.Родитель.ДобавлятьВМенюПечати)
	|	И ПФ.ДокументКонфигурации = &Документ");
	Запрос.УстановитьПараметр("Документ", 		ИмяОбъекта);
	Запрос.УстановитьПараметр("Дата", 			?(Объект.Дата = Дата(1,1,1),ТекущаяДата(),Объект.Дата));
	Запрос.УстановитьПараметр("ТекущаяДата", 	НачалоДня(ТекущаяДата()));
	Если ИмяОбъекта = "уб_ОтчетПоставщику" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И (ПФ.Поставщик = &Поставщик
		|			ИЛИ ПФ.УниверсальнаяПечатнаяФорма)
		|	И ВЫБОР
		|			КОГДА ПФ.ОрганизацияАгент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ПФ.ОрганизацияАгент = &ОрганизацияАгент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И (ПФ.ПараметрПринадлежности.Ссылка ЕСТЬ NULL 
		|	ИЛИ ПФ.ПараметрПринадлежности = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка) 
		|	ИЛИ ПФ.ПараметрПринадлежности = &ВидСП)";
		Запрос.УстановитьПараметр("Поставщик", 			Объект.Поставщик);
		Запрос.УстановитьПараметр("ОрганизацияАгент", 	Объект.ОрганизацияАгент);
		Запрос.УстановитьПараметр("ВидСП", 				Объект.ВидСП);
	ИначеЕсли ИмяОбъекта = "уб_Доверенности" Тогда
		//Выбираем все ПФ у которых:
		// Оргагент равен Доверителю
		// Оргагент равен Пустой ссылке на справочник типа доверителя
		// Оргагент = Неопределено
		Доверитель = Ссылка.Доверитель;
		ВидДоверенности = Ссылка.ВидДоверенности;
		Если Доверитель = Неопределено Тогда
			ЗначПараметра = Неопределено;	
		Иначе
			ЗначПараметра = Справочники[Доверитель.Метаданные().Имя].ПустаяСсылка();	
		КонецЕсли;		
		Запрос.Текст = Запрос.Текст + 
		"	И (ПФ.ПараметрПринадлежности.Ссылка = &ВидДоверенности
		|	И (ПФ.ОрганизацияАгент = &Доверитель
		|	ИЛИ ПФ.ОрганизацияАгент = &ПустаяСсылкаТипаСправочникаДоверителя
		|	ИЛИ ПФ.ОрганизацияАгент = &Неопределено)
		|	ИЛИ ПФ.УниверсальнаяПечатнаяФорма)";
		Запрос.УстановитьПараметр("ПустаяСсылкаТипаСправочникаДоверителя", 	ЗначПараметра);			   
		Запрос.УстановитьПараметр("Неопределено", 							Неопределено);			   
		Запрос.УстановитьПараметр("ВидДоверенности", 						ВидДоверенности);
		Запрос.УстановитьПараметр("Доверитель", 							Доверитель);
	ИначеЕсли ИмяОбъекта 	= "уб_ОбъявлениеВСМИобУтратеБСО"
		Или ИмяОбъекта 		= "уб_ЗаявлениеОбУтрате"
		Или ИмяОбъекта 		= "уб_СписаниеБСО"
		Или ИмяОбъекта		= "уб_ЗаявлениеВПолицию"
		Тогда
		Запрос.Текст = Запрос.Текст + "	И ПФ.УниверсальнаяПечатнаяФорма";
	ИначеЕсли ИмяОбъекта = "уб_ПередачаБСОПоставщику"
		Или ИмяОбъекта = "уб_ПоступлениеБСО"
		Или ИмяОбъекта = "уб_СверкаБСО" 
		Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И (ПФ.Поставщик = &Поставщик
		|			ИЛИ ПФ.УниверсальнаяПечатнаяФорма)
		|	И ВЫБОР
		|			КОГДА ПФ.ОрганизацияАгент <> &ПустойОргАгент
		|				ТОГДА ПФ.ОрганизацияАгент = &ОрганизацияАгент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Поставщик", 			Ссылка.Поставщик);
		Запрос.УстановитьПараметр("ОрганизацияАгент", 	Ссылка.ОрганизацияАгент);
		Запрос.УстановитьПараметр("ПустойОргАгент", 	Справочники.Организации.ПустаяСсылка());
	ИначеЕсли ИмяОбъекта = "уб_УведомлениеПоставщикаОбУтратеБСО" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И (ПФ.Поставщик = &Поставщик
		|			ИЛИ ПФ.УниверсальнаяПечатнаяФорма)";
		Запрос.УстановитьПараметр("Поставщик", Ссылка.Поставщик);
	ИначеЕсли ИмяОбъекта = "уб_ВыплатаЗП" 
		Или ИмяОбъекта = "уб_НачислениеЗП" 
		Тогда
		Запрос.Текст = Запрос.Текст + "	И ПФ.ОрганизацияАгент = &ОрганизацияАгент";
		Запрос.УстановитьПараметр("ОрганизацияАгент", Ссылка.Организация);
	ИначеЕсли ИмяОбъекта = "уб_УведомлениеОДосрочномПрекращенииДействияДоговора" Тогда
		Запрос.Текст = Запрос.Текст + "	И ПФ.ОрганизацияАгент = &ОрганизацияАгент";
		Запрос.УстановитьПараметр("ОрганизацияАгент", Ссылка.СозданНаОсновании.ОрганизацияАгент);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	УниверсальнаяПечатнаяФорма Убыв, Наименование Убыв";
	НайденаПФ = Ложь;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() И (ИмяОбъекта = "уб_ВыплатаЗП" Или ИмяОбъекта = "уб_НачислениеЗП") Тогда
		Запрос.УстановитьПараметр("ОрганизацияАгент", Справочники.Организации.ПустаяСсылка());
		Результат = Запрос.Выполнить();
	КонецЕсли;
	Выборка = Результат.Выбрать();//Выгрузить();
	//Для каждого Стр Из ТЗ Цикл
	Пока Выборка.Следующий() Цикл
		Если ТолькоУниверсальные и Не Выборка.УниверсальнаяПечатнаяФорма Тогда
			Продолжить;
		КонецЕсли;
		
		//!!!!
		Если Найти(ВРЕГ(Выборка.Наименование),"СУБАГЕНТ")>0 Тогда
			Продолжить;
		КонецЕсли;	
		СтрокаТЗ = ТабПФ.Добавить();
		СтрокаТЗ.КодПФ 					= "ПФ" + Выборка.Код;
		СтрокаТЗ.СсылкаПФ 				= Выборка.Ссылка;
		СтрокаТЗ.Наименование   		= Выборка.Наименование + ?(Выборка.Действовала, " (по " + Формат(Выборка.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy") + ")", "");
		СтрокаТЗ.ДобавлятьВМенюПечати   = Выборка.ДобавлятьВМенюПечати;
		СтрокаТЗ.Статус					= Выборка.Статус;
		СтрокаТЗ.Действовала			= Выборка.Действовала;
		СтрокаТЗ.ПоУмолчанию			= Выборка.ПоУмолчанию;
		Если Выборка.ПоУмолчанию И Не Выборка.УниверсальнаяПечатнаяФорма И Не НайденаПФ Тогда			
			#Если Клиент Тогда
			СохранитьЗначение(Ссылка.Метаданные().Имя + "МакетПечати", Выборка.Наименование);
			#КонецЕсли
			НайденаПФ = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ДобавлятьСубагентскиеПФ И ИмяОбъекта = "уб_ОтчетПоставщику" Тогда
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если ТолькоУниверсальные и Не Выборка.УниверсальнаяПечатнаяФорма Тогда
				Продолжить;
			КонецЕсли;
			//!!!!
			Если Найти(ВРЕГ(Выборка.Наименование),"СУБАГЕНТ")>0 Тогда
				СтрокаТЗ = ТабПФ.Добавить();
				СтрокаТЗ.КодПФ					= "СА" + Выборка.Код;
				СтрокаТЗ.Наименование   		= Выборка.Наименование + ?(Выборка.Действовала, " (по " + Формат(Выборка.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy") + ")", "") + " (субагент)";
				СтрокаТЗ.ДобавлятьВМенюПечати   = Выборка.ДобавлятьВМенюПечати;
				СтрокаТЗ.Статус					= Выборка.Статус;
				СтрокаТЗ.Действовала			= Выборка.Действовала;
				СтрокаТЗ.ПоУмолчанию			= Ложь;
				СтрокаТЗ.СсылкаПФ				= Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ТабПФ;
	
КонецФункции

Процедура ДобавитьОбщиеПоказателиПечатныхФорм(Контекст, КодПФ = Неопределено) Экспорт
	
	Объект = Контекст.Объект;
	ИмяДокумента = Контекст.ИмяОбъекта;
	Показатели = Новый Структура;
	ТЧДокумента = Контекст.ТЧДокумента;
	//Контекст.Вставить("СтруктураОбщихПоказателей",СтруктураОбщихПоказателей);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_ПечатныеФормыОбщиеПоказатели.ОбщийПоказатель
	|ПОМЕСТИТЬ ВТ_ОтключенныеПоказатели
	|ИЗ
	|	Справочник.уб_ПечатныеФормы.ОбщиеПоказатели КАК уб_ПечатныеФормыОбщиеПоказатели
	|ГДЕ
	|	уб_ПечатныеФормыОбщиеПоказатели.Ссылка = &СсылкаПФ
	|	И уб_ПечатныеФормыОбщиеПоказатели.Отключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ОбщиеПоказателиПечатныхФорм.ИмяПоказателя,
	|	уб_ОбщиеПоказателиПечатныхФорм.Формула,
	|	уб_ОбщиеПоказателиПечатныхФорм.ПоказательТабличнойЧасти,
	|	уб_ОбщиеПоказателиПечатныхФорм.Порядок,
	|	уб_ОбщиеПоказателиПечатныхФорм.РассчитыватьИтоги,
	|	уб_ОбщиеПоказателиПечатныхФорм.Разрядность,
	|	уб_ОбщиеПоказателиПечатныхФорм.РазрядностьДробнойЧасти
	|ПОМЕСТИТЬ ВТ_Показатели
	|ИЗ
	|	Справочник.уб_ОбщиеПоказателиПечатныхФорм КАК уб_ОбщиеПоказателиПечатныхФорм
	|ГДЕ
	|	уб_ОбщиеПоказателиПечатныхФорм.Наименование = &ИмяДокумента
	|	И НЕ уб_ОбщиеПоказателиПечатныхФорм.ПометкаУдаления
	|	И НЕ уб_ОбщиеПоказателиПечатныхФорм.Ссылка В
	|				(ВЫБРАТЬ
	|					Т.ОбщийПоказатель
	|				ИЗ
	|					ВТ_ОтключенныеПоказатели КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Показатели.ИмяПоказателя,
	|	ВТ_Показатели.Формула
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|ГДЕ
	|	НЕ ВТ_Показатели.ПоказательТабличнойЧасти
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Показатели.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Показатели.ИмяПоказателя,
	|	ВТ_Показатели.Формула,
	|	ВТ_Показатели.РассчитыватьИтоги,
	|	ВТ_Показатели.Разрядность,
	|	ВТ_Показатели.РазрядностьДробнойЧасти
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|ГДЕ
	|	ВТ_Показатели.ПоказательТабличнойЧасти
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Показатели.Порядок";	
	Запрос.УстановитьПараметр("ИмяДокумента",	ИмяДокумента);
	Запрос.УстановитьПараметр("СсылкаПФ",		?(КодПФ = Неопределено, Контекст.СсылкаПФ, Справочники.уб_ПечатныеФормы.НайтиПоКоду(КодПФ)));
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[2].Выбрать();//общие показатели шапки
	Пока Выборка.Следующий() Цикл		
		Формула = Выборка.Формула;
		ИмяПоказателя = Выборка.ИмяПоказателя;
		Если Не ПустаяСтрока(Формула) И Не ПустаяСтрока(ИмяПоказателя) Тогда						
			ЗначениеПоказателя = Неопределено;
			Попытка
				Выполнить(Формула);
				Показатели.Вставить(ИмяПоказателя, ЗначениеПоказателя);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка вычисления общего показателя " + ИмяПоказателя + " при выполнении кода: 
				| " + Формула + "
				|Имя документа = " + ИмяДокумента + ";
				|Справочник печатной формы = " + Контекст.СтруктураОбъектаПФ.Наименование + " (" + Контекст.СтруктураОбъектаПФ.Код +")" + ";
				|Описание ошибки: " + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(ТЧДокумента) = Тип("ТаблицаЗначений") Тогда
		ВыборкаТЧ = Результат[3].Выбрать();//общие показатели табличной части
		МассивПоказателейДляЗаполнения 	= Новый Массив;
		МассивПоказателейСИтогами		= Новый Массив;
		ТЗИтогов = Контекст.Контейнер_Итоги.Владелец();
		ТЗПоказателей = Новый ТаблицаЗначений;
		ТЗПоказателей.Колонки.Добавить("ИмяПоказателя");
		ТЗПоказателей.Колонки.Добавить("РассчитыватьИтоги");
		ТЗПоказателей.Колонки.Добавить("Разрядность");
		ТЗПоказателей.Колонки.Добавить("РазрядностьДробнойЧасти");
		Пока ВыборкаТЧ.Следующий() Цикл//Добавить колонки для общих показателей
			ИмяПоказателя = ВыборкаТЧ.ИмяПоказателя;
			Если ТЧДокумента.Колонки.Найти(ИмяПоказателя) = Неопределено Тогда
				ТЧДокумента.Колонки.Добавить(ИмяПоказателя);
				МассивПоказателейДляЗаполнения.Добавить(ИмяПоказателя);
			КонецЕсли;
			СтрокаТЗ = ТЗПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, ВыборкаТЧ);			
			Если ВыборкаТЧ.РассчитыватьИтоги И ТЗИтогов.Колонки.Найти(ИмяПоказателя) = Неопределено Тогда
				ТЗИтогов.Колонки.Добавить(ИмяПоказателя, ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(ВыборкаТЧ.Разрядность, ВыборкаТЧ.РазрядностьДробнойЧасти));
			КонецЕсли;
		КонецЦикла;
		Показатели.Вставить("ТЗПоказателей", ТЗПоказателей);
		Для Каждого Стр Из ТЧДокумента Цикл		
			ВыборкаТЧ.Сбросить();
			Пока ВыборкаТЧ.Следующий() Цикл			
				ЗначениеПоказателя = Неопределено;
				Формула = ВыборкаТЧ.Формула;
				ИмяПоказателя = ВыборкаТЧ.ИмяПоказателя;
				Если МассивПоказателейДляЗаполнения.Найти(ИмяПоказателя) <> Неопределено Тогда				
					Попытка
						Выполнить(Формула);
						Если ВыборкаТЧ.РассчитыватьИтоги И ТипЗнч(ЗначениеПоказателя) <> Тип("Число") Тогда
							//ошибка частного кода, должен быть тип число
							ЗначениеПоказателя = 0;
						КонецЕсли;
						Стр[ИмяПоказателя] = ЗначениеПоказателя;
					Исключение
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка вычисления общего показателя " + ИмяПоказателя + " при выполнении кода:
						| " + Формула + "
						|Имя документа = " + ИмяДокумента + ";
						|Справочник печатной формы = " + Контекст.СтруктураОбъектаПФ.Наименование + " (" + Контекст.СтруктураОбъектаПФ.Код + ")" + ";
						|Описание ошибки: " + ОписаниеОшибки();
						Сообщение.Сообщить();
						Если ВыборкаТЧ.РассчитыватьИтоги Тогда
							//чтобы посчитались итоги, и зная, что показатель числовой, запишем вместо ЗначениеПоказателя = Неопределено на 0
							Стр[ИмяПоказателя] = 0
						КонецЕсли;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Контекст.Показатели = Показатели;
	
КонецПроцедуры

Процедура НайтиОтличияОтТекущегоСостояния(Контекст)
	ТЧДокумента = Контекст.ТЧДокумента;
	Если ТипЗнч(ТЧДокумента) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Оплата Из ТЧДокумента Цикл
			СтрокаТЧДокументаТекущегоСостояния = Контекст.ТабличнаяЧатьТекущегоСостоянияДокумента.Найти(Оплата.Ссылка,"Ссылка");
			СписокИзменений = Новый СписокЗначений;
			Для Каждого КолонкаТаблицы Из ТЧДокумента.Колонки Цикл
				Если СтрокаТЧДокументаТекущегоСостояния <> Неопределено Тогда
					Если Контекст.ТабличнаяЧатьТекущегоСостоянияДокумента.Колонки.Найти(КолонкаТаблицы.Имя) <> Неопределено Тогда
						ЗначениеСлева = Оплата[КолонкаТаблицы.Имя];
						ЗначениеСправа = СтрокаТЧДокументаТекущегоСостояния[КолонкаТаблицы.Имя];
						ПроверитьЗаполнениеЗначений(ЗначениеСлева, ЗначениеСправа, КолонкаТаблицы.Имя, Контекст);
						Если ЗначениеСлева <> ЗначениеСправа Тогда
							СписокИзменений.Добавить(КолонкаТаблицы.Имя);
						КонецЕсли;
					Иначе
						СписокИзменений.Добавить(КолонкаТаблицы.Имя);
					КонецЕсли;
				Иначе
					СписокИзменений.Добавить(КолонкаТаблицы.Имя);
				КонецЕсли;
			КонецЦикла;
			Оплата.Изменить = СписокИзменений;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьЗаполнениеЗначений(ЗначениеСлева, ЗначениеСправа, ИмяКолонкаТаблицы, Контекст)
		
	Если ИмяКолонкаТаблицы = "НомерВзноса" Или ИмяКолонкаТаблицы = "ПризнакПлатежа" Тогда
		Номер = Найти(ЗначениеСлева," ");
		Если Номер > 0 Тогда
			СтрокаДляСравнения = Лев(ЗначениеСлева,Номер - 1);
			Если СтрокаДляСравнения = Строка(ЗначениеСправа) Тогда
				ЗначениеСправа = ЗначениеСлева;
			КонецЕсли;
		ИначеЕсли Нрег(ЗначениеСлева) = "п.премия" И ЗначениеСправа = 1 Тогда
			ЗначениеСправа = ЗначениеСлева;
		КонецЕсли;
	Иначе
		Если ТипЗнч(ЗначениеСлева) = Тип("Число") Тогда
			Если ИмяКолонкаТаблицы <> "Курс" Тогда
				ЗначениеСлева = Формат(ЗначениеСлева,Контекст.ЧФ);
			Иначе
				ЗначениеСлева = Формат(ЗначениеСлева,"ЧДЦ=4");
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(ЗначениеСправа) = Тип("Число") Тогда
			Если ИмяКолонкаТаблицы <> "Курс" Тогда
				ЗначениеСправа = Формат(ЗначениеСправа,Контекст.ЧФ);
			Иначе
				ЗначениеСправа = Формат(ЗначениеСправа,"ЧДЦ=4");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура Печать(Контекст, Объект, ИмяМакета) Экспорт
	
	ИмяОбъекта = Контекст.ИмяОбъекта;
	Если Не Объект_Печать_степ2(Объект, Контекст, ИмяМакета) Тогда 
		Возврат;
	КонецЕсли;
	Контекст.ТЧДокумента = ПолучитьТЗизТЧдляПечати(Контекст);
	Если Контекст.Свойство("ЭтоИсторияОП") И Контекст.ЭтоИсторияОП = Истина Тогда
		НайтиОтличияОтТекущегоСостояния(Контекст);
	КонецЕсли;
	Если Контекст.СтруктураОбъектаПФ.ЭтоКомплект Тогда//Если Контекст.ОбъектПФ.ЭтоКомплект Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПФ.Ссылка,
		|	ПФ.Код
		|ИЗ
		|	Справочник.уб_ПечатныеФормы КАК ПФ
		|ГДЕ
		|	ПФ.Родитель = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Контекст.СсылкаПФ);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Контекст.СсылкаПФ = Выборка.Ссылка;
			Контекст.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(Выборка.Ссылка);
			Если Не Объект_Печать_степ2(Объект, Контекст, "ПФ" + Выборка.Код) Тогда
				Возврат;
			КонецЕсли;
			//TODO оптимизировать! Чтобы не перебирать одни и те же данные в цикле,
			//только изза различий отключенных показателей
			ДобавитьОбщиеПоказателиПечатныхФорм(Контекст, "ПФ" + Выборка.Код);
			ЧастныйКод = Контекст.СтруктураОбъектаПФ.ТекстПрограммы.Получить();
			Если СокрЛП(ЧастныйКод) = "" Тогда
				ЧастныйКод = ЗаполнитьСтандартныйКодПФ(Контекст);
			КонецЕсли;
			Попытка
				Выполнить(ЧастныйКод)
			Исключение
				//ППС 13-08-2014
				СообщениеОшибки = ОписаниеОшибки();
				Если Не ПустаяСтрока(СообщениеОшибки) Тогда
					
					СообщениеОшибки = СформироватьСообщениеОшибка(Контекст, СообщениеОшибки, ЧастныйКод);
					
					Если Контекст.Отладка.Включена Тогда
						ТипСообщения = "Сообщить";
					Иначе
						ТипСообщения = "ЛишьВЖурналаРегистрации";
					КонецЕсли;
					
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СообщениеОшибки, ТипСообщения, Истина);
					
				КонецЕсли;
				//ППС 13-08-2014
			КонецПопытки;
		КонецЦикла;
	Иначе
		ДобавитьОбщиеПоказателиПечатныхФорм(Контекст);
		ЧастныйКод = Контекст.СтруктураОбъектаПФ.ТекстПрограммы.Получить();
		Если СокрЛП(ЧастныйКод) = "" Тогда
			ЧастныйКод = ЗаполнитьСтандартныйКодПФ(Контекст);
		КонецЕсли;
		Попытка
			Выполнить(ЧастныйКод)
		Исключение
			//ППС 13-08-2014
			СообщениеОшибки = ОписаниеОшибки();
			Если Не ПустаяСтрока(СообщениеОшибки) Тогда
				
				СообщениеОшибки = СформироватьСообщениеОшибка(Контекст, СообщениеОшибки, ЧастныйКод);
				
				Если Контекст.Отладка.Включена Тогда
					ТипСообщения = "Сообщить";
				Иначе
					ТипСообщения = "ЛишьВЖурналаРегистрации";
				КонецЕсли;
				
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СообщениеОшибки, ТипСообщения, Истина);
				
			КонецЕсли;                               
			//ППС 13-08-2014
		КонецПопытки;
	КонецЕсли;
	Если Контекст.Отладка.Включена Тогда
		Сообщить("<<<< " + ?(Контекст.Отладка.ТЗОшибок.Количество() > 0, "Ошибок: " + Контекст.Отладка.ТЗОшибок.Количество(),"ОК") + " <<<<");
	КонецЕсли;
	//частно для передачи БСО Поставщику
	Если ИмяОбъекта = "уб_ПередачаБСОПоставщику" Тогда
		Если ЗначениеЗаполнено(Контекст.Объект.Курьер) Тогда
			ПечатьАктаПередачиКурьеру(Контекст);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ПечатьАктаПередачиКурьеру(Контекст) Экспорт
	
	Объект 			= Контекст.Объект;
	Курьер 			= Объект.Курьер;
	Агент			= Объект.Агент;
	Поставщик   	= Объект.Поставщик;
	Дата			= Объект.Дата;
	Номер			= Объект.Номер;
	НомерДляОтчета  = Объект.НомерДляОтчета;
	мБСОклон = Контекст.ТЧДокумента;
	//ТОДО перевести акт в шаблоны ПФ.
	Макет = Документы.уб_ПередачаБСОПоставщику.ПолучитьМакет("АктКурьеру");
	ТабДок2 = Новый ТабличныйДокумент;
	
	сНомерАкта		= ?(НомерДляОтчета <> "",НомерДляОтчета + " (" + Формат(Номер,"ЧГ=") + ")",Формат(Номер,"ЧГ="));
	сНомерАктаПП	= сНомерАкта + "-п";
	сДатаАкта		= Формат(Дата,"ДЛФ=ДД");
	
	ОбластьМакета_Шапка = Макет.ПолучитьОбласть("ШапкаКурьера");
	
	Прм = ОбластьМакета_Шапка.Параметры;
	Прм.Номер0				= сНомерАкта;
	Прм.Номер				= сНомерАктаПП;
	Прм.Дата				= сДатаАкта;
	Прм.Поставщик			= ДайНаименованиеКонтрагента(Поставщик, сДатаАкта, Истина, 1, 1, Истина);
	Прм.АгентОтправитель	= Агент;
	Прм.АгентПолучатель		= Курьер;
	
	ТабДок2.Вывести(ОбластьМакета_Шапка);
	
	ОбластьМакета_ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыКурьера");
	ТабДок2.Вывести(ОбластьМакета_ШапкаТаблицы);
	
	ОбластьМакета_СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаКурьера");
	ПрмС = ОбластьМакета_СтрокаТаблицы.Параметры;
	
	ОбластьМакета_ГруппаСК = Макет.ПолучитьОбласть("ГруппаСККурьера");
	
	
	мБСОклон.Сортировать("СК,ВидБСО,НомерБСО");
	ТекущаяСК = Неопределено;	
	СчетчикСтрок = 0;
	 
	Для Каждого СтрокаТЧ из мБСОклон Цикл
		Если ТекущаяСК <> СтрокаТЧ.СК Тогда
			ОбластьМакета_ГруппаСК.Параметры.СК = СтрокаТЧ.СК;	
			ТабДок2.Вывести(ОбластьМакета_ГруппаСК);
		КонецЕсли;
		ТекущаяСК = СтрокаТЧ.СК;
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ПрмС.НомерСтроки	  = СчетчикСтрок;
		ПрмС.ВидБСО			  = СтрокаТЧ.ВидБСО;		
		ПрмС.НомерБСО	 	  = СтрокаТЧ.НомерБСО;
		ПрмС.НомерПолиса 	  = СтрокаТЧ.НомерПолиса;
		ПрмС.СостояниеБСО 	  = СтрокаТЧ.Состояние;
		ПрмС.Страхователь 	  = СтрокаТЧ.Страхователь;
		ПрмС.РасшСтрахователь = СтрокаТЧ.РасшСтрахователь;
		
		ТабДок2.Вывести(ОбластьМакета_СтрокаТаблицы);
	КонецЦикла;
	
	
	ОбластьМакета_Подвал = Макет.ПолучитьОбласть("ПодвалКурьера");
	
	ПрмП = ОбластьМакета_Подвал.Параметры;
	ПрмП.Сдал = Агент;
	ПрмП.Курьер = Курьер;
	
	ПрмП.ТекДень = Формат(Дата,"ДФ='dd'");
	ПрмП.ТекМесяц = ФункцииРасширения.Месяца(Дата);
	ПрмП.ТекГод = Формат(Дата,"ДФ='yyyy'");

	ТабДок2.Вывести(ОбластьМакета_Подвал);

	ТабДок2.ОтображатьЗаголовки	= Истина;
	ТабДок2.ОтображатьСетку		= Ложь;
	ТабДок2.ТолькоПросмотр		= Истина;
	ТабДок2.Защита				= Ложь;
	ТабДок2.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДок2.АвтоМасштаб			= Истина;
	
	ТабДок2.ПовторятьПриПечатиСтроки = ТабДок2.Области.ШапкаТаблицыКурьера;

	ТабДок2.РазмерКолонтитулаСверху = 6;
	ВКлн = ТабДок2.ВерхнийКолонтитул;
	ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ВКлн.НачальнаяСтраница = 1;
	ВКлн.Выводить	= Истина;
	ВКлн.ТекстСлева = "АКТ п/п БСО №" + сНомерАктаПП + " от " + сДатаАкта + ". Передает: "
		+ Строка(Агент) + ", принимает: " + Строка(Курьер);
	ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
	//ВКлн.Шрифт = Новый Шрифт(,7);
	
	ТабДок2.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДок2.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница = 1;
	HКлн.Выводить	= Истина;
	HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия;
	HКлн.Шрифт = Новый Шрифт(,7);

	ТабДок2.Показать("АКТ пп БСО №" + сНомерАктаПП + " от " + сДатаАкта + " (от " + Строка(Агент) + " курьеру " + Строка(Курьер) + ")");
КонецПроцедуры

Функция ПолучитьТЗизТЧдляПечати(Контекст) Экспорт
	
	ИмяОбъекта = Контекст.ИмяОбъекта;
	Если ИмяОбъекта = "уб_Доверенности" Или ИмяОбъекта = "уб_СтраховойПолис" Тогда
		//не нужна
	ИначеЕсли ИмяОбъекта = "уб_ПередачаБСОПоставщику" Тогда
		ТЗБСО = ТЗизТЧ_ПередачаБСОПоставщику(Контекст)
	//для истории отчета поставщику своя ТЗИзТЧ и свойства при открытии элемента справочника печатных форм нет	
	ИначеЕсли ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Контекст, "ЭтоИсторияОП", Истина) Тогда
		ТЗБСО = ОП_ПолучитьТЗОплатИстории(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ОтчетПоставщику" Тогда
		ТЗБСО = ОП_ПолучитьТЗОплат(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ПоступлениеБСО" Тогда
		ТЗБСО = ТЗизТЧ_ПоступлениеБСО(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_УведомлениеОДосрочномПрекращенииДействияДоговора" Тогда
		ТЗБСО = ТЗизТЧ_УведомлениеОДосрочномПрекращенииДействияДоговора(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ТабельУчетаРабочегоВремени" Тогда
		ТЗБСО = ТЗизТЧ_ТабельУчетаРабочегоВремени(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ВыплатаЗП" Или ИмяОбъекта = "НачислениеЗП" Тогда
		ТЗБСО = Контекст.Объект.Ведомость.Выгрузить();
	ИначеЕсли ИмяОбъекта = "уб_ЗаявлениеВПолицию" Тогда
		ТЗБСО = ТЗизТЧ_ЗаявлениеВПолицию(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ИнвентаризацияБСО" Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Подтверждено",Истина);
		Строки = Контекст.Объект.БСО.НайтиСтроки(Отбор);
		ТЗБСО = Контекст.Объект.БСО.Выгрузить(Строки);
	Иначе
		ТЗБСО = ТзизТЧ_Типовая(Контекст)	
	КонецЕсли;
	Возврат ТЗБСО;
	
КонецФункции

Процедура Печать_Обратный_Вызов_3(Контекст) Экспорт
	
	//Определяем тип доверителя
	//В зависимости от типа доверителя будут браться соответствующие типовые блоки макета доверенности
	Контекст.Вставить("ТипДоверителя");
	Объект = Контекст.Объект;
	Доверитель = Объект.Доверитель;
	ЕдиницаИзмеренияСрокаДействия = Объект.ЕдиницаИзмеренияСрокаДействия;
	СрокДействия = Объект.СрокДействия;
	ДоверенноеЛицо = Объект.ДоверенноеЛицо;	
	Если ТипЗнч(Доверитель) = Тип("СправочникСсылка.Организации") Тогда
		Если Доверитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Контекст.ТипДоверителя = "ФизЛицо";
			Если Доверитель.ЭтоИндивидуальныйПредприниматель Тогда
				Контекст.ТипДоверителя = "ИП";
			Иначе
				Контекст.ТипДоверителя = "ФизЛицо";
				Контекст.Контейнер_Документ.Доверитель = Доверитель.ИндивидуальныйПредприниматель; 	
			КонецЕсли;
		Иначе
			Контекст.ТипДоверителя = ?(Доверитель.ЭтоИндивидуальныйПредприниматель,"ИП","Организация");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Доверитель)= Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Контекст.ТипДоверителя = "ФизЛицо";
	КонецЕсли;	
	//Получаем структуру "ответственного лица" Доверенного
	//В ней предуспотрены поля для структур адреса и паспортных данных	
 	ОЛДоверенного = ДайОтветственноеЛицоДляФизлица(ДоверенноеЛицо, Ложь);  
	Если ОЛДоверенного.ПаспортныеДанные = Неопределено Тогда
		#Если Клиент Тогда
		Предупреждение("Паспортные данные доверенного лица не указаны! Печать не возможна");
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	Если ОЛДоверенного.АдресПрописки = Неопределено Тогда
		#Если Клиент Тогда
		Предупреждение("Адрес по прописке доверенного лица не указан! Печать не возможна");
		#КонецЕсли
		Возврат;	
	КонецЕсли;			
	//Создаем новое свойство контейнера для использования в Параметрах макетов
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "АдресДоверенногоЛица", ОЛДоверенного.АдресПрописки.Представление);	
	ПД = ОЛДоверенного.ПаспортныеДанные;
	ПДДЛ = "паспорт: " + ПД.ДокументСерия + " № " + ПД.ДокументНомер + ", выдан: " 
	+ Формат(ПД.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy") + "г., " + ПД.ДокументКемВыдан;
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "ПаспортДоверенногоЛица", ПДДЛ);		
	//Создаем новое свойство контейнера для использования в Параметрах макетов
	ДобавитьСвойствоВКонтейнер(Контекст.Контейнер_Документ, "Срок", ДайПериодПрописью(СрокДействия, ЕдиницаИзмеренияСрокаДействия));		
	//Создаем клон структуры контекста, который будет использоваться для работы с макетом типовых блоков доверенности
	//В этой структуре будут альтернативный Макет и СсылкаПФ
	Контекст.Вставить("КонтекстТиповогоМакета", КлонироватьКонтекст(Контекст));	
	ПФ = ПараметрыСеанса.уб_Константы.МакетТиповыхБлоковДоверенности;
	Контекст.КонтекстТиповогоМакета.Макет = ПФ.МакетШаблона.Получить();
	Контекст.КонтекстТиповогоМакета.СсылкаПФ = ПФ;
	Контекст.КонтекстТиповогоМакета.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(ПФ);//Контекст.КонтекстТиповогоМакета.ОбъектПФ = ПФ.ПолучитьОбъект();
	Если Контекст.ТипДоверителя <> "ФизЛицо" Тогда
		ВывестиШапкуОрганизации(Контекст, Доверитель, Истина);	
	КонецЕсли;
	
КонецПроцедуры

//Типовая функция, вызываемая из процедуры "Печать" модуля объекта документа
Функция Объект_Печать_степ2(Объект, Контекст, ИмяМакета) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда 
		#Если Клиент Тогда
		Предупреждение("Документ можно распечатать только после его записи"); 
		#КонецЕсли
		Рез = Ложь;
		Перейти ~НаВыход;
	КонецЕсли;
	//TODO - Работа с диалогами для внешнего соединения?
	#Если Клиент И Сервер Тогда
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(Объект) Тогда 
		Рез = Ложь;
		Перейти ~НаВыход;
	КонецЕсли;          
	#КонецЕсли
    Если ИмяМакета = "РазличияОтчета" Тогда
		 Рез = Объект.ПечатьРазличийОтчетаИОплат();
	КонецЕсли;
	//ИнициализироватьКонтекстПечати(Контекст);
	Контекст.ИмяМакета 	= ИмяМакета;
	Контекст.Объект 	= Объект;
	//ОбъектМетаданные 	= Объект.Метаданные();
	ИмяОбъекта = Контекст.ИмяОбъекта;
	Если Контекст.Отладка.Включена Тогда
		Сообщить("
		|>>>> Начало проверки " + ИмяМакета + " (" + Строка(Объект.Ссылка)+ ") >>>>>");
	КонецЕсли;
	отладка_Лог_НачалоПроцедуры(Контекст, "Объект_Печать_степ2 (Объект: '" + Строка(Объект.Ссылка) + "', Макет: '" + ИмяМакета + "')");	
	// Очищаем результрующий табличный документ при очередном вызове печати
	//!!!!!Контекст.ТабличныйДокумент = Новый ТабличныйДокумент;
	//TODO убрать этот код, предварительно исправив
	Если ИмяОбъекта = "уб_ОтчетПоставщику" Тогда
		Контекст.КоличествоЭкземпляров = 4;
		Контекст.АвтоУстанавливатьИмяПараметровПечати = Ложь;
		Контекст.ТабличныйДокумент.ИспользуемоеИмяФайла = ""+Формат(Объект.Номер,"ЧГ=")+"-"+уб_b2b.УбратьСимволы(Объект.НомерОтчетаПоставщику);
	ИначеЕсли ИмяОбъекта = "уб_ПередачаБСОПоставщику" Тогда
		Контекст.АвтоУстанавливатьИмяПараметровПечати = Ложь;
		Если Контекст.Объект.ВидОперации = Перечисления.уб_ВидыОперацииПередачиБСОвСК.ПередачаИспорченыхБСО Тогда
			Контекст.КоличествоЭкземпляров = 2;
		ИначеЕсли	Контекст.Объект.ВидОперации = Перечисления.уб_ВидыОперацииПередачиБСОвСК.ПередачаБСО Тогда
			Контекст.КоличествоЭкземпляров = 3;
		КонецЕсли;
	КонецЕсли;
	Если Контекст.СсылкаПФ = Неопределено Тогда
		СтрТабПФ = Контекст.ТабПФ.НайтиСтроки(Новый Структура("КодПФ", ИмяМакета));
		Если СтрТабПФ.Количество() = 0 Тогда 
			Сообщить("Печатная форма " + ИмяМакета + " не входит в состав меню печати и не будет напечатана", СтатусСообщения.Внимание);
			Рез = Ложь;
			Перейти ~НаВыход;
		КонецЕсли;
		СсылкаПФ = СтрТабПФ[0].СсылкаПФ;
		Контекст.СсылкаПФ = СсылкаПФ;
		Контекст.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(СсылкаПФ);//Контекст.ОбъектПФ = СсылкаПФ.ПолучитьОбъект();
	КонецЕсли;
	#Если Клиент Тогда
	Если Не Контекст.Отладка.Включена Тогда 
		ОчиститьСообщения(); 
	КонецЕсли;
	#КонецЕсли
	Если ПараметрыСеанса.уб_отладка_ПечататьТЕСТМакет Тогда
		ОтладкаПечати(Контекст);
		Рез = Истина;
		Перейти ~НаВыход;
	КонецЕсли;
	//TODO только для отчета поставщику форма истории
	Инициализировать_данными_КонтекстПечати(Контекст);
	Если ИмяОбъекта = "уб_Доверенности" Тогда
		Печать_Обратный_Вызов_3(Контекст)
	ИначеЕсли ИмяОбъекта = "уб_ЗаявкаНаПечать" Тогда
		ДобавитьДанныеЗаявкиНаПечать(Контекст);
	КонецЕсли;
	Рез = Истина;
	Перейти ~НаВыход;
~НаВыход:
	отладка_Лог_КонецПроцедуры(Контекст);	
	Возврат Рез;
	
КонецФункции

Функция ОП_ПолучитьТЗОплат(Контекст, ТекущийПоставщик = Неопределено) Экспорт
	
	Объект = Контекст.Объект;
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	О.*,
	|	О.ПолнаяСтраховаяПремия КАК ПолнаяПремия,
	|	О.Дата КАК ДатаОплатыСтраховогоВзноса,
	|	О.СтраховойПолис.Номер КАК НомерПолиса,
	|	О.СтраховойПолис.Дата КАК ДатаОформленияПолиса,
	|	О.СтраховойПолис.ДатаНачала КАК НачалоДействияПолиса,
	|	О.СтраховойПолис.ДатаОкончания КАК ОкончаниеДействияПолиса,
	|	О.СтраховойПолис.Страхователь КАК Страхователь,
	|	О.СтраховойПолис.Страхователь.Наименование КАК НаименованиеСтрахователя,
	|	О.ВидСП КАК ВидСтраховогоПродукта,
	|	О.СтраховойПолис.СтраховаяСумма КАК СтраховаяСумма,
	|	О.СтраховойПолис.Поставщик КАК СтраховойПолисПоставщик,
	|   Выбор Когда &Поставщик <> (ВЫРАЗИТЬ(&ПоставщикДляОтчетаПоКарточкам КАК Справочник.Контрагенты))
	|		Тогда ""ОтчетПоставщику""
	|       Иначе ""ОтчетПоКарточкам"" Конец Как ИмяРеквизитаОтбора
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК О
	|ГДЕ
	|	НЕ О.ПометкаУдаления
	|	И Выбор Когда &Поставщик <> (ВЫРАЗИТЬ(&ПоставщикДляОтчетаПоКарточкам КАК Справочник.Контрагенты))
	|		Тогда О.ОтчетПоставщику = &ОтчетПоставщику
	|       Иначе О.ОтчетПоКарточкам = &ОтчетПоставщику Конец			
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеСтрахователя,Дата";
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		Запрос.УстановитьПараметр("ОтчетПоставщику", Неопределено)
	Иначе
		Запрос.УстановитьПараметр("ОтчетПоставщику", ?(Объект.ЭтоНовый(), Объект.ПолучитьСсылкуНового(), Объект.Ссылка));
	КонецЕсли;
	Запрос.УстановитьПараметр("Поставщик",?(текущийПоставщик = Неопределено, Объект.Поставщик, текущийПоставщик));
	ПоставщикДляОтчетаПоКарточкам = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам;
	Запрос.УстановитьПараметр("ПоставщикДляОтчетаПоКарточкам", ПоставщикДляОтчетаПоКарточкам);
	ТЗОплат = Запрос.Выполнить().Выгрузить();
	ИспользоватьФильтрФормаОплатыКасса = ПараметрыСеанса.уб_Константы.ФильтрВКассуДляСубагентскихПФ = Истина;
	МассивУдаляемыхСтрокТЗ = Новый Массив;
	Если Контекст.Свойство("ЭтоПФСубагент") И Контекст.ЭтоПФСубагент Тогда
		Для Каждого СтрокаТЗ Из ТЗОплат Цикл
			Если ИспользоватьФильтрФормаОплатыКасса	И СтрокаТЗ.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса Тогда
				МассивУдаляемыхСтрокТЗ.Добавить(СтрокаТЗ);
			Иначе
				СтрокаТЗ.КВПроцентДляОтчета			= Контекст.ПроцентСубагента;
				СтрокаТЗ.КВСуммаДляОтчета 			= уб_РасчетыСМенеджерами.уб_ОКР(СтрокаТЗ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику * Контекст.ПроцентСубагента / 100, СтрокаТЗ.РазрядностьОкругления, СтрокаТЗ.РежимОкругления);
				СтрокаТЗ.Поставщик 					= Контекст.Объект.ОрганизацияАгент;
				СтрокаТЗ.ОрганизацияАгент   		= Контекст.Субагент;
				Если СтрокаТЗ.НачисленнаяСуммаВзноса = 0 Тогда
					СтрокаТЗ.Баланс_Брокер_Поставщик = СтрокаТЗ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - СтрокаТЗ.КВСуммаДляОтчета - ?(СтрокаТЗ.НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.ВБрокер, 0, СтрокаТЗ.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для Каждого СтрокаТЗ Из МассивУдаляемыхСтрокТЗ Цикл
		ТЗОплат.Удалить(СтрокаТЗ);
	КонецЦикла;
	Возврат ТЗОплат;
	
КонецФункции

Функция ОП_ПолучитьТЗОплатИстории(Контекст, ТекущийПоставщик = Неопределено) Экспорт
	
	КонтекстТекущегоСостояния = КлонироватьКонтекст(Контекст);
	Если КонтекстТекущегоСостояния.Свойство("ЭтоИсторияОП") Тогда
		КонтекстТекущегоСостояния.ЭтоИсторияОП = Ложь;
	Иначе
		КонтекстТекущегоСостояния.Вставить("ЭтоИсторияОП",Ложь);
	КонецЕсли;	
	КонтекстТекущегоСостояния.ТЧДокумента = ПолучитьТЗизТЧдляПечати(КонтекстТекущегоСостояния);
	ДобавитьОбщиеПоказателиПечатныхФорм(КонтекстТекущегоСостояния);			
	
	Контекст.Вставить("ТабличнаяЧатьТекущегоСостоянияДокумента",КонтекстТекущегоСостояния.ТЧДокумента);
	
	ОплатыСписок = Контекст.ОплатыСписок;
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	ТЗОплат = Новый ТаблицаЗначений;	
	ТЗОплат.Колонки.Добавить("Дата");	
	ТЗОплат.Колонки.Добавить("НомерВзноса");	
	ТЗОплат.Колонки.Добавить("ПолнаяСтраховаяПремия");
	ТЗОплат.Колонки.Добавить("СтраховойПолис");			
	ТЗОплат.Колонки.Добавить("Удалить");
	ТЗОплат.Колонки.Добавить("Добавить");
	ТЗОплат.Колонки.Добавить("Изменить");
	//ТЗОплат.Колонки.Добавить("ОплатаСсылка");
	МассивОплат = ОплатыСписок.ВыгрузитьКолонку("ОплатаСсылка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	уб_ОплатаПолисов.Ссылка В(&МассивОплат)";
	Запрос.УстановитьПараметр("МассивОплат", МассивОплат);	
	//ТекущиеСостояниеОплат = Новый Соответствие;
	//		
	СписокРеквизитовОплаты = уб_ИсторияИзмененияОбъектов.ПолучитьСписокРеквизитов(Документы.уб_ОплатаПолисов.ПустаяСсылка()).Реквизиты;
	ВсегоРеквизитов = СписокРеквизитовОплаты.Количество();		
	
	//Удаляем отсутствующие в Источнике
	Колонки = ОплатыСписок.Колонки;
	Для Счетчик = 1 по ВсегоРеквизитов Цикл
		ТекРеквизит = СписокРеквизитовОплаты[ВсегоРеквизитов - Счетчик];
		Если ТекРеквизит.НаименованиеРеквизита = "СтраховойПолис" Тогда
			Продолжить;
		КонецЕсли;
		Если Колонки.Найти(ТекРеквизит.НаименованиеРеквизита) = Неопределено Тогда
			СписокРеквизитовОплаты.Удалить(ВсегоРеквизитов - Счетчик);
		КонецЕсли;
	КонецЦикла;
	
	ВсегоРеквизитов = СписокРеквизитовОплаты.Количество();
	
	ТаблицаТекущегоСостоянияОплат = Запрос.Выполнить().Выгрузить();
	//Для Каждого Выборка Из ТаблицаТекущегоСостоянияОплат Цикл
	//	СтуктураОплаты = Новый Структура;
	//	СтуктураОплаты.Вставить("Ссылка",Выборка.Ссылка);
	//	Для Каждого РеквизитОплаты Из СписокРеквизитовОплаты Цикл
	//		Если Не СтуктураОплаты.Свойство(РеквизитОплаты.НаименованиеРеквизита) Тогда
	//			СтуктураОплаты.Вставить(РеквизитОплаты.НаименованиеРеквизита,Выборка[РеквизитОплаты.НаименованиеРеквизита]);
	//		КонецЕсли;	
	//	КонецЦикла;
	//	ТекущиеСостояниеОплат.Вставить(Выборка.Ссылка,СтуктураОплаты);
	//КонецЦикла;	
	//Контекст.Вставить("ТекущиеСостояниеОплат",ТекущиеСостояниеОплат);
	
	
	//Создаем отсутствующие в получателе из таблицы текущего состояния оплат
	Колонки = ТЗОплат.Колонки;
	Для Каждого Колонка Из ТаблицаТекущегоСостоянияОплат.Колонки Цикл		
		Если Колонки.Найти(Колонка.Имя) = Неопределено Тогда			
			ТЗОплат.Колонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	//Создаем отсутствующие в получателе из списка реквизитов истории
	Для Счетчик = 1 по ВсегоРеквизитов Цикл
		ТекРеквизит = СписокРеквизитовОплаты[ВсегоРеквизитов - Счетчик];
		Если Колонки.Найти(ТекРеквизит.НаименованиеРеквизита) = Неопределено Тогда
			ТЗОплат.Колонки.Добавить(ТекРеквизит.НаименованиеРеквизита);
		КонецЕсли;
	КонецЦикла;
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Для Каждого Оплата Из ОплатыСписок Цикл
		НоваяСтрока = ТЗОплат.Добавить();
		СтрокаТЗ = ТаблицаТекущегоСостоянияОплат.Найти(Оплата.ОплатаСсылка,"Ссылка");
		Если СтрокаТЗ <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
		КонецЕсли;
		НоваяСтрока.Удалить  = Оплата.Оформление.НайтиПоЗначению("Удалена") <> Неопределено;
		НоваяСтрока.Добавить = Оплата.Оформление.НайтиПоЗначению("Добавлена") <> Неопределено;
		НоваяСтрока.Изменить = Оплата.Оформление;
		//НоваяСтрока.ОплатаСсылка = Оплата.ОплатаСсылка;
							
		Для Каждого Реквизит Из СписокРеквизитовОплаты Цикл
			ДобавлятьВСтроку = Истина;
			Попытка
				Если Реквизит.НаименованиеРеквизита = "СтраховойПолис" Тогда
					ДобавлятьВСтроку = Ложь;
					НоваяСтрока["СтраховойПолис"] = Оплата["СтраховойПолисСсылка"];
				Иначе
					// TODO почему в строку не записываем форму оплаты (направление платежа по новой системе) ??
					Если СистемаНаправлениеПлатежа Тогда
						Если Реквизит.НаименованиеРеквизита = "НаправлениеПлатежа" Тогда
							ДобавлятьВСтроку = Ложь;
							Если Оплата[Реквизит.НаименованиеРеквизита] = Перечисления.уб_НаправленияПлатежа.ВБрокер Тогда
								НоваяСтрока["ВидОплаты"] = "В брокер";
							Иначе
								НоваяСтрока["ВидОплаты"] = "В СК";
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если Реквизит.НаименованиеРеквизита = "ФормаОплаты" Тогда
							ДобавлятьВСтроку = Ложь;
							Если Оплата[Реквизит.НаименованиеРеквизита] = Перечисления.уб_ФормыОплаты.Касса ИЛИ Оплата[Реквизит.НаименованиеРеквизита] = Перечисления.уб_ФормыОплаты.Безнал Тогда
								НоваяСтрока["ВидОплаты"] = "В брокер";
							Иначе
								НоваяСтрока["ВидОплаты"] = "В СК";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Если ДобавлятьВСтроку Тогда
						НоваяСтрока[Реквизит.НаименованиеРеквизита] = Оплата[Реквизит.НаименованиеРеквизита];
					КонецЕсли;
				КонецЕсли;
			Исключение
				Сообщить("Отладка! Не найден реквизит " + Реквизит.НаименованиеРеквизита);
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	Возврат ТЗОплат;
	
КонецФункции

Функция ПолучитьИмяРевизитаОтбора(ЗначениеПоставщик) Экспорт
	
	Возврат ?(ЗначениеПоставщик = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам, "ОтчетПоКарточкам","ОтчетПоставщику")
	
КонецФункции

Функция ТЗизТЧ_ЗаявлениеВПолицию(Контекст)

	Объект = Контекст.Объект;
	//Подготовка таблицы значений для вывода	
	ТЗБСО = Объект.БСО.Выгрузить(); 
	ТЗБСО.Колонки.Добавить("НомерПолиса");
	ТЗБСО.Колонки.Добавить("ТекСостояниеБСО");
	ТЗБСО.Колонки.Добавить("ТекПоложениеБСО");
	ТЗБСО.Колонки.Добавить("Страхователь");
	ТЗБСО.Колонки.Добавить("РасшСтрахователь");
	ТЗБСО.Колонки.Добавить("ДатаОформленияПолиса");
	пСст = Перечисления.уб_СостоянияБСО;
	КоличествоСтрок	= ТЗБСО.Количество();
	Для Сч = 1 По КоличествоСтрок Цикл
		СтрокаТЧ = ТЗБСО[КоличествоСтрок - Сч];
		УдалятьСтроку = НЕ( ?(ЗначениеНеЗаполнено(Контекст.СтруктураОбъектаПФ.Поставщик), Истина, СтрокаТЧ.Поставщик = Контекст.СтруктураОбъектаПФ.Поставщик) И
			?(ЗначениеНеЗаполнено(Контекст.СтруктураОбъектаПФ.ОрганизацияАгент), Истина, СтрокаТЧ.ОрганизацияАгент = Контекст.СтруктураОбъектаПФ.ОрганизацияАгент) );
		Если УдалятьСтроку Тогда
			ТЗБСО.Удалить(ТЗБСО.Индекс(СтрокаТЧ));
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТЧ из ТЗБСО Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекСтрока",СтрокаТЧ);
		СтруктураПараметров.Вставить("ТекСостояниеБСО",Неопределено);
		СтруктураПараметров.Вставить("НаДату",Объект.Дата);
		СтруктураПараметров.Вставить("тсАгент",Неопределено);
		СтруктураПараметров.Вставить("тсПоставщик",Неопределено);
		СтруктураПараметров.Вставить("тсОрганизацияАгент",Неопределено);
		СтруктураПараметров.Вставить("хВидГраницы",ВидГраницы.Исключая);
		СтруктураБСО = уб_СС.ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ(СтруктураПараметров);
		//  СтрокаТЧ
		//, Неопределено
		//, Объект.Дата
		//, Неопределено
		//, Неопределено
		//, Неопределено
		////, ?(Проведен,ВидГраницы.Включая,ВидГраницы.Исключая));
		//, ВидГраницы.Исключая
		СтрокаТЧ.НомерПолиса 		= "";
		СтрокаТЧ.ТекСостояниеБСО	= "";
		СтрокаТЧ.ТекПоложениеБСО	= "";
		СтрокаТЧ.Страхователь 		= "";
		СтрокаТЧ.РасшСтрахователь 	= Неопределено;
		Если СтруктураБСО.КоличественныйУчет Тогда
			СтрокаТЧ.НомерБСО		= СокрЛП(Строка(СтрокаТЧ.Количество))+"шт.";
		Иначе
			СостояниеБСО = СтруктураБСО.СостояниеБСО;
			СтрокаТЧ.ТекСостояниеБСО = СостояниеБСО;
			СтрокаТЧ.ТекПоложениеБСО = СтруктураБСО.ПоложениеБСО;
			Если СтруктураБСО.НомернойУчет и СтруктураБСО.Существует Тогда				
				//Номер полиса выводим 
				//- для бланков БСО пролисов - всегда
			    //- для остальных бланков, если они в состоянии оформлен (и тогда к ним есть номер сопутствующего полиса)
				оСП = СтруктураБСО.СтраховойПолис;
				Если уб_СЛ.ОпределитьЭтоПолис(СтрокаТЧ.ВидБСО) ИЛИ  СостояниеБСО = пСст.Оформлен Тогда
					СтрокаТЧ.НомерПолиса = СокрЛП(СтруктураБСО.НомерПолиса);
				КонецЕсли;
								
				Если НЕ ЗначениеНеЗаполнено(оСП) И СостояниеБСО = пСст.Оформлен Тогда
					СтрокаТЧ.Страхователь			= Строка(оСП.Страхователь);
					СтрокаТЧ.РасшСтрахователь		= оСП;
					СтрокаТЧ.ДатаОформленияПолиса	= оСП.Дата;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	ТЗБСО.Сортировать("Поставщик,ОрганизацияАгент,СК,ВидБСО,НомерБСО");	
	Возврат ТЗБСО;
	
КонецФункции // ТЗизТЧ_ЗаявлениеВПолицию()

Функция ТЗизТЧ_ПередачаБСОПоставщику(Контекст)

	Объект 		= Контекст.Объект;
	Дата		= Объект.Дата;
	Проведен	= Объект.Проведен;
	БСО			= Объект.БСО;
	//Подготовка таблицы значений для вывода
	ТЗБСО = БСО.Выгрузить(); 
	ТЗБСО.Колонки.Добавить("Состояние");
	ТЗБСО.Колонки.Добавить("Страхователь");
	ТЗБСО.Колонки.Добавить("РасшСтрахователь");
	ТЗБСО.Колонки.Добавить("ДатаОформленияПолиса");
	пСст = Перечисления.уб_СостоянияБСО;	
	Для Каждого СтрокаТЧ из ТЗБСО Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекСтрока",СтрокаТЧ);
		СтруктураПараметров.Вставить("НаДату",Дата);
		СтруктураПараметров.Вставить("хВидГраницы",?(Проведен,ВидГраницы.Включая,ВидГраницы.Исключая));
		СтруктураБСО = уб_СС.ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ(СтруктураПараметров);
		//  СтрокаТЧ
		//, Неопределено
		//, Дата
		//, Неопределено
		//, Неопределено
		//, Неопределено
		//, ?(Проведен,ВидГраницы.Включая,ВидГраницы.Исключая)		
		СтрокаТЧ.НомерПолиса 		= "";
		СтрокаТЧ.Состояние	 		= "";
		СтрокаТЧ.Страхователь 		= "";
		СтрокаТЧ.РасшСтрахователь 	= Неопределено;		
		Если СтруктураБСО.КоличественныйУчет Тогда
			СтрокаТЧ.НомерБСО		= СокрЛП(Строка(СтрокаТЧ.Количество))+"шт.";
		Иначе			
			СостояниеБСО = ?(ЗначениеНеЗаполнено(СтрокаТЧ.СостояниеБСО),СтруктураБСО.СостояниеБСО,СтрокаТЧ.СостояниеБСО);
			Если ЛОЖЬ
				или СостояниеБСО = пСст.ПустойБланк
				или СостояниеБСО = пСст.НеиспользованныйБланк
				или СостояниеБСО = пСст.НеПолностьюОформлен
			Тогда
				Сст = "Не использован";
			ИначеЕсли ЛОЖЬ
				или СостояниеБСО = пСст.НедействующийБланк
			Тогда
				Сст = "Не действующий бланк";
			ИначеЕсли ЛОЖЬ
				или СостояниеБСО = пСст.НеполныйБланк
			Тогда
				Сст = "Неполный бланк";
			ИначеЕсли ЛОЖЬ
				или СостояниеБСО = пСст.Оформлен
				или СостояниеБСО = пСст.НеПравильноОформлен
			Тогда
				Сст = "Оформлен";
			ИначеЕсли ЛОЖЬ
				или СостояниеБСО = пСст.Утрачен
				или СостояниеБСО = пСст.Уничтожен
				или СостояниеБСО = пСст.Украден
			Тогда
				Сст = "Утрачен";
			ИначеЕсли ЛОЖЬ
				или СостояниеБСО = пСст.Испорчен
			Тогда
				Сст = "Испорчен";
			Иначе 
				Сст = СтруктураБСО.cСостояниеБСО;
			КонецЕсли;			
			СтрокаТЧ.Состояние 	= Сст;			
			Если СтруктураБСО.НомернойУчет и СтруктураБСО.Существует Тогда
				//Номер полиса выводим 
				//- для бланков БСО пролисов - всегда
			    //- для остальных бланков, если они в состоянии оформлен (и тогда к ним есть номер сопутствующего полиса)
				оСП = СтруктураБСО.СтраховойПолис;
				Если уб_СЛ.ОпределитьЭтоПолис(СтрокаТЧ.ВидБСО) ИЛИ  Сст = "Оформлен" Тогда
					СтрокаТЧ.НомерПолиса 		  = СокрЛП(СтруктураБСО.НомерПолиса);
				КонецЕсли;								
				Если НЕ ЗначениеНеЗаполнено(оСП) И Сст = "Оформлен" Тогда
					СтрокаТЧ.Страхователь		  = Строка(оСП.Страхователь.Наименование);
					СтрокаТЧ.РасшСтрахователь	  = оСП;
					СтрокаТЧ.ДатаОформленияПолиса = оСП.Дата;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТЗБСО;	

КонецФункции // ТЗизТЧ_ПередачаБСОПоставщику()

Функция ТЗизТЧ_Типовая(Контекст)

	Если ЗначениеЗаполнено(Контекст.МассивОбъектов) Тогда 
		Массив = Контекст.МассивОбъектов;
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(Контекст.Объект);
	КонецЕсли;
	
	//Подготовка таблицы значений для вывода	
	Попытка
		БСО = Массив[0].БСО
	Исключение
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найдена ТЧ БСО у документа: " + ?(Объект = Неопределено, "Неопределено", Объект.Метаданные()));
		Возврат Неопределено;
	КонецПопытки;
	ТЗБСО = БСО.Выгрузить(); 
	ТЗБСО.Колонки.Добавить("НомерПолиса");
	ТЗБСО.Колонки.Добавить("ТекСостояниеБСО");
	ТЗБСО.Колонки.Добавить("ТекПоложениеБСО");
	ТЗБСО.Колонки.Добавить("Страхователь");
	ТЗБСО.Колонки.Добавить("РасшСтрахователь");
	ТЗБСО.Колонки.Добавить("ДатаОформленияПолиса");
	ТЗБСО.Колонки.Добавить("Документ");
	ТЗБСО.Очистить();
	пСст = Перечисления.уб_СостоянияБСО;
	
	Для Каждого СтрокаМассива ИЗ Массив Цикл 
		мТЗБСО = СтрокаМассива.БСО.Выгрузить(); 
		мТЗБСО.Колонки.Добавить("НомерПолиса");
		мТЗБСО.Колонки.Добавить("ТекСостояниеБСО");
		мТЗБСО.Колонки.Добавить("ТекПоложениеБСО");
		мТЗБСО.Колонки.Добавить("Страхователь");
		мТЗБСО.Колонки.Добавить("РасшСтрахователь");
		мТЗБСО.Колонки.Добавить("ДатаОформленияПолиса");
		мТЗБСО.Колонки.Добавить("Документ");
		КоличествоСтрок	= мТЗБСО.Количество();
		Для Сч = 1 По КоличествоСтрок Цикл
			СтрокаТЧ = мТЗБСО[КоличествоСтрок - Сч];
			УдалятьСтроку = НЕ( ?(ЗначениеНеЗаполнено(Контекст.СтруктураОбъектаПФ.Поставщик), Истина, СтрокаТЧ.Поставщик = Контекст.СтруктураОбъектаПФ.Поставщик) И 
			?(ЗначениеНеЗаполнено(Контекст.СтруктураОбъектаПФ.ОрганизацияАгент), Истина, СтрокаТЧ.ОрганизацияАгент = Контекст.СтруктураОбъектаПФ.ОрганизацияАгент) );
			Если УдалятьСтроку Тогда
				мТЗБСО.Удалить(мТЗБСО.Индекс(СтрокаТЧ));
			КонецЕсли; 		
		КонецЦикла;	
		Для Каждого СтрокаТЧ из мТЗБСО Цикл
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ТекСтрока",СтрокаТЧ);
			СтруктураПараметров.Вставить("НаДату",СтрокаМассива.Дата);
			СтруктураПараметров.Вставить("хВидГраницы",?(СтрокаМассива.Проведен,ВидГраницы.Включая,ВидГраницы.Исключая));
			СтруктураБСО = уб_СС.ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ(СтруктураПараметров);
			//  СтрокаТЧ
			//, Неопределено
			//, Объект.Дата
			//, Неопределено
			//, Неопределено
			//, Неопределено
			//, ?(Объект.Проведен,ВидГраницы.Включая,ВидГраницы.Исключая)
			СтрокаТЧ.НомерПолиса 		= "";
			СтрокаТЧ.ТекСостояниеБСО	= "";
			СтрокаТЧ.ТекПоложениеБСО	= "";
			СтрокаТЧ.Страхователь 		= "";
			СтрокаТЧ.РасшСтрахователь 	= Неопределено;
			СтрокаТЧ.Документ           = СтрокаМассива.Ссылка;
			Если СтруктураБСО.КоличественныйУчет Тогда
				СтрокаТЧ.НомерБСО		= СокрЛП(Строка(СтрокаТЧ.Количество))+"шт.";
			Иначе
				СостояниеБСО = СтруктураБСО.СостояниеБСО;
				СтрокаТЧ.ТекСостояниеБСО = СостояниеБСО;
				СтрокаТЧ.ТекПоложениеБСО = СтруктураБСО.ПоложениеБСО;
				Если СтруктураБСО.НомернойУчет и СтруктураБСО.Существует Тогда
					//Номер полиса выводим 
					//- для бланков БСО пролисов - всегда
					//- для остальных бланков, если они в состоянии оформлен (и тогда к ним есть номер сопутствующего полиса)
					оСП = СтруктураБСО.СтраховойПолис;
					Если уб_СЛ.ОпределитьЭтоПолис(СтрокаТЧ.ВидБСО) ИЛИ  СостояниеБСО = пСст.Оформлен Тогда
						СтрокаТЧ.НомерПолиса = СокрЛП(СтруктураБСО.НомерПолиса);
					КонецЕсли;
					Если НЕ ЗначениеНеЗаполнено(оСП) И СостояниеБСО = пСст.Оформлен Тогда
						СтрокаТЧ.Страхователь			= Строка(оСП.Страхователь);
						СтрокаТЧ.РасшСтрахователь		= оСП;
						СтрокаТЧ.ДатаОформленияПолиса	= оСП.Дата;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого мСтрока Из мТЗБСО Цикл 
			Строка = ТЗБСО.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, мСтрока);
		КонецЦикла;
		
	КонецЦикла;

	ТЗБСО.Сортировать("СК,ВидБСО,НомерБСО");
	Возврат ТЗБСО;

КонецФункции // ТзизТЧ_Типовая()

Функция ТЗизТЧ_ПоступлениеБСО(Контекст) Экспорт
	
	Объект 	= Контекст.Объект;
	Ссылка 	= Объект.Ссылка;
	БСО		= Объект.БСО;
	//Подготовка таблицы значений для вывода
	ТЗБСО = Новый ТаблицаЗначений;
	ТЗБСО.Колонки.Добавить("СК");
	ТЗБСО.Колонки.Добавить("ВидБСО");
	ТЗБСО.Колонки.Добавить("НомерБСО");
	ТЗБСО.Колонки.Добавить("Количество");
	ТЗБСО.Колонки.Добавить("НомерПолиса");
	ТЗБСО.Колонки.Добавить("ГодПолиса");
	Для Каждого СтрокаТЧ Из БСО Цикл
		Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО) 
			И НЕ ЗначениеНеЗаполнено(СокрЛП(СтрокаТЧ.НачНомерБСО)) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО НОМЕРНОГО УЧЕТА
			сНачНомерБСО = СтрокаТЧ.НачНомерБСО;
			сКонНомерБСО = СтрокаТЧ.КонНомерБСО;
			сНачНомерСП = СтрокаТЧ.НачНомерПолиса;
			сКонНомерСП = СтрокаТЧ.КонНомерПолиса;
			КолличествоБСО = СтрокаТЧ.КоличествоБСО;
			КолличествоСП = СтрокаТЧ.КоличествоПолисов;
			чНомерБСО = Число2(сНачНомерБСО);
			чНомерСП = Число2(сНачНомерСП);
			МаксДлинаНомераБСО  = Макс(СтрДлина(сНачНомерБСО),СтрДлина(сКонНомерБСО));
			МаксДлинаНомераСП  = Макс(СтрДлина(сНачНомерСП),СтрДлина(сКонНомерСП));
			Если КолличествоСП > 1 И Число2(сНачНомерСП) > Число2(сКонНомерСП) Тогда
				Дельта = -1; //Обратная нумерация полисов
			Иначе	 
				Дельта = 1; //Прямая нумерация полисов
			КонецЕсли;
			Для N=0 По КолличествоБСО - 1 Цикл
				сНомерБСО = Формат(чНомерБСО,"ЧГ=");
				сНомерСП = Формат(чНомерСП,"ЧГ=");
				уб_СтраховойБрокер.ДобавитьНулиСлева(сНомерБСО, МаксДлинаНомераБСО);
				уб_СтраховойБрокер.ДобавитьНулиСлева(сНомерСП, МаксДлинаНомераСП);
				СерияБСО = СокрЛП(СтрокаТЧ.СерияБСО);
				СерияСП = СокрЛП(СтрокаТЧ.СерияПолиса);
				СуффиксСП = СокрЛП(СтрокаТЧ.СуффиксПолиса);
				ПолныйНомерБСО = СерияБСО + сНомерБСО;
				СтрБСОклон = ТЗБСО.Добавить();
				СтрБСОклон.СК 					= СтрокаТЧ.СК;
				СтрБСОклон.ВидБСО				= СтрокаТЧ.ВидБСО;
				СтрБСОклон.НомерБСО 			= ПолныйНомерБСО;
				СтрБСОклон.Количество			= 1;
				Если КолличествоСП > 0 Тогда
					СтрБСОклон.НомерПолиса		= СерияСП + сНомерСП + СуффиксСП;
					СтрБСОклон.ГодПолиса		= СтрокаТЧ.ГодПолиса;
				КонецЕсли;
				чНомерБСО = чНомерБСО + 1;
				чНомерСП = чНомерСП + Дельта;
			КонецЦикла;
		ИначеЕсли Ссылка.Проведен И уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО КОЛИЧЕСТВЕННОГО УЧЕТА
			//  увеличиваем количество, куда перемещается
			СтрБСОклон = ТЗБСО.Добавить();
			СтрБСОклон.СК 			= СтрокаТЧ.СК;
			СтрБСОклон.ВидБСО		= СтрокаТЧ.ВидБСО;
			СтрБСОклон.Количество	= СтрокаТЧ.КоличествоБСО;
		КонецЕсли;
	КонецЦикла;
	Возврат ТЗБСО;
	
КонецФункции

Функция ТЗизТЧ_УведомлениеОДосрочномПрекращенииДействияДоговора(Контекст)

	Объект = Контекст.Объект;
	Ссылка = Объект.Ссылка;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УДП.Менеджер КАК Менеджер,
	|	УДП.Причина КАК Причина,
	|	УДП.ПричинаДляСК,
	|	УДП.УведомленУстно КАК УведомленУстно,
	|	УДП.УведомленEmail КАК УведомленEmail,
	|	УДП.СозданНаОсновании.СтраховойПродукт КАК СтраховойПродукт,
	|	УДП.СозданНаОсновании.ОрганизацияАгент КАК ОрганизацияАгент,
	|	УДП.СозданНаОсновании.ОбъектСтрахования,
	|	УДП.СозданНаОсновании.СК КАК СК,
	|	УДП.СозданНаОсновании.РассрочкаПлатежа КАК Рассрочка,
	|	УДП.СозданНаОсновании.Страхователь КАК Страхователь,
	|	УДП.СозданНаОсновании.Номер КАК Номер,
	|	УДП.СозданНаОсновании.Платежи.(
	|		Ссылка,
	|		НомерСтроки,
	|		Дата КАК Дата,
	|		Сумма КАК Сумма
	|	) КАК Платежи,
	|	УДП.СозданНаОсновании.ДатаНачала КАК ДатаНачалаДействия,
	|	УДП.СозданНаОсновании КАК СтраховойПолис,
	|	УДП.СозданНаОсновании.СтраховаяПремия КАК СтраховаяПремия,
	|	УДП.Дата КАК Дата,
	|	0 КАК ДатаОчередногоПлатежа,
	|	1 КАК НомерВзноса,
	|	0 КАК СуммаОчередногоПлатежа
	|ИЗ
	|	Документ.уб_УведомлениеОДосрочномПрекращенииДействияДоговора КАК УДП
	|ГДЕ
	|	УДП.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДатаОчередногоПлатежа  = "";
		СуммаОчередногоПлатежа = 0;
		ТзОплат = уб_СС.ОП_ПолучитьТзОплат(Выборка.СтраховойПолис);
		лАктуальныйПериод= Выборка.Дата;
		Если ТзОплат.Количество() = 0 Тогда
			НомерВзноса_ =  1;
		Иначе
			НомерВзноса_ = 0;
			Для Каждого оОплата из ТзОплат Цикл
				НомерВзноса_ = НомерВзноса_ + 1;
				Если лАктуальныйПериод < оОплата.Дата Тогда
					НомерВзноса_ = НомерВзноса_ - 1;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ИтогоОплачено = ТзОплат.Итог("НачисленнаяСуммаВзноса");		
		ОсталосьОплатить = Выборка.СтраховаяПремия-ИтогоОплачено;
		ВыборкаПлатежей = Выборка.Платежи.Выбрать();
		ТаблицаПлатежей = Новый ТаблицаЗначений;
		ТаблицаПлатежей.Колонки.Добавить("Дата");
		ТаблицаПлатежей.Колонки.Добавить("Сумма");
		Пока ВыборкаПлатежей.Следующий() Цикл
			СтрокаПлатежа      = ТаблицаПлатежей.Добавить();
			СтрокаПлатежа.Дата = ВыборкаПлатежей.Дата;
			СтрокаПлатежа.Сумма = ВыборкаПлатежей.Сумма;
		КонецЦикла;	
		СтрокаТЗ = ТЗ[0];
		ТаблицаПлатежей.Сортировать("Дата");
		ИтогоПлатежей = ТаблицаПлатежей.Итог("Сумма");
		Если ИтогоПлатежей <= 0 Тогда
			СуммаОчередногоПлатежа = ОсталосьОплатить;
			ДатаОчередногоПлатежа  = "";
		ИначеЕсли ИтогоПлатежей = ИтогоОплачено Тогда
			СуммаОчередногоПлатежа = ОсталосьОплатить;
			ДатаОчередногоПлатежа  = "";
		ИначеЕсли ИтогоПлатежей > ИтогоОплачено Тогда
			РаспределеноОплат = 0;
			НомерСтроки = 0;
			ДатаОчередногоПлатежа  = "";
			Для каждого СтрокаПлатежа из ТаблицаПлатежей Цикл
				НомерСтроки = НомерСтроки + 1;
				РаспределеноОплат = РаспределеноОплат + СтрокаПлатежа.Сумма;
				Если РаспределеноОплат > ИтогоОплачено Тогда
					СуммаОчередногоПлатежа = РаспределеноОплат - ИтогоОплачено;
					ДатаОчередногоПлатежа  = СтрокаПлатежа.Дата;
					НомерВзноса_ = НомерСтроки;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		СтрокаТЗ.НомерВзноса = НомерВзноса_;
		СтрокаТЗ.ДатаОчередногоПлатежа = ДатаОчередногоПлатежа;
		СтрокаТЗ.СуммаОчередногоПлатежа = СуммаОчередногоПлатежа;
	КонецЦикла;
	Возврат ТЗ;

КонецФункции // ТЗизТЧ_УведомлениеОДосрочномПрекращенииДействияДоговора()

Функция ТЗизТЧ_ТабельУчетаРабочегоВремени(Контекст)

	Объект = Контекст.Объект;
	Ссылка = Объект.Ссылка;
	ЭтоДокумент = ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_ТабельУчетаРабочегоВремени");
	Если ЭтоДокумент Тогда
		ВсегоДней = День(КонецМесяца(Ссылка.РасчетныйПериод));
		ТаблицаЗанятости = Ссылка.Занятость.Выгрузить();
	Иначе
		ВсегоДней = День(КонецМесяца(Ссылка));
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Табель.Ссылка,
		|	Табель.НомерСтроки,
		|	Табель.Сотрудник,
		|	Табель.Подразделение,
		|	Табель.НомерДня,
		|	Табель.ВидЗанятости,
		|	Табель.Часов
		|ИЗ
		|	Документ.уб_ТабельУчетаРабочегоВремени.Занятость КАК Табель
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Табель.Ссылка.Дата, МЕСЯЦ) = &РасчетныйПериод");
		Запрос.УстановитьПараметр("РасчетныйПериод",НачалоМесяца(Ссылка));					  
		ТаблицаЗанятости = Запрос.Выполнить().Выгрузить();
	Конецесли;	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник");
	ТЗ.Колонки.Добавить("Подразделение");
	Для Счетчик = 1 по ВсегоДней Цикл
		ТЗ.Колонки.Добавить("День"+Счетчик);
	КонецЦикла;	
	ТЗ.Колонки.Добавить("ВсегоДней");
	ТЗ.Колонки.Добавить("ВсегоЧасов");
	ТекСтрока = Неопределено;
	Для каждого Строка Из ТаблицаЗанятости Цикл
		ТекСтрока = Документы.уб_ТабельУчетаРабочегоВремени.ПолучитьСтрокуСотрудника(ТЗ,Строка,ТекСтрока);
		ТекСтрока["День"+Строка.НомерДня]=""+Строка.ВидЗанятости+?(Строка.Часов=0,"",""+Строка.Часов);
	КонецЦикла;		
	Для каждого СтрокаТабеля из ТЗ Цикл
		Документы.уб_ТабельУчетаРабочегоВремени.ОбновитьДниЧасыПоСтроке(СтрокаТабеля,Документы.уб_ТабельУчетаРабочегоВремени.ПустаяСсылка(),ВсегоДней);
	КонецЦикла;	
    Возврат ТЗ;

КонецФункции // ТЗизТЧ_ТабельУчетаРабочегоВремени()

Функция Число2(Стр)
	
	Возврат Число(?(Стр="","0",Стр));
	
КонецФункции

//генерируем имя файла сохраняемой ПФ
Функция ИмяФайлаПФ(Контекст) Экспорт

	Если ТипЗнч(Контекст.Объект.Ссылка) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		ИмяФайла = "Отчет";
	ИначеЕсли ТипЗнч(Контекст.Объект.Ссылка) = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
		ИмяФайла = "Акт п-п";
	Иначе
		ИмяФайла = Контекст.Объект.Метаданные().Синоним; 
	КонецЕсли;
	ИмяФайла = ИмяФайла + " №" + Дай_ТиповойНомер(Контекст.Объект) + " " + Контекст.ИмяМакета;
	ИмяФайла = уб_temp.УбратьСимволы(ИмяФайла, "-");
	Возврат ИмяФайла;

КонецФункции // ИмяФайлаПФ()

//возвращает пустую ТЗ, используюмую в ПолучитьСтруктуруПечатныхФорм()
Функция ПустаяТЗСтруктурыПФ() Экспорт

	//Возврат уб_Кэшируемые.ТабПФ();
	ТабПФ = Новый ТаблицаЗначений;
	ТабПФ.Колонки.Добавить("КодПФ");
	ТабПФ.Колонки.Добавить("Наименование");
	ТабПФ.Колонки.Добавить("СсылкаПФ");
	ТабПФ.Колонки.Добавить("ДобавлятьВМенюПечати");
	ТабПФ.Колонки.Добавить("Статус");
	ТабПФ.Колонки.Добавить("Действовала");
	ТабПФ.Колонки.Добавить("ПоУмолчанию");
	Возврат ТабПФ;

КонецФункции // ПустаяТЗСтруктурыПФ()

Функция ПолучитьСтруктуруОбъектаПФИзСсылки(СсылкаПФ) Экспорт
	
	СтруктураОбъектаПФ = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.уб_ПечатныеФормы КАК уб_ПечатныеФормы
	|ГДЕ
	|	уб_ПечатныеФормы.Ссылка = &СсылкаПФ";
	Запрос.УстановитьПараметр("СсылкаПФ",СсылкаПФ);
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	мКолво = ТЗ.Количество() = 0;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если мКолво тогда
			Значение = Неопределено;
		Иначе
			Значение = ТЗ[0][Колонка.Имя];
		КонецЕсли;
		СтруктураОбъектаПФ.Вставить(Колонка.Имя, Значение);
	КонецЦикла;
	
	Возврат СтруктураОбъектаПФ;
	
КонецФункции	

Процедура ПечатьЗаявкаНаПечать_(Объект) Экспорт

	Перем ТЗ;
	
	ЭтоПустойБланкОСАГО = Объект.Макет.Наименование = "ОСАГО пустое";
	ТекущаяДата = ТекущаяДата();
	Объект.ПодготовитьДанные(0, ТЗ);
	Данные = Новый Структура;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Данные.Вставить(СтрокаТЗ.Параметр, СтрокаТЗ.Значение);
	КонецЦикла;
	Данные.Вставить("СК", ДайНаименованиеКонтрагента(Объект.Шаблон.СтраховойПродукт.Владелец, Объект.Дата, Истина));
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТС.РегистрационныйЗнак КАК ОбъектСтрахованияРегистрационныйЗнак,
	|	ТС.ИдентификационныйНомер КАК ОбъектСтрахованияИдентификационныйНомер,
	|	ТС.МаркаТС КАК ОбъектСтрахованияМаркаТС,
	|	ТС.МодельТС КАК ОбъектСтрахованияМодельТС,
	|	ТС.ТипТС КАК ОбъектСтрахованияТипТС,
	|	ТС.Категория КАК ОбъектСтрахованияКатегория,
	|	ТС.ГодВыпуска КАК ОбъектСтрахованияГодВыпуска,
	|	ТС.ДвигательНомер КАК ОбъектСтрахованияДвигательНомер,
	|	ТС.ШассиНомер КАК ОбъектСтрахованияШассиНомер,
	|	ТС.КузовНомер КАК ОбъектСтрахованияКузовНомер,
	|	ТС.Цвет КАК ОбъектСтрахованияЦвет,
	|	ТС.МощностьДвигателя КАК ОбъектСтрахованияМощностьДвигателя,
	|	ТС.МаксМасса КАК ОбъектСтрахованияМаксМасса,
	|	ТС.КолПассажирскихМест КАК ОбъектСтрахованияКолПассажирскихМест,
	|	ТС.Грузоподъемность КАК ОбъектСтрахованияГрузоподъемность,
	|	ТС.ПротивоугоннаяСистема КАК ОбъектСтрахованияПротивоугоннаяСистема,
	|	ТС.ПаспортСерия КАК ОбъектСтрахованияПаспортСерия,
	|	ТС.ПаспортНомер КАК ОбъектСтрахованияПаспортНомер,
	|	ТС.ПаспортДатаВыдачи КАК ОбъектСтрахованияПаспортДатаВыдачи
	|ИЗ
	|	РегистрСведений.уб_ТранспортныеСредства КАК ТС
	|ГДЕ
	|	ТС.Объект = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Данные.ОбъектСтрахования);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные.Вставить("ОбъектСтрахованияРегистрационныйЗнак",     Выборка.ОбъектСтрахованияРегистрационныйЗнак);
		Данные.Вставить("ОбъектСтрахованияИдентификационныйНомер",  Выборка.ОбъектСтрахованияИдентификационныйНомер);
		Данные.Вставить("ОбъектСтрахованияМаркаТС",     			Выборка.ОбъектСтрахованияМаркаТС);
		Данные.Вставить("ОбъектСтрахованияМодельТС",     			Выборка.ОбъектСтрахованияМодельТС);
		Данные.Вставить("ОбъектСтрахованияТипТС",     				Выборка.ОбъектСтрахованияТипТС);
		Данные.Вставить("ОбъектСтрахованияКатегория",     			Выборка.ОбъектСтрахованияКатегория);
		Данные.Вставить("ОбъектСтрахованияГодВыпуска",     			Выборка.ОбъектСтрахованияГодВыпуска);
		Данные.Вставить("ОбъектСтрахованияДвигательНомер",    		Выборка.ОбъектСтрахованияДвигательНомер);
		Данные.Вставить("ОбъектСтрахованияШассиНомер",     			?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияШассиНомер), 				Выборка.ОбъектСтрахованияШассиНомер,			"------"));
		Данные.Вставить("ОбъектСтрахованияКузовНомер",     			?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияКузовНомер),				Выборка.ОбъектСтрахованияКузовНомер,			"------"));
		Данные.Вставить("ОбъектСтрахованияЦвет",     				?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияЦвет),						Выборка.ОбъектСтрахованияЦвет,					"------"));
		Данные.Вставить("ОбъектСтрахованияМощностьДвигателя",     	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияМощностьДвигателя), 		Выборка.ОбъектСтрахованияМощностьДвигателя, 	"------"));
		Данные.Вставить("ОбъектСтрахованияМаксМасса",     			?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияМаксМасса), 				Выборка.ОбъектСтрахованияМаксМасса,				"------"));
		Данные.Вставить("ОбъектСтрахованияКолПассажирскихМест",     ?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияКолПассажирскихМест),		Выборка.ОбъектСтрахованияКолПассажирскихМест,	"------"));
		Данные.Вставить("ОбъектСтрахованияГрузоподъемность",     	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияГрузоподъемность),			Выборка.ОбъектСтрахованияГрузоподъемность,		"------"));
		Данные.Вставить("ОбъектСтрахованияПротивоугоннаяСистема",   ?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПротивоугоннаяСистема),	Выборка.ОбъектСтрахованияПротивоугоннаяСистема, "------"));
		Данные.Вставить("ОбъектСтрахованияПаспортСерия",    	 	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПаспортСерия),				Выборка.ОбъектСтрахованияПаспортСерия,			"------"));
		Данные.Вставить("ОбъектСтрахованияПаспортНомер",     		?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПаспортНомер),				Выборка.ОбъектСтрахованияПаспортНомер,			"------"));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачи",     	Выборка.ОбъектСтрахованияПаспортДатаВыдачи);
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиДень",	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПаспортДатаВыдачи), 	Формат(Данные.ОбъектСтрахованияПаспортДатаВыдачи, "ДФ=dd"), "---"));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиМесяц",	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПаспортДатаВыдачи),	ФункцииРасширения.ПадежП(Формат(Данные.ОбъектСтрахованияПаспортДатаВыдачи, "ДФ=ММММ"), 2), "-----"));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиГод",	?(ЗначениеЗаполнено(Выборка.ОбъектСтрахованияПаспортДатаВыдачи), 	Формат(Данные.ОбъектСтрахованияПаспортДатаВыдачи, "ДФ=yyyy"), "----"));
		Данные.Вставить("ОбъектСтрахованияПредставление",			Строка(Данные.ОбъектСтрахованияМаркаТС) + " " + Данные.ОбъектСтрахованияМодельТС);
	КонецЕсли;
	ДопТекст = "Страхователь";
	Данные[ДопТекст + "ДатаРождения"] = Формат(Данные[ДопТекст + "ДатаРождения"], "ДФ=dd.MM.yyyy");
	ДанныеФизЛица = ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), Данные[ДопТекст + "ПодменаСсылки"], ТекущаяДата(), Ложь);
	Данные.Вставить(ДопТекст + "ФИО", 			ДанныеФизЛица.Представление);
	Данные.Вставить(ДопТекст + "СерияПаспорта",	ДанныеФизЛица.ДокументСерия);
	Данные.Вставить(ДопТекст + "НомерПаспорта", ДанныеФизЛица.ДокументНомер);
	Структура = РегистрыСведений.КонтактнаяИнформация.ПолучитьДанныеАдреса(Данные[ДопТекст + "ПодменаСсылки"], Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания);
	Данные.Вставить(ДопТекст + "РегионФакт", 			Структура.Регион);
	Данные.Вставить(ДопТекст + "РайонФакт", 			Структура.Район);
	Данные.Вставить(ДопТекст + "ГородФакт", 			Структура.Город);
	Данные.Вставить(ДопТекст + "НаселенныйПунктФакт", 	Структура.НаселенныйПункт);
	Данные.Вставить(ДопТекст + "УлицаФакт", 			Структура.Улица);
	Данные.Вставить(ДопТекст + "ДомФакт", 				Структура.Дом);
	Данные.Вставить(ДопТекст + "КорпусФакт", 			Структура.Корпус);
	Данные.Вставить(ДопТекст + "КвартираФакт", 			Структура.Квартира);
	Структура = Новый Структура;
	Структура.Вставить("Поле1", "");
	Структура.Вставить("Поле2", Данные[ДопТекст + "РегионФакт"]);
	Структура.Вставить("Поле3", Данные[ДопТекст + "РайонФакт"]);
	Структура.Вставить("Поле4", Данные[ДопТекст + "ГородФакт"]);
	Структура.Вставить("Поле5", Данные[ДопТекст + "НаселенныйПунктФакт"]);
	Структура.Вставить("Поле6", Данные[ДопТекст + "УлицаФакт"]);
	Структура.Вставить("Поле7", Данные[ДопТекст + "ДомФакт"]);
	Структура.Вставить("Поле8", Данные[ДопТекст + "КорпусФакт"]);
	Структура.Вставить("Поле9", Данные[ДопТекст + "КвартираФакт"]);
	Представление = УправлениеКонтактнойИнформацией.СформироватьПредставлениеАдресаЗаПределамиРФ(Данные[ДопТекст + "СтранаФакт"], УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Структура));
	Данные.Вставить(ДопТекст + "КонтактнаяИнформацияПредставление", Представление);
	//
	ДопТекст = "Собственник";
	Данные[ДопТекст + "ДатаРождения"] = Формат(Данные[ДопТекст + "ДатаРождения"], "ДФ=dd.MM.yyyy");
	ДанныеФизЛица = ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), Данные[ДопТекст + "ПодменаСсылки"], ТекущаяДата(), Ложь);
	Данные.Вставить(ДопТекст + "ФИО", 			ДанныеФизЛица.Представление);
	Данные.Вставить(ДопТекст + "СерияПаспорта",	ДанныеФизЛица.ДокументСерия);
	Данные.Вставить(ДопТекст + "НомерПаспорта", ДанныеФизЛица.ДокументНомер);
	Структура = РегистрыСведений.КонтактнаяИнформация.ПолучитьДанныеАдреса(Данные[ДопТекст + "ПодменаСсылки"], Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания);
	Данные.Вставить(ДопТекст + "РегионФакт", 			Структура.Регион);
	Данные.Вставить(ДопТекст + "РайонФакт", 			Структура.Район);
	Данные.Вставить(ДопТекст + "ГородФакт", 			Структура.Город);
	Данные.Вставить(ДопТекст + "НаселенныйПунктФакт", 	Структура.НаселенныйПункт);
	Данные.Вставить(ДопТекст + "УлицаФакт", 			Структура.Улица);
	Данные.Вставить(ДопТекст + "ДомФакт", 				Структура.Дом);
	Данные.Вставить(ДопТекст + "КорпусФакт", 			Структура.Корпус);
	Данные.Вставить(ДопТекст + "КвартираФакт", 			Структура.Квартира);
	Структура = Новый Структура;
	Структура.Вставить("Поле1", "");
	Структура.Вставить("Поле2", Данные[ДопТекст + "РегионФакт"]);
	Структура.Вставить("Поле3", Данные[ДопТекст + "РайонФакт"]);
	Структура.Вставить("Поле4", Данные[ДопТекст + "ГородФакт"]);
	Структура.Вставить("Поле5", Данные[ДопТекст + "НаселенныйПунктФакт"]);
	Структура.Вставить("Поле6", Данные[ДопТекст + "УлицаФакт"]);
	Структура.Вставить("Поле7", Данные[ДопТекст + "ДомФакт"]);
	Структура.Вставить("Поле8", Данные[ДопТекст + "КорпусФакт"]);
	Структура.Вставить("Поле9", Данные[ДопТекст + "КвартираФакт"]);
	Представление = УправлениеКонтактнойИнформацией.СформироватьПредставлениеАдресаЗаПределамиРФ(Данные[ДопТекст + "СтранаФакт"], УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Структура));
	Данные.Вставить(ДопТекст + "КонтактнаяИнформацияПредставление", Представление);
	//
	//Структура = Новый Структура;
	//Структура.Вставить("Поле1", "");
	//Структура.Вставить("Поле2", Данные.СобственникРегионФакт);
	//Структура.Вставить("Поле3", Данные.СобственникРайонФакт);
	//Структура.Вставить("Поле4", Данные.СобственникГородФакт);
	//Структура.Вставить("Поле5", Данные.СобственникНаселенныйПунктФакт);
	//Структура.Вставить("Поле6", Данные.СобственникУлицаФакт);
	//Структура.Вставить("Поле7", Данные.СобственникДомФакт);
	//Структура.Вставить("Поле8", Данные.СобственникКорпусФакт);
	//Структура.Вставить("Поле9", Данные.СобственникКвартираФакт);
	//Представление = УправлениеКонтактнойИнформацией.СформироватьПредставлениеАдресаЗаПределамиРФ(Данные.СобственникСтранаФакт, УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Структура));
	Данные.Вставить("СобственникКонтактнаяИнформацияПредставление", Представление);
	Данные.Вставить("НачалоДействияДата", 		Формат(Данные.НачалоДействия, "ДФ=dd"));
	Данные.Вставить("НачалоДействияМесяц",		ФункцииРасширения.ПадежП(Формат(Данные.НачалоДействия, "ДФ=MMMM"), 2));
	Данные.Вставить("НачалоДействияГод",		Формат(Данные.НачалоДействия, "ДФ=yyyy"));
	Данные.Вставить("ОкончаниеДействияДата", 	Формат(Данные.ОкончаниеДействия, "ДФ=dd"));
	Данные.Вставить("ОкончаниеДействияМесяц",	ФункцииРасширения.ПадежП(Формат(Данные.ОкончаниеДействия, "ДФ=MMMM"), 2));
	Данные.Вставить("ОкончаниеДействияГод",		Формат(Данные.ОкончаниеДействия, "ДФ=yyyy"));
	Данные.Вставить("СерияПолиса",				СокрЛП(СтрЗаменить(Данные.НомерПолиса, Данные.НомерПолисаБезСерии, "")));
	Для Счетчик = 1 По 5 Цикл
		//Данные.Вставить("Водитель" + Счетчик + "ФИО", ?(ПустаяСтрока(Данные["Водитель" + Счетчик + "Фамилия"]), "", СокрЛП(Данные["Водитель" + Счетчик + "Фамилия"]) + " ") + ?(ПустаяСтрока(Данные["Водитель" + Счетчик + "Имя"]), "", СокрЛП(Данные["Водитель" + Счетчик + "Имя"]) + " ") + ?(ПустаяСтрока(Данные["Водитель" + Счетчик + "Отчество"]), "", СокрЛП(Данные["Водитель" + Счетчик + "Отчество"])));
		Данные.Вставить("Водитель" + Счетчик + "ФИО", ?(ПустаяСтрока(Данные["Водитель" + Счетчик + "Фамилия"]), "", СокрЛП(Данные["Водитель" + Счетчик + "Фамилия"]) + " ") + ?(ПустаяСтрока(Данные["Водитель" + Счетчик + "Имя"]), "", СокрЛП(Данные["Водитель" + Счетчик + "Имя"])));
		Если Не ЗначениеЗаполнено(Данные["Водитель" + Счетчик + "ФИО"]) Тогда
			Данные["Водитель" + Счетчик + "ФИО"] = "-----------------------------------------------";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные["Водитель" + Счетчик + "ДатаРождения"]) Тогда
			Данные["Водитель" + Счетчик + "ДатаРождения"] = "-------------------";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные["Водитель" + Счетчик + "НомерВодительскогоУдостоверения"]) Тогда
			Данные["Водитель" + Счетчик + "НомерВодительскогоУдостоверения"] = "----------------------------";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные["Водитель" + Счетчик + "Стаж"]) Тогда
			Данные["Водитель" + Счетчик + "Стаж"] = "---------------------";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные["Водитель" + Счетчик + "Пол"]) Тогда
			Данные["Водитель" + Счетчик + "Пол"] = "-------";
		КонецЕсли;
	КонецЦикла;
	Для Счетчик = 1 По 3 Цикл
		Данные["ПериодИспользования" + Счетчик + "Начало"] = Формат(Данные["ПериодИспользования" + Счетчик + "Начало"], "ДФ=dd.MM.yyyy");
		Если Не ЗначениеЗаполнено(Данные["ПериодИспользования" + Счетчик + "Начало"]) Тогда
			Данные["ПериодИспользования" + Счетчик + "Начало"] = "---------";
		КонецЕсли;
		Данные["ПериодИспользования" + Счетчик + "Окончание"] = Формат(Данные["ПериодИспользования" + Счетчик + "Окончание"], "ДФ=dd.MM.yyyy");
		Если Не ЗначениеЗаполнено(Данные["ПериодИспользования" + Счетчик + "Окончание"]) Тогда
			Данные["ПериодИспользования" + Счетчик + "Окончание"] = "---------";
		КонецЕсли;
	КонецЦикла;
	Данные.Вставить("ДатаЗаполненияЗаявления", 		ТекущаяДата);
	Данные.Вставить("ДатаЗаполненияЗаявленияДень",  Формат(Данные.ДатаЗаполненияЗаявления, "ДФ=dd"));
	Данные.Вставить("ДатаЗаполненияЗаявленияМесяц", ФункцииРасширения.ПадежП(Формат(Данные.ДатаЗаполненияЗаявления, "ДФ=MMMM"), 2));
	Данные.Вставить("ДатаЗаполненияЗаявленияГод",	Формат(Данные.ДатаЗаполненияЗаявления, "ДФ=yy"));
	Данные.Вставить("СтраховаяПремияСтрока",		ЧислоПрописью(Данные.СтраховаяПремия,, ОбщегоНазначения.ПолучитьВалютуРубли().ПараметрыПрописиНаРусском));
	// данные бланка ОСАГО
	СтрокаДата = Формат(Данные.НачалоДействия, "ДФ='ддММгг'");
	Для Счетчик = 1 По 6 Цикл
		Данные.Вставить("НачалоДействия" + Счетчик, Сред(СтрокаДата, Счетчик, 1));
	КонецЦикла;
	СтрокаДата = Формат(Данные.ОкончаниеДействия, "ДФ='ддММгг'");
	Для Счетчик = 1 По 6 Цикл
		Данные.Вставить("ОкончаниеДействия" + Счетчик, Сред(СтрокаДата, Счетчик, 1));
	КонецЦикла;
	Для Счетчик = 1 По 17 Цикл
		Данные.Вставить("ОбъектСтрахованияИдентификационныйНомер" + Счетчик, Сред(Данные.ОбъектСтрахованияИдентификационныйНомер, Счетчик, 1));
	КонецЦикла;
	//
	Макет = Объект.Макет.МакетШаблона.Получить();
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	Если ЭтоПустойБланкОСАГО Тогда
		ТабДок.ПолеСверху				= 5;
		ТабДок.ПолеСлева				= 5;
		ТабДок.ПолеСправа				= 5;
		ТабДок.ПолеСнизу 				= 0;
		ТабДок.РазмерКолонтитулаСнизу 	= 0;
	Иначе
		ТабДок.АвтоМасштаб = Истина;
	КонецЕсли;
	Для Каждого ОбластьМакета Из Макет.Области Цикл
		Если ТипЗнч(ОбластьМакета) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Область = Макет.ПолучитьОбласть(ОбластьМакета.Имя);
			ЗаполнитьЗначенияСвойств(Область.Параметры, Данные);
			Для Каждого Рисунок Из Область.Рисунки Цикл
				Если СтрокаДоступнаДляИменованияКлючаСтруктуры(Рисунок.Текст) И Данные.Свойство(Рисунок.Текст) Тогда
					Рисунок.Параметр = Данные[Рисунок.Текст]; // текст вместо имени для того чтобы убрать уникальность
				КонецЕсли;
			КонецЦикла;
			ТабДок.Вывести(Область);
		КонецЕсли;
	КонецЦикла;
	ТабДок.Показать();

КонецПроцедуры

Функция СтрокаДоступнаДляИменованияКлючаСтруктуры(Знач Строка, ВключаяСимволыUID = Ложь) Экспорт

	Если ПустаяСтрока(Строка) Тогда
		Возврат Ложь
	КонецЕсли;
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		// TODO 1ый символ не должен быть числом
		Символ = Сред(Строка, Индекс, 1);
		Если Не ДопустимыйСимволДляСтрок(Символ, ВключаяСимволыUID, Индекс = 1) Тогда
			Возврат Ложь
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции // УбратьНедопустимыеСимволыДляСтрок()

Функция ДопустимыйСимволДляСтрок(Символ, ВключаяСимволыUID = Ложь, НеВключатьЦифры = Ложь)

	Код = КодСимвола(Символ);
	Возврат (ВключаяСимволыUID И ((Код >= 32 И Код <= 64) Или (Код >= 123 И Код <= 126)))
		Или (Не НеВключатьЦифры И (Код >= 48 И Код <= 57)) 	// цифры
		Или (Код >= 65 		И Код <= 90) 	// заглавные английские
		Или (Код >= 97 		И Код <= 122) 	// строчные английские
		Или (Код >= 1040 	И Код <= 1103) 	// кириллица

КонецФункции // ДопустимыйСимволДляСтрок()

//Процедура ОсновныеДействияФормыПечать(Кнопка)
//	
//	МассивОшибок = Новый Массив;
//	Параметры = СтруктураДанных();
//	МакетПечати = Макет.МакетШаблона.Получить();
//	ТабДок = Новый ТабличныйДокумент;
//	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СтраховойПолис_Осаго";
//	Область = МакетПечати.ПолучитьОбласть("ДоВодителей");
//	// номер полиса
//	Структура = уб_temp.ПолучитьСериюИНомерПолиса(СокрЛП(Параметры.ID_Полиса));
//	Если ПустаяСтрока(Структура.СерияПолиса) Тогда
//		МассивОшибок.Добавить("Не найдена серия полиса " + СокрЛП(Параметры.ID_Полиса));
//	КонецЕсли;
//	Если ПустаяСтрока(Структура.НомерПолиса) Тогда
//		МассивОшибок.Добавить("Не найден номер полиса " + СокрЛП(Параметры.ID_Полиса));
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.НачалоДействия) Тогда
//		МассивОшибок.Добавить("Не заполнена дата начала действия полиса");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.ОкончаниеДействия) Тогда
//		МассивОшибок.Добавить("Не заполнена дата окончания действия полиса");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СтраховательИЛИФамилия) Тогда
//		МассивОшибок.Добавить("Не заполнена фамилия страхователя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СтраховательИмя) Тогда
//		МассивОшибок.Добавить("Не заполнено имя страхователя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СобственникИЛИФамилияИмяОтчество) Тогда
//		МассивОшибок.Добавить("Не заполнено ФИО собственника");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.VIN) Тогда
//		МассивОшибок.Добавить("Не заполнен VIN");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СтраховательСерияПаспорта) Тогда
//		МассивОшибок.Добавить("Не заполнена серия паспорта страхователя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СтраховательНомерПаспорта) Тогда
//		МассивОшибок.Добавить("Не заполнен номер паспорта страхователя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Марка) Тогда
//		МассивОшибок.Добавить("Не заполнена марка ТС");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Модель) Тогда
//		МассивОшибок.Добавить("Не заполнена модель ТС");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Госзнак) Тогда
//		МассивОшибок.Добавить("Не заполнен госзнак");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Водитель1Фамилия) Тогда
//		МассивОшибок.Добавить("Не заполнена фамилия водителя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Водитель1Имя) Тогда
//		МассивОшибок.Добавить("Не заполнено имя водителя");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.Водитель1НомерВодительскогоУдостоверения) Тогда
//		МассивОшибок.Добавить("Не заполнен номер водительского удостоверения");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.СтраховаяПремия) Тогда
//		МассивОшибок.Добавить("Не заполнена страховая премия");
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Параметры.ДатаВыдачиПолиса) Тогда
//		МассивОшибок.Добавить("Не заполнена дата выдачи полиса");
//	КонецЕсли;
//	Если МассивОшибок.Количество() = 0 Тогда
//		// TODO
//		//Область.Рисунки["СерияПолиса"].Параметр	= Структура.СерияПолиса;
//		//Область.Рисунки["НомерПолиса"].Параметр	= Структура.НомерПолиса;
//		СтрокаДатаНачала	= Формат(Параметры.НачалоДействия,		"ДФ='ддММгг'");
//		СтрокаДатаОкончания	= Формат(Параметры.ОкончаниеДействия,	"ДФ='ддММгг'");
//		Для Счетчик = 1 По 6 Цикл
//			Область.Рисунки["НачалоДействия" + Счетчик].Параметр	= Сред(СтрокаДатаНачала,	Счетчик, 1);
//			Область.Рисунки["ОкончаниеДействия" + Счетчик].Параметр	= Сред(СтрокаДатаОкончания,	Счетчик, 1);
//		КонецЦикла;
//		Область.Рисунки.одинчас.Параметр 		= 0;
//		Область.Рисунки.двачас.Параметр			= 0;
//		Область.Рисунки.однамин.Параметр 		= 0;
//		Область.Рисунки.двамин.Параметр 		= 0;
//		Область.Рисунки.Страхователь.Параметр   = Параметры.СтраховательИЛИФамилия + " " + Параметры.СтраховательИмя + " " + Параметры.СтраховательОтчество;
//		Область.Рисунки.Собственник.Параметр		= Параметры.СобственникИЛИФамилияИмяОтчество;
//		Для Счетчик = 1 По 17 Цикл
//			Область.Рисунки["и" + Счетчик].Параметр = Сред(Параметры.VIN, Счетчик, 1);
//		КонецЦикла;
//		Для Счетчик = 1 По 4 Цикл
//			Область.Рисунки["с" + Счетчик].Параметр	= Сред(Параметры.СтраховательСерияПаспорта, Счетчик, 1);
//		КонецЦикла;
//		Для Счетчик = 1 По 6 Цикл
//			Область.Рисунки["пн" + Счетчик].Параметр = Сред(Параметры.СтраховательНомеРПаспорта, Счетчик, 1);
//		КонецЦикла;
//		Область.Рисунки.ОбъектНаименование.Параметр	= СокрЛП(Строка(Параметры.Марка) + " " + Параметры.Модель);
//		Область.Рисунки.ОбъектГосРегЗнак.Параметр	= Параметры.ГосЗнак;
//		ТабДок.Вывести(Область);
//		КоличествоВодителей = 1;
//		МассивЗаполненностиВодителей = Новый Массив;
//		Если Не ПустаяСтрока(Параметры.Водитель2Фамилия) И Не ПустаяСтрока(Параметры.Водитель2Имя) И Не ПустаяСтрока(Параметры.Водитель2НомерВодительскогоУдостоверения) Тогда
//			КоличествоВодителей = КоличествоВодителей + 1;
//			Если Не ПустаяСтрока(Параметры.Водитель3Фамилия) И Не ПустаяСтрока(Параметры.Водитель3Имя) И Не ПустаяСтрока(Параметры.Водитель3НомерВодительскогоУдостоверения) Тогда
//				КоличествоВодителей = КоличествоВодителей + 1;
//				Если Не ПустаяСтрока(Параметры.Водитель4Фамилия) И Не ПустаяСтрока(Параметры.Водитель4Имя) И Не ПустаяСтрока(Параметры.Водитель4НомерВодительскогоУдостоверения) Тогда
//					КоличествоВодителей = КоличествоВодителей + 1;
//					Если Не ПустаяСтрока(Параметры.Водитель2Фамилия) И Не ПустаяСтрока(Параметры.Водитель2Имя) И Не ПустаяСтрока(Параметры.Водитель5НомерВодительскогоУдостоверения) Тогда
//						КоличествоВодителей = КоличествоВодителей + 1;
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		Область	= МакетПечати.ПолучитьОбласть("Водит" + КоличествоВодителей);
//		Для Счетчик = 1 По КоличествоВодителей Цикл
//			НомерРисунка = Строка(КоличествоВодителей) + Счетчик;
//			Область.Рисунки["н" + НомерРисунка].Параметр = Строка(Счетчик);
//			Область.Рисунки["ф" + НомерРисунка].Параметр = Параметры["Водитель" + Счетчик + "Фамилия"] + " " + Параметры["Водитель" + Счетчик + "Имя"];
//			Область.Рисунки["у" + НомерРисунка].Параметр = Параметры["Водитель" + Счетчик + "НомерВодительскогоУдостоверения"];
//		КонецЦикла;
//		ТабДок.Вывести(Область);
//		Область	= МакетПечати.ПолучитьОбласть("ПослеВодителей");
//		валРубли 			= ОбщегоНазначения.ПолучитьВалютуРубли();
//		фПремияРуб			= Параметры.СтраховаяПремия;
//		фПремияРубли 		= Цел(фПремияРуб);
//		фПремияКопейки 		= Прав(Формат(фПремияРуб, "ЧЦ=17; ЧДЦ=2"), 2);
//		печПремия 			= "Страховая премия: " + фПремияРубли + " рублей " + фПремияКопейки + " копеек.";
//		печОсобыеОтметки 	= "" + печПремия + " " + ЧислоПрописью(фПремияРуб,, валРубли.ПараметрыПрописиНаРусском);
//		Область.Рисунки.ОсобыеОтметки.Параметр = печОсобыеОтметки;
//		Для Счетчик = 1 По 6 Цикл
//			Область.Рисунки["в" + Счетчик].Параметр	= Сред(СтрокаДатаНачала,	Счетчик, 1);
//			Область.Рисунки["г" + Счетчик].Параметр	= Сред(СтрокаДатаОкончания,	Счетчик, 1);
//		КонецЦикла;
//		ДатаВыдачи = Параметры.ДатаВыдачиПолиса;
//		Если ЗначениеЗаполнено(ДатаВыдачи) Тогда
//			ДатаВыдачиДень1 = сред(""+ДатаВыдачи,1,1);
//			ДатаВыдачиДень2 = сред(""+ДатаВыдачи,2,1);
//			номерМесяца = месяц(ДатаВыдачи);
//			Если номерМесяца = 1 Тогда
//				ДатаВыдачиМесяц = "января";	
//			ИначеЕсли номерМесяца = 2 Тогда
//				ДатаВыдачиМесяц = "февраля";	
//			ИначеЕсли номерМесяца = 3 Тогда
//				ДатаВыдачиМесяц = "марта";
//			ИначеЕсли номерМесяца = 4 Тогда
//				ДатаВыдачиМесяц = "апреля";	
//			ИначеЕсли номерМесяца = 5 Тогда
//				ДатаВыдачиМесяц = "мая";	
//			ИначеЕсли номерМесяца = 6 Тогда
//				ДатаВыдачиМесяц = "июня";	
//			ИначеЕсли номерМесяца = 7 Тогда
//				ДатаВыдачиМесяц = "июля";	
//			ИначеЕсли номерМесяца = 8 Тогда
//				ДатаВыдачиМесяц = "августа";	
//			ИначеЕсли номерМесяца = 9 Тогда
//				ДатаВыдачиМесяц = "сентября";	
//			ИначеЕсли номерМесяца = 10 Тогда
//				ДатаВыдачиМесяц = "октября";	
//			ИначеЕсли номерМесяца = 11 Тогда
//				ДатаВыдачиМесяц = "ноября";	
//			ИначеЕсли номерМесяца = 12 Тогда
//				ДатаВыдачиМесяц = "декабря";	
//			КонецЕсли;	
//			ДатаВыдачиГод1  = сред(""+ДатаВыдачи,9,1);
//			ДатаВыдачиГод2  = сред(""+ДатаВыдачи,10,1);
//		Иначе
//			ДатаВыдачиДень1 = "";
//			ДатаВыдачиДень2 = "";
//			ДатаВыдачиМесяц = "";
//			ДатаВыдачиГод1  = "";
//			ДатаВыдачиГод2  = "";
//		КонецЕсли;
//		Область.Рисунки.ДатаВыдачиДень1.Параметр = ДатаВыдачиДень1;
//		Область.Рисунки.ДатаВыдачиДень2.Параметр = ДатаВыдачиДень2;
//		Область.Рисунки.ДатаВыдачиМесяц.Параметр = ДатаВыдачиМесяц;
//		Область.Рисунки.ДатаВыдачиГод1.Параметр = ДатаВыдачиГод1;
//		Область.Рисунки.ДатаВыдачиГод2.Параметр = ДатаВыдачиГод2;
//		ТабДок.Вывести(Область);
//		ТабДок.Показать();
//	Иначе
//		ОшибкиСтрока = уб_temp.МассивОшибокВСтроку(МассивОшибок, "Ошибки печати:");
//		Предупреждение(ОшибкиСтрока);
//	КонецЕсли;
//	
//КонецПроцедуры

Процедура ДобавитьДанныеЗаявкиНаПечать(Контекст)

	Перем СтруктураДанных;
	
	Контекст.Объект.ПодготовитьДанные(,, СтруктураДанных, Контекст.СтруктураОбъектаПФ.Наименование);
	Контекст.Вставить("ДанныеЗаявки", СтруктураДанных);
	Структура = Новый Структура;
	Структура.Вставить("Общий", 								8);
	Структура.Вставить("Водитель1Пол",  						4);
	Структура.Вставить("Водитель2Пол",  						4);
	Структура.Вставить("Водитель3Пол",  						4);
	Структура.Вставить("Водитель4Пол",  						4);
	Структура.Вставить("Водитель5Пол",  						4);
	Структура.Вставить("Часов1",								2);
	Структура.Вставить("Часов2",								2);
	Структура.Вставить("Минут1",								2);
	Структура.Вставить("Минут2",								2);
	Структура.Вставить("НачалоДействия111",						2);
	Структура.Вставить("НачалоДействия112",						2);
	Структура.Вставить("НачалоДействия113",						2);
	Структура.Вставить("НачалоДействия114",						2);
	Структура.Вставить("НачалоДействия115",						2);
	Структура.Вставить("НачалоДействия116",						2);
	Структура.Вставить("ОкончаниеДействия111",					2);
	Структура.Вставить("ОкончаниеДействия112",					2);
	Структура.Вставить("ОкончаниеДействия113",					2);
	Структура.Вставить("ОкончаниеДействия114",					2);
	Структура.Вставить("ОкончаниеДействия115",					2);
	Структура.Вставить("ОкончаниеДействия116",					2);
	Структура.Вставить("НачалоДействия12",						2);
	Структура.Вставить("НачалоДействия11",						2);
	Структура.Вставить("НачалоДействия13",						2);
	Структура.Вставить("НачалоДействия14",						2);
	Структура.Вставить("НачалоДействия15",						2);
	Структура.Вставить("НачалоДействия16",						2);
	Структура.Вставить("ОкончаниеДействия11",					2);
	Структура.Вставить("ОкончаниеДействия12",					2);
	Структура.Вставить("ОкончаниеДействия13",					2);
	Структура.Вставить("ОкончаниеДействия14",					2);
	Структура.Вставить("ОкончаниеДействия15",					2);
	Структура.Вставить("ОкончаниеДействия16",					2);
	Структура.Вставить("НачалоДействия21",						2);
	Структура.Вставить("НачалоДействия22",						2);
	Структура.Вставить("НачалоДействия23",						2);
	Структура.Вставить("НачалоДействия24",						2);
	Структура.Вставить("НачалоДействия25",						2);
	Структура.Вставить("НачалоДействия26",						2);
	Структура.Вставить("ОкончаниеДействия21",					2);
	Структура.Вставить("ОкончаниеДействия22",					2);
	Структура.Вставить("ОкончаниеДействия23",					2);
	Структура.Вставить("ОкончаниеДействия24",					2);
	Структура.Вставить("ОкончаниеДействия25",					2);
	Структура.Вставить("ОкончаниеДействия26",					2);
	Структура.Вставить("НачалоДействия31",						2);
	Структура.Вставить("НачалоДействия32",						2);
	Структура.Вставить("НачалоДействия33",						2);
	Структура.Вставить("НачалоДействия34",						2);
	Структура.Вставить("НачалоДействия35",						2);
	Структура.Вставить("НачалоДействия36",						2);
	Структура.Вставить("ОкончаниеДействия31",					2);
	Структура.Вставить("ОкончаниеДействия32",					2);
	Структура.Вставить("ОкончаниеДействия33",					2);
	Структура.Вставить("ОкончаниеДействия34",					2);
	Структура.Вставить("ОкончаниеДействия35",					2);
	Структура.Вставить("ОкончаниеДействия36",					2);
	Структура.Вставить("Водитель1НомерСтроки",					2);
	Структура.Вставить("Водитель2НомерСтроки",					2);
	Структура.Вставить("Водитель3НомерСтроки",					2);
	Структура.Вставить("Водитель4НомерСтроки",					2);
	Структура.Вставить("Водитель5НомерСтроки",					2);
	Структура.Вставить("ТипОграниченияДопускаБезОграничений",   2);
	Структура.Вставить("ТипОграниченияДопускаСОграничением",	2);
	Контекст.Вставить("Заполнитель", Структура);

КонецПроцедуры

Функция ОбъединитьСтруктуры(МассивСтруктур, ИгнорироватьПовторяющиесяКлючи = Ложь)

	Перем Результат;
	
	Результат = Новый Структура;
	Для Каждого Структура Из МассивСтруктур Цикл
		Для Каждого КлючИЗначение Из Структура Цикл
			Если Результат.Свойство(КлючИЗначение.Ключ) Тогда
				Если Не ИгнорироватьПовторяющиесяКлючи Тогда
					Возврат Неопределено;
				КонецЕсли;
			Иначе
				Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;

КонецФункции // ОбъединитьСтруктуры()

//ППС 13-08-2014
Функция СформироватьСообщениеОшибка(Контекст, СообщениеОшибки, ЧастныйКод);
	
	Результат = Символы.ПС +
	            "Код печатной формы: " + Контекст.СтруктураОбъектаПФ.Код + Символы.ПС + 
	            "Наименование печатной формы: '" + Контекст.СтруктураОбъектаПФ.Наименование + "'" + Символы.ПС + 
	            "Ошибка выполнения (Кода программы)" + Символы.ПС + уб_temp.ОшибкаПоИсходномуКоду(ЧастныйКод, СообщениеОшибки);
	            
	Возврат Результат;

КонецФункции
//ППС 13-08-2014


Функция НайтиЭлементСпискаПоПредставлению2(Список, Текст)
	
	Для Каждого ЭлементСписка Из Список Цикл
		Если ЭлементСписка.Представление = "" Тогда
			ТекстПоиска = ЭлементСписка.Значение;
		Иначе
			ТекстПоиска = ЭлементСписка.Представление;
		КонецЕсли;
		Если Текст = ТекстПоиска Тогда
			Возврат ЭлементСписка;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

Функция ПФ_ДатаПрописью(ДатаЗнач, СЗаглавнойБуквы = Ложь, Падеж = Неопределено) Экспорт 
	
	День_П 	= День(ДатаЗнач);
	Месяц_П = Месяц(ДатаЗнач);
	Год_П	= Год(ДатаЗнач);
	
	Если Падеж = Перечисления.Падежи.Родительный ИЛИ Падеж = 2 Тогда
		День_Зн = ДеньПрописью(День_П);
	Иначе
		Если Прав(День_П, 1) = 3 Тогда
			День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2);
			Если День_П = 13 Тогда 
				День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2) + "е";
			КонецЕсли;	
		ИначеЕсли День_П = 23 Тогда
			День_Зн = "двадцать третье"
		Иначе
			День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2) + "е";
		КонецЕсли
	КонецЕсли;
	
	Месяц_Зн = МесяцПрописью(Месяц_П);
	Год_Зн 	 = ГодПрописью(Год_П);
	
	ТекстДата = День_Зн + " " + Месяц_Зн + " " + Год_Зн;
	
	Если СЗаглавнойБуквы Тогда
		ТекстДата = ВРег(Лев(ТекстДата,1)) + Прав(ТекстДата,СтрДлина(ТекстДата) - 1);
	КонецЕсли;
	
	Возврат ТекстДата;
КонецФункции
