Функция Данные (СсылкаНаЗаявку) Экспорт
	Запрос = НОвый Запрос("ВЫБРАТЬ
	                      |	Шапка.Ссылка,
	                      |	Шапка.Менеджер,
	                      |	Шапка.IDПолиса,
	                      |	Шапка.IDКалькуляции,
	                      |	Шапка.СтатусЗаявки,
	                      |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт, ЗНАЧЕНИЕ(Справочник.уб_СтраховыеПродукты.ПустаяСсылка)) КАК СтраховойПродукт,
						  |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт.Вид, ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)) КАК ВидСП,
						  |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СК,
	                      |	Шапка.Шаблон.ТипШаблона
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаПечать КАК Шапка
	                      |ГДЕ
	                      |	Шапка.БСО.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БСО.Ссылка,
	                      |	БСО.НомерСтроки,
	                      |	БСО.Подтверждено,
	                      |	БСО.СК,
	                      |	БСО.ВидБСО,
	                      |	БСО.НомерБСО,
	                      |	БСО.Количество,
	                      |	БСО.Агент,
	                      |	БСО.Поставщик,
	                      |	БСО.ОрганизацияАгент,
	                      |	БСО.Комментарий
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаПечать.БСО КАК БСО
	                      |ГДЕ
	                      |	БСО.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	уб_ЗаявкаНаПечатьДанные.Параметр,
	                      |	уб_ЗаявкаНаПечатьДанные.Значение
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаПечать.Данные КАК уб_ЗаявкаНаПечатьДанные
	                      |ГДЕ
	                      |	уб_ЗаявкаНаПечатьДанные.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаЗаявку);
	Результат = Запрос.ВыполнитьПакет();
	Возврат Результат
КонецФункции	

Функция ДанныеПечатиПоВыезду (СсылкаНаЗаявку,ВернутьКакСтруктуру = Ложь ) Экспорт
	Запрос = НОвый Запрос("ВЫБРАТЬ
	                      |	Шапка.Ссылка,
	                      |	Шапка.Менеджер,
	                      |	Шапка.IDПолиса,
	                      |	Шапка.IDКалькуляции,
	                      |	Шапка.СтатусЗаявки,
						  |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт, ЗНАЧЕНИЕ(Справочник.уб_СтраховыеПродукты.ПустаяСсылка)) КАК СтраховойПродукт,
						  |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт.Вид, ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)) КАК ВидСП,
	                      |	ЕСТЬNULL(Шапка.Шаблон.СтраховойПродукт.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СК,
	                      |	Шапка.Шаблон.ТипШаблона
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаПечать КАК Шапка
	                      |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.СозданНаОсновании = Шапка.Ссылка
	                      |ГДЕ
	                      |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БСО_Печать.Ссылка,
	                      |	БСО_Печать.НомерСтроки,
	                      |	БСО_Печать.Подтверждено,
	                      |	БСО_Печать.СК,
	                      |	БСО_Печать.ВидБСО,
	                      |	БСО_Печать.НомерБСО,
	                      |	БСО_Печать.Количество,
	                      |	БСО_Печать.Агент,
	                      |	БСО_Печать.Поставщик,
	                      |	БСО_Печать.ОрганизацияАгент,
	                      |	БСО_Печать.Комментарий,
	                      |	БСО_Печать.ВидБСО.Тип как ТипБСО
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаПечать.БСО КАК БСО_Печать
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявка
	                      |		ПО (Заявка.СозданНаОсновании = БСО_Печать.Ссылка)
	                      |ГДЕ
	                      |	Заявка.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	уб_ЗаявкаНаПечатьДанные.Параметр,
	                      |	уб_ЗаявкаНаПечатьДанные.Значение
	                      |ИЗ
	                      |	Документ.уб_ЗаявкаНаПечать.Данные КАК уб_ЗаявкаНаПечатьДанные
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявка
	                      |		ПО (Заявка.СозданНаОсновании = уб_ЗаявкаНаПечатьДанные.Ссылка)
	                      |ГДЕ
	                      |	Заявка.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаЗаявку);
	Результат = Запрос.ВыполнитьПакет();
	Если ВернутьКакСтруктуру = Истина Тогда
		ЗаявкаШапка     = Результат[0].Выбрать();
		ЗаявкаШапка.Следующий();
		ЗаявкаБСО       = Результат[1].Выгрузить();
		ЗаявкаПараметры = Результат[2].Выгрузить();
		
		Структура =  Новый Структура;
		
		Структура.Вставить("Менеджер_ЗаявкаНаПечать", ЗаявкаШапка.Менеджер);
		Структура.Вставить("СтраховойПродукт", ЗаявкаШапка.СтраховойПродукт);
		Структура.Вставить("ВидСП", ЗаявкаШапка.ВидСП);
		Структура.Вставить("СК_ЗаявкаНаПечать", ЗаявкаШапка.СК);
		Для каждого СтрокаБСО из ЗаявкаБСО Цикл
			Если СтрокаБСО.ТипБСО = Перечисления.уб_ТипыБСО.ПолисОсаго ИЛИ СтрокаБСО.ТипБСО = Перечисления.уб_ТипыБСО.Полис тогда
				Структура.Вставить("ВидБСО_ЗаявкаНаПечать", СтрокаБСО.ВидБСО);
				Структура.Вставить("НомерПолиса_ЗаявкаНаПечать", СтрокаБСО.НомерБСО);
			ИначеЕсли СтрокаБСО.ТипБСО = Перечисления.уб_ТипыБСО.КвитанцияА7 Тогда
				Структура.Вставить("ВидБСОКвитанции_ЗаявкаНаПечать", СтрокаБСО.ВидБСО);
				Структура.Вставить("НомерКвитанции_ЗаявкаНаПечать", СтрокаБСО.НомерБСО);
			КонецЕсли;	
		КонецЦикла;	
		
		ДобавитьЗначениеПараметраЗаявки("ОбъектСтрахования",ЗаявкаПараметры,Структура,Справочники.уб_ОбъектыСтрахования.ПустаяСсылка());
		ДобавитьЗначениеПараметраЗаявки("ДатаВыдачиПолиса",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("НачалоДействия",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("ОкончаниеДействия",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("ПлатежДата",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("ПлатежНомер",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("ПлатежСумма",ЗаявкаПараметры,Структура);
		
		ДобавитьЗначениеПараметраЗаявки("Страхователь",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("Собственник",ЗаявкаПараметры,Структура);
		
		ДобавитьЗначениеПараметраЗаявки("СтраховаяПремияВсего",ЗаявкаПараметры,Структура);
		ДобавитьЗначениеПараметраЗаявки("Водитель1",ЗаявкаПараметры,Структура,,,Ложь);
		ДобавитьЗначениеПараметраЗаявки("Водитель2",ЗаявкаПараметры,Структура,,,Ложь);
		ДобавитьЗначениеПараметраЗаявки("Водитель3",ЗаявкаПараметры,Структура,,,Ложь);
		ДобавитьЗначениеПараметраЗаявки("Водитель4",ЗаявкаПараметры,Структура,,,Ложь);
		ДобавитьЗначениеПараметраЗаявки("Водитель5",ЗаявкаПараметры,Структура,,,Ложь);
		
		Возврат Структура;
	Иначе	
		//3 пакета запросов
		Возврат Результат
	КонецЕсли;	
КонецФункции	

Функция ДобавитьЗначениеПараметраЗаявки(ИМЯ,Источник,Получатель, ПоУмолчанию = Неопределено,НовоеИмя = "",ДобавлятьПриОтсутствии = Истина)
	нСтроки = Источник.НайтиСтроки(Новый Структура("Параметр",Имя));
	Если НовоеИмя = "" Тогда
		НовоеИмя = Имя;
	КонецЕсли;	
	Если нСтроки.Количество()= 0 Тогда
		//Сообщить("Не найден параметр с именем "+Имя);
		Если ДобавлятьПриОтсутствии = Истина Тогда
			Получатель.Вставить(НовоеИмя, ПоУмолчанию);
		Конецесли;	
		Возврат Ложь; 
	Иначе
		Получатель.Вставить(НовоеИмя, нСтроки[0].Значение);
		Возврат Истина; 
	КонецЕсли;	
КонецФункции