
//тип результата - 	"спр" массив ссылок справочника
//					"стр" массив строк
Функция ВернутьБлижайшиеСтанцииМетро(Строка = "", Знач ТипРезультата = "спр", СписокМетро = Неопределено) Экспорт
	
	СписокМетро = Новый Массив;
	Если Не ПустаяСтрока(Строка)
		//И ПравоДоступа("Вывод", Метаданные) 
		Тогда
		Попытка
			Запроc1 = "https://geocode-maps.yandex.ru/1.x/?geocode="+уб_ОбменДанными.URI(Строка)+"&results=5";
			
			XMLHttp = Неопределено;
			Результат = уб_обменДанными.ВыполнитьHttpЗапрос(Запроc1,,, XMLHttp, "Яндекс Карты",Ложь);
			
			Макет = ПолучитьМакет("СхемаYandex");
			РасположениеСхемы = КаталогВременныхФайлов()+"yandex-geocode.xsd";
			Макет.Вывод = ИспользованиеВывода.Разрешить;
			Макет.Записать(РасположениеСхемы);
			СхемаXML = Новый СхемаXML;
			СхемаXML.РасположениеСхемы = РасположениеСхемы;
			
			СхемыXML = Новый НаборСхемXML;
			СхемыXML.Добавить(СхемаXML);
			
			ЧтениеXML = Новый ЧтениеXML();
			ЧтениеXML.УстановитьСтроку(Результат);
			ЧтениеXML.Прочитать();

			Фабрика = Новый ФабрикаXDTO(СхемыXML);
			Данные = Фабрика.ПрочитатьXML(ЧтениеXML);
			//Данные.GeoObjectCollection.featureMember.GeoObject
			ВсегоОбъектов = 1;
			Если Данные.GeoObjectCollection.Свойства().Получить("featureMember") = Неопределено Тогда
				ВсегоОбъектов = 0;
			КонецЕсли;	
			СписокКоординат = Новый Массив;
			Если ВсегоОбъектов>0 Тогда
				Если ТипЗнч(Данные.GeoObjectCollection.featureMember) = Тип("СписокXDTO")  Тогда
					ВсегоОбъектов  = Данные.GeoObjectCollection.featureMember.Количество();
				КонецЕсли;	
				
				Если ВсегоОбъектов =1 Тогда
					СписокКоординат.Добавить(Данные.GeoObjectCollection.featureMember.GeoObject.Point.pos);
				Иначе
					Для каждого Объект из Данные.GeoObjectCollection.featureMember Цикл
						СписокКоординат.Добавить(Объект.GeoObject.Point.pos);
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
			Для каждого Координата из  СписокКоординат Цикл
				Запроc2 = "http://geocode-maps.yandex.ru/1.x/?geocode="+Координата+"&kind=metro&results=5";
				Результат = уб_обменДанными.ВыполнитьHttpЗапрос(Запроc2,,, XMLHttp, "Яндекс Карты",Ложь);
				ЧтениеXML = Новый ЧтениеXML();
				ЧтениеXML.УстановитьСтроку(Результат);
				ЧтениеXML.Прочитать();

				Фабрика = Новый ФабрикаXDTO(СхемыXML);
				Данные = Фабрика.ПрочитатьXML(ЧтениеXML);
				ВсегоОбъектов = 1;
				Если Данные.GeoObjectCollection.Свойства().Получить("featureMember")=Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				Если ТипЗнч(Данные.GeoObjectCollection.featureMember) = Тип("СписокXDTO")  Тогда
					ВсегоОбъектов  = Данные.GeoObjectCollection.featureMember.Количество();
				КонецЕсли;	
				
				Если ВсегоОбъектов =1 Тогда
					Метро = Данные.GeoObjectCollection.featureMember.GeoObject.name;
					Если СписокМетро.Найти(Метро)= Неопределено Тогда
						СписокМетро.Добавить(Метро);
					КонецЕсли;
				Иначе
					Для каждого Объект из Данные.GeoObjectCollection.featureMember Цикл
						Метро =  Объект.GeoObject.name;
						Если СписокМетро.Найти(Метро)= Неопределено Тогда
							СписокМетро.Добавить(Метро);
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;
		Исключение		
		КонецПопытки;
	КонецЕсли;
	ТипРезультата = Лев(НРег(СокрЛП(ТипРезультата)), 3);
	Если ТипРезультата = "спр" Тогда
		СЗ = Новый СписокЗначений;
		Если СписокМетро.Количество() > 0 Тогда
			//убираем "метро " в начале строки
			ТЗДляЗапроса = Новый ТаблицаЗначений;
			ТЗДляЗапроса.Колонки.Добавить("Индекс", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(2, 0));
			ТЗДляЗапроса.Колонки.Добавить("Строка",	ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(255));
			Индекс = 0;
			Для Каждого ЭлементМассива Из СписокМетро Цикл
				СтрокаТЗ = ТЗДляЗапроса.Добавить();
				СтрокаТЗ.Индекс = Индекс;
				СтрокаТЗ.Строка = СокрЛП(СтрЗаменить(ЭлементМассива, "метро", ""));
			КонецЦикла;
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТЗ.Индекс,
			|	ТЗ.Строка
			|ПОМЕСТИТЬ ВТ_ТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СМ.Ссылка,
			|	СМ.Наименование
			|ИЗ
			|	Справочник.уб_СтанцииМетро КАК СМ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТЗ КАК ВТ_ТЗ
			|		ПО (СМ.Наименование ПОДОБНО ""%"" + ВТ_ТЗ.Строка + ""%"")
			|ГДЕ
			|	НЕ СМ.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТ_ТЗ.Индекс");
			Запрос.УстановитьПараметр("ТЗ", ТЗДляЗапроса);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СЗ.Добавить(Выборка.Ссылка, Выборка.Наименование);
			КонецЦикла;
		КонецЕсли;
		Если СЗ.Количество() = 0 Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СМ.Ссылка,
			|	СМ.Наименование
			|ИЗ
			|	Справочник.уб_СтанцииМетро КАК СМ
			|ГДЕ
			|	НЕ СМ.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	СМ.Наименование");
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СЗ.Добавить(Выборка.Ссылка, Выборка.Наименование);
			КонецЦикла;
		КонецЕсли;
		Результат = СЗ;
	Иначе
		Результат = СписокМетро;
	КонецЕсли;
    Возврат Результат;
	
КонецФункции



Функция ВернутьВсеСтанцииМетро() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_СтанцииМетро.Ссылка
	               |ИЗ
	               |	Справочник.уб_СтанцииМетро КАК уб_СтанцииМетро
	               |ГДЕ
	               |	уб_СтанцииМетро.ПометкаУдаления = Ложь
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_СтанцииМетро.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//Список = Новый СписокЗначений;
	//Список.ЗагрузитьЗначения();			   
	//Возврат Список;
КонецФункции	