
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли
	// Вставить содержимое обработчика.
	Заголовок = "Запись документа """ + СокрЛП(Ссылка) + """: ";
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)
	СтруктураОбязательныхПолей = Новый Структура("СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	Движения.уб_ДвиженияБСО.Очистить();
	Движения.уб_ОстаткиБСО.Очистить();	
	ЕстьПодтвержденные = Ложь;
	Для Каждого СтрокаТЧ Из БСО Цикл
		ГрВремПерем = Новый Граница(СтрокаТЧ.ДатаПеремещения,ВидГраницы.Исключая);
		Если СтрокаТЧ.Подтверждено Тогда
			ЕстьПодтвержденные = Истина;
		КонецЕсли;
		Если НЕ ЗначениеНеЗаполнено(СокрЛП(СтрокаТЧ.НомерБСО)) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО НОМЕРНОГО УЧЕТА
			// сначала проверим, а есть ли такой БСО в указанном месте
			//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО, Подтверждено", СтрокаТЧ.СК, СтрокаТЧ.ВидБСО, СтрокаТЧ.НомерБСО, Истина);//, ДокПроведен , Истина
			
			Если СтрокаТЧ.Подтверждено И Ссылка.Проведен Тогда
				ЕстьВНаличие = Ложь;
			Иначе	
				ЕстьВНаличие = Истина;
			КонецЕсли;
			
			//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(ГрВремПерем, СтруктураОтбора);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	*
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
			|			&Период,
			|			ВидБСО = &ВидБСО
			|				И НомерБСО = &НомерБСО
			//|				И СК = &СК
			|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			Запрос.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
			Запрос.УстановитьПараметр("НомерБСО", СтрокаТЧ.НомерБСО);
			//Запрос.УстановитьПараметр("СК", СтрокаТЧ.СК);
			Запрос.УстановитьПараметр("Период", ГрВремПерем);
			тзРег = Запрос.Выполнить().Выгрузить();
			
			ЗаписьРег = Неопределено;
			Если тзРег.Количество() > 0 Тогда
				//Если тзРег.Количество() > 1 Тогда
				//	тзРег.Сортировать("Период УБЫВ")
				//КонецЕсли;
				ЗаписьРег = тзРег[0];
			КонецЕсли;
			Если ЗаписьРег <> Неопределено И СтрокаТЧ.ОрганизацияАгент <> СтрокаТЧ.ОрганизацияАгентКуда Или СтрокаТЧ.Поставщик <> СтрокаТЧ.ПоставщикКуда Тогда
				//делаем движение, списывающее старые данные
				Движение = Движения.уб_ДвиженияБСО.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ЗаписьРег);
				Движение.Период				= СтрокаТЧ.ДатаПеремещения - 1;
				Движение.СостояниеБСО 		= Перечисления.уб_СостоянияБСО.Уничтожен;
				Движение.ПоложениеБСО 		= Перечисления.уб_ПоложенияБСО.Списан;
				Движение.КодОперации 		= Перечисления.уб_КодыОперацийБСО.КомпенсацияПеремещенийБСО;
				Движение.АгентОтправитель   = СтрокаТЧ.Агент;
				Движение.Агент				= СтрокаТЧ.АгентКуда;
			КонецЕсли;
			Движение = Движения.уб_ДвиженияБСО.Добавить();
			Движение.Период 	= СтрокаТЧ.ДатаПеремещения;
			Движение.СК 		= СтрокаТЧ.СК;
			Движение.ВидБСО		= СтрокаТЧ.ВидБСО;
			Движение.НомерБСО 	= СтрокаТЧ.НомерБСО;
			Если ЗаписьРег <> Неопределено Тогда
				//Движение.Блокировка		= ЗаписьРег.Блокировка;
				Движение.НомерПолиса	= ЗаписьРег.НомерПолиса;
				Движение.ГодПолиса		= ЗаписьРег.ГодПолиса;
				Движение.СтраховойПолис	= ЗаписьРег.СтраховойПолис;
				Движение.ДатаВозврата 	= ЗаписьРег.ДатаВозврата;
				Движение.ДопНомерБСО= ЗаписьРег.ДопНомерБСО;
			КонецЕсли;
			Движение.Поставщик 			= СтрокаТЧ.ПоставщикКуда;
			Движение.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгентКуда;
			Движение.Подтверждено   	= СтрокаТЧ.Подтверждено;
			//Движение.ДокПроведен 		= Ссылка.Проведен;
			Движение.Активность 		= Ссылка.Проведен;
			Движение.АгентОтправитель	= СтрокаТЧ.Агент;
			Движение.Агент				= СтрокаТЧ.АгентКуда;
			ПодразделениеОт 	= уб_СС.ПолучитьПодразделениеАгента(СтрокаТЧ.Агент, 	Дата, Истина);
			ПодразделениеКуда 	= уб_СС.ПолучитьПодразделениеАгента(СтрокаТЧ.АгентКуда, Дата, Истина);
			Если ПодразделениеКуда.ТипПодразделения = Перечисления.уб_ТипПодразделения.ГоловнойОфис 
			   и ПодразделениеОт.ТипПодразделения   = Перечисления.уб_ТипПодразделения.ГоловнойОфис Тогда
				Если ЗаписьРег <> Неопределено Тогда
					Движение.ПоложениеБСО = ЗаписьРег.ПоложениеБСО;
				Иначе
					//по умолчанию - поступил
					Движение.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПолученИзСК;
				КонецЕсли;
			ИначеЕсли ПодразделениеКуда.ТипПодразделения = Перечисления.уб_ТипПодразделения.ГоловнойОфис
					и ПодразделениеОт.ТипПодразделения <> Перечисления.уб_ТипПодразделения.ГоловнойОфис Тогда
				Движение.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ВозвращенСТочки;
			Иначе
				Движение.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданНаТочку;
			КонецЕсли;
			Если СтрокаТЧ.СостояниеБСО.Пустая() Тогда
				Если ЗаписьРег <> Неопределено Тогда
					Движение.СостояниеБСО = ЗаписьРег.СостояниеБСО;
				КонецЕсли;
			Иначе
				Движение.СостояниеБСО = СтрокаТЧ.СостояниеБСО;
			КонецЕсли;
			Если Движение.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданНаТочку
				И ЗаписьРег <> Неопределено Тогда
				Движение.ДатаВозврата = ЗаписьРег.ДатаВозврата;
			КонецЕсли;
			Движение.НаОснованииБумажногоДокумента = Ложь;					
			Движение.КодОперации = Перечисления.уб_КодыОперацийБСО.КомпенсацияПеремещенийБСО;
		Иначе
			Если Не СтрокаТЧ.Подтверждено Или Не Ссылка.Проведен Тогда
				Продолжить;	
			КонецЕсли;
			// ДВИЖЕНИЯ ДЛЯ БСО КОЛИЧЕСТВЕННОГО УЧЕТА
			Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда
				// проверим остатки
				СтруктураОтбора = Новый Структура("Период, Поставщик, ОрганизацияАгент, СК, ВидБСО, Агент"
												,ГрВремПерем
												,СтрокаТЧ.Поставщик
												,СтрокаТЧ.ОрганизацияАгент
												,СтрокаТЧ.СК
												,СтрокаТЧ.ВидБСО
												,СтрокаТЧ.Агент
												);
				тзРег = уб_СЛ.ПолучитьОстаткиБСО(СтруктураОтбора);
				КолВНаличие = 0;
				ЗаписьРег = Неопределено;
				Если тзРег.Количество() > 0 Тогда
					ЗаписьРег = тзРег[0];
					КолВНаличие = ЗаписьРег.Количество;
				КонецЕсли;				
			Иначе
				СтрокаСообщения = "Не указан номер БСО " + СтрокаТЧ.ВидБСО + ", строка "+Строка(СтрокаТЧ.НомерСтроки)+" ";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				Возврат;
			КонецЕсли;
			//  уменьшаем количество, откуда перемещается
			Движение = Движения.уб_ОстаткиБСО.Добавить();
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= СтрокаТЧ.ДатаПеремещения;
			// измерения
			Движение.Поставщик		= СтрокаТЧ.Поставщик;
			Движение.ОрганизацияАгент	= СтрокаТЧ.ОрганизацияАгент;
			Движение.СК 			= СтрокаТЧ.СК;
			Движение.ВидБСО			= СтрокаТЧ.ВидБСО;
			Движение.Агент			= СтрокаТЧ.Агент;
			// ресурсы
			Движение.Количество		= СтрокаТЧ.Количество;
			// реквизиты
			Движение.КодОперации	= Перечисления.уб_КодыОперацийБСО.КомпенсацияПеремещенийБСО;
			//
			//  увеличиваем количество, куда перемещается
			Движение = Движения.уб_ОстаткиБСО.Добавить();
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= СтрокаТЧ.ДатаПеремещения;
			// измерения
			Движение.Поставщик	= СтрокаТЧ.ПоставщикКуда;
			Движение.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгентКуда;
			Движение.СК 			= СтрокаТЧ.СК;
			Движение.ВидБСО			= СтрокаТЧ.ВидБСО;
			Движение.Агент			= СтрокаТЧ.АгентКуда;
			// ресурсы
			Движение.Количество		= СтрокаТЧ.Количество;
			// реквизиты
			Движение.КодОперации	= Перечисления.уб_КодыОперацийБСО.КомпенсацияПеремещенийБСО;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьПодтвержденные Тогда
		Если Не ЗначениеНеЗаполнено(Заголовок) Тогда
			Сообщить(Заголовок);
			Заголовок = "";
		КонецЕсли;
		Сообщить("Движения не сделаны. Не обнаружено ни одной подтвержденной строки компенсации.");
	КонецЕсли;
	Движения.уб_ДвиженияБСО.Записать();
	Движения.уб_ОстаткиБСО.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры