
Функция ВыборкаСтраховыхПолисовПоУИД(МассивУИД) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ф.СтраховойПолис КАК СтраховойПолис
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК Ф
	|ГДЕ
	|	&Условие
	|	И НЕ Ф.СтраховойПолис ССЫЛКА Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", ?(ТипЗнч(МассивУИД) = Тип("Массив"), "Ф.УИД В(&Условие)", "Ф.УИД = &Условие"));	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Условие", МассивУИД);
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура УдалитьЗаписьРегистра(УИД, СтраховойПолис = Неопределено) Экспорт

	Набор = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
	Набор.Отбор.УИД.Установить(УИД);
	Если СтраховойПолис <> Неопределено Тогда
		Набор.Отбор.СтраховойПолис.Установить(СтраховойПолис);
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры
