
Процедура ПередЗаписью(Отказ)
	
	Если Не (ЭтоГруппа Или ОбменДанными.Загрузка) Тогда
		Если НЕ ЗначениеЗаполнено(ТипОплаты) Тогда
			СтрокаСообщения = "Не заполнено значение реквизита ""Тип оплаты""!";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, "Справочник: Виды оплат");
		КонецЕсли;

		Если ТипОплаты <> Перечисления.ТипыОплат.Наличные Тогда
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Организация""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, "Справочник: Виды оплат");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Контрагент""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, "Справочник: Виды оплат");
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
				СтрокаСообщения = "Не заполнено значение реквизита ""Договор контрагента""!";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, "Справочник: Виды оплат");
			КонецЕсли;

			//Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетов) Тогда
			//	СтрокаСообщения = "Не заполнено значение реквизита ""Счет учета расчетов""!";
			//	ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, "Справочник: Виды оплат");
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
