&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимВыбора") и Параметры.РежимВыбора Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	КонецЕсли;	
	Если Параметры.Отбор.Свойство("Родитель") Тогда
		Если Параметры.Отбор.Родитель = ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники") Тогда
			Элементы.Список.ТекущийРодитель = ПредопределенноеЗначение("Справочник.ФизическиеЛица.Агенты");
			
		ИначеЕсли Параметры.Отбор.Родитель = ПредопределенноеЗначение("Справочник.ФизическиеЛица.Курьеры") Тогда
			Элементы.Список.ТекущийРодитель = Параметры.Отбор.Родитель;	
		КонецЕсли;
		
		ТекущийРодитель =  Элементы.Список.ТекущийРодитель;
		
		Отбор = ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники");
		
	    СтруктурыФильтра = Новый Массив;
	    СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Ссылка",        Отбор,  ВидСравненияКомпоновкиДанных.ВИерархии    , Истина));
	    //СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Ссылка",        Параметры.Отбор.Родитель,  ВидСравненияКомпоновкиДанных.Равно    , Истина));
	  уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра,Истина);
		Параметры.Отбор.Очистить();
	КонецЕсли;	
	  СтруктурыФильтра = Новый Массив;
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","ПометкаУдаления",        ЛОЖЬ,  ВидСравненияКомпоновкиДанных.Равно    , Истина,"Мусор"));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Ссылка",        уб_ВызовСервера.ФизлицаГруппаМусор(),  ВидСравненияКомпоновкиДанных.НеВИерархии    , Истина,"Мусор"));
	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра,ЛОЖЬ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекущийЭлементСписка) Тогда
		Элементы.Список.ТекущаяСтрока = ТекущийЭлементСписка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимВыбора") и Параметры.РежимВыбора Тогда
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		Если уб_ВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока,"ЭтоГруппа") = Истина Тогда
			СтандартнаяОбработка = Ложь;
		Иначе
			ОповеститьОВыборе(ТекущаяСтрока);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Настройки.ДополнительныеСвойства.Вставить("Обновить",Истина);
КонецПроцедуры

//&НаКлиенте
//Процедура СписокПриАктивизацииСтроки(Элемент)
///	ПроверитьРежимПоискаДляДинамическогоСписка();
//КонецПроцедуры


//&НаСервере
//Процедура ПроверитьРежимПоискаДляДинамическогоСписка()
//    
//    НастройкиСписка = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
//    СтрокаОтбора = Строка(НастройкиСписка.Отбор);
//	Если СтрНайти(СтрокаОтбора, "Наименование Содержит") <> 0 Тогда
//		
//        //Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("РежимПоиска", Истина);
//	//ИначеЕсли СтрНайти(СтрокаОтбора, "Ссылка В группе") <> 0 и 
//	ИначеЕсли ЗначениеЗаполнено(ТекущийРодитель) и НЕ Элементы.Список.ТекущийРодитель = ТекущийРодитель Тогда
//        //Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("РежимПоиска", Ложь);
//		Элементы.Список.ТекущийРодитель = ТекущийРодитель;
//    КонецЕсли;
//    
//КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	//Если Настройки.ДополнительныеСвойства.Свойство("РежимПоиска") Тогда
	//	РежимВыводаДинамическогоСписка = Настройки.ДополнительныеСвойства.РежимПоиска;
	//КонецЕсли;

КонецПроцедуры






