#Область Константы

Функция ПолучитьЗначениеКонстанты(Имя) Экспорт
	ЗначениеНастройки = Неопределено;
	Если ПараметрыСеанса.уб_Константы.Свойство(Имя,ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	Возврат ЗначениеНастройки;
КонецФункции	

Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, Значение, ПерезаполнятьПараметрыСеанса = Истина) Экспорт
	
	Объект = Справочники.уб_Константы[ИмяКонстанты].ПолучитьОбъект();
	Объект.ЗначениеКонстанты = Значение;
	Попытка
		Объект.Записать();
		Если ПерезаполнятьПараметрыСеанса Тогда
			УстановитьПараметрыСеансаКонстант();
		КонецЕсли;	
	Исключение
		#Если клиент Тогда
			Сообщить("Ошибка при записи константы «" + ИмяКонстанты + "» " + ОписаниеОшибки());
		#КонецЕсли	
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьПараметрыСеансаКонстант() Экспорт
	
	Структура = Новый Структура;
	ЗапросПоКонстантам = Новый Запрос;
	ЗапросПоКонстантам.Текст =
	"ВЫБРАТЬ
	|	уб_Константы.Ссылка,
	|	уб_Константы.ЗначениеКонстанты
	|ИЗ
	|	Справочник.уб_Константы КАК уб_Константы
	|ГДЕ
	|	уб_Константы.Предопределенный
	|	И НЕ уб_Константы.ЭтоГруппа";
	Выборка = ЗапросПоКонстантам.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.Вставить(Справочники.уб_Константы.ПолучитьИмяПредопределенного(Выборка.Ссылка), Выборка.ЗначениеКонстанты);
	КонецЦикла;
	
	ОсновнаяОрганизация  = Справочники.Организации.ОсновнаяОрганизация();
	Если ЗначениеЗаполнено(ОсновнаяОрганизация ) Тогда
		Структура.Вставить("ОсновнаяОрганизация", ОсновнаяОрганизация);
	КонецЕсли;	
	
	//Структура.Вставить("ВалютаРегламентированногоУчета", 	Константы.ВалютаРегламентированногоУчета.Получить());	
	//#Если Клиент Тогда
	//Форма = ПолучитьОбщуюФорму("уб_БоковоеМеню");
	//#Иначе
	//Форма = Неопределено;
	//#КонецЕсли
	//Структура.Вставить("ЭтоРабочаяБаза", ?(Форма <> Неопределено И Форма.Открыта(), Форма.ЭтоРабочаяБаза, Найти(уб_temp.ПолучитьИмяБазыДанных(), "TAU") > 0));
	//Если Не Структура.ЭтоРабочаяБаза Тогда
	Если Структура.ЭтоРабочаяБаза <> Истина Тогда
		Структура.Вставить("СерверB2B", "b2b");
	КонецЕсли;	
	
	Если Структура.ПроверкаЗаявокОтделомКонтроля = Неопределено Тогда
		Структура.Вставить("ПроверкаЗаявокОтделомКонтроля", Ложь);
	КонецЕсли;	
	
	ДополнитьНастройкамиПользователя(Структура,ПараметрыСеанса.ТекущийПользователь);
	
	//#Если Не ВнешнееСоединение  Тогда
	//	//Медленно выполняется
	//	Если НЕ ПараметрыСеанса.ТекущийПользователь.Наименование = "WebService system account" Тогда 
	//		Структура.Вставить("SID", уб_СЕРВЕРные.SID());
	//	КонецЕсли;	
	//#КонецЕсли
	//МАСТЕР
	Структура.Вставить("ЭтоМастер", Найти(ПараметрыСеанса.уб_ОсновноеПодразделение,"М-ОП")=1);
	Структура.Вставить("ЭтоМастерРуководитель", Строка(ПараметрыСеанса.уб_ТекущееФизЛицо)= "Медков Артем");
	//
	ПараметрыСеанса.уб_Константы = Новый ФиксированнаяСтруктура(Структура);
	
КонецПроцедуры


Процедура ДополнитьНастройкамиПользователя(Структура,ТекущийПользователь)
	ЗапросНастройкиПользователя = Новый Запрос;
	ЗапросНастройкиПользователя.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	ЗапросНастройкиПользователя.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Профиль,
	|	ВЫБОР
	|		КОГДА Пользователи.Профиль = ЗНАЧЕНИЕ(Справочник.уб_ПрофилиНастроекПользователей.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьПрофиль
	|ПОМЕСТИТЬ Пользователи
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрЗначениеПрав.Значение,
	|	РегистрЗначениеПрав.Настройка.Наименование КАК Наименование,
	|	РегистрЗначениеПрав.Настройка.ДобавлятьВПрофили,
	|	РегистрЗначениеПрав.Настройка.Ссылка КАК Ссылка,
	|	РегистрЗначениеПрав.Настройка.Предопределенный КАК Предопределенный,
	|	РегистрЗначениеПрав.Настройка.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Пользователи КАК Пользователи
	|		ПО (ВЫБОР
	|				КОГДА РегистрЗначениеПрав.Настройка.ДобавлятьВПрофили = ИСТИНА
	|						И Пользователи.ЕстьПрофиль = ИСТИНА
	|					ТОГДА РегистрЗначениеПрав.Пользователь = Пользователи.Профиль
	|				ИНАЧЕ РегистрЗначениеПрав.Пользователь = Пользователи.Пользователь
	|			КОНЕЦ)
	|			И (НЕ РегистрЗначениеПрав.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ПустаяСсылка))";
	
	Настройки = ПланыВидовХарактеристик.НастройкиПользователей;
	Выборка = ЗапросНастройкиПользователя.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			ПустоеЗначение = Выборка.ТипЗначения.ПривестиЗначение();
			Значение =  ПустоеЗначение;
		Иначе
			Значение = Выборка.Значение;
		КонецЕсли;
		
		Если Выборка.Предопределенный = Истина Тогда
			ИмяНастройки = Настройки.ПолучитьИмяПредопределенного(Выборка.Ссылка);
			//На примере ОсновнаяОрганизация, если задана выше она приоритетна, 
			//иначе берется из пользователя
			Если Структура.Свойство(ИмяНастройки) = ЛОЖЬ Тогда 
				Структура.Вставить(ИмяНастройки,Значение);		
			КонецЕсли;	
		Иначе
			Попытка
				Структура.Вставить(Выборка.Наименование,Значение);		
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		//Иначе
		//	ПустоеЗначение = Выборка.Настройка.ТипЗначения.ПривестиЗначение();
		//	Возврат ПустоеЗначение;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ТекущееФизЛицо() Экспорт
	Возврат ПараметрыСеанса.уб_ТекущееФизЛицо;
КонецФункции


Функция ПользовательПоФизлицу(Физлицо) Экспорт
	Возврат Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Физлицо);
КонецФункции	

Функция ЭтоМенеджер() ЭКспорт
	Возврат ПараметрыСеанса.уб_ЭтоМенеджер
КонецФункции
#КонецОбласти

#Область БСП_ОбщегоНазначения
////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе.

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	// Если передано имя предопределенного.
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		
		//ПолноеИмяПредопределенногоЭлемента = Ссылка;
		//
		//// Вычисление ссылки по имени предопределенного.
		//// - дополнительно выполняет проверку метаданных предопределенного, выполняется предварительно.
		//Попытка
		//	Ссылка = ПредопределенныйЭлемент(ПолноеИмяПредопределенногоЭлемента);
		//Исключение
		//	ТекстОшибки = ПодставитьПараметрыВСтроку(
		//	НСтр("ru = 'Неверный первый параметр %1 в функции %2:
		//		|%3';
		//		|en = 'Invalid value of the %1 parameter, function %2:
		//		|%3.'"), "Ссылка", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта", 
		//		//ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		//		ИнформацияОбОшибке());
		//	ВызватьИсключение(ТекстОшибки);//, КатегорияОшибки.ОшибкаКонфигурации);
		//КонецПопытки;
		//
		//// Разбор полного имени предопределенного.
		//ЧастиПолногоИмени = СтрРазделить(ПолноеИмяПредопределенногоЭлемента, ".");
		//ПолноеИмяОбъектаМетаданных = ЧастиПолногоИмени[0] + "." + ЧастиПолногоИмени[1];
		//
		//// Если предопределенный не создан в ИБ, то требуется выполнить проверку доступа к объекту.
		//// В других сценариях проверка доступа выполняется в момент исполнения запроса.
		//Если Ссылка = Неопределено Тогда 
		//	МетаданныеОбъекта = ОбъектМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
		//	Если Не ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда 
		//		ВызватьИсключение(ПодставитьПараметрыВСтроку(
		//			НСтр("ru = 'Недостаточно прав для работы с таблицей ""%1""';
		//				|en = 'Insufficient rights to access table %1.'"), ПолноеИмяОбъектаМетаданных));//,
		//			//КатегорияОшибки.НарушениеПравДоступа);
		//	КонецЕсли;
		//КонецЕсли;
		
	Иначе // Если передана ссылка.
		
		Попытка
			ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя(); 
		Исключение
			ВызватьИсключение (ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный первый параметр %1 в функции %2: 
					|Значение должно быть ссылкой или именем предопределенного элемента.';
					|en = 'Invalid value of the %1 parameter, function %2:
					|The value must contain predefined item name or reference.'"), 
				"Ссылка", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта"))//,
				//КатегорияОшибки.ОшибкаКонфигурации);
		КонецПопытки;
		
	КонецЕсли;
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);
		Для Индекс = 0 По Реквизиты.ВГраница() Цикл
			Реквизиты[Индекс] = СокрЛП(Реквизиты[Индекс]);
		КонецЦикла;
	КонецЕсли;
	
	МультиязычныеРеквизиты = Новый Соответствие;
	СуффиксЯзыка = "";
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		//Если ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		//	МодульМультиязычностьСервер = ОбщийМодуль("МультиязычностьСервер");
		//	СуффиксЯзыка = МодульМультиязычностьСервер.СуффиксЯзыка(КодЯзыка);
		//	Если ЗначениеЗаполнено(СуффиксЯзыка) Тогда
		//		МультиязычныеРеквизиты = МодульМультиязычностьСервер.МультиязычныеРеквизитыОбъекта(Ссылка);
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	// Приведение реквизитов к единому формату.
	СтруктураПолей = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ, СокрЛП(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого Реквизит Из Реквизиты Цикл
			Реквизит = СокрЛП(Реквизит);
			Попытка
				ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
				СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
			Исключение 
				// Если псевдоним не является ключом.
				
				// Поиск ошибки доступности полей.
				Результат = ПроверитьСуществованиеРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Реквизиты);
				Если Результат.Ошибка Тогда 
					ВызватьИсключение(ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Неверный второй параметр %1 в функции %2: %3';
							|en = 'Invalid value of the %1 parameter, function %2: %3.'"),
						"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта", Результат.ОписаниеОшибки));//,
						//КатегорияОшибки.ОшибкаКонфигурации);
				КонецЕсли;
				
				// Не удалось распознать ошибку, проброс первичной ошибки.
				ВызватьИсключение;
			
			КонецПопытки;
		КонецЦикла;
	Иначе
		ВызватьИсключение(ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра %1 в функции %2: %3.';
				|en = 'Invalid type of parameter %1 in function %2: %3.'"), 
			"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта", Строка(ТипЗнч(Реквизиты))))//,
			//КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		Если МультиязычныеРеквизиты[ИмяПоля] <> Неопределено Тогда
			ИмяПоля = ИмяПоля + СуффиксЯзыка;
		КонецЕсли;
		
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если Тип("Структура") = ТипЗнч(Реквизиты)
		Или Тип("ФиксированнаяСтруктура") = ТипЗнч(Реквизиты) Тогда
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из СтруктураПолей Цикл
			ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
			Реквизиты.Добавить(ИмяПоля);
		КонецЦикла;
	КонецЕсли;
	
	РеквизитыЧерезТочку = Новый Массив;
	Для Индекс = -Реквизиты.ВГраница() По 0 Цикл
		ИмяПоля = Реквизиты[-Индекс];
		Если СтрНайти(ИмяПоля, ".") Тогда
			РеквизитыЧерезТочку.Добавить(ИмяПоля);
			Реквизиты.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Реквизиты) Тогда
		ЗначенияРеквизитовОбъекта = ЗначенияРеквизитовОбъектов(ЗначениеВМассиве(Ссылка), Реквизиты, ВыбратьРазрешенные, КодЯзыка)[Ссылка];
		Если ЗначенияРеквизитовОбъекта <> Неопределено Тогда
			Для Каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Если СтрНайти(ИмяПоля, ".") = 0 И ЗначенияРеквизитовОбъекта.Свойство(ИмяПоля) Тогда
					Результат[КлючИЗначение.Ключ] = ЗначенияРеквизитовОбъекта[ИмяПоля];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыЧерезТочку) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Реквизиты = РеквизитыЧерезТочку;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка";
	
	Если Не ВыбратьРазрешенные Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", ""); // @Query-part-1
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		
		// Если реквизиты были переданы строкой, то они уже конвертированы в массив.
		// Если реквизиты - массив, оставляем без изменений.
		// Если реквизиты - структура - конвертируем в массив.
		// В остальных случаях уже было бы выброшено исключение.
		Если Тип("Структура") = ТипЗнч(Реквизиты)
			Или Тип("ФиксированнаяСтруктура") = ТипЗнч(Реквизиты) Тогда
			Реквизиты = Новый Массив;
			Для каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Реквизиты.Добавить(ИмяПоля);
			КонецЦикла;
		КонецЕсли;
		
		// Поиск ошибки доступности полей.
		Результат = ПроверитьСуществованиеРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Реквизиты);
		Если Результат.Ошибка Тогда 
			ВызватьИсключение(ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный второй параметр %1 в функции %2: %3';
					|en = 'Invalid value of the %1 parameter, function %2: %3.'"), 
				"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта", Результат.ОписаниеОшибки));//,
				//КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;

		ВызватьИсключение;
		
	КонецПопытки;
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
// 
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует". 
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//                                Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                                такого реквизита учитываться не будет.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то возвращается Неопределено;
//                                если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение(ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Имя реквизита должно быть заполнено.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|The attribute name cannot be empty.'"), 
			"ИмяРеквизита", "ОбщегоНазначения.ЗначениеРеквизитаОбъекта"))//,
			//КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует". 
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//         - ФиксированныйМассив из ЛюбаяСсылка - ссылки на объекты.
//           Если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                       структуры. Например, "Код, Наименование, Родитель".
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
// 
Функция ЗначенияРеквизитовОбъектов(Ссылки, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Реквизиты = СтрСоединить(Реквизиты, ",");
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты) Тогда 
		ВызватьИсключение(ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Поле объекта должно быть указано.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|The object field must be specified.'"), 
			"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъектов"))//,
			//КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Если СтрНайти(Реквизиты, ".") <> 0 Тогда 
		ВызватьИсключение(ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
				|Обращение через точку не поддерживается.';
				|en = 'Invalid value of the %1 parameter, function %2:
				|Dot syntax is not supported.'"), 
			"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъектов"))//,
			//КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если Ссылки.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		КодЯзыка = СтрРазделить(КодЯзыка, "_", Истина)[0];
	КонецЕсли;
	
	РеквизитыТекстЗапроса = Реквизиты;
	
	//Если ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
	//	МодульМультиязычностьСервер = ОбщийМодуль("МультиязычностьСервер");
	//	Если ЗначениеЗаполнено(КодЯзыка) Тогда
	//		СуффиксЯзыка = МодульМультиязычностьСервер.СуффиксЯзыка(КодЯзыка);
	//		Если ЗначениеЗаполнено(СуффиксЯзыка) Тогда
	//			МультиязычныеРеквизиты = МодульМультиязычностьСервер.МультиязычныеРеквизитыОбъекта(Ссылки[0]);
	//			НаборРеквизитов = СтрРазделить(Реквизиты, ",");
	//			Для Позиция = 0 По НаборРеквизитов.ВГраница() Цикл
	//				ИмяРеквизита = СокрЛП(НаборРеквизитов[Позиция]);
	//				Если МультиязычныеРеквизиты[ИмяРеквизита] <> Неопределено Тогда
	//					ИмяССуффиксом = ИмяРеквизита + СуффиксЯзыка;
	//					НаборРеквизитов[Позиция] = ИмяССуффиксом + " КАК " + ИмяРеквизита;
	//				КонецЕсли;
	//			КонецЦикла;
	//			РеквизитыТекстЗапроса = СтрСоединить(НаборРеквизитов, ",");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	СсылкиПоТипам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Тип = ТипЗнч(Ссылка);
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		ЭлементПоТипу = СсылкиПоТипам[Тип]; // Массив
		ЭлементПоТипу.Добавить(Ссылка);
	КонецЦикла;
	
	ТекстыЗапросов = Новый Массив;
	ПараметрыЗапроса = Новый Структура;
	
	ИменаОбъектовМетаданных = Новый Массив;
	
	Для Каждого СсылкиПоТипу Из СсылкиПоТипам Цикл
		Тип = СсылкиПоТипу.Ключ;
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ВызватьИсключение(ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный первый параметр %1 в функции %2: 
					|Значения массива должны быть ссылками.';
					|en = 'Invalid value of the %1 parameter, function %2:
					|The array values must be of the Ref type.'"), 
				"Ссылки", "ОбщегоНазначения.ЗначенияРеквизитовОбъектов"))//,
				//КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИменаОбъектовМетаданных.Добавить(ПолноеИмяОбъектаМетаданных);
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка,
			|	&Реквизиты
			|ИЗ
			|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
			|ГДЕ
			|	ПсевдонимЗаданнойТаблицы.Ссылка В (&Ссылки)";
		Если Не ВыбратьРазрешенные Или ТекстыЗапросов.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", ""); // @Query-part-1
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты", РеквизитыТекстЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ссылки", "&" + ИмяПараметра); // @Query-part-1
		ПараметрыЗапроса.Вставить(ИмяПараметра, СсылкиПоТипу.Значение);
		
		//Если ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		//	МодульМультиязычностьСервер  = ОбщийМодуль("МультиязычностьСервер");
		//	
		//	Если ЗначениеЗаполнено(КодЯзыка) И КодЯзыка <> КодОсновногоЯзыка()
		//		И МодульМультиязычностьСервер.ОбъектСодержитТЧПредставления(ПолноеИмяОбъектаМетаданных) Тогда
		//		
		//		МультиязычныеРеквизиты = МодульМультиязычностьСервер.МультиязычныеРеквизитыОбъекта(ОбъектМетаданных);
		//		ПоляТаблиц = Новый Массив;
		//		ПоляТаблиц.Добавить("ПсевдонимЗаданнойТаблицы.Ссылка");
		//		Для Каждого Реквизит Из СтрРазделить(Реквизиты, ",") Цикл
		//			Если МультиязычныеРеквизиты[Реквизит] <> Неопределено Тогда
		//				
		//				Если МультиязычныеРеквизиты[Реквизит] = Истина Тогда
		//					ПолеРеквизита = "ЕСТЬNULL(ТаблицаПредставления." + Реквизит + ", """")";
		//				Иначе
		//					СуффиксЯзыка = МодульМультиязычностьСервер.СуффиксЯзыка(КодЯзыка);
		//					ПолеРеквизита = ?(ЗначениеЗаполнено(СуффиксЯзыка), Реквизит + СуффиксЯзыка, Реквизит);
		//				КонецЕсли;
		//				
		//				ПоляТаблиц.Добавить(ПодставитьПараметрыВСтроку("%1 КАК %2",
		//					ПолеРеквизита, Реквизит));
		//			Иначе
		//				ПоляТаблиц.Добавить(Реквизит);
		//			КонецЕсли;
		//			
		//		КонецЦикла;
		//		
		//		ПоляТаблиц = СтрСоединить(ПоляТаблиц, "," + Символы.ПС);
		//		
		//		Таблицы = ПолноеИмяОбъектаМетаданных + " " + "КАК ПсевдонимЗаданнойТаблицы" + Символы.ПС
		//			+ "ЛЕВОЕ СОЕДИНЕНИЕ" + " " + ПолноеИмяОбъектаМетаданных + ".Представления КАК ТаблицаПредставления" + Символы.ПС
		//			+ "ПО ТаблицаПредставления.Ссылка = ПсевдонимЗаданнойТаблицы.Ссылка И ТаблицаПредставления.КодЯзыка = &КодЯзыка";
		//			
		//		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		//		Условия = "ПсевдонимЗаданнойТаблицы.Ссылка В (&" + ИмяПараметра + ")";
		//		
		//		СтрокиЗапроса = Новый Массив;
		//		СтрокиЗапроса.Добавить("ВЫБРАТЬ" + ?(ВыбратьРазрешенные И Не ЗначениеЗаполнено(ТекстыЗапросов), " " + "РАЗРЕШЕННЫЕ", "")); // @Query-part-1, @Query-part-3
		//		СтрокиЗапроса.Добавить(ПоляТаблиц);
		//		СтрокиЗапроса.Добавить("ИЗ"); // @Query-part-1
		//		СтрокиЗапроса.Добавить(Таблицы);
		//		СтрокиЗапроса.Добавить("ГДЕ"); // @Query-part-1
		//		СтрокиЗапроса.Добавить(Условия);
		//		
		//		ТекстЗапроса = СтрСоединить(СтрокиЗапроса, Символы.ПС);
		//	КонецЕсли;
		//КонецЕсли;
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		
		// Удаление пробелов.
		Реквизиты = СтрЗаменить(Реквизиты, " ", "");
		// Преобразование параметра в массив полей.
		Реквизиты = СтрРазделить(Реквизиты, ",");
		
		// Поиск ошибки доступности полей.
		СписокОшибок = Новый Массив;
		Для Каждого ПолноеИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
			Результат = ПроверитьСуществованиеРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Реквизиты);
			Если Результат.Ошибка Тогда 
				СписокОшибок.Добавить(Результат.ОписаниеОшибки);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокОшибок) Тогда
			ВызватьИсключение(ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный второй параметр %1 в функции %2: %3';
					|en = 'Invalid value of the %1 parameter, function %2: %3'"), 
				"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъектов", 
				СтрСоединить(СписокОшибок, Символы.ПС)))//,
				//КатегорияОшибки.ОшибкаКонфигурации);
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
		
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
// 
// Если передано имя несуществующего реквизита, то вызывается исключение "Поле объекта не существует". 
//
// Параметры:
//  МассивСсылок       - Массив из ЛюбаяСсылка
//                     - ФиксированныйМассив из ЛюбаяСсылка
//  ИмяРеквизита       - Строка - например, "Код".
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//  КодЯзыка - Строка - код языка для мультиязычного реквизита. Значение по умолчанию - основной язык конфигурации.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//      * Ключ     - ЛюбаяСсылка  - ссылка на объект,
//      * Значение - Произвольный - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение(ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный второй параметр %1 в функции %2: 
			|Имя реквизита должно быть заполнено.';
			|en = 'Invalid value of the %1 parameter, function %2:
			|The attribute name cannot be empty.'"), 
			"ИмяРеквизита", "ОбщегоНазначения.ЗначениеРеквизитаОбъектов"))//,
			//КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	Для каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Добавляет или изменяет значение реквизита в объекте.
//
// Если передано имя несуществующего реквизита, то вызывается исключение. 
//
// Параметры:
//  Объект - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - РегистрСведенийЗапись - заполняемый объект.
//  ИмяРеквизита - Строка - имя заполняемого реквизита. Например, "Комментарий"
//  Значение - Строка - значение помещаемое в реквизит.
//  КодЯзыка - Строка - код языка реквизита. Например, "ru".
//
Процедура УстановитьЗначениеРеквизита(Объект, ИмяРеквизита, Значение, КодЯзыка = Неопределено) Экспорт
	УстановитьЗначенияРеквизитов(Объект, Новый Структура(ИмяРеквизита, Значение), КодЯзыка);
КонецПроцедуры

// Добавляет или изменяет значения реквизитов в объекте.
//
// Если передано имя несуществующего реквизита, то вызывается исключение. 
//
// Параметры:
//  Объект - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - РегистрСведенийЗапись - заполняемый объект.
//  Значения - Структура - где ключ это имя реквизита, а значение содержит строку помещаемую в реквизит.
//  КодЯзыка - Строка - код языка реквизита. Например, "ru".
//
Процедура УстановитьЗначенияРеквизитов(Объект, Значения, КодЯзыка = Неопределено) Экспорт
	
	//Если ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
	//	МодульМультиязычностьСервер = ОбщийМодуль("МультиязычностьСервер");
	//	МодульМультиязычностьСервер.УстановитьЗначенияРеквизитов(Объект, Значения, КодЯзыка);
	//	Возврат;
	//КонецЕсли;
	
	Для Каждого ЗначениеРеквизита Из Значения Цикл
		Значение = ЗначениеРеквизита.Значение;
		Если ТипЗнч(Значение) = Тип("Строка") И СтрокаВВидеНСтр(Значение) Тогда
			Значение = НСтр(ЗначениеРеквизита.Значение);
		КонецЕсли;
		Объект[ЗначениеРеквизита.Ключ] = Значение;
	КонецЦикла;
	
КонецПроцедуры


// Возвращает ссылку предопределенного элемента по его полному имени.
// Предопределенные элементы могут содержаться только в следующих объектах:
//   - справочники;
//   - планы видов характеристик;
//   - планы счетов;
//   - планы видов расчета.
// После изменения состава предопределенных следует выполнить метод
// ОбновитьПовторноИспользуемыеЗначения(), который сбросит кэш ПовтИсп в текущем сеансе.
//
// Параметры:
//   ПолноеИмяПредопределенного - Строка - полный путь к предопределенному элементу, включая его имя.
//     Формат аналогичен функции глобального контекста ПредопределенноеЗначение().
//     Например:
//       "Справочник.ВидыКонтактнойИнформации.EmailПользователя"
//       "ПланСчетов.Хозрасчетный.Материалы"
//       "ПланВидовРасчета.Начисления.ОплатаПоОкладу".
//
// Возвращаемое значение: 
//   ЛюбаяСсылка - ссылка на предопределенный элемент.
//   Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
	
	//СтандартнаяОбработка = ЛОЖЬ;//ОбщегоНазначенияСлужебныйКлиентСервер.ИспользоватьСтандартнуюФункциюПолученияПредопределенного(
	//	//ПолноеИмяПредопределенного);
	//
	//Если СтандартнаяОбработка Тогда 
	//	Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	//КонецЕсли;
	//
	//ПоляПредопределенного = ОбщегоНазначенияСлужебныйКлиентСервер.ИмяПредопределенногоПоПолям(ПолноеИмяПредопределенного);
	//
	//ПредопределенныеЗначения = СтандартныеПодсистемыПовтИсп.СсылкиПоИменамПредопределенных(
	//	ПоляПредопределенного.ПолноеИмяОбъектаМетаданных);
	//
	//Возврат ОбщегоНазначенияСлужебныйКлиентСервер.ПредопределенныйЭлемент(
	//	ПолноеИмяПредопределенного, ПоляПредопределенного, ПредопределенныеЗначения);
	
КонецФункции

// Возвращает информацию о том, являются ли переданные элементы предопределенными.
// Если нет прав доступа на уровне записей, то элемент не включается в результат.
// Если нет прав доступа к таблице, то вызывается исключение.
// 
// Параметры:
//  Элементы - Массив из ЛюбаяСсылка
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект.
//   * Значение - Булево - Истина, если это ссылка на предопределенный элемент.
//
Функция ЭтоПредопределенныеЭлементы(Знач Элементы) Экспорт
	
	//ИменаРеквизитов = Новый Массив;
	//Для каждого ИмяРеквизита Из СтандартныеПодсистемыСервер.РеквизитыПредопределенныхДанных() Цикл
	//	ИменаРеквизитов.Добавить(ИмяРеквизита.Ключ);
	//КонецЦикла;
	//
	//ЗначенияРеквизитов = СтандартныеПодсистемыСервер.ЗначенияРеквизитовОбъектовЕслиСуществуют(Элементы, ИменаРеквизитов);
	//Результат = Новый Соответствие;
	//Для каждого Элемент Из ЗначенияРеквизитов Цикл
	//	ЭтоПредопределенныйЭлемент = Ложь;
	//	Для каждого Значение Из Элемент.Значение Цикл
	//		Если ЗначениеЗаполнено(Значение.Значение) Тогда
	//			ЭтоПредопределенныйЭлемент = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Результат[Элемент.Ключ] = ЭтоПредопределенныйЭлемент;
	//КонецЦикла;
	//Возврат Результат;	
	
КонецФункции

Функция ПроверитьСуществованиеРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, ПроверяемыеВыражения)
	
	МетаданныеОбъекта = ОбъектМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Если МетаданныеОбъекта = Неопределено Тогда 
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, 
			ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Несуществующий объект метаданных ""%1"".';
					|en = 'Non-existing metadata object: ""%1"".'"), ПолноеИмяОбъектаМетаданных));
	КонецЕсли;

	// Разрешение вызова из безопасного режима внешней обработки или расширения.
	// Информация о доступности полей источника схемы при проверке метаданных не является секретной.
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Схема = Новый СхемаЗапроса;
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Оператор = Пакет.Операторы.Получить(0);
	
	Источник = Оператор.Источники.Добавить(ПолноеИмяОбъектаМетаданных, "Таблица");
	ТекстОшибки = "";
	
	Для Каждого ТекущееВыражение Из ПроверяемыеВыражения Цикл
		
		Если Не ПолеИсточникаСхемыЗапросаДоступно(Источник, ТекущееВыражение) Тогда 
			ТекстОшибки = ТекстОшибки + Символы.ПС + ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Поле объекта ""%1"" не существует.';
					|en = 'The ""%1"" object field does not exist.'"), ТекущееВыражение);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", Не ПустаяСтрока(ТекстОшибки), ТекстОшибки);
	
КонецФункции

// Используется в ПроверитьСуществованиеРеквизитовОбъекта.
// Выполняет проверку доступности поля проверяемого выражения в источнике оператора схемы запроса.
//
Функция ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора, ПроверяемоеВыражение)
	
	ЧастиИмениПоля = СтрРазделить(ПроверяемоеВыражение, ".");
	ДоступныеПоля = ИсточникОператора.Источник.ДоступныеПоля;
	
	ТекущаяЧастьИмениПоля = 0;
	Пока ТекущаяЧастьИмениПоля < ЧастиИмениПоля.Количество() Цикл 
		
		ТекущееПоле = ДоступныеПоля.Найти(ЧастиИмениПоля.Получить(ТекущаяЧастьИмениПоля)); 
		
		Если ТекущееПоле = Неопределено Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		// Инкрементация следующей части имени поля и соответствующего списка доступности полей.
		ТекущаяЧастьИмениПоля = ТекущаяЧастьИмениПоля + 1;
		ДоступныеПоля = ТекущееПоле.Поля;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Возвращает ОбъектМетаданных, быстро найденный по полному имени.
// Более производительный аналог метода платформы Метаданные.НайтиПоПолномуИмени
// для корневых объектов метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, например, Справочник.Организации
//
// Возвращаемое значение:
//  ОбъектМетаданных - когда найден
//  Неопределено - когда не найден
//
Функция ОбъектМетаданныхПоПолномуИмени(ПолноеИмя) Экспорт
	
	ПозицияТочки = СтрНайти(ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(ПолноеИмя, ПозицияТочки - 1);
	
	ИменаКоллекций = ИменаКоллекцийПоИменамБазовыхТипов();
	Коллекция = ИменаКоллекций.Получить(ВРег(ИмяБазовогоТипа));
	
	Если Коллекция <> Неопределено Тогда
		Если Коллекция <> "Подсистемы" Тогда
			ИмяОбъекта = Сред(ПолноеИмя, ПозицияТочки + 1);
			ОбъектМетаданных = Метаданные[Коллекция].Найти(ИмяОбъекта);
		Иначе
			ИменаПодсистем = СтрРазделить(ВРег(ПолноеИмя), ".");
			Количество = ИменаПодсистем.Количество();
			Подсистема = Метаданные;
			ОбъектМетаданных = Неопределено;
			Индекс = 0;
			Пока Истина Цикл
				Индекс = Индекс + 1;
				Если Индекс >= Количество Тогда
					Прервать;
				КонецЕсли;
				ИмяПодсистемы = ИменаПодсистем[Индекс];
				Подсистема = Подсистема.Подсистемы.Найти(ИмяПодсистемы);
				Если Подсистема = Неопределено Тогда
					Прервать;
				КонецЕсли;
				Индекс = Индекс + 1;
				Если Индекс = Количество Тогда
					ОбъектМетаданных = Подсистема;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции


Функция ИменаКоллекцийПоИменамБазовыхТипов() Экспорт
	
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить(ВРег("Подсистема"), "Подсистемы");
	ИменаКоллекций.Вставить(ВРег("ОбщийМодуль"), "ОбщиеМодули");
	ИменаКоллекций.Вставить(ВРег("ПараметрСеанса"), "ПараметрыСеанса");
	ИменаКоллекций.Вставить(ВРег("Роль"), "Роли");
	ИменаКоллекций.Вставить(ВРег("ОбщийРеквизит"), "ОбщиеРеквизиты");
	ИменаКоллекций.Вставить(ВРег("ПланОбмена"), "ПланыОбмена");
	ИменаКоллекций.Вставить(ВРег("КритерийОтбора"), "КритерииОтбора");
	ИменаКоллекций.Вставить(ВРег("ПодпискаНаСобытие"), "ПодпискиНаСобытия");
	ИменаКоллекций.Вставить(ВРег("РегламентноеЗадание"), "РегламентныеЗадания");
	ИменаКоллекций.Вставить(ВРег("ФункциональнаяОпция"), "ФункциональныеОпции");
	ИменаКоллекций.Вставить(ВРег("ПараметрФункциональныхОпций"), "ПараметрыФункциональныхОпций");
	ИменаКоллекций.Вставить(ВРег("ОпределяемыйТип"), "ОпределяемыеТипы");
	ИменаКоллекций.Вставить(ВРег("ХранилищеНастроек"), "ХранилищаНастроек");
	ИменаКоллекций.Вставить(ВРег("ОбщаяФорма"), "ОбщиеФормы");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКоманда"), "ОбщиеКоманды");
	ИменаКоллекций.Вставить(ВРег("ГруппаКоманд"), "ГруппыКоманд");
	ИменаКоллекций.Вставить(ВРег("ОбщийМакет"), "ОбщиеМакеты");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКартинка"), "ОбщиеКартинки");
	ИменаКоллекций.Вставить(ВРег("ПакетXDTO"), "ПакетыXDTO");
	ИменаКоллекций.Вставить(ВРег("WebСервис"), "WebСервисы");
	ИменаКоллекций.Вставить(ВРег("HTTPСервис"), "HTTPСервисы");
	ИменаКоллекций.Вставить(ВРег("WSСсылка"), "WSСсылки");
	ИменаКоллекций.Вставить(ВРег("СервисИнтеграции"), "СервисыИнтеграции");
	ИменаКоллекций.Вставить(ВРег("ЭлементСтиля"), "ЭлементыСтиля");
	ИменаКоллекций.Вставить(ВРег("Стиль"), "Стили");
	ИменаКоллекций.Вставить(ВРег("Язык"), "Языки");
	ИменаКоллекций.Вставить(ВРег("Константа"), "Константы");
	ИменаКоллекций.Вставить(ВРег("Справочник"), "Справочники");
	ИменаКоллекций.Вставить(ВРег("Документ"), "Документы");
	ИменаКоллекций.Вставить(ВРег("Последовательность"), "Последовательности");
	ИменаКоллекций.Вставить(ВРег("ЖурналДокументов"), "ЖурналыДокументов");
	ИменаКоллекций.Вставить(ВРег("Перечисление"), "Перечисления");
	ИменаКоллекций.Вставить(ВРег("Отчет"), "Отчеты");
	ИменаКоллекций.Вставить(ВРег("Обработка"), "Обработки");
	ИменаКоллекций.Вставить(ВРег("ПланВидовХарактеристик"), "ПланыВидовХарактеристик");
	ИменаКоллекций.Вставить(ВРег("ПланСчетов"), "ПланыСчетов");
	ИменаКоллекций.Вставить(ВРег("ПланВидовРасчета"), "ПланыВидовРасчета");
	ИменаКоллекций.Вставить(ВРег("РегистрСведений"), "РегистрыСведений");
	ИменаКоллекций.Вставить(ВРег("РегистрНакопления"), "РегистрыНакопления");
	ИменаКоллекций.Вставить(ВРег("РегистрБухгалтерии"), "РегистрыБухгалтерии");
	ИменаКоллекций.Вставить(ВРег("РегистрРасчета"), "РегистрыРасчета");
	ИменаКоллекций.Вставить(ВРег("БизнесПроцесс"), "БизнесПроцессы");
	ИменаКоллекций.Вставить(ВРег("Задача"), "Задачи");
	ИменаКоллекций.Вставить(ВРег("ВнешниеИсточникиДанных"), "ВнешнийИсточникДанных");
	
	Возврат Новый ФиксированноеСоответствие(ИменаКоллекций);
	
КонецФункции



Функция ЗначениеВМассиве(Знач Значение) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
	
КонецФункции

Функция СтрокаВВидеНСтр(Знач ПроверяемаяСтрока) Экспорт
	
	ПроверяемаяСтрока = СтрЗаменить(ПроверяемаяСтрока, " ", "");
	
	ВариантыСовпадений = Новый Массив;
	Для каждого Язык Из Метаданные.Языки Цикл
		ВариантыСовпадений.Добавить(Язык.КодЯзыка + "=");
	КонецЦикла;
	
	Для каждого ВариантСовпадения Из ВариантыСовпадений Цикл
		Если СтрНайти(ПроверяемаяСтрока, ВариантСовпадения) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти

#Область Строковые
// Разбивает строку на несколько строк по указанному разделителю. Разделитель может иметь любую длину.
// В случаях, когда разделителем является строка из одного символа, и не используется параметр СокращатьНепечатаемыеСимволы,
// рекомендуется использовать функцию платформы СтрРазделить.
//
// Параметры:
//  Значение               - Строка - текст с разделителями.
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ.
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     > для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат;
//     > если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив из Строка
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",")
//  - возвратит массив из 5 элементов, три из которых  - пустые: "", "один", "", "два", "";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина)
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(" один   два  ", " ")
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("")
//  - возвратит пустой массив;
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("",,Ложь)
//  - возвратит массив с одним элементом: ""(пустая строка);
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("", " ")
//  - возвратит массив с одним элементом: "" (пустая строка).
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Если СтрДлина(Разделитель) = 1 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СтрРазделить(Значение, Разделитель, Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей. Если параметр не указан, то 
//                             разделителем считаются все символы, не являющиеся цифрами, 
//                             латинскими и кириллическими буквами, а также знаком подчеркивания.
//
// Возвращаемое значение:
//  Булево - Истина, если символ с кодом КодСимвола является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат СтрНайти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
		
	Диапазоны = Новый Массив;
	//СтроковыеФункцииКлиентСерверЛокализация.ПриОпределенииСимволовСлов(Диапазоны);
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 	// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 	// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 	// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 	// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов, 
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Значение        - Строка - исходная строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - перечень символов-разделителей. Например, ".,;".
//
// Возвращаемое значение:
//  Массив - список слов.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три") возвратит массив значений: "один",
//  "два2_", "три"; СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив
//  значений: "один-", "два2", "три".
//
Функция РазложитьСтрокуВМассивСлов(Знач Значение, РазделителиСлов = Неопределено) Экспорт
	
	Слова = Новый Массив;
	
	РазмерТекста = СтрДлина(Значение);
	НачалоСлова = 1;
	Для Позиция = 1 По РазмерТекста Цикл
		КодСимвола = КодСимвола(Значение, Позиция);
		Если ЭтоРазделительСлов(КодСимвола, РазделителиСлов) Тогда
			Если Позиция <> НачалоСлова Тогда
				Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
			КонецЕсли;
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Позиция <> НачалоСлова Тогда
		Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>", 
//                           например "%1 пошел в %2");
//  Параметр1   - Строка - значение подставляемого параметра.
//  Параметр2   - Строка
//  Параметр3   - Строка
//  Параметр4   - Строка
//  Параметр5   - Строка
//  Параметр6   - Строка
//  Параметр7   - Строка
//  Параметр8   - Строка
//  Параметр9   - Строка
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел
//  в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом = СтрНайти(Параметр1, "%")
		Или СтрНайти(Параметр2, "%")
		Или СтрНайти(Параметр3, "%")
		Или СтрНайти(Параметр4, "%")
		Или СтрНайти(Параметр5, "%")
		Или СтрНайти(Параметр6, "%")
		Или СтрНайти(Параметр7, "%")
		Или СтрНайти(Параметр8, "%")
		Или СтрНайти(Параметр9, "%");
		
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	КонецЕсли;
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	Возврат ШаблонСтроки;
	
КонецФункции

Функция ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = СтрНайти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = Неопределено;
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр = Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр = Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр = Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр = Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр = Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр = Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр = Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр = Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр = Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = Неопределено Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = СтрНайти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

Функция НайтиПоКоду(Мета,Имя,Код) Экспорт
	
	Возврат Вычислить(Мета+"."+Имя+".НайтиПоКоду("+Код+")");
КонецФункции	

Функция СтрахователиПоНаименованию(Наименование) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФизическиеЛица.Ссылка КАК Ссылка,
	               |	ФизическиеЛица.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	(ФизическиеЛица.Наименование ПОДОБНО &Наименование
				   |     ИЛИ ФизическиеЛица.КлючПоиска ПОДОБНО &КлючПоиска )
	               |			//ИЛИ ФизическиеЛица.Наименование ПОДОБНО &Перевод)
	               |	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
				   |	И ПометкаУдаления = Ложь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка,
	               |	ПометкаУдаления
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ЛОЖЬ
				   |	И ПометкаУдаления = Ложь
	               |	И (Контрагенты.Наименование ПОДОБНО &Наименование
	               |			ИЛИ Контрагенты.ИНН ПОДОБНО &Наименование
	               |			ИЛИ ПОДСТРОКА(Контрагенты.НаименованиеПолное, 1, 255) ПОДОБНО &Наименование)
	               |			//ИЛИ Контрагенты.Наименование ПОДОБНО &Перевод
	               |		//	ИЛИ ПОДСТРОКА(Контрагенты.НаименованиеПолное, 1, 255) ПОДОБНО &Перевод)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование","%"+Наименование+"%");
	Запрос.УстановитьПараметр("Перевод","%"+уб_Фильтры.ПеревестиСтроку(Наименование)+"%");
	Запрос.УстановитьПараметр("КлючПоиска",уб_ВызовСервера.КлючПоискаНаименования(Наименование)+"%");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	



Функция ЭтоНашСотрудник(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеФизлицПоПодразделениям.Подразделение
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК ДвижениеФизлицПоПодразделениям
	|ГДЕ
	|	ДвижениеФизлицПоПодразделениям.Агент = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать().Количество() = 1;
	
КонецФункции

Функция ПечатьВнутреннихМакетов(Ссылка,Кнопка,Параметры) экспорт
	Объект = Ссылка.ПолучитьОбъект();
	
	//Объект = Форма.РеквизитФормыВЗначение("Объект");
	
	Попытка
		ТабличныйДокумент = Объект.ПечатьМакетов(Кнопка,Параметры);
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Форма не напечатана! " + Кнопка + " " + ОписаниеОшибки(),,Истина)
	КонецПопытки;
	
	Адрес = ПоместитьВоВременноеХранилище(ТабличныйДокумент,Новый УникальныйИдентификатор);
	Возврат Адрес	
	
КонецФункции

Функция ПечатьВнешнейФормы(Ссылка,КодФормы,Параметры) Экспорт
	
	
	СсылкаНаВнешнююОбработку = Справочники.ВнешниеОбработки.НайтиПоКоду(КодФормы);
	Если СсылкаНаВнешнююОбработку.Пустая() = ЛОЖЬ Тогда
		СтруктураПечати  = Новый Структура("СсылкаНаВнешнююОбработку,НомерСтроки",СсылкаНаВнешнююОбработку,1);
		ТабДокумент = НапечататьВнешнююФорму(Ссылка, СтруктураПечати,Параметры);
		Возврат ТабДокумент
	Иначе
		СсылкаНаВнешнююОбработку = Справочники.уб_ПечатныеФормы.НайтиПоКоду(КодФормы);
		
		//
	КонецЕсли;
КонецФункции	


Функция НапечататьВнешнююФорму(Ссылка, ИсточникМакета, Параметры = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.Принадлежность[ИсточникМакета.НомерСтроки - 1].ХранилищеВнешнейОбработки.Получить();
	// Получить дополнительные параметры внешней обработки
	ДополнительныеПараметры = ИсточникМакета.СсылкаНаВнешнююОбработку.Принадлежность[ИсточникМакета.НомерСтроки - 1].ДополнительныеПараметрыОбработки.Получить();
	ИсточникМакета.Свойство("ДополнительныеПараметрыОбработки", ДополнительныеПараметры);
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ИсточникМакета.СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТабДокумент = Неопределено;	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = Ссылка;
		// Передать внешней обработке дополнительные параметры
		Если ДополнительныеПараметры <> Неопределено Тогда			
			// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение
			Если Не Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
				Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
			КонецЕсли;			
		КонецЕсли;		
		Если Параметры = Неопределено Тогда
			ТабДокумент = Обработка.Печать()
		Иначе
			ТабДокумент = Обработка.Печать(Параметры)
		КонецЕсли;
		//перенес ниже, так как при вызове исключения не удалится временный файл
		//УдалитьФайлы(ИмяФайла);
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось сформировать внешнюю печатную форму. " + ОписаниеОшибки());
	КонецПопытки;
	Если Обработка <> Неопределено Тогда
		Попытка
			УдалитьФайлы(ИмяФайла)
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат ТабДокумент
	
КонецФункции


Функция ПолучитьСписокМарок(ТекстПоиска) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_МаркиТС.Ссылка,
	               |	уб_МаркиТС.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.уб_МаркиТС КАК уб_МаркиТС
	               |ГДЕ
	               |	уб_МаркиТС.Неактуальная = ЛОЖЬ
	               |	И уб_МаркиТС.ПометкаУдаления = ЛОЖЬ
	               |	И уб_МаркиТС.Наименование ПОДОБНО &Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	Запрос.УстановитьПараметр("Наименование","%"+ТекстПоиска+"%");
	СписокМарок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокМарок.Добавить(Новый Структура("Значение,Представление",Выборка.Ссылка,Выборка.Наименование));
	КонецЦикла;	
	
	Возврат СписокМарок

КонецФункции	


Функция JSON(Данные) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();
КонецФункции	

Функция JSONВСтруктуру(JSONСтрокой) Экспорт 
ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрокой);
	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON,Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
		Данные = Новый Структура;
	КонецПопытки;	
	Возврат Данные ;
КонецФункции




Функция ДобавитьФайлКЗаявке(Документ,СтруктураЗаполнения  = Неопределено,Хранилище = Неопределено)   Экспорт
//	Сообщить("Отладка 5");
	Если Хранилище = Неопределено Тогда
		Хранилище = Справочники.уб_ХранилищаФайловБ2Б.ЗаявкаНаПечать;
	КонецЕсли;	
	
	Добавлено = Ложь;
	Попытка
		Страхователь = Документ.Страхователь;
	Исключение
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.уб_ОтчетПоставщику") Тогда
			Страхователь	 = Документ.Поставщик;
		Иначе
			Страхователь = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;	
	КонецПопытки;
	Попытка
		ОбъектСтрахования = Документ.ОбъектСтрахования;	
	Исключение
		ОбъектСтрахования = Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
	КонецПопытки;
	
	ТЗФайлов = Новый ТаблицаЗначений;
	ТЗФайлов.Колонки.Добавить("Справочник");
	ТЗФайлов.Колонки.Добавить("ВидФайлаB2B");
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(СтруктураЗаполнения.ПолноеИмяФайла);
	
	Сч = 0;
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	
	ВидДокумента = СтруктураЗаполнения.ВидДокумента;
	
	Для Каждого Строка Из МассивФайлов Цикл 
		ПолноеИмяФайла = Строка;
		Сч = Сч +1;
		Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда 
			Продолжить;
		КонецЕсли;
		
		оФайлОткуда = Новый Файл(ПолноеИмяФайла);
		Если СтруктураЗаполнения.Свойство("ИмяВременногоФайла") Тогда
			Если СтруктураЗаполнения.Свойство("ФайлИмя") Тогда
				ИмяИсходящегоФайла             = СтруктураЗаполнения.ФайлИмя;
				ИмяКонечногоФайлаБезРасширения = СтрЗаменить(СтруктураЗаполнения.ФайлИмя,СтруктураЗаполнения.ФайлРасширение,"");
			Иначе
				ИмяИсходящегоФайла             = СтрЗаменить(уб_temp.УбратьСимволы(СокрЛП(Документ.Номер)), Символ(160), "") + "_" + оФайлОткуда.Имя;
				ИмяКонечногоФайлаБезРасширения = оФайлОткуда.ИмяБезРасширения;
			КонецЕсли;	
		Иначе	
			ИмяИсходящегоФайла             = СтрЗаменить(уб_temp.УбратьСимволы(СокрЛП(Документ.Номер)), Символ(160), "") + "_" + оФайлОткуда.Имя;
			ИмяКонечногоФайлаБезРасширения = оФайлОткуда.ИмяБезРасширения;
		КонецЕсли;	
		
		
		Если какСправочник = Истина Тогда 
			//проверем наличие
			мЗапрос = Новый Запрос;
			мЗапрос.Текст = "ВЫБРАТЬ
			|	уб_ФайлыКПолисам.Ссылка,
			|	уб_ФайлыКПолисам.ВидФайлаB2B
			|ИЗ
			|	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	уб_ФайлыКПолисам.ФайлРазмер = &ФайлРазмер
			|	И уб_ФайлыКПолисам.ФайлРасширение = &ФайлРасширение
			|	И уб_ФайлыКПолисам.Страхователь = &Страхователь";
			мЗапрос.УстановитьПараметр("Страхователь", Страхователь);
			мЗапрос.УстановитьПараметр("ФайлРазмер", оФайлОткуда.Размер());
			мЗапрос.УстановитьПараметр("ФайлРасширение", Сред(оФайлОткуда.Расширение, 2));
			
			Результат = мЗапрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда 
				Запись = Результат.Ссылка;
				мВидФайлаB2B = Результат.ВидФайлаB2B;
			Иначе 
				
				мВидФайлаB2B = ВидДокумента.ВидФайлаB2B;
				// получить путь новой папки файла
				Если ТипЗнч(Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
					НаименованиеСтрахователя = Страхователь.folder;
				ИначеЕсли ТипЗнч(Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
					НаименованиеСтрахователя = ОбщегоНазначения.ФИО_ФизЛица(Страхователь.Наименование, , , , Истина);
				Иначе
					НаименованиеСтрахователя = "НЕИЗВЕСТНЫЙ_СТРАХОВАТЕЛЬ";
				КонецЕсли;
				КлПапка = уб_temp.УбратьСимволы(НаименованиеСтрахователя);
				
				Если мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.ФОТО Тогда 
					КатНазнач = Справочники.уб_ХранилищаФайловБ2Б.FOTO.Путь + "\" + КлПапка;
					Хранилище = Справочники.уб_ХранилищаФайловБ2Б.FOTO;
				Иначе
					КлПапка = КлПапка + ?(мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.БСО_ДОК,"", "\" + мВидФайлаB2B);
					КатНазнач = Справочники.уб_ХранилищаФайловБ2Б.DOC.Путь + "\" + КлПапка;
					Хранилище = Справочники.уб_ХранилищаФайловБ2Б.DOC; 
				КонецЕсли;
				
				оКаталогКуда = Новый Файл(КатНазнач);
				ИмяКонечногоФайлаБезРасширения = ?(ЭтоИзображение(оФайлОткуда.Расширение), КлПапка, ИмяКонечногоФайлаБезРасширения) 
				+ ?(Не ЗначениеЗаполнено(ВидДокумента), "", "_[" + Строка(ВидДокумента) + "]_"+Сч+"");	
				ИмяКонечногоФайлаБезРасширения = уб_temp.УбратьЗапрещенныеСимволыИзИмениФайла(ИмяКонечногоФайлаБезРасширения);
				
				оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения + оФайлОткуда.Расширение);
				
				Если НЕ оФайлКуда.Существует() Тогда
					оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"2"+ оФайлОткуда.Расширение);
					Если НЕ оФайлКуда.Существует() Тогда
						оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"3"+ оФайлОткуда.Расширение);
						Если НЕ оФайлКуда.Существует() Тогда
							оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"4"+ оФайлОткуда.Расширение);
							Если НЕ оФайлКуда.Существует() Тогда
								оФайлКуда = Новый Файл(КатНазнач + "\" + ИмяКонечногоФайлаБезРасширения+"5"+ оФайлОткуда.Расширение);
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
				
				
				Если НЕ оКаталогКуда.Существует() Тогда
					уб_Серверные._СоздатьКаталог(КатНазнач);
				КонецЕсли;
				
				
				уб_серверные._КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
				
				Запись = Справочники.уб_ФайлыКПолисам.СоздатьЭлемент();
				Запись.Наименование = ИмяИсходящегоФайла;
				Запись.ФайлИмя = ИмяИсходящегоФайла;
				
				//Путь к папке без хранилища
				Запись.ПутьКПапке = КлПапка;
				Запись.Хранилище = Хранилище.Ссылка;
				Запись.Страхователь = Страхователь;
				Запись.ВидДокумента = ВидДокумента;
				Запись.ВидФайлаB2B = мВидФайлаB2B;
				Если Запись.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда
					Запись.Опубликован = Истина;
				КонецЕсли;
				Запись.ФайлРазмер = оФайлКуда.Размер();
				Запись.ФайлРасширение = НРег(Прав(оФайлКуда.Расширение, СтрДлина(оФайлКуда.Расширение)-1));
				Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
				Запись.ДатаПубликации = ТекущаяДата();
				Запись.ОбъектСтрахования = ОбъектСтрахования;
				Запись.ОбменДанными.Загрузка = ИСТИНА;
				Запись.УстановитьНовыйКод();
				Попытка
					Запись.Записать();
					Добавлено = Истина;
				Исключение
					Сообщить(ОписаниеОшибки());
					Возврат Добавлено;
				КонецПопытки;
				Запись.ОбменДанными.Загрузка = ЛОЖЬ;
				
			КонецЕсли;
			нСтрока = ТЗФайлов.Добавить();
			нСтрока.Справочник = Запись.Ссылка;
			нСтрока.ВидФайлаB2B = мВидФайлаB2B;
		Иначе
			//Регистр
			
			//Запрос = Новый Запрос(
			//"ВЫБРАТЬ
			//|	Ф.СтраховойПолис,
			//|	Ф.УИД,
			//|	Ф.СК,
			//|	Ф.ВидБСО,
			//|	Ф.НомерБСО
			//|ИЗ
			//|	РегистрСведений.уб_ФайлыКПолисам КАК Ф
			//|ГДЕ
			//|	Ф.СтраховойПолис = &Ссылка
			//|	И Ф.ФайлИмя = &ИмяИсходящегоФайла");
			//Запрос.УстановитьПараметр("Ссылка",				Ссылка);
			//Запрос.УстановитьПараметр("ИмяИсходящегоФайла", ИмяИсходящегоФайла);
			//РезультатЗапроса = Запрос.Выполнить();
			//Если Не РезультатЗапроса.Пустой() Тогда
			//	Выборка = РезультатЗапроса.Выбрать();
			//	Пока Выборка.Следующий() Цикл
			//		Запись = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
			//		ЗаполнитьЗначенияСвойств(Запись, Выборка);
			//		Запись.Прочитать();
			//		Если Запись.Выбран() Тогда
			//			Запись.Удалить();
			//		КонецЕсли;
			//	КонецЦикла;;
			//КонецЕсли;
			мВидФайлаB2B = Перечисления.уб_ВидыФайловB2B.ПРОЧЕЕ;
			Запись = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
			Запись.СтраховойПолис 	= Документ.Ссылка;
			Запись.УИД				= Новый УникальныйИдентификатор;
			//Запись.СК               =
			//Запись.ВидБСО           =
			//Запись.НомерБСО         =
			
			Запись.ПутьКПапке       = Формат(Документ.Дата,"ДФ=yyMM")+"\"+Формат(Документ.Номер,"ЧГ=")+"-"+СокрЛП(уб_B2B.УбратьСимволы(Страхователь));//+++;//+++
			//Запись.ДеньПолиса       =
			Запись.Хранилище       	= Хранилище;
			//Запись.ВидДокумента
			//!!Запись.Размещен
			
			Запись.ФайлРазмер 		= оФайлОткуда.Размер();
			Запись.ФайлРасширение   = оФайлОткуда.Расширение;
			
			КатНазнач = уб_СЛ.ПроверитьИмяКаталога(Хранилище.Путь+"\"+Запись.ПутьКПапке, Истина);
			//ПолноеИмяИсходящегоФайла = КатНазнач + Запись.ФайлИмя;
			
			
			//ИмяКонечногоФайлаБезРасширения = оФайлОткуда.ИмяБезРасширения;	
			
			ИмяКонечногоФайлаБезРасширения = уб_temp.УбратьЗапрещенныеСимволыИзИмениФайла(ИмяКонечногоФайлаБезРасширения);
			
			оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения + оФайлОткуда.Расширение);
			Если оФайлКуда.Существует() Тогда
				оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"2"+ оФайлОткуда.Расширение);
				Если оФайлКуда.Существует() Тогда
					оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"3"+ оФайлОткуда.Расширение);
					Если оФайлКуда.Существует() Тогда
						оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"4"+ оФайлОткуда.Расширение);
						Если оФайлКуда.Существует() Тогда
							оФайлКуда = Новый Файл(КатНазнач  + ИмяКонечногоФайлаБезРасширения+"5"+ оФайлОткуда.Расширение);
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			Запись.ФайлИмя			= оФайлКуда.Имя;

			
			//Запись.Архив            =
			
			Запись.Страхователь		= Страхователь;
			//Запись.Агент            =
			Запись.ВидФайлаB2B      = мВидФайлаB2B;
			Запись.Автор			= ПараметрыСеанса.ТекущийПользователь;
			Запись.ДатаПубликации	= ТекущаяДата();
			
			
			
			//ДопПапка = "\"+Формат(Документ.Дата,"ДФ=yyMM")+"\"+Документ.Номер+"-"+Страхователь;
			//Сообщить(Справочники.уб_ХранилищаФайловБ2Б.ЗаявкаНаПечать.Путь);
			//Сообщить(ДопПапка);
			  КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
			//уб_серверные._КопироватьФайл(ПолноеИмяФайла, оФайлКуда.ПолноеИмя);
			//КопироватьФайл(ПолноеИмяФайла, ПолноеИмяИсходящегоФайла);
			ЗаполнитьЗначенияСвойств(Запись,СтруктураЗаполнения);		
			Запись.Записать();
			Добавлено = Истина;
			нСтрока = ТЗФайлов.Добавить();
			нСтрока.Справочник = Запись.УИД;
			нСтрока.ВидФайлаB2B = мВидФайлаB2B;
			
		КонецЕсли;
	КонецЦикла;
	
	
	
	Для Каждого Стр Из ТЗФайлов Цикл 
		ТЧСтрокаДокумента = Документ.СписокФайлов.Добавить();
		ТЧСтрокаДокумента.ДатаПубликации = ТекущаяДата();
		ТЧСтрокаДокумента.Размещен = ИСТИНА;
		ТЧСтрокаДокумента.СсылкаСправочника = Стр.Справочник;
		Если Стр.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
			ТЧСтрокаДокумента.Опубликован = ИСТИНА;
		КонецЕсли;
		Если НЕ СтруктураЗаполнения  = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТЧСтрокаДокумента,СтруктураЗаполнения);		
		КонецЕсли;
	КонецЦикла;
	Документ.ОбменДанными.Загрузка = ИСТИНА;
	Если НЕ СтруктураЗаполнения  = Неопределено и ВидДокумента.Код = 74 и СтруктураЗаполнения.Свойство("УидСтроки") Тогда
		Для каждого СТрокаБСО из Документ.Бсо.НайтиСтроки(Новый Структура("УидСтроки",СтруктураЗаполнения.УидСтроки)) Цикл
			СТрокаБСО.ЕстьЧек = Истина;
		КонецЦикла;	
	КонецЕсли;
	Попытка
		Документ.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Документ.ОбменДанными.Загрузка = ЛОЖЬ;
	Возврат Добавлено;
КонецФункции

Функция ДобавитьФайлИзВременногоХранилища(АдресФайла,СтруктураЗаполнения) Экспорт
//	Сообщить("Отладка 3");
	ДокументОбъект = СтруктураЗаполнения.СтраховойПолис.ПолучитьОбъект();
	
	ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресФайла);
	Если ТипЗнч(ДанныеИзХранилища) = Тип("ДвоичныеДанные") Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(СтруктураЗаполнения.ФайлРасширение);
		ДанныеИзХранилища.Записать(ИмяВременногоФайла);
		СтруктураЗаполнения.Вставить("ПолноеИмяФайла",ИмяВременногоФайла);
		СтруктураЗаполнения.Вставить("ИмяВременногоФайла",Истина);
	Иначе
		Сообщить("Получены ошибочные данные");
		Возврат Ложь
	КонецЕсли;

	//Сообщить("Отладка 4");	
	
	ДобавитьФайлКЗаявке(ДокументОбъект,СтруктураЗаполнения);
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат Истина
КонецФункции					

Функция ЭтоИзображение(ФайлРасширение) Экспорт
	
	Индекс = 1;
	Для Индекс = 1 По СтрДлина(ФайлРасширение) Цикл
		Если Сред(ФайлРасширение, Индекс, 1) <> "." Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Расширение = Сред(ФайлРасширение, Индекс);
	СписокРасширений = Новый СписокЗначений;
	СписокРасширений.Добавить("bmp");
	СписокРасширений.Добавить("dib");
	СписокРасширений.Добавить("rle");
	СписокРасширений.Добавить("jpg");
	СписокРасширений.Добавить("jpeg");
	СписокРасширений.Добавить("jfif");	
	СписокРасширений.Добавить("tif");
	СписокРасширений.Добавить("gif");
	СписокРасширений.Добавить("png");
	СписокРасширений.Добавить("wmf");
	СписокРасширений.Добавить("emf");
	Возврат СписокРасширений.НайтиПоЗначению(НРег(Расширение)) <> Неопределено;
	
КонецФункции

Функция ИзменениеРазмещенияФайла(ТекущаяСтрока,ИмяКолонки,ДокументСсылка,СтруктураЗаполнения) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("СсылкаСправочника",);
	Если НЕ СтруктураЗаполнения = Неопределено Тогда
		Попытка
			Для каждого Зн из СтруктураЗаполнения Цикл
				Отбор.Вставить(Зн.Ключ,Зн.Значение);		
			КонецЦикла;		
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Документ = ДокументСсылка.ПолучитьОбъект();
    ЕстьИзменения = Ложь;
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	Если ИмяКолонки = "Размещен"  Тогда
		Если ТекущаяСтрока.Размещен тогда
			НоваяСтрока = Документ.СписокФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ДатаПубликации = ТекущаяДата();
			ТекущаяСтрока.ДатаПубликации = НоваяСтрока.ДатаПубликации;
			
			Если какСправочник Тогда
				Если НоваяСтрока.СсылкаСправочника.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					НоваяСтрока.Опубликован = ИСТИНА;
					ТекущаяСтрока.Опубликован = НоваяСтрока.Опубликован;
				КонецЕсли;
				НоваяСтрока.Размещен = ИСТИНА;
				мСпрФайл = НоваяСтрока.СсылкаСправочника.ПолучитьОбъект();
				мСпрФайл.Опубликован = НоваяСтрока.Опубликован;
				Попытка
					мСпрФайл.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
					возврат ЛОЖЬ;
				КонецПопытки;
			КонецЕсли;
			Если НЕ СтруктураЗаполнения = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураЗаполнения);
			КонецЕсли;
		Иначе
			
			ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
			ТекущаяСтрока.ДатаПубликации = Дата(0001,01,01);
			Массив = Документ.СписокФайлов.НайтиСтроки(Отбор);
			Если Массив.Количество()>0 тогда
				Документ.СписокФайлов.Удалить(Массив[0]);
				ЕстьИзменения = Истина;
			КонецЕсли;
			Если какСправочник = Ложь Тогда
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
					КаталогДляЗаявки_ = уб_ВызовСервера.КаталогДляЗаявки_(Документ);
				Иначе
					КаталогДляЗаявки_ = "";	
				КонецЕсли;	
				
				Набор = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
				Набор.Отбор.УИД.Установить(ТекущаяСтрока.СсылкаСправочника);
				Набор.Прочитать();
				Если Набор.Количество() = 1 Тогда
					Для каждого МЗ Из Набор  Цикл
						МЗ.Размещен = Ложь;
						ЕстьИзменения = Истина;
					КонецЦикла;
					Набор.Записать();
					
					Если Не ПустаяСтрока(КаталогДляЗаявки_) Тогда
						//здесь дублируются данные
						ФайлДСП = КаталогДляЗаявки_+"\"+МЗ.ФайлИмя;
						Файл = Новый Файл(ФайлДСП);
						Если Файл.Существует() Тогда
							//Удаление
							уб_Серверные._УдалитьФайлы(ФайлДСП);
						Иначе
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
				Если ЕстьИзменения = Истина Тогда
					Документ.ОбменДанными.Загрузка = Истина;
					Документ.Записать();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "Опубликован" Тогда
		ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
		Массив = Документ.СписокФайлов.НайтиСтроки(Отбор);
		Если Массив.Количество()>0 тогда
			
			Строка = Массив[0];
			Строка.Опубликован = ТекущаяСтрока.Опубликован;
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если ЕстьИзменения = Истина Тогда
			Документ.ОбменДанными.Загрузка = Истина;
			Документ.Записать();
		КонецЕсли;	
	КонецЕсли;
возврат ЕстьИзменения;
КонецФункции	


Функция ИзменениеВидаДокумента (ТекущаяСтрока) Экспорт
	ЕстьИзменения =  Ложь;
	Набор = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
	Набор.Отбор.УИД.Установить(ТекущаяСтрока.СсылкаСправочника);
	Набор.Прочитать();
	Если Набор.Количество() = 1 Тогда
		//Если файл в документе есть, то должен быть опубликован в регистре
		Для каждого МЗ Из Набор  Цикл
			//Если Не МЗ.Размещен = Истина Тогда
			//МЗ.Архив = НЕ МЗ.Архив;
			МЗ.ВидДокумента = ТекущаяСтрока.ВидДокумента;
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВидДокумента) Тогда
				МЗ.ВидФайлаB2B  = ТекущаяСтрока.ВидДокумента.ВидФайлаB2B;
				ЕстьИзменения = ПереименоватьФайл(мз,ТекущаяСтрока);
				Если ТекущаяСтрока.ВидДокумента.Код = 74 Тогда
					//!!! это в форме насколько актуально
					ТекущаяСтрока.Вставить("НеобходимоВыбратьКошелек",  Истина);
				КонецЕсли;	
			Иначе
				МЗ.ВидФайлаB2B  = перечисления.уб_ВидыФайловB2B.ПРОЧЕЕ;
			КонецЕсли;	
			Набор.Записать();
			//КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция  ПереименоватьФайл(мз,ТекущаяСтрока)
	ИмяФайла = МЗ.ФайлИмя;
	Расширение = МЗ.ФайлРасширение;
	ИмяФайлаЧасть = Лев(ИмяФайла,СтрДлина(ИмяФайла)-?(Расширение="",0,СтрДлина(Расширение)+?(Лев(Расширение,1)=".",0,1)));
	//Если Интерактивно = Истина тогда
	//	Если ВвестиСтроку(ИмяФайлаЧасть,"Введите новое имя файла") = Истина Тогда
	//	Иначе
	//		Возврат;
	//	КонецЕсли;	
	//	ИмяФайлаНовое = ИмяФайлаЧасть+?(Лев(Расширение,1)=".",Расширение,"."+Расширение);
	//	НовоеИмяВХранилище = ""+мз.Хранилище.Путь+"\"+мз.ПутьКПапке+"\"+ИмяФайлаНовое;
	//Иначе
		ВидФайла = ""+ТекущаяСтрока.ВидДокумента;
		_Страхователь = ТекущаяСтрока.Страхователь;
		Если ТипЗнч(_Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			_Страхователь = ОбщегоНазначения.ФИО_ФизЛица(_Страхователь.Наименование, , , , Истина);
		КонецЕсли;	
		_Страхователь = уб_temp.УбратьСимволы(_Страхователь);
		
		Если НЕ ЗначениеЗаполнено(ВидФайла) Тогда
			Возврат Ложь;
		КонецЕсли;	
		ВидФайла = СтрЗаменить(ВидФайла," ","_");
		ВидФайла = СтрЗаменить(ВидФайла,"__","_");
		Если Найти(ИмяФайлаЧасть,ВидФайла)=0 Тогда
			СчетчикПоиска = 0;
			Файл = Неопределено;
			Пока СчетчикПоиска = 0 или Файл.Существует() Цикл
				ИмяФайлаЧасть = Формат(ТекущаяСтрока.Номер,"ЧГ=")+"_"+_Страхователь+"_"+ВидФайла+?(СчетчикПоиска=0,"","_"+Формат(СчетчикПоиска,"ЧГ="));
				ИмяФайлаНовое = ИмяФайлаЧасть+?(Лев(Расширение,1)=".",Расширение,"."+Расширение);
				НовоеИмяВХранилище = ""+мз.Хранилище.Путь+"\"+мз.ПутьКПапке+"\"+ИмяФайлаНовое;
				Файл = Новый Файл (НовоеИмяВХранилище);
				СчетчикПоиска = СчетчикПоиска+1;
			КонецЦикла;	
			
		Иначе	
			ИмяФайлаНовое = ИмяФайлаЧасть+?(Лев(Расширение,1)=".",Расширение,"."+Расширение);
			НовоеИмяВХранилище = ""+мз.Хранилище.Путь+"\"+мз.ПутьКПапке+"\"+ИмяФайлаНовое;
		КонецЕсли;	
	//КонецЕсли;
	
	ИмяВХранилище = ""+мз.Хранилище.Путь+"\"+мз.ПутьКПапке+"\"+ИмяФайла;
	Если уб_Серверные._КопироватьФайл(ИмяВХранилище,НовоеИмяВХранилище) Тогда
		
		//
		КаталогДляЗаявки_ = КаталогДляЗаявки_(ТекущаяСтрока.ДокументСсылка);
		
		ФайлДСП = КаталогДляЗаявки_+"\";
		НовыйФайлДСП = ""+ФайлДСП;
		ФайлДСП      = ФайлДСП+ИмяФайла;
		НовыйФайлДСП = НовыйФайлДСП+ИмяФайлаНовое;
		Файл = Новый Файл(ФайлДСП);
		Если Файл.Существует() Тогда
			уб_Серверные._КопироватьФайл(ФайлДСП,НовыйФайлДСП);
			уб_Серверные._УдалитьФайлы(ФайлДСП);
		КонецЕсли;
		
		уб_Серверные._УдалитьФайлы(ИмяВХранилище);
		МЗ.ФайлИмя = ИмяФайлаНовое;
		ФлЕстьПравки = Истина;
		
		ТекущаяСтрока.Имя = ИмяФайлаНовое;
		ТекущаяСтрока.ПолноеИмя =СтрЗаменить(ТекущаяСтрока.ПолноеИмя,ИмяФайла,ИмяФайлаНовое);
	КонецЕсли;	
	Возврат Истина
КонецФункции


Функция КаталогДляЗаявки_(ДокументСсылка) Экспорт
	НомерСтроки = 1;
	ВидБСО = "";
	Парам=Новый Структура("Номер,Ссылка,Страхователь,Менеджер,Файлы,ВидБСО",ДокументСсылка.Номер,ДокументСсылка.Ссылка,ДокументСсылка.Страхователь,ДокументСсылка.Менеджер,Новый Массив,ВидБСО);
	КаталогДляЗаявки  = уб_Серверные.КаталогДляЗаявки(Парам);
	Если ДокументСсылка.Номер>111023 Тогда
		КаталогДляЗаявки_ = КаталогДляЗаявки+"\"+уб_B2B.УбратьСимволы(ВидБСО,"")+?(НомерСтроки=1,"",НомерСтроки);
	Иначе
		КаталогДляЗаявки_ = КаталогДляЗаявки;
	КонецЕсли;	
	
	Файл = Новый Файл(КаталогДляЗаявки_);
	Если НЕ Файл.Существует() Тогда
		уб_Серверные._СоздатьКаталог(КаталогДляЗаявки_);
	КонецЕсли;
	Возврат КаталогДляЗаявки_			
КонецФункции


Функция _УстановитьЗначение(Объект,ИмяРеквизита,Значение) Экспорт
	Если НЕ Объект[ИмяРеквизита] = Значение Тогда
		Объект[ИмяРеквизита] = Значение;
		Возврат Истина;
	Иначе
		Возврат ЛОЖЬ
	КонецЕсли;	
КонецФункции	

Функция СписокОператоров(ВставлятьТекущее = Ложь) Экспорт
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Подразделение",?(=Истина,"СВС","Операторы БД"));
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	        |ИЗ
	        |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	        |ГДЕ
	        |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ЛОЖЬ
	        |	И уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение В
	        |			(ВЫБРАТЬ
	        |				Подр.Ссылка
	        |			ИЗ
	        |				Справочник.ПодразделенияОрганизаций КАК Подр
	        |			ГДЕ
	        |				1 = 1)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент.Наименование";
				   
				   
		Текст = СтрЗаменить(Текст,"1 = 1","Подр.Наименование = &Подразделение или Подр.Код = &Подразделение2");
		Запрос.УстановитьПараметр("Подразделение","Операторы БД");
		Запрос.УстановитьПараметр("Подразделение2","000000030");
	
	Запрос.Текст = Текст;
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Агент");		   
	Если ВставлятьТекущее = Истина Тогда
		Если Массив.Найти(ПараметрыСеанса.уб_ТекущееФизЛицо) = Неопределено Тогда
			Массив.Вставить(0,ПараметрыСеанса.уб_ТекущееФизЛицо);	
		КонецЕсли;
	КонецЕсли;
	Возврат Массив;
КонецФункции	

Функция ТребуетсяЗаполнениеМаркиМодели(Знач Параметр,Дата = Неопределено) Экспорт
	Возврат Справочники.уб_МаркиТС.ТребуетсяЗаполнениеМаркиМодели(Параметр,Дата);
КонецФункции


Функция ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец, ОграничениеКоличества = 30) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ " + СтрЗаменить(Строка(ОграничениеКоличества),Символы.НПП, "") + "
	|	Спр.Ссылка,
	|	Спр.Наименование,
	|	Спр.Код
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Спр
	|ГДЕ
	|	1 = 1 И (Спр.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &НаименованиеТранслит + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &ПереводРаскладки + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &ПереводРаскладкиТранслит + ""%"")";	
	Запрос.УстановитьПараметр("Наименование", ТекстДляПоиска);
	Запрос.УстановитьПараметр("НаименованиеТранслит", ТранслитТекстДляПоиска);
	Запрос.УстановитьПараметр("ПереводРаскладки", ТекстВДругойРаскладке);
	Запрос.УстановитьПараметр("ПереводРаскладкиТранслит", ТранслитТекстВДругойРаскладке);
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Спр.Владелец В (&Владелец)");
		Если ТипЗнч(Владелец) <> Тип("СписокЗначений") Тогда
			ПараметрВладелец = Новый СписокЗначений;
			ПараметрВладелец.Добавить(Владелец);
		Иначе
			ПараметрВладелец = Владелец;
		КонецЕсли;
		Запрос.УстановитьПараметр("Владелец", ПараметрВладелец);
	КонецЕсли;
	ТЗ =  Запрос.Выполнить().Выгрузить();
	Массив = Новый Массив;
	Для каждого Выборка из ТЗ Цикл
		Массив.Добавить(Новый Структура("Ссылка,Наименование,Код",Выборка.Ссылка,Выборка.Наименование,Выборка.Код));
	КонецЦикла;	
	Возврат Массив;
КонецФункции
	

Функция ПроверкаНаШаблон(Текст, Шаблон) Экспорт
	
	Если Текст <> "" Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.MultiLine 	= Истина; // истина — текст многострочный, ложь — одна строка
		RegExp.Global 		= Истина; // истина — поиск по всей строке, ложь — до первого совпадения
		RegExp.IgnoreCase 	= Истина; // истина — игнорировать регистр строки при поиске
		RegExp.Pattern 		= Шаблон ; // шаблон (регулярное выражение) для поиска параметра
		мНайд = RegExp.Execute(Текст); 
		Если мНайд.count>0 Тогда 
			Возврат Ложь
		КонецЕсли;
	КонецЕсли;
	Возврат Истина
	
КонецФункции // ПроверкаНаШаблон()


Функция РеквизитыБСОЗаявки() Экспорт
	Массив = Новый Массив;
	Для каждого Реквизит из Метаданные.Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТабличныеЧасти.БСО.Реквизиты Цикл
		Массив.Добавить(Новый Структура("Имя",Реквизит.Имя));
	КонецЦИкла;	
	Возврат Массив
КонецФункции	


Функция НайтиОбъектСтрахования(ВидБСО,vin,МаркаТС,МодельТС) Экспорт
	Попытка
		Если Не ПустаяСтрока(vin)
			и ЗначениеЗаполнено(МаркаТС)
			и ЗначениеЗаполнено(МодельТС)
			Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уб_ОбъектыСтрахования.Ссылка
			|ИЗ
			|	Справочник.уб_ОбъектыСтрахования КАК уб_ОбъектыСтрахования
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
			|		ПО уб_ТранспортныеСредства.Объект = уб_ОбъектыСтрахования.Ссылка
			|ГДЕ
			|	//уб_ТранспортныеСредства.МаркаТС = &МаркаТС
			//|	И уб_ТранспортныеСредства.МодельТС = &МодельТС
			|	уб_ТранспортныеСредства.ИдентификационныйНомер подобно &ИдентификационныйНомер и уб_ОбъектыСтрахования.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("МаркаТС",МаркаТС);
			Запрос.УстановитьПараметр("МодельТС",МодельТС);
			Запрос.УстановитьПараметр("ИдентификационныйНомер",vin);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Ссылка;
			Иначе
				//
				Если СтрДлина(VIN) = 17 Тогда
					
					НовыйОбъект = Справочники.уб_ОбъектыСтрахования.СоздатьЭлемент();
					НовыйОбъект.Тип = Справочники.уб_ТипыОбъектовСтрахования.НайтиПоНаименованию("Автомобиль");
					НовыйОбъект.Наименование = ""+МаркаТС+" "+МодельТС;
					НовыйОбъект.Записать();
					мз = РегистрыСведений.уб_ТранспортныеСредства.СоздатьМенеджерЗаписи();
					мз.Объект = НовыйОбъект.Ссылка; 
					мз.МаркаТС = МаркаТС;
					мз.МодельТС = МодельТС;
					мз.ИдентификационныйНомер = VIN;
					мз.Записать();
					//Предупреждение("Создали новый объект",2);
					Возврат НовыйОбъект.Ссылка;
				Иначе
					Сообщить("Длина vin не верна, автоматическое создание невозможно"); 
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецФункции

Функция ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,Менеджер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Вложенный.Карта КАК Карта,
	|	ПРЕДСТАВЛЕНИЕ(Вложенный.Карта) КАК Представление,
	|	Вложенный.Сортировка КАК Сортировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПодразделенияОрганизацийКарточкиСотрудников.Карта КАК Карта,
	|		ВЫБОР
	|			КОГДА ПодразделенияОрганизацийКарточкиСотрудников.Карта.Сотрудник = &Менеджер
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Сортировка
	|	ИЗ
	|		Справочник.ПодразделенияОрганизаций.КарточкиСотрудников КАК ПодразделенияОрганизацийКарточкиСотрудников
	|	ГДЕ
	|		ПодразделенияОрганизацийКарточкиСотрудников.Ссылка = &Подразделение
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.ПометкаУдаления = ЛОЖЬ
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.Актуальность = ИСТИНА
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
	|		И НЕ ПодразделенияОрганизацийКарточкиСотрудников.Карта.Сотрудник В
	|					(ВЫБРАТЬ
	|						уб_ДвижениеФизлицПоПодразделениям.Агент
	|					ИЗ
	|						регистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениям
	|					ГДЕ
	|						уб_ДвижениеФизлицПоПодразделениям.Выбытие = ИСТИНА)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Ссылка,
	|		0
	|	ИЗ
	|		Справочник.Кошельки.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.Сотрудник = &Менеджер
	|		И Сотрудники.Ссылка.ПометкаУдаления = ЛОЖЬ
	|		И Сотрудники.Ссылка.Актуальность = ИСТИНА
	|		И Сотрудники.Ссылка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.Сортировка";
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеМенеджера);
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Выборка =  Запрос.Выполнить().Выбрать();
	МассивКарт = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивКарт.Добавить(Новый Структура("Карта,Представление",Выборка.Карта,Выборка.Представление));
	КонецЦикла;
	Возврат МассивКарт;
КонецФункции	

Функция Автомобиль() Экспорт
	Возврат Справочники.уб_ТипыОбъектовСтрахования.НайтиПоНаименованию("Автомобиль")
КонецФункции	

Функция ОбработатьVin(Vin) Экспорт
	Возврат РегистрыСведений.уб_ТранспортныеСредства.ОбработатьVin(Vin)
КонецФункции	


#Область РаботаСАдресамиЭлектроннойПочты


Функция АдресЭлектроннойПочтыСоответствуетТребованиям(Знач Адрес, РазрешитьЛокальныеАдреса = Ложь) Экспорт
	
	// Допустимые символы для email.
	Буквы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	Цифры = "0123456789";
	СпецСимволы = ".@_-:+";
	
	// проверяем символ @
	Если СтрЧислоВхождений(Адрес, "@") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Разрешаем двоеточие только один раз.
	Если СтрЧислоВхождений(Адрес, ":") > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// проверяем две точки подряд
	Если СтрНайти(Адрес, "..") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Приводим строку адреса к нижнему регистру.
	Адрес = НРег(Адрес);
	
	// Проверяем допустимые символы.
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(Адрес, Буквы + Цифры + СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Разбираем адрес на local-part и domain.
	Позиция = СтрНайти(Адрес,"@");
	ЛокальноеИмя = Лев(Адрес, Позиция - 1);
	Домен = Сред(Адрес, Позиция + 1);
	
	// Проверяем на заполненность и допустимость длины.
	Если ПустаяСтрока(ЛокальноеИмя)
	 	Или ПустаяСтрока(Домен)
		Или СтрДлина(ЛокальноеИмя) > 64
		Или СтрДлина(Домен) > 255 Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем наличие спецсимволов в начале и в конце имени и домена.
	Если ЕстьСимволыВНачалеВКонце(ЛокальноеИмя, ".") Или ЕстьСимволыВНачалеВКонце(Домен, СпецСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// В домене должна быть минимум одна точка.
	Если Не РазрешитьЛокальныеАдреса И СтрНайти(Домен,".") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// В домене не должно быть символа подчеркивания.
	Если СтрНайти(Домен,"_") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// В домене не должно быть символа двоеточие.
	Если СтрНайти(Домен,":") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// В домене не должно быть символа "плюс".
	Если СтрНайти(Домен,"+") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Выделяем зону (TLD) из имени домена.
	Зона = Домен;
	Позиция = СтрНайти(Зона,".");
	Пока Позиция > 0 Цикл
		Зона = Сред(Зона, Позиция + 1);
		Позиция = СтрНайти(Зона,".");
	КонецЦикла;
	
	// Проверяем зону домена (минимум 2 символа, только буквы).
	Возврат РазрешитьЛокальныеАдреса Или СтрДлина(Зона) >= 2 И СтрокаСодержитТолькоДопустимыеСимволы(Зона,Буквы);
	
КонецФункции



#Область АдресЭлектроннойПочтыСоответствуетТребованиям

Функция ЕстьСимволыВНачалеВКонце(Строка, ПроверяемыеСимволы)
	
	Для Позиция = 1 По СтрДлина(ПроверяемыеСимволы) Цикл
		Символ = Сред(ПроверяемыеСимволы, Позиция, 1);
		СимволНайден = (Лев(Строка,1) = Символ) Или (Прав(Строка,1) = Символ);
		Если СимволНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы)
	МассивСимволов = Новый Массив;
	Для Позиция = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		МассивСимволов.Добавить(Сред(ДопустимыеСимволы,Позиция,1));
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Если МассивСимволов.Найти(Сред(Строка, Позиция, 1)) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СтатистикаКассы
Функция ВывестиСтатистику(ПолеТД = Неопределено) Экспорт
	Если ПолеТД = Неопределено Тогда
		ПолеТД = Новый ТабличныйДокумент;
	КонецЕсли;	
	ДанныеРасшифровки = Неопределено;
	ПолеТД.Очистить();
	Отчет = Отчеты.уб_ПремииЗаПериод.Создать();
	СхемаКомпоновкиДанных = Отчет.СхемаКомпоновкиДанных;
	//Вариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("По формам оплаты");
	Вариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Статистика кассы");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Вариант.Настройки);
	Настройка = Отчет.КомпоновщикНастроек.Настройки;
	//Для каждого Параметр из Настройка.ПараметрыВывода.Элементы Цикл
	//	Если Строка(Параметр.Параметр) = "ВыводитьЗаголовок" или
	//		Строка(Параметр.Параметр) = "Выводитьзаголовок"
	//		Тогда
	//		Параметр.Использование = Ложь;
	//		Прервать;
	//	КонецЕсли;	
	//КонецЦикла;	
	Для каждого  Элемент из Настройка.ПараметрыВывода.Элементы Цикл
		Если Строка(Элемент.Параметр) = "ВыводитьЗаголовок"  Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
			//Элемент.Использование = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ИначеЕсли Строка(Элемент.Параметр) ="ВыводитьПараметрыДанных" Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ИначеЕсли Строка(Элемент.Параметр) ="ВыводитьОтбор" Тогда
			Элемент.Использование = Истина;
			Элемент.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КонецЕсли;	
	КонецЦикла;	
	
	Параметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаНач");
	Параметр.Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-6));
	Параметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаКон");
	Параметр.Значение = КонецМесяца(ТекущаяДата());
	
	//
	Менеджер = Параметрысеанса.уб_ТекущееФизЛицо;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЛевоеЗначение",Новый ПолеКомпоновкиДанных("Ссылка.Агент"));
	ПараметрыОтбора.Вставить("ВидСравнения",ВидСравненияКомпоновкиДанных.Равно);
	ПараметрыОтбора.Вставить("ПравоеЗначение",Менеджер);
	
	ДобавитьОтбор(Настройка,ПараметрыОтбора);
	//Менеджер = Справочники.ФизическиеЛица.НайтиПоНаименованию("Слученков Дмитрий",Истина);
	
		//ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка.Агент");
		//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование 	= Истина;
		////ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
		//ЭлементОтбора.Представление		= Менеджер;
		//ЭлементОтбора.ПравоеЗначение	= Менеджер;

	Отчет.СкомпоноватьРезультат(ПолеТД,ДанныеРасшифровки);
    Возврат ПолеТД;
КонецФункции	

#КонецОбласти
Процедура ДобавитьОтбор(Настройки,ПараметрыОтбора) Экспорт
	ОтборНайден = Ложь;
	Для каждого ТекОтбор из Настройки.Отбор.Элементы Цикл
		Если ПараметрыОтбора.ЛевоеЗначение = ТекОтбор.ЛевоеЗначение Тогда
			ОтборНайден = Истина;
			ЭлементОтбора = ТекОтбор;
		КонецЕсли;	
	КонецЦикла;	
	Если ОтборНайден = ЛОЖЬ Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	ЭлементОтбора.ЛевоеЗначение		= ПараметрыОтбора.ЛевоеЗначение;
	ЭлементОтбора.ВидСравнения 		= ПараметрыОтбора.ВидСравнения;
	ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
	ЭлементОтбора.Представление		= ПараметрыОтбора.ПравоеЗначение;
	ЭлементОтбора.ПравоеЗначение	= ПараметрыОтбора.ПравоеЗначение;

КонецПроцедуры	

Функция ИмяФайлаИзАдреса(Адрес,Разделитель = "/") Экспорт
	ДлинаАдреса = СтрДлина(Адрес);
	ИндексРазделителя = 0;
	Для Счетчик = 1 по СтрДлина(Адрес) цикл
		Если Сред(Адрес,Счетчик,1) = Разделитель Тогда
			ИндексРазделителя = Счетчик;	
		КонецЕсли;	
	КонецЦикла;	
	Если ИндексРазделителя = 0 Тогда
		ИмяФайла = Адрес;
	Иначе	
		ИмяФайла = СокрЛП(Сред(Адрес,ИндексРазделителя+1));
	КонецЕсли;	
	Возврат ИмяФайла;
КонецФункции	


Функция ПривестиНомерБСО(ВыборкаНомерБСО,ЕстьОшибка = ЛОЖЬ) Экспорт
	РазрешенныеСимволы = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя0123456789/\-_ ()'";
	Длина = СтрДлина(ВыборкаНомерБСО);
	Слово = нрег(ВыборкаНомерБСО);
	НомерБСО = ВыборкаНомерБСО;
	ЕстьОшибка = ЛОЖЬ;
	ДЛя счетчик = 1 по Длина Цикл
		ТекСимвол  = Сред(Слово,Счетчик,1);
		СимволыСОшибками= Новый Массив;
		Если Найти(РазрешенныеСимволы,ТекСимвол) = 0 Тогда
			//Сообщить("'"+ТекСимвол+"'");
			//Сообщить(Выборка.НомерБСО);
			СимволыСОшибками.Добавить(ТекСимвол);
			ЕстьОшибка = Истина;
			//Прервать
		КонецЕсли;	
		Если ЕстьОшибка Тогда
			//Сообщить(Выборка.НомерБСО);
			Для каждого текСимвол из СимволыСОшибками Цикл
				Если текСимвол = "№" Тогда
					Если Лев(НомерБСО,2) = "№ " Тогда
						НомерБСО = СтрЗаменить(НомерБСО,"№ ","");
					ИначеЕсли Лев(НомерБСО,1) = "№" Тогда
						НомерБСО = СтрЗаменить(НомерБСО,"№","");	
					Иначе	
						НомерБСО = СтрЗаменить(НомерБСО,текСимвол,"-");
					КонецЕсли;	
				ИначеЕсли текСимвол = "¶" Тогда
					Если Лев(НомерБСО,2) = "¶-" Тогда
						НомерБСО = СтрЗаменить(НомерБСО,"¶-","");
						//ИначеЕсли Лев(НомерБСО,1) = "¶" Тогда
						//	НомерБСО = СтрЗаменить(НомерБСО,"№ ","");	
					Иначе	
						НомерБСО = СтрЗаменить(НомерБСО,текСимвол,"-");
					КонецЕсли;	
				ИначеЕсли Тексимвол = "–" или Тексимвол = "‑" Тогда	
					НомерБСО = СтрЗаменить(НомерБСО,текСимвол,"-");
				Иначе	
					НомерБСО = СтрЗаменить(НомерБСО,текСимвол,"");
				КонецЕсли;	
			КонецЦикла;	
			
			//Сообщить(НомерБСО);
		
		КонецЕсли;
	КонецЦикла;
	НомерБСО = СтрЗаменить(НомерБСО," - ","-");
	НомерБСО = СтрЗаменить(НомерБСО,"--","-");
	НомерБСО = СтрЗаменить(НомерБСО,"//","/");
	НомерБСО = СтрЗаменить(НомерБСО,"\\","\");
	НомерБСО = СтрЗаменить(НомерБСО,"я ","");
	НомерБСО = СокрЛП(врег(НомерБСО));
	Возврат НомерБСО;
КонецФункции	

Функция ВидДокумента(Код) Экспорт
	Возврат Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(Код);
КонецФункции	

Функция ПадежП(Знач z1,Знач z2,z3=0) Экспорт
	Возврат ФункцииРасширения.ПадежП(z1,z2,z3=0);
КонецФункции	


Функция ПроверитьИНН(Знач Значение,Ссылка = Неопределено,ЭтоМусор = ЛОжь) Экспорт
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЭтоМусор = Ссылка.ПринадлежитЭлементу(Справочники.Контрагенты.АгентыЮрЛица) или Ссылка.ПометкаУдаления;
	КонецЕсли;	
 
    ИНН = СокрЛП(Значение);
 
    Если Не ПопыткаПеревестиВЧисло(ИНН) Тогда
        Возврат Ложь;
    КонецЕсли;
 
    Если СтрДлина(ИНН) = 10 Тогда
 
        Коэффициенты = Новый Массив(10);
        Коэффициенты[0] = 2;
        Коэффициенты[1] = 4;
        Коэффициенты[2] = 10;
        Коэффициенты[3] = 3;
        Коэффициенты[4] = 5;
        Коэффициенты[5] = 9;
        Коэффициенты[6] = 4;
        Коэффициенты[7] = 6;
        Коэффициенты[8] = 8;
        Коэффициенты[9] = 0;
 
        КонтрольнаяСумма = 0;
        Для А = 1 По 10 Цикл
            Число = Число(Сред(ИНН, А, 1));
            КонтрольнаяСумма = КонтрольнаяСумма + 
                Число * Коэффициенты[А - 1];
        КонецЦикла;
 
        КонтрольноеЧисло = КонтрольнаяСумма % 11;
        Если КонтрольноеЧисло > 9 Тогда
            КонтрольноеЧисло = КонтрольноеЧисло % 10;
        КонецЕсли;
 
        Возврат КонтрольноеЧисло = Число(Сред(ИНН, 10, 1));
 
    ИначеЕсли СтрДлина(ИНН) = 12 Тогда
 
        Коэффициенты = Новый Массив(12);
        Коэффициенты[0] = 3;
        Коэффициенты[1] = 7;
        Коэффициенты[2] = 2;
        Коэффициенты[3] = 4;
        Коэффициенты[4] = 10;
        Коэффициенты[5] = 3;
        Коэффициенты[6] = 5;
        Коэффициенты[7] = 9;
        Коэффициенты[8] = 4;
        Коэффициенты[9] = 6;
        Коэффициенты[10] = 8;
        Коэффициенты[11] = 0;
 
        КонтрольнаяСумма11 = 0;
        Для А = 1 По 11 Цикл
            Число = Число(Сред(ИНН, А, 1));
            КонтрольнаяСумма11 = КонтрольнаяСумма11 + 
                Число * Коэффициенты[А];
        КонецЦикла;
 
        КонтрольноеЧисло11 = КонтрольнаяСумма11 % 11;
        Если КонтрольноеЧисло11 > 9 Тогда
            КонтрольноеЧисло11 = КонтрольноеЧисло11 % 10;
        КонецЕсли;
 
        Если КонтрольноеЧисло11 <> Число(Сред(ИНН, 11, 1)) Тогда
            Возврат Ложь;
        КонецЕсли;
 
        КонтрольнаяСумма12 = 0;
        Для А = 1 По 12 Цикл
            Число = Число(Сред(ИНН, А, 1));
            КонтрольнаяСумма12 = КонтрольнаяСумма12 + 
                Число * Коэффициенты[А - 1];
        КонецЦикла;
 
        КонтрольноеЧисло12 = КонтрольнаяСумма12 % 11;
        Если КонтрольноеЧисло12 > 9 Тогда
            КонтрольноеЧисло12 = КонтрольноеЧисло12 % 10;
        КонецЕсли;
 
        Если КонтрольноеЧисло12 <> Число(Сред(ИНН, 12, 1)) Тогда
            Возврат Ложь;
        КонецЕсли;
 
        Возврат Истина;
 
    Иначе
        Возврат Ложь;
    КонецЕсли;
 
КонецФункции

Функция ПопыткаПеревестиВЧисло(Значение)
 
    Попытка
        Результат = Число(Значение);
        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
 
КонецФункции


Функция ПроверитьДубльИНН(ИНН,Ссылка,Дубль = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ разрешенные
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка <> &Ссылка
	               |	И Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН",ИНН);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка= Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда
		Дубль = Выборка.Ссылка;
		Возврат ЛОЖЬ;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции 	

Функция ИсточникиЗаявок() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсточникиЗаявок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИсточникиЗаявок КАК ИсточникиЗаявок
	               |ГДЕ
	               |	ИсточникиЗаявок.ПометкаУдаления = ЛОЖЬ";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции	

Функция ФизлицаГруппаМусор()  Экспорт
	Возврат Справочники.ФизическиеЛица.НайтиПоКоду("000141071");
КонецФункции	


Функция КонтрагентыГруппаМусор()  Экспорт
	Возврат Справочники.Контрагенты.АгентыЮрЛица;
КонецФункции	

Процедура ВыполнитьНаСервере(СтрокаЗапуска) Экспорт
	Выполнить(СтрокаЗапуска);
	
КонецПроцедуры	

Функция КлючПоискаНаименования(Знач Наименование) Экспорт
	КлючПоиска = СтрЗаменить(Врег(Наименование),"Ё","Е");
	Возврат КлючПоиска;
КонецФункции	