Функция ПолучитьЗаписьКИ(АдресатСсылка) Экспорт
	
	Если ТипЗнч(АдресатСсылка) = Тип("СправочникСсылка.Организации") Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
		//СтруктураАдресата.Адресат = Адресат.НаименованиеДляДоговоровИПлатежныхДокументов;
	ИначеЕсли ТипЗнч(АдресатСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресКонтрагентаФактический;
		//СтруктураАдресата.Адресат = Адресат.НаименованиеПолное;
	ИначеЕсли ТипЗнч(АдресатСсылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания;
		//!!! Пересмотреть функцию, не правильно использовать наименование
		//СтруктураАдресата.Адресат = ОбщегоНазначения.ФИО_ФизЛица(Адресат);
	КонецЕсли;	
	//Ищем записи КИ для Адресата
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Установить(АдресатСсылка);
	НаборЗаписейКИ.Отбор.Вид.Установить(ВидКИ);
	НаборЗаписейКИ.Прочитать();	
	Если НаборЗаписейКИ.Количество() = 0 Тогда
		//СтруктураАдресата = "Контактной информации для адресата не найдено";
		Возврат РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	КонецЕсли;	
	Возврат НаборЗаписейКИ[0];
	
КонецФункции

Функция ЗаполнитьДанныеТаблицыИзРегистра(СтрокаТЧ, Направление = "о") Экспорт
	
	ЗаписьКИ = ПолучитьЗаписьКИ(СтрокаТЧ[Направление + "Адресат"]);	
	Если НЕ ЗначениеНеЗаполнено(ЗаписьКИ) Тогда	
		//Записываем значения из регистра в таблицу
		Для а = 1 По 9 Цикл
			СтрокаТЧ[Направление + "Поле" + Строка(а)] = ЗаписьКИ["Поле" + Строка(а)];
		КонецЦикла;
	Иначе
		Для а = 1 По 9 Цикл
			СтрокаТЧ[Направление + "Поле" + Строка(а)] = "";
		КонецЦикла;		
	КонецЕсли;	
	ОбновитьПредставлениеАдресаДляСтроки(СтрокаТЧ);
	СформироватьПредставлениеАдресата(СтрокаТЧ[Направление + "Адресат"], СтрокаТЧ[Направление + "ПредставлениеАдресата"]);
	
КонецФункции

//Формирует и записывает представление адреса для заданной строки
Функция ОбновитьПредставлениеАдресаДляСтроки(Строка) Экспорт
	
	Строка.Ошибка = "";
	//Адресат = "о"
	СтруктураСтроки = Новый Структура("Поле1, Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8, Поле9, ПредставлениеАдреса, Ошибка");
	Для а = 1 По 9 Цикл
		СтруктураСтроки["Поле" + Строка(а)] = Строка["оПоле" + Строка(а)];
	КонецЦикла;
	СформироватьПредставлениеАдресаИзСтуркуры(СтруктураСтроки, Строка(Строка["оАдресат"]));	
	Строка["оПредставлениеАдреса"] = СтруктураСтроки.ПредставлениеАдреса;
	Строка.Ошибка = СтруктураСтроки.Ошибка;
	//Адресат = "п"
	СтруктураСтроки = Новый Структура("Поле1, Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8, Поле9, ПредставлениеАдреса, Ошибка");
	Для а = 1 По 9 Цикл
		СтруктураСтроки["Поле" + Строка(а)] = Строка["пПоле" + Строка(а)];
	КонецЦикла;
	СформироватьПредставлениеАдресаИзСтуркуры(СтруктураСтроки, Строка(Строка["пАдресат"]));	
	Строка["пПредставлениеАдреса"] = СтруктураСтроки.ПредставлениеАдреса;
	Строка.Ошибка = Строка.Ошибка + СтруктураСтроки.Ошибка;
	
КонецФункции

Функция СформироватьПредставлениеАдресаИзСтуркуры(СтруктураАдресата, Адресат) Экспорт
		
	//Отчистим представление адреса
	ПредставлениеАдреса = "";	
	Если ЗначениеНеЗаполнено(СтруктураАдресата.Поле1) Тогда
		СтруктураАдресата.Ошибка = ?(ЗначениеНеЗаполнено(СтруктураАдресата.Ошибка),"Для " + Адресат + " некорректно заполнены следующие поля: ", СтруктураАдресата.Ошибка + ", ") + "индекс";
	КонецЕсли;
	//>>>>>>>>>>>>>>>>>>>>>>>>>>>>	Адрес строка №1	>>>>>>>>>>>>>>>>>>>>>>>>>>>>	
	//Проверка заполнения улицы (обязательно!)
	Если ЗначениеНеЗаполнено(СтруктураАдресата.Поле6) Тогда
		СтруктураАдресата.Ошибка = ?(ЗначениеНеЗаполнено(СтруктураАдресата.Ошибка),"Для " + Адресат + " некорректно заполнены следующие поля: ", СтруктураАдресата.Ошибка + ", ") + "улица";
	Иначе				
		ПредставлениеАдреса = СтруктураАдресата.Поле6;		
		//Проверка заполнения № дома (обязательно!)
		Если ЗначениеНеЗаполнено(СтруктураАдресата.Поле7) Тогда			
			СтруктураАдресата.Ошибка = ?(ЗначениеНеЗаполнено(СтруктураАдресата.Ошибка),"Для " + Адресат + " некорректно заполнены следующие поля: ", СтруктураАдресата.Ошибка + ", ") + "№ дома";			
		Иначе			
			ПредставлениеАдреса = ПредставлениеАдреса + ", д." + СтруктураАдресата.Поле7;			
			//Проверка заполнения корпуса (может не быть)
			Если ЗначениеЗаполнено(СтруктураАдресата.Поле8) Тогда
				ПредставлениеАдреса = ПредставлениеАдреса + ", корп. " + СтруктураАдресата.Поле8;
			КонецЕсли;	
			//Проверка заполнения № офиса (может не быть)
			Если ЗначениеЗаполнено(СтруктураАдресата.Поле9) Тогда
				ПредставлениеАдреса = ПредставлениеАдреса + ", оф." + СтруктураАдресата.Поле9;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;	
	//>>>>>>>>>>>>>>>>>>>>>>>>>>>>	Адрес строка №2	>>>>>>>>>>>>>>>>>>>>>>>>>>>>	
	//Проверка заполнения региона/города (обязательно!)
	Если ЗначениеНеЗаполнено(СтруктураАдресата.Поле2) Тогда		
		СтруктураАдресата.Ошибка = ?(ЗначениеНеЗаполнено(СтруктураАдресата.Ошибка),"Для " + Адресат + " некорректно заполнены следующие поля: ",СтруктураАдресата.Ошибка +  ", ") + "регион/город";		
	Иначе	
		ПредставлениеАдреса = ПредставлениеАдреса + Символы.ПС + СтруктураАдресата.Поле2;		
		//Проверка заполнения района (может не быть)
		Если ЗначениеЗаполнено(СтруктураАдресата.Поле3) Тогда
			ПредставлениеАдреса = ПредставлениеАдреса + ", " + СтруктураАдресата.Поле3;
		КонецЕсли;		
		//Проверка заполнения города (может не быть)
		Если ЗначениеЗаполнено(СтруктураАдресата.Поле4) Тогда
			ПредставлениеАдреса = ПредставлениеАдреса + ", " + СтруктураАдресата.Поле4;
		КонецЕсли;	
		//Проверка заполнения нас. пункт (может не быть)
		Если ЗначениеЗаполнено(СтруктураАдресата.Поле5) Тогда
			ПредставлениеАдреса = ПредставлениеАдреса + ", " + СтруктураАдресата.Поле5;
		КонецЕсли;		
	КонецЕсли;	
	СтруктураАдресата.ПредставлениеАдреса = ПредставлениеАдреса;
	//<<<<<<<<<<<<<<<<<<<<<<<<<<<<	Адрес строка №2	<<<<<<<<<<<<<<<<<<<<<<<<<<<<
	
КонецФункции

Функция СформироватьПредставлениеАдресата(Адресат, Представление)
	
	///////////////////////////////////////////////////////////////////////////
	//Представление адресата	
	Адресат = Адресат;
	Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Организации") Тогда
		Представление = Адресат.НаименованиеДляДоговоровИПлатежныхДокументов;
	ИначеЕсли ТипЗнч(Адресат) = Тип("СправочникСсылка.Контрагенты") Тогда
		Представление = Адресат.НаименованиеПолное;
	ИначеЕсли ТипЗнч(Адресат) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		//!!! Пересмотреть функцию, не правильно использовать наименование
		Представление = ОбщегоНазначения.ФИО_ФизЛица(Адресат);
	КонецЕсли;		
	
КонецФункции

// Функция печати конвертов на А4
Функция ПечатьНаА4(ТекущаяСтрока, Адресат = "о") Экспорт
	
	Количество = ?(Адресат = "о", ТекущаяСтрока.КоличествоПрямых, ТекущаяСтрока.КоличествоОбратных);
	оАдресат = ?(Адресат = "о", "оАдресат", "пАдресат");
	пАдресат = ?(Адресат = "о", "пАдресат", "оАдресат");
	Если Количество <> 0 Тогда
		КоличествоПустыхСтрок = 25;
		КоличествоПустыхСтрокПередИндексом = 5;		
		ТабДокумент = Новый ТабличныйДокумент;
		МакетКонвертов = ПолучитьМакет("Конверт");
		//Отступ от верхнего края
		ВыполнитьЦикл("ПустаяСтрока", 2, ТабДокумент);
		//Область отправителя
		//##################################################################################
		//От кого
		ТабДокумент.Вывести(МакетКонвертов.ПолучитьОбласть("Отступ"));
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьОтКого"));
		Отправитель = Строка(ТекущаяСтрока[?(Адресат = "о", "о", "п") + "ПредставлениеАдресата"]);
		МассивОтправителя = РазложитьСтрокуНаПодстроки(Отправитель, 40, " ");
		Если МассивОтправителя.Количество() > 0 Тогда
			ОбластьАдресат = МакетКонвертов.ПолучитьОбласть("Адресат");
			ОбластьАдресат.Параметры.Адресат = МассивОтправителя[0];
			ТабДокумент.Присоединить(ОбластьАдресат);
			Для кол = 1 По МассивОтправителя.Количество()-1 Цикл
				ТабДокумент.Вывести(МакетКонвертов.ПолучитьОбласть("Отступ"));
				ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("Отступ"));
				ОбластьАдресат = МакетКонвертов.ПолучитьОбласть("Адресат");
				ОбластьАдресат.Параметры.Адресат = МассивОтправителя[кол];
				ТабДокумент.Присоединить(ОбластьАдресат);
				КоличествоПустыхСтрок = КоличествоПустыхСтрок - 1; 
			КонецЦикла;			
		КонецЕсли;		
		//##################################################################################
		//Откуда
		ТабДокумент.Вывести(МакетКонвертов.ПолучитьОбласть("Отступ"));
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьОтКуда"));		
		ПредставлениеАдреса = ТекущаяСтрока[?(Адресат = "о", "о", "п") + "ПредставлениеАдреса"];
		МассивАдресаОтправителя = РазложитьСтрокуНаПодстроки(ПредставлениеАдреса, 40, ",");		
		Если МассивАдресаОтправителя.Количество() > 0 Тогда
			ОбластьАдресАдресата = МакетКонвертов.ПолучитьОбласть("АдресАдресата");
			ОбластьАдресАдресата.Параметры.АдресАдресата = МассивАдресаОтправителя[0];
			ТабДокумент.Присоединить(ОбластьАдресАдресата);
			Для кол = 1 По МассивАдресаОтправителя.Количество()-1 Цикл
				ТабДокумент.Вывести(МакетКонвертов.ПолучитьОбласть("Отступ"));
				ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("Отступ"));				
				ОбластьАдресАдресата = МакетКонвертов.ПолучитьОбласть("АдресАдресата");
				ОбластьАдресАдресата.Параметры.АдресАдресата = МассивАдресаОтправителя[кол];
				ТабДокумент.Присоединить(ОбластьАдресАдресата);				
				КоличествоПустыхСтрок = КоличествоПустыхСтрок - 1;
			КонецЦикла;			
		КонецЕсли;		
		ТабДокумент.Вывести(МакетКонвертов.ПолучитьОбласть("ПустаяСтрока"));		
		//##################################################################################
		//Индекс Откуда		
		ВыполнитьЦикл("Отступ", 4, ТабДокумент);
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьИдексОт"));		
		ВыполнитьЦикл("Отступ", 4, ТабДокумент);		
		ОбластьИндекса = МакетКонвертов.ПолучитьОбласть("ИндексАдресата");
		ОбластьИндекса.Параметры.ИндексАдресата = ТекущаяСтрока[?(Адресат = "о", "о", "п") + "Поле1"];
		ТабДокумент.Присоединить(ОбластьИндекса);		
		//ОТСТУП МЕЖДУ
		ВыполнитьЦикл("ПустаяСтрока", КоличествоПустыхСтрок, ТабДокумент);				
		//Получатель
		//##################################################################################
		//Кому
		ВыполнитьЦикл("Отступ", 9, ТабДокумент);
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьКому"));		
		Получатель = Строка(ТекущаяСтрока[?(Адресат = "о", "п", "о") + "ПредставлениеАдресата"]);
		МассивПолучателя = РазложитьСтрокуНаПодстроки(Получатель, 40, " ");		
		Если МассивПолучателя.Количество() > 0 Тогда
			ОбластьАдресат = МакетКонвертов.ПолучитьОбласть("Адресат");
			ОбластьАдресат.Параметры.Адресат = МассивПолучателя[0];
			ТабДокумент.Присоединить(ОбластьАдресат);
			Для кол = 1 По МассивПолучателя.Количество()-1 Цикл
				ВыполнитьЦикл("Отступ", 10, ТабДокумент);				
				ОбластьАдресат = МакетКонвертов.ПолучитьОбласть("Адресат");
				ОбластьАдресат.Параметры.Адресат = МассивПолучателя[кол];
				ТабДокумент.Присоединить(ОбластьАдресат);				
				КоличествоПустыхСтрокПередИндексом = КоличествоПустыхСтрокПередИндексом - 1;
			КонецЦикла;			
		КонецЕсли;		
		//##################################################################################
		//Куда
		ВыполнитьЦикл("Отступ", 9, ТабДокумент);
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьКуда"));		
		ПредставлениеАдреса = ТекущаяСтрока[?(Адресат = "о", "п", "о") + "ПредставлениеАдреса"];
		МассивАдресаПолучателя = РазложитьСтрокуНаПодстроки(ПредставлениеАдреса, 40, ",");		
		Если МассивАдресаПолучателя.Количество() > 0 Тогда
			ОбластьПолучателя = МакетКонвертов.ПолучитьОбласть("АдресАдресата");
			ОбластьПолучателя.Параметры.АдресАдресата = МассивАдресаПолучателя[0];
			ТабДокумент.Присоединить(ОбластьПолучателя);
			Для кол = 1 По МассивАдресаПолучателя.Количество()-1 Цикл
				ВыполнитьЦикл("Отступ", 10, ТабДокумент);
				ОбластьПолучателя = МакетКонвертов.ПолучитьОбласть("АдресАдресата");
				ОбластьПолучателя.Параметры.АдресАдресата = МассивАдресаПолучателя[кол];
				ТабДокумент.Присоединить(ОбластьПолучателя);				
				КоличествоПустыхСтрокПередИндексом = КоличествоПустыхСтрокПередИндексом - 1;
			КонецЦикла;			
		КонецЕсли;	
		ВыполнитьЦикл("ПустаяСтрока", 1, ТабДокумент);		
		ВыполнитьЦикл("Отступ", 10, ТабДокумент);
		ТабДокумент.Присоединить(МакетКонвертов.ПолучитьОбласть("НадписьИндексКому"));
		ВыполнитьЦикл("Отступ", 10, ТабДокумент);		
		ОбластьИндекса = МакетКонвертов.ПолучитьОбласть("ИндексАдресата");
		ОбластьИндекса.Параметры.ИндексАдресата = ТекущаяСтрока[?(Адресат = "о", "п", "о") + "Поле1"];
		ТабДокумент.Присоединить(ОбластьИндекса);		
		ВыполнитьЦикл("ПустаяСтрока", КоличествоПустыхСтрокПередИндексом, ТабДокумент);		
		ОбластьНижнегоИндекса = МакетКонвертов.ПолучитьОбласть("НижнийИндекс");
		ОбластьНижнегоИндекса.Параметры.Индекс = "$" + ТекущаяСтрока[?(Адресат = "о", "п", "о") + "Поле1"];
		ТабДокумент.Вывести(ОбластьНижнегоИндекса);
		//Задаем настройки для печати
		ТабДокумент.КоличествоЭкземпляров	= Количество;
		ТабДокумент.ОтображатьСетку			= Ложь;
		ТабДокумент.ОтображатьЗаголовки		= Ложь;
		ТабДокумент.ПолеСверху = 0;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСнизу = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		Если ПечатьСразу Тогда
			ТабДокумент.Напечатать(Истина);
		Иначе
			ТабДокумент.Показать("Конверт формата С4 " + ТекущаяСтрока[?(Адресат = "о", "о", "п") + "Адресат"] + "=>" + ТекущаяСтрока[?(Адресат = "о", "п", "о") + "Адресат"]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПроверкаПечати(ТекущаяСтрока, Адресат = "о") Экспорт 
	
	Количество = ?(Адресат = "о", ТекущаяСтрока.КоличествоПрямых, ТекущаяСтрока.КоличествоОбратных);
	Если Количество <> 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция РазложитьСтрокуНаПодстроки(Знач Строка, МаксимумВСтроке, Разделитель = " ") Экспорт
	
	ПолученныйМассив = Новый Массив;
	Если ЗначениеНеЗаполнено(Строка) Тогда 
		Возврат Новый Массив;
	КонецЕсли;	
	//Если многосточный, разбиваем на строки
	СтрокаПострочно = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка, Символы.ПС);
	//Перебираем строки, если превышает максимум разбиваем
	Для каждого Строка Из СтрокаПострочно Цикл
		Если СтрДлина(Строка) > МаксимумВСтроке Тогда
			//Разбиваем по разделителям (по умолчанию по словам)
			СтрокаПоРазделителям = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка, Разделитель);
			//Первое слово обязательно
			НоваяСтрока = СтрокаПоРазделителям[0];
			//Собираем строку не превышающую максимум
			Для кол = 1 По СтрокаПоРазделителям.Количество() - 1 Цикл
				//Пока результат сложения меньше максимума для строки, соединяем
				Если СтрДлина(НоваяСтрока) + СтрДлина(СтрокаПоРазделителям[кол]) < МаксимумВСтроке Тогда
					НоваяСтрока = НоваяСтрока + Разделитель + СтрокаПоРазделителям[кол];
				//В противном случае добавляем новую строку
				Иначе
					ПолученныйМассив.Добавить(НоваяСтрока);
					НоваяСтрока = СтрокаПоРазделителям[кол];
				КонецЕсли;
			КонецЦикла;
			//Добавляем последнюю строку	
			ПолученныйМассив.Добавить(НоваяСтрока);
		Иначе
			ПолученныйМассив.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Возврат ПолученныйМассив;
	
КонецФункции

Функция ВыполнитьЦикл(ЧтоВыполнять, Сколько = 1, КудаВыводить)
	
	МакетКонвертов = ПолучитьМакет("Конверт");
	Если ЧтоВыполнять = "Отступ" Тогда
		КудаВыводить.Вывести(МакетКонвертов.ПолучитьОбласть(ЧтоВыполнять));
		Для КоличествоРаз = 1 По Сколько-1 Цикл
			КудаВыводить.Присоединить(МакетКонвертов.ПолучитьОбласть(ЧтоВыполнять));
		КонецЦикла;
	ИначеЕсли ЧтоВыполнять = "ПустаяСтрока" Тогда
		Для КоличествоРаз = 1 По Сколько Цикл
			КудаВыводить.Вывести(МакетКонвертов.ПолучитьОбласть(ЧтоВыполнять));
		КонецЦикла;
	КонецЕсли;
	
КонецФункции





	
