Функция НовоеНаименование(Наименование) Экспорт
	МассивСлов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(СтрЗаменить(Наименование,"  "," "),"  "," ")," ");
		НовоеНаименование = "";
		Для каждого Слово из МассивСлов Цикл
			НовоеНаименование = НовоеНаименование+?(НовоеНаименование="",""," ")+ВРЕГ(ЛЕВ(Слово,1))
			+ НРЕГ(СРЕД(Слово,2));
		КонецЦикла;	
		СтрокаБукв = "аеёиоуыэюябвгджзйклмнпрстфхцчшщiъь- ";
		СтрокаБукв = СтрокаБукв+Врег(СтрокаБукв);
		длина = СтрДлина(НовоеНаименование);
		естьОшибка = Ложь;
		МассивКривых = Новый Массив;
		Для СчетчикБукв =1 по длина Цикл
			ТекБуква = Сред(НовоеНаименование,СчетчикБукв,1);
			Если Найти(СтрокаБукв,ТекБуква) = 0 Тогда
				естьОшибка =Истина;
				МассивКривых.Добавить(ТекБуква);
			КонецЕсли;	
		КонецЦикла;	
		
		НовоеНаименование = СтрЗаменить(НовоеНаименование,Символы.Таб," ");
		НовоеНаименование = СтрЗаменить(НовоеНаименование,Символы.ПС," ");
		НовоеНаименование = СтрЗаменить(НовоеНаименование,Символы.ВК," ");
		НовоеНаименование = СтрЗаменить(НовоеНаименование,"  "," ");
		НовоеНаименование = СтрЗаменить(НовоеНаименование,"  "," ");
		
		Если естьОшибка = Истина Тогда
			СтрокаКривых ="";
			Для каждого буква из МассивКривых Цикл
				НовоеНаименование = СтрЗаменить(НовоеНаименование,буква,"");
				СтрокаКривых = СтрокаКривых+буква;
			КонецЦикла;
			Сообщить("Обнаружены и УДАЛЕНЫ ошибочные символы в наименовании "+СтрокаКривых);
			
		КонецЕсли;	
	Возврат НовоеНаименование	
КонецФункции

//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
//	
//	
//	Если Данные.Ссылка.Пустая() Тогда
//		СтандартнаяОбработка = Ложь;
//		Представление = "<>";
//	ИначеЕсли НЕ Данные.Ссылка.ПринадлежитЭлементу(Справочники.ФизическиеЛица.Сотрудники) Тогда
//		СтандартнаяОбработка = Ложь;
//		Если ЗначениеЗаполнено(Данные.ДатаРождения) Тогда
//			Представление = СтрШаблон("%1 [%2]", Данные.Наименование, Формат(Данные.ДатаРождения,"ДФ=dd.MM.yyyy"));//, Данные.Код);
//		Иначе
//			Представление = СтрШаблон("%1", Данные.Наименование);//, Данные.Код);
//		КонецЕсли;
//	КонецЕсли;	
//КонецПроцедуры


//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	Поля.Добавить("Ссылка");
//	Поля.Добавить("Наименование");
//	Поля.Добавить("Код");
//	Поля.Добавить("ДатаРождения");
//КонецПроцедуры


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Свойство("ЭтоСотрудник") и Параметры.ЭтоСотрудник = Истина и не пустаяСтрока(Параметры.СтрокаПоиска) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	влож.Агент КАК Агент,
		               |	влож.Наименование КАК Наименование
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент КАК Агент,
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент.Наименование КАК Наименование
		               |	ИЗ
		               |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(, ) КАК уб_ДвижениеФизлицПоПодразделениям
		               |	ГДЕ
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент.Наименование ПОДОБНО &Наименование
		               |		И уб_ДвижениеФизлицПоПодразделениям.Выбытие = ЛОЖЬ
		               |	
		               |	ОБЪЕДИНИТЬ
		               |	
		               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент,
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент.Наименование
		               |	ИЗ
		               |		РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК уб_ДвижениеФизлицПоПодразделениям
		               |	ГДЕ
		               |		уб_ДвижениеФизлицПоПодразделениям.Агент.Наименование ПОДОБНО &Наименование
		               |		И уб_ДвижениеФизлицПоПодразделениям.Период > &год) КАК влож
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	влож.Наименование";
					   Запрос.УстановитьПараметр("год",ТекущаяДата()-365*3600*24);
		Запрос.УстановитьПараметр("Наименование","%"+Параметры.СтрокаПоиска+"%");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Агент,Выборка.Наименование);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

