Перем мДлинаСуток;

Процедура ПроверитьДубли(ЗаписьПаспортныхДанных, ИНН, ПФР, ФИО) Экспорт
	
	ЕстьДублиПаспортныхДанных 	= Ложь;
	ЕстьДублиИНН 				= Ложь;
	ЕстьДублиПФР 				= Ложь;
	
	Если ЗначениеЗаполнено(ЗаписьПаспортныхДанных.ДокументВид) ИЛИ
		 ЗначениеЗаполнено(ЗаписьПаспортныхДанных.ДокументСерия) ИЛИ
		 ЗначениеЗаполнено(ЗаписьПаспортныхДанных.ДокументНомер) ИЛИ
		 ЗначениеЗаполнено(ЗаписьПаспортныхДанных.ДокументДатаВыдачи) ИЛИ
		 ЗначениеЗаполнено(ЗаписьПаспортныхДанных.ДокументКодПодразделения) ТОГДА
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПаспортныеДанныеФизЛиц.ФизЛицо
		               |ИЗ
		               |	РегистрСведений.ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц1
		               |		ПО (ПаспортныеДанныеФизЛиц.ДокументВид = &ДокументВид) И (ПаспортныеДанныеФизЛиц.ДокументСерия = &ДокументСерия) И (ПаспортныеДанныеФизЛиц.ДокументНомер = &ДокументНомер) И (ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи = &ДокументДатаВыдачи) И (ПаспортныеДанныеФизЛиц.ДокументКодПодразделения = &ДокументКодПодразделения)
		               |
		               |ГДЕ
		               |	ПаспортныеДанныеФизЛиц.ФизЛицо <> &Ссылка";
		ЗапросПоДублям 	= Новый Запрос(ТекстЗапроса);
		ЗапросПоДублям.УстановитьПараметр("Ссылка", 					Ссылка);
		ЗапросПоДублям.УстановитьПараметр("ДокументВид", 				ЗаписьПаспортныхДанных.ДокументВид);
		ЗапросПоДублям.УстановитьПараметр("ДокументСерия",	 			ЗаписьПаспортныхДанных.ДокументСерия);
		ЗапросПоДублям.УстановитьПараметр("ДокументНомер", 				ЗаписьПаспортныхДанных.ДокументНомер);
		ЗапросПоДублям.УстановитьПараметр("ДокументДатаВыдачи", 		ЗаписьПаспортныхДанных.ДокументДатаВыдачи);
		ЗапросПоДублям.УстановитьПараметр("ДокументКодПодразделения",	ЗаписьПаспортныхДанных.ДокументКодПодразделения);
		РезультатЗапросаПоДублям 	= ЗапросПоДублям.Выполнить();
		ВыборкаЗапроса 				= РезультатЗапросаПоДублям.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Сообщить("Физлицо: " + ВыборкаЗапроса.Физлицо +" имеет такие же паспортные данные как и у "+Строка(Ссылка));
			ЕстьДублиПаспортныхДанных = Истина;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИНН) тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ФизическиеЛица.Ссылка КАК Физлицо
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица1
		               |		ПО (ФизическиеЛица.ИНН = &ИНН)
		               |ГДЕ
		               |	ФизическиеЛица.Ссылка <> &Ссылка";
		ЗапросПоДублям 	= Новый Запрос(ТекстЗапроса);
		ЗапросПоДублям.УстановитьПараметр("Ссылка", 				Ссылка);
		ЗапросПоДублям.УстановитьПараметр("ИНН", 					ИНН);
		РезультатЗапросаПоДублям 	= ЗапросПоДублям.Выполнить();
		ВыборкаЗапроса 				= РезультатЗапросаПоДублям.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Сообщить("Физлицо: " + ВыборкаЗапроса.Физлицо +" имеет такой же ИНН как и у "+Строка(Ссылка));
			ЕстьДублиИНН = Истина;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Число("0"+СтрЗаменить(СтрЗаменить(ПФР, "-", ""), " ", ""))) тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ФизическиеЛица.Ссылка КАК Физлицо
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица1
		               |		ПО (ФизическиеЛица.СтраховойНомерПФР = &ПФР)
		               |ГДЕ
		               |	ФизическиеЛица.Ссылка <> &Ссылка";
		ЗапросПоДублям 	= Новый Запрос(ТекстЗапроса);
		ЗапросПоДублям.УстановитьПараметр("Ссылка", 				Ссылка);
		ЗапросПоДублям.УстановитьПараметр("ПФР", 					СтраховойНомерПФР);
		РезультатЗапросаПоДублям 	= ЗапросПоДублям.Выполнить();
		ВыборкаЗапроса 				= РезультатЗапросаПоДублям.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Сообщить("Физлицо: " + ВыборкаЗапроса.Физлицо +" имеет такой же страховой номер ПФР как и у "+Строка(Ссылка));
			ЕстьДублиПФР = Истина;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ФИО) И
		 НЕ ЕстьДублиИНН И
		 НЕ ЕстьДублиПаспортныхДанных И
		 НЕ ЕстьДублиПФР тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ФИОФизЛиц.ФизЛицо
		               |ИЗ
		               |	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц1
		               |		ПО (ФИОФизЛиц.Фамилия+ФИОФизЛиц.Имя+ФИОФизЛиц.Отчество = &ФИО)
		               |
		               |ГДЕ
		               |	ФИОФизЛиц.ФизЛицо <> &Ссылка";
		ЗапросПоДублям 	= Новый Запрос(ТекстЗапроса);
		ЗапросПоДублям.УстановитьПараметр("Ссылка",	Ссылка);
		ЗапросПоДублям.УстановитьПараметр("ФИО", 	СтрЗаменить(ФИО, " ", ""));
		РезультатЗапросаПоДублям 	= ЗапросПоДублям.Выполнить();
		ВыборкаЗапроса 				= РезультатЗапросаПоДублям.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Сообщить("Физлицо с таким ФИО (" + ВыборкаЗапроса.Физлицо +") уже есть в справочнике");
			ЕстьДублиПаспортныхДанных = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	КлючПоиска = уб_вызовСервера.КлючПоискаНаименования(Наименование);
	
	Если Предопределенный И Ссылка.Родитель <> Родитель Тогда
		Сообщить("Нельзя изменить группу предопределенного элемента!");
		Отказ = Истина;
	Иначе
		уб_СС.ОтметитьФактМодификации(ЭтотОбъект);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	ТабПФ = уб_ПФ.ПустаяТЗСтруктурыПФ();
	Для Каждого Макет Из Метаданные.Справочники.ФизическиеЛица.Макеты Цикл
		
		Если Макет.Имя <> "ДанныеПоФизлицу" Тогда
			СтрТабПФ = ТабПФ.Добавить();
			СтрТабПФ.КодПФ			= Макет.Имя;
			СтрТабПФ.Наименование	= Макет.Синоним;
		КонецЕсли;
	КонецЦикла;
	//СтрТабПФ = ТабПФ.Добавить();
	//СтрТабПФ.КодПФ			= "ПечатьКонвертов";
	//СтрТабПФ.Наименование	= "Печать конвертов";
	Возврат ТабПФ;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


#Область Печать

Функция ПечатьМакетов(Кнопка,Параметры = Неопределено) Экспорт

	Если ТипЗнч(Кнопка) = Тип("Строка") Тогда
		ИмяКнопки = Кнопка;
	Иначе	
		ИмяКнопки = Кнопка.Имя;
	КонецЕсли;	
	
	ИмяКнопки = СтрЗаменить(ИмяКнопки,"ВыполнитьКомандуПечати_","");
	Если ИмяКнопки = "ДанныеПоФизлицу" Тогда
		 ТабличныйДокумент = ПечатьДанных(Параметры)
	ИначеЕсли ИмяКнопки = "ДоговорМОЛ" Тогда
		ТабличныйДокумент = ДоговорМОЛ(Кнопка,Параметры)
	ИначеЕсли ИмяКнопки = "ДоговорСубагентский" Тогда
		ТабличныйДокумент = Договор(Кнопка,Параметры)
	ИначеЕсли ИмяКнопки = "ДоговорСубагентскийДС" Тогда
		ТабличныйДокумент = ДопДоговор(Кнопка,Параметры)	
	ИначеЕсли ИмяКнопки = "ПриложениеПД" Тогда
		ТабличныйДокумент = ПриложениеПД(Кнопка,Параметры)		
		
	ИначеЕсли ИмяКнопки = "СоглашениеОНеразглашении" Тогда
		ТабличныйДокумент = СоглашениеОНеразглашении(Кнопка,Параметры)
	//ИначеЕсли ИмяКнопки = "ПечатьКонвертов" Тогда
	//	Форма = Обработки.уб_ПечатьКонвертов.ПолучитьФорму();
	//	Форма.ПолучательПоУмолчанию 		= Ссылка;
	//	Форма.ДобавлятьСтрокуПриОткрытии    = Истина;
	//	Форма.Открыть();
	Иначе
		ТабличныйДокумент =  Уб_ВызовСервера.ПечатьВнешнейФормы(Ссылка,ИмяКнопки,Параметры);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции


// Процедура выводит на экран печатную форму 
	//
	// Параметры: 
	//  Нет
	//
	// Возвращаемое значение:
	//  Нет.
	//
Функция ПечатьДанных(Параметры = Неопределено,  ДатаАктуальности = Неопределено) Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
	СтруктураДанных = Новый Структура; 
	СтруктураДанныхОрганизации = Новый Структура; 

	Подробно = Истина;

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	Ссылка);
	Если ДатаАктуальности = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаАктуальности" ,	КонецДня(ОбщегоНазначения.ПолучитьРабочуюДату()));
	Иначе
		Запрос.УстановитьПараметр("ДатаАктуальности" ,	КонецДня(ДатаАктуальности));
	КонецЕсли;
	Запрос.УстановитьПараметр("ПустаяСтрока" ,"");
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("Проведен" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.МестоРождения,
	|	ФизическиеЛица.ИНН,
	|	ФизическиеЛица.Код,
	|	ФизическиеЛица.КодИМНС,
	|	ФизическиеЛица.Пол,
	|	ФизическиеЛица.СтраховойНомерПФР,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.Представление КАК ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО (ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";

	Результат = Запрос.Выполнить(); 
	ВыборкаДляПроверок = Результат.Выбрать();
	ВыборкаДляПроверок.Следующий();
	СтруктураДанных.Вставить("ФизическиеЛица", Результат.Выбрать());
	Если ВыборкаДляПроверок.ДокументВид <> Null Тогда
		СтруктураДанных.Вставить("ПаспортныеДанныеФизЛиц", Результат.Выбрать());
	КонецЕсли;

	// контактная информация
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	ВЫБОР КОГДА КонтактнаяИнформация.Вид ССЫЛКА Справочник.ВидыКонтактнойИнформации ТОГДА
	|		КонтактнаяИнформация.Вид.Представление
	|	ИНАЧЕ
	|		КонтактнаяИнформация.Вид
	|	КОНЕЦ КАК ВидКИ,
	|	КонтактнаяИнформация.Представление КАК ПредставлениеКИ
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &ФизЛицо
	|УПОРЯДОЧИТЬ ПО
	|	Тип
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтруктураДанных.Вставить("КонтактнаяИнформация", Запрос.Выполнить().Выбрать());
	
	ВыводитьНаПечать = Ложь;
	Если ТабДокумент = Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент;
		ВыводитьНаПечать = Истина;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ФизическиеЛица_ДанныеПоФизлицу";
	Макет = ПолучитьМакет("ДанныеПоФизлицу");

	Для Каждого СекцияДанных Из СтруктураДанных Цикл

		ИмяСекции = СекцияДанных.Ключ;
		УсловиеВыводаРаскрытойГруппы = ИмяСекции = "ФизическиеЛица";
		Выборка = СекцияДанных.Значение;
		Если ИмяСекции = "КонтактнаяИнформация" и НЕ Выборка.Количество() = 0 Тогда

			СекцияЗаголовка = Макет.ПолучитьОбласть("КонтактнаяИнформация_Заголовок");
			ТабДокумент.Вывести(СекцияЗаголовка);
			ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
			ТабДокумент.НачатьГруппуСтрок("",Ложь);
			Отбивка = Макет.ПолучитьОбласть("Отбивка");
			
			СекцияТипаКИ = Макет.ПолучитьОбласть("КонтактнаяИнформация_Тип");
			Пока Выборка.СледующийПоЗначениюПоля("Тип") цикл

				ТабДокумент.Вывести(Отбивка);
				СекцияТипаКИ.Параметры.ТипКИ = Строка(Выборка.Тип) + ":";
				ТабДокумент.Вывести(СекцияТипаКИ);

				СекцияКИ = Макет.ПолучитьОбласть("КонтактнаяИнформация_Данные");
				Пока Выборка.СледующийПоЗначениюПоля("ВидКИ") цикл
					СекцияКИ.Параметры.Заполнить(Выборка);
					ТабДокумент.Вывести(СекцияКИ);
				КонецЦикла;

			КонецЦикла; 

			ТабДокумент.Вывести(Отбивка);
			ТабДокумент.ЗакончитьГруппуСтрок();
			
		ИначеЕсли ИмяСекции = "Организация"  Тогда

			Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл

				Отбивка = Макет.ПолучитьОбласть("Отбивка");
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
				ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
				ТабДокумент.Вывести(Отбивка);
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Данные");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.Вывести(Отбивка);

				Для Каждого СекцияДанныхОрганизации Из СтруктураДанныхОрганизации Цикл
					ИмяСекцииОрганизации = СекцияДанныхОрганизации.Ключ;

					Если ИмяСекцииОрганизации = "Отклонения" Тогда

						ВыборкаОрганизации = СекцияДанныхОрганизации.Значение;
						Пока ВыборкаОрганизации.СледующийПоЗначениюПоля("ВидОтсутствия") Цикл
							ИмяСекцииОрганизации = СокрЛП(ВыборкаОрганизации.ВидОтсутствия);
							Отбивка = ?(Макет.Области.Найти(ИмяСекцииОрганизации + "_Отбивка") <> Неопределено,Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Отбивка"),Макет.ПолучитьОбласть("Отбивка"));
							Если Макет.Области.Найти(ИмяСекцииОрганизации + "_Заголовок") <> Неопределено Тогда
								ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Заголовок_ПерваяСтрока");
								ТабДокумент.Вывести(ОбластьМакета);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
								ТабДокумент.НачатьГруппуСтрок("", Не Подробно);
								ТабДокумент.Вывести(Отбивка);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
								ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Заголовок_Остальное");
								ТабДокумент.Вывести(ОбластьМакета);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы - ОбластьМакета.ВысотаТаблицы + 1, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
								ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Данные");
								Пока ВыборкаОрганизации.Следующий() Цикл
									ОбластьМакета.Параметры.Заполнить(ВыборкаОрганизации);
									ТабДокумент.Вывести(ОбластьМакета);
								КонецЦикла;
								ТабДокумент.Вывести(Отбивка);
								ТабДокумент.ЗакончитьГруппуСтрок();
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли Макет.Области.Найти(ИмяСекцииОрганизации + "_Заголовок") <> Неопределено Тогда

                        // Спозиционируемся в выборке "ПеремещенияВОрганизации" на нужной организации
						ВыборкаПеремещенийПоВсемОрганизациям = СекцияДанныхОрганизации.Значение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						ВыборкаПеремещенийПоВсемОрганизациям.Сбросить();
						СтруктураПоиска = Новый Структура("Организация");
						СтруктураПоиска.Организация = Выборка.ОрганизацияСсылка;
						Если ВыборкаПеремещенийПоВсемОрганизациям.НайтиСледующий(СтруктураПоиска) Тогда

							// Выберем кадровые перемещения в рамках организации
							ВыборкаОрганизации = ВыборкаПеремещенийПоВсемОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Отбивка = ?(Макет.Области.Найти(ИмяСекцииОрганизации + "_Отбивка") <> Неопределено,Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Отбивка"),Макет.ПолучитьОбласть("Отбивка"));
							ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Заголовок");
							Если ОбластьМакета.Области.Количество() = 1 Тогда
								ТабДокумент.Вывести(ОбластьМакета);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
								ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
								ТабДокумент.Вывести(Отбивка);
							Иначе
								ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Заголовок_ПерваяСтрока");
								ТабДокумент.Вывести(ОбластьМакета);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
								ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
								ТабДокумент.Вывести(Отбивка);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
								ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Заголовок_Остальное");
								ТабДокумент.Вывести(ОбластьМакета);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы - ОбластьМакета.ВысотаТаблицы + 1, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
							КонецЕсли;
							ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекцииОрганизации + "_Данные");
							Пока ВыборкаОрганизации.Следующий() Цикл
								ОбластьМакета.Параметры.Заполнить(ВыборкаОрганизации);
								ТабДокумент.Вывести(ОбластьМакета);
							КонецЦикла;
							ТабДокумент.Вывести(Отбивка);
							ТабДокумент.ЗакончитьГруппуСтрок();
						
						КонецЕсли; 

					КонецЕсли;
					
				КонецЦикла;
				
				ТабДокумент.ЗакончитьГруппуСтрок();

			КонецЦикла;

		ИначеЕсли Макет.Области.Найти(ИмяСекции + "_Заголовок") <> Неопределено и Выборка.Следующий() Тогда

			Отбивка = ?(Макет.Области.Найти(ИмяСекции + "_Отбивка") <> Неопределено,Макет.ПолучитьОбласть(ИмяСекции + "_Отбивка"),Макет.ПолучитьОбласть("Отбивка"));
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок");
			Если ОбластьМакета.Области.Количество() = 1 Тогда
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
				ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
				ТабДокумент.Вывести(Отбивка);
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок_ПерваяСтрока");
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ЦветФона = ЦветаСтиля.ФонГруппировкиВерхнегоУровня;
				ТабДокумент.НачатьГруппуСтрок("", УсловиеВыводаРаскрытойГруппы);
				ТабДокумент.Вывести(Отбивка);
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Заголовок_Остальное");
				Если ОбластьМакета.Параметры.Количество() = 0 Тогда // раскрашиваем заголовок без выведенных данных
					ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
				Иначе	
					ОбластьМакета.Параметры.Заполнить(Выборка);
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьМакета);
				Если ОбластьМакета.Параметры.Количество() = 0 Тогда // раскрашиваем заголовок без выведенных данных
					ТабДокумент.Область(ТабДокумент.ВысотаТаблицы - ОбластьМакета.ВысотаТаблицы + 1, 2, ТабДокумент.ВысотаТаблицы, 10).ЦветФона = ЦветаСтиля.ФонГруппировкиПромежуточногоУровня;
				КонецЕсли;
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяСекции + "_Данные");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			Если ИмяСекции = "ФизическиеЛица" и НЕ ЗначениеЗаполнено(Выборка.Фамилия) Тогда
				Фамилия = " "; Имя = " "; Отчество = " ";
				ОбщегоНазначения.ФИО_ФизЛица(ЭтотОбъект, Фамилия, Имя, Отчество);
				ОбластьМакета.Параметры.Фамилия = Фамилия;
				ОбластьМакета.Параметры.Имя = Имя;
				ОбластьМакета.Параметры.Отчество = Отчество;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
			Пока Выборка.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			ТабДокумент.Вывести(Отбивка);
			ТабДокумент.ЗакончитьГруппуСтрок();

		КонецЕсли;	
	КонецЦикла;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент,,, "Данные по: " + Наименование);

	Возврат ТабДокумент
КонецФункции // Печать


Функция Договор(Кнопка,Параметры = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("ДоговорСубагентский");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывод = ?(УБ_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ,ПолныеПрава,уб_ДопРольУправлениеПерсоналом"),ИспользованиеВывода.Разрешить,ИспользованиеВывода.Авто);
	
	

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	С.Период,
		               |	С.Агент,
		               |	С.Выбытие,
		               |	С.Подразделение,
		               |	Организации.Ссылка КАК Организация,
		               |	Организации.ОГРН КАК ОГРН,
		               |	Организации.ИНН КАК ИНН,
		               |	Организации.КПП КАК КПП,
		               |	Организации.НаименованиеПолное КАК НаименованиеПолное,
		               |	Организации.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
		               |	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		               |	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
					   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
		               |ИЗ
		               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		               |		ПО (Организации.Ссылка = &ТекОрганизация)
					   
	               
				   |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
				   |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		               |ГДЕ
		               |	С.Агент = &Агент";
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Иначе	
	Запрос.Текст = "ВЫБРАТЬ
	               |	С.Период КАК Период,
	               |	С.Агент КАК Агент,
	               |	С.Выбытие КАК Выбытие,
	               |	С.Подразделение КАК Подразделение,
	               |	С.Организация КАК Организация,
	               |	С.Организация.ОГРН КАК ОГРН,
	               |	С.Организация.ИНН КАК ИНН,
	               |	С.Организация.КПП КАК КПП,
	               |	С.Организация.НаименованиеПолное КАК НаименованиеПолное,
	               |	С.Организация.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	               |	С.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
	               |	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьНаименование,
				   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
	               |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	               |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	               |ГДЕ
	               |	С.Агент = &Агент";
	КонецЕсли;
	Запрос.УстановитьПараметр("Агент", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаОрг = Результат.Выбрать();
	ТекОрганизация=Неопределено; 
	Если Результат.Пустой() = ЛОЖЬ Тогда
		Пока ВыборкаОрг.Следующий() Цикл
			//Если ВыборкаОрг.Организация <> ТекОрганизация Тогда
				ТекДатаПриема	= Макс(ВыборкаОрг.Период,ВыборкаОрг.Период2);
				ТекОрганизация	= ВыборкаОрг.Организация;
			//КонецЕсли;	
		КонецЦикла;
	Иначе	
		Сообщить("Нельзя распечатать договор, т.к. сотрудник нигде не работает!");
		Возврат Неопределено;
	КонецЕсли;
	
	
	//паспортные данные ФЛ
	ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	Если ДанныеФизЛица = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("По физическому лицу нет паспортных данных!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	ТекПаспортФЛ		= ДанныеФизЛица.ДокументСерия + " " + ДанныеФизЛица.ДокументНомер;
	ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;
	
	ОбластьШапка.Параметры.НомерДоговора						= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	ОбластьШапка.Параметры.ОрганизацияАгент_НаименованиеПолное	= ТекОрганизация.НаименованиеПолное;
	ОбластьШапка.Параметры.ФИОПолностью = уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ДатаДоговора = Формат(ТекДатаПриема, "ДЛФ=ДД");
	
	//ОбластьШапка.Параметры.ОрганизацияНаименование = ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов; 
	//ОбластьШапка.Параметры.ОрганизацияИНН          = ВыборкаОрг.ИНН;
	//ОбластьШапка.Параметры.ОрганизацияОГРН         = ВыборкаОрг.ОГРН;
	//ОбластьШапка.Параметры.ОрганизацияАдрес        = ;
	
	//по организации и по дате приема получим руководителя
	ТекРук = уб_ПФ.ДайРуководителя(ТекОрганизация, ТекущаяДата());
	ТекРуководитель = ТекРук.ФизическоеЛицо;
		
	ОбластьШапка.Параметры.Руководитель_Должность_РП	= уб_ПФ.ДайНаименованиеДолжностиОтветственногоЛица(ТекОрганизация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ТекДатаПриема, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.Руководитель_ФИОПолностью_РП = уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ОснованиеДействия_РП			= ФункцииРасширения.Должность_Склонение(уб_ПФ.ОснованиеДействияОтветственногоЛица(ТекРук, Ложь), Перечисления.Падежи.Родительный);	
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	//получаем данные из РС "КонтактнаяИнформация" для Организации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ТекОрганизация);
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	ТекЮрАдрес = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации ,"Вид");
	Если ТекЮрАдрес<>Неопределено Тогда
		ОбластьТело.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
	//	ОбластьШапка.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
	КонецЕсли;
	Телефон = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид");
	Если Телефон<>Неопределено Тогда
		ОбластьТело.Параметры.Телефон = Телефон.Представление;
	//	ОбластьШапка.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
	КонецЕсли;
	
	ТекФактАдрес = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации ,"Вид");
	Если ТекФактАдрес<>Неопределено Тогда
		ОбластьТело.Параметры.ФактАдрес = ТекФактАдрес.Представление;
	ИначеЕсли ТекЮрАдрес<>Неопределено Тогда
		ОбластьТело.Параметры.ФактАдрес = ТекЮрАдрес.Представление;
	КонецЕсли;	
	ОбластьТело.Параметры.ДатаКонца = Формат(КонецГода(ТекущаяДата()),"ДФ=dd.MM.yyyy");
	
	ОбластьТело.Параметры.ИНН			= ВыборкаОрг.ИНН;
	ОбластьТело.Параметры.КПП			= ВыборкаОрг.КПП;
	ОбластьТело.Параметры.Банк			= ВыборкаОрг.БанкНаименование;
	ОбластьТело.Параметры.КорСчет		= ВыборкаОрг.БанкКоррСчет;
	ОбластьТело.Параметры.РасчетныйСчет	= ВыборкаОрг.НомерСчета;
	ОбластьТело.Параметры.БИК			= ВыборкаОрг.БИК;
//	ОбластьТело.Параметры.ОГРН			= ВыборкаОрг.ОГРН;
	
	
	ОбластьШапка.Параметры.ФИОПолностью 		= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь);
	ОбластьТело.Параметры.ФИОПолностью			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь);
	ОбластьТело.Параметры.ДатаРождения			= Формат(Ссылка.ДатаРождения, "ДЛФ=Д")+ "г.";
	ОбластьТело.Параметры.ПаспортФЛ				= ТекПаспортФЛ;
	ОбластьТело.Параметры.ДатаВыдачи			= ТекДатаВыдачи + "г.";
	ОбластьТело.Параметры.КемВыдан				= ТекКемВыдан;
	ОбластьТело.Параметры.НаименованиеОрганизацииКратко	= ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьТело.Параметры.ИННФЛ			= Ссылка.ИНН;//, "ДЛФ=Д")+ "г.";
	ОбластьТело.Параметры.СНИЛС			= Ссылка.СтраховойНомерПФР;
	
	//получаем данные из РС "КонтактнаяИнформация" для ФизЛица
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	ТекФактАдресФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания ,"Вид");
	Если ТекФактАдресФЛ<>Неопределено Тогда
		ОбластьТело.Параметры.ФактАдресФЛ = ТекФактАдресФЛ.Представление;
	КонецЕсли;	
	
	ТекАдресРегистрацииФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке ,"Вид");
	Если ТекАдресРегистрацииФЛ<>Неопределено Тогда
		ОбластьТело.Параметры.АдресРегистрацииФЛ = ТекАдресРегистрацииФЛ.Представление;
	КонецЕсли;	
	
	ТекМобТелефонФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаМобильный ,"Вид");
	Если ТекМобТелефонФЛ<>Неопределено Тогда
		ОбластьТело.Параметры.МобТелефонФЛ = ТекМобТелефонФЛ.Представление;
	КонецЕсли;	
	
	ТекДомТелефонФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний ,"Вид");
	Если ТекДомТелефонФЛ<>Неопределено Тогда
		ОбластьТело.Параметры.ДомТелефонФЛ = ТекДомТелефонФЛ.Представление;
	КонецЕсли;	
	
	//ТекЭлПочтаФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыФизЛица ,"Вид");
	//Если ТекЭлПочтаФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.ЭлПочтаФЛ = ТекЭлПочтаФЛ.Представление;
	//КонецЕсли;	
	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.Вывести(ОбластьТело);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Должность						= уб_ПФ.ДайНаименованиеДолжностиРуководителя(ТекОрганизация, ТекДатаПриема);
	ОбластьПодвал.Параметры.НаименованиеОрганизацииКратко	= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьПодвал.Параметры.ФИОРуководительКратко			= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Истина);
	ОбластьПодвал.Параметры.ФИОФизЛицоКратко				= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина);
	ТабДокумент.Вывести(ОбластьПодвал);	
	
	ТабДокумент.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДокумент.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение	= ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница		= 1;
	HКлн.Выводить				= Истина;
	HКлн.ТекстСлева				= ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов+". Субагентский договор №"+Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	HКлн.ТекстСправа			= " стр. [&НомерСтраницы] из [&СтраницВсего]";
	HКлн.Шрифт 					= Новый Шрифт(,7);
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	Возврат ТабДокумент;

КонецФункции

Функция СоглашениеОНеразглашении(Кнопка,параметры = Неопределено) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;	
	Макет = ПолучитьМакет("СоглашениеОНеразглашении");
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("все");	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	С.Период,
		               |	С.Агент,
		               |	С.Выбытие,
		               |	С.Подразделение,
		               |	Организации.Ссылка КАК Организация,
		               |	Организации.ОГРН КАК ОГРН,
		               |	Организации.ИНН КАК ИНН,
		               |	Организации.КПП КАК КПП,
		               |	Организации.НаименованиеПолное КАК НаименованиеПолное,
		               |	Организации.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
		               |	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		               |	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
					   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
		               |ИЗ
		               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		               |		ПО (Организации.Ссылка = &ТекОрганизация)
					   
	               
				   |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
				   |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		               |ГДЕ
		               |	С.Агент = &Агент";
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Иначе	
	Запрос.Текст = "ВЫБРАТЬ
	               |	С.Период КАК Период,
	               |	С.Агент КАК Агент,
	               |	С.Выбытие КАК Выбытие,
	               |	С.Подразделение КАК Подразделение,
	               |	С.Организация КАК Организация,
	               |	С.Организация.ОГРН КАК ОГРН,
	               |	С.Организация.ИНН КАК ИНН,
	               |	С.Организация.КПП КАК КПП,
	               |	С.Организация.НаименованиеПолное КАК НаименованиеПолное,
	               |	С.Организация.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	               |	С.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
	               |	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьНаименование,
				   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
	               |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	               |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	               |ГДЕ
	               |	С.Агент = &Агент";
	КонецЕсли;
	Запрос.УстановитьПараметр("Агент", Ссылка);

	Результат = Запрос.Выполнить();
	ВыборкаОрг = Результат.Выбрать();
	ТекОрганизация=Неопределено; 
	Если Результат.Пустой() = ЛОЖЬ Тогда
		Пока ВыборкаОрг.Следующий() Цикл
			//Если ВыборкаОрг.Организация <> ТекОрганизация Тогда
				ТекДатаПриема	= Макс(ВыборкаОрг.Период,ВыборкаОрг.Период2);
				ТекОрганизация	= ВыборкаОрг.Организация;
			//КонецЕсли;	
		КонецЦикла;
	Иначе	
		Сообщить("Нельзя распечатать договор, т.к. сотрудник нигде не работает!");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ТекОрганизация.Пустая() Тогда
		этоИП = ТекОрганизация.ЭтоИндивидуальныйПредприниматель ИЛИ ТекОрганизация.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо;
		ОбластьШапка.Параметры.ИНН			= ?(этоИП,?(ТекОрганизация.ИндивидуальныйПредприниматель.Пустая(),"",ТекОрганизация.ИндивидуальныйПредприниматель.ИНН),ТекОрганизация.ИНН);
		ОбластьШапка.Параметры.КПП			= ?(этоИП,"","КПП: "+ТекОрганизация.КПП);
	Иначе
		Сообщить("Нельзя распечатать договор, т.к. неопределено место работы!");
		Возврат Неопределено;
	КонецЕсли;	
	Кэш = Новый Соответствие;
	СписокПоказателей = Новый Массив;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организации.Ссылка,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Наименование, """") КАК НаименованиеБанка,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Код, """") КАК БИК,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.НомерСчета, """") КАК НомерСчета,
	|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.КоррСчет, """") КАК Кор,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ФактАдресОрганизации,
	|	ЕСТЬNULL(КонтактнаяИнформация2.Представление, """") КАК ЮрАдресОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = Организации.Ссылка)
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация2
	|		ПО (КонтактнаяИнформация2.Объект = Организации.Ссылка)
	|			И (КонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮРАдресОрганизации))
	|ГДЕ
	|	Организации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ТекОрганизация);					  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.Заполнить(Выборка);
	КонецЕсли;		
	//паспортные данные ФЛ
	ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	Если ДанныеФизЛица = Неопределено Тогда
		#Если Клиент Тогда
		Предупреждение("По физическому лицу нет паспортных данных!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	ТекПаспортФЛ		= "Серия "+ДанныеФизЛица.ДокументСерия + " Номер " + ДанныеФизЛица.ДокументНомер;
	ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;
	КодПодразделения = ДанныеФизЛица.ДокументКодПодразделения;
	//ОбластьШапка.Параметры.НомерДоговора			= Прав(ТекНомерПаспорта, 4);
	ОбластьШапка.Параметры.НомерДоговора						= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	ОбластьШапка.Параметры.ТекДатаПриема 			= Формат(ТекДатаПриема, "ДФ= гг/ММ/дд");
	Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(ТекДатаПриема) Тогда
		ОбластьШапка.Параметры.ТекДата 				= Формат(ТекДатаПриема, "ДФ=dd.MM.yyyy");
	Иначе	
		ОбластьШапка.Параметры.ТекДата 					= Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	ОбластьШапка.Параметры.ОрганизацияАгент			= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьШапка.Параметры.ФИОФизЛицоПолное			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Именительный);
	ОбластьШапка.Параметры.ФИОФизЛицоКраткое		= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина, Перечисления.Падежи.Именительный);
	ОбластьШапка.Параметры.ФИОРуководительПолноеРП	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ФИОРуководительКраткое	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Истина, Перечисления.Падежи.Именительный);	
	ОбластьШапка.Параметры.ТекКемВыдан = ТекКемВыдан;
	ОбластьШапка.Параметры.ТекПаспортФЛ = ТекПаспортФЛ;
	ОбластьШапка.Параметры.КодПодразделения = КодПодразделения;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	ТекАдресРегистрацииФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке ,"Вид");
	ТекФактАдресФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания ,"Вид");
	Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
		ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекАдресРегистрацииФЛ.Представление;
	Иначе
		Если ТекФактАдресФЛ <> Неопределено Тогда
			ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекФактАдресФЛ.Представление;
		КонецЕсли;	
	КонецЕсли;	
	Если ТекФактАдресФЛ <> Неопределено Тогда
		ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекФактАдресФЛ.Представление;
	Иначе
		Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
			ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекАдресРегистрацииФЛ.Представление;
		КонецЕсли;	
	КонецЕсли;	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	//ТабДокумент.Показать("Соглашение о неразглашении");
	Возврат ТабДокумент;

	
КонецФункции

Функция ДоговорМОЛ(Кнопка,Параметры = Неопределено) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;	
	Макет = ПолучитьМакет("ДоговорМОЛ");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	С.Период,
	|	С.Агент,
	|	С.Выбытие,
	|	С.Подразделение,
	|	С.Организация
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПервых КАК С
	|ГДЕ
	|	С.Агент = &Агент";	
	Запрос.УстановитьПараметр("Агент", Ссылка);	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Если Выборка.Следующий() Тогда
		ТекДатаПриема	= Выборка.Период;
		ТекОрганизация	= Выборка.Организация;
	Иначе	
		Сообщить("Нельзя распечатать договор, т.к. сотрудник нигде не работает!");
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	//паспортные данные ФЛ
	ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	Если ДанныеФизЛица = Неопределено Тогда
		#Если Клиент Тогда
		Предупреждение("По физическому лицу нет паспортных данных!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	ТекПаспортФЛ		= ДанныеФизЛица.ДокументСерия + " " + ДанныеФизЛица.ДокументНомер;
	ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;	
	ОбластьШапка.Параметры.НомерДоговора			= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,5);
	ОбластьШапка.Параметры.ОрганизацияАгент			= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьШапка.Параметры.ФИОФизЛицоПолное			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ФИОРуководительПолноеРП	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	//
	ТабДокумент.Вывести(ОбластьШапка);
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//
	ОбластьПодвал.Параметры.ОрганизацияАгент	= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьПодвал.Параметры.ДатаДоговора		= Формат(ТекДатаПриема, "ДЛФ=Д") + " г.";
	ОбластьПодвал.Параметры.ФИОФизЛицоКратко	= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина);	
	ТабДокумент.Вывести(ОбластьПодвал);
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	//ТабДокумент.Показать("Договор о материальной ответственности");
	ТабДокумент.Вывод = ?(Уб_Кэшируемые.ДоступностьРоли("ПолныеПрава,уб_ДопРольУправлениеПерсоналом"),ИспользованиеВывода.Разрешить,ИспользованиеВывода.авто);
	Возврат ТабДокумент;

	
	Возврат ТабДокумент
КонецФункции


Функция ДопДоговор(Кнопка,Параметры = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("ДоговорСубагентскийДС");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывод = ?(УБ_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ,ПолныеПрава,уб_ДопРольУправлениеПерсоналом"),ИспользованиеВывода.Разрешить,ИспользованиеВывода.Авто);
	
	

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	С.Период,
		               |	С.Агент,
		               |	С.Выбытие,
		               |	С.Подразделение,
		               |	Организации.Ссылка КАК Организация,
		               |	Организации.ОГРН КАК ОГРН,
		               |	Организации.ИНН КАК ИНН,
		               |	Организации.КПП КАК КПП,
		               |	Организации.НаименованиеПолное КАК НаименованиеПолное,
		               |	Организации.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
		               |	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		               |	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
					   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
		               |ИЗ
		               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		               |		ПО (Организации.Ссылка = &ТекОрганизация)
					   
	               
				   |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
				   |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		               |ГДЕ
		               |	С.Агент = &Агент";
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Иначе	
	Запрос.Текст = "ВЫБРАТЬ
	               |	С.Период КАК Период,
	               |	С.Агент КАК Агент,
	               |	С.Выбытие КАК Выбытие,
	               |	С.Подразделение КАК Подразделение,
	               |	С.Организация КАК Организация,
	               |	С.Организация.ОГРН КАК ОГРН,
	               |	С.Организация.ИНН КАК ИНН,
	               |	С.Организация.КПП КАК КПП,
	               |	С.Организация.НаименованиеПолное КАК НаименованиеПолное,
	               |	С.Организация.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	               |	С.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
	               |	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьНаименование,
				   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
	               |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	               |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	               |ГДЕ
	               |	С.Агент = &Агент";
	КонецЕсли;
	Запрос.УстановитьПараметр("Агент", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаОрг = Результат.Выбрать();
	ТекОрганизация=Неопределено; 
	Если Результат.Пустой() = ЛОЖЬ Тогда
		Пока ВыборкаОрг.Следующий() Цикл
			//Если ВыборкаОрг.Организация <> ТекОрганизация Тогда
				ТекДатаПриема	= Макс(ВыборкаОрг.Период,ВыборкаОрг.Период2);
				ТекОрганизация	= ВыборкаОрг.Организация;
			//КонецЕсли;	
		КонецЦикла;
	Иначе	
		Сообщить("Нельзя распечатать договор, т.к. сотрудник нигде не работает!");
		Возврат Неопределено;
	КонецЕсли;
	
	
	//паспортные данные ФЛ
	ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	Если ДанныеФизЛица = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("По физическому лицу нет паспортных данных!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	ТекПаспортФЛ		= ДанныеФизЛица.ДокументСерия + " " + ДанныеФизЛица.ДокументНомер;
	ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;
	
	ОбластьШапка.Параметры.НомерДоговора						= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	ОбластьШапка.Параметры.ОрганизацияАгент_НаименованиеПолное	= ТекОрганизация.НаименованиеПолное;
	ОбластьШапка.Параметры.ФИОПолностью = уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	Если НЕ НачалоМесяца(ТекущаяДата()) = НачалоМесяца(ТекДатаПриема) Тогда
		ТекДатаПриема = ТекущаяДата();
	КонецЕсли;	
	ОбластьШапка.Параметры.ДатаДоговора = Формат(ТекДатаПриема, "ДЛФ=ДД");
	
	//ОбластьШапка.Параметры.ОрганизацияНаименование = ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов; 
	//ОбластьШапка.Параметры.ОрганизацияИНН          = ВыборкаОрг.ИНН;
	//ОбластьШапка.Параметры.ОрганизацияОГРН         = ВыборкаОрг.ОГРН;
	//ОбластьШапка.Параметры.ОрганизацияАдрес        = ;
	
	//по организации и по дате приема получим руководителя
	ТекРук = уб_ПФ.ДайРуководителя(ТекОрганизация, ТекущаяДата());
	ТекРуководитель = ТекРук.ФизическоеЛицо;
		
	ОбластьШапка.Параметры.Руководитель_Должность_РП	= уб_ПФ.ДайНаименованиеДолжностиОтветственногоЛица(ТекОрганизация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ТекДатаПриема, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.Руководитель_ФИОПолностью_РП = уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	ОбластьШапка.Параметры.ОснованиеДействия_РП			= ФункцииРасширения.Должность_Склонение(уб_ПФ.ОснованиеДействияОтветственногоЛица(ТекРук, Ложь), Перечисления.Падежи.Родительный);	
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ОбластьТело.Параметры.НомерДоговора						= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	
//	//получаем данные из РС "КонтактнаяИнформация" для Организации
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	КонтактнаяИнформация.Объект,
//	|	КонтактнаяИнформация.Тип,
//	|	КонтактнаяИнформация.Вид,
//	|	КонтактнаяИнформация.Представление
//	|ИЗ
//	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
//	|ГДЕ
//	|	КонтактнаяИнформация.Объект = &Объект";
//	
//	Запрос.УстановитьПараметр("Объект", ТекОрганизация);
//	
//	Результат = Запрос.Выполнить();
//	ТЗ = Результат.Выгрузить();
//	
//	ТекЮрАдрес = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации ,"Вид");
//	Если ТекЮрАдрес<>Неопределено Тогда
//		ОбластьТело.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
//	//	ОбластьШапка.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
//	КонецЕсли;
//	Телефон = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид");
//	Если Телефон<>Неопределено Тогда
//		ОбластьТело.Параметры.Телефон = Телефон.Представление;
//	//	ОбластьШапка.Параметры.ЮрАдрес = ТекЮрАдрес.Представление;
//	КонецЕсли;
//	
//	ТекФактАдрес = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации ,"Вид");
//	Если ТекФактАдрес<>Неопределено Тогда
//		ОбластьТело.Параметры.ФактАдрес = ТекФактАдрес.Представление;
//	ИначеЕсли ТекЮрАдрес<>Неопределено Тогда
//		ОбластьТело.Параметры.ФактАдрес = ТекЮрАдрес.Представление;
//	КонецЕсли;	
//	ОбластьТело.Параметры.ДатаКонца = Формат(КонецГода(ТекущаяДата()),"ДФ=dd.MM.yyyy");
//	
//	ОбластьТело.Параметры.ИНН			= ВыборкаОрг.ИНН;
//	ОбластьТело.Параметры.КПП			= ВыборкаОрг.КПП;
//	ОбластьТело.Параметры.Банк			= ВыборкаОрг.БанкНаименование;
//	ОбластьТело.Параметры.КорСчет		= ВыборкаОрг.БанкКоррСчет;
//	ОбластьТело.Параметры.РасчетныйСчет	= ВыборкаОрг.НомерСчета;
//	ОбластьТело.Параметры.БИК			= ВыборкаОрг.БИК;
////	ОбластьТело.Параметры.ОГРН			= ВыборкаОрг.ОГРН;
	
	
	ОбластьШапка.Параметры.ФИОПолностью 		= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь);
	//ОбластьТело.Параметры.ФИОПолностью			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь);
	//ОбластьТело.Параметры.ДатаРождения			= Формат(Ссылка.ДатаРождения, "ДЛФ=Д")+ "г.";
	//ОбластьТело.Параметры.ПаспортФЛ				= ТекПаспортФЛ;
	//ОбластьТело.Параметры.ДатаВыдачи			= ТекДатаВыдачи + "г.";
	//ОбластьТело.Параметры.КемВыдан				= ТекКемВыдан;
	//ОбластьТело.Параметры.НаименованиеОрганизацииКратко	= ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов;
	//ОбластьТело.Параметры.ИННФЛ			= Ссылка.ИНН;//, "ДЛФ=Д")+ "г.";
	//ОбластьТело.Параметры.СНИЛС			= Ссылка.СтраховойНомерПФР;
	
	//получаем данные из РС "КонтактнаяИнформация" для ФизЛица
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	//ТекФактАдресФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания ,"Вид");
	//Если ТекФактАдресФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.ФактАдресФЛ = ТекФактАдресФЛ.Представление;
	//КонецЕсли;	
	//
	//ТекАдресРегистрацииФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке ,"Вид");
	//Если ТекАдресРегистрацииФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.АдресРегистрацииФЛ = ТекАдресРегистрацииФЛ.Представление;
	//КонецЕсли;	
	//
	//ТекМобТелефонФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаМобильный ,"Вид");
	//Если ТекМобТелефонФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.МобТелефонФЛ = ТекМобТелефонФЛ.Представление;
	//КонецЕсли;	
	//
	//ТекДомТелефонФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний ,"Вид");
	//Если ТекДомТелефонФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.ДомТелефонФЛ = ТекДомТелефонФЛ.Представление;
	//КонецЕсли;	
	ОбластьТело.Параметры.НомерДоговора = ОбластьШапка.Параметры.НомерДоговора;
	
	//ТекЭлПочтаФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыФизЛица ,"Вид");
	//Если ТекЭлПочтаФЛ<>Неопределено Тогда
	//	ОбластьТело.Параметры.ЭлПочтаФЛ = ТекЭлПочтаФЛ.Представление;
	//КонецЕсли;	
	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.Вывести(ОбластьТело);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Должность						= уб_ПФ.ДайНаименованиеДолжностиРуководителя(ТекОрганизация, ТекДатаПриема);
	ОбластьПодвал.Параметры.НаименованиеОрганизацииКратко	= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	ОбластьПодвал.Параметры.ФИОРуководительКратко			= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Истина);
	ОбластьПодвал.Параметры.ФИОФизЛицоКратко				= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина);
	ТабДокумент.Вывести(ОбластьПодвал);	
	
	//ТабДокумент.РазмерКолонтитулаСнизу = 8;
	//HКлн = ТабДокумент.НижнийКолонтитул;
	//HКлн.ВертикальноеПоложение	= ВертикальноеПоложение.Низ;
	//HКлн.НачальнаяСтраница		= 1;
	//HКлн.Выводить				= Истина;
	//HКлн.ТекстСлева				= ВыборкаОрг.НаименованиеДляДоговоровИПлатежныхДокументов+". Субагентский договор №"+Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	//HКлн.ТекстСправа			= " стр. [&НомерСтраницы] из [&СтраницВсего]";
	//HКлн.Шрифт 					= Новый Шрифт(,7);
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	Возврат ТабДокумент;

КонецФункции


Функция ПриложениеПД(Кнопка,параметры = Неопределено) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;	
	Макет = ПолучитьМакет("ПриложениеПД");
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("все");	
	Если Не Параметры = Неопределено Тогда
		Если Параметры.Свойство("Организация") Тогда
			ТекОрганизация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	С.Период,
		               |	С.Агент,
		               |	С.Выбытие,
		               |	С.Подразделение,
		               |	Организации.Ссылка КАК Организация,
		               |	Организации.ОГРН КАК ОГРН,
		               |	Организации.ИНН КАК ИНН,
		               |	Организации.КПП КАК КПП,
		               |	Организации.НаименованиеПолное КАК НаименованиеПолное,
		               |	Организации.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
		               |	Организации.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
		               |	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
		               |	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
					   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
		               |ИЗ
		               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		               |		ПО (Организации.Ссылка = &ТекОрганизация)
					   
	               
				   |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
				   |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		               |ГДЕ
		               |	С.Агент = &Агент";
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Иначе	
	Запрос.Текст = "ВЫБРАТЬ
	               |	С.Период КАК Период,
	               |	С.Агент КАК Агент,
	               |	С.Выбытие КАК Выбытие,
	               |	С.Подразделение КАК Подразделение,
	               |	С.Организация КАК Организация,
	               |	С.Организация.ОГРН КАК ОГРН,
	               |	С.Организация.ИНН КАК ИНН,
	               |	С.Организация.КПП КАК КПП,
	               |	С.Организация.НаименованиеПолное КАК НаименованиеПолное,
	               |	С.Организация.НаименованиеДляДоговоровИПлатежныхДокументов КАК НаименованиеДляДоговоровИПлатежныхДокументов,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Наименование КАК БанкНаименование,
	               |	С.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	               |	С.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
	               |	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьНаименование,
				   |    ОтветственныеЛицаОрганизацийСрезПоследних.Период как период2
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям КАК С
	               |		Левое СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, СтруктурнаяЕдиница = &ТекОрганизация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	               |		ПО ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	               |ГДЕ
	               |	С.Агент = &Агент";
	КонецЕсли;
	Запрос.УстановитьПараметр("Агент", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаОрг = Результат.Выбрать();
	ТекОрганизация=Неопределено; 
	Если Результат.Пустой() = ЛОЖЬ Тогда
		Пока ВыборкаОрг.Следующий() Цикл
			//Если ВыборкаОрг.Организация <> ТекОрганизация Тогда
				ТекДатаПриема	= Макс(ВыборкаОрг.Период,ВыборкаОрг.Период2);
				ТекОрганизация	= ВыборкаОрг.Организация;
			//КонецЕсли;	
		КонецЦикла;
	Иначе	
		Сообщить("Нельзя распечатать договор, т.к. сотрудник нигде не работает!");
		Возврат Неопределено;
	КонецЕсли;

	//
	//Если Не ТекОрганизация.Пустая() Тогда
	//	этоИП = ТекОрганизация.ЭтоИндивидуальныйПредприниматель ИЛИ ТекОрганизация.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо;
	//	ОбластьШапка.Параметры.ИНН			= ?(этоИП,?(ТекОрганизация.ИндивидуальныйПредприниматель.Пустая(),"",ТекОрганизация.ИндивидуальныйПредприниматель.ИНН),ТекОрганизация.ИНН);
	//	ОбластьШапка.Параметры.КПП			= ?(этоИП,"","КПП: "+ТекОрганизация.КПП);
	//Иначе
	//	Сообщить("Нельзя распечатать договор, т.к. неопределено место работы!");
	//	Возврат Неопределено;
	//КонецЕсли;	
	//Кэш = Новый Соответствие;
	//СписокПоказателей = Новый Массив;
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	Организации.Ссылка,
	//|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Наименование, """") КАК НаименованиеБанка,
	//|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.Код, """") КАК БИК,
	//|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.НомерСчета, """") КАК НомерСчета,
	//|	ЕСТЬNULL(Организации.ОсновнойБанковскийСчет.Банк.КоррСчет, """") КАК Кор,
	//|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ФактАдресОрганизации,
	//|	ЕСТЬNULL(КонтактнаяИнформация2.Представление, """") КАК ЮрАдресОрганизации
	//|ИЗ
	//|	Справочник.Организации КАК Организации
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|		ПО (КонтактнаяИнформация.Объект = Организации.Ссылка)
	//|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация2
	//|		ПО (КонтактнаяИнформация2.Объект = Организации.Ссылка)
	//|			И (КонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮРАдресОрганизации))
	//|ГДЕ
	//|	Организации.Ссылка = &Ссылка");
	//Запрос.УстановитьПараметр("Ссылка",ТекОрганизация);					  
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ОбластьШапка.Параметры.Заполнить(Выборка);
	//КонецЕсли;		
	//паспортные данные ФЛ
	ДанныеФизЛица = уб_ПФ.ДайПаспортныеДанныеФизлица(Ссылка, Истина);
	Если ДанныеФизЛица = Неопределено Тогда
		#Если Клиент Тогда
		Предупреждение("По физическому лицу нет паспортных данных!");
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	ТекНомерПаспорта	= ДанныеФизЛица.ДокументНомер;
	ТекПаспортФЛ		= "Серия "+ДанныеФизЛица.ДокументСерия + " Номер " + ДанныеФизЛица.ДокументНомер;
	ТекДатаВыдачи		= Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДЛФ=Д");
	ТекКемВыдан			= ДанныеФизЛица.ДокументКемВыдан;
	КодПодразделения = ДанныеФизЛица.ДокументКодПодразделения;
//	ОбластьШапка.Параметры.НомерДоговора			= Прав(ТекНомерПаспорта, 4);
	ОбластьШапка.Параметры.НомерДоговора						= "" + Формат(ТекДатаПриема, "ДФ= гг/ММ/дд") + "-" + Прав(ТекНомерПаспорта,4);
	Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(ТекДатаПриема) Тогда
		ОбластьШапка.Параметры.ТекДатаПриема	= Формат(ТекДатаПриема, "ДФ=dd.MM.yyyy");
	Иначе	
		ОбластьШапка.Параметры.ТекДатаПриема	= Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	//ОбластьШапка.Параметры.ТекДата 					= Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	//ОбластьШапка.Параметры.ОрганизацияАгент			= ТекОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	//ОбластьШапка.Параметры.ФИОФизЛицоПолное			= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Ложь, Перечисления.Падежи.Именительный);
	ОбластьШапка.Параметры.ФИОФизЛицоКраткое		= уб_Кэшируемые.ФИОФизлицаСтрокой(Ссылка, ТекДатаПриема, Истина, Перечисления.Падежи.Именительный);
	//ОбластьШапка.Параметры.ФИОРуководительПолноеРП	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Ложь, Перечисления.Падежи.Родительный);
	//ОбластьШапка.Параметры.ФИОРуководительКраткое	= уб_ПФ.ДайФИОРуководителя(ТекОрганизация, ТекДатаПриема, Истина, Перечисления.Падежи.Именительный);	
	//ОбластьШапка.Параметры.ТекКемВыдан = ТекКемВыдан;
	//ОбластьШапка.Параметры.ТекПаспортФЛ = ТекПаспортФЛ;
	//ОбластьШапка.Параметры.КодПодразделения = КодПодразделения;	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КонтактнаяИнформация.Объект,
	//|	КонтактнаяИнформация.Тип,
	//|	КонтактнаяИнформация.Вид,
	//|	КонтактнаяИнформация.Представление
	//|ИЗ
	//|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ГДЕ
	//|	КонтактнаяИнформация.Объект = &Объект";
	//Запрос.УстановитьПараметр("Объект", Ссылка);
	//Результат = Запрос.Выполнить();
	//ТЗ = Результат.Выгрузить();
	//ТекАдресРегистрацииФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке ,"Вид");
	//ТекФактАдресФЛ = ТЗ.Найти(Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПроживания ,"Вид");
	//Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
	//	ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекАдресРегистрацииФЛ.Представление;
	//Иначе
	//	Если ТекФактАдресФЛ <> Неопределено Тогда
	//		ОбластьШапка.Параметры.АдресРегистрацииФЛ = ТекФактАдресФЛ.Представление;
	//	КонецЕсли;	
	//КонецЕсли;	
	//Если ТекФактАдресФЛ <> Неопределено Тогда
	//	ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекФактАдресФЛ.Представление;
	//Иначе
	//	Если ТекАдресРегистрацииФЛ <> Неопределено Тогда
	//		ОбластьШапка.Параметры.АдресПроживанияФЛ = ТекАдресРегистрацииФЛ.Представление;
	//	КонецЕсли;	
	//КонецЕсли;	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	//ТабДокумент.Показать("Соглашение о неразглашении");
	Возврат ТабДокумент;

	
КонецФункции
#КонецОбласти
мДлинаСуток = 86400;

