
Функция ОшибкиСуммаШтрафа(
	СтраховойПолис,
	Знач ТекСтрока,  
	ПринудительнаяТекущаяДата 	= Ложь,
	ВыборкаЗапроса				= Неопределено) Экспорт 

	Штраф = 0;
	//устанавливаем выборку всех полей
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	О.*
	|ИЗ
	|	РегистрСведений.уб_Ошибки КАК О
	|ГДЕ
	|	О.Период = &Период И О.Объект = &Объект И О.УИД = &УИД");
	Запрос.УстановитьПараметр("Период", ТекСтрока.Период);
	Запрос.УстановитьПараметр("Объект", СтраховойПолис);
	Запрос.УстановитьПараметр("УИД",	ТекСтрока.УИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекСтрока = Выборка
	КонецЕсли;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.Статус.Родитель = Справочники.уб_СостоянияОшибок.Решено Тогда
			//сумма штрафа не расчетная
			Штраф = ТекСтрока.Штраф
		Иначе
			//нужно получить данные предыдущей записи регистра с этим УИД со статусом "Передано агенту"
			//для определения суммы штрафа
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	О.Период,
			|	О.КритическаяДата,
			|	О.Штраф
			|ИЗ
			|	РегистрСведений.уб_Ошибки.СрезПоследних(
			|			&Период,
			|			Объект = &Объект
			|				И УИД = &УИД
			|				И Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.ПереданоАгенту)
			|				И Срочно) КАК О");
			Запрос.УстановитьПараметр("Период", ТекСтрока.Период);
			Запрос.УстановитьПараметр("Объект", СтраховойПолис);
			Запрос.УстановитьПараметр("УИД",	ТекСтрока.УИД);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ВыборкаЗапроса = Выборка;
				Спр = Справочники.уб_СостоянияОшибок;
				Если ТекСтрока.Статус.Родитель = Спр.Решено	Тогда
					ТекПериод = ТекСтрока.Период
				Иначе
					ТекПериод = ?(ПринудительнаяТекущаяДата, ТекущаяДата(), ТекСтрока.Период);
				КонецЕсли;
				ПросрочкаВСекундах 	= Макс(0, ТекПериод - Выборка.КритическаяДата);
				ДнейПросрочки		= ПросрочкаВСекундах / 86400;
				ДнейПросрочки 		= ?(Цел(ДнейПросрочки) = ДнейПросрочки, ДнейПросрочки, Цел(ДнейПросрочки) + 1); 
				СуммаШтрафаЗаДень 	= ПараметрыСеанса.уб_Константы.СуммаШтрафаПоСрочнойОшибкеЗаДень;
				Если ТипЗнч(СуммаШтрафаЗаДень) <> Тип("Число") Тогда
					СуммаШтрафаЗаДень = 50;
				КонецЕсли;
				Штраф = Мин(1000, ДнейПросрочки * СуммаШтрафаЗаДень + Выборка.Штраф);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Штраф;
		//	Если Выборка.Следующий() Тогда
		//		//теперь находим когда она была завершена
		//		//TODO непонятно какой статус следует считать завершением, пусть пока будет «Завершено»
		//		Запрос = Новый Запрос(
		//		"ВЫБРАТЬ
		//		|	О.Период
		//		|ИЗ
		//		|	РегистрСведений.уб_Ошибки.СрезПервых(
		//		|			&Период,
		//		|			Объект = &Объект
		//		|				И УИД = &УИД
		//		|				И (Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.Завершено)
		//		|					ИЛИ Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.ОшибкаИсправлена)
		//		|					ИЛИ Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.ПереданоАгенту))) КАК О");
		//		Запрос.УстановитьПараметр("Период", Выборка.Период + 1);
		//		Запрос.УстановитьПараметр("Объект", СтраховойПолис);
		//		Запрос.УстановитьПараметр("УИД",	ТекСтрока.УИД);
		//		ВыборкаЗавершения = Запрос.Выполнить().Выбрать();			
		//		Если ВыборкаЗавершения.Следующий() Тогда
		//			//рассчитываем сумму штрафа за предыдущую срочную ошибку
		//			//число секунд просрочки
		//			ТекПериод = ВыборкаЗавершения.Период;
		//		Иначе
		//			ТекПериод = ?(ПринудительнаяТекущаяДата, ТекущаяДата(), ТекСтрока.Период);
		//		КонецЕсли;
		//		ПросрочкаВСекундах 	= Макс(0, ТекПериод - Выборка.КритическаяДата);
		//		ДнейПросрочки		= ПросрочкаВСекундах / 86400;
		//		ДнейПросрочки 		= ?(Цел(ДнейПросрочки) = ДнейПросрочки, ДнейПросрочки, Цел(ДнейПросрочки) + 1); 
		//		Штраф				= Мин(1000, ДнейПросрочки * 50 + Выборка.Штраф);
		//	Иначе
		//		//первая работа по срочной ошибке
		//	КонецЕсли;
		//КонецЕсли;	
		//Возврат Штраф;

КонецФункции // ОшибкиВыборкаСтатусаПереданоАгенту()

Функция ОшибкиПериода(ЗарплатныйПериод) Экспорт
	ЗапросПоСрочнымОшибкамДляЗП = Новый Запрос;
	ЗапросПоСрочнымОшибкамДляЗП.Текст = "ВЫБРАТЬ
	               |	О.Период,
	               |	О.КритическаяДата,
	               |	О.Штраф как ШтрафНачальный,
	               |	О.Объект,
	               |	О.УИД,
	               |	ТекущееСостояние.Статус,
	               |	ТекущееСостояние.Срочно,
	               |	ТекущееСостояние.Штраф КАК ШтрафТекущий,
	               |	ВЫБОР
	               |		КОГДА ТекущееСостояние.Статус.Родитель = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.Решено)
	               |			ТОГДА ТекущееСостояние.Штраф
	               |		ИНАЧЕ ВЫБОР
				   |				Когда &ТДата<=О.КритическаяДата Тогда
	               |					0
	               |				КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(О.КритическаяДата, &ТДата, СЕКУНДА) / 86400 - 0.5 КАК ЧИСЛО(15, 0))) * &СуммаШтрафаЗаДень+ О.Штраф > 1000
	               |					ТОГДА 1000
	               |				ИНАЧЕ (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(О.КритическаяДата, &ТДата, СЕКУНДА) / 86400 - 0.5 КАК ЧИСЛО(15, 0))) * &СуммаШтрафаЗаДень+ О.Штраф
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Штраф,
	               |	РАЗНОСТЬДАТ(О.КритическаяДата, &ТДата, СЕКУНДА) / 86400 КАК Поле1,
	               |	О.Объект.Дата,
				   |	ТекущееСостояние.Менеджер КАК Сотрудник
				   //|	ВЫБОР
				   //|		КОГДА ТекущееСостояние.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипыПодразделений.Менеджеры)
				   //|			ТОГДА О.Объект.Агент
				   //|		КОГДА ТекущееСостояние.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипыПодразделений.Курьеры)
				   //|			ТОГДА О.Объект.Курьер
				   //|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				   //|	КОНЕЦ КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.уб_Ошибки.СрезПоследних(
	               |			,
	               |			Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.ПереданоАгенту)
	               |				И Срочно) КАК О
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_Ошибки.СрезПоследних(, ) КАК ТекущееСостояние
	               |		ПО О.УИД = ТекущееСостояние.УИД
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(О.Объект.Дата, МЕСЯЦ) = &ЗарплатныйПериод";
	ЗапросПоСрочнымОшибкамДляЗП.УстановитьПараметр("ТДата",ТекущаяДата());
	СуммаШтрафаЗаДень 	= ПараметрыСеанса.уб_Константы.СуммаШтрафаПоСрочнойОшибкеЗаДень;
	Если ТипЗнч(СуммаШтрафаЗаДень) <> Тип("Число") Тогда
		СуммаШтрафаЗаДень = 50;
	КонецЕсли;
	ЗапросПоСрочнымОшибкамДляЗП.УстановитьПараметр("СуммаШтрафаЗаДень",СуммаШтрафаЗаДень);
	ЗапросПоСрочнымОшибкамДляЗП.УстановитьПараметр("ЗарплатныйПериод",НачалоМесяца(ЗарплатныйПериод));
	Возврат ЗапросПоСрочнымОшибкамДляЗП.Выполнить().Выгрузить();
КонецФункции	