&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СкрыватьМусор = Истина;
	СкрытьМусорНасервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	Группа = Элементы.Дерево.ТекущаяСтрока;
	ОбновитьДерево(Группа)
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДерево(Группа)
	Если ЗначениеЗаполнено(Группа) Тогда
		уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", Группа, ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
		уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоГруппа", ЛОЖЬ, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", Группа, ВидСравненияКомпоновкиДанных.ВИерархии,,ЛОЖЬ);
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Группа = Элементы.Дерево.ТекущаяСтрока;
	Если ЭтоСотрудники(Группа) Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта",Новый Структура("ЭтоСотрудник",Истина),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСотрудники(Группа)
	Возврат ЗначениеЗаполнено(Группа) и (Группа = Справочники.ФизическиеЛица.Сотрудники или Группа.ПринадлежитЭлементу(Справочники.ФизическиеЛица.Сотрудники));		
КонецФункции

&НаКлиенте
Процедура СкрыватьМусорПриИзменении(Элемент)
	СкрытьМусорНасервере();
КонецПроцедуры

&НаСервере
Процедура СкрытьМусорНасервере()
	уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", уб_ВызовСервера.ФизлицаГруппаМусор(), ВидСравненияКомпоновкиДанных.НеВИерархии,,СкрыватьМусор);	
	уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", ЛОЖЬ, ВидСравненияКомпоновкиДанных.Равно,,СкрыватьМусор);	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для каждого Строка из Строки Цикл
		а = 1;//Строка.Оформление["Ссылка"].Текст = "";
	//	Строка.Значение.Оформление["Ссылка"].УстановитьЗначениеПараметра("Текст",фСтрока());//Новый ФорматированнаяСтрока(Строка(Строка.Значение.Данные.Ссылка)));
	КонецЦикла;	
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция фСтрока()
//	ЦветСтиль = ВернутьЦветОсобогоТекстаНаСервере();
//     ШрифтСтиль= ВернутьШрифтИзСтиляНаСервер();
//     ШрифтДляСтроки1 = Новый Шрифт(ШрифтСтиль,,,Истина);
//     ШрифтДляСтроки2 = Новый Шрифт(ШрифтСтиль,,,,Истина);
//     ШрифтДляСтроки3 = Новый Шрифт(ШрифтСтиль,,,,,,Истина);

//     ФормСтрока1 = Новый ФорматированнаяСтрока("Последнее",ШрифтДляСтроки1,ЦветСтиль);
//     ФормСтрока2 = Новый ФорматированнаяСтрока("китайское",ШрифтДляСтроки2,ЦветСтиль);
//     ФормСтрока3 = Новый ФорматированнаяСтрока("предупреждение!",ШрифтДляСтроки3,ЦветСтиль);

//     Массив = Новый Массив;
//     Массив.Добавить(ФормСтрока1);
//     //Массив.Добавить(Символы.ПС);
//     Массив.Добавить(ФормСтрока2);
//     //Массив.Добавить(Символы.ПС);
//     Массив.Добавить(ФормСтрока3);

//     Возврат Новый ФорматированнаяСтрока(Массив);
// КонецФункции
// &НаСервереБезКонтекста
//Функция ВернутьЦветОсобогоТекстаНаСервере()
//      Возврат ЦветаСтиля.ЦветОсобогоТекста;
//КонецФункции

//&НаСервереБезКонтекста
//Функция ВернутьШрифтИзСтиляНаСервер()
//      Возврат ШрифтыСтиля.ОченьКрупныйШрифтТекста;
//КонецФункции




