
//Для запуска кода в режиме отладки
Функция Ду(Код, П = Неопределено, П1 = Неопределено,  П2 = Неопределено, П3 = Неопределено, П4 = Неопределено)  Экспорт
	
	Перем Р;
	Попытка
		Выполнить(Код)
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.Ду() ошибка кода программы. Код:
		|" + Код, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина)
	КонецПопытки;
	Возврат Р;
	
КонецФункции

//Для изменения значений переменных в режиме отладки
Функция Присвоить(А,Б) Экспорт
	А=Б; Возврат А;
КонецФункции	  

Процедура ДобСОО(ТзОшибки, СОО, oОплатыСписок = Неопределено, Статус = Неопределено, Откуда = Неопределено) Экспорт
	//SS Добавление СОО об Оплате
	Стр = ТзОшибки.Добавить();
	Стр.Ошибка = СОО;
	Стр.Элемент = oОплатыСписок;
	Стр.Строка = Неопределено;
	
	Если Откуда = "ОтчетАгента" Тогда
		Стр.Панель = Неопределено;
		Стр.Страница = Неопределено;
		
	ИначеЕсли Откуда = "СтраховойПолис" Тогда 	
		Стр.Панель = "ОсновнаяПанель";
		Стр.Страница = "Оплаты";
		
	ИначеЕсли Откуда = "РегистрОплат" Тогда 	
		Стр.Панель = Неопределено;
		Стр.Страница = Неопределено;
		
	Иначе
		Стр.Панель = Неопределено;
		Стр.Страница = Неопределено;
		
	КонецЕсли; 	
	
	Стр.Статус = ?(Статус = Неопределено,СтатусСообщения.Обычное,Статус);
КонецПроцедуры

// Получает пользователя по физлицу
//
// Параметры
//  Физлицо - ссылка на элемент справочника физлица
//
// Возвращаемое значение
//  Ссылка на элемент справочника Пользователи или Неопределено
//
Функция ПолучПользователяПоФизЛицу(оФизЛицо) Экспорт
	оПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", оФизЛицо);
	Если НЕ ЗначениеНеЗаполнено(оПользователь) Тогда
		Возврат оПользователь;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Получает контрагента или физлицо по пользователю
//
// Параметры
//  Пользователь - ссылка на элемент справочника Пользователи
//
// Возвращаемое значение
//  Ссылка на элемент справочника Контрагенты или ФизическиеЛица или Неопределено
//
Функция ПолучКонтрагентаИлиФизлицоПоПльзователю(оПользователь) Экспорт
	//В справочнике Контрагенты у сотрудника есть реквизит "Пользователь"
	//оКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("Пользователь", оПользователь);
	//Если НЕ ЗначениеНеЗаполнено(оКонтрагент) Тогда
	//	Возврат оКонтрагент;
	//КонецЕсли;
	
	Если НЕ оПользователь.ФизЛицо.Пустая() Тогда
		Возврат оПользователь.ФизЛицо;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПользователяПоАгенту(КонтрагентИлиФизЛицо) Экспорт 
	Если ТипЗнч(КонтрагентИлиФизЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		//Запрос ускорит дальнейшее получение реквизитов ссылки
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.ВерсияДанных,
		|	Пользователи.ПометкаУдаления,
		|	Пользователи.Предопределенный,
		|	Пользователи.Родитель,
		|	Пользователи.ЭтоГруппа,
		|	Пользователи.Код,
		|	Пользователи.Наименование,
		|	Пользователи.ФизЛицо,
		|	Пользователи.Профиль,
		|	Пользователи.Автор,
		|	Пользователи.ДатаСоздания,
		|	Пользователи.Модификатор,
		|	Пользователи.ДатаИзменения,
		|	Пользователи.Представление
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизЛицо = &ФизЛицо");
		Запрос.УстановитьПараметр("ФизЛицо",КонтрагентИлиФизЛицо);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка;
		КонецЕсли;	
		//	Возврат Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",КонтрагентИлиФизЛицо);		
		//48: реквизита пользователь нет у контрагентов	
		//ИначеЕсли ТипЗнч(КонтрагентИлиФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда	
		//	Если НЕ ЗначениеНеЗаполнено(КонтрагентИлиФизЛицо.Пользователь) Тогда
		//		Возврат КонтрагентИлиФизЛицо.Пользователь;
		//	КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#Если Клиент тогда
	Функция ПолучитьОрганизациюАгента(Агент) Экспорт 
		
		оПользователь = ПолучитьПользователяПоАгенту(Агент);
		Если оПользователь = Неопределено  ИЛИ  оПользователь.Ссылка = Справочники.Пользователи.ПустаяСсылка() Тогда
			//если пусто, то берем текущего пользователя
			Возврат ПараметрыСеанса.уб_ОсновнаяОрганизация;
		КонецЕсли;
		
		//Возвращаем основную организацию пользователя
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(оПользователь, "ОсновнаяОрганизация");
		Если НЕ ЗначениеНеЗаполнено(Организация) Тогда
			Возврат Организация;
		КонецЕсли;
		Возврат ПараметрыСеанса.уб_ОсновнаяОрганизация;
		
	КонецФункции
#КонецЕсли


//Получение Подразделения с назначенным МОЛ по БСО для переданного подразделения
// начиная с переданного подразделения
// по иерархии подразделений вверх, ищем такое, у которого одновременно 
// указано "Учет БСО" и установлен МОЛ по БСО
//
&НаСервере
Функция ПолучитьПодразделениеМОЛпоБСО(Подразделение) Экспорт
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Подразделение.УчетБСО И ЗначениеЗаполнено(Подразделение.МОЛпоБСО) Тогда
		Возврат Подразделение;
	Иначе
		Возврат ПолучитьПодразделениеМОЛпоБСО(Подразделение.Родитель);
	КонецЕсли;
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция ПрочитатьФИОФизЛица(ФизЛицо, Падеж = Неопределено) Экспорт
	ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(,Новый Структура("ФизЛицо",ФизЛицо));
	Если ПустаяСтрока(ФИОСрез.Фамилия + ФИОСрез.Имя + ФИОСрез.Отчество) Тогда
		ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(,Новый Структура("ФизЛицо",ФизЛицо));
	КонецЕсли;
	Возврат (ФИОСрез.Фамилия + " " + ФИОСрез.Имя + " " + ФИОСрез.Отчество);
КонецФункции

Функция ССПрочитСостБСО(СК, ВидБСО, НомерБСО, дПериод = Неопределено, Поставщик = Неопределено, ОрганизацияАгент = Неопределено) Экспорт
	
	
	СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
	
	СтруктураБСО.СК 				= СК;
	СтруктураБСО.ВидБСО 			= ВидБСО;
	СтруктураБСО.НомерБСО 			= НомерБСО;
	
	СтруктураБСО.Период = ?(дПериод = Неопределено, ТекущаяДата(), дПериод);
	СтруктураБСО.Поставщик = Поставщик;
	СтруктураБСО.ОрганизацияАгент 	= ОрганизацияАгент;
	
	уб_СЛ.ПрочитатьСостояниеБСО(СтруктураБСО);
	
	Возврат  СтруктураБСО;
КонецФункции

///////////////////////////////////////////////////////////////////////////
// Процедуры установки доступности полей в таблицах оплат

Функция ОП_ПолучитьТзОплат(СтраховойПолисСсылка) Экспорт 
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	ЗапросТЗОплат = Новый Запрос;
	ЗапросТЗОплат.Текст = "ВЫБРАТЬ
	|	уб_ОплатаПолисов.*, 
	|	уб_ОплатаПолисов.Дата КАК Период 
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	уб_ОплатаПолисов.СтраховойПолис = &СтраховойПолис
	// проверка на пустое значение Страхового Полиса
	|	И НЕ &Пустая
	//
	|    И НЕ уб_ОплатаПолисов.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	уб_ОплатаПолисов.Дата";
	ЗапросТЗОплат.УстановитьПараметр("СтраховойПолис", СтраховойПолисСсылка);
	// параметр на пустое значение Страхового полиса
	ЗапросТЗОплат.УстановитьПараметр("Пустая", 		СтраховойПолисСсылка.Пустая());
	//
	ТЗОплат = ЗапросТЗОплат.Выполнить().Выгрузить();
	Возврат ТЗОплат;
КонецФункции

Процедура ОП_Проверить(
	ТзОшибки,
	oОплатыСписок,
	Знач Оплата, 
	ПроверятьТолькоНомерКвитанции 	= Ложь, 
	ПроверятьТолькоКритические 		= Ложь, 
	КонтрольПоРСДвиженияБСО 		= Ложь, 
	ОстановитьсяПриОшибке 			= Ложь, 
	СтраховойПолис, 
	ОтключитьКонтрольНомеровБСО 	= Ложь, 
	Откуда 							= Неопределено
	) Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	//Когда функция вызывается из события "ПриВыводеСтроки" ДанныеСтроки (тут Оплата)
	// могут быть двух типов: "Текущие данные списка" или "Регистр сведений менеджер записи: Оплаты полисов"
	//(первый вариант, очевидно, случается при первом открытии списка оплат и при уходе с него)
	// и в первом варианте недоступны невидимые реквизиты оплаты (в данном случае ВидБСО)
	Статус = СтатусСообщения.Важное;
	СОО = "";
	Если Оплата.СтраховойПолис.Пустая() Тогда
		ДобСОО(ТзОшибки,"В Оплате от " + Формат(Оплата.Дата,"ДФ=dd.MM.yyyy") + " не указан Страховой Полис.",oОплатыСписок,Статус,Откуда); 	
		Возврат;	
	КонецЕсли;
	СК = СтраховойПолис.СК;
	Если СтраховойПолис.СК.Пустая() Тогда
		СОО = "В Страховом Полисе не указана Страховая Компания.";
		Если Откуда = "СтраховойПолис" Тогда 	
			Стр = ТзОшибки.Добавить();
			Стр.Ошибка = СОО;
			Стр.Элемент = СК;
			Стр.Статус = СтатусСообщения.ОченьВажное;
		Иначе 	
			ДобСОО(ТзОшибки,СОО,oОплатыСписок,Статус,Откуда); 	
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	
	СтруктураВидБСО = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СК);
	ВидБСОТипаКвА7 = СтруктураВидБСО.ВидБСО;
	ТипУчетаБСО = СтруктураВидБСО.ТипУчетаБСО;
	
	ПустойВидБСО = Справочники.уб_ВидыБСО.ПустаяСсылка();
	ИДобщ = "Ошибка. Оплата № " + Строка(Оплата.НомерВзноса) + " по полису № " + СокрЛП(Оплата.СтраховойПолис.Номер) + ": ";
	НаДатуОплаты = "на дату " + Формат(Оплата.Дата,"ДФ=dd.MM.yyyy") + "";	
	Если Откуда = "ОтчетАгента" Тогда
		СОО1 = ИДобщ;
	ИначеЕсли Откуда = "СтраховойПолис" Тогда 	
		СОО1 = "Ошибка. Оплата № " + Строка(Оплата.НомерВзноса) + ": ";
	ИначеЕсли Откуда = "РегистрОплат" Тогда 	
		СОО1 = ИДобщ;
	Иначе
		СОО1 = ИДобщ;
	КонецЕсли; 	
	Если Оплата.Агент = Неопределено Или Оплата.Агент.Пустая() Тогда
		ДобСОО(ТзОшибки,СОО1 + "Не указан Агент.",oОплатыСписок,Статус,Откуда); 	
		Если ОстановитьсяПриОшибке Тогда 
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	КонтролироватьНаличиеБСО = ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО = Истина;
	Если НЕ ОтключитьКонтрольНомеровБСО И Оплата.ЕстьКвитанция Тогда
		Если уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСОТипаКвА7, ТипУчетаБСО) Тогда 
			sКвитанция = СокрЛП(Оплата.НомерКвитанции);
			Если sКвитанция = "" Тогда
				Если СистемаНаправлениеПлатежа Тогда
					Если Оплата.ЕстьКвитанция Тогда
						ДобСОО(ТзОшибки,"Не указан номер квитанции", oОплатыСписок, Статус, Откуда);
						Если ОстановитьсяПриОшибке Тогда 
							Возврат
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Оплата.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Тогда 
						ДобСОО(ТзОшибки,"Не указан номер квитанции при оплате через кассу.",oОплатыСписок,Статус,Откуда);
						Если ОстановитьсяПриОшибке Тогда 
							Возврат; 
						КонецЕсли;
					КонецЕсли;		
				КонецЕсли;
			Иначе
				Если КонтрольПоРСДвиженияБСО Тогда
					//Проверяем, есть ли вообще такое БСО
					СтруктураБСО = ССПрочитСостБСО(СК, ВидБСОТипаКвА7, sКвитанция, Оплата.ДатаПроведенияБСО);
					Если СтруктураБСО.Существует Тогда
						Если КонтролироватьНаличиеБСО И СтруктураБСО.Агент <> Оплата.Агент  И СтруктураБСО.Агент <> Оплата.Курьер Тогда
							ДобСОО(ТзОшибки,СОО1 + НаДатуОплаты + " квитанция № " + sКвитанция + 
							" принадлежит физлицу " + СтруктураБСО.Агент.Наименование + 
							" (т.е. не числится ни на Агенте, ни на Курьере).",oОплатыСписок,Статус,Откуда);
							Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
						КонецЕсли;
						Если СтруктураБСО.Поставщик <> СтраховойПолис.Поставщик Тогда
							ДобСОО(ТзОшибки,СОО1 + "Квитанция № " + sКвитанция + 
							" получена от Поставщика: '" + СтруктураБСО.Поставщик.Наименование + 
							"' (Страховой полис получен от поставщика: '" + СтраховойПолис.Поставщик.Наименование + "'). Квитанция д/б того же поставщика, что и страховой полис."
							,oОплатыСписок
							,СтатусСообщения.Внимание
							,Откуда);
							Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
						КонецЕсли;
						Если СтруктураБСО.ОрганизацияАгент <> СтраховойПолис.ОрганизацияАгент Тогда
							ДобСОО(ТзОшибки,СОО1 + "Квитанция № " + sКвитанция + 
							" поступала в Организацию-Агента: '" + СтруктураБСО.ОрганизацияАгент.Наименование + 
							"' (Страховой полис поступал в ОргАгента: '" + СтраховойПолис.Поставщик.Наименование + "'). Квитанция и полис должны поступать в одну и туже Организацию-Агента."
							,oОплатыСписок
							,СтатусСообщения.Внимание
							,Откуда);
							Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
						КонецЕсли;
						ИнфоОДвижениях = "    ";
						Если уб_СС.ЕстьДвиженияБСОзаПериод(СК, ВидБСОТипаКвА7, sКвитанция, Оплата.ДатаПроведенияБСО, Неопределено, ИнфоОДвижениях) Тогда
							Сообщить("Для квитанции № " + sКвитанция + " из оплаты № " + Строка(Оплата.НомерВзноса) + " обнаружены движения БСО после даты оплаты:" + ИнфоОДвижениях);
						КонецЕсли; //Есть движения БСО квитанции за период после оплаты
					Иначе
						Если КонтролироватьНаличиеБСО Тогда
							СОО_ = СОО1 + НаДатуОплаты + " Отсутствует квитанция с номером " + sКвитанция + 
							" среди БСО для СК `" + Строка(СК.Наименование) + "`.";
							ДобСОО(ТзОшибки,СОО_,oОплатыСписок,Статус,Откуда);
							Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
						Иначе	
							Сообщить(СОО_,Статус);	
						КонецЕсли;
					КонецЕсли;					
				КонецЕсли; //КонтрольПоРСДвиженияБСО				
			КонецЕсли;									
			Если Откуда = "СтраховойПолис" Тогда 	
				Если ОП_ПроверитьНаДублиНомерКвитанции(Оплата.Ссылка, СОО)  Тогда 
					ДобСОО(ТзОшибки,СОО,oОплатыСписок,Статус,Откуда); 	
					Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
				КонецЕсли;
			КонецЕсли;					
		КонецЕсли; //Проверка ведется номерной учет					
		Если ПроверятьТолькоНомерКвитанции Тогда
			Возврат;	
		КонецЕсли;		
	КонецЕсли; // НЕ ОтключитьКонтрольНомеровБСО		
	Если Оплата.Дата = Дата(1,1,1) Тогда
		ДобСОО(ТзОшибки,СОО1 + "Не указана Дата оплаты.",oОплатыСписок,Статус,Откуда); 	
		Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
	КонецЕсли;
	Если Оплата.Агент = Неопределено Или Оплата.Агент.Пустая() Тогда
		ДобСОО(ТзОшибки,СОО1 + "Не указан Агент.",oОплатыСписок,Статус,Откуда); 	
		Если ОстановитьсяПриОшибке Тогда Возврат КонецЕсли;
	КонецЕсли;
	Если ПроверятьТолькоКритические Тогда
		Возврат;	
	КонецЕсли;
	Статус = СтатусСообщения.Внимание;
	Если Оплата.НачисленнаяСуммаВзноса = 0 Тогда
		ДобСОО(ТзОшибки,СОО1 + "Не указана Сумма Взноса.",oОплатыСписок,Статус,Откуда); 	
		Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
	КонецЕсли;
	РасчетПоАВ = Оплата.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
	Если НЕ РасчетПоАВ И Оплата.ВидРасчетаСАгентом <> Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме Тогда
		ДобСОО(ТзОшибки,СОО1 + "Не указан Вид Расчета С Агентом.",oОплатыСписок,Статус,Откуда); 	
		Возврат;	
	КонецЕсли;
	Если РасчетПоАВ Тогда
		Статус = СтатусСообщения.Информация;
		//Если Не Оплата.НеМенятьАВ Тогда
		//	Если Оплата.АВилиСкидкаСумма = 0 Тогда
		//		ДобСОО(ТзОшибки,СОО1 + "Сумма Агентского Вознаграждения равна 0. Если так и должно быть, установите флажок 'Не Менять АВ'",oОплатыСписок,Статус,Откуда); 	
		//		Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
		//	КонецЕсли;
		//	Если Оплата.АВилиСкидкаПроцент = 0 Тогда
		//		ДобСОО(ТзОшибки,СОО1 + "Процент Агентского Вознаграждения равен 0. Если так и должно быть, установите флажок 'Не Менять АВ'",oОплатыСписок,Статус,Откуда); 	
		//		Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;		
		Если Не СистемаНаправлениеПлатежа Тогда
			Если (Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса) И Оплата.ОплаченоФакт = 0 Тогда 
				ДобСОО(ТзОшибки,СОО1 + "Не указана Сумма фактической оплаты клиентом.",oОплатыСписок,Статус,Откуда); 	
				Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Оплата.ОплаченоФакт = 0 Тогда
			ДобСОО(ТзОшибки,СОО1 + "Не указана Сумма фактической оплаты клиентом.",oОплатыСписок,Статус,Откуда); 	
			Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не СистемаНаправлениеПлатежа Тогда
		Если Оплата.ФормаОплаты.Пустая() Тогда
			ДобСОО(ТзОшибки,СОО1 + "Не заполнено поле `Форма оплаты`.",oОплатыСписок,Статус,Откуда);
			Если ОстановитьсяПриОшибке Тогда Возврат; КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//TODO собирать все ошибки, как в ТЗ ошибок
Функция ОП_ПроверитьБыстро(
	Знач Оплата, 
	СОО 					= "", 
	КонтрольПоРСДвиженияБСО = Ложь, 
	КонтрольНаличияНаАгенте = Ложь, 
	ДанныеПоПолисуСОплатой	= Ложь,
	Знач Разделитель ="; ") Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	Если ТипЗнч(Оплата) = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.СтраховойПолис,
		|	уб_ОплатаПолисов.СК,
		|	уб_ОплатаПолисов.НачисленнаяСуммаВзноса,
		|	уб_ОплатаПолисов.ВидРасчетаСАгентом,
		|	уб_ОплатаПолисов.ФормаОплаты,
		|	уб_ОплатаПолисов.ОплаченоФакт,
		|	уб_ОплатаПолисов.ЕстьКвитанция,
		|	уб_ОплатаПолисов.НомерКвитанции,
		|	уб_ОплатаПолисов.ДатаПроведенияБСО,
		|	уб_ОплатаПолисов.Агент,
		|	уб_ОплатаПолисов.Курьер,
		|	уб_ОплатаПолисов.Поставщик,
		|	уб_ОплатаПолисов.ОрганизацияАгент,
		|	уб_ОплатаПолисов.Ссылка
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	уб_ОплатаПолисов.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Оплата);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			СОО = СОО+"Ссылки оплаты нет в базе"+Разделитель;
			Возврат Ложь;
		КонецЕсли;
		Оплата = Результат.Выбрать();
		Оплата.Следующий();
	КонецЕсли;
	Если ДанныеПоПолисуСОплатой = Истина Тогда
		СП 		= Оплата;
		Префикс	= "СтраховойПолис";
	Иначе	
		СП 		= Оплата.СтраховойПолис;
		Префикс	= "";
	КонецЕсли;	
	СК = Оплата.СК;
	бПолисДействует = НЕ уб_СЛ.ПолисАннулирован(СП[Префикс + "СостояниеПолиса"]);	                                                     
	Если Не ЗначениеЗаполнено(СК) Тогда 
		СОО = СОО+"Не заполнен реквизит СК."+Разделитель;
		Возврат Ложь; 
	КонецЕсли;
	Если Оплата.НачисленнаяСуммаВзноса = 0 И бПолисДействует Тогда 
		СОО = СОО+"Не заполнена сумма взноса."+Разделитель;
		Возврат Ложь; 
	КонецЕсли;
	Если Оплата.НачисленнаяСуммаВзноса <> 0 И Не бПолисДействует Тогда
		//СОО = "Начислена сумма взноса по аннулированному полису.";
		СОО = СОО+"В аннулированном полисе начисленная сумма взноса может быть только в случае расторжения с удержанием части суммы."+Разделитель;
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Оплата.ВидРасчетаСАгентом) Тогда 
		СОО = СОО+"Не указан вид расчета с агентом."+Разделитель;
		Возврат Ложь; 
	КонецЕсли;
	Если Не СистемаНаправлениеПлатежа Тогда
		Если Не ЗначениеЗаполнено(Оплата.ФормаОплаты) Тогда 
			СОО = СОО+"Не указана форма оплаты."+Разделитель;
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;
	Если Оплата.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
		// при расчете "ПО АВ":
		//должно быть не нулевым АВ (за исключением особых каких-то случаев, которые сопровождаются фиксацией АВ)
		//////////////////////////////////////////////////////////
		//По новой системе аннулирования оплат это частый случай - закомментировано
		//////////////////////////////////////////////////////////
		//Если Не Выборка.НеМенятьАВ Тогда
		//	Если Выборка.АВилиСкидкаСумма = 0 Тогда 
		//		СОО = "Сумма АВ (при расчете по АВ) равна 0. Если так и должно быть, установите флажок 'Не Менять АВ'.";
		//		Возврат Ложь; 
		//	КонецЕсли;
		//	Если Выборка.АВилиСкидкаПроцент = 0 Тогда 
		//		СОО = "Процент АВ (при расчете по АВ) равна 0. Если так и должно быть, установите флажок 'Не Менять АВ'.";
		//		Возврат Ложь; 
		//	КонецЕсли;
		//КонецЕсли;
		//При расчетрах НЕ через кассу, д.б. указана сума, переведенная по безналу
		Если Не СистемаНаправлениеПлатежа Тогда
			Если Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса И Оплата.ОплаченоФакт = 0 И бПолисДействует Тогда
				СОО = СОО+"При расчетрах НЕ через кассу, д.б. указана сума, переведенная по безналу."+Разделитель;
				Возврат Ложь; 
			КонецЕсли;
		КонецЕсли;
	Иначе
		// при расчете "ПО Схеме" д.б. указана сума, факт. оплаченная клиентом
		Если Оплата.ОплаченоФакт = 0 И бПолисДействует Тогда
			СОО = СОО+"При расчете ""ПО Схеме"" д.б. указана сумма, фактически оплаченная клиентом."+Разделитель;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	// Проверяем Квитанцию, если в полисе НЕ установлен Ручной Ввод Номеров, то
	Если СП[Префикс + "ОтключитьКонтрольНомеровБСО"] Или Не Оплата.ЕстьКвитанция Тогда
		Возврат Истина;
	КонецЕсли;
	sКвитанция = СокрЛП(Оплата.НомерКвитанции);
	Если СистемаНаправлениеПлатежа Тогда
		Если ПустаяСтрока(sКвитанция) И Не Оплата.ЕстьКвитанция Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(sКвитанция) И Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	СтруктураВидБСО = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СК);
	ВидБСОТипаКвА7 = СтруктураВидБСО.ВидБСО;
	ТипУчетаБСО = СтруктураВидБСО.ТипУчетаБСО;
	//Если не ведется номерной учет по квитанциям для данной СК, то не проверяем дальше
	Если Не уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСОТипаКвА7, ТипУчетаБСО) Тогда
		СОО = СОО+"БСО не номерного учета."+Разделитель;
		Возврат Истина;
	КонецЕсли;
	//При оплате через кассу должнен быть указан номер квитанции
	Если СистемаНаправлениеПлатежа Тогда
		Если Оплата.ЕстьКвитанция И ПустаяСтрока(sКвитанция) Тогда
			СОО = СОО + "Не указан номер квитанции." + Разделитель;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если Оплата.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса И ПустаяСтрока(sКвитанция) Тогда
			СОО = СОО+"Не указан номер квитанции при оплате через кассу."+Разделитель;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если КонтрольПоРСДвиженияБСО Тогда
		//Проверяем, есть ли вообще такое БСО
		СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
		СтруктураБСО.Период 	= Оплата.ДатаПроведенияБСО;
		СтруктураБСО.СК 		= СК;
		СтруктураБСО.ВидБСО 	= ВидБСОТипаКвА7;
		СтруктураБСО.НомерБСО 	= sКвитанция;
		//СтруктураБСО.ОрганизацияАгент = ОрганизацияАгент;
		уб_СЛ.ПрочитатьСостояниеБСО(СтруктураБСО);
		Если Не СтруктураБСО.Существует Тогда
			СОО = СОО+Разделитель+"БСО не существует для данной СК.";
			Возврат Ложь;
		КонецЕсли;
		Если КонтрольНаличияНаАгенте И СтруктураБСО.Агент <> Оплата.Агент И СтруктураБСО.Агент <> Оплата.Курьер Тогда
			СОО = СОО+Разделитель+"Квитанция не числится ни на Агенте ни на Курьере.";
			Возврат Ложь;
		КонецЕсли;	
		Если СтруктураБСО.Поставщик <> СП[Префикс + "Поставщик"] Тогда 
			СОО = СОО+"Поставщик в полисе не соответствует поставщику квитанции."+Разделитель;
			Возврат Ложь; 
		КонецЕсли;	
		Если СтруктураБСО.ОрганизацияАгент <> СП[Префикс + "ОрганизацияАгент"] Тогда 
			СОО = СОО+"Орг-Агент в полисе не соответствует Орг-Агенту в квитанции."+Разделитель;
			Возврат Ложь; 
		КонецЕсли;	
	КонецЕсли; //КонтрольПоРСДвиженияБСО	
	//Поверяем номер квитанции на наличие дублей при проверке в страховом полисе
	Если ДанныеПоПолисуСОплатой Тогда
		Если ЗначениеЗаполнено(Оплата.ОплатаДубль) Тогда
			СОО = СОО+"Дублирование номера квитанции " + Оплата.НомерКвитанции + " в оплате Sys № " + Оплата.НомерДубля + Разделитель; 	
			Возврат Ложь; 
		КонецЕсли;	
	Иначе	
		Если ОП_ПроверитьНаДублиНомерКвитанции(Оплата, СОО, Разделитель)  Тогда 
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;	
	Возврат Истина;	
	
КонецФункции

Функция ОП_ПроверитьНаДублиНомерКвитанции(Знач Оплата, СОО = "",Знач Разделитель="; ") Экспорт
	
	//Проверяем наличие дублей
	ЗапросДублиНомерКвитанции = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ВН.Ссылка,
	//			   |	ВН.НомерСтроки,
	//			   |	ВН.Дата КАК Дата,
	//			   |	ВН.НомерКвитанции,
	//			   |	ВН.Номер
	//			   |ИЗ
	//			   |	(ВЫБРАТЬ
	//			   |		О.Ссылка КАК Ссылка,
	//			   |		КОЛИЧЕСТВО(О1.Ссылка) КАК НомерСтроки,
	//			   |		О.Дата КАК Дата,
	//			   |		О.НомерКвитанции КАК НомерКвитанции,
	//			   |		О.Номер КАК Номер
	//			   |	ИЗ
	//			   |		Документ.уб_ОплатаПолисов КАК О
	//			   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК О1
	//			   |			ПО О.Дата >= О1.Дата
	//			   |	ГДЕ
	//			   |		О.СтраховойПолис = &СтраховойПолис
	//			   |		И О1.СтраховойПолис = &СтраховойПолис
	//			   |	    И НЕ О.ПометкаУдаления
	//			   |	    И НЕ О1.ПометкаУдаления
	//			   |	СГРУППИРОВАТЬ ПО
	//			   |		О.Ссылка,
	//			   |		О.Дата,
	//			   |		О.НомерКвитанции) КАК ВН
	//			   |ГДЕ
	//			   |	ИСТИНА
	//			   |	И ВН.НомерКвитанции = &НомерКвитанции
	//			   |	И ВН.Ссылка <> &Ссылка
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Дата";
	ЗапросДублиНомерКвитанции.Текст = 
	"ВЫБРАТЬ
	|	О.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(О1.Ссылка) КАК НомерСтроки,
	|	О.Дата КАК Дата,
	|	О.НомерКвитанции КАК НомерКвитанции,
	|	О.Номер КАК Номер
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК О
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК О1
	|		ПО О.Дата >= О1.Дата
	|			И О.СтраховойПолис = О1.СтраховойПолис
	|ГДЕ
	|	О.СтраховойПолис = &СтраховойПолис
	|	И О.НомерКвитанции = &НомерКвитанции
	|	И О.ЕстьКвитанция = Истина
	|	И О1.ЕстьКвитанция = Истина
	|	И НЕ О.ПометкаУдаления
	|	И НЕ О1.ПометкаУдаления
	|	И О.Ссылка <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	О.Ссылка,
	|	О.Дата,
	|	О.НомерКвитанции,
	|	О.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	ЗапросДублиНомерКвитанции.УстановитьПараметр("СтраховойПолис", Оплата.СтраховойПолис);
	ЗапросДублиНомерКвитанции.УстановитьПараметр("Ссылка", 		Оплата.Ссылка);
	ЗапросДублиНомерКвитанции.УстановитьПараметр("НомерКвитанции", Оплата.НомерКвитанции);
	Выборка = ЗапросДублиНомерКвитанции.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.НомерКвитанции) Тогда
			СОО = СОО+"Дублирование номера квитанции " + Выборка.НомерКвитанции + " в оплате № " + 
			Выборка.НомерСтроки + " (Sys № документа оплаты: " + Выборка.Номер + ")"+Разделитель; 	
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;	
	
КонецФункции

Функция ОП_ПроверитьТекущую(
	оОплатыСписок
	, СообщатьОбОшибках = Истина
	, Откуда
	, ТипСообщения = 1
	, Форма = Неопределено
	) Экспорт
	
	ТекСтрока = оОплатыСписок.ТекущаяСтрока;   
	Если ТекСтрока = Неопределено Тогда
		ТекСтрока = оОплатыСписок.ТекущиеДанные;   
	КонецЕсли;
	Если ТекСтрока = Неопределено Тогда
		Возврат Истина;   
	КонецЕсли;
	
	оСтраховойПолис = ТекСтрока.СтраховойПолис;   
	
	ТзОшибки = СоздатьТаблицуОшибок();
	
	ОП_Проверить( 			ТзОшибки
	, оОплатыСписок
	, ТекСтрока
	, Ложь
	, Ложь
	, Истина
	, Ложь
	, оСтраховойПолис
	, оСтраховойПолис.ОтключитьКонтрольНомеровБСО
	, Откуда
	);
	
	Если ТзОшибки.Количество() <> 0 Тогда
		Если СообщатьОбОшибках Тогда
			Если ТипСообщения = 0 Тогда
				ОткрытьСообщениеОбОшибках(ТзОшибки, Форма);
			Иначе
				СообщитьСОО(ТзОшибки);
			КонецЕсли;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	#Если Клиент Тогда
		Предупреждение("Оплата ОК!",10,"Проверка оплаты");
	#Иначе
		Сообщить("Оплата ОК! Проверка оплаты");
	#КонецЕсли
	Возврат Истина;
	
КонецФункции

Функция ОП_ПолучитьСтатус(Оплата, СОО = "", ДанныеПоПолисуСОплатой = Ложь, Разделитель ="; ") Экспорт
	
	ОплатаОК = ОП_ПроверитьБыстро(Оплата, СОО, Истина, Ложь, ДанныеПоПолисуСОплатой,Разделитель);
	Возврат ?(Оплата.ОтчетАгента.Проведен,?(ОплатаОК,1,3),?(ОплатаОК,0,2));
	
КонецФункции

Функция ОП_ПолучитьСтатусКвитанции(Оплата) Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	sКвитанция = СокрЛП(Оплата.НомерКвитанции);
	Если НЕ Оплата.ЕстьКвитанция Тогда
		Возврат 0; 
	КонецЕсли;
	Если sКвитанция = "" Тогда
		Если СистемаНаправлениеПлатежа Тогда
			Возврат ?(Оплата.ЕстьКвитанция, 1, 0); 
		Иначе
			Возврат ?(Оплата.ФормаОплаты <> Перечисления.уб_ФормыОплаты.Касса, 0, 1);
		КонецЕсли;
	КонецЕсли;
	Возврат ?(ЕстьДвиженияКвитанцииИзОплаты(Оплата),2,0);
	
КонецФункции

Процедура ОП_УстановитьВидимостьКолонокПоРолям(oОплатыСписок) Экспорт
	
	Если РольДоступна("уб_МенеджерНаТочке") Тогда
		СкрытьКолонку(oОплатыСписок, "КВСумма");
		СкрытьКолонку(oОплатыСписок, "КВПроцент");
		СкрытьКолонку(oОплатыСписок, "НеМенятьКВ");
		СкрытьКолонку(oОплатыСписок, "ВознаграждениеМенеджера");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОП_УстановитьОтборПоРеквизиту(Форма, ИмяРеквизитаСписка, ИмяРеквизита, ЗначениеРеквизита, СкрыватьКолонку = Истина) Экспорт
	оОтбор = Форма[ИмяРеквизитаСписка].Отбор[ИмяРеквизита];
	
	оОтбор.ВидСравнения  = ВидСравнения.Равно;
	оОтбор.Использование = Истина;
	оОтбор.Значение      = ЗначениеРеквизита;
	
	эСписок = Форма.ЭлементыФормы[ИмяРеквизитаСписка];
	эСписок.НастройкаОтбора[ИмяРеквизита].Доступность = Ложь;
	
	Если СкрыватьКолонку Тогда
		//Если НЕ эСписок.Колонки.Найти(ИмяРеквизита) = Неопределено Тогда
			СкрытьКолонку(эСписок, ИмяРеквизита);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ОП_ВозможноРедактирование(Оплата, Параметры = Неопределено) Экспорт
	
	Инфо = "";
	Параметры = Новый Структура;
	Параметры.Вставить("Полис", 						Ложь);
	Параметры.Вставить("ОплаченныйОтчетПоставщику",   	Ложь);
	Параметры.Вставить("СогласованныйОтчетПоставщику",	Ложь);
	Параметры.Вставить("ОтчетПоставщику",				Ложь);
	Параметры.Вставить("ДатаМониторинга",				Ложь);
	Параметры.Вставить("ЭтоНовый",						Оплата.Ссылка.Пустая());
	Параметры.Вставить("КВЗаблокировано",				Ложь);
	НетПрав = Не (ПравоДоступа("Изменение", Оплата.Метаданные()) И уб_КЭШируемые.ДоступностьРоли("ПолныеПрава"));
	Параметры.Вставить("НетПрав", НетПрав);
	//TODO уйти от получения номера через точку
//	ЗаголовокФормы = ?(Параметры.ЭтоНовый, " - НОВАЯ. ", " № " + Строка(Оплата.Номер) + ". ") + "Оплата полиса " + ?(СокрЛП(Оплата.СтраховойПолис.Номер) = "",""," № " + СокрЛП(Оплата.СтраховойПолис.Номер) + ". ");
	Если Не (НетПрав Или Параметры.ЭтоНовый) Тогда
		//|	ВЫБОР
		//|		КОГДА уб_СтраховойПолис.ПометкаУдаления
		//|				ИЛИ &СтраховойПолис = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК БлокировкаПолисом, // почему нельзя менять оплату, когда полис помечен на удаление ?
		ЗапросВозможноРедактирование = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Взаиморасчет.Ссылка КАК ЕстьПеречислениеСсылка
		|ПОМЕСТИТЬ ЕстьПеречисление
		|ИЗ
		|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Взаиморасчет
		|ГДЕ
		|	Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
		|	И НЕ &ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
		|	И Взаиморасчет.ОтчетПоставщику = &ОтчетПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_ОплатаПолисов.Ссылка,
		|	ЛОЖЬ КАК БлокировкаПолисом,
		|	ВЫБОР
		|		КОГДА ЕстьПеречисление.ЕстьПеречислениеСсылка ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Заблокирован,
		|	ВЫБОР
		|		КОГДА уб_ОтчетПоставщику.Проведен
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БлокировкаОтчетомПоставщику,
		|	ВЫБОР
		|		КОГДА уб_ОтчетПоставщику.ДатаСогласования <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СогласованныйОтчетПоставщику
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|		ПО (уб_СтраховойПолис.Ссылка = &СтраховойПолис)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОтчетПоставщику КАК уб_ОтчетПоставщику
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЕстьПеречисление КАК ЕстьПеречисление
		|			ПО (ИСТИНА)
		|		ПО (уб_ОтчетПоставщику.Ссылка = &ОтчетПоставщику)
		|ГДЕ
		|	уб_ОплатаПолисов.Ссылка = &Ссылка");
		ЗапросВозможноРедактирование.УстановитьПараметр("Ссылка", 			Оплата.Ссылка);
		ЗапросВозможноРедактирование.УстановитьПараметр("ОтчетПоставщику", 	Оплата.ОтчетПоставщику);
		ЗапросВозможноРедактирование.УстановитьПараметр("ОтчетАгента", 		Оплата.ОтчетАгента);
		ЗапросВозможноРедактирование.УстановитьПараметр("СтраховойПолис", 	Оплата.СтраховойПолис);
		Выборка = ЗапросВозможноРедактирование.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.БлокировкаПолисом Тогда
				Параметры.Полис = Истина;
				Инфо = ?(Инфо = "",""," / ") + "Полис";	
			КонецЕсли;				
			Если Выборка.Заблокирован Тогда
				Параметры.ОплаченныйОтчетПоставщику = Истина;
				ИнфоПоОтчету = "Оплаченный";
				//Инфо = Инфо + ?(ПустаяСтрока(Инфо), "", " / ") + "Оплаченный Отчет Поставщику";
			КонецЕсли;
			Если Выборка.СогласованныйОтчетПоставщику Тогда
				Параметры.СогласованныйОтчетПоставщику = Истина;
				ИнфоПоОтчету = ?(ИнфоПоОтчету = Неопределено, "Согласованный", ИнфоПоОтчету + ", Согласованный");
				ДопТекстСогласования = ?(уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ПравоПравкиСогласованных",ЛОЖЬ) = ИСТИНА,""," (нельзя менять КВ)");//?(уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ"), "", " (нельзя менять КВ)");
				Параметры.КВЗаблокировано = Не (//уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") ИЛИ 
				уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ПравоПравкиСогласованных",ЛОЖЬ) = ИСТИНА);
			КонецЕсли;
			Если Выборка.БлокировкаОтчетомПоставщику Тогда
				Параметры.ОтчетПоставщику = Истина;
			КонецЕсли;
			Если ИнфоПоОтчету = Неопределено Тогда
				Если Параметры.ОтчетПоставщику Тогда
					Инфо = Инфо + ?(Инфо = "", "", " / ") + "Отчет Поставщику";	
				КонецЕсли;
			Иначе
				Инфо = Инфо + ?(Инфо = "", "", " / ") + ИнфоПоОтчету + " Отчет Поставщику" + ДопТекстСогласования;
			КонецЕсли;
			Если НЕ уб_СтраховойБрокер.МожноИспользоватьДатуМониторинга(Оплата.ДатаМониторинга) Тогда
				Параметры.ДатаМониторинга = Истина;
				Инфо = Инфо + ?(Инфо = "",""," / ") + "Дата мониторинга";	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Инфо <> "" Тогда
		Инфо = "[БЛОКИРАТОРЫ: " + Инфо + "]"; 
	КонецЕсли;
	Результат = Истина;
	Если Параметры.Полис Тогда
		Результат = Ложь
	ИначеЕсли Параметры.ОплаченныйОтчетПоставщику Тогда
		СтруктураБлокировкиОтчета = уб_temp.СтруктураБлокировкиДокумента(Оплата.Ссылка);
		Если СтруктураБлокировкиОтчета.Заблокирован Тогда
			Результат = Ложь
		КонецЕсли;
	КонецЕсли;
	Параметры.Вставить("ВозможноРедактирование", Результат);
	Если Не Результат Тогда
		Инфо = "Только просмотр. " + Инфо
	КонецЕсли;
	Параметры.Вставить("ЗаголовокФормы", Инфо);
	Возврат Результат;
	
КонецФункции

//============ КВИТОВКА ОПЛАТ ========================

Функция ДайМЗКвитовкиОплат(УИДСтроки, ОплатаСсылка) Экспорт
	ВыборкаРС = РегистрыСведений.уб_КвитовкаОплат.Выбрать(Новый Структура("УИДСтрокиТЧ",УИДстроки));
	МЗ = Неопределено;
	МЗНайден = Ложь;
	Пока ВыборкаРС.Следующий() Цикл
		Если ОплатаСсылка <> ВыборкаРС.ОплатаПолиса Тогда
			Продолжить;	
		КонецЕсли;
		Если НЕ МЗНайден Тогда
			МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
			МЗНайден = Истина;
		Иначе	
			//В регистре должна быть только одна запись для УИДстроки и Оплаты
			ВыборкаРС.ПолучитьМенеджерЗаписи().Удалить();
		КонецЕсли;
	КонецЦикла;
	Возврат МЗ;
КонецФункции

Функция Получить_группу_связанных_квитовок(УИДСтрокиТЧ, ТолькоУникальныеУИДыВМассиве = Истина) Экспорт
	//Получаем перечень связанных квитовок для переданного УИДСтрокиТЧ
	//УИДСтрокиТЧ -> Оплаты -> Приемки ->  Оплаты -> УИДы Строк ТЧ
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УИДСтрокиТЧ", УИДСтрокиТЧ);
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	К.УИДСтрокиТЧ КАК УИДСтрокиТЧ,
	|	К.ОплатаПолиса
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|ГДЕ
	|	К.ОплатаПолиса В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				К2.ОплатаПолиса
	|			ИЗ
	|				РегистрСведений.уб_КвитовкаОплат КАК К2
	|			ГДЕ
	|				К2.УИДСтрокиТЧ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						К3.УИДСтрокиТЧ КАК УИДСтрокиТЧ
	|					ИЗ
	|						РегистрСведений.уб_КвитовкаОплат КАК К3
	|					ГДЕ
	|						К3.ОплатаПолиса В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								К4.ОплатаПолиса
	|							ИЗ
	|								РегистрСведений.уб_КвитовкаОплат КАК К4
	|							ГДЕ
	|								К4.УИДСтрокиТЧ = &УИДСтрокиТЧ)))
	|
	|УПОРЯДОЧИТЬ ПО
	|	УИДСтрокиТЧ";
	
	Если ТолькоУникальныеУИДыВМассиве Тогда
		// TODO Это нигде не используется
		Запрос.Текст = СтрЗаменить(ТекстЗапроса,"К.ОплатаПолиса","1 КАК МестоЗамены");
		ТЗКвитовок = Запрос.Выполнить().Выгрузить();
		ТЗКвитовок.Свернуть("УИДСтрокиТЧ"); //TODO есть же различные в запросе
		МассивУИДов = ТЗКвитовок.ВыгрузитьКолонку("УИДСтрокиТЧ"); //TODO отправляется массив
		Возврат МассивУИДов;
	Иначе
		Запрос.Текст = ТекстЗапроса;
		ТЗКвитовок = Запрос.Выполнить().Выгрузить();
		Возврат ТЗКвитовок;
	КонецЕсли;
	
КонецФункции

Функция ОбновитьУИДГруппыКвитовок(Параметр, Источник = Неопределено, Оповещать = Истина) Экспорт
	//В качестве параметра может быть передан как отдельный УИДСтрокиТЧ, так и массив с УИД-ами	
	//В первом случае создаем массив искуственно с одной записью
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		МассивКвитовок0 = Новый Массив();
		МассивКвитовок0.Добавить(Параметр);
	ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") Тогда
		МассивКвитовок0 = Параметр;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	//Анализируем ветки связей М-М и создаем уникальные группы в Соответствии
	СоотвГрупп = Новый Соответствие();
	
	Для Каждого УИДСтроки из МассивКвитовок0 Цикл
		ТЗКвитовок = Получить_группу_связанных_квитовок(УИДСтроки, Ложь);
		Если ТЗКвитовок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Ключ = ТЗКвитовок[0].УИДСтрокиТЧ;
		
		Элемент = СоотвГрупп.Получить(Ключ);
		Если Элемент = Неопределено Тогда
			СоотвГрупп.Вставить(Ключ, ТЗКвитовок);
		КонецЕсли;
	КонецЦикла;
	
	
	Для каждого Элемент из СоотвГрупп Цикл 
		ТЗКвитовок = Элемент.Значение;
		УИДГруппы = Элемент.Ключ;
		бМногиеКоМногим = ТЗКвитовок.Количество() > 1;	
		
		Для Каждого Стр из ТЗКвитовок Цикл
			МЗ = РегистрыСведений.уб_КвитовкаОплат.СоздатьМенеджерЗаписи();
			
			МЗ.УИДСтрокиТЧ = Стр.УИДСтрокиТЧ;
			МЗ.ОплатаПолиса = Стр.ОплатаПолиса;
			
			МЗ.Прочитать();
			
			Если МЗ.Выбран() Тогда
				
				МЗ.УИДГруппы = УИДГруппы;
				МЗ.МногиеКоМногим = бМногиеКоМногим;
				Попытка
					МЗ.Записать();
					Если Оповещать Тогда
						СтруктураИзменяемойКвитовки = ОбщегоНазначения.ПолучитьСтруктуруИзЗаписиРегистраСведений("уб_КвитовкаОплат", МЗ);
						#Если Клиент Тогда
							Оповестить("ПослеИзмененияКвитовки", СтруктураИзменяемойКвитовки, Источник);
						#КонецЕсли
					КонецЕсли;
				Исключение
					Сообщить("Ошибка при записи группы квитовки оплат. Описание ошибки: 
					|	" + ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
					Возврат Ложь;
				КонецПопытки;
			Иначе	
				Сообщить("Не удалось найти МЗ для УИДСтрокиТЧ: " + Стр.УИДСтрокиТЧ + " и Оплаты: " + Строка(Стр.ОплатаПолиса)); 
			КонецЕсли;
		КонецЦикла; // ТЗКвитовок
	КонецЦикла; //	СоотвГрупп
	
	Возврат Истина;
КонецФункции

Функция ДобавитьКвитовкуОплат(УИДСтроки, ПриемкаСсылка, ОплатаСсылка, Источник = Неопределено) Экспорт
	МЗ = ДайМЗКвитовкиОплат(УИДСтроки, ОплатаСсылка);
	Если МЗ = Неопределено Тогда
		МЗ = РегистрыСведений.уб_КвитовкаОплат.СоздатьМенеджерЗаписи();	
	КонецЕсли;
	
	МЗ.УИДСтрокиТЧ = УИДстроки;	
	МЗ.ОплатаПолиса = ОплатаСсылка;	
	МЗ.ДатаКвитовки = ТекущаяДата();	
	МЗ.ПриемОплаты = ПриемкаСсылка;	
	
	Попытка
		МЗ.Записать();
		Если ОбновитьУИДГруппыКвитовок(УИДстроки, Источник) Тогда
			СтруктураДобавляемойКвитовки = ОбщегоНазначения.ПолучитьСтруктуруИзЗаписиРегистраСведений("уб_КвитовкаОплат", МЗ);
			#Если Клиент Тогда
				Оповестить("ПослеИзмененияКвитовки", СтруктураДобавляемойКвитовки, Источник);
			#КонецЕсли
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Сообщить("Ошибка при записи квитовки оплат
		|Описание ошибки: 
		|	" + ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция УдалитьКвитовкуПоМЗ(МЗ, Источник = Неопределено) Экспорт
	Если МЗ = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Попытка
		УИДСтрокиТЧ = МЗ.УИДСтрокиТЧ;
		СтруктураУдаляемлойКвитовки = ОбщегоНазначения.ПолучитьСтруктуруИзЗаписиРегистраСведений("уб_КвитовкаОплат", МЗ);
		ТЗКвитовок = Получить_группу_связанных_квитовок(УИДСтрокиТЧ, Ложь);
		
		МЗ.Удалить();
		
		//Обновляем значения группы квитовок
		ТЗКвитовок2 = ТЗКвитовок.Скопировать();
		ТЗКвитовок2.Свернуть("УИДСтрокиТЧ");
		МассивКвитовок = ТЗКвитовок2.ВыгрузитьКолонку("УИДСтрокиТЧ");
		
		Если ОбновитьУИДГруппыКвитовок(МассивКвитовок, Источник, Ложь) Тогда
			Для Каждого Стр из ТЗКвитовок Цикл
				
				МЗ = РегистрыСведений.уб_КвитовкаОплат.СоздатьМенеджерЗаписи();
				МЗ.УИДСтрокиТЧ = Стр.УИДСтрокиТЧ;
				МЗ.ОплатаПолиса = Стр.ОплатаПолиса;
				МЗ.Прочитать();
				Если МЗ.Выбран() Тогда
					СтруктураУдаляемлойКвитовки = ОбщегоНазначения.ПолучитьСтруктуруИзЗаписиРегистраСведений("уб_КвитовкаОплат", МЗ);
					#Если Клиент Тогда
						Оповестить("ПослеИзмененияКвитовки", СтруктураУдаляемлойКвитовки, Источник);
					#КонецЕсли
				КонецЕсли;	
				
			КонецЦикла;		
			
			Возврат Истина;
		КонецЕсли;
	Исключение
		Сообщить("Не удалось удалить квитовку оплат: № Приемки: " + МЗ.ПриемОплаты.Номер + ", УИДСтроки: " 
		+ МЗ.УИДСтрокиТЧ + ", № Оплаты: " +  + МЗ.ОплатаПолиса.Номер + ". " + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;	
	
	Возврат Ложь;
КонецФункции

Функция УдалитьКвитовки(УИДСтрокиТЧ = Неопределено, ОплатаСсылка = Неопределено, ПриемкаСсылка = Неопределено, Источник = Неопределено) Экспорт
	Если УИДСтрокиТЧ = Неопределено Тогда
		Если НЕ ЗначениеНеЗаполнено(ОплатаСсылка) Тогда
			//Удаление всех квитовок для Оплаты	
			СтруктураВыборки = Новый Структура("ОплатаПолиса", ОплатаСсылка);	
		ИначеЕсли НЕ ЗначениеНеЗаполнено(ПриемкаСсылка) Тогда
			//Удаление всех квитовок для документа Приемки	
			СтруктураВыборки = Новый Структура("ПриемОплаты", ПриемкаСсылка);	
		Иначе
			// не передано ни одного значимого аргумента
			Возврат Ложь;
		КонецЕсли;
	Иначе	
		//Если ОплатаСсылка <> Неопределено, то это - удаление конкретной квитовки (для конкретных строки приемки и Оплаты)	
		//и далее потребуется проверять все записи выборки на соответствие ОплатаСсылка = ВыборкаРС.ОплатаПолиса
		
		//Если ОплатаСсылка = Неопределено
		//то это - удаление всех квитовок для строки приемки 
		СтруктураВыборки = Новый Структура("УИДСтрокиТЧ", УИДСтрокиТЧ);	
	КонецЕсли;
	
	ВыборкаРС = РегистрыСведений.уб_КвитовкаОплат.Выбрать(СтруктураВыборки); 
	Пока ВыборкаРС.Следующий() Цикл
		Если ОплатаСсылка <> Неопределено И ОплатаСсылка <> ВыборкаРС.ОплатаПолиса Тогда
			Продолжить;	
		КонецЕсли;
		МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
		Если НЕ УдалитьКвитовкуПоМЗ(МЗ, Источник) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

//
Функция ПолучитьУИДГруппыКвитовки(Параметр) Экспорт
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		ТекстУсловия = " К.УИДСтрокиТЧ = &Параметр";
	ИначеЕсли ТипЗнч(Параметр) = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		ТекстУсловия = "К.ОплатаПолиса = &Параметр";
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;
	ЗапросУИДГруппыКвитовки = Новый Запрос;
	ЗапросУИДГруппыКвитовки.УстановитьПараметр("Параметр", Параметр);
	ЗапросУИДГруппыКвитовки.Текст = "ВЫБРАТЬ
	|	К.УИДГруппы
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|ГДЕ " + ТекстУсловия;
	Выборка = ЗапросУИДГруппыКвитовки.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	УИДГруппы = Выборка.УИДГруппы;
	
	Возврат  УИДГруппы;
	
КонецФункции	

Функция ПолучитьСквитованныеПриемки(УИДГруппы,ОбъектПриемкиИлиОплаты) Экспорт
	
	//Признак сквитованности приемок и оплат: приемка1+приемка2+приемка3 = оплата1+оплата2  (5+5+(-2) = 0+8)
	
	//Алгоритм:
	//Для переданного УИДСтрокиТЧ ищем УИДгруппы.
	//	Если УИДгруппы есть, то это квитовка многие-ко-многим
	//	   по группе ней находим все приемки и все оплаты. Суммируем суммы, сравниваем.
	//	Если УИДгруппы нет, то это квитовка 1-к-1. Сравниваем сумму по строке приемки и в оплате. 
	//	
	//	Для каждой найденной оплаты найти все привязанные приемки
	
	//Если аргумент ОбновлятьФлаг_НетКвитовкиПоСуммамОплат_ВпрочихПриемках = ИСТИНА
	//То для всех найденных несквитованных оплат ищутся все строки приемок и затем все 
	// документы приемок, в которых они входят. Для всех них устанавливается флаг НетКвитовкиПоСуммамОплат 
	
	//Находим список связанных приемок
	ЗапросСквитованныеПриемки = Новый Запрос;
	ЗапросСквитованныеПриемки.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	П.Ссылка КАК ПриемОплаты,
	|	К.УИДСтрокиТЧ КАК УИДСтрокиТЧ,
	|	П.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Полисы КАК П
	|		ПО К.УИДСтрокиТЧ = П.УИДСтроки
	|ГДЕ
	|	К.УИДГруппы = &УИДГруппы";
	ЗапросСквитованныеПриемки.УстановитьПараметр("УИДГруппы", УИДГруппы);
	Рез = ЗапросСквитованныеПриемки.Выполнить();
	тзНесквитованныхПриемокДляОбновления = Рез.Выгрузить();
	//В этот момент мы имеем выборку из базы, но если сумма изменена, а документ не записан, то суммы там не актуальны.
	//А вызов происходит в процедуре "перед записью"
	//Поэтому надо актуализировать суммы в ТЗ:
	Если ТипЗнч(ОбъектПриемкиИлиОплаты) = Тип("ДокументОбъект.уб_ПриемкаОплат") Тогда
		Для каждого Стр Из ОбъектПриемкиИлиОплаты.Полисы Цикл
			НайденнаяСтрока = тзНесквитованныхПриемокДляОбновления.Найти(Стр.УИДСтроки, "УИДСтрокиТЧ");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Сумма = Стр.Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат тзНесквитованныхПриемокДляОбновления;
КонецФункции	

Функция ПолучитьСквитованныеОплаты(УИДГруппы,ОбъектОплаты = Неопределено)  Экспорт
	ЗапросСквитованныеОплаты = Новый Запрос;
	ЗапросСквитованныеОплаты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	К.ОплатаПолиса.Ссылка КАК ОплатаПолиса,
	|	К.ОплатаПолиса.ОплаченоФакт КАК СуммаОплаты,
	//|	ВЫБОР
	//|		КОГДА К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
	//|			ТОГДА 0
	//|		ИНАЧЕ К.ОплатаПолиса.АВилиСкидкаСумма
	//|	КОНЕЦ
	|К.ОплатаПолиса.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
	|	ВЫБОР
	|		КОГДА К.ОплатаПолиса.НачисленнаяСуммаВзноса=0 //---Отключено---//К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
	|			ТОГДА 0
	|		ИНАЧЕ К.ОплатаПолиса.КВСумма
	|	КОНЕЦ КАК КВСумма,
	|	ВЫБОР
	|		КОГДА К.ОплатаПолиса.НачисленнаяСуммаВзноса=0 //---Отключено---//К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
	|			ТОГДА 0
	|		ИНАЧЕ К.ОплатаПолиса.КВСуммаДляАгента
	|	КОНЕЦ КАК КВСуммаДляАгента,
	|	К.ОплатаПолиса.ВознаграждениеМенеджера КАК ВознаграждениеМенеджера,
	|	К.ОплатаПолиса.ВидРасчетаСАгентом КАК ВидРасчетаСАгентом,
	|   К.ОплатаПолиса.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзносаВкл,
	//Если не включается в отчет, то и сумму не включаем в начисления ,
	//пока отключаем такой механизм
	//|	ВЫБОР
	//|		КОГДА К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
	//|			ТОГДА 0
	//|		ИНАЧЕ К.ОплатаПолиса.НачисленнаяСуммаВзноса
	//|	КОНЕЦ КАК НачисленнаяСуммаВзносаВкл,
	|	К.ОплатаПолиса.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
	|	К.ОплатаПолиса.СуммаДоп КАК СуммаДоп,
	|	ВЫБОР КОГДА К.ОплатаПолиса.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоАВ) Тогда 0 иначе  К.ОплатаПолиса.СкидкаВыплаченаяКлиенту конец КАК СкидкаВыплаченаяКлиенту,
	|	К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
	|   К.ОплатаПолиса.ОтчетПоставщику КАК ОтчетПоставщику,
	|   Выбор КОГДА К.ОплатаПолиса = &ОбъектОплаты Тогда ИСТИНА
	|   Иначе ЛОЖЬ Конец ЭтоТекущаяОплата
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|ГДЕ
	|	К.УИДГруппы = &УИДГруппы
	|Упорядочить ПО ЭтоТекущаяОплата УБЫВ";
	ЗапросСквитованныеОплаты.УстановитьПараметр("УИДГруппы",УИДГруппы);
	ЗапросСквитованныеОплаты.УстановитьПараметр("ОбъектОплаты",ОбъектОплаты.ССылка);
	Рез = ЗапросСквитованныеОплаты.Выполнить();
	тзОплат = Рез.Выгрузить();
	Если НЕ ОбъектОплаты = Неопределено Тогда
		ОбновитьДанныеОплатыВКвитовке(тзОплат, ОбъектОплаты);
	КонецЕсли;	
	Возврат тзОплат; 
КонецФункции	

Функция КвитовкаПоСуммам(
	Параметр, 
	тзНесквитованныхПриемокДляОбновления 	= Неопределено, 
	СуммаПоПриемкам 						= Неопределено, 
	СуммаПоОплатам 							= Неопределено, 
	ОбъектПриемкиИлиОплаты 					= Неопределено,
	//Если заданы тзОплат,тзПриемок,УИДГруппы, то они не перезаполняются  - проверяется только квитовка сумм
	тзОплат 								= Неопределено,
	тзПриемок 								= Неопределено,
	УИДГруппы = Неопределено) Экспорт
	
	Если УИДГруппы = Неопределено Тогда
		УИДГруппы = ПолучитьУИДГруппыКвитовки(Параметр);
	КонецЕсли;
	СуммаПоПриемкам = 0; //TODO проверить возможна ли ошибка при незаданных при обработке результата функции
	СуммаПоОплатам  = 0; //TODO проверить возможна ли ошибка при незаданных при обработке результата функции
	Если УИДГруппы = ЛОЖЬ Тогда
		Если тзОплат = Неопределено Тогда
			тзОплат = ПустаяТЗОплат();
		КонецЕсли;
		Возврат ЛОЖЬ;
	КонецЕсли;	
	
	//Для переданной строки проверяет, совпадают ли суммы всех ПРИЕМОК ОПЛАТ и ОПЛАТ ПОЛИСОВ,
	//которые по цепочке связаны с данной строкой приемки
	//Например:
	//					   
	//приемка1 <----| <------|      Приняли деньги, часть суммы = 5р (полная сумма - 10р)
	//              |        |
	//	        оплата1      |      Внесли оплату на 10р, связали с приемкой1
	//              |        |
	//приемка2 <----| <------|      Приняли еще 5р, подвязали к оплате1
	//	                     |
	//	        оплата2----->|      Переписали полис, в оплата1 - изменили сумму на 0р, 
	//	                     |      в новом полисе создали оплату2 на 8р (новая премия) и привязали к приемке1 и приемке2
	//приемка3 (-2р)    <----|      Создали приемку на -2р (Возврат денег клиенту) и связали с оплатой 2
	
	//В итоге, получаем связи:
	//приемка1 - оплата1
	//приемка1 - оплата2
	//приемка2 - оплата1
	//приемка2 - оплата2
	//приемка3 - оплата2
	//
	Если тзПриемок = Неопределено Тогда
		тзПриемок = ПолучитьСквитованныеПриемки(УИДГруппы,ОбъектПриемкиИлиОплаты);
	КонецЕсли;	
	Если тзПриемок.Количество()= 0 Тогда
		Если тзОплат = Неопределено Тогда
			тзОплат = ПустаяТЗОплат();
		КонецЕсли;
		Возврат ЛОЖЬ;
	КонецЕсли;	
	//Находим список связанных оплат 
	Если тзОплат = Неопределено Тогда
		тзОплат = ПолучитьСквитованныеОплаты(УИДГруппы,ОбъектПриемкиИлиОплаты)
	КонецЕсли;	
	Если тзОплат.Количество()= 0 Тогда
		Возврат ЛОЖЬ;
	Конецесли;	
	
	СуммаПоПриемкам = тзПриемок.Итог("Сумма");
	
	СуммаПоОплатам = тзОплат.Итог("СуммаОплаты");//-тзОплат.Итог("СкидкаВыплаченаяКлиенту");
	
	Если СуммаПоПриемкам = СуммаПоОплатам Тогда
		//Очистим таблицу значений, что бы не обновлялись приемки оплат 
		тзНесквитованныхПриемокДляОбновления = Новый ТаблицаЗначений;
		Возврат Истина;
	Иначе
		тзНесквитованныхПриемокДляОбновления = тзПриемок.Скопировать();
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьДанныеОплатыВКвитовке(тзОплат,ОбъектОплаты) Экспорт
	Если ТипЗнч(ОбъектОплаты) = Тип("ДокументОбъект.уб_ОплатаПолисов") Тогда
		//Дополнение актуальными данными из объекта
		НайденнаяСтрока = тзОплат.Найти(ОбъектОплаты.Ссылка, "ОплатаПолиса");
		Если НайденнаяСтрока <> Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,ОбъектОплаты);
			//Не совпадающие по именам или требуется корректировка
			НайденнаяСтрока.СуммаОплаты                  = ОбъектОплаты.ОплаченоФакт;
			НайденнаяСтрока.АВилиСкидкаСумма             = ?(ОбъектОплаты.НачисленнаяСуммаВзноса=0,0,ОбъектОплаты.АВилиСкидкаСумма); 
			НайденнаяСтрока.КВСумма                      = ?(ОбъектОплаты.НачисленнаяСуммаВзноса=0,0,ОбъектОплаты.КВСумма);
			НайденнаяСтрока.КВСуммаДляАгента             = ?(ОбъектОплаты.НачисленнаяСуммаВзноса=0,0,ОбъектОплаты.КВСуммаДляАгента); 
			НайденнаяСтрока.НачисленнаяСуммаВзносаВкл    = ОбъектОплаты.НачисленнаяСуммаВзноса;//Пока отключено?(ОбъектПриемкиИлиОплаты.НеВключатьВОтчетыПоставщикам,0,ОбъектПриемкиИлиОплаты.НачисленнаяСуммаВзноса);
			НайденнаяСтрока.СкидкаВыплаченаяКлиенту      = ?(ОбъектОплаты.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ,0,ОбъектОплаты.СкидкаВыплаченаяКлиенту);
			
			
			//НайденнаяСтрока.ВознаграждениеМенеджера      = ОбъектОплаты.ВознаграждениеМенеджера; 
			//НайденнаяСтрока.ВидРасчетаСАгентом           = ОбъектОплаты.ВидРасчетаСАгентом; 
			//НайденнаяСтрока.НачисленнаяСуммаВзноса       = ОбъектОплаты.НачисленнаяСуммаВзноса;
			//НайденнаяСтрока.СуммаДоп       				 = ОбъектОплаты.СуммаДоп;
			//НайденнаяСтрока.СкидкаВыплаченаяКлиенту      = ОбъектОплаты.СкидкаВыплаченаяКлиенту;
			//НайденнаяСтрока.НеВключатьВОтчетыПоставщикам = ОбъектОплаты.НеВключатьВОтчетыПоставщикам;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПустаяТЗОплат()
	тзОплат = Новый ТаблицаЗначений;
	тзОплат.Колонки.Добавить("ОплатаПолиса");
	тзОплат.Колонки.Добавить("СуммаОплаты");
	тзОплат.Колонки.Добавить("АВилиСкидкаСумма");
	тзОплат.Колонки.Добавить("КВСумма");
	тзОплат.Колонки.Добавить("КВСуммаДляАгента");
	тзОплат.Колонки.Добавить("ВознаграждениеМенеджера");
	тзОплат.Колонки.Добавить("ВидРасчетаСАгентом");
	тзОплат.Колонки.Добавить("НачисленнаяСуммаВзноса");
	тзОплат.Колонки.Добавить("НачисленнаяСуммаВзносаВкл");//Начислено по включенным в отчет
	тзОплат.Колонки.Добавить("СуммаДоп");
	тзОплат.Колонки.Добавить("СкидкаВыплаченаяКлиенту");
	тзОплат.Колонки.Добавить("НеВключатьВОтчетыПоставщикам");
	тзОплат.Колонки.Добавить("ОтчетПоставщику");
	Возврат тзОплат;
КонецФункции

	
//===============================================================================

Процедура СкрытьКолонку(эСписок, ИмяКолонки) Экспорт
	Колонка = эСписок.Колонки.Найти(ИмяКолонки);
	Если Колонка <> Неопределено Тогда
		Колонка.Видимость = Ложь;
		Колонка.ИзменятьВидимость = Ложь;
	КонецЕсли;
КонецПроцедуры

//===============================================================================
//TODO DEL
//Функция ПолучитьВидБСОТипаКвА7дляСК(оСК,ТипУчетаБСО=Неопределено) Экспорт
//	СтруктураКвитанции = ПараметрыСеанса.КвитанцииА7ДляСК.Получить(оСК);
//	Если СтруктураКвитанции = Неопределено Тогда
//		ВидБСОА7дляСК = Справочники.уб_ВидыБСО.НайтиПоРеквизиту("Тип", Перечисления.уб_ТипыБСО.КвитанцияА7, , оСК);
//		ТипУчетаБСО   = ВидБСОА7дляСК.ТипУчетаБСО;
//	Иначе
//		ВидБСОА7дляСК = СтруктураКвитанции["ВидБСО"];
//		ТипУчетаБСО   = СтруктураКвитанции["ТипУчетаБСО"];
//	КонецЕсли;	
//	Возврат ВидБСОА7дляСК;	
//КонецФункции

Функция ПолучитьБСОТипаКвА7дляСтраховогоПродукта(оСтраховойПродукт) Экспорт
	
	оБСО = Новый Структура("Существует, ВидБСО, ТипБСО, Обязательно, НазначениеБСО, ТипУчетаБСО, НомернойУчет", Ложь); 
	Если ЗначениеНеЗаполнено(оСтраховойПродукт) Тогда
		Возврат оБСО;
	КонецЕсли;
	Если ТипЗнч(оСтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
		типКвА7 = Перечисления.уб_ТипыБСО.КвитанцияА7;
		Для Каждого ОВ из оСтраховойПродукт.ВидыБСО Цикл
			Если ОВ.ВидБСО.Тип = типКвА7 Тогда
				оБСО.Существует = Истина;
				оБСО.ВидБСО = ОВ.ВидБСО;
				оБСО.ТипБСО = типКвА7;
				оБСО.Обязательно = ОВ.Обязательно;
				оБСО.НазначениеБСО = ОВ.НазначениеБСО;
				оБСО.ТипУчетаБСО = ОВ.ВидБСО.ТипУчетаБСО;
				оБСО.НомернойУчет = Истина; //уб_СЛ.ОпределитьВедетсяНомернойУчет(ОВ.ВидБСО);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат оБСО;
КонецФункции

//===============================================================================

Функция ПолучитьСписокДоступныхПоложений() Экспорт
	
	СписокПоложений = Новый СписокЗначений;
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПолученИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенИзСК);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенСТочки);
	СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПереданНаТочку);
	Возврат СписокПоложений;
	
КонецФункции

Функция ПолучитьФИНОтветственного() Экспорт
	ОсновнаяОрганизация  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	
	ОЛ = ОбщегоНазначения.ОтветственныеЛица(ОсновнаяОрганизация,ТекущаяДата());
	
	Если НЕ ЗначениеНеЗаполнено(ОЛ.ФинОтветственный) Тогда
		Возврат ОЛ.ФинОтветственный;	
	Иначе
		Возврат ОЛ.ГлавныйБухгалтер;	
	КонецЕсли;
	
КонецФункции

Функция РискВходитВСтраховойПродукт(СтраховойПродукт, Риск) Экспорт 
	Для Каждого ОР из СтраховойПродукт.ТипыОбъектовИРиски Цикл
		Если Риск = ОР.Риск Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ВидБСОВходитВСтраховойПродукт(СтраховойПродукт, ВидБСО) Экспорт 
	Для Каждого ОВ из СтраховойПродукт.ВидыБСО Цикл
		Если ВидБСО = ОВ.ВидБСО Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

//Истина, если Подразделение является самим или дочерним Подразделению Верх
Функция ПодразделениеВходитВПодразделениеВерх(ПодразделениеВерх,Подразделение) Экспорт
	Если ЗначениеНеЗаполнено(ПодразделениеВерх) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Подразделение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПодразделениеВерх = Подразделение Тогда
		Возврат Истина;
	Иначе
		Возврат ПодразделениеВходитВПодразделениеВерх(ПодразделениеВерх,Подразделение.Родитель);
	КонецЕсли;
КонецФункции

Функция АгентИзПодразделенияПользователя(оПользователь,Агент) Экспорт 
	
	ПодразделениеПользователя = ПолучитьПодразделениеАгента(оПользователь.ФизЛицо);
	Если ЗначениеНеЗАполнено(ПодразделениеПользователя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПодразделениеАгента = ПолучитьПодразделениеАгента(Агент);
	Если ЗначениеНеЗАполнено(ПодразделениеАгента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПодразделениеВходитВПодразделениеВерх(ПодразделениеПользователя,ПодразделениеАгента);
КонецФункции

///////////////////////////////////////////////////////////////////////////
// Процедуры заполнения шапочных полей для документов перемещения/поступления БСО
///////////////////////////////////////////////////////////////////////////

Процедура СообщитьОНехваткеПараметраДляАгента(оАгент)
	оПользователь = ПолучитьПользователяПоАгенту(оАгент);
	Если ЗначениеНеЗаполнено(оПользователь) Тогда
		Сообщить("Для агента '" + оАгент.Наименование + "' не задан пользователь. Обратитесь к администратору",СтатусСообщения.ОченьВажное);
		Возврат;	
	КонецЕсли;
	
	Сообщить("Для пользователя '" + оПользователь.Наименование + "' на задан параметр 'Подразделение Агентской Сети'. Обратитесь к администратору системы.",СтатусСообщения.ОченьВажное);
КонецПроцедуры

//TODO переделать в запрос
Функция ПолучитьПодразделениеАгента(оАгент, Знач НаДату = Неопределено, ВозвращатьПустое = Ложь, Уволен = Ложь) Экспорт
	
	Уволен = Ложь;	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();	
	КонецЕсли;
	
	// Если агент не передан, то возвращает основное подразделение по учету БСО
	Если Не ЗначениеЗаполнено(оАгент) Тогда
		Если ВозвращатьПустое Тогда
			ПустоеП = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Возврат ПустоеП;
		Иначе
			Возврат ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
		КонецЕсли;
	КонецЕсли;
	ТипАгента = ТипЗнч(оАгент);
	//Если тип агента - Контрагент, то возвращаем подразделение агентской сети
	Если ТипАгента = Тип("СправочникСсылка.ФизическиеЛица") Тогда
	ИначеЕсли ТипАгента = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети;
	ИначеЕсли ТипАгента = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Возврат оАгент;
	КонецЕсли;
	//Ищем подразделение в регистре сведений уб_ДвижениеФизлицПоПодразделениям
	Отбор = Новый Структура("Агент",оАгент);
	ВыбПодразделений = РегистрыСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НаДату,Отбор);
	Если ВыбПодразделений.Количество() > 0 Тогда
		Уволен = ВыбПодразделений[0].Выбытие;
		Возврат ВыбПодразделений[0].Подразделение;
	КонецЕсли; 
	Если оАгент.ЭтоГруппа Тогда
		Если ВозвращатьПустое Тогда
			ПустоеП = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Возврат ПустоеП;
		Иначе
			Попытка
				Возврат ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
			Исключение
				ПустоеП = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				Возврат ПустоеП;
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	
	// Далее - старый код
	оАгентРодитель = оАгент.Родитель;
	Если оАгентРодитель.ЭлементыГруппыЕстьСотрудники И Не оАгент.ПометкаУдаления Тогда
		#Если Клиент Тогда
			Сообщить("Внимание! Сотрудник " + Строка(оАгент) + " находится в группах сотрудников, но не закреплен за подразделением!. Исправьте, либо переместите в уволенные.")
		#КонецЕсли
	КонецЕсли;
	МОЛпоБСО = уб_КЭШируемые.ПолучитьМОЛпоБСО(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
	Если оАгент = МОЛпоБСО Тогда
		Попытка
			Возврат ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
		Исключение
			ПустоеП = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Возврат ПустоеП;
		КонецПопытки;	
	КонецЕсли;
	//оПользователь = ПолучитьПользователяПоАгенту(оАгент);
	//Если НЕ ЗначениеНеЗаполнено(оПользователь) Тогда
	//	оОснПодр = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(оПользователь, "ОсновноеПодразделениеОрганизации");
	//Иначе
	//	
	//КонецЕсли;
	Если ВозвращатьПустое Тогда
		ПустоеП = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		Возврат ПустоеП;
	КонецЕсли;
	//Для физлица не задан пользователь
	//Пробуем выяснить подразделение по группе
	Если оАгентРодитель = ПараметрыСеанса.уб_Константы.уб_ГруппаАгентовФизЛиц Тогда
		оОснПодр = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети;
	ИначеЕсли оАгентРодитель = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудниковКурьеров Тогда
		оОснПодр = ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС;
	ИначеЕсли оАгентРодитель = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудников Тогда
		оОснПодр = ПараметрыСеанса.уб_Константы.уб_ПодразделениеОтделаПродаж;
	Иначе
		Возврат ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	КонецЕсли;
	Возврат оОснПодр;
	
КонецФункции

Функция ПолучитьСписокСотрудниковАктуальныхВМесяце(ДатаИзМесяца = Неопределено,ПодразделениеСотрудника = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаИзМесяца) Тогда
		ДатаИзМесяца = ТекущаяДата();	
	КонецЕсли;
	СписокСотрудниковАктуальныхВЭтомМесяце = Новый СписокЗначений;
	
	Если НЕ ПодразделениеСотрудника = Неопределено Тогда
		тз = уб_КЭШируемые.ПолучитьСписокСотрудниковАктуальныхВМесяце(НачалоМесяца(ДатаИзМесяца),Истина);
		Для каждого СтрокаТЗ из тз Цикл
			Если СтрокаТЗ.Подразделение = ПодразделениеСотрудника или СтрокаТЗ.Подразделение.ПринадлежитЭлементу(ПодразделениеСотрудника) Тогда
				СписокСотрудниковАктуальныхВЭтомМесяце.Добавить(СтрокаТЗ.Агент);
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		СписокСотрудниковАктуальныхВЭтомМесяце.ЗагрузитьЗначения(уб_КЭШируемые.ПолучитьСписокСотрудниковАктуальныхВМесяце(НачалоМесяца(ДатаИзМесяца)));
	КонецЕсли;	

	
	Возврат СписокСотрудниковАктуальныхВЭтомМесяце;
	
КонецФункции

Функция ИнфоДляАгента(оАгент, НаДату = Неопределено, Разделитель = "/") Экспорт
	
	оПодразделение = Неопределено;
	Если НЕ ЗначениеЗаполнено(оАгент) Тогда
		Возврат "";
	Иначе	
		ТипАгента = ТипЗнч(оАгент);
		Уволен = Ложь;
		Если ТипАгента = Тип("СправочникСсылка.Контрагенты") Тогда
			оПодразделение = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети;
			//Инфо = оПодразделение.Наименование + РЗД + оПодразделение.Владелец.Наименование;
		ИначеЕсли ТипЗнч(оАгент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			оПодразделение = оАгент; 
			//Инфо = оПодразделение.Владелец.Наименование;
			//Возврат Инфо;
		Иначе
			Если НаДату = Неопределено Тогда
				НаДату = ТекущаяДата();	
			КонецЕсли;
			оПодразделение = ПолучитьПодразделениеАгента(оАгент, НаДату, Истина, Уволен);
			Если ЗначениеНеЗаполнено(оПодразделение) Тогда
				Возврат "?";
			КонецЕсли;
		КонецЕсли;
		Если Разделитель = "," Тогда
			РЗД = ", ";	
		Иначе	
			РЗД = " " + Разделитель + " ";
		КонецЕсли;
		Инфо = уб_КЭШируемые.ПолучитьИнформациюОПодразделении(оПодразделение,РЗД)+//оПодразделение.Наименование + РЗД + оПодразделение.Владелец.Наименование +  
		?(Уволен, РЗД + "[УВОЛЕН]", "");
		Возврат Инфо;	    
	КонецЕсли;
КонецФункции

///////////////////////////////////////////////////////////////////////////
// Процедуры данных об авторе и модификаторе
///////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьИнфСтроку(Форма) Экспорт
	
	Попытка
		Объект = Форма.ЭтотОбъект;
		ЭтоСсылка = Истина;
	Исключение
		Объект = Форма.РегистрСведенийМенеджерЗаписи;
		ЭтоСсылка = Ложь;
	КонецПопытки;
	
	//Если дата не задана возвращаем [?]
	Создан			 = "Создан: "	+ ?(ЗначениеЗаполнено(Объект.ДатаСоздания),		Формат(Объект.ДатаСоздания,	"ДФ='dd/MM/yy'"),		   "[?]");
	Изменен			 = "Изменен: "	+ ?(ЗначениеЗаполнено(Объект.ДатаИзменения),	Формат(Объект.ДатаИзменения,"ДФ='dd/MM/yy'"),	       "[?]");
	СозданПодсказка	 = "Создан: "	+ ?(ЗначениеЗаполнено(Объект.ДатаСоздания),		Формат(Объект.ДатаСоздания,	"ДФ='dd/MM/yy HH:mm'"),    "[?]");
	ИзмененПодсказка = "Изменен: "	+ ?(ЗначениеЗаполнено(Объект.ДатаИзменения),	Формат(Объект.ДатаИзменения,"ДФ='dd/MM/yy HH:mm:ss'"), "[?]");
	//Заполняем автора и модификатора
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Автор			= уб_Кэшируемые.ФИОФизлицаСтрокой(Объект.Автор);//ФИОФизлицаСтрокой(Объект.Автор, , , , Истина);
		//ИначеЕсли ЗначениеЗаполнено(Объект.Автор) Тогда
		//	Автор			= ОбщегоНазначения.ФИО_ФизЛица(Объект.Автор.Наименование);
	Иначе
		Автор			= "[Неопределено]";
	КонецЕсли;
	
	Если Объект.Автор = Объект.Модификатор Тогда
		Модификатор = Автор;
	ИначеЕсли ЗначениеЗаполнено(Объект.Модификатор) Тогда
		Модификатор		= уб_Кэшируемые.ФИОФизлицаСтрокой(Объект.Модификатор);//ФИОФизлицаСтрокой(Объект.Модификатор, , , , Истина);
		//ИначеЕсли ЗначениеЗаполнено(Объект.Модификатор) Тогда
		//	Модификатор		= ОбщегоНазначения.ФИО_ФизЛица(Объект.Модификатор.Наименование);
	Иначе
		Модификатор		= "[Неопределено]";
	КонецЕсли;
	
	//Заполняем информационную строку
	ЭлементНадписьАвтор = Форма.ЭлементыФормы.Найти("НадписьАвтор");
	Если ЭлементНадписьАвтор <> Неопределено Тогда
		Форма.фИнфСтрока = Создан + ", " + Автор + "; " + Изменен + ", " + Модификатор;
		ЭлементНадписьАвтор.Подсказка = СозданПодсказка + ", " + Автор + "; " + ИзмененПодсказка + ", " + Модификатор;
		//тест. При изменении ширины поля снова срабатывают привязки, изза чего надпись в событии "ПриОткрытии" формы "сползает" вверх
		#Если ТолстыйКлиент Тогда
			УстановитьЗначение(ЭлементНадписьАвтор.Ширина, 390);
		#КонецЕсли
	Иначе
		Форма.фИнфСтрока = СозданПодсказка + ", " + Автор + "; " + ИзмененПодсказка + ", " + Модификатор;
	КонецЕсли;
	Если ЭтоСсылка тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			уб_temp.ЕстьСобытиеВхода(ИСТИНА);
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				журналСобытий = Справочники.журналСобытий.СоздатьЭлемент();
				журналСобытий.Дата = ТекущаяДата();
				журналСобытий.Событие = Справочники.ВидСобытия.Открытие;
				журналСобытий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				журналСобытий.Информация = "Открытие или запись ссылки";
				журналСобытий.Объект = Объект.Ссылка;
				журналСобытий.Записать();
			Исключение
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ИспользуетсяОбщийРеквизит(Имя,МетаОбъект) Экспорт
	мдРеквизита = Метаданные.ОбщиеРеквизиты [Имя];
	ТипИспользования = мдРеквизита.Состав.Найти(МетаОбъект).Использование;
	ИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
	Используется = (ТипИспользования	= ИспользованиеОбщегоРеквизита.Использовать) 
	 ИЛИ (ТипИспользования	= ИспользованиеОбщегоРеквизита.Авто И мдРеквизита.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать);
	Возврат  Используется
КонецФункции	
//ПроверкаМодифицированности - Ложь при отсутствии в Объекте данных о
//модифицированности, требуется ручная проверка на модифицированность при вызове процедуры
Процедура ОтметитьФактМодификации(Объект, ПроверкаМодифицированности = Истина) Экспорт 
	
	Попытка
		//Если стоит флаг загрузка, не отмечаем факт модификации
		Если Объект.ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
	Исключение
		//
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("У объекта нет обмена данными "+ТипЗнч(Объект), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"));
	КонецПопытки;
	Попытка
		Рекв = Метаданные.ОбщиеРеквизиты.Автор;
		МетаОбъекта = Объект.Метаданные();
		естьАвтор = ИспользуетсяОбщийРеквизит("Автор",МетаОбъекта);
		естьДатаСоздания = ИспользуетсяОбщийРеквизит("ДатаСоздания",МетаОбъекта);
		естьМодификатор = ИспользуетсяОбщийРеквизит("Модификатор",МетаОбъекта);
		естьДатаИзменения = ИспользуетсяОбщийРеквизит("ДатаИзменения",МетаОбъекта);
		Если естьАвтор  И (Объект.ЭтоНовый() ИЛИ Объект.Автор.Пустая() ИЛИ (естьДатаСоздания и Объект.ДатаСоздания = Дата(1,1,1))) Тогда
			Объект.Автор 			= ПараметрыСеанса.ТекущийПользователь;
			Если естьДатаСоздания Тогда
				Объект.ДатаСоздания = ТекущаяДата();
			КонецЕсли;	
			Если естьМодификатор Тогда
				Объект.Модификатор	= Объект.Автор;
			КонецЕсли;	
			Если естьДатаИзменения Тогда
				Объект.ДатаИзменения = Объект.ДатаСоздания;
			КонецЕсли;	
		ИначеЕсли естьМодификатор и ПроверкаМодифицированности Тогда
			Если Объект.Модифицированность() Тогда
				Если Объект.Модификатор <> ПараметрыСеанса.ТекущийПользователь Тогда
					Объект.Модификатор = ПараметрыСеанса.ТекущийПользователь;
				КонецЕсли;
				Если естьДатаИзменения Тогда
					Объект.ДатаИзменения = ТекущаяДата();
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Если естьМодификатор Тогда
				Объект.Модификатор = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;	
			Если естьДатаИзменения Тогда
				Объект.ДатаИзменения = ТекущаяДата();
			КонецЕсли;	
		КонецЕсли;
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось проставить модификацию "+ТипЗнч(Объект)+" "+ОписаниеОшибки());
	КонецПопытки;
	//уб_temp.СоздатьЛогПользователя(Строка(ТипЗнч(Объект)), Истина);
	
КонецПроцедуры

//при открытии регистра сведений для обработки автора, модификатора. МЗ - менеджер записи регистра
Процедура ЗаполнитьИнфоОМодификацииДляРС(МЗ, Модифицированность = Ложь) Экспорт 
	
	Если Модифицированность Тогда
		Если МЗ.Автор.Пустая() Или МЗ.ДатаСоздания = Дата(1,1,1) Тогда
			МЗ.Автор 			= ПараметрыСеанса.ТекущийПользователь;
			МЗ.ДатаСоздания     = ТекущаяДата();
			МЗ.Модификатор		= МЗ.Автор;
			МЗ.ДатаИзменения	= МЗ.ДатаСоздания;
		Иначе
			МЗ.Модификатор 		= ПараметрыСеанса.ТекущийПользователь;
			МЗ.ДатаИзменения	= ТекущаяДата();
		КонецЕсли;
	ИначеЕсли МЗ.Автор.Пустая() Или МЗ.Модификатор.Пустая() Или МЗ.ДатаСоздания = Дата(1,1,1) Или МЗ.ДатаИзменения = Дата(1,1,1) Тогда
		МЗ.Автор 			= ПараметрыСеанса.ТекущийПользователь;
		МЗ.ДатаСоздания 	= ТекущаяДата();
		МЗ.ДатаИзменения 	= МЗ.ДатаСоздания;
		МЗ.Модификатор 		= МЗ.Автор;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////

Функция ГенерироватьУИД(Оплаты, УИД) Экспорт
	
	ТекУИД = "";
	ПредУИД = "";
	Число = 0;
	Число2 = 0;
	ГСЧ = Новый ГенераторСлучайныхЧисел(255);
	Число2 = ГСЧ.СлучайноеЧисло(0, 100000);
	НовыйПароль = "";
	Пока СтрДлина(НовыйПароль) < 26 Цикл
		Число = ГСЧ.СлучайноеЧисло(48, 122);
		Если  ((Число>=48) И (Число<=57)) или ((Число>=97) И (Число<=122)) Тогда
			НовыйПароль = НовыйПароль+Символ(Число);
		КонецЕсли;
	КонецЦикла;
	
	УИД = Строка(Формат(Оплаты.Период, "ДФ=""ддММггггЧЧммсс"""))+Строка(НовыйПароль)+Строка(Формат(Число2, "ЧГ=0"));
	Возврат УИД;	
КонецФункции	

//Определяет, выполнялись ли движения Квитанции регистратором СП (страховым полисом)
Функция ЕстьДвиженияКвитанцииИзОплаты(Оплата) Экспорт
	СП = Оплата.СтраховойПолис;
	Если ЗначениеНеЗаполнено(СП) Тогда
		Возврат Ложь;	
	КонецЕсли;
	Если НЕ СП.Проведен Тогда
		Возврат Ложь;	
	КонецЕсли;
	Возврат ЕстьДвиженияКвитанцииПоЭтомуСП(Оплата.НомерКвитанции, СП);
КонецФункции

Функция ЕстьДвиженияКвитанцииПоЭтомуСП(НомерКвитанции, СП) Экспорт
	ЗапросЕстьДвиженияКвитанции = Новый Запрос;
	ЗапросЕстьДвиженияКвитанции.Текст = "ВЫБРАТЬ
	               |	Д.Период
	               |ИЗ
	               |	РегистрСведений.уб_ДвиженияБСО КАК Д
	               |ГДЕ
	               |	Д.НомерБСО = &НомерБСО
	               |	И Д.Подтверждено
				   |	И Д.КодОперации = Значение(Перечисление.уб_КодыОперацийБСО.ОформлениеКвитанции)
				   |	И Д.Регистратор = &Регистратор
				   |	И Д.Активность";
	
	ЗапросЕстьДвиженияКвитанции.УстановитьПараметр("НомерБСО", НомерКвитанции);
	ЗапросЕстьДвиженияКвитанции.УстановитьПараметр("Регистратор", СП);
	
	Результат = ЗапросЕстьДвиженияКвитанции.Выполнить();
	Возврат (НЕ Результат.Пустой());
КонецФункции

Функция ЕстьДвиженияКвитанцииПоДругомуСП(НомерКвитанции, СП, НайденныйСП = Неопределено) Экспорт
	ЗапросДвиженияКвитанцииПоДругомуПолису = Новый Запрос;
	ЗапросДвиженияКвитанцииПоДругомуПолису.Текст = "ВЫБРАТЬ
	|	Д.Период,
	|	Д.Регистратор.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|	Д.КодОперации = Значение(Перечисление.уб_КодыОперацийБСО.ОформлениеКвитанции)
	|	И Д.НомерБСО = &НомерБСО
	|	И Д.Подтверждено
	|	И Д.Активность
	|	И Д.Регистратор <> &Регистратор
	|	И Д.Регистратор ССЫЛКА Документ.уб_СтраховойПолис";
	
	ЗапросДвиженияКвитанцииПоДругомуПолису.УстановитьПараметр("НомерБСО", НомерКвитанции);
	ЗапросДвиженияКвитанцииПоДругомуПолису.УстановитьПараметр("Регистратор", СП);
	
	Результат = ЗапросДвиженияКвитанцииПоДругомуПолису.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	НайденныйСП = Выборка.Ссылка;
	Возврат Истина;
КонецФункции

Функция ЕстьДвиженияКвитанцииПоЛюбомуСП(НомерКвитанции, СП = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д.Период,
	|	Д.Регистратор.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|	Д.КодОперации = Значение(Перечисление.уб_КодыОперацийБСО.ОформлениеКвитанции)
	|	И Д.НомерБСО = &НомерБСО
	|	И Д.Подтверждено
	|	И Д.Активность
	|	И Д.Регистратор ССЫЛКА Документ.уб_СтраховойПолис";
	
	Запрос.УстановитьПараметр("НомерБСО", НомерКвитанции);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	СП = Выборка.Ссылка;
	Возврат Истина;
КонецФункции

// Определяет наличие движений любого номерного БСО за период
Функция ЕстьДвиженияБСОзаПериод(СК, ВидБСО, НомерБСО, ВремяС, ВремяПО = Неопределено, ИнфоОДвижениях = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д.Период КАК Период,
	|	Д.Регистратор,
	|	Д.СК,
	|	Д.ВидБСО,
	|	Д.НомерБСО,
	|	Д.НомерПолиса,
	|	Д.ГодПолиса,
	|	Д.ПоложениеБСО,
	|	Д.СостояниеБСО,
	|	Д.СтраховойПолис,
	|	Д.КодОперации,
	|	Д.ОрганизацияАгент,
	|	Д.Агент
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|	Д.ВидБСО = &ВидБСО
	|	И Д.НомерБСО = &НомерБСО
	|	И Д.Подтверждено
	|	И Д.Активность
	|	И Д.Период МЕЖДУ &ВремяС И &ВремяПО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("СК", СК);
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", СокрЛП(НомерБСО));
	Запрос.УстановитьПараметр("ВремяС", ВремяС);
	ВремяПО = ?(ВремяПО = Неопределено,ТекущаяДата(),ВремяПО);
	Запрос.УстановитьПараметр("ВремяПО", ВремяПО);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ИнфоОДвижениях = "";
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если ИнфоОДвижениях = Неопределено Тогда
		Отступ = "";
		Сообщать = Истина; 	
	Иначе
		Сообщать = Ложь; 	
		Отступ = ИнфоОДвижениях;
	КонецЕсли; 
	
	ИнфоОДвижениях = "";
	Пока Выборка.Следующий() Цикл
		ИнфоОДвижениях = ИнфоОДвижениях + (?(ИнфоОДвижениях = "","","
		|")) + Отступ + "Движение БСО [" + Строка(Выборка.ВидБСО) 
		+ " Положение: " + Строка(Выборка.ПоложениеБСО)
		+ ", Состояние: " + Строка(Выборка.СостояниеБСО) 
		+ "] № " + НомерБСО + " | Документ: [" 
		+ Строка(Выборка.Регистратор) + "] | Агент: " + Строка(Выборка.Агент);
		Если Сообщать Тогда
			Сообщить(ИнфоОДвижениях);
			ИнфоОДвижениях = "";
		КонецЕсли; 
	КонецЦикла;
	ИнфоОДвижениях = "
	|" + ИнфоОДвижениях; 
	Возврат Истина;
КонецФункции

Функция ПолучитьВидБСОПолисаПоСтраховомуПродукту(оСтраховойПродукт) Экспорт
	Если ТипЗНЧ(оСтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
		Если оСтраховойПродукт.Вид = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или оСтраховойПродукт.Вид = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда
			типБСО = Перечисления.уб_ТипыБСО.ПолисОсаго;
		Иначе
			типБСО = Перечисления.уб_ТипыБСО.Полис;
		КонецЕсли;	
		
		Для Каждого ОВ из оСтраховойПродукт.ВидыБСО Цикл
			Если ОВ.ВидБСО.Тип = типБСО Тогда
				Возврат ОВ.ВидБСО;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗНЧ(оСтраховойПродукт) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Возврат оСтраховойПродукт;
	КонецЕсли;
	Возврат Справочники.уб_ВидыБСО.ПустаяСсылка();
КонецФункции

//Получает Уник. ИД таблицы значений длиной 255 символов
Функция ПолучитьКлючИЗТЗ(ТЗ) Экспорт
	ИД = "";
	для каждого Кол из ТЗ.колонки Цикл
		КолИмя = Кол.Имя;
		предЗнчПоля = "";
		Сч = 0;
		Для Каждого Стрк ИЗ ТЗ Цикл
			ЗнчПоля = Стрк[КолИмя]; 
			Если ЗнчПоля <> предЗнчПоля Тогда
				ИД = ИД + ЗнчПоля;
				предЗнчПоля = ЗнчПоля;
			Иначе 
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
		ИД = ИД + Сч;
	КонецЦикла;
	Ключ = Лев(ИД,210);
	Остат = Сред(ИД,101);
	ДлинаИД = СтрДлина(Остат);
	CRC = 0;
	Для к=1 по ДлинаИД цикл  
		код = КодСимвола(Сред(Остат,к,1));
		CRC = CRC + код;
		Если CRC > 10000 Тогда
			Ключ = Ключ + Формат(CRC,"ЧГ=");
			CRC = 0;
		КонецЕсли;
	КонецЦикла;    
	Возврат Лев(Ключ + Формат(CRC,"ЧГ="),255);
КонецФункции

//Получает таблицу значений и формирует модальный диалог для ыбора нужного КВ из списка
Функция ЗапросНаВыборКВ(ТЗ,Заголов) Экспорт
	ФормаВыбора = ПолучитьОбщуюФорму("уб_ПростойПодбор");
	ТП = ФормаВыбора.ТаблицаПодбора;
	
	ТП.Колонки.Очистить();
	Для Каждого кол из ТЗ.колонки Цикл
		колИмя = кол.Имя;
		ПоставщикЕсть = Ложь;
		//Если в табл. значений ТЗ колонка содержит значение, 
		//то в ТП будет добавлена одноименная колонка
		// (при условии, чо она есть среди имен, перечисленных ниже. К примеру, колонка "Организация добавлена не будет")
		Для Каждого стрТЗ из ТЗ Цикл
			Если НЕ ЗначениеНеЗаполнено(стрТЗ[колИмя]) Тогда
				Если колИмя = "Процент" Тогда
					ТП.Колонки.Вставить(0,"Процент",,"КВ, %",6);
				ИначеЕсли колИмя = "Условие" Тогда 
					ТП.Колонки.Добавить("Условие",,"Условие",27);
				ИначеЕсли колИмя = "СтраховойПродукт" Тогда 
					ТП.Колонки.Добавить("СтраховойПродукт",,"С.Продукт",27);
				ИначеЕсли колИмя = "ВидСП" Тогда 
					ТП.Колонки.Добавить("ВидСП",,"Вид",12);
				ИначеЕсли колИмя = "Риск" Тогда 
					ТП.Колонки.Добавить("Риск",,"Риск",27);
				ИначеЕсли колИмя = "СК" Тогда
					ТП.Колонки.Добавить("СК",,"СК",20);
				ИначеЕсли колИмя = "ПроцентДляОтчета" Тогда
					ТП.Колонки.Добавить("ПроцентДляОтчета",,"%КВ Для Отчета",1);
				ИначеЕсли колИмя = "Поставщик" Тогда 
					ТП.Колонки.Добавить("Поставщик",,"Поставщик",15);
				КонецЕсли;
				Прервать;
			Иначе
				Если колИмя = "Поставщик" И Не ПоставщикЕсть Тогда 
					ТП.Колонки.Добавить("Поставщик",,"Поставщик",15);
					ПоставщикЕсть = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ФормаВыбора.ЭлементыФормы.ТаблицаПодбора.СоздатьКолонки();
	
	
	//Заполняем созданнуб таблицу (ТП) значениями из (ТЗ)
	Для Каждого стрТЗ из ТЗ Цикл
		новСтрТП = ТП.Добавить();
		Для Каждого кол из ТП.колонки Цикл
			новСтрТП[кол.Имя] = стрТЗ[кол.Имя];
		КонецЦикла;
	КонецЦикла;
	
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.МножественныйВыбор = Ложь;
	ФормаВыбора.ЗакрыватьПриВыборе = Истина;
	#Если Клиент Тогда	
		ФормаВыбора.ЭлементыФормы.ТаблицаПодбора.РежимВыделения = РежимВыделенияТабличногоПоля.Одиночный;
	#КонецЕсли	
	ФормаВыбора.ЭлементыФормы.ТаблицаПодбора.РежимВыбора = Истина;
	ФормаВыбора.Заголовок = Заголов;
	ФормаВыбора.ОткрытьМодально();
	Выбранное = ФормаВыбора.Выбранное;
	Если Выбранное = Неопределено Тогда
		Возврат Неопределено;	
	ИначеЕсли Выбранное.Количество() > 0 Тогда
		Возврат Выбранное[0];
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

Функция АвтовыборКВпоВЫбранномуРанееАВ(ТЗКВ,ВыбраннаяСтрокаАВ) Экспорт
	СтруктураПоиска = Новый Структура();
	
	ТЗАВ = ВыбраннаяСтрокаАВ.Владелец();
	Для Каждого кол из ТЗАВ.колонки Цикл
		колИмя = кол.Имя;
		Если колИмя <> "Условие"
			И колИмя <> "СтраховойПродукт"
			И колИмя <> "ВидСП"
			И колИмя <> "Риск"
			И колИмя <> "Поставщик"
			И колИмя <> "СК"
			Тогда
			Продолжить;
		КонецЕсли;
		Если ТЗКВ.Колонки.Найти(колИмя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПоиска.Вставить(колИмя,ВыбраннаяСтрокаАВ[колИмя]);
	КонецЦикла;
	НайденныеСтроки = ТЗКВ.НайтиСтроки(СтруктураПоиска);	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	Иначе
		Возврат ТЗКВ[0];	
	КонецЕсли;
КонецФункции

//ДатаНачалоЭтоНачалоМесяца - устанавливает датой начала поиска по менеджеру документов - начало месяца, иначе - начало дня последнего дня месяца
Функция ПолучитьДокументДляАвтоматическойЗаписи(ДокДата, ДокументМенеджер, ИмяТабличнойЧасти, МаксКоличСтрокВДокументе, БратьПроведенные = Истина, ЭтоДвижениеНомераПолиса = Ложь) Экспорт
	
	//Ищем документ, датированный концом месяца документа перемещения
	//Если не находим, создаем новый	
	ДатаКонца = КонецМесяца(ДокДата); 
	//если это движение номера полиса тогда ДатаНачала - начало месяца, иначе - начало последнего дня месяца
	ЭтоДвижениеНомераПолиса = ТипЗнч(ДокументМенеджер) = Тип("ДокументМенеджер.уб_ДвиженияНомераПолиса");
	ДатаНачала = ?(ЭтоДвижениеНомераПолиса, НачалоМесяца(ДокДата), ДатаКонца - 60*60*24 + 1);
	НовыйНомер = 0;
	НоваяДата = ДатаКонца - 60*60*24 + 1;
	ДоК = Неопределено;
	Выборка = ДокументМенеджер.Выбрать(ДатаНачала, ДатаКонца,,"Дата УБЫВ");
	Пока Выборка.Следующий() Цикл
		ДоК = Выборка.ПолучитьОбъект();
		Если ДоК[ИмяТабличнойЧасти].Количество() > МаксКоличСтрокВДокументе ИЛИ (БратьПроведенные И НЕ ДоК.Проведен) Тогда			
			НоваяДата = Дата(ДоК.Дата) + 60;
			НовыйНомер = Док.Номер + 1;
			ДоК = Неопределено;			
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Если ДоК = Неопределено Тогда
		ДоК = ДокументМенеджер.СоздатьДокумент();
		ДоК.Дата = НоваяДата; 
		Если ЭтоДвижениеНомераПолиса Тогда
			Док.Комментарий = "Создан автоматически при выдаче свободных номеров."
		Иначе
			ДоК.Номер = ?(НовыйНомер > 0,НовыйНомер,(Год(ДатаКонца)-2000)*100000 + Месяц(ДатаКонца)*1000 ); 
		КонецЕсли;
		ДоК.ДатаСоздания = ТекущаяДата(); 
		ДоК.ДатаИзменения = ТекущаяДата(); 
		ДоК.Автор = ПараметрыСеанса.ТекущийПользователь; 
		ДоК.Модификатор = ПараметрыСеанса.ТекущийПользователь; 
	КонецЕсли;
	Возврат ДоК;
	
КонецФункции

Функция ПолучитьДокументДвиженияНомераПолиса(ДокДата) Экспорт
	//Ищем документ Компенсации, датированный концом месяца документа перемещения
	//Если не находим, создаем новый
	Возврат ПолучитьДокументДляАвтоматическойЗаписи(ДокДата, Документы.уб_ДвиженияНомераПолиса, "СНП", 50);
КонецФункции

//Добавление компенсации
Функция ПроверкаУникальностиКомпенсации(СтруктураКомпенсации) Экспорт 
	одинДень = 60*60*24;
	
	Если СтруктураКомпенсации.Агент = СтруктураКомпенсации.АгентКуда
		И  СтруктураКомпенсации.Поставщик = СтруктураКомпенсации.ПоставщикКуда 
		И  СтруктураКомпенсации.ОрганизацияАгент = СтруктураКомпенсации.ОрганизацияАгентКуда 
		Тогда
		с1 = "для перемещения БСО [" + Строка(СтруктураКомпенсации.ВидБСО) + " № " + СтруктураКомпенсации.НомерБСО +
		" с аг. " + Строка(СтруктураКомпенсации.Агент) + " на " + Строка(СтруктураКомпенсации.АгентКуда) +
		"]";
		Сообщить("Отклонено: Совпадают агенты, поставщик и оргагент `с` и `на кого` " + с1);
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Д.Период КАК Период,
	|	Д.Регистратор,
	|	Д.СК,
	|	Д.ВидБСО,
	|	Д.НомерБСО,
	|	Д.Поставщик,
	|	Д.ОрганизацияАгент,
	//|	Д.ДокПроведен,
	//|	Д.Активность Как ДокПроведен,
	|	Д.Активность Как Активность,
	|	Д.Подтверждено,
	|	Д.АгентОтправитель,
	|	Д.Агент
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|   Д.ВидБСО = &ВидБСО
	|	И Д.НомерБСО = &НомерБСО
	//|	Д.СК = &СК
	|	И Д.Поставщик = &Поставщик
	|	И Д.ОрганизацияАгент = &ОрганизацияАгент
	|	И Д.Подтверждено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	//TODO Требуется проверка на активность?
	
	Запрос.УстановитьПараметр("СК", СтруктураКомпенсации.СК);
	Запрос.УстановитьПараметр("ВидБСО", СтруктураКомпенсации.ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", СтруктураКомпенсации.НомерБСО);
	Запрос.УстановитьПараметр("Поставщик", СтруктураКомпенсации.Поставщик);
	Запрос.УстановитьПараметр("ОрганизацияАгент", СтруктураКомпенсации.ОрганизацияАгент);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		с1 = "для перемещения БСО [СК '" + СтруктураКомпенсации.СК + "', '" + Строка(СтруктураКомпенсации.ВидБСО) + "' № '" + СтруктураКомпенсации.НомерБСО +
		"' от '" + Строка(СтруктураКомпенсации.ДатаПеремещения) +  "'] с аг. '" + Строка(СтруктураКомпенсации.Агент) + "' на '" + Строка(СтруктураКомпенсации.АгентКуда) +
		"' в док-те: " + строка(Выборка.Регистратор) + " ";
		
		//Проверяем на присутствие аналогичной записи со значениями измерений
		Если Выборка.Период = СтруктураКомпенсации.ДатаПеремещения Тогда
			Сообщить("Отклонено: Найдено движение с такими же ключевыми значениями " + с1, СтатусСообщения.Внимание);
			Возврат Ложь;
		КонецЕсли;
		
		Дельта = Выборка.Период - СтруктураКомпенсации.ДатаПеремещения;
		Если Дельта < 0 Тогда Дельта = Дельта * -1 КонецЕсли;
		
		//Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.уб_КомпенсацияДвиженийБСО") Тогда
		Если Выборка.АгентОтправитель = СтруктураКомпенсации.Агент 
			И Выборка.Агент = СтруктураКомпенсации.АгентКуда
			Тогда
			
			Если Дельта < одинДень Тогда
				Сообщить("Отклонено: Найдена компенсация-дубль (разница менее 24ч) " + с1, СтатусСообщения.Внимание);
				Возврат Ложь;
			ИначеЕсли Дельта < одинДень*7 Тогда
				Сообщить("Найдена аналогичная компенсация (от 1 до 7 дней разницы) " + с1, СтатусСообщения.Информация);
			ИначеЕсли Дельта < одинДень*30 Тогда
				Сообщить("Найдена аналогичная компенсация (от 7 до 30 дней разницы) " + с1, СтатусСообщения.Информация);
			Иначе
				Сообщить("Найдена аналогичная компенсация (> 30 дней разницы) " + с1, СтатусСообщения.Информация);
			КонецЕсли;
		КонецЕсли;
		//КонецЕсли;
		
	КонецЦикла;
	Возврат Истина;	
КонецФункции

Процедура ДобавитьЗаписьВДокументКомпенсацияПеремещений(ДоК,СтруктураКомпенсации) Экспорт
	
	ТабДок = ДоК.БСО.Добавить();
	
	ТабДок.Подтверждено = Истина;
	ТабДок.ДатаПеремещения = СтруктураКомпенсации.ДатаПеремещения;
	ТабДок.Поставщик = СтруктураКомпенсации.Поставщик;
	ТабДок.ПоставщикКуда = СтруктураКомпенсации.ПоставщикКуда;
	ТабДок.ОрганизацияАгент = СтруктураКомпенсации.ОрганизацияАгент;
	ТабДок.ОрганизацияАгентКуда = СтруктураКомпенсации.ОрганизацияАгентКуда;
	ТабДок.СК = СтруктураКомпенсации.СК;
	ТабДок.ВидБСО = СтруктураКомпенсации.ВидБСО;
	ТабДок.НомерБСО = СтруктураКомпенсации.НомерБСО;
	ТабДок.Количество = СтруктураКомпенсации.Количество;
	ТабДок.СостояниеБСО = СтруктураКомпенсации.СостояниеБСО;
	ТабДок.Агент = СтруктураКомпенсации.Агент;
	ТабДок.АгентКуда = СтруктураКомпенсации.АгентКуда;
	ТабДок.ДопустимоТолькоРучноеИсправление = Ложь;
	
КонецПроцедуры

Функция ДобавитьКомпенсацию(Массив_СтруктураКомпенсации) Экспорт
	
	НачатьТранзакцию();
	ДоК = ПолучитьДокументДляАвтоматическойЗаписи(Массив_СтруктураКомпенсации[0].ДатаПеремещения,Документы.уб_КомпенсацияДвиженийБСО,"БСО",50);
	
	ЗаписыватьДокумент = Ложь;
	Для Каждого СтруктураКомпенсации из Массив_СтруктураКомпенсации Цикл
		Если ПроверкаУникальностиКомпенсации(СтруктураКомпенсации) Тогда
			ДобавитьЗаписьВДокументКомпенсацияПеремещений(ДоК,СтруктураКомпенсации);
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗаписыватьДокумент Тогда
		Сообщить("Отсутствуют компенсации прошедшие проверку.", СтатусСообщения.Информация);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ДоК.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		Сообщить("Ошибка! " + ДоК +  " - Не удалось провести компенсацию.", СтатусСообщения.ОченьВажное);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Фрм = ДоК.Ссылка.ПолучитьФорму();
	Если Фрм.Открыта() Тогда
		Фрм.ЭтотОбъект.Прочитать();
		Фрм.Обновить();
	КонецЕсли;
	
КонецФункции

/////////////////////////////////////////////////////////////

// неактуальна. Используется только в неактуальной процедуре НачалоВыбораАгента
Процедура НачалоВыбораПоразделения(
	ФормаВладелец, 
	Элемент, 
	Группа = Неопределено, 
	Фильтровать = Ложь,
	ЗаголовокФормы = Неопределено
	) Экспорт
	
	Справ =	Справочники.ПодразделенияОрганизаций;
	
	Форм = Справ.ПолучитьФормуВыбора("ФормаВыбораДляБСО",ФормаВладелец);
	
	Если ЗаголовокФормы <> Неопределено Тогда
		Форм.Заголовок = ЗаголовокФормы;
	КонецЕсли;
	
	эСС = Форм.ЭлементыФормы.СправочникСписок;
	
	Если Элемент.Значение <> Справ.ПустаяСсылка() И Элемент.Значение <> Неопределено Тогда
		Форм.НачальноеЗначениеВыбора = Элемент.Значение;
		Форм.ПараметрТекущаяСтрока = Элемент.Значение; 
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(эСС.ТекущаяСтрока) И НЕ ЗначениеНеЗаполнено(Группа) Тогда
		эСС.ТекущаяСтрока = Группа;
	КонецЕсли;
	
	Если Фильтровать Тогда
		эСС.НастройкаОтбора.Ссылка.Доступность = Истина;
		СОС = Форм.СправочникСписок.Отбор.Ссылка;
		СОС.Использование = Истина;
		СОС.ВидСравнения = ВидСравнения.ВИерархии;
		СОС.Значение = Группа;
		//эСС.РодительВерхнегоУровня = Группа;
	КонецЕсли;
	
	ТекСтрока = Форм.ОткрытьМодально();
	//После закрытия...
	Если ТекСтрока <> Неопределено Тогда
		Форм.ОповеститьОВыборе(ТекСтрока);
		Элемент.Значение = ТекСтрока.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// неактуальна
Процедура НачалоВыбораКонтрагента(
	ФормаВладелец, 
	Элемент, 
	Группа = Неопределено, 
	Фильтровать = Ложь,
	ЗаголовокФормы = Неопределено,
	ИерархическийПросмотр = Истина,
	ВыборГрупп = Ложь
	) Экспорт
	
	НачалоВыбораИзСправочника(
	ФормаВладелец, 
	Элемент, 
	Группа, 
	Фильтровать,
	ЗаголовокФормы,
	Справочники.Контрагенты,
	ИерархическийПросмотр,
	ВыборГрупп
	)
КонецПроцедуры

Процедура НачалоВыбораФизическогоЛица(
	ФормаВладелец, 
	Элемент, 
	Группа 					= Неопределено, 
	Фильтровать 			= Ложь,
	ЗаголовокФормы 			= Неопределено,
	ИерархическийПросмотр 	= Истина,
	ВыборГрупп 				= Ложь
	) Экспорт
	
	НачалоВыбораИзСправочника(
	ФормаВладелец, 
	Элемент, 
	Группа, 
	Фильтровать,
	ЗаголовокФормы,
	Справочники.ФизическиеЛица,
	ИерархическийПросмотр,
	ВыборГрупп
	)
КонецПроцедуры

/////////////////////////////  Выбор Курьера  //////////////////////////////////////

Процедура НачалоВыбораКурьера(ФормаВладелец, Элемент) Экспорт
	
	Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудниковКурьеров;
	НачалоВыбораФизическогоЛица(ФормаВладелец, Элемент, Группа, Ложь, "Выбор Курьера");
	
КонецПроцедуры

/////////////////////////////  Выбор Менеджера  //////////////////////////////////////

//Процедура НачалоВыбораМенеджера(ФормаВладелец, Элемент) Экспорт
//	Группа = Константы.уб_ГруппаСотрудников.Получить();
//	НачалоВыбораФизическогоЛица(ФормаВладелец, Элемент, Группа, Ложь, "Выбор Менеджера");
//КонецПроцедуры

/////////////////////////////  Выбор Поставщика  //////////////////////////////////////

Процедура НачалоВыбораПоставщика(ФормаВладелец, Элемент) Экспорт
	
	Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСК;
	НачалоВыбораКонтрагента(ФормаВладелец, Элемент, Группа, Ложь, "Выбор Поставщика");
	
КонецПроцедуры

/////////////////////////////  Выбор Агента  //////////////////////////////////////

Процедура НачалоВыбораАгентаФизЛица(ФормаВладелец, Элемент, ИерархическийПросмотр = Истина) Экспорт
	
	Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудников;
	НачалоВыбораФизическогоЛица(ФормаВладелец, Элемент, Группа, Ложь, "Выбор Агента - физического лица", ИерархическийПросмотр);
	
КонецПроцедуры

Процедура НачалоВыбораАгентаЮрЛица(ФормаВладелец, Элемент, ИерархическийПросмотр = Истина) Экспорт
	
	Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаАгентовЮрЛиц;
	НачалоВыбораКонтрагента(ФормаВладелец, Элемент, Группа, Ложь, "Выбор Агента - юридического лица", ИерархическийПросмотр);
	
КонецПроцедуры

//Процедура НачалоВыбораАгентаПодразделения(ФормаВладелец, Элемент) Экспорт
//	
//	Группа = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
//	НачалоВыбораПоразделения(ФормаВладелец, Элемент, Группа, Истина, "Выбор Подразделения (в качестве Агента)");
//	
//КонецПроцедуры

Процедура НачалоВыбораИзСправочника(
	ФормаВладелец, 
	Элемент, 
	Группа = Неопределено, 
	Фильтровать = Ложь,
	ЗаголовокФормы = Неопределено,
	Справ,
	ИерархическийПросмотр = Истина,
	ВыборГрупп = Ложь
	) Экспорт
	
	Форм = Справ.ПолучитьФормуВыбора(,ФормаВладелец);
	//в форме выбора физлиц есть оповещение о выборе, однако в коде уб_СС оно тоже есть. Во избежание повторных вызовов
	//в реквизит формы выборы нужен параметр НеОповещатьОВыборе = Истина
	//однако реквизит не помогает - в любом случае форма выбора отправляет событие обработка выбора
	//1) автоматически стандартной обработкой СправочникВыбор
	//2) в этой процедуре
	//оставляем только 1ый вариант
	ОповещатьОВыборе = Истина;
	Если Справ = Справочники.ФизическиеЛица Тогда
		ОповещатьОВыборе = Ложь;
	КонецЕсли;
	Если ЗаголовокФормы <> Неопределено Тогда
		Форм.Заголовок = ЗаголовокФормы;
	КонецЕсли;
	Если Элемент.Значение <> Справ.ПустаяСсылка() И Элемент.Значение <> Неопределено Тогда
		Форм.НачальноеЗначениеВыбора = Элемент.Значение;
	КонецЕсли;
	эСД = Форм.ЭлементыФормы.СправочникДерево;
	эСС = Форм.ЭлементыФормы.СправочникСписок;
	эСС.ИерархическийПросмотр = ИерархическийПросмотр;
	//Если Не ЗначениеЗаполнено(эСД.ТекущаяСтрока) И ЗначениеЗаполнено(Группа) Тогда
	//	эСД.ТекущаяСтрока = Группа;
	//КонецЕсли;	
	Если Фильтровать Тогда
		эСД.НастройкаОтбора.Ссылка.Доступность = Истина;
		СОС = Форм.СправочникДерево.Отбор.Ссылка;
		СОС.Использование = Истина;
		СОС.ВидСравнения = ВидСравнения.Равно;
		СОС.Значение = Группа;
		эСС.РодительВерхнегоУровня = Группа;
	КонецЕсли;
	
	ЭлементРодителяВерхнегоУровня = Форм.ЭлементыФормы.Найти("РодительВерхнегоУровня");
	Если ЭлементРодителяВерхнегоУровня <> Неопределено Тогда
		ЭлементРодителяВерхнегоУровня.Значение = Группа;
	КонецЕсли;
	
	Если Не Форм.Открыта() Тогда
		Попытка
			ТекСтрока = Неопределено;
			ТекСтрока = Форм.ОткрытьМодально();
			//Форм.Открыть();
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.НачалоВыбораИзСправочника(): ошибка ТекСтрока = Форм.ОткрытьМодально(). ТипЗнч(Форма) = " + ТипЗнч(Форм) + ", Справочник: " + Справ + "Описание ошибки: " + ОписаниеОшибки(), "НеСообщать", Истина);
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка открытия формы справочника " + Справ);
		КонецПопытки;
		//После закрытия...
		Если ТекСтрока <> Неопределено И (ВыборГрупп = Истина Или (ВыборГрупп = Ложь И Не ТекСтрока.ЭтоГруппа)) Тогда
			Если ОповещатьОВыборе Тогда
				Форм.ОповеститьОВыборе(ТекСтрока)
			КонецЕсли;
			Элемент.Значение = ТекСтрока.Ссылка;
		КонецЕсли;
	Иначе
		//TODO непонятно, какого типа форма открыта - модальная или нет, и с какими данными и каким владельцем. Нужно отладить
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Форма выбора уже открыта! Закройте текущую форму");
		Форм.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураОтображенияВыбораИзСпискаНачалоВыбораПоУмолчанию()

	Структура = Новый Структура;
	Структура.Вставить("МОЛпоБСО", 						Ложь);
	Структура.Вставить("Подразделения", 				Истина);
	Структура.Вставить("ОсновноеПодразделениеУчетаБСО", Ложь);
	Структура.Вставить("СотрудникиБСО", 				Ложь);
	Структура.Вставить("Менеджеры", 					Ложь);
	Структура.Вставить("Курьеры", 						Ложь);
	Структура.Вставить("Контрагенты",					Ложь);
	Возврат Структура;

КонецФункции // СтруктураОтображенияВыбораИзСпискаНачалоВыбора()

//Структура - структура настроек для различных форм выбора
#Если Клиент Тогда
Процедура НачалоВыбораАгента(
	ФормаВладелец, 
	Элемент, 
	ОтоброжатьМОЛпоБСО 						= Ложь, 
	ОтображатьПодразделения 				= Истина, 
	ОтображатьОсновноеПодразделениеУчетаБСО = Ложь, 
	Структура 								= Неопределено,
	ОтображатьСотрудниковБСО 				= Ложь,
	ОтображатьМенеджеров 					= Ложь,
	ОтображатьКурьеров 						= Ложь
	) Экспорт
		
	ОтображатьКонтрагентов = Истина;
	//обрабатываем настройки открытия различных форм выбора из структуры
	Если Структура <> Неопределено Тогда
		ИерархическийПросмотрФизЛиц = ?(Структура.Свойство("ФизЛицо"), 	Структура.ФизЛицо.ИерархическийПросмотр, Истина);
		ИерархическийПросмотрЮрЛиц	= ?(Структура.Свойство("ЮрЛицо"),	Структура.ЮрЛицо.ИерархическийПросмотр, Истина);
	Иначе
		ИерархическийПросмотрФизЛиц = Истина;
		ИерархическийПросмотрЮрЛиц	= Истина;
	КонецЕсли;
	Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда		
		Если ОтоброжатьМОЛпоБСО И Элемент.Значение = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			ОтображатьКонтрагентов = Ложь;	
			ОтображатьПодразделения = Ложь;	
		Иначе	
			НачалоВыбораАгентаФизЛица(ФормаВладелец, Элемент, ИерархическийПросмотрФизЛиц);
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда 		
		НачалоВыбораАгентаЮрЛица(ФормаВладелец, Элемент, ИерархическийПросмотрЮрЛиц);
		Возврат;
	ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 		
		//НачалоВыбораАгентаПодразделения(ФормаВладелец, Элемент);
		Группа = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
		НачалоВыбораПоразделения(ФормаВладелец, Элемент, Группа, Истина, "Выбор Подразделения (в качестве Агента)");
		Возврат;
	КонецЕсли;		
	СписокСправочников = Новый СписокЗначений;
	ЭлементПоУмолчанию = СписокСправочников.Добавить(Справочники.ФизическиеЛица,"Физическое Лицо",,БиблиотекаКартинок.ЗначокФизическоеЛицо16);
	Если ОтоброжатьМОЛпоБСО Тогда
		СписокСправочников.Добавить("МОЛпоБСО","Ответственный ОУ БСО",,БиблиотекаКартинок.уб_ОтветственныйБСО);
	КонецЕсли;
	Если ОтображатьОсновноеПодразделениеУчетаБСО Тогда
		СписокСправочников.Добавить("ОУБСО","ОУ БСО",,БиблиотекаКартинок.уб_Подразделения);
	КонецЕсли;
	Если ОтображатьКонтрагентов Тогда
		СписокСправочников.Добавить(Справочники.Контрагенты,"Юридическое Лицо",,БиблиотекаКартинок.ЗначокКонтрагент16);
	КонецЕсли;
	Если ОтображатьПодразделения Тогда
		СписокСправочников.Добавить(Справочники.ПодразделенияОрганизаций,"Подразделение",,БиблиотекаКартинок.уб_Подразделения);
	КонецЕсли;
	Если ОтображатьСотрудниковБСО Тогда
		СписокСправочников.Добавить("СотрудникиБСО", "Сотрудники отдела БСО");
	КонецЕсли;
	Если ОтображатьМенеджеров Тогда
		СписокСправочников.Добавить("Менеджеры", "Менеджеры");
	КонецЕсли;
	Если ОтображатьКурьеров Тогда
		СписокСправочников.Добавить("Курьеры", 	 "Выездные специалисты");
	КонецЕсли;
	ВыбранныйЭлемент = СписокСправочников.ВыбратьЭлемент("Выберите тип Агента",ЭлементПоУмолчанию);
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ВыбранныйЭлемент.Значение = Справочники.ФизическиеЛица Тогда		
		НачалоВыбораАгентаФизЛица(ФормаВладелец, Элемент, ИерархическийПросмотрФизЛиц);		
	ИначеЕсли ВыбранныйЭлемент.Значение = Справочники.Контрагенты Тогда 		
		НачалоВыбораАгентаЮрЛица(ФормаВладелец, Элемент, ИерархическийПросмотрЮрЛиц);		
	ИначеЕсли ВыбранныйЭлемент.Значение = Справочники.ПодразделенияОрганизаций Тогда 		
		//НачалоВыбораАгентаПодразделения(ФормаВладелец, Элемент);
		Группа = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
		НачалоВыбораПоразделения(ФормаВладелец, Элемент, Группа, Истина, "Выбор Подразделения (в качестве Агента)");
	ИначеЕсли ВыбранныйЭлемент.Значение = "МОЛпоБСО" Тогда 
		МОЛпоБСО = уб_КЭШируемые.ПолучитьМОЛпоБСО(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
		Элемент.Значение = МОЛпоБСО;		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОУБСО" Тогда 
		Элемент.Значение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;		
	ИначеЕсли ВыбранныйЭлемент.Значение = "СотрудникиБСО" Тогда
		//РодительВерхнегоУровня = Справочники.ФизическиеЛица.НайтиПоНаименованию("ОУ БСО");
		РодительВерхнегоУровня = Справочники.ФизическиеЛица.ОУБСО;
	ИначеЕсли ВыбранныйЭлемент.Значение = "Курьеры" Тогда
		РодительВерхнегоУровня = Справочники.ФизическиеЛица.Курьеры
	ИначеЕсли ВыбранныйЭлемент.Значение = "Менеджеры" Тогда
		РодительВерхнегоУровня = Справочники.ФизическиеЛица.Агенты
	КонецЕсли;
	Если РодительВерхнегоУровня <> Неопределено Тогда
		Форма = Справочники.ФизическиеЛица.ПолучитьФормуВыбора(,Элемент);
		Форма.ЭлементыФормы.СправочникСписок.РодительВерхнегоУровня = РодительВерхнегоУровня;
		ЭлементРодительВерхнегоУровня = Форма.ЭлементыФормы.Найти("РодительВерхнегоУровня");
		Если ЭлементРодительВерхнегоУровня <> Неопределено Тогда
			ЭлементРодительВерхнегоУровня.Значение = РодительВерхнегоУровня;
		КонецЕсли;
		Форма.Открыть();
	КонецЕсли;		
	
КонецПроцедуры
#КонецЕсли	

////////////////////////////  Выбор Страхователя  //////////////////////////////////////

Процедура НачалоВыбораСтрахователяФизЛица(ФормаВладелец, Элемент) Экспорт
	
	Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейФизЛиц;
	//Группа = Константы.уб_ГруппаСтрахователейФизЛиц.Получить();
	НачалоВыбораФизическогоЛица(ФормаВладелец, Элемент, Группа, Истина, "Выбор Страхователя - физического лица");
	
КонецПроцедуры

Процедура НачалоВыбораСтрахователяЮрЛица(ФормаВладелец, Элемент) Экспорт
	Группа = Справочники.Контрагенты.ПустаяСсылка();//ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейЮрЛиц;
	//Группа = Константы.уб_ГруппаСтрахователейЮрЛиц.Получить();
	НачалоВыбораКонтрагента(ФормаВладелец, Элемент, Группа, Истина, "Выбор Страхователя - юридического лица");
КонецПроцедуры

Процедура НачалоВыбораСтрахователя(ФормаВладелец, Элемент,ВыборТипаЭлемента = Ложь) Экспорт
	
	#Если Клиент Тогда	
		Если ВыборТипаЭлемента = Ложь И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НачалоВыбораСтрахователяФизЛица(ФормаВладелец, Элемент);
		ИначеЕсли ВыборТипаЭлемента = Ложь И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			НачалоВыбораСтрахователяЮрЛица(ФормаВладелец, Элемент);
		Иначе
			СписокСправочников = Новый СписокЗначений;
			ЭлементПоУмолчанию = СписокСправочников.Добавить(Справочники.ФизическиеЛица,"Физическое Лицо",,БиблиотекаКартинок.ЗначокФизическоеЛицо16);
			СписокСправочников.Добавить(Справочники.Контрагенты,"Юридическое Лицо",,БиблиотекаКартинок.ЗначокКонтрагент16);
			//ВыбранныйЭлемент = СписокСправочников.ВыбратьЭлемент("Выберите тип страхователя",ЭлементПоУмолчанию);
			//ВыбранныйЭлемент = ФормаВладелец.ВыбратьИзМеню(СписокСправочников,Элемент);
			ВыбранныйЭлемент = ФормаВладелец.ВыбратьИзСписка(СписокСправочников,Элемент);
			Если ВыбранныйЭлемент = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Если ВыбранныйЭлемент.Значение = Справочники.ФизическиеЛица Тогда
				НачалоВыбораСтрахователяФизЛица(ФормаВладелец, Элемент);
			ИначеЕсли ВыбранныйЭлемент.Значение = Справочники.Контрагенты Тогда
				НачалоВыбораСтрахователяЮрЛица(ФормаВладелец, Элемент);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////////////


Процедура НачалоВыбораНомераЗаявки(Форма, Элемент, СтандартнаяОбработка,Изменилось = ЛОЖЬ) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		СтароеЗначение = Элемент.Значение;
		Ссылка = Форма.Ссылка;
		УправляемаяФорма = ЛОЖЬ;
	Исключение
		УправляемаяФорма = Истина;
		СтароеЗначение = Форма.Объект.НомерЗаявки;
		Ссылка         = Форма.Объект.Ссылка;
	КонецПопытки;	
	ТипСтЗн = ТипЗнч(СтароеЗначение);
	Если ТипСтЗн = Тип("Число") Тогда
		НомерЗаявки = СтароеЗначение;
	Иначе
		НомерЗаявки = 0;
	КонецЕсли;
	Список = Новый СписокЗначений;
	ЭлНом = Список.Добавить(НомерЗаявки,							"Номер заявки в БАЗЕ");
	ЭлЛич = Список.Добавить(Перечисления.уб_ВидыЗаявок.Личная,		"Личная страховка");
	ЭлЛич = Список.Добавить(Перечисления.уб_ВидыЗаявок.Агентская,	"Внешний агент");
	//Список.Добавить(Перечисления.уб_ВидыЗаявок.КоробочнаяПродажа,	"Кросс-продажа коробочного продукта");
	ЭлементПоУмолчанию = ?(ТипСтЗн = Тип("ПеречислениеСсылка.уб_ВидыЗаявок"), ЭлЛич, ЭлНом);
	ВыбранныйЭлемент = Форма.ВыбратьИзменю(Список,Элемент);
	ВыбранноеЗначение = ?(ВыбранныйЭлемент = Неопределено, СтароеЗначение, ВыбранныйЭлемент.Значение);
	Если УправляемаяФорма = ЛОЖЬ Тогда
		Элемент.Значение = ВыбранноеЗначение;
	Иначе
		Форма.Объект.НомерЗаявки = ВыбранноеЗначение;
	КонецЕсли;	
	Элемент.РедактированиеТекста = ТипЗнч(ВыбранноеЗначение) = Тип("Число");
	Изменилось = НЕ ВыбранноеЗначение = СтароеЗначение;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда
		Форма.УстСостоянияПолейПриИзменении();
	//ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.") Тогда
	
	КонецЕсли;
	
КонецПроцедуры

Процедура НачалоВыбораСхемыРасчета(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уб_РасчетЗарплатыМенеджерамОП.Ссылка
	|ИЗ
	|	ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП КАК уб_РасчетЗарплатыМенеджерамОП
	|ГДЕ
	|	уб_РасчетЗарплатыМенеджерамОП.Используется
	|
	|УПОРЯДОЧИТЬ ПО
	|	уб_РасчетЗарплатыМенеджерамОП.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();					  
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;	
	ВыбЭлемент = Форма.ВыбратьИзМеню(ДанныеВыбора, Элемент);
	Если ВыбЭлемент = Неопределено  Тогда
		Элемент.Значение = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета;
	Иначе
		Элемент.Значение = ВыбЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьДвиженияБСО(СК, ВидБСО, НомерБСО, ФормаВладелец) Экспорт
	//Если НЕ уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСО) Тогда
	//	Предупреждение("Это БСО - не с номерным видом учета",5,"Поиск движений БСО отменен");
	//	Возврат;
	//КонецЕсли;
	Если СокрЛП(НомерБСО) = "" Тогда
		#Если Клиент Тогда
			Предупреждение("Не указан номер БСО",5,"Поиск движений БСО отменен");
		#Иначе
			Сообщить("Не указан номер БСО Поиск движений БСО отменен");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьОбщуюФорму("уб_ДвиженияНомераБСО", ФормаВладелец);
	Параметры = Новый Структура("СК, ВидБСО, НомерБСО", СК, ВидБСО, НомерБСО);
	//ФормаВыбора.РежимВыделения = РежимВыделенияТабличногоПоля.Одиночный;
	ФормаВыбора.Параметры = Параметры;
	ФормаВыбора.Открыть();
КонецПроцедуры

Процедура ОсуществитьПоискБСО(СК, ВидБСО, НомерБСО, ИскатьВДокументах = Истина, ИскатьВОплатах = Истина, ФормаВладелец) Экспорт 
	ФормаПоиска = ПолучитьОбщуюФорму("уб_ПоискНомераБСО", ФормаВладелец);
	Параметры = Новый Структура("СК, ВидБСО, НомерБСО, ИскатьВДокументах, ИскатьВОплатах"
	, СК
	, ВидБСО
	, НомерБСО
	, ИскатьВДокументах
	, ИскатьВОплатах);
	ФормаПоиска.Параметры = Параметры;
	//Передаем ссылку на документ для позиционирования на соответствующей строке
	ФормаПоиска.СтруктураИскомойСтроки = Новый Структура("ДокументС, НомерБСО", ФормаВладелец.Ссылка, НомерБСО); 
	ФормаПоиска.Открыть();
КонецПроцедуры

Функция ПредупредитьОПоставщикеЕслиСКбезДоговора_Общая(СК,ДатаДок, Предупреждать = Истина) Экспорт 
	Если ЗначениеНеЗаполнено(СК) Тогда
		Возврат СК;	
	КонецЕсли;
	Если СК.Родитель <> ПараметрыСеанса.уб_Константы.уб_ГруппаСК Тогда
		Возврат СК;	
	КонецЕсли;
	ДатаПроверки = ?(ЗначениеНеЗаполнено(ДатаДок),ТекущаяДата(),ДатаДок);
	
	Дог = СК.ОсновнойДоговорКонтрагента;
	Если НЕ ЗначениеНеЗаполнено(Дог) Тогда
		Если (ЗначениеНеЗаполнено(Дог.ДатаОкончанияДействияДоговора)
			ИЛИ ДатаПроверки < Дог.ДатаОкончанияДействияДоговора)
			И Дог.ДатаЗаключенияДоговора < ДатаПроверки
			Тогда
			Возврат СК;	
		КонецЕсли;
	КонецЕсли;
	Если Предупреждать Тогда
		#Если Клиент Тогда
			Предупреждение("В выбранной страховой компанией нет
			|дейстующего договора на дату документа
			|
			|Укажите поставщика!",15,"Необходимо выбрать поставщика!");		
		#Иначе
			Сообщить("В выбранной страховой компанией нет
			|дейстующего договора на дату документа
			|
			|Укажите поставщика! Необходимо выбрать поставщика!");
		#КонецЕсли
		
		
	КонецЕсли;
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции

Процедура ПредупредитьОПоставщикеЕслиСКбезДоговора(ФормаДокумента) Экспорт 
	ФормаДокумента.Поставщик = Справочники.Контрагенты.ПустаяСсылка();
	ФормаДокумента.Поставщик = ПредупредитьОПоставщикеЕслиСКбезДоговора_Общая(ФормаДокумента.СК, ФормаДокумента.Дата);
	Если ФормаДокумента.СК <> ФормаДокумента.Поставщик 
		И НЕ ФормаДокумента.ЭлементыФормы.Поставщик.АвтовыборНезаполненного Тогда
		ФормаДокумента.ТекущийЭлемент = ФормаДокумента.ЭлементыФормы.Поставщик;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСписокСКсоСвободнымиНомерамиПолисов() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВН.Владелец.Ссылка КАК СсылкаСК,
	|	ВН.Владелец.Наименование КАК НаименованиеСК
	|ИЗ
	|	Справочник.уб_ВидыНумерации КАК ВН
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеСК";
	СписокСК = Новый СписокЗначений;
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСК.Добавить(Выборка.СсылкаСК,Выборка.НаименованиеСК);
	КонецЦикла;
	Возврат СписокСК;
КонецФункции

Функция ПолучитьСписокПоставщиковДляКоличественногоБСО(ВидБСО, НаДату = Неопределено) Экспорт 
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	О.Поставщик КАК Поставщик,
	|	О.Поставщик.Наименование КАК НаименованиеПоставщика
	|ИЗ
	|	РегистрНакопления.уб_ОстаткиБСО.Остатки(&Период, ВидБСО = &ВидБСО) КАК О
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеПоставщика";
	Запрос.УстановитьПараметр("ВидБСО",ВидБСО);	
	Запрос.УстановитьПараметр("Период",НаДату);
	СписокПост = Новый СписокЗначений;
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПост.Добавить(Выборка.Поставщик,Выборка.НаименованиеПоставщика);
	КонецЦикла;
	Возврат СписокПост;
	
КонецФункции

//TODO вынести в кэшируемый или в поолучение структуры по БСО?
Функция ПолучитьСписокОргАгнтовДляКоличественногоБСО(ВидБСО, НаДату = Неопределено) Экспорт 
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	О.ОрганизацияАгент КАК ОрганизацияАгент,
	|	О.ОрганизацияАгент.Наименование КАК НаименованиеОрганизацияАгент
	|ИЗ
	|	РегистрНакопления.уб_ОстаткиБСО.Остатки(&Период, ВидБСО = &ВидБСО) КАК О
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеОрганизацияАгент";
	Запрос.УстановитьПараметр("ВидБСО",ВидБСО);	
	Запрос.УстановитьПараметр("Период",НаДату);
	СписокОргАгнтов = Новый СписокЗначений;
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОргАгнтов.Добавить(Выборка.ОрганизацияАгент,Выборка.НаименованиеОрганизацияАгент);
	КонецЦикла;
	Возврат СписокОргАгнтов;
КонецФункции

// Получает значение параметра по названию на дату из регистра уб_ПараметрыДоговоровИОтчетов
//
// Параметры
//  Дата - тип: дата - Дата на которую надо найти значение параметра
//  Наименование  - тип: строка - наименование параметра из отчета
//                 
// Возвращаемое значение:
//   Строка - Значение параметра на дату
//
Функция ПолучитьЗначениеПараметра(ДатаПараметра, Параметр) Экспорт 
	
	Отбор = Новый Структура("Наименование", Параметр);
	ВыборкаПараметра = РегистрыСведений.уб_ПараметрыДоговоровИОтчетов.СрезПоследних(ДатаПараметра, Отбор);
	Если ВыборкаПараметра.Количество()>0 Тогда
		ЗначениеПараметра = ВыборкаПараметра[0].Значение;
	Иначе	
		ЗначениеПараметра = "";
	КонецЕсли; 
	
	Возврат ЗначениеПараметра;
КонецФункции // ПолучитьЗначениеПараметра()

//получает состояние БСО на определенную дату
//ТипУчетаБСО - Неопределено: ищет по всем, "кол" - только по количественным
Функция ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ(СтруктураПараметров) Экспорт
	
	ПериодПовторнойПроверкиСостоянияБСО = ПараметрыСеанса.уб_Константы.ПериодПовторнойПроверкиСостоянияБСО;
	Если ТипЗнч(ПериодПовторнойПроверкиСостоянияБСО) <> Тип("Число") Тогда
		ПериодПовторнойПроверкиСостоянияБСО = 60;//Время устаревания данных (секунд)
	КонецЕсли;
	ЗначениеПараметра 	= Неопределено;	
	ТекСтрока 			= СтруктураПараметров.ТекСтрока;
	НаДату				= СтруктураПараметров.НаДату;
	ТекСостояниеБСО 	= ?(СтруктураПараметров.Свойство("ТекСостояниеБСО", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	тсАгент 			= ?(СтруктураПараметров.Свойство("тсАгент", 			ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	тсПоставщик 		= ?(СтруктураПараметров.Свойство("тсПоставщик", 		ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	тсОрганизацияАгент 	= ?(СтруктураПараметров.Свойство("тсОрганизацияАгент", 	ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	хВидГраницы 		= ?(СтруктураПараметров.Свойство("хВидГраницы", 		ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ТипУчетаБСО 		= ?(СтруктураПараметров.Свойство("ТипУчетаБСО", 		ЗначениеПараметра), ЗначениеПараметра, Неопределено);
	ИсключитьОформленные = ?(СтруктураПараметров.Свойство("ИсключитьОформленные", ЗначениеПараметра), ЗначениеПараметра, Ложь);
	ДанныеПолиса		= ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(СтруктураПараметров, "ДанныеПолиса", Истина);
	ДанныеЗаявки		= ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(СтруктураПараметров, "ДанныеЗаявки", Истина);
	ПолучатьПодразделениеОтправителя = ?(СтруктураПараметров.Свойство("ПолучатьПодразделениеОтправителя", ЗначениеПараметра),ЗначениеПараметра,Ложь);
	//для номерного и количественного учета
	тсСК = ТекСтрока.СК;
	тсВидБСО = ТекСтрока.ВидБСО;
	Если хВидГраницы = Неопределено Тогда
		хВидГраницы = ВидГраницы.Исключая;
	КонецЕсли;
	НаМомент = Новый Граница(НаДату,хВидГраницы);
	СтруктураБСО = Новый Структура("Существует, НомернойУчет, КоличественныйУчет, Количество, Поставщик, ОрганизацияАгент, СостояниеБСО, ПоложениеБСО, АгентОтправитель, Владелец, ДатаВозврата, НомерПолиса, сСостояниеБСО, сПоложениеБСО, сВладелец, сДатаВозврата, сОрганизацияАгент, сПоставщик, СК, ВидБСО, НомерБСО, Регистратор, НаМомент, СтраховойПолис,Заявка, Блокировка, ВремяЗапроса"
	, Ложь,        Ложь,              Ложь,          0);
	СтруктураБСО.Вставить("НомерЗаявки");
	СтруктураБСО.Вставить("ДатаОформленияПолиса");
	СтруктураБСО.Вставить("Страхователь");
	СтруктураБСО.Вставить("СтраховойПродукт");
	СтруктураБСО.Вставить("ДатаНачалаДействияПолиса");
	СтруктураБСО.Вставить("ДатаОкончанияДействияПолиса");
	СтруктураБСО.Вставить("Менеджер");
	СтруктураБСО.Вставить("Курьер");
	СтруктураБСО.Вставить("ПодразделениеОтправитель");
	тсТипУчетаБСО = Неопределено;
	Если ТипУчетаБСО <> "кол" Тогда
		sНеНайден = "<не найден>";
		тсНомБСО = СокрЛП(ТекСтрока.НомерБСО);
		Если тсНомБСО = СокрЛП(уб_СЛ.ДайНомерБСОДляКоличУчета("")) Тогда
			тсНомБСО = "";
		КонецЕсли;
		УказанНомерБСО = тсНомБСО <> "";
		Если ТекСостояниеБСО <> Неопределено Тогда
			мСостояниеБСО = Неопределено;
			Ключ = уб_temp.УбратьНедопустимыеСимволыДляСтрок("k" + тсНомБСО 
			//+ ?(ЗначениеЗаполнено(тсВидБСО) и ТипЗнч(тсВидБСО) = Тип(""),тсВидБСО.УникальныйИдентификатор(),"")
			+ ?(ЗначениеЗаполнено(тсСК),тсСК.УникальныйИдентификатор(),"")
			+ ?(ЗначениеЗаполнено(тсПоставщик),тсПоставщик.УникальныйИдентификатор(),"")
			+ ?(ЗначениеЗаполнено(тсОрганизацияАгент),тсОрганизацияАгент.УникальныйИдентификатор(),""));
			Если ТекСостояниеБСО.Свойство(Ключ, мСостояниеБСО) 
				И ТипЗнч(мСостояниеБСО) = Тип("Структура") 
				И мСостояниеБСО.Свойство("ВремяЗапроса")
				И ТипЗнч(мСостояниеБСО.ВремяЗапроса) = Тип("Дата")
				И (ТекущаяДата() - мСостояниеБСО.ВремяЗапроса < ПериодПовторнойПроверкиСостоянияБСО) Тогда
				Возврат мСостояниеБСО;
			КонецЕсли;
		КонецЕсли;
		//Если указан непустой номер БСО, то пробуем найти БСО в регистре Движений БСО
		Если УказанНомерБСО Тогда					
			ЗапросСостояниеБСО = Новый Запрос;
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	уб_ДвиженияБСОСрезПоследних.Период,
			|	уб_ДвиженияБСОСрезПоследних.Регистратор,
			|	уб_ДвиженияБСОСрезПоследних.НомерСтроки,
			|	уб_ДвиженияБСОСрезПоследних.Активность,
			|	уб_ДвиженияБСОСрезПоследних.СК,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО,
			|	уб_ДвиженияБСОСрезПоследних.НомерБСО,
			|	уб_ДвиженияБСОСрезПоследних.Поставщик,
			|	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент,
			|	уб_ДвиженияБСОСрезПоследних.Подтверждено,
			//|	уб_ДвиженияБСОСрезПоследних.ДокПроведен,
			//|	уб_ДвиженияБСОСрезПоследних.Активность Как ДокПроведен,
			|	уб_ДвиженияБСОСрезПоследних.АгентОтправитель,
			|	уб_ДвиженияБСОСрезПоследних.Агент,
			|	уб_ДвиженияБСОСрезПоследних.ПоложениеБСО,
			|	уб_ДвиженияБСОСрезПоследних.СостояниеБСО,
			|	уб_ДвиженияБСОСрезПоследних.НомерПолиса,
			|	уб_ДвиженияБСОСрезПоследних.ГодПолиса,
			|	уб_ДвиженияБСОСрезПоследних.СтраховойПолис,
			|	уб_ДвиженияБСОСрезПоследних.НаОснованииБумажногоДокумента,
			|	уб_ДвиженияБСОСрезПоследних.ДатаВозврата,
			|	уб_ДвиженияБСОСрезПоследних.Заявка,
			|	уб_ДвиженияБСОСрезПоследних.КодОперации,
			|	уб_ДвиженияБСОСрезПоследних.Комментарий,
			|	ПРЕДСТАВЛЕНИЕ(уб_ДвиженияБСОСрезПоследних.СостояниеБСО) КАК СостояниеБСОПредставление,
			|	ПРЕДСТАВЛЕНИЕ(уб_ДвиженияБСОСрезПоследних.ПоложениеБСО) КАК ПоложениеБСОПредставление,
			|	уб_ДвиженияБСОСрезПоследних.Поставщик.Представление,
			|	уб_ДвиженияБСОСрезПоследних.Агент.Представление,
			|	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент.Представление,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип КАК Тип,
			|	987 КАК ДопПоля,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО.ТипУчетаБСО КАК ТипУчетаБСО
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
			|			&НаМомент,
			|			ВидБСО = &ВидБСО
			|				И НомерБСО = &НомерБСО
			|				И Подтверждено = &Подтверждено
			|               И 1 = 1) КАК уб_ДвиженияБСОСрезПоследних";			
			ДопПоля = "";
			ДопСоединения = "";
			Если ПолучатьПодразделениеОтправителя = Истина Тогда
				ДопПоля = ДопПоля + "ПодразделениеСрез.Подразделение КАК ПодразделениеОтправитель, ";
				ДопСоединения = ДопСоединения+" 
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&НаМомент) КАК ПодразделениеСрез 
				|   ПО ПодразделениеСрез.Агент = уб_ДвиженияБСОСрезПоследних.Агент "
			КонецЕсли;
			Если ДанныеЗаявки Тогда
				ДопПоля = ДопПоля + "
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.Заявка.НомерЗаявки, НЕОПРЕДЕЛЕНО) КАК НомерЗаявки,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.Заявка.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.Заявка.Курьер, НЕОПРЕДЕЛЕНО) КАК Курьер,"
			КонецЕсли;
			Если ДанныеПолиса Тогда
				ДопПоля = ДопПоля + "
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.СтраховойПолис.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОформленияПолиса,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.СтраховойПолис.Страхователь, НЕОПРЕДЕЛЕНО) КАК Страхователь,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.СтраховойПолис.СтраховойПродукт, НЕОПРЕДЕЛЕНО) КАК СтраховойПродукт,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.СтраховойПолис.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачалаДействияПолиса,
				|	ЕСТЬNULL(уб_ДвиженияБСОСрезПоследних.СтраховойПолис.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОкончанияДействияПолиса,"
			КонецЕсли;
			ЕстьБлокировка = НЕ ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина;
			Если ЕстьБлокировка Тогда
				ДопПоля = ДопПоля + "
				|   ВЫБОР
				|		КОГДА &НеИспользоватьБлокировкиБСО = ИСТИНА
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ)
				|	КОНЕЦ КАК Блокировка, ";
				ДопСоединения = ДопСоединения + " 
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
				|				&НаМомент,
				|				ВидБСО = &ВидБСО
				|					И НомерБСО = &НомерБСО) КАК уб_БлокировкаБСОСрезПоследних
				|		ПО уб_ДвиженияБСОСрезПоследних.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
				|			И уб_ДвиженияБСОСрезПоследних.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО ";
			КонецЕсли;		
			Если ДопПоля <> "" Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "987 КАК ДопПоля,", ДопПоля);
			КонецЕсли;
			Если ДопСоединения <> "" Тогда
				ТекстЗапроса = ТекстЗапроса+ДопСоединения;
			КонецЕсли;	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И 1 = 1", ?(ИсключитьОформленные=Истина,"И НЕ СостояниеБСО = Значение(Перечисление.уб_СостоянияБСО.Оформлен)",""));
			ЗапросСостояниеБСО.Текст = ТекстЗапроса+ "
			|Упорядочить ПО уб_ДвиженияБСОСрезПоследних.Период УБЫВ";
			ЗапросСостояниеБСО.УстановитьПараметр("СК",							тсСК);
			ЗапросСостояниеБСО.УстановитьПараметр("ВидБСО",						тсВидБСО);
			ЗапросСостояниеБСО.УстановитьПараметр("НомерБСО",					тсНомБСО);
			ЗапросСостояниеБСО.УстановитьПараметр("Подтверждено",				Истина);
			//Запрос.УстановитьПараметр("ДокПроведен",				Истина);
			ЗапросСостояниеБСО.УстановитьПараметр("НаМомент",					НаМомент);
			ЗапросСостояниеБСО.УстановитьПараметр("НеИспользоватьБлокировкиБСО",НЕ ЕстьБлокировка);
			Выборка = ЗапросСостояниеБСО.Выполнить().Выбрать();            
			//ВсегоЗаписей = Выборка.Количество();
			Если Выборка.Следующий() Тогда
				тсТипУчетаБСО = Выборка.ТипУчетаБСО;
				СтруктураБСО.ВремяЗапроса 				= ТекущаяДата();
				СтруктураБСО.НаМомент 					= НаМомент;
				СтруктураБСО.Существует 				= Истина;
				СтруктураБСО.СК 						= Выборка.СК;
				СтруктураБСО.ВидБСО 					= тсВидБСО;
				СтруктураБСО.НомерБСО 					= тсНомБСО;
				СтруктураБСО.Поставщик 	   				= Выборка.Поставщик;
				СтруктураБСО.ОрганизацияАгент 			= Выборка.ОрганизацияАгент;
				СтруктураБСО.СостояниеБСО 	   			= Выборка.СостояниеБСО;
				СтруктураБСО.ПоложениеБСО 	   			= Выборка.ПоложениеБСО;
				СтруктураБСО.АгентОтправитель 			= Выборка.АгентОтправитель;
				СтруктураБСО.Владелец 		   			= Выборка.Агент;
				СтруктураБСО.НомернойУчет 	    		= уб_СЛ.ОпределитьВедетсяНомернойУчет(тсВидБСО,	тсТипУчетаБСО);
				СтруктураБСО.КоличественныйУчет 		= уб_СЛ.ОпределитьВедетсяКоличественныйУчет(тсВидБСО, тсТипУчетаБСО);
				СтруктураБСО.Количество		    		= 1;
				СтруктураБСО.ДатаВозврата 				= Выборка.ДатаВозврата;
				СтруктураБСО.НомерПолиса 				= Выборка.НомерПолиса;
				СтруктураБСО.Регистратор 				= Выборка.Регистратор;
				СтруктураБСО.СтраховойПолис 			= Выборка.СтраховойПолис;
				СтруктураБСО.Заявка 					= Выборка.Заявка;
				СтруктураБСО.сСостояниеБСО 				= ?(СтруктураБСО.СостояниеБСО 		= Неопределено, ?(СтруктураБСО.Существует,"???",sНеНайден), Выборка.СостояниеБСОПредставление);
				СтруктураБСО.сПоложениеБСО 				= ?(СтруктураБСО.ПоложениеБСО 		= Неопределено, ?(СтруктураБСО.Существует,"???",sНеНайден), Выборка.ПоложениеБСОПредставление);
				СтруктураБСО.сВладелец 					= ?(СтруктураБСО.Владелец 			= Неопределено,	?(СтруктураБСО.Существует,"--->",sНеНайден),Выборка.АгентПредставление);
				СтруктураБСО.сДатаВозврата 				= ?(СтруктураБСО.ДатаВозврата 		= Неопределено,	"", ?(СтруктураБСО.ДатаВозврата = Дата("00010101000000"), "- - -",Строка(СтруктураБСО.ДатаВозврата)));
				СтруктураБСО.сОрганизацияАгент 			= ?(СтруктураБСО.ОрганизацияАгент 	= Неопределено,	?(СтруктураБСО.Существует,"",sНеНайден),Выборка.ОрганизацияАгентПредставление);
				СтруктураБСО.сПоставщик 				= ?(СтруктураБСО.Поставщик 			= Неопределено,	?(СтруктураБСО.Существует,"",sНеНайден),Выборка.ПоставщикПредставление);
				СтруктураБСО.Блокировка 				= ?(ЕстьБлокировка, Выборка.Блокировка, Ложь);
				Если ДанныеЗаявки Тогда
					СтруктураБСО.НомерЗаявки	= Выборка.НомерЗаявки;
					СтруктураБСО.Менеджер		= Выборка.Менеджер;
					СтруктураБСО.Курьер			= Выборка.Курьер;
				КонецЕсли;
				Если ДанныеПолиса Тогда					
					СтруктураБСО.ДатаОформленияПолиса   	= Выборка.ДатаОформленияПолиса;
					СтруктураБСО.Страхователь				= Выборка.Страхователь;
					СтруктураБСО.ДатаНачалаДействияПолиса	= Выборка.ДатаНачалаДействияПолиса;
					СтруктураБСО.ДатаОкончанияДействияПолиса= Выборка.ДатаОкончанияДействияПолиса;
				КонецЕсли;
				Если ПолучатьПодразделениеОтправителя = Истина Тогда
					СтруктураБСО.ПодразделениеОтправитель = Выборка.ПодразделениеОтправитель;
				КонецЕсли;	
				Если ТекСостояниеБСО <> Неопределено Тогда
					Попытка
						ТекСостояниеБСО.Вставить(Ключ, СтруктураБСО);
					Исключение
					Конецпопытки	
				КонецЕсли;
				СтруктураПараметров.Вставить("ТекСостояниеБСО",ТекСостояниеБСО);				
				Возврат СтруктураБСО;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Указан
	// либо пустой номер БСО
	// либо Непустой, но не найден в регистре Движений БСО
	// либо ТипУчетаБСО = "кол"
	Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(тсВидБСО,тсТипУчетаБСО) Тогда
		СтруктураОтбора = Новый Структура("Период, Поставщик, ОрганизацияАгент, СК, ВидБСО, Агент"
		,НаМомент
		,тсПоставщик
		,тсОрганизацияАгент
		,тсСК
		,тсВидБСО
		,тсАгент
		);
		тзРег = уб_СЛ.ПолучитьОстаткиБСО(СтруктураОтбора);
		Если тзРег.Количество() > 0 Тогда
			тз = тзРег[0];
			СтруктураБСО.Поставщик 	= тз.Поставщик;
			СтруктураБСО.ОрганизацияАгент 		= тз.ОрганизацияАгент;
			СтруктураБСО.СостояниеБСО 	= "Остаток: " + тз.Количество;
			СтруктураБСО.ПоложениеБСО 	= "на руках";
			//СтруктураБСО.АгентОтправитель 		= Неопределено;
			СтруктураБСО.Владелец 		= тз.Агент;
			СтруктураБСО.Количество 	= тз.Количество;
			//СтруктураБСО.Регистратор 	= Неопределено;
			СтруктураБСО.сВладелец 		= ?(СтруктураБСО.Владелец = Неопределено,"-=-=-",тз.АгентПредставление);
			СтруктураБСО.сОрганизацияАгент 		= ?(СтруктураБСО.ОрганизацияАгент = Неопределено,"-=-=-",тз.ОрганизацияАгентПредставление);
			СтруктураБСО.сПоставщик 	= ?(СтруктураБСО.Поставщик = Неопределено,"-=-=-",тз.ПоставщикПредставление);
		Иначе
			СтруктураБСО.Поставщик 	= Неопределено;
			СтруктураБСО.сПоставщик 	= "-=-=-";
			СтруктураБСО.ОрганизацияАгент 		= Неопределено;
			СтруктураБСО.сОрганизацияАгент 		= "-=-=-";
			СтруктураБСО.СостояниеБСО 	= "Остаток: 0";
			СтруктураБСО.ПоложениеБСО 	= "";
			СтруктураБСО.Владелец 		= тсАгент;
			СтруктураБСО.сВладелец 		= ?(СтруктураБСО.Владелец = Неопределено,"-=-=-",Строка(тсАгент));//-
			СтруктураБСО.Количество 	= 0;
		КонецЕсли;
		СтруктураБСО.ВремяЗапроса 	= ТекущаяДата();
		СтруктураБСО.НаМомент 		= НаМомент;
		СтруктураБСО.Существует 	= Истина;
		СтруктураБСО.НомернойУчет 	= Ложь;
		СтруктураБСО.КоличественныйУчет 	= Истина;
		СтруктураБСО.ДатаВозврата 	= Неопределено;
		СтруктураБСО.сСостояниеБСО 	= Строка(СтруктураБСО.СостояниеБСО);//-
		СтруктураБСО.сПоложениеБСО 	= Строка(СтруктураБСО.ПоложениеБСО);//-
		СтруктураБСО.сДатаВозврата 	= "";
		//Возвращаем либо заполненное, либо пустое соответствие
		Если ТекСостояниеБСО <> Неопределено Тогда
			ТекСостояниеБСО.Вставить(Ключ, СтруктураБСО);
		КонецЕсли;
	ИначеЕсли уб_СЛ.ОпределитьВедетсяНомернойУчет(тсВидБСО,тсТипУчетаБСО) Тогда
		//Возвращаем пустое соответствие
		СтруктураБСО.НаМомент 				= НаМомент;
		СтруктураБСО.Существует 			= Ложь;
		СтруктураБСО.СК 					= тсСК;
		СтруктураБСО.ВидБСО 				= тсВидБСО;
		СтруктураБСО.НомерБСО 				= тсНомБСО;
		СтруктураБСО.НомернойУчет 			= Истина;
		СтруктураБСО.КоличественныйУчет 	= Ложь;
		СтруктураБСО.сСостояниеБСО 			= sНеНайден;
		СтруктураБСО.сПоложениеБСО 			= sНеНайден;
		СтруктураБСО.сВладелец 				= sНеНайден;
		СтруктураБСО.сДатаВозврата 			= "";
		СтруктураБСО.сОрганизацияАгент 		= sНеНайден;
		СтруктураБСО.сПоставщик 			= sНеНайден;
		СтруктураБСО.ВремяЗапроса 			= ТекущаяДата();
	ИначеЕсли уб_СЛ.ОпределитьУчетНеВедется(тсВидБСО,тсТипУчетаБСО) Тогда
		СтруктураБСО.НаМомент 				= НаМомент;
		СтруктураБСО.Существует 			= Ложь;
		СтруктураБСО.НомернойУчет 			= Ложь;
		СтруктураБСО.КоличественныйУчет 	= Ложь;
		СтруктураБСО.сСостояниеБСО 			= "[учет не ведется]";
		СтруктураБСО.сПоложениеБСО 			= "";
		СтруктураБСО.сВладелец 				= "";
		СтруктураБСО.сДатаВозврата 			= "";
		СтруктураБСО.сОрганизацияАгент 		= "";
		СтруктураБСО.сПоставщик 			= "";
		СтруктураБСО.ВремяЗапроса 			= ТекущаяДата();
	КонецЕсли;
	СтруктураПараметров.Вставить("ТекСостояниеБСО",ТекСостояниеБСО);	
	Возврат СтруктураБСО;
	
КонецФункции

//TODO зачем принимать и отправлять ЭлементВладелец?
Процедура НачалоВыбораМесячногоПериода(ЭлементВладелец, Значение, Представление = Неопределено, ФорматПериода = "ДФ='МММ гггг'") Экспорт
	
	Форм = ПолучитьОбщуюФорму("уб_ВыборМесячногоПериода", ЭлементВладелец);
	Форм.дДата = Значение;
	Форм.ОткрытьМодально();
	Значение = Форм.дДата;
	Представление = Формат(Значение, ФорматПериода);
	
КонецПроцедуры

Функция ДайДоговорМеждуПоставщикомИОргАгентом(Поставщик, ОрганизацияАгент, НаДату = Неопределено, Предупреждать = Ложь, ВидСП = Неопределено) Экспорт 
	
	лПустойДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если ЗначениеНеЗаполнено(Поставщик) ИЛИ ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
		Возврат лПустойДоговор;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();	
	КонецЕсли;
	
	ЗапросДоговорСПоставщиком = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДК.Ссылка,
	|	ВЫБОР
	//|		КОГДА ДК.Ссылка = &ОсновнойДоговор
	|		КОГДА ДК.Владелец = ДК.Владелец.ОсновнойДоговорКонтрагента
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	ДК.ВидСП КАК ВидСП
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|ГДЕ
	|	ДК.Владелец = &Поставщик
	|	И ДК.Организация = &ОрганизацияАгент
	|	И НЕ ДК.ПометкаУдаления
	|	И ДК.ДатаЗаключенияДоговора <= &НаДату
	|	И (ДК.ДатаОкончанияДействияДоговора >= &НаДату
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора ЕСТЬ NULL 
	|			ИЛИ ДК.ДатаОкончанияДействияДоговора = &НульДАта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ,
	|	ДК.ДатаЗаключенияДоговора УБЫВ,
	|	ДК.ДатаОкончанияДействияДоговора";
	
	ЗапросДоговорСПоставщиком.УстановитьПараметр("Поставщик", 			Поставщик);
	//Запрос.УстановитьПараметр("ОсновнойДоговор", 	Поставщик.ОсновнойДоговорКонтрагента);
	ЗапросДоговорСПоставщиком.УстановитьПараметр("ОрганизацияАгент", 	ОрганизацияАгент);
	ЗапросДоговорСПоставщиком.УстановитьПараметр("НаДату", 			НаДату);
	ЗапросДоговорСПоставщиком.УстановитьПараметр("НульДАта", 			Дата("00010101000000"));
	
	ЗапросДоговорСПоставщиком.Текст = ТекстЗапроса;
	Результат = ЗапросДоговорСПоставщиком.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		//#Если Клиент Тогда
		//	Если Предупреждать Тогда
		//		Фрм = Поставщик.ПолучитьФорму();
		//		Если Фрм.Открыта() Тогда
		//			Возврат лПустойДоговор;		
		//		КОнецЕсли;	
		//		Заг = "Необходимо указать данные договора!";
		//		СОО = "Не найден действующий договор между 
		//		|Поставщиком: " + Строка(Поставщик) + "
		//		|и ОргАгентом: " + Строка(ОрганизацияАгент) + "
		//		|на дату: " + НаДату + "
		//		|
		//		|Зайдите в справочник Контрагентов и внесите данные договора!
		//		|
		//		|Открыть форму Контрагента-Поставщика для внесения изменений?";
		//		Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
		//		Если Ответ = КодВозвратаДиалога.Да Тогда
		//			Фрм.ЭлементыФормы.Панель.ТекущаяСтраница = Фрм.ЭлементыФормы.Панель.Страницы.СчетаИДоговоры;	
		//			Фрм.ОткрытьМодально();
		//		КонецЕсли;
		//	КонецЕсли;
		//#КонецЕсли			
		Возврат лПустойДоговор;	
	КонецЕсли;
	
	Если ТипЗНЧ(ВидСП) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") И НЕ ВидСП.Пустая() Тогда
		//Обходим результат первый раз, ищем соответствие по ВидуСП
		Для Каждого СтрокаТЗ Из Результат Цикл
			Если СтрокаТЗ.ВидСП = ВидСП Тогда
				Возврат СтрокаТЗ.Ссылка
			КонецЕсли;
		КонецЦикла;
		
		//Обходим результат второй раз, если значение ВидСП заполнено, ищем договора с незаполнеными ВидСП
		Для Каждого СтрокаТЗ Из Результат Цикл
			Если СтрокаТЗ.ВидСП.Пустая() Тогда
				Возврат СтрокаТЗ.Ссылка
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Если ничего не нашли, берем первый по приоритету
	Возврат Результат[0].Ссылка;
	
КонецФункции

Функция ОпределитьЭтоРасчетСУдержаниемКВ_ПоДоговору(Договор, Предупреждать = Истина) Экспорт 
	
	ЗапросЭтоРасчетСудержаниемКВ = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидВзаиморасчетов,
	|	ДоговорыКонтрагентов.ДатаЗаключенияДоговора,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Наименование
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
	ЗапросЭтоРасчетСудержаниемКВ.УстановитьПараметр("Ссылка", Договор);
	Выборка = ЗапросЭтоРасчетСудержаниемКВ.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ВидВзаиморасчетов = ПараметрыСеанса.уб_Константы.ВидВзаиморасчетовБезУдержанияКВ Тогда
			Результат = Ложь
		Иначе
			Если Не ЗначениеЗаполнено(Выборка.ВидВзаиморасчетов) И Предупреждать Тогда
				Заг = "Необходимо указать Вид Взаиморасчетов по договору!";
				СОО = "Не указан Вид Взаиморасчетов по договору № " + Выборка.Наименование + " от " 
				+ Формат(Выборка.ДатаЗаключенияДоговора, "ДФ='dd.MM.yyyy'") + "г. между 
				|Поставщиком: " + Выборка.Владелец + "
				|и ОргАгентом: " + Выборка.Организация + "
				|
				|Зайдите в справочник Контрагентов на закладку 'Счета и Договоры' и 
				|
				|в соответствующем договоре укажите вид взаиморасчетов!
				|
				|Открыть форму Договора для внесения изменений?";
				#Если Клиент Тогда
					Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						Фрм = Договор.ПолучитьОбъект().ПолучитьФорму();
						Фрм.Открыть();
						Фрм.ТекущийЭлемент = Фрм.ЭлементыФормы.ВидВзаиморасчетов;
					КонецЕсли;
				#КонецЕсли
			КонецЕсли;
			//TODO т.е. истина если мы даже выберем другое...
			Результат = Истина
		КонецЕсли;
	Иначе
		//По умолчанию - работаем с удержанием КВ
		Результат = Истина
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ОпределитьЭтоРасчетСУдержаниемКВ(Поставщик, ОрганизацияАгент, НаДату = Неопределено, Предупреждать = Истина,ВидСП = Неопределено) Экспорт 
	
	Договор = ДайДоговорМеждуПоставщикомИОргАгентом(Поставщик, ОрганизацияАгент, НаДату, Предупреждать,ВидСП);
	Возврат ОпределитьЭтоРасчетСУдержаниемКВ_ПоДоговору(Договор, Предупреждать);
	
КонецФункции

Функция ДайНомерБСОПоСП(оСП, ВидБСО = Неопределено, БСО2 = Неопределено) Экспорт
	
	ВидБСО = Справочники.уб_ВидыБСО.ПустаяСсылка();	
	Если БСО2 = Неопределено Тогда
		БСО = оСП.БСО;
		ЕстьКолонкаТип = Ложь;
		ЕстьКолонкаТипУчетаБСО = Ложь;
	Иначе
		БСО = ?(ТипЗнч(БСО2) = Тип("ТаблицаЗначений"), БСО2, БСО2.Выгрузить());
		ЕстьКолонкаТип = БСО.Колонки.Найти("ВидБСОТип") <> Неопределено;
		ЕстьКолонкаТипУчетаБСО = БСО.Колонки.Найти("ВидБСОТипУчетаБСО") <> Неопределено;
	КонецЕсли;
	Для Каждого СтрокаТЧ из БСО Цикл
		ТекВидБСО = СтрокаТЧ.ВидБСО;
		ТекВидБСОТип = ?(ЕстьКолонкаТип,СтрокаТЧ.ВидБСОТип,Неопределено);
		ТекВидБСОТипУчетаБСО = ?(ЕстьКолонкаТипУчетаБСО,СтрокаТЧ.ВидБСОТипУчетаБСО,Неопределено);
		Если уб_СЛ.ОпределитьЭтоПолис(ТекВидБСО,ТекВидБСОТип) И уб_СЛ.ЕстьНомерПолиса(ТекВидБСО,ТекВидБСОТипУчетаБСО) И Не ПустаяСтрока(СтрокаТЧ.НомерБСО) Тогда
			ВидБСО = ТекВидБСО;
			Возврат СтрокаТЧ.НомерБСО;				
		КонецЕсли;
	КонецЦикла;
	Возврат "";
	
КонецФункции

Функция БСОПоРегистратору(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	уб_ДвиженияБСО.Период,
	               |	уб_ДвиженияБСО.Регистратор,
	               |	уб_ДвиженияБСО.НомерСтроки,
	               |	уб_ДвиженияБСО.Активность,
	               |	уб_ДвиженияБСО.ВидБСО,
	               |	уб_ДвиженияБСО.НомерБСО,
	               |	уб_ДвиженияБСО.СК,
	               |	уб_ДвиженияБСО.АгентОтправитель,
	               |	уб_ДвиженияБСО.Агент,
	               |	уб_ДвиженияБСО.ПоложениеБСО,
	               |	уб_ДвиженияБСО.СостояниеБСО,
	               |	уб_ДвиженияБСО.НомерПолиса,
	               |	уб_ДвиженияБСО.ГодПолиса,
	               |	уб_ДвиженияБСО.СтраховойПолис,
	               |	уб_ДвиженияБСО.НаОснованииБумажногоДокумента,
	               |	уб_ДвиженияБСО.ДатаВозврата,
	               |	уб_ДвиженияБСО.Заявка,
	               |	уб_ДвиженияБСО.Подтверждено,
	               |	уб_ДвиженияБСО.Поставщик,
	               |	уб_ДвиженияБСО.ОрганизацияАгент,
	               |	уб_ДвиженияБСО.СтраховаяПремия,
	               |	уб_ДвиженияБСО.Актуальная,
	               |	уб_ДвиженияБСО.ДопНомерБСО,
	               |	уб_ДвиженияБСО.КодОперации,
	               |	уб_ДвиженияБСО.Комментарий,
	               |	уб_ДвиженияБСО.ВидБСО.Тип,
	               |	уб_ДвиженияБСО.ВидБСО.ТипУчетаБСО
	               |ИЗ
	               |	РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	               |ГДЕ
	               |	уб_ДвиженияБСО.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);			   
	БСО = Запрос.Выполнить().Выгрузить();
	Возврат БСО;
КонецФункции	

Процедура ОбновитьДокументВФорме(ДокументСсылка) Экспорт
	
	//Обновляет данные в открытой форме документа
	Если ЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Возврат;	
	КонецЕсли;
	Фрм = ДокументСсылка.ПолучитьФорму();
	Если Фрм.Открыта() Тогда
		Попытка
			Фрм.ЭтотОбъект.Прочитать();
			Фрм.Обновить();
			Фрм.ПриОткрытии(); //Этот метод дб проэкспортирован в форме
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

//Для справочника уб_КВ
Процедура ПриИзмененииПроцентаКВ(Объект) Экспорт
	//Если Объект.Процент = Неопределено Тогда
	//	Объект.Процент = 0;
	//	Объект.ПроцентДляОтчета = 0;
	//	Возврат;	
	//КонецЕсли;
	
	Если ТипЗнч(Объект.Процент) <> Тип("Число") ИЛИ ТипЗнч(Объект.ПроцентДляОтчета) <> Тип("Число") Тогда
		Объект.ПроцентДляОтчета = Объект.Процент;
		Возврат;	
	КонецЕсли;
	
	Если Объект.ПроцентДляОтчета = 0 Тогда
		Если Объект.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или Объект.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда
			Объект.ПроцентДляОтчета = Мин(10,Объект.Процент);
		Иначе
			Объект.ПроцентДляОтчета = Объект.Процент;
		КонецЕсли;
	ИначеЕсли Объект.ПроцентДляОтчета > Объект.Процент Тогда	
		Объект.ПроцентДляОтчета = Объект.Процент;
	КонецЕсли;
КонецПроцедуры

Функция ДайСписокПоставщиковДляСправочникаКВ() Экспорт
	СписокПоставщиков = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	К.Поставщик.Ссылка КАК ПоставщикСсылка,
	|	К.Поставщик.Наименование КАК ПоставщикНаименование,
	|	К.Поставщик.Родитель КАК ПоставщикРодитель,
	|	К.Поставщик.Родитель.Наименование КАК ПоставщикРодительНаименование,
	|	ВЫБОР
	|		КОГДА К.Поставщик.Родитель.Наименование <> ""НЕ АКТИВНЫЕ""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Активность
	|ИЗ
	|	Справочник.уб_КВ КАК К
	|
	|УПОРЯДОЧИТЬ ПО
	|	Активность УБЫВ,
	|	ПоставщикРодительНаименование,
	|	ПоставщикНаименование";
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	РодительНаименование = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если РодительНаименование <> Неопределено и РодительНаименование <> Выборка.ПоставщикРодительНаименование Тогда
			СписокПоставщиков.Добавить(Справочники.Контрагенты.ПустаяСсылка(),"===================");
		КонецЕсли;
		СписокПоставщиков.Добавить(Выборка.ПоставщикСсылка,Выборка.ПоставщикНаименование);
		РодительНаименование = Выборка.ПоставщикРодительНаименование;
	КонецЦикла;
	Возврат СписокПоставщиков;
КонецФункции

Процедура НачалоВыбораКВ(ФормаВладелец, Элемент, СтандартнаяОбработка) Экспорт
	#Если Клиент Тогда
		СтандартнаяОбработка = Ложь;
		
		СтароеЗначение = Элемент.Значение;
		ТипСтЗн = ТипЗнч(СтароеЗначение);
		Процент = ?(ТипСтЗн = Тип("Число"),СтароеЗначение,0);
		
		Список = Новый СписокЗначений;
		ЭлНом = Список.Добавить(Процент,"Процент",,БиблиотекаКартинок.уб_Процент);
		ЭлКрд = Список.Добавить(Перечисления.уб_ВидыКВ.Кредитное,"Кредитное КВ",,БиблиотекаКартинок.уб_КредитноеКВ);
		ЭлементПоУмолчанию = ?(ТипСтЗн = Тип("ПеречислениеСсылка.уб_ВидыКВ"),ЭлКрд,ЭлНом);
		ВыбранныйЭлемент = Список.ВыбратьЭлемент("Выберите вид значения КВ",ЭлементПоУмолчанию);
		
		ВыбранноеЗначение = ?(ВыбранныйЭлемент = Неопределено, СтароеЗначение, ВыбранныйЭлемент.Значение);
		
		Элемент.Значение = ВыбранноеЗначение;
		ВыбранПроцент = ТипЗнч(ВыбранноеЗначение) = Тип("Число");
		
		Элемент.РедактированиеТекста = ВыбранПроцент;
	#КонецЕсли
КонецПроцедуры

//Удаляет пустые колонки из ТаблицыЗначени или ДереваЗначений (ТЗ)
//В СписокНеудаляемыхКололнок передается перечень имен колонок через запятую, которые не нужно удалять  
Процедура УдалитьПустыеКолонки(ТЗ, СписокНеудаляемыхКололнок = "") Экспорт
	//Удаляем из таблицы колонки с пустыми значениями
	Колонки = ТЗ.Колонки;
	КоличествоКолонок = Колонки.Количество();
	
	СписокНеудаляемыхКололнок = "," + СтрЗаменить(СписокНеудаляемыхКололнок, " ", "") +  ",";
	Для Сч = 1 По КоличествоКолонок Цикл
		Кол = Колонки[КоличествоКолонок - Сч];
		ИмяКолонки = Кол.Имя;
		
		Если Найти(НРег(СписокНеудаляемыхКололнок), "," + НРег(ИмяКолонки) + ",") > 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		ВКолонкеЕстьЗначения = Ложь;
		Для Каждого Стр из ТЗ Цикл
			Если НЕ ЗначениеНеЗаполнено(Стр[ИмяКолонки]) Тогда
				ВКолонкеЕстьЗначения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ВКолонкеЕстьЗначения Тогда
			Колонки.Удалить(Кол);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПодпискаНаСобытие1ОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Сообщить(1);
	
КонецПроцедуры

Процедура ПодпискаНаСобытие2ОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Сообщить(2);
	
КонецПроцедуры

Функция СоответствиеРежимаЗаписиСостояниюСсылки(Ссылка, РежимЗаписи) Экспорт
	
	Возврат РежимЗаписи = Неопределено
	Или (РежимЗаписи = РежимЗаписиДокумента.Проведение 			И Ссылка.Проведен)
	Или (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 	И Не Ссылка.Проведен)
	Или (РежимЗаписи = РежимЗаписиДокумента.Запись);
	
КонецФункции // СоответствиеРежимаЗаписиСостояниюСсылки()

Функция ФИОФизлицаСтрокой(Знач ФизЛицо, НаДату = Неопределено, ФИОКратко = Истина, Падеж = Неопределено, ВыводитьОшибки = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат "";
	Иначе
		ТипЗнчФизЛицо = ТипЗнч(ФизЛицо);
		ЗапросФИОСрез = Новый Запрос;
		Если ТипЗнчФизлицо = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ЗапросФИОСрез.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка,
			|	ФизическиеЛица.Пол,
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.Код
			|ПОМЕСТИТЬ ВТ_ФизЛицо
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка,
			|	ФизическиеЛица.Пол,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК Фамилия,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК Имя,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК Отчество,
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.Код
			|ИЗ
			|	ВТ_ФизЛицо КАК ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ФизЛицо = &Ссылка) КАК ФИОФизЛицСрезПоследних
			|		ПО ФизическиеЛица.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо";
		ИначеЕсли ТипЗнчФизЛицо = Тип("СправочникСсылка.Пользователи") Тогда
			ЗапросФИОСрез.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Наименование КАК НаименованиеПользователя,
			|	Пользователи.ФизЛицо
			|ПОМЕСТИТЬ ВТ_Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Пользователь.ФизЛицо КАК Ссылка,
			|	ЕСТЬNULL(ФизическиеЛица.Наименование, ВТ_Пользователь.НаименованиеПользователя) КАК Наименование,
			|	ФизическиеЛица.Пол КАК Пол,
			|	ФизическиеЛица.Код КАК Код,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК Фамилия,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК Имя,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК Отчество
			|ИЗ
			|	ВТ_Пользователь КАК ВТ_Пользователь
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО ВТ_Пользователь.ФизЛицо = ФизическиеЛица.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
			|				&НаДату,
			|				ФизЛицо В
			|					(ВЫБРАТЬ
			|						Т.ФизЛицо
			|					ИЗ
			|						ВТ_Пользователь КАК Т)) КАК ФИОФизЛицСрезПоследних
			|		ПО ВТ_Пользователь.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
		ИначеЕсли ТипЗнчФизЛицо = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			ЗапросФИОСрез.Текст =
			"ВЫБРАТЬ
			|	КЛ.Ссылка,
			|	КЛ.Наименование,
			|	КЛ.Пол,
			|	КЛ.Код,
			|	КЛ.Фамилия,
			|	КЛ.Имя,
			|	КЛ.Отчество
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КЛ
			|ГДЕ
			|	КЛ.Ссылка = &Ссылка";
		Иначе
			//передан неверный параметр. Done - откуда передается? Передавались Контактные лица
			Возврат Физлицо;
		КонецЕсли;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	ЗапросФИОСрез.УстановитьПараметр("Ссылка", ФизЛицо);
	ЗапросФИОСрез.УстановитьПараметр("НаДату", НаДату);
	ФИОСрез = ЗапросФИОСрез.Выполнить().Выбрать();
	ФИОСрез.Следующий();
	//ФИОСрез 	= РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(НаДату ,Новый Структура("ФизЛицо", ФизЛицо));
	Фамилия		= ФИОСрез.Фамилия;
	Имя			= ФИОСрез.Имя;
	Отчество	= ФИОСрез.Отчество;
	Если ПустаяСтрока(Фамилия + Имя + Отчество) Тогда
		ФамилияИмяОтчество = СокрЛП(ФИОСрез.Наименование);
	Иначе
		ФамилияИмяОтчество = "";//TODO Почему? Тип параметра ФизЛицо передан неверный
	КонецЕсли;
	//Если ВыводитьОшибки И Не ЗначениеЗаполнено(ФИОСрез.Пол) Тогда
	//	Если ЗначениеЗаполнено(ФИОСрез.Код) Тогда
	//		ТекстСообщения = "Не указан пол физлица '" + ФИОСрез.Наименование + "' (Код = '" + ФИОСрез.Код + "'). Функция склонения может работать неправильно!";
	//	Иначе
	//		ТекстСообщения = "Не указано физлицо пользователя '" + ФИОСрез.Наименование + "'. Функция склонения может работать неправильно!";
	//	КонецЕсли;
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстСообщения,
	//	"Сообщить",
	//	Истина,
	//	УровеньЖурналаРегистрации.Информация,
	//	//ФизЛицо.Метаданные()
	//	,
	//	ФизЛицо);
	//КонецЕсли;
	Возврат ФункцииРасширения.ФИО_Склонение(ФамилияИмяОтчество, Фамилия, Имя, Отчество, ФИОСрез.Пол, Падеж, ФИОКратко);
	
КонецФункции

Функция ПредыдущаяЗаписьРегистраДвижений(
	Период,
	СК,
	ВидБСО,
	НомерБСО,
	ИнфоЗапись
	) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	| 	*
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&Период,
	|			ВидБСО = &ВидБСО 
	|				И НомерБСО = &НомерБСО
	|				И 1 = 1) КАК ДБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДБ.Период УБЫВ";
	Запрос.УстановитьПараметр("Период", 	Период);
	Запрос.УстановитьПараметр("ВидБСО", 	ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО",   НомерБСО);
	Если Не ИнфоЗапись Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Подтверждено ");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции // ПредыдущаяЗаписьРегистраДвижений()

Процедура ДвижениеБСОПоРегистрам2(
	Объект, 
	Отказ,
	Заголовок 			= "",
	СтруктураКонтроля 	= Неопределено) Экспорт
	
	ОбъектМетаданные= Объект.Метаданные();
	ИмяОбъекта		= ОбъектМетаданные.Имя;
	ЭтоВозврат		= ИмяОбъекта = "уб_ВозвратБСОотПоставщика";
	ЭтоПередача 	= ИмяОбъекта = "уб_ПередачаБСОПоставщику";
	ЭтоПолиция		= ИмяОбъекта = "уб_ЗаявлениеВПолицию";
	ЭтоУтрата		= ИмяОбъекта = "уб_ЗаявлениеОбУтрате";
	ЭтоСМИ			= ИмяОбъекта = "уб_ОбъявлениеВСМИобУтратеБСО";
	ЭтоСписание		= ИмяОбъекта = "уб_СписаниеБСО";
	ЭтоУведомление	= ИмяОбъекта = "уб_УведомлениеПоставщикаОбУтратеБСО";
	БСО 			= Объект.БСО;
	Период 			= Новый Граница(Объект.МоментВремени(), ВидГраницы.Исключая);
	Проведен    	= Объект.Проведен;
	КоличествоПодтвержденных 	= 0;
	ЕстьДвиженияНомерных		= Ложь;
	ЕстьДвиженияКоличественных	= Ложь;
	//получаем структуру контроля для настройки необходимых проверок
	Если СтруктураКонтроля = Неопределено Тогда
		СтруктураКонтроля = СтруктураКонтроляДвиженийБСО();
		СтруктураКонтроля.НаличиеБСО 		= Истина;
		СтруктураКонтроля.Поставщик			= ЭтоВозврат Или ЭтоПередача;
		СтруктураКонтроля.ОрганизацияАгент	= ЭтоВозврат Или ЭтоПередача;
		СтруктураКонтроля.Агент				= Ложь;
		СтруктураКонтроля.ПоложениеБСО		= Не ЭтоПередача;
	КонецЕсли;
	//получаем есть или нет определенные колонки таблицы БСО и заполняем соответствие
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ОбъектМетаданные.ТабличныеЧасти.БСО.Реквизиты Цикл
		МассивКолонок.Добавить(Колонка.Имя)
	КонецЦикла;
	сооНаличияРеквизита = Новый Соответствие;
	сооНаличияРеквизита.Вставить("СК", 			МассивКолонок.Найти("СК")				<> Неопределено);
	сооНаличияРеквизита.Вставить("Поставщик", 	МассивКолонок.Найти("Поставщик")		<> Неопределено);
	сооНаличияРеквизита.Вставить("ОргАгент", 	МассивКолонок.Найти("ОрганизацияАгент")	<> Неопределено);
	сооНаличияРеквизита.Вставить("Подтверждено",МассивКолонок.Найти("Подтверждено")		<> Неопределено);
	сооНаличияРеквизита.Вставить("Агент",		МассивКолонок.Найти("Агент")			<> Неопределено);
	сооНаличияРеквизита.Вставить("НомерПолиса",	МассивКолонок.Найти("НомерПолиса")		<> Неопределено);
	сооНаличияРеквизита.Вставить("Комментарий",	МассивКолонок.Найти("Комментарий")		<> Неопределено);
	Пересортица = ?(ОбщегоНазначения.ЕстьРеквизит("Пересортица", Объект) И ТипЗнч(Объект.Пересортица) = Тип("Булево"), Объект.Пересортица, Ложь);
	ИспользуетсяКолУчет	= ЭтоПередача Или ЭтоСписание;
	//сообщения
	СООхвостПересортица = " Проведение разрешено, поскольку установлен флаг ""Пересортица""";
	//частные случаи объектов
	пПлж = Перечисления.уб_ПоложенияБСО;
	пСст = Перечисления.уб_СостоянияБСО;
	пКод = Перечисления.уб_КодыОперацийБСО;
	Период = Новый Граница(Объект.МоментВремени(), ВидГраницы.Исключая);
	//внецикловые значения реквизитов
	//
	Дата = Объект.Дата;
	//код операции и ПоложениеБСО
	Если ЭтоПередача Тогда
		КодОперации 	= пКод.ПередачаБСОПоставщику;
		ПоложениеБСО	= пПлж.ПереданВСК;
	ИначеЕсли ЭтоСписание Тогда
		КодОперации 	= пКод.СписаниеБСО;
		ТипПоУмолчанию	= Объект.ТипСписанияПоУмолчанию;
		ТипСписанияТЧ	= "ТипСписания";
	ИначеЕсли ЭтоВозврат Тогда
		КодОперации 	= пКод.ВозвратБСОотПоставщика;
		СостояниеБСО	= пСст.НеПравильноОформлен;
		ПоложениеБСО	= пПлж.ВозвращенИзСК;
	ИначеЕсли ЭтоУтрата Тогда
		КодОперации 	= пКод.ОбъявлениеВСМИОбУтратеБСО;
		ТипПоУмолчанию	= Объект.ТипУтратыПоУмолчанию;
		ТипСписанияТЧ	= "ТипУтраты";
	ИначеЕсли ЭтоПолиция Тогда
		КодОперации		= пКод.ОбъявлениеВСМИОбУтратеБСО;
		СостояниеБСО	= пСст.Украден;
	ИначеЕсли ЭтоУведомление Тогда
		КодОперации 	= пКод.ЗаявлениеАгентаОбУтратеБСО;
		ТипПоУмолчанию	= Объект.ТипУтратыПоУмолчанию;
		ТипСписанияТЧ	= "ТипУтраты";
	ИначеЕсли ЭтоСМИ Тогда
		КодОперации 	= пКод.ОбъявлениеВСМИОбУтратеБСО;
		СостояниеБСО 	= пСст.Утрачен
	КонецЕсли;
	Если ТипПоУмолчанию <> Неопределено Тогда 
		Если ТипПоУмолчанию = "Испорчен" Тогда
			СостояниеПоУмолчанию = пСст.Испорчен;	
		ИначеЕсли ТипПоУмолчанию = "Украден" Тогда
			СостояниеПоУмолчанию = пСст.Украден;	
		ИначеЕсли ТипПоУмолчанию = "Уничтожен" Тогда
			СостояниеПоУмолчанию = пСст.Уничтожен;	
		ИначеЕсли ТипПоУмолчанию = "Оформлен, отдан Клиенту" Тогда
			СостояниеПоУмолчанию = пСст.Оформлен;	
		ИначеЕсли ТипПоУмолчанию = "Оформлен, отдан Банку" Тогда
			СостояниеПоУмолчанию = пСст.Оформлен;	
		Иначе //Если ТипСписанияПоУмолчанию = "Утрачен" Тогда
			СостояниеПоУмолчанию = пСст.Утрачен;	
		КонецЕсли;
	КонецЕсли;
	//ЦИКЛ
	//
	Для Каждого СтрокаТЧ Из БСО Цикл
		ВидБСО			= СтрокаТЧ.ВидБСО;
		НомернойУчет 	= уб_СЛ.ОпределитьУчетБСОНомерной(ВидБСО);
		Если НомернойУчет = Неопределено Тогда
			Продолжить
		КонецЕсли;
		НомерБСО		= СокрЛП(СтрокаТЧ.НомерБСО);
		СК 				= ?(сооНаличияРеквизита.Получить("СК"), 			СтрокаТЧ.СК,				Объект.СК);
		Поставщик		= ?(сооНаличияРеквизита.Получить("Поставщик"), 		СтрокаТЧ.Поставщик,			Объект.Поставщик);
		ОргАгент		= ?(сооНаличияРеквизита.Получить("ОргАгент"), 		СтрокаТЧ.ОрганизацияАгент,	Объект.ОрганизацияАгент);
		Подтверждено	= ?(сооНаличияРеквизита.Получить("Подтверждено"), 	СтрокаТЧ.Подтверждено, 		Истина); //по умолчанию истина
		//Агент - для некоторых документов нужно брать из шапки даже прин наличии реквизита в ТЧ
		Если ЭтоПередача Или ЭтоСписание Тогда
			Агент = Неопределено
		ИначеЕсли ЭтоУведомление Или ЭтоСМИ Тогда
			Агент = Объект.Ответственный
		ИначеЕсли ЭтоПолиция Или ЭтоУтрата Тогда
			Агент = Объект.Агент
		Иначе
			Агент = ?(сооНаличияРеквизита.Получить("Агент"), СтрокаТЧ.Агент, Объект.Агент)
		КонецЕсли;
		//АгентОтправитель
		Если ЭтоВозврат Тогда
			АгентОтправитель = Неопределено
		ИначеЕсли ЭтоУведомление Или ЭтоСписание Или ЭтоСМИ Тогда
			АгентОтправитель = Объект.Ответственный
		ИначеЕсли ЭтоПолиция Или ЭтоУтрата Тогда
			АгентОтправитель = Объект.Агент
		Иначе
			АгентОтправитель = ?(сооНаличияРеквизита.Получить("Агент"), СтрокаТЧ.Агент, Объект.Агент)
		КонецЕсли;
		//ПоложениеБСО
		ИнфоЗапись	= Не (Подтверждено И Проведен);
		СООхвост	= " Перемещение невозможно! (строка № " + Строка(СтрокаТЧ.НомерСтроки) + ")";
		Если Подтверждено Тогда
			КоличествоПодтвержденных = КоличествоПодтвержденных + 1
		КонецЕсли;
		Если Не ПустаяСтрока(НомерБСО) Тогда
			Результат = ПоследняяЗаписьРегистраДвижений(Период, СК, ВидБСО, НомерБСО);
			Если Не Результат.Пустой() Тогда
				ВыборкаРС = Результат.Выбрать();
				ВыборкаРС.Следующий();
				Если Не НомернойУчет Тогда
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Только для журнала. Количественное БСО в регистре движений - проверить. " + Объект.Ссылка + " " + СК + " " + ВидБСО + " " + НомерБСО, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина)
				КонецЕсли;
				НомернойУчет = Истина;
			КонецЕсли;
		ИначеЕсли НомернойУчет Тогда
			СОО = "Не указан номер БСО для [" + Строка(ВидБСО) + "] СК: '" + Строка(СК) + "', строка " + Строка(СтрокаТЧ.НомерСтроки)+" " 
			+ СООхвост;
			ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		ЕстьИнфоОБСО = ВыборкаРС <> Неопределено;
		КонтролироватьОстатки = ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО И (Не ЭтоСписание //Или (ЭтоСписание И Не Объект.НеКонтролироватьНаличиеБСОПриПроведении)
		);
		Если НомернойУчет Тогда
			СОО = "БСО № '" + Строка(НомерБСО) + "' [" + Строка(ВидБСО) + "], СК: '" + Строка(СК) + "'";
			Если Не ИнфоЗапись Тогда
				//контроль БСО
				Если ЕстьИнфоОБСО Тогда
					//контроль поставщика, оргагента и агента. 
					Если СтруктураКонтроля.Поставщик И ВыборкаРС.Поставщик <> Поставщик Тогда
						СОО = СОО + " поступало от поставщика '" + ВыборкаРС.Поставщик.Наименование + "'. В документе указан другой поставщик: '" + Поставщик.Наименование + "'.";
						Если Пересортица Тогда
							Сообщить(СОО + СООхвостПересортица);	
						Иначе
							ОбщегоНазначения.ОшибкаПриПроведении(СОО + СООхвост, Отказ, Заголовок);
							Возврат;
						КонецЕсли;
					КонецЕсли;
					Если СтруктураКонтроля.ОрганизацияАгент И ВыборкаРС.ОрганизацияАгент <> ОргАгент Тогда
						СОО = СОО + " поступало в ОргАгент '" + ВыборкаРС.ОрганизацияАгент.Наименование +"'. В документе указан другой ОргАгент: '" + ОргАгент.Наименование + "'.";
						Если Пересортица Тогда
							Сообщить(СОО + СООхвостПересортица);	
						Иначе
							ОбщегоНазначения.ОшибкаПриПроведении(СОО + СООхвост, Отказ, Заголовок);
							Возврат;
						КонецЕсли;
					КонецЕсли;
					Если СтруктураКонтроля.Агент И ВыборкаРС.Агент <> Агент Тогда
						СОО = СОО + " поступало в Агент '" + ВыборкаРС.ОрганизацияАгент.Наименование + "'. В документе указан другой Агент: '" + Агент.Наименование + "'.";
						Если Пересортица Тогда
							Сообщить(СОО + СООхвостПересортица);	
						Иначе
							ОбщегоНазначения.ОшибкаПриПроведении(СОО + СООхвост, Отказ, Заголовок);
							Возврат;
						КонецЕсли;
					КонецЕсли;
					//TODO контроль положения
					Если СтруктураКонтроля.ПоложениеБСО Тогда
						Если ЭтоВозврат Тогда
							Если ВыборкаРС.ПоложениеБСО <> Перечисления.уб_ПоложенияБСО.ПереданВСК Тогда
								СОО = СОО + " не передавался Поставщику ранее. Текущее положение: '" + Строка(ВыборкаРС.ПоложениеБСО) + "'"	+ СООхвост;
								ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
								Возврат;
							КонецЕсли;
						ИначеЕсли ЭтоСписание Тогда
							Если ВыборкаРС.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданВСК 
								Или ВыборкаРС.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.Списан
								Тогда
								СОО = СОО + " имеет состояние: '" + Строка(ВыборкаРС.СостояниеБСО) + "', положение: '" + Строка(ВыборкаРС.ПоложениеБСО) + "'." + СООхвост;
								ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
								Возврат;
							КонецЕсли;
						Иначе
							//стандартная проверка
							Если ВыборкаРС.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданВСК Тогда
								СОО = СОО + " имеет состояние: '" + Строка(ВыборкаРС.СостояниеБСО) + "', положение: '" + Строка(ВыборкаРС.ПоложениеБСО) + "'.";
								ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
								Возврат;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					//контроль остатков
					Если СтруктураКонтроля.НаличиеБСО И КонтролироватьОстатки Тогда
						СОО = СОО + " не поступало!" + СООхвост;
						ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
						Возврат;
					КонецЕсли;
				КонецЕсли;		
			КонецЕсли;
			Движение = Объект.Движения.уб_ДвиженияБСО.Добавить();
			Движение.Период 	= Дата;
			Движение.СК			= СК;
			Движение.ВидБСО 	= ВидБСО;
			Движение.НомерБСО   = НомерБСО;
			Если ЕстьИнфоОБСО Тогда
				Движение.Поставщик 			= ВыборкаРС.Поставщик;
				Движение.ОрганизацияАгент 	= ВыборкаРС.ОрганизацияАгент;				
				Движение.НомерПолиса		= ВыборкаРС.НомерПолиса;
				Движение.ГодПолиса			= ВыборкаРС.ГодПолиса;
				Движение.СтраховойПолис		= ВыборкаРС.СтраховойПолис;
				Движение.ДопНомерБСО		= ВыборкаРС.ДопНомерБСО;
				
				//при возврате блокировка - ложь и заявки нет
				Если Не ЭтоВозврат Тогда
					//Движение.Блокировка	= ВыборкаРС.Блокировка;
					Движение.Заявка		= ВыборкаРС.Заявка;
				КонецЕсли;
				Если СтрокаТЧ.Количество = 1 Тогда
					СтрокаТЧ.Количество = 0;	
				КонецЕсли;
			Иначе
				Движение.Поставщик			= Поставщик;
				Движение.ОрганизацияАгент 	= ОргАгент;
				Если сооНаличияРеквизита.Получить("НомерПолиса") Тогда
					Движение.НомерПолиса = СтрокаТЧ.НомерПолиса
				КонецЕсли;
			КонецЕсли;
			//TODO у возврата всегда строка подтверждена
			Движение.Подтверждено   	= Подтверждено;
			//Движение.ДокПроведен 		= Проведен;
			Движение.Активность 		= Проведен;
			Движение.Агент 				= Агент;
			Движение.АгентОтправитель 	= АгентОтправитель;
			Движение.НаОснованииБумажногоДокумента 	= Объект.НаОсновеБумажногоДокумента;
			Если сооНаличияРеквизита.Получить("Комментарий") Тогда
				Движение.Комментарий = СтрокаТЧ.Комментарий
			КонецЕсли;
			Движение.КодОперации = КодОперации;
			//частные случаи состояния БСО
			Если ЭтоПередача Тогда
				Если СтрокаТЧ.СостояниеБСО.Пустая() Тогда
					Если ЕстьИнфоОБСО Тогда
						//т.е. если тип передачи утраченных а в строке пусто, то возьмутся последние данные из регистра?
						СостояниеБСО = ВыборкаРС.СостояниеБСО
					КонецЕсли;
				Иначе
					СостояниеБСО = СтрокаТЧ.СостояниеБСО
				КонецЕсли;
			ИначеЕсли ЭтоСписание Или ЭтоУтрата Или ЭтоУведомление Тогда
				Если СтрокаТЧ[ТипСписанияТЧ] = "Испорчен" Тогда
					СостояниеБСО	= пСст.Испорчен;
				ИначеЕсли СтрокаТЧ[ТипСписанияТЧ] = "Украден" Тогда
					СостояниеБСО	= пСст.Украден;
				ИначеЕсли СтрокаТЧ[ТипСписанияТЧ] = "Уничтожен" Тогда
					СостояниеБСО	= пСст.Уничтожен;
				ИначеЕсли СтрокаТЧ[ТипСписанияТЧ] = "Утрачен" Тогда
					СостояниеБСО	= пСст.Утрачен;
				ИначеЕсли СтрокаТЧ[ТипСписанияТЧ] = "Оформлен, отдан Клиенту" Тогда
					СостояниеБСО	= пСст.Оформлен;
				ИначеЕсли СтрокаТЧ[ТипСписанияТЧ] = "Оформлен, отдан Банку" Тогда
					СостояниеБСО	= пСст.Оформлен;
				Иначе
					СостояниеБСО	= СостояниеПоУмолчанию;
				КонецЕсли;
			КонецЕсли;
			//частный случай положения БСО для списания
			Если ЭтоСписание Тогда
				Если СтрокаТЧ.ТипСписания = "Испорчен" Тогда
					ПоложениеБСО	= пПлж.Списан;
				ИначеЕсли СтрокаТЧ.ТипСписания = "Украден" Тогда
					ПоложениеБСО	= пПлж.Списан;
				ИначеЕсли СтрокаТЧ.ТипСписания = "Уничтожен" Тогда
					ПоложениеБСО	= пПлж.Списан;
				ИначеЕсли СтрокаТЧ.ТипСписания = "Утрачен" Тогда
					ПоложениеБСО	= пПлж.Списан;
				ИначеЕсли СтрокаТЧ.ТипСписания = "Оформлен, отдан Клиенту" Тогда
					ПоложениеБСО	= пПлж.ОтданКлиенту;
				ИначеЕсли СтрокаТЧ.ТипСписания = "Оформлен, отдан Банку" Тогда
					ПоложениеБСО	= пПлж.ОтданБанку;
				Иначе
					//TODO а если банк??
					ПоложениеБСО	= пПлж.Списан;
				КонецЕсли;	
			КонецЕсли;
			Движение.СостояниеБСО   = СостояниеБСО;
			Движение.ПоложениеБСО	= ПоложениеБСО;
			ЕстьДвиженияНомерных = Истина;
		Иначе
			Если Не ИспользуетсяКолУчет Тогда
				СтрокаТЧ.Подтверждено 		= Ложь;
				КоличествоПодтвержденных 	= КоличествоПодтвержденных - 1;
				Сообщить("Найдено БСО количественного учета, с которого снято подтверждение: " + СОО);
			ИначеЕсли Не Инфозапись Тогда
				//движения количественного учета
				Если СтрокаТЧ.Количество = 0 Тогда
					СОО = Строка(ВидБСО) + ": не указано количество для БСО с количественным типом учета. Укажите количество! [строка "+Строка(СтрокаТЧ.НомерСтроки)+"] "
					+ СООхвост;
					ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
					Возврат;
				КонецЕсли;
				Если ЭтоСписание Тогда
					Если Не ЗначениеЗаполнено(Поставщик) Тогда
						СОО = Строка(ВидБСО) + ": не указан Поставщик для БСО с количественным типом учета. Укажите Поставщика!" + СООхвост;
						ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(ОргАгент) Тогда
						СОО = Строка(ВидБСО) + ": не указана Организация-Агент для БСО с количественным типом учета. Укажите Организацию-Агента!" + СООхвост;
						ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Агент) Тогда
						СОО = Строка(ВидБСО) + ": не указан Агент для БСО с количественным типом учета. Укажите Агента!" + СООхвост;
						ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
						Возврат;
					КонецЕсли;
				КонецЕсли;
				// проверим остатки
				СтруктураОтбора = Новый Структура("Период, Поставщик, ОрганизацияАгент, СК, ВидБСО, Агент"
				,Период
				,Поставщик
				,ОргАгент
				,СК
				,ВидБСО
				,Агент
				);
				тзРег = уб_СЛ.ПолучитьОстаткиБСО(СтруктураОтбора);
				КолВНаличие = 0;
				ЗаписьРег = Неопределено;
				Если тзРег.Количество() > 0 Тогда
					ЗаписьРег = тзРег[0];
					КолВНаличие = ЗаписьРег.Количество;
				КонецЕсли;
				Если СтруктураКонтроля.НаличиеБСО И КонтролироватьОстатки И СтрокаТЧ.Количество > КолВНаличие Тогда
					СОО = Строка(ВидБСО) + ": требуется передать " + Строка(СтрокаТЧ.Количество) + "шт, имеется в наличии " + Строка(КолВНаличие) + "шт."
					+ СООхвост;
					ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
					Возврат;
				КонецЕсли; 
				Движение = Объект.Движения.уб_ОстаткиБСО.Добавить();
				Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Объект.Дата;
				// измерения
				Если ЗаписьРег <> Неопределено Тогда
					Движение.Поставщик			= ЗаписьРег.Поставщик;
					Движение.ОрганизацияАгент 	= ЗаписьРег.ОрганизацияАгент;
				Иначе
					Движение.Поставщик 			= Поставщик;
					Движение.ОрганизацияАгент 	= ОргАгент;
				КонецЕсли;
				Движение.СК 	= СК;
				Движение.ВидБСО	= ВидБСО;
				Если ЭтоПередача Тогда
					Движение.Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО
				Иначе
					Движение.Агент = Агент
				КонецЕсли;
				// ресурсы
				Движение.Количество	= СтрокаТЧ.Количество;
				// реквизиты
				Если ЭтоСписание Тогда
					Движение.СостояниеБСО = ?(СтрокаТЧ.ТипСписания.Пустая(), ТипПоУмолчанию, СтрокаТЧ.ТипСписания);
				КонецЕсли;
				Движение.КодОперации = КодОперации;
				ЕстьДвиженияКоличественных = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Проведен И КоличествоПодтвержденных < 1 Тогда
		Если НЕ ЗначениеНеЗаполнено(Заголовок) Тогда
			Сообщить(Заголовок);
			Заголовок = "";
		КонецЕсли;
		Сообщить("Движения не сделаны. Не обнаружено ни одной подтвержденной строки передачи БСО в СК.");
	КонецЕсли;	
	Если ЕстьДвиженияНомерных Тогда
		Объект.Движения.уб_ДвиженияБСО.Записать()
	КонецЕсли;
	Если ЕстьДвиженияКоличественных Тогда
		Объект.Движения.уб_ОстаткиБСО.Записать()
	КонецЕсли;
	
КонецПроцедуры

//НаличиеБСО 	- для всех
//Поставщик		- для всех
//ОргАгент		- для всех
//Агент			- нигде
//ПоложениеБСО	- ВозвратБСО
Функция СтруктураКонтроляДвиженийБСО()
	
	Возврат Новый Структура("НаличиеБСО, Поставщик, ОрганизацияАгент, Агент, ПоложениеБСО");
	
КонецФункции // СтруктураКонтроляДвиженийБСО()

Функция ПоследняяЗаписьРегистраДвижений(Период, СК, ВидБСО, НомерБСО) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Выбор Когда &НеИспользоватьБлокировкиБСО = Истина Тогда Ложь Иначе ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ) Конец КАК Блокировка,
	| 	*
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&Период,
	|           	ВидБСО = &ВидБСО
	|				И НомерБСО = &НомерБСО
	|				И Подтверждено
	|				) КАК ДБ
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
	|				&Период,
	|				ВидБСО = &ВидБСО
	|					И НомерБСО = &НомерБСО) КАК уб_БлокировкаБСОСрезПоследних
	|		ПО ДБ.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
	|			И ДБ.СК = уб_БлокировкаБСОСрезПоследних.СК
	|			И ДБ.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДБ.Период УБЫВ");
	Запрос.УстановитьПараметр("Период", 	Период);
	Запрос.УстановитьПараметр("ВидБСО", 	ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО",   НомерБСО);
	Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО",ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО);
	//берем всегда только НЕ инфо записи
	//Если (ЭтоПолиция Или ЭтоУтрата Или ЭтоСМИ Или ЭтоУведомление) Или Не ИнфоЗапись Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Подтверждено И ДокПроведен")
	//КонецЕсли;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции // ТаблицаПоРегистру()

Функция ТаблицаДвиженийБСО()
	
	
	
КонецФункции // ТаблицаДвиженийБСО()

//возвращает пустую таблицу движений БСО
Функция ПустаяТаблицаДвиженийНомерныхБСО() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период");
	//измерения
	ТЗ.Колонки.Добавить("СК");   							//из документа, но в регистре то же самое
	ТЗ.Колонки.Добавить("ВидБСО");							//из документа, но в регистре то же самое
	ТЗ.Колонки.Добавить("НомерБСО");                        //из документа, но в регистре то же самое
	ТЗ.Колонки.Добавить("Поставщик");                       //из регистра
	ТЗ.Колонки.Добавить("ОрганизацияАгент");                //из регистра
	ТЗ.Колонки.Добавить("Подтверждено");					//из документа
	//ТЗ.Колонки.Добавить("ДокПроведен");						//из документа
	ТЗ.Колонки.Добавить("Активность");						//из документа
	//ресурсы
	ТЗ.Колонки.Добавить("АгентОтправитель");                //заполнять чем-нибудь из документа, но смысл этого реквизита?
	ТЗ.Колонки.Добавить("Агент");							//из документа
	ТЗ.Колонки.Добавить("ПоложениеБСО");                    //из документа
	ТЗ.Колонки.Добавить("СостояниеБСО");                    //из документа
	ТЗ.Колонки.Добавить("Блокировка");                      //неясно, в данный момент из регистра, но даже при создании 
	//блокировки по срезу последних блокировка не появится. TODO при проведении блокировки по полным данным измерений СК, 
	//ВидБСО, НомерБСО, ГодПолиса устанавливать блокировку (необходимо установить полную уникальность определенного номера БСО)
	//пока протягиваем ее. возможно раскрашиваем чтолибо при блокированном
	ТЗ.Колонки.Добавить("НомерПолиса");                     //из регистра
	ТЗ.Колонки.Добавить("ГодПолиса");                       //из регистра
	ТЗ.Колонки.Добавить("СтраховойПолис");                  //из регистра
	ТЗ.Колонки.Добавить("НаОснованииБумажногоДокумента");   //из документа
	ТЗ.Колонки.Добавить("ДатаВозврата");                    //неясен смысл
	ТЗ.Колонки.Добавить("Заявка");                          //из регистра
	//реквизиты
	ТЗ.Колонки.Добавить("КодОперации");                     //из документа
	ТЗ.Колонки.Добавить("Комментарий");                     //из документа
	Возврат ТЗ;
	
КонецФункции // ПустаяТаблицаДвиженийБСО()

Функция ПустаяТаблицаДвиженийКоличественныхБСО() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период");
	//измерения
	ТЗ.Колонки.Добавить("Поставщик");			//из документа
	ТЗ.Колонки.Добавить("ОрганизацияАгент");	//из документа
	ТЗ.Колонки.Добавить("СК");					//из документа
	ТЗ.Колонки.Добавить("ВидБСО");				//из документа
	ТЗ.Колонки.Добавить("Агент");				//из документа
	//ресурсы
	ТЗ.Колонки.Добавить("Количество");			//из документа
	//реквизиты
	ТЗ.Колонки.Добавить("КодОперации");			//из документа
	ТЗ.Колонки.Добавить("СостояниеБСО");		//
	ТЗ.Колонки.Добавить("Заявка");				//из регистра
	Возврат ТЗ;
	
КонецФункции // ПустаяТаблицаДвиженийКоличественныхБСО()

//Функция ТЧДокументаДляДвижений(Ссылка) Экспорт
//	
//	ИмяОбъекта = Ссылка.Метаданные().Имя;
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	*,
//	|	ВЫБОР
//	|		КОГДА ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных)
//	|				ИЛИ ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную)
//	|				ИЛИ ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйНетПолиса)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК Номерной,
//	|	НЕ (ПБ.Ссылка.Проведен И ПБ.Подтверждено) КАК Инфозапись
//	|ИЗ
//	|	Документ." + ИмяОбъекта + ".БСО КАК ПБ
//	|ГДЕ
//	|	ПБ.Ссылка = &Ссылка
//	|	И НЕ(ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных)
//	|				ИЛИ ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную)
//	|				ИЛИ ПБ.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяНетПолиса))");
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Возврат Запрос.Выполнить().Выбрать()
//	
//КонецФункции // ТЧДокументаДляДвижений()

Функция ПроверкиНомерныхДвижений(
	СтрокаТЗ, 
	СтрокаРС, 
	Отказ, 
	ИнфоЗапись,
	Пересортица 		= Ложь,
	ПроверкаПоложения 	= Истина,
	Заголовок,
	СооХвост,
	НеКонтролироватьНаличиеБСОПриПроведении = Ложь,
	ТЗОшибок,
	СтруктураПараметров,
	НомерСтроки) Экспорт
	
	ТипЗнчСсылка = ТипЗнч(СтруктураПараметров.Ссылка);
	ЭтоПеремещениеБСО = Ложь;
	ЭтоПередачаБСОПоставщику = Ложь;
	ЭтоВозвратБСООтПоставщика = Ложь;
	ЭтоСписаниеБСО = Ложь;
	ЭтоИнвентаризацияБСО = Ложь;
	ЭтоВводНачальныхОстатковБСО = Ложь;
	ЭтоЗаявка = Ложь;
	
	Если ТипЗнчСсылка = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		ЭтоПеремещениеБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
		ЭтоПередачаБСОПоставщику = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ВозвратБСОотПоставщика") Тогда
		ЭтоВозвратБСООтПоставщика = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_СписаниеБСО") Тогда
		ЭтоСписаниеБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ИнвентаризацияБСО") Тогда
		ЭтоИнвентаризацияБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ВводНачальныхОстатковБСО") Тогда
		ЭтоВводНачальныхОстатковБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		ЭтоЗаявка = Истина;	
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НесоответствиеПоставщиков", Ложь);
	Результат.Вставить("НесоответствиеОргАгентов",	Ложь);
	Результат.Вставить("НеверноеПоложение",			Ложь);
	Результат.Вставить("ОшибкаКонтроляОстатков",	Ложь);
	КонтролироватьНаличиеБСО = НЕ ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО = ЛОЖЬ И Не НеКонтролироватьНаличиеБСОПриПроведении;
	СООхвостПересортица = " Проведение разрешено, поскольку установлен флаг ""Пересортица""";
	СОО = "БСО № '" + СтрокаТЗ.НомерБСО + "' [" + СтрокаТЗ.ВидБСО + "], СК: '" + СтрокаТЗ.СК + "'";
	Если Не ИнфоЗапись Тогда
		//контроль БСО
		Если СтрокаРС <> Неопределено Тогда
			//контроль поставщика и оргагента 
			Если Не ЭтоИнвентаризацияБСО Тогда
				Если СтрокаРС.Поставщик <> СтрокаТЗ.Поставщик Тогда
					СОО = СОО + " поступало от поставщика '" + СтрокаРС.Поставщик.Наименование + "'. В документе указан другой поставщик: '" + СтрокаТЗ.Поставщик.Наименование + "'.";
					Если Пересортица Тогда
						Сообщить(СОО + СООхвостПересортица);
					Иначе
						//ОбщегоНазначения.ОшибкаПриПроведении(СОО + СООхвост, Отказ, Заголовок);
						СтрокаОшибки 			= ТЗОшибок.Добавить();
						СтрокаОшибки.Ошибка 	= СОО + СООхвост;
						СтрокаОшибки.Строка		= НомерСтроки - 1;
						СтрокаОшибки.Элемент	= "БСО";
						Отказ = Истина;
						Результат.НесоответствиеПоставщиков = Истина;
					КонецЕсли;
				КонецЕсли;
				Если СтрокаРС.ОрганизацияАгент <> СтрокаТЗ.ОрганизацияАгент Тогда
					СОО = СОО + " поступало в ОргАгент '" + СтрокаРС.ОрганизацияАгент.Наименование +"'. В документе указан другой ОргАгент: '" + СтрокаТЗ.ОрганизацияАгент.Наименование + "'.";
					Если Пересортица Тогда
						Сообщить(СОО + СООхвостПересортица);	
					Иначе
						//ОбщегоНазначения.ОшибкаПриПроведении(СОО + СООхвост, Отказ, Заголовок);
						СтрокаОшибки 			= ТЗОшибок.Добавить();					
						СтрокаОшибки.Ошибка 	= СОО + СООхвост;
						СтрокаОшибки.Строка		= НомерСтроки - 1;
						СтрокаОшибки.Элемент	= "БСО";
						Отказ = Истина;
						Результат.НесоответствиеОргАгентов = Истина;
					КонецЕсли;
				КонецЕсли;
				Если ЭтоПеремещениеБСО И НЕ ИнфоЗапись И КонтролироватьНаличиеБСО //Тогда
					И СтрокаРС.Агент <> СтрокаТЗ.АгентОтправитель //Тогда
					И НЕ ПеремещениеРазрешено(СтруктураПараметров.Дата, СтрокаТЗ.АгентОтправитель, СтрокаРС.Агент, СтруктураПараметров.ПодразделениеОт, СтруктураПараметров.ПодразделениеКуда, СтрокаРС.Регистратор, СтрокаРС.АгентОтправитель) Тогда
					СОО = СОО + " нет в наличии у агента '" + Строка(СтрокаТЗ.АгентОтправитель) + "'. (числится на '" + Строка(СтрокаРС.Агент) + "')." 
					+ СООхвост;
					//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
					СтрокаОшибки 			= ТЗОшибок.Добавить();
					СтрокаОшибки.Ошибка 	= СОО;
					СтрокаОшибки.Строка		= НомерСтроки - 1;
					СтрокаОшибки.Элемент	= "БСО";
					//Возврат;
					//	КонецЕсли;
					//КонецЕсли;
				КонецЕсли;
			Иначе//если инвентаризация
				ЕстьВНаличие = ИнфоЗапись;
			КонецЕсли;
			
			Если Не ИнфоЗапись И ПроверкаПоложения И КонтролироватьНаличиеБСО
				И (Не ЭтоПеремещениеБСО И Не ЭтоВозвратБСООтПоставщика И СтрокаРС.ПоложениеБСО = Перечисления.уб_ПоложенияБСО.ПереданВСК Или
				ЭтоСписаниеБСО И Перечисления.уб_ПоложенияБСО.Списан = СтрокаРС.ПоложениеБСО Или
				ЭтоПеремещениеБСО И Не уб_СтраховойБрокер.ПоложениеЕстьВНаличие(СтрокаРС.ПоложениеБСО) Или
				ЭтоВозвратБСООтПоставщика И СтрокаРС.ПоложениеБСО <> Перечисления.уб_ПоложенияБСО.ПереданВСК) Тогда
				ЗафиксироватьОшибку = Истина;
				Если ЭтоПередачаБСОПоставщику И СтрокаТЗ.СостояниеБСО = Перечисления.уб_СостоянияБСО.Испорчен Тогда
					//возможна ситуация, когда:
					//1) полис оформлен
					//2) полис аннулирован
					//3) полис передан в СК как оформленный (неверная последовательность действий 2 и 3)
					//4) это движение передает полис как испорченный
					//нужно разрешить проведение
					Запрос = Новый Запрос(
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ИСТИНА КАК ЕстьДвижение
					|ИЗ
					|	РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
					|ГДЕ
					|	уб_ДвиженияБСО.ВидБСО = &ВидБСО
					|	И уб_ДвиженияБСО.НомерБСО = &НомерБСО
					|	И НЕ уб_ДвиженияБСО.Подтверждено
					|	И уб_ДвиженияБСО.КодОперации = &КодОперации
					|	И уб_ДвиженияБСО.Период <= &Период"
					);
					Запрос.УстановитьПараметр("Период",			СтруктураПараметров.Дата);//СтруктураПараметров.ДатаСреза
					Запрос.УстановитьПараметр("ВидБСО", 		СтрокаТЗ.ВидБСО);
					Запрос.УстановитьПараметр("НомерБСО",   	СтрокаТЗ.НомерБСО);
					Запрос.УстановитьПараметр("КодОперации",    Перечисления.уб_КодыОперацийБСО.АннулированиеПолиса);
					РезультатЗапроса = Запрос.Выполнить();
					Если Не РезультатЗапроса.Пустой() Тогда
						Сообщить("Проведение испорченных бланков после аннулирования разрешено");
						ЗафиксироватьОшибку = Ложь;
					КонецЕсли;
				КонецЕсли;
				Если ЭтоПеремещениеБСО И СтрокаРС.СостояниеБСО = Перечисления.уб_СостоянияБСО.НеПолностьюОформлен и СтрокаРС.Заявка = СтруктураПараметров.Ссылка.СозданНаОсновании  Тогда 
					ЗафиксироватьОшибку = Ложь;
				КонецЕсли;
				
				Если ЗафиксироватьОшибку Тогда
					СОО = СОО + " имеет состояние: '" + Строка(СтрокаРС.СостояниеБСО) + "', положение: '" + Строка(СтрокаРС.ПоложениеБСО) + "'.";
					//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
					СтрокаОшибки 			= ТЗОшибок.Добавить();
					СтрокаОшибки.Ошибка 	= СОО;
					СтрокаОшибки.Строка		= НомерСтроки - 1;
					СтрокаОшибки.Элемент	= "БСО";
					//Отказ = (ЭтоЗаявка = ЛОжь);
					Результат.НеверноеПоложение = Истина;
				КонецЕсли;
			ИначеЕсли ЭтоИнвентаризацияБСО Тогда
				ЕстьВНаличие = Истина;//для инвентаризации
			КонецЕсли;
			Если ЭтоИнвентаризацияБСО Тогда
				Если КонтролироватьНаличиеБСО И НЕ ЕстьВНаличие Тогда
					СтрокаСообщения = "БСО с номером `" + СтрокаТЗ.НомерБСО + "` нет в наличии. Передача невозможна!";
					СтрокаОшибки 			= ТЗОшибок.Добавить();
					СтрокаОшибки.Ошибка 	= СОО;
					СтрокаОшибки.Строка		= НомерСтроки - 1;
					СтрокаОшибки.Элемент	= "БСО";
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЭтоВводНачальныхОстатковБСО Тогда
				Если уб_СЛ.НомерПолисаЗаполняетсяПриПоступлении(СтрокаТЗ.ВидБСО) Тогда
					Если ЗначениеНеЗаполнено(СтрокаТЗ.НомерПолиса) Тогда
						СтрокаСообщения = "Для выбранного вида БСО должно быть заполнено поле НомерПолиса. Строка " + Строка(НомерСтроки);
						//ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
						СтрокаОшибки 			= ТЗОшибок.Добавить();
						СтрокаОшибки.Ошибка 	= СтрокаСообщения;
						СтрокаОшибки.Строка		= НомерСтроки - 1;
						СтрокаОшибки.Элемент	= "БСО";
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли КонтролироватьНаличиеБСО И ЭтоИнвентаризацияБСО Тогда
				СОО = СОО + " не поступало!" + СООхвост;
				//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
				СтрокаОшибки 			= ТЗОшибок.Добавить();
				СтрокаОшибки.Ошибка 	= СОО;
				СтрокаОшибки.Строка		= НомерСтроки - 1;
				СтрокаОшибки.Элемент	= "БСО";
				Отказ = Истина;
				Результат.ОшибкаКонтроляОстатков = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПеремещениеРазрешено(Дата, Агент, Владелец, ПодрПередающего, ПодрПринимающего, послРегистратор, послАгентОтправитель, ПодрВладельца=Неопределено) Экспорт
	
	Если Агент = Владелец Тогда
		Возврат Истина;	
	КонецЕсли;	
	Если ПодрВладельца = Неопределено Тогда
		ПодрВладельца = уб_СС.ПолучитьПодразделениеАгента(Владелец, Дата);
	КонецЕсли;
	Если Агент = ПодрВладельца Тогда
		//БСО передается от лица подразделения, в которое входит агент-владелец 
		Возврат Истина;	
	КонецЕсли;
	Если (ПодрВладельца = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО И ПодрПередающего = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО) Тогда
		//Владелец В ОУБСО и Передающий в ОУБСО. 
		//Т.е. выдача от лица ОУБСО и при этом бланк числится на сотруднике ОУБСО 
		//или выдача от лица сотрудника ОУБСО и при этом бланк числится на ОУБСО 
		Возврат Истина;	
	КонецЕсли;
	тзнРег = ТипЗнч(послРегистратор);
	Полис_ИЛИ_ПриемкаОплат = (Тип("ДокументСсылка.уб_СтраховойПолис") = тзнРег) ИЛИ (Тип("ДокументСсылка.уб_ПриемкаОплат") = тзнРег);
	Владелец_В_ОУБСО_и_Принимающий_в_ОУБСО = (ПодрВладельца = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО И ПодрПринимающего = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
	Если Владелец_В_ОУБСО_и_Принимающий_в_ОУБСО И Полис_ИЛИ_ПриемкаОплат Тогда
		//После проведения из полиса или приемки оплат БСО числится на ОУБСО (Владелец = ОУБСО)
		//Если после оформления полиса мы формируем акт передачи (оформленного) БСО с агента на ОУБСО или сотрудника ОУБСО,
		// то такое перемещение - допустимо
		Возврат Истина;	
	КонецЕсли;	
	ОтправительСовпадает = (послАгентОтправитель = Агент);
	Если ОтправительСовпадает И Полис_ИЛИ_ПриемкаОплат Тогда
		//Аналогично предыдущему случаю, при проведении полиса или приемки оплат отправителем является некий агент
		//(а БСО поступает в ОУБСО)
		//Если после оформления полиса мы формируем акт передачи с того же агента, 
		// то такое перемещение - допустимо
		Возврат Истина;	
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Процедура ПроверкиКоличественныхДвижений(Отказ, Количество, Поставщик, ОргАгент, ВидБСО, Агент, НомерСтроки, Заголовок, СООХвост, ТЗОшибок) Экспорт
	
	//движения количественного учета
	Если Количество = 0 Тогда
		СОО = Строка(ВидБСО) + ": не указано количество для БСО с количественным типом учета. Укажите количество! [строка "+Строка(НомерСтроки)+"] "
		+ СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();					
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Поставщик) Тогда
		СОО = Строка(ВидБСО) + ": не указан Поставщик для БСО с количественным типом учета. Укажите Поставщика!" + СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();					
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(ОргАгент) Тогда
		СОО = Строка(ВидБСО) + ": не указана Организация-Агент для БСО с количественным типом учета. Укажите Организацию-Агента!" + СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();					
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Агент) Тогда
		СОО = Строка(ВидБСО) + ": не указан Агент для БСО с количественным типом учета. Укажите Агента!" + СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();					
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвижениеПоРегистрам(Движения, ТаблицаНомерныхБСО, ТаблицаКоличественныхБСО) Экспорт
	
	Движения.уб_ДвиженияБСО.Очистить();
	Движения.уб_ОстаткиБСО.Очистить();
	Для Каждого СтрокаТЗ Из ТаблицаНомерныхБСО Цикл
		Движение = Движения.уб_ДвиженияБСО.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
	КонецЦикла;
	Для Каждого СтрокаТЗ Из ТаблицаКоличественныхБСО Цикл
		Движение = Движения.уб_ОстаткиБСО.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
	КонецЦикла;
	Движения.уб_ДвиженияБСО.Записать();
	Движения.уб_ОстаткиБСО.Записать();
	
КонецПроцедуры

Функция ПолучитьВыборкуРС(ВыборкаТЧ, Период, Номерной, Отказ, Заголовок, СООХвост, ТЗОшибок) Экспорт
	
	Если Не ПустаяСтрока(ВыборкаТЧ.НомерБСО) Тогда
		Номерной = Истина;
		Возврат ПоследняяЗаписьРегистраДвижений(Период, ВыборкаТЧ.СК, ВыборкаТЧ.ВидБСО, СокрЛП(ВыборкаТЧ.НомерБСО));
	ИначеЕсли ВыборкаТЧ.НомернойУчет Тогда
		СОО = "Не указан номер БСО для [" + Строка(ВыборкаТЧ.ВидБСО) + "] СК: '" + Строка(ВыборкаТЧ.СК) + "', строка " + СокрЛП(ВыборкаТЧ.НомерСтроки) + " " + СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= ВыборкаТЧ.НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	КонецЕсли;
	
КонецФункции // ПолучитьВыборкуРС()

Функция ПолучитьВыборкуРН(СтруктураОтбора, ВыборкаТЧ, Отказ, Заголовок, СООХвост, НеКонтролироватьНаличиеБСОПриПроведении = Ложь, ТЗОшибок) Экспорт
	
	тзРег = уб_СЛ.ПолучитьОстаткиБСО(СтруктураОтбора);
	КолВНаличие = 0;
	ЗаписьРег = Неопределено;
	Если тзРег.Количество() > 0 Тогда
		Результат = тзРег[0];
		КолВНаличие = Результат.Количество;
	КонецЕсли;
	КонтролироватьНаличиеБСО = НЕ ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО = ЛОЖЬ И Не НеКонтролироватьНаличиеБСОПриПроведении;
	Если КонтролироватьНаличиеБСО И ВыборкаТЧ.Количество > КолВНаличие Тогда
		СОО = Строка(ВыборкаТЧ.ВидБСО) + ": требуется передать " + Строка(ВыборкаТЧ.Количество) + "шт, имеется в наличии " + Строка(КолВНаличие) + "шт." + СООхвост;
		//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		СтрокаТЗ 			= ТЗОшибок.Добавить();
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= ВыборкаТЧ.НомерСтроки - 1;
		СтрокаТЗ.Элемент	= "БСО";
		Отказ = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ПолучитьВыборкуРН()

//возвращает булево или структуру значений является ли переданное физлицо руководителем
//РукИлиЗам = "Рук", "Зам", "Все"
Функция СотрудникЯвляетсяРуководителем(
	Знач Сотрудник 		= Неопределено,
	Знач Дата			= Неопределено,
	Знач ТипРезультата 	= "Булево",
	Знач РукИлиЗам		= "Все",
	ПоПодразделению		= Неопределено,
	ВключаяВыбывших     = Ложь
	) Экспорт

	ТекущееФизЛицо = Истина;
	Если Сотрудник = Неопределено Тогда
		Сотрудник = ПараметрыСеанса.уб_ТекущееФизЛицо;
	ИначеЕсли Сотрудник <> ПараметрыСеанса.уб_ТекущееФизЛицо Тогда
		ТекущееФизЛицо = Ложь;
	КонецЕсли;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата()
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РП.Подразделение,
	|	РП.Подразделение.Владелец КАК Организация,
	|	РП.Заместитель
	|ИЗ
	|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ИСТИНА И &УсловиеВТ) КАК РП
	|ГДЕ
	|	РП.Сотрудник = &Сотрудник
	|	И &УсловиеУхода";
	Запрос.УстановитьПараметр("Дата", 		Дата);
	Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
	УсловиеУхода = ?(ВключаяВыбывших, "ИСТИНА", "НЕ РП.Уход");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеУхода", УсловиеУхода);
	СтрокаЗамены = "";
	РукИлиЗам = НРег(РукИлиЗам);
	Если РукИлиЗам = "все" Тогда
		СтрокаЗамены = "ИСТИНА"
	ИначеЕсли РукИлиЗам = "рук" Тогда
		СтрокаЗамены = "НЕ Заместитель"
	Иначе
		СтрокаЗамены = "Заместитель"
	КонецЕсли;
	Если ПоПодразделению <> Неопределено Тогда
		Если СтрокаЗамены <> "" Тогда
			СтрокаЗамены = СтрокаЗамены + " И ";
		КонецЕсли;
		СтрокаЗамены = СтрокаЗамены + "Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", ПоПодразделению);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", СтрокаЗамены);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	ТипРезультата = НРег(ТипРезультата);
	Если ТипРезультата = "булево" Тогда
		//возвращаем является ли сотрудник руководителей любого подразделения
		Результат = Не РезультатЗапроса.Пустой()
	ИначеЕсли ТипРезультата = "тз" Тогда
		//возвращает выгрузку запроса
		Результат = РезультатЗапроса.Выгрузить()
	Иначе
		//возвращает структуру с ключами:
		//Результат - сам факт руководства
		//Организация - организация, в которой сотрудник является руководителем, если их несколько, берется настройка пользователя ОсновнаяОрганизация
		//Подразделение - подразделение, в котором сотрудник является руководителем, если их несколько, берется настройка пользователя ОсновноеПодразделение
		Результат = Новый Структура;
		Результат.Вставить("ЯвляетсяРуководителем", Ложь);
		Результат.Вставить("Организация");
		Результат.Вставить("Подразделение");
		Результат.Вставить("Заместитель");
		Выборка = РезультатЗапроса.Выбрать();
		Организация 	= Неопределено;
		Подразделение 	= Неопределено;
		Заместитель		= Неопределено;
		ОрганизацияВыбрана 		= Ложь;
		ПодразделениеВыбрано 	= Ложь;
		ЗаместительВыбрано		= Ложь;
		Если Выборка.Количество() > 1 Тогда
			Если ТекущееФизЛицо Тогда
				ТекОрганизация = ПараметрыСеанса.уб_ОсновнаяОрганизация;
				ТекПодразделение = ПараметрыСеанса.уб_ОсновноеПодразделение;
			Иначе
				ТекОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Сотрудник, "ОсновнаяОрганизация");
				ТекПодразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Сотрудник, "ОсновноеПодразделение");
			КонецЕсли;
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			Если Не ОрганизацияВыбрана Тогда
				Если Организация = Неопределено Тогда
					Организация = Выборка.Организация
				ИначеЕсли Организация <> Выборка.Организация Тогда
					//сотрудник является руководителем в нескольких организациях - получает основную организацию из настроек
					Организация = ТекОрганизация;
					ОрганизацияВыбрана = Истина;
					Если ПодразделениеВыбрано Тогда
						Прервать
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Не ПодразделениеВыбрано Тогда
				Если Подразделение = Неопределено Тогда
					Подразделение = Выборка.Подразделение
				ИначеЕсли Подразделение <> Выборка.Подразделение Тогда
					//сотрудник является руководителем в нескольких организациях - получает основную организацию из настроек
					Подразделение = ТекПодразделение;
					ПодразделениеВыбрано = Истина;
					Если ОрганизацияВыбрана Тогда
						Прервать
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Не ЗаместительВыбрано Тогда
				Если Выборка.Организация = ТекОрганизация И Выборка.Подразделение = ТекПодразделение Тогда
					Заместитель = Выборка.Заместитель;
					ЗаместительВыбрано = Истина;
				ИначеЕсли Заместитель = Неопределено Тогда
					Заместитель = Выборка.Заместитель;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Организация <> Подразделение Тогда
			Результат.ЯвляетсяРуководителем = Истина;
			Результат.Организация   		= Организация;
			Результат.Подразделение 		= Подразделение;
			Результат.Заместитель			= Заместитель;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ФизЛицоЯвляетсяРуководителем()

Функция РуководительПодразделения(
	Знач Подразделение 	= Неопределено,
	Знач Дата			= Неопределено,
	Знач ТипРезультата	= "ФизЛицо",
	Знач РукИлиЗам		= "Рук",
	ПоСотруднику		= Неопределено,
	ВключаяВыбывших     = Ложь
	) Экспорт

	Если Подразделение = Неопределено Тогда
		Подразделение = ПараметрыСеанса.уб_ОсновноеПодразделение
	КонецЕсли;
	Если Дата = Неопределено Тогда
		Дата = КонецДня(ТекущаяДата())
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РП.Сотрудник,
	|	РП.Заместитель КАК Заместитель,
	|	РП.ПолучаетВознаграждениеЗаРуководство
	|ИЗ
	|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(
	|			&Дата,
	|			Подразделение = &Подразделение
	|				И &УсловиеВТ) КАК РП
	|ГДЕ
	|	&УсловиеГде
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заместитель";
	Запрос.УстановитьПараметр("Подразделение", 	Подразделение);
	Запрос.УстановитьПараметр("Дата",			Дата);
	СтрокаЗамены = ?(ВключаяВыбывших, "ИСТИНА", "НЕ РП.Уход");
	Если ПоСотруднику <> Неопределено Тогда
		СтрокаЗамены = СтрокаЗамены + " И РП.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", ПоСотруднику);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", СтрокаЗамены);
	РукИлиЗам = НРег(РукИлиЗам);
	Если РукИлиЗам = "все" Тогда
		СтрокаЗамены = "ИСТИНА"
	ИначеЕсли РукИлиЗам = "рук" Тогда
		СтрокаЗамены = "НЕ Заместитель"
	Иначе
		СтрокаЗамены = "Заместитель"
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", СтрокаЗамены);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	ТипРезультата = НРег(ТипРезультата);
	Если ТипРезультата = "физлицо" Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Сотрудник
		Иначе
			Результат = Справочники.ФизическиеЛица.ПустаяСсылка()
		КонецЕсли;
	ИначеЕсли ТипРезультата = "тз" Тогда
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	Возврат Результат;

КонецФункции // РуководительПодразделения()

Функция ПодчиненныеРуководителя(
	Знач Сотрудник	= Неопределено, 
	Знач Дата 		= Неопределено,
	Параметры		= Неопределено
	) Экспорт
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник = ПараметрыСеанса.уб_ТекущееФизЛицо
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецДня(ТекущаяДата());
	КонецЕсли;
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию()
	КонецЕсли;
	ЗапросПодчиненныеРуководителя = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросПодчиненныеРуководителя.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПодчиненныеРуководителя.УстановитьПараметр("ПодразделениеГдеРуководитель",уб_Кэшируемые.ПодразделениеГдеРуководитель(Сотрудник,Дата));
	ТекстЗапроса = 
	"Выбрать 
	|	РП.Подразделение КАК Подразделение,
	|	РП.Организация КАК Организация,
	|	РП.Заместитель КАК Заместитель
	|ПОМЕСТИТЬ ПодразделениеГдеРуководитель
	|  из &ПодразделениеГдеРуководитель как РП
	//"ВЫБРАТЬ
	//|	РП.Подразделение КАК Подразделение,
	//|	РП.Подразделение.Владелец КАК Организация,
	//|	РП.Заместитель КАК Заместитель
	//|ПОМЕСТИТЬ ПодразделениеГдеРуководитель
	//|ИЗ
	//|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	//|ГДЕ
	//|	НЕ РП.Уход
	//|	И (РП.Сотрудник = &Сотрудник
	//|			ИЛИ РП.Подразделение В ИЕРАРХИИ
	//|					(ВЫБРАТЬ
	//|						РП.Подразделение КАК Подразделение
	//|					ИЗ
	//|						РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	//|					ГДЕ
	//|						НЕ РП.Уход
	//|						И РП.Сотрудник = &Сотрудник)
	//|				И РП.Заместитель = ЛОЖЬ)
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ПодразделенияОрганизаций.Ссылка,
	//|	ПодразделенияОрганизаций.Владелец,
	//|	ЛОЖЬ
	//|ИЗ
	//|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	//|ГДЕ
	//|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
	//|			(ВЫБРАТЬ
	//|				РП.Подразделение КАК Подразделение
	//|			ИЗ
	//|				РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК РП
	//|			ГДЕ
	//|				НЕ РП.Уход
	//|				И РП.Сотрудник = &Сотрудник
	//|				И РП.Заместитель = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДФ.Агент КАК Сотрудник,
	|	ДФ.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПГР.Заместитель = ЛОЖЬ
	|			ТОГДА &Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеРуководитель,
	|	ВЫБОР
	|		КОГДА ПГР.Заместитель = ИСТИНА
	|			ТОГДА &Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеЗаместитель,
	|	ПГР.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДФ.Агент = &Сотрудник
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Руководитель,
	|	ПГР.Заместитель КАК Заместитель,
	|	ДФ.Выбытие КАК Выбытие,
	|	ДФ.Агент.Наименование КАК СотрудникСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение) КАК ПодразделениеСтрока,
	|	ПРЕДСТАВЛЕНИЕ(ПГР.Организация) КАК ОрганизацияСтрока,
	|	ДФ.Подразделение.ТипПодразделения,
	|	ДФ.Подразделение.НеПроверятьЛичныеЗаявки КАК НеПроверятьЛичныеЗаявки,
	|	ДФ.Подразделение.НеПроверятьСкидки КАК НеПроверятьСкидки,
	|	ДФ.Подразделение.НеОплачиваютВыезд КАК НеОплачиваютВыезд,
	|	ДФ.Подразделение.НеОплачиватьКС,
	|	ДФ.Подразделение.НеПроверятьСрочность КАК НеПроверятьСрочность,
	|	ДФ.Подразделение.НеНуженАндеррайтингЗаявок КАК НеНуженАндеррайтингЗаявок,
	|	ДФ.Подразделение.БезОтделаКонтроля КАК БезОтделаКонтроля,	
	|	ДФ.Агент.ИспытательныйСрок КАК ИспытательныйСрок,
	|	ДФ.Агент.ВзаиморасчетыПрекращены КАК ВзаиморасчетыПрекращены
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), 1 = 1) КАК ДФ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодразделениеГдеРуководитель КАК ПГР
	|		ПО ДФ.Подразделение = ПГР.Подразделение
	|ГДЕ
	|	НЕ ДФ.Выбытие
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДФ.Агент,
	|	ДФ.Подразделение,
	|	ВЫБОР
	|		КОГДА ПГР.Заместитель = ЛОЖЬ
	|			ТОГДА &Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПГР.Заместитель = ИСТИНА
	|			ТОГДА &Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПГР.Организация,
	|	ВЫБОР
	|		КОГДА ДФ.Агент = &Сотрудник
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПГР.Заместитель,
	|	ДФ.Выбытие,
	|	ДФ.Агент.Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение),
	|	ПРЕДСТАВЛЕНИЕ(ПГР.Организация),
	|	ДФ.Подразделение.ТипПодразделения,
	|	ДФ.Подразделение.НеПроверятьЛичныеЗаявки,
	|	ДФ.Подразделение.НеПроверятьСкидки,
	|	ДФ.Подразделение.НеОплачиваютВыезд,
	|	ДФ.Подразделение.НеОплачиватьКС,
	|	ДФ.Подразделение.НеПроверятьСрочность,
	|	ДФ.Подразделение.НеНуженАндеррайтингЗаявок,
	|	ДФ.Подразделение.БезОтделаКонтроля КАК БезОтделаКонтроля,	
	|	ДФ.Агент.ИспытательныйСрок,
	|	ДФ.Агент.ВзаиморасчетыПрекращены
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), 1 = 1) КАК ДФ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодразделениеГдеРуководитель КАК ПГР
	|		ПО ДФ.Подразделение = ПГР.Подразделение
	|ГДЕ
	|	НЕ ДФ.Выбытие";
	Если Параметры.ДополнитьСотрудником Тогда
		ТекстЗапроса = ТекстЗапроса + " Объединить "+"ВЫБРАТЬ
		                                             |	ДФ.Агент,
		                                             |	ДФ.Подразделение,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника.Сотрудник ЕСТЬ NULL 
		                                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                                             |		ИНАЧЕ ПодразделениеСотрудника.Сотрудник
		                                             |	КОНЕЦ КАК Поле1,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника2.Сотрудник ЕСТЬ NULL 
		                                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                                             |		ИНАЧЕ ПодразделениеСотрудника2.Сотрудник
		                                             |	КОНЕЦ КАК Поле2,
		                                             |	ДФ.Подразделение.Владелец,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника.Сотрудник = &Сотрудник
		                                             |			ТОГДА ИСТИНА
		                                             |		ИНАЧЕ ЛОЖЬ
		                                             |	КОНЕЦ КАК Поле3,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника2.Сотрудник = &Сотрудник
		                                             |			ТОГДА ИСТИНА
		                                             |		ИНАЧЕ ЛОЖЬ
		                                             |	КОНЕЦ КАК Поле4,
		                                             |	ЛОЖЬ КАК Выбытие,
		                                             |	ДФ.Агент.Наименование,
		                                             |	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение),
		                                             |	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение.Владелец),
		                                             |	ДФ.Подразделение.ТипПодразделения,
		                                             |	ДФ.Подразделение.НеПроверятьЛичныеЗаявки КАК НеПроверятьЛичныеЗаявки,
		                                             |	ДФ.Подразделение.НеПроверятьСкидки КАК НеПроверятьСкидки,
													 |	ДФ.Подразделение.НеОплачиваютВыезд как НеОплачиваютВыезд,
		                                             |	ДФ.Подразделение.НеОплачиватьКС,
													 |	ДФ.Подразделение.НеПроверятьСрочность как НеПроверятьСрочность,
													 |		ДФ.Подразделение.НеНуженАндеррайтингЗаявок как НеНуженАндеррайтингЗаявок,
													 |		ДФ.Подразделение.БезОтделаКонтроля как БезОтделаКонтроля,
		                                             |	ДФ.Агент.ИспытательныйСрок КАК ИспытательныйСрок,
		                                             |	ДФ.Агент.ВзаиморасчетыПрекращены КАК ВзаиморасчетыПрекращены
		                                             |ИЗ
		                                             |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), Агент = &Сотрудник) КАК ДФ
		                                             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ) КАК ПодразделениеСотрудника
		                                             |		ПО ДФ.Подразделение = ПодразделениеСотрудника.Подразделение
		                                             |			И (ПодразделениеСотрудника.Заместитель = ЛОЖЬ)
		                                             |			И (ПодразделениеСотрудника.Уход = ЛОЖЬ)
		                                             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ) КАК ПодразделениеСотрудника2
		                                             |		ПО ДФ.Подразделение = ПодразделениеСотрудника2.Подразделение
		                                             |			И (ПодразделениеСотрудника2.Заместитель = ИСТИНА)
		                                             |			И (ПодразделениеСотрудника2.Уход = ЛОЖЬ)
		                                             |ГДЕ
		                                             |	НЕ ДФ.Выбытие
		                                             |
		                                             |ОБЪЕДИНИТЬ
		                                             |
		                                             |ВЫБРАТЬ
		                                             |	ДФ.Агент,
		                                             |	ДФ.Подразделение,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника.Сотрудник ЕСТЬ NULL 
		                                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                                             |		ИНАЧЕ ПодразделениеСотрудника.Сотрудник
		                                             |	КОНЕЦ,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника2.Сотрудник ЕСТЬ NULL 
		                                             |			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		                                             |		ИНАЧЕ ПодразделениеСотрудника2.Сотрудник
		                                             |	КОНЕЦ,
		                                             |	ДФ.Подразделение.Владелец,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника.Сотрудник = &Сотрудник
		                                             |			ТОГДА ИСТИНА
		                                             |		ИНАЧЕ ЛОЖЬ
		                                             |	КОНЕЦ,
		                                             |	ВЫБОР
		                                             |		КОГДА ПодразделениеСотрудника2.Сотрудник = &Сотрудник
		                                             |			ТОГДА ИСТИНА
		                                             |		ИНАЧЕ ЛОЖЬ
		                                             |	КОНЕЦ,
		                                             |	ЛОЖЬ,
		                                             |	ДФ.Агент.Наименование,
		                                             |	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение),
		                                             |	ПРЕДСТАВЛЕНИЕ(ДФ.Подразделение.Владелец),
		                                             |	ДФ.Подразделение.ТипПодразделения,
		                                             |	ДФ.Подразделение.НеПроверятьЛичныеЗаявки,
											         |	ДФ.Подразделение.НеПроверятьСкидки,
													 |	ДФ.Подразделение.НеОплачиваютВыезд как НеОплачиваютВыезд,	
		                                             |	ДФ.Подразделение.НеОплачиватьКС,
													 |	ДФ.Подразделение.НеПроверятьСрочность как НеПроверятьСрочность,
													 |		ДФ.Подразделение.НеНуженАндеррайтингЗаявок как НеНуженАндеррайтингЗаявок,
													 |		ДФ.Подразделение.БезОтделаКонтроля как БезОтделаКонтроля,
		                                             |	ДФ.Агент.ИспытательныйСрок,
		                                             |	ДФ.Агент.ВзаиморасчетыПрекращены
		                                             |ИЗ
		                                             |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), Агент = &Сотрудник) КАК ДФ
		                                             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ) КАК ПодразделениеСотрудника
		                                             |		ПО ДФ.Подразделение = ПодразделениеСотрудника.Подразделение
		                                             |			И (ПодразделениеСотрудника.Заместитель = ЛОЖЬ)
		                                             |			И (ПодразделениеСотрудника.Уход = ЛОЖЬ)
		                                             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ) КАК ПодразделениеСотрудника2
		                                             |		ПО ДФ.Подразделение = ПодразделениеСотрудника2.Подразделение
		                                             |			И (ПодразделениеСотрудника2.Заместитель = ИСТИНА)
		                                             |			И (ПодразделениеСотрудника2.Уход = ЛОЖЬ)
		                                             |ГДЕ
		                                             |	НЕ ДФ.Выбытие"
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Руководитель УБЫВ,
	|	СотрудникСтрока";
	ЗапросПодчиненныеРуководителя.Текст = ТекстЗапроса;
	ЗапросПодчиненныеРуководителя.УстановитьПараметр("Дата",		Дата);
	ЗапросПодчиненныеРуководителя.УстановитьПараметр("Сотрудник",	Сотрудник);
	Если Параметры.ВключаяВыбывших Тогда
		ЗапросПодчиненныеРуководителя.Текст = СтрЗаменить(ЗапросПодчиненныеРуководителя.Текст, "НЕ ДФ.Выбытие", "ИСТИНА")
	КонецЕсли;
	Если Параметры.ТолькоТочкиПродаж Тогда
		ЗапросПодчиненныеРуководителя.Текст = СтрЗаменить(ЗапросПодчиненныеРуководителя.Текст, "1 = 1", "Подразделение.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.ТочкаПродаж)")
	КонецЕсли;
	ЕстьСотрудникиПоДокументу = Параметры.СотрудникиПоДокументу.Количество() > 0;
	Параметры.ПодразделенияПоДокументу = Новый СписокЗначений;
	Результат = ЗапросПодчиненныеРуководителя.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Параметры.СписокПодразделений.НайтиПоЗначению(Выборка.Подразделение) = Неопределено
			И (Сотрудник <> Выборка.Сотрудник Или Выборка.Руководитель) Тогда
			Параметры.СписокПодразделений.Добавить(Выборка.Подразделение, Выборка.ПодразделениеСтрока);
			Если Параметры.Свойство("СтруктураТЗПодразделений") Тогда
				//Управляемые формы
				СтруктураСтрокиПодразделения = Новый Структура;
				Для каждого Элемент из Параметры.СтруктураТЗПодразделений Цикл
					СтруктураСтрокиПодразделения.Вставить(Элемент.Ключ,Выборка[Элемент.Ключ]);
				КонецЦикла;
				Параметры.ТЗПодразделений.Добавить(СтруктураСтрокиПодразделения);
			Иначе	
				СтрокаТЗ = Параметры.ТЗПодразделений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
			КонецЕсли;
			//СписокПодразделений.Добавить(Выборка.Подразделение, Выборка.ПодразделениеСтрока);
			Если Параметры.СписокОрганизаций.НайтиПоЗначению(Выборка.Организация) = Неопределено Тогда
				Параметры.СписокОрганизаций.Добавить(Выборка.Организация, Выборка.ОрганизацияСтрока)
			КонецЕсли;
		КонецЕсли;
		Если Сотрудник = Выборка.Сотрудник Тогда
			Параметры.ПодразделениеСотрудника 	= Выборка.Подразделение;
			Параметры.РуководительСотрудника = Выборка.ПодразделениеРуководитель;
			Параметры.ЗаместительРуководителяСотрудника = Выборка.ПодразделениеЗаместитель;
			
			Параметры.ОрганизацияСотрудника		= Выборка.Организация;
			ДобавлятьВСписок = Параметры.СписокСотрудников.НайтиПоЗначению(Сотрудник) = Неопределено;
			Если Выборка.ПодразделениеТипПодразделения = Перечисления.уб_ТипПодразделения.ТочкаПродаж и Выборка.НеПроверятьЛичныеЗаявки = ЛОЖЬ Тогда
				Параметры.ТребуетсяПроверкаЛичныхЗаявок = Истина;
			КонецЕсли;	
			Если НЕ Выборка.НеПроверятьСкидки = Истина Тогда 
				Параметры.ТребуетсяПроверкаСкидок  = Истина;
			КонецЕсли;	
			Параметры.НеОплачиваютВыезд  = Выборка.НеОплачиваютВыезд;
			//Если НЕ Выборка.НеПроверятьСрочность = Истина Тогда 
				Параметры.НеПроверятьСрочность  = Выборка.НеПроверятьСрочность;
				Параметры.НеНуженАндеррайтингЗаявок = Выборка.НеНуженАндеррайтингЗаявок;
				Параметры.БезОтделаКонтроля = Выборка.БезОтделаКонтроля;
			//КонецЕсли;	
			Параметры.ИспытательныйСрок       = Выборка.ИспытательныйСрок;
			Параметры.ВзаиморасчетыПрекращены = Выборка.ВзаиморасчетыПрекращены;
		Иначе
			ДобавлятьВСписок = Истина;
		КонецЕсли;
		Если ДобавлятьВСписок Тогда
			Параметры.СписокСотрудников.Добавить(Выборка.Сотрудник, Выборка.СотрудникСтрока);
			Если Параметры.Свойство("СтруктураТЗ") Тогда
				//Управляемые формы
				СтруктураСтроки = Новый Структура;
				Для каждого Элемент из Параметры.СтруктураТЗ Цикл
					СтруктураСтроки.Вставить(Элемент.Ключ,Выборка[Элемент.Ключ]);
				КонецЦикла;
				Параметры.ТЗ.Добавить(СтруктураСтроки);
			Иначе	
				СтрокаТЗ = Параметры.ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
			КонецЕсли;
			
			Если ЕстьСотрудникиПоДокументу 
				И Параметры.СотрудникиПоДокументу.НайтиПоЗначению(Выборка.Сотрудник) <> Неопределено 
				И Параметры.ПодразделенияПоДокументу.НайтиПоЗначению(Выборка.Подразделение) = Неопределено 
				Тогда
				Параметры.ПодразделенияПоДокументу.Добавить(Выборка.Подразделение, Выборка.ПодразделениеСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Параметры.Сотрудник = Сотрудник;
	Если ЕстьСотрудникиПоДокументу Тогда
		Для Каждого ЭлементСписка Из Параметры.ПодразделенияПоДокументу Цикл
			//СтрокаТЗПодразделений = Параметры.ТЗПодразделений.Найти(ЭлементСписка.Значение, "Подразделение");
			СтрокаТЗПодразделений = Неопределено; 
			Для каждого СтрокаПеребор из Параметры.ТЗПодразделений Цикл
				Если СтрокаПеребор.Подразделение = ЭлементСписка.Значение Тогда
					СтрокаТЗПодразделений = СтрокаПеребор;
					Прервать
				КонецЕсли;	
			КонецЦикла;	
			Если СтрокаТЗПодразделений <> Неопределено Тогда
				Параметры.СтруктураПоДокументу.РукИлиЗам = Истина;
				Если СтрокаТЗПодразделений.Заместитель Тогда
					Параметры.СтруктураПоДокументу.Зам = Истина;
				Иначе
					Параметры.СтруктураПоДокументу.Рук = Истина;
				КонецЕсли;
				//??????????Параметры.ТребуетсяПроверкаСкидок = ЛОЖЬ;
				//Параметры.ТребуетсяПроверкаЛичныхЗаявок = ЛОЖЬ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Параметры.СписокПодразделений.Количество() > 0 Тогда
		Параметры.ЭтоРуководитель = Истина
	КонецЕсли;
	Если Параметры.ДополнитьПредшественниками Тогда
		уб_temp.ДополнитьСписокСотрудниковПредшественниками(Параметры.СписокСотрудников);	
	КонецЕсли;
	ТипРезультата = НРег(Параметры.ТипРезультата);
	Если ТипРезультата = "сз" Тогда
		Результат = Параметры.СписокСотрудников
	ИначеЕсли ТипРезультата = "массив" Тогда	
		
		Результат = Новый Массив;
		Для каждого Структура из Параметры.ТЗ Цикл
			Результат.Добавить(Структура.Сотрудник);
		КонецЦикла;	
		
	Иначе
		Результат = Параметры.ТЗ
	КонецЕсли;	
	//Массив = ТЗ.ВыгрузитьКолонку("Сотрудник");
	//ТЗДляСЗ = ТЗ.Скопировать();
	//ТЗДляСЗ.Свернуть("Подразделение, Организация");
	//Параметры.РезПодразделение.ЗагрузитьЗначения(ТЗДляСЗ.ВыгрузитьКолонку("Подразделение"));
	//ТЗДляСЗ.Свернуть("Организация");
	//Параметры.РезОрганизация.ЗагрузитьЗначения(ТЗДляСЗ.ВыгрузитьКолонку("Организация"));
	////Если Параметры.ДополнитьСотрудником И Массив.Найти(Сотрудник) = Неопределено Тогда
	////	Массив.Вставить(0, Сотрудник);
	////КонецЕсли;	
	//СЗ = Новый СписокЗначений;
	//СЗ.ЗагрузитьЗначения(Массив);
	//Параметры.РезСЗ = СЗ;
	//ТипРезультата = НРег(Параметры.ТипРезультата);
	//Если ТипРезультата = "сз" Тогда
	//	Результат = СЗ
	//ИначеЕсли ТипРезультата = "тз" Тогда
	//	Результат = ТЗ
	//Иначе
	//	Результат = Массив;
	//КонецЕсли;
	Возврат Результат;
	
КонецФункции

//КакМассив 			= Ложь, 
//ДополнитьСотрудником 	= Истина, 
//Подразделение 		= Неопределено, 
//ВключаяВыбывших 		= Ложь,
//ТолькоТочкиПродаж		= Ложь
//ВернутьТЗ             = Ложь
Функция СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию(ОбычныйРежим = ЛОЖЬ) Экспорт

	ОписаниеТипаСтрока50 	= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);
	ОписаниеТипаБулево		= ОбщегоНазначения.ПолучитьОписаниеТиповБулево();
	//
	Структура = Новый Структура;
	//параметры
	Структура.Вставить("ДополнитьСотрудником", 		Истина);
	Структура.Вставить("ВключаяВыбывших",			Ложь);
	Структура.Вставить("ТолькоТочкиПродаж",			Ложь);
	Структура.Вставить("ТипРезультата",				"сз");
	Структура.Вставить("ДополнитьПредшественниками",Ложь);	
	//для заполнения структуры подразделения по документу
	Структура.Вставить("СотрудникиПоДокументу",	Новый СписокЗначений);
	//результат
	Если ОбычныйРежим = Истина Тогда
		ТЗ = Новый ТаблицаЗначений;
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
		ТЗ.Колонки.Добавить("Сотрудник", 		Новый ОписаниеТипов(Массив));
		ТЗ.Колонки.Добавить("СотрудникСтрока", 	ОписаниеТипаСтрока50);
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТЗ.Колонки.Добавить("Подразделение", 		Новый ОписаниеТипов(Массив));
		ТЗ.Колонки.Добавить("ПодразделениеСтрока", 	ОписаниеТипаСтрока50);
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Организации"));
		ТЗ.Колонки.Добавить("Организация", 			Новый ОписаниеТипов(Массив));
		ТЗ.Колонки.Добавить("ОрганизацияСтрока", 	ОписаниеТипаСтрока50);
		ТЗ.Колонки.Добавить("Руководитель", 		ОписаниеТипаБулево);
		ТЗ.Колонки.Добавить("Заместитель",			ОписаниеТипаБулево);
		ТЗ.Колонки.Добавить("Выбытие",				ОписаниеТипаБулево);
		Структура.Вставить("ТЗ", ТЗ);
	Иначе
		Структура.Вставить("ТЗ", Новый Массив);
		Структура.Вставить("СтруктураТЗ", Новый Структура("Сотрудник,СотрудникСтрока,Подразделение,ПодразделениеСтрока,Организация,ОрганизацияСтрока,Руководитель,Заместитель,Выбытие"));
	КонецЕсли;
	
	
	Структура.Вставить("СписокСотрудников",	Новый СписокЗначений);
	Если ОбычныйРежим = Истина Тогда
		ТЗПодразделений = Новый ТаблицаЗначений;
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТЗПодразделений.Колонки.Добавить("Подразделение", 		Новый ОписаниеТипов(Массив));
		ТЗПодразделений.Колонки.Добавить("ПодразделениеСтрока", ОписаниеТипаСтрока50);
		ТЗПодразделений.Колонки.Добавить("Заместитель",			ОписаниеТипаБулево);
		Структура.Вставить("ТЗПодразделений",			ТЗПодразделений);
	Иначе
		Структура.Вставить("ТЗПодразделений", Новый Массив);
		Структура.Вставить("СтруктураТЗПодразделений", Новый Структура("Подразделение,ПодразделениеСтрока,Заместитель"));
	КонецЕсли;
	Структура.Вставить("СписокПодразделений",		Новый СписокЗначений);
	Структура.Вставить("СписокОрганизаций",			Новый СписокЗначений);
	Структура.Вставить("Сотрудник",					Справочники.ФизическиеЛица.ПустаяСсылка());
	Структура.Вставить("ПодразделениеСотрудника",	Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Структура.Вставить("РуководительСотрудника",	Справочники.ФизическиеЛица.ПустаяСсылка());
	Структура.Вставить("ЗаместительРуководителяСотрудника",	Справочники.ФизическиеЛица.ПустаяСсылка());
	Структура.Вставить("ТребуетсяПроверкаЛичныхЗаявок",	ЛОЖЬ);
	Структура.Вставить("ТребуетсяПроверкаСкидок",	    ЛОЖЬ);
	Структура.Вставить("НеПроверятьСрочность",	    ЛОЖЬ);
	Структура.Вставить("НеОплачиваютВыезд",	    ЛОЖЬ);
	Структура.Вставить("НеНуженАндеррайтингЗаявок",	    ЛОЖЬ);
	Структура.Вставить("БезОтделаКонтроля",	    Ложь);
	
	Структура.Вставить("ИспытательныйСрок",	Ложь);
	Структура.Вставить("ВзаиморасчетыПрекращены ",	Ложь);
	Структура.Вставить("ОрганизацияСотрудника",		Справочники.Организации.ПустаяСсылка());
	Структура.Вставить("ЭтоРуководитель",			Ложь);
	//используется, чтобы закэшировать данные в функции ДоступКДанным(), к какому подразделению относится документ
	//по физлицам доступа
	Структура.Вставить("ПодразделенияПоДокументу", 	Новый СписокЗначений);
	СтруктураПоДокументу = Новый Структура;
	СтруктураПоДокументу.Вставить("РукИлиЗам", 	Ложь);
	СтруктураПоДокументу.Вставить("Рук", 		Ложь);
	СтруктураПоДокументу.Вставить("Зам",        Ложь);
	Структура.Вставить("СтруктураПоДокументу", СтруктураПоДокументу);
	Возврат Структура;

КонецФункции // СтруктураПараметров()

// процедуры НачалоВыбора

Процедура НачалоВыбора(
	Владелец,
	СтандартнаяОбработка	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры 				= Неопределено
	) Экспорт

	Перем Группа, Менеджер, Заголовок, ИерархическийПросмотр, ИмяОбъекта, РезультатФормыВыбора, Фильтровать;
	
	ТипЗнчВладелец = ТипЗнч(Владелец);
	ТипЗнчВладелецПолеВвода = ТипЗнчВладелец = Тип("ПолеВвода") Или ТипЗнчВладелец = Тип("ПолеВыбора"); 
	ТипДругоеПоле = ТипЗнчВладелец = Тип("ПолеФормы") ;
	Если Не (ТипЗнчВладелецПолеВвода или ТипДругоеПоле ) Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.НачалоВыбора(): поле-владелец некорректного типа: " + ТипЗнч(Владелец), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	Заголовок 	= "";
	Фильтровать = Ложь;
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
	КонецЕсли;
	Если ТипДругоеПоле Тогда
		Если Параметры.ОтображениеМеню.ФизическиеЛица = Истина Тогда
			Значение    = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			ТипЗначения = Тип("СправочникСсылка.ФизическиеЛица");
		Иначе//Если Параметры.ОтображениеМеню.Контрагенты = Истина Тогда	
			Если Параметры.Свойство("Значение") Тогда
				Значение = Параметры.Значение;
			Иначе	
				Значение = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			КонецЕсли;	
			ТипЗначения = Тип("СправочникСсылка.Контрагенты");
		КонецЕсли;
	Иначе	
		Значение 	= Владелец.Значение;
		ТипЗначения = Владелец.ТипЗначения;
	КонецЕсли;	
	Заголовок	= "";
	ОткрыватьБезМеню = Ложь;
	ОтображениеМеню = Параметры.ОтображениеМеню;
	Если Не ПустаяСтрока(НастройкиМеню) Тогда
		НастройкиМеню = НРег(СокрЛП(НастройкиМеню));
		Массив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(НастройкиМеню, ",");
		Счетчик = 0;
		Для Каждого ЭлементМассива Из Массив Цикл
			Счетчик = Счетчик + 1;
			ЭлементМассива = СокрЛП(ЭлементМассива);
			Если Счетчик = 1 И ЭлементМассива = "все" Тогда
				Параметры.ВыборИзМеню = Истина;
				Для Каждого КлючИЗначение Из ОтображениеМеню Цикл
					ОтображениеМеню[КлючИЗначение.Ключ] = Истина;
				КонецЦикла;
			Иначе
				МассивУсловия = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ЭлементМассива, " ");
				УсловиеНе = Ложь;
				Для Каждого ЭлементМассиваУсловия Из МассивУсловия Цикл
					ЭлементМассиваУсловия = СокрЛП(ЭлементМассиваУсловия);
					Если ЭлементМассиваУсловия = "не" Тогда
						УсловиеНе = Не УсловиеНе
					Иначе
						Если ОтображениеМеню.Свойство(ЭлементМассиваУсловия) Тогда
							Параметры.ВыборИзМеню = Истина;
							ОтображениеМеню[ЭлементМассиваУсловия] = Не УсловиеНе;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого КлючИЗначение Из ОтображениеМеню Цикл
			Если ОтображениеМеню[КлючИЗначение.Ключ] Тогда
				Параметры.ВыборИзМеню = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Значение) И Не Параметры.ВыборТипа Тогда
		ОткрыватьБезМеню = Истина;
		НачальноеЗначениеВыбора = Значение;
	ИначеЕсли Параметры.ВыборИзМеню и ОтображениеМеню.Количество() = 1  Тогда	
		ОткрыватьБезМеню = Истина;
		НачальноеЗначениеВыбора = Значение;
	ИначеЕсли Параметры.ВыборИзМеню Тогда
		// выводим меню для составного типа
		Меню = Новый СписокЗначений;
		Если Параметры.ЗадействоватьОграничениеТипа И ТипЗнчВладелецПолеВвода Тогда
			// у поля выбора нет ограничения типа
			ОграничениеТипа = Владелец.ОграничениеТипа;
		КонецЕсли;
		Если ОграничениеТипа = Неопределено Тогда
			ЕстьОграничениеТипа = Ложь;
		Иначе
			ЕстьОграничениеТипа = ОграничениеТипа.Типы().Количество() > 0;
		КонецЕсли;
		// TODO может сделать разделитель между элементами меню по типу значения?
		// или TODO сортировать элементы как они были раньше?				
		Если Параметры.МенюПоТипам.Свойство("ФизическиеЛица") и Параметры.МенюПоТипам.ФизическиеЛица = Неопределено Тогда
			Если ТипЗнчВладелецПолеВвода Тогда
				Тип = Тип("СправочникСсылка.ФизическиеЛица");
				ЕстьТипФизическиеЛица = (ТипЗначения.СодержитТип(Тип("Строка")) и НЕ Прав(Владелец.Имя,2)="СК" ) или (ТипЗначения.СодержитТип(Тип) И (Не ЕстьОграничениеТипа Или ОграничениеТипа.СодержитТип(Тип))) ;
			Иначе
				// у полей выбора только произвольный тип значения. Требуется обязательно прописывать вручную доступные типы
				// с помощью параметра МенюПоТипам (или брать возможные типы из списка значений)
				ЕстьТипФизическиеЛица = Истина;
			КонецЕсли;
		Иначе
			ЕстьТипФизическиеЛица = Параметры.МенюПоТипам.ФизическиеЛица;
		КонецЕсли;
		Если Параметры.МенюПоТипам.Свойство("Пользователи") и Параметры.МенюПоТипам.Пользователи = Неопределено Тогда
			Если ТипЗнчВладелецПолеВвода Тогда
				Тип = Тип("СправочникСсылка.Пользователи");
				ЕстьТипПользователи = ТипЗначения.СодержитТип(Тип) И (Не ЕстьОграничениеТипа Или ОграничениеТипа.СодержитТип(Тип));
			Иначе
				ЕстьТипПользователи = Истина;
			КонецЕсли;
		Иначе
			ЕстьТипПользователи = Параметры.МенюПоТипам.Пользователи;
		КонецЕсли;
		Если Параметры.МенюПоТипам.Свойство("ПодразделенияОрганизаций") и Параметры.МенюПоТипам.ПодразделенияОрганизаций = Неопределено Тогда
			Если ТипЗнчВладелецПолеВвода Тогда
				Тип = Тип("СправочникСсылка.ПодразделенияОрганизаций");
				ЕстьТипПодразделения = ТипЗначения.СодержитТип(Тип) И (Не ЕстьОграничениеТипа Или ОграничениеТипа.СодержитТип(Тип));
			Иначе
				ЕстьТипПодразделения = Истина;
			КонецЕсли;
		Иначе
			ЕстьТипПодразделения = Параметры.МенюПоТипам.ПодразделенияОрганизаций
		КонецЕсли;
		Если Параметры.МенюПоТипам.Свойство("Контрагенты") и  Параметры.МенюПоТипам.Контрагенты = Неопределено Тогда
			Если ТипЗнчВладелецПолеВвода Тогда
				Тип = Тип("СправочникСсылка.Контрагенты");
				ЕстьТипКонтрагенты = (ТипЗначения.СодержитТип(Тип("Строка")) и Прав(Владелец.Имя,2)="СК") или (ТипЗначения.СодержитТип(Тип) И (Не ЕстьОграничениеТипа Или ОграничениеТипа.СодержитТип(Тип)));
			Иначе
				ЕстьТипКонтрагенты = Истина;
			КонецЕсли;
		Иначе
			ЕстьТипКонтрагенты = Параметры.МенюПоТипам.Контрагенты;
		КонецЕсли;
		Если ЕстьТипФизическиеЛица Тогда
			Если ОтображениеМеню.ФизическиеЛица Тогда
				ЭлементПоУмолчанию = Меню.Добавить("ФизическиеЛица", "Физическое Лицо",, БиблиотекаКартинок.ЗначокФизическоеЛицо16);
			КонецЕсли;
		КонецЕсли;
		Если ЕстьТипПользователи Тогда
			Если ОтображениеМеню.Пользователи Тогда
				СтрокаСЗ = Меню.Добавить("Пользователи", "Пользователь",, БиблиотекаКартинок.Пользователь);
				Если ЭлементПоУмолчанию = Неопределено Тогда
					ЭлементПоУмолчанию = СтрокаСЗ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьТипФизическиеЛица Тогда
			Если ОтображениеМеню.МолПоБСО Тогда
				Меню.Добавить("МОЛпоБСО", "Ответственный ОУ БСО",, БиблиотекаКартинок.уб_ОтветственныйБСО);
			КонецЕсли;
		КонецЕсли;
		Если ЕстьТипПодразделения Тогда
			Если ОтображениеМеню.ОУБСО Тогда
				Меню.Добавить("ОУБСО", "ОУ БСО",, БиблиотекаКартинок.уб_Подразделения);
			КонецЕсли;	
		КонецЕсли;
		Если ЕстьТипКонтрагенты Тогда
			Если ОтображениеМеню.Контрагенты Тогда
				СтрокаСЗ = Меню.Добавить("Контрагенты", "Юридическое Лицо",, БиблиотекаКартинок.ЗначокКонтрагент16);
				Если ЭлементПоУмолчанию = Неопределено Тогда
					ЭлементПоУмолчанию = СтрокаСЗ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьТипПодразделения Тогда
			Если ОтображениеМеню.ПодразделенияОрганизаций Тогда
				СтрокаСЗ = Меню.Добавить("ПодразделенияОрганизаций", "Подразделение",, БиблиотекаКартинок.уб_Подразделения);
				Если ЭлементПоУмолчанию = Неопределено Тогда
					ЭлементПоУмолчанию = СтрокаСЗ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьТипФизическиеЛица Тогда
			Если ОтображениеМеню.СотрудникиБСО Тогда
				Меню.Добавить("СотрудникиБСО", "Сотрудники отдела БСО");
			КонецЕсли;
			Если ОтображениеМеню.Менеджеры Тогда
				Меню.Добавить("Менеджеры", "Менеджеры");
			КонецЕсли;
			Если ОтображениеМеню.Курьеры Тогда
				Меню.Добавить("Курьеры", "Курьеры");
			КонецЕсли;	
		КонецЕсли;
		МенюКоличество = Меню.Количество();
		Если МенюКоличество = 0 Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.НачалоВыбора(): в меню выбора нет ни одного элемента. Имя поля: " + Владелец.Имя, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
			СтандартнаяОбработка = Истина;
			Возврат;
		Иначе
			Если МенюКоличество = 1 Тогда
				ВыбранныйЭлемент = Меню[0];
			Иначе
				ВыбранныйЭлемент = Меню.ВыбратьЭлемент("Выберите тип", ЭлементПоУмолчанию);
				Если ВыбранныйЭлемент = Неопределено Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
			ВыбранныйЭлементЗначение = ВыбранныйЭлемент.Значение;
			// получение заголовка формы по значению меню
			Если Параметры.ЗаголовкиФорм <> Неопределено Тогда
				Если Параметры.ЗаголовкиФорм.Свойство(ВыбранныйЭлементЗначение) Тогда
					Заголовок = Параметры.ЗаголовкиФорм[ВыбранныйЭлементЗначение];
				ИначеЕсли Параметры.ЗаголовкиФорм.Свойство("ПоУмолчанию") Тогда
					Заголовок = Параметры.ЗаголовкиФорм.ПоУмолчанию
				КонецЕсли;
			КонецЕсли;
			Если ВыбранныйЭлементЗначение = "ФизическиеЛица" Тогда
				ИерархическийПросмотр   = Параметры.ИерархическийПросмотр[ВыбранныйЭлементЗначение];
				ИмяОбъекта				= ВыбранныйЭлементЗначение;
			ИначеЕсли ВыбранныйЭлемент.Значение = "Контрагенты" Тогда 		
				ИерархическийПросмотр	= Параметры.ИерархическийПросмотр[ВыбранныйЭлементЗначение];
				ИмяОбъекта				= ВыбранныйЭлементЗначение;
			ИначеЕсли ВыбранныйЭлемент.Значение = "ПодразделенияОрганизаций" Тогда 		
				ИмяОбъекта 	= ВыбранныйЭлементЗначение;
				Фильтровать = Истина;
			ИначеЕсли ВыбранныйЭлемент.Значение = "Пользователи" Тогда
				ИерархическийПросмотр	= Параметры.ИерархическийПросмотр[ВыбранныйЭлементЗначение];
				ИмяОбъекта				= ВыбранныйЭлементЗначение;
			ИначеЕсли ВыбранныйЭлемент.Значение = "МОЛпоБСО" Тогда 
				ИмяОбъекта = "ФизическиеЛица";
				РезультатФормыВыбора = уб_КЭШируемые.ПолучитьМОЛпоБСО(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
			ИначеЕсли ВыбранныйЭлемент.Значение = "ОУБСО" Тогда 
				ИмяОбъекта = "ПодразделенияОрганизаций";
				РезультатФормыВыбора = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;		
				Если ТипЗнч(РезультатФормыВыбора) <> Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Некорректный тип у предопределенного элемента справочника констант уб_ОсновноеПодразделениеПоУчетуБСО", ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
					СтандартнаяОбработка = Истина;
					Возврат;
				КонецЕсли;
			ИначеЕсли ВыбранныйЭлемент.Значение = "СотрудникиБСО" Тогда
				ИмяОбъекта = "ФизическиеЛица";
				ИерархическийПросмотр	= Параметры.ИерархическийПросмотр[ИмяОбъекта];
				Группа = Справочники.ФизическиеЛица.ОУБСО;
			ИначеЕсли ВыбранныйЭлемент.Значение = "Курьеры" Тогда
				ИмяОбъекта = "ФизическиеЛица";
				ИерархическийПросмотр = Параметры.ИерархическийПросмотр[ИмяОбъекта];
				Группа = Справочники.ФизическиеЛица.Курьеры;
			ИначеЕсли ВыбранныйЭлемент.Значение = "Менеджеры" Тогда
				ИмяОбъекта = "ФизическиеЛица";
				ИерархическийПросмотр = Параметры.ИерархическийПросмотр[ИмяОбъекта];
				Группа = Справочники.ФизическиеЛица.Агенты;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Значение = Неопределено Тогда
		// нет меню, составной тип, не ясно что выбирать
		СтандартнаяОбработка = Истина;
		Возврат;
	Иначе
		ОткрыватьБезМеню = Истина;
	КонецЕсли;
	Если ОткрыватьБезМеню Тогда
		// открываем конкретный справочник
		ИмяОбъекта = ИмяОбъектаПоСсылке(Значение);
		Если ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
			Попытка
			Если Параметры.ЗаголовкиФорм.Свойство(ИмяОбъекта) И Не ПустаяСтрока(Параметры.ЗаголовкиФорм[ИмяОбъекта]) Тогда
				Заголовок = Параметры.ЗаголовкиФорм[ИмяОбъекта];
			ИначеЕсли Не ПустаяСтрока(Параметры.ЗаголовкиФорм.ПоУмолчанию) Тогда
				Заголовок = Параметры.ЗаголовкиФорм.ПоУмолчанию
			КонецЕсли;
		Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Если ИмяОбъекта = "" Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.НачалоВыбора(): не получено имя объекта, имя поля: " + Владелец.Имя, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		СтандартнаяОбработка = Истина;
		Возврат;
	Иначе
		Менеджер = Справочники[ИмяОбъекта];
	КонецЕсли;
	// принудительные безусловные параметры
	Если Не ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	Если Параметры.Группа <> Неопределено Тогда
		Группа = Параметры.Группа
	КонецЕсли;
	Если Параметры.Фильтровать <> Неопределено Тогда
		Фильтровать = Параметры.Фильтровать
	КонецЕсли;
	Если Параметры.ИмяФормыВыбора <> Неопределено Тогда
		ИмяФормы = Параметры.ИмяФормыВыбора;
	Иначе
		// при Неопределено открывается стандартная форма выбора
		ИмяФормы = Параметры.ИменаФормВыбора[ИмяОбъекта];
	КонецЕсли;
	//
	Если Параметры.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
		Форма = Менеджер.ПолучитьФормуВыбораГруппы(ИмяФормы, Владелец);
	Иначе
		Форма = Менеджер.ПолучитьФормуВыбора(ИмяФормы, Владелец);
		Если ТипЗнч(Владелец) = ТИп("ПолеВвода") и ЗначениеЗаполнено(Владелец.Значение) Тогда
			Попытка
				Форма.ТекущийЭлементСписка =  Владелец.Значение;
				Форма.Элементы.Список.ТекущаяСтрока = Владелец.Значение;
			Исключение	
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;
	Если Форма = Неопределено Тогда
		// возможно, недостаточно прав
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_СС.НачалоВыбора(): ошибка инициализации формы выбора объекта " + ИмяОбъекта + ". ТекущийПользователь: " + ПараметрыСеанса.ТекущийПользователь + ?(ИмяФормы = Неопределено, "", ", Имя формы: " + ИмяФормы), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	Если РезультатФормыВыбора = Неопределено Тогда
		Если ТипДругоеПоле или ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
			//ОтборПоКонтрагенту = Новый Структура("Родитель,ПометкаУдаления", Параметры.Группа,ЛОЖЬ);
			//ПараметрыФормы = Новый Структура("Отбор", ОтборПоКонтрагенту);
			//ПараметрыФормы.Вставить("Отбор",ОтборПоКонтрагенту);
			Список = Форма.Список;
			Если ЗначениеЗаполнено(Параметры.Группа) Тогда
				Форма.Элементы.Список.ТекущийРодитель = Параметры.Группа;
				//Форма.Элементы.Список.
				Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
				уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", Параметры.Группа, ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
			КонецЕсли;	
			уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", ЛОЖЬ, ВидСравненияКомпоновкиДанных.Равно,,Истина);
			уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоГруппа", ЛОЖЬ, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Иначе	
			// подгатавливаем форму выбора к открытию
			эфСправочникСписок = Форма.ЭлементыФормы.Найти("СправочникСписок");
			Если эфСправочникСписок = Неопределено Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найден элемент формы справочник список у формы выбора объекта " + ИмяОбъекта, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
				СтандартнаяОбработка = Истина;
				Возврат; 
			КонецЕсли;
			Если ИерархическийПросмотр <> Неопределено Тогда
				эфСправочникСписок.ИерархическийПросмотр = ИерархическийПросмотр;
			КонецЕсли;
			Если Группа = Неопределено Тогда
				Группа = Параметры.ГруппыПоУмолчанию[ИмяОбъекта];
			КонецЕсли;
			Если Группа <> Неопределено Тогда			
				Если Фильтровать Тогда
					эфСправочникДерево = Форма.ЭлементыФормы.Найти("СправочникДерево");
					//Если эфСправочникДерево = Неопределено Тогда
					// отсутствие этого элемента формы не критично
					//ТекстОшибки = "Не найдены элементы формы: СправочникДерево " + ?(эфСправочникСписок = Неопределено, ", СправочникСписок ", "") + " у формы выбора объекта " + ИмяОбъекта;
					эфСправочникСписок.НастройкаОтбора.Ссылка.Доступность = Истина;
					ОтборСсылка = эфСправочникСписок.Значение.Отбор.Ссылка;
					ОтборСсылка.Использование 	= Истина;
					ОтборСсылка.ВидСравнения 	= ВидСравнения.ВИерархии;
					ОтборСсылка.Значение		= Группа;
					Если эфСправочникДерево <> Неопределено Тогда
						эфСправочникДерево.НастройкаОтбора.Ссылка.Доступность = Истина;
						ОтборСсылка = эфСправочникДерево.Значение.Отбор.Ссылка;
						ОтборСсылка.Использование 	= Истина;
						ОтборСсылка.ВидСравнения 	= ВидСравнения.ВИерархии;
						ОтборСсылка.Значение		= Группа;
					КонецЕсли;
				КонецЕсли;
				эфРодительВерхнегоУровня = Форма.ЭлементыФормы.Найти("РодительВерхнегоУровня");
				Если эфРодительВерхнегоУровня <> Неопределено Тогда
					эфРодительВерхнегоУровня.Значение = Группа;
				КонецЕсли;
				эфСправочникСписок.РодительВерхнегоУровня = Группа;
			КонецЕсли;
			//TODO если группа не совпадает с начальным значением выбора?
			Если НачальноеЗначениеВыбора <> Неопределено Тогда
				Форма.НачальноеЗначениеВыбора = НачальноеЗначениеВыбора;
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.Открыта() Тогда
			Форма.Активизировать();
		Иначе
			Если Не ПустаяСтрока(Заголовок) Тогда
				Форма.Заголовок = Заголовок;
			КонецЕсли;
			Если ТипДругоеПоле Тогда
				СтандартнаяОбработка = Ложь;
				Форма.Открыть();
				//ОткрытьФорму(Форма.ИмяФормы,ПараметрыФормы,Владелец,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе	
				Попытка
					Форма.ПараметрВыборГруппИЭлементов = Параметры.ПараметрВыборГруппИЭлементов;
					
					Если Параметры.Свойство("СтрокаПоиска") Тогда
						Форма.ЭлементыФормы.эуПоискНаименование.Value = Параметры.СтрокаПоиска;
					КонецЕсли;	
				Исключение
				КонецПопытки;
				Попытка
					Форма.Открыть()
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка открытия формы выбора объекта " + ИмяОбъекта, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
					СтандартнаяОбработка = Истина;
					Возврат;
				КонецПопытки
			КонецЕсли;	
				
			
		КонецЕсли;
	Иначе
		// результат есть, оповещаем о выборе
		Форма.ОповеститьОВыборе(РезультатФормыВыбора);
	КонецЕсли;

КонецПроцедуры

Процедура ВыборАгента(
	Владелец, 
	СтандартнаяОбработка 	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры				= Неопределено
	) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
	КонецЕсли;
	// заголовки форм
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.ПоУмолчанию) Тогда
		Параметры.ЗаголовкиФорм.ПоУмолчанию = "Форма выбора Агента";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.ФизическиеЛица) Тогда
		Параметры.ЗаголовкиФорм.ФизическиеЛица = "Форма выбора Агента - физического лица";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.Контрагенты) Тогда
		Параметры.ЗаголовкиФорм.Контрагенты = "Форма выбора Контрагента (в качестве Агента)";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.ПодразделенияОрганизаций) Тогда
		Параметры.ЗаголовкиФорм.ПодразделенияОрганизаций = "Форма выбора Подразделения (в качестве Агента)";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ИменаФормВыбора.ПодразделенияОрганизаций) Тогда
		// используется нестандартная форма выбора
		// TODO привести к одной форме
		Параметры.ИменаФормВыбора.ПодразделенияОрганизаций = "ФормаВыбораДляБСО";
	КонецЕсли;
	Если Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудников;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Группа;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.ГруппыПоУмолчанию.Контрагенты = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаАгентовЮрЛиц;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.Контрагенты") Тогда
			Параметры.ГруппыПоУмолчанию.Контрагенты = Группа;
		КонецЕсли;
	КонецЕсли;
	НачалоВыбора(Владелец, СтандартнаяОбработка, НастройкиМеню, Параметры);

КонецПроцедуры

Процедура ВыборСтрахователя(
	Владелец,
	СтандартнаяОбработка 	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры				= Неопределено
	) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
	КонецЕсли;
	// заголовки форм
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.ПоУмолчанию) Тогда
		Параметры.ЗаголовкиФорм.ПоУмолчанию = "Форма выбора Страхователя";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.ФизическиеЛица) Тогда
		Параметры.ЗаголовкиФорм.ФизическиеЛица = "Форма выбора Страхователя - физического лица";
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовкиФорм.Контрагенты) Тогда
		Параметры.ЗаголовкиФорм.Контрагенты = "Форма выбора Страхователя - юридического лица";
	КонецЕсли;
	Если Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейФизЛиц;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Группа;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.ГруппыПоУмолчанию.Контрагенты = Неопределено Тогда
		Группа = Справочники.Контрагенты.ПустаяСсылка();//ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейЮрЛиц;
		//Если ТипЗнч(Группа) = Тип("СправочникСсылка.Контрагенты") Тогда
		//	Параметры.ГруппыПоУмолчанию.Контрагенты	= Группа;
		//КонецЕсли;
	КонецЕсли;
	НачалоВыбора(Владелец, СтандартнаяОбработка, НастройкиМеню, Параметры);

КонецПроцедуры

Процедура ВыборКурьера(
	Владелец, 
	СтандартнаяОбработка	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры				= Неопределено
	) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
		Параметры.ОтображениеМеню.Контрагенты              = Ложь;
		Параметры.ОтображениеМеню.ПодразделенияОрганизаций = Ложь;
		Параметры.ОтображениеМеню.Пользователи             = Ложь;
		Параметры.ИмяФормыВыбора =  "ФормаВыбораУправляемая";
		Параметры.Группа = Справочники.ФизическиеЛица.Курьеры;
		Параметры.ИерархическийПросмотр.ФизическиеЛица = ЛожЬ;
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Параметры.ЗаголовокФормы = "Форма выбора курьера";
	КонецЕсли;
	Если Параметры.Группа = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудниковКурьеров;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Параметры.Группа = Справочники.ФизическиеЛица.Курьеры;
		КонецЕсли;
	КонецЕсли;
	НачалоВыбора(Владелец, СтандартнаяОбработка, НастройкиМеню, Параметры);

КонецПроцедуры

Процедура ВыборСотрудника(
	Владелец,
	СтандартнаяОбработка	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры				= Неопределено
	) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
		Параметры.ОтображениеМеню.Контрагенты              = Ложь;
		Параметры.ОтображениеМеню.ПодразделенияОрганизаций = Ложь;
		Параметры.ОтображениеМеню.Пользователи             = Ложь;
		Параметры.ИмяФормыВыбора =  "ФормаВыбораУправляемая";
		Параметры.Группа = Справочники.ФизическиеЛица.Сотрудники;
		Параметры.ИерархическийПросмотр.ФизическиеЛица = ЛожЬ;
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Параметры.ЗаголовокФормы = "Форма выбора сотрудника";
	КонецЕсли;
	
	Если Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудников;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Параметры.ГруппыПоУмолчанию.ФизическиеЛица = Группа;
		КонецЕсли;
	КонецЕсли;
	
	НачалоВыбора(Владелец, СтандартнаяОбработка, НастройкиМеню, Параметры);
	
КонецПроцедуры

Процедура ВыборПоставщика(
	Владелец,
	СтандартнаяОбработка	= Неопределено,
	Знач НастройкиМеню		= "",
	Параметры				= Неопределено
	) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыНачалаВыбора();
	КонецЕсли;
	Если Параметры.Группа = Неопределено Тогда
		Группа = ПараметрыСеанса.уб_Константы.уб_ГруппаСК;
		Если ТипЗнч(Группа) = Тип("СправочникСсылка.Контрагенты") Тогда
			Параметры.Группа = Группа;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Параметры.ЗаголовокФормы = "Форма выбора поставщика"; // для выбора ск и поставщика открывается одна группа СК
	КонецЕсли;
	НачалоВыбора(Владелец, СтандартнаяОбработка, НастройкиМеню, Параметры);

КонецПроцедуры

Функция ПараметрыНачалаВыбора() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("ТипВыбора", "");
	// принудительный заголовок формы, безусловно
	Параметры.Вставить("ЗаголовокФормы", "");
	// принудительная группа формы, безусловно
	Параметры.Вставить("Группа");
	// расчетный показатель, будет ли использоваться (не параметр!)
	Параметры.Вставить("ВыборИзМеню",  Ложь);
	// структура, определяющая типы поля для частног8о формирования подменю
	// к примеру, поле типа строка, и частная обработка выбора, требуется включить подменю физических лиц
	// если Неопределено каждое из значений, то рассчитывается автоматически (по умолчанию)
	Структура = Новый Структура;
	Структура.Вставить("ФизическиеЛица");
	Структура.Вставить("Контрагенты");
	Структура.Вставить("ПодразделенияОрганизаций");
	Структура.Вставить("Пользователи");
	Параметры.Вставить("МенюПоТипам", Структура);
	// принудительный выбор типа, даже если значение заполнено
	Параметры.Вставить("ВыборТипа", Ложь);
	// принудительное имя формы выбора. Составного типа: строка и ОбъектМетаданных.Форма
	Параметры.Вставить("ИмяФормыВыбора");
	// будет ли установлен отбор в иерархии либо нет. Если булево, то принудительно устанавливается, иначе расчетный показатель
	Параметры.Вставить("Фильтровать");
	// структура формирования меню. Истина только для самих справочников (можно отключать), также и добавлять настроенные ниже
	// можно заполнять при помощи данной структуры параметров, так и строкой вызова любой функции начала выбора,
	// например "МолПоБСО, не Контрагенты"
	Структура = Новый Структура;
	Структура.Вставить("Контрагенты",				Истина);
	Структура.Вставить("ФизическиеЛица",			Истина);
	Структура.Вставить("ПодразделенияОрганизаций", 	Истина);
	Структура.Вставить("Пользователи",				Истина);
	Структура.Вставить("МОЛпоБСО", 					Ложь);
	Структура.Вставить("ОУБСО",						Ложь);
	Структура.Вставить("СотрудникиБСО", 			Ложь);
	Структура.Вставить("Менеджеры",					Ложь);
	Структура.Вставить("Курьеры", 					Ложь);	
	Параметры.Вставить("ОтображениеМеню", 			Структура);
	// выбор групп и элементов. По умолчанию - только элементы
	Параметры.Вставить("ПараметрВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	// проверять ограничение типа элемента либо нет
	Параметры.Вставить("ЗадействоватьОграничениеТипа", Истина);
	// настройка иерархического просмотра в разрезе различных справочников
	Структура = Новый Структура;
	Структура.Вставить("ФизическиеЛица", 		Истина);
	Структура.Вставить("Контрагенты",			Истина);
	Структура.Вставить("Пользователи",			Истина);
	Параметры.Вставить("ИерархическийПросмотр", Структура);
	// Группы верхнего уровня по умолчанию
	Структура = Новый Структура;
	Структура.Вставить("ФизическиеЛица");
	Структура.Вставить("Контрагенты");
	Структура.Вставить("ПодразделенияОрганизаций");
	Структура.Вставить("Пользователи");
	Параметры.Вставить("ГруппыПоУмолчанию", Структура);
	// Заголовки форм выбора. "" для расчета, или для не использования.
	Структура = Новый Структура;
	Структура.Вставить("ПоУмолчанию", 				""); // используется если не найден конкретный заголовок для типа справочника
	Структура.Вставить("ФизическиеЛица",    		"");
	Структура.Вставить("ПодразделенияОрганизаций",  "");
	Структура.Вставить("Контрагенты",				"");
	Структура.Вставить("Пользователи",				"");
	Параметры.Вставить("ЗаголовкиФорм", Структура);
	// имена форм. Если заполнены, тогда устанавливаются формы выбора не по умолчанию
	Структура = Новый Структура;
	Структура.Вставить("ФизическиеЛица");
	Структура.Вставить("ПодразделенияОрганизаций");
	Структура.Вставить("Контрагенты");
	Структура.Вставить("Пользователи");
	Структура.Вставить("СтрокаПоиска","");
	Параметры.Вставить("ИменаФормВыбора", Структура);
	Возврат Параметры;

КонецФункции // ПараметрыПоТипуНачалаВыбора()

Функция ИмяОбъектаПоСсылке(Ссылка);
	
	Рез = "";
	ТипЗнчСсылка = ТипЗнч(Ссылка);
	Если ТипЗнчСсылка = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Рез = "ФизическиеЛица"
	ИначеЕсли ТипЗнчСсылка = Тип("СправочникСсылка.Контрагенты") Тогда
		Рез = "Контрагенты"
	ИначеЕсли ТипЗнчСсылка = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Рез = "ПодразделенияОрганизаций";
	ИначеЕсли ТипЗнчСсылка = Тип("СправочникСсылка.Пользователи") Тогда
		Рез = "Пользователи";
	КонецЕсли;
	Возврат Рез;
	//	ИмяОбъекта = Ссылка.Метаданные().Имя;
	//	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = Справочники[ИмяОбъекта];
	//	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = Документы[ИмяОбъекта];
	//	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = БизнесПроцессы[ИмяОбъекта];
	//	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = ПланыВидовХарактеристик[ИмяОбъекта];
	//	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = ПланыСчетов[ИмяОбъекта];
	//	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = ПланыВидовРасчета[ИмяОбъекта];
	//	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = Задачи[ИмяОбъекта];
	//	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = ПланыОбмена[ИмяОбъекта];
	//	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнчСсылка) Тогда
	//		Рез = Перечисления[ИмяОбъекта];
	//	КонецЕсли;	
	
КонецФункции

// значимый параметр - Текст, результат - Значение, остальные для совместимости со стандартной процедурой
// ФильтрВыбывших - не выбираются выбывшие сотрудники
// ФильтрСотрудников - не выбираются физические лица, по которым нет записей движений физлиц по подразделениям
Процедура ОкончаниеВводаТекстаСотрудника(
	Элемент					= Неопределено,
	Знач Текст,
	Значение				= Неопределено,
	СтандартнаяОбработка	= Неопределено,
	Дата					= Неопределено,
	ФильтрВыбывших			= Истина,
	ФильтрСотрудников		= Истина
	) Экспорт

	СтандартнаяОбработка = Ложь;
	Значение = Новый СписокЗначений;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФЛ.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ФЛ.Ссылка) КАК СсылкаСтрока,
	|	ЕСТЬNULL(ДФЛ.Выбытие, ИСТИНА) КАК Выбытие,
	|	ФЛ.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ДФЛ.Агент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоСотрудник,
	|	ВЫБОР
	|		КОГДА ДФЛ.Подразделение ЕСТЬ NULL 
	|			ТОГДА ""не раб.""
	|		КОГДА ДФЛ.Выбытие
	|			ТОГДА ""уволен""
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДФЛ.Подразделение)
	|	КОНЕЦ КАК ПодразделениеСтрока
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Период, ) КАК ДФЛ
	|		ПО (ДФЛ.Агент = ФЛ.Ссылка)
	|			И (&УсловиеВТ)
	|ГДЕ
	|	(ФЛ.Наименование ПОДОБНО &Наименование
	|			ИЛИ ФЛ.Наименование ПОДОБНО &НаименованиеПеревод)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выбытие";
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Если ФильтрСотрудников Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ")
	КонецЕсли;
	Если ФильтрВыбывших Тогда
		УсловиеВТ = "НЕ ДФЛ.Выбытие";
	Иначе
		УсловиеВТ = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", УсловиеВТ);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Период",					Дата);
	Запрос.УстановитьПараметр("Наименование", 			"%" + Текст + "%");
	Запрос.УстановитьПараметр("НаименованиеПеревод",    "%" + уб_Фильтры.ПеревестиСтроку(Текст) + "%");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// требуется показать сообщение о некорректности ввода. Делается с помощью СтандартнаяОбработка = Ложь и пустым списком значений
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 50 Тогда
			// требуется показать сообщение о том, что элементов слишком много
			// чтобы стандартные средства 1с не повторяли запрос, нужно убрать стандартную обработку
			// и создать длинный список значений для вызова предупреждения о чрезмерном количестве элементов в списке значений
			Счетчик = 1;
			Пока Счетчик < 52 Цикл
				Значение.Добавить();
				Счетчик = Счетчик + 1;
			КонецЦикла;
		Иначе
			Пока Выборка.Следующий() Цикл
				Представление = СокрЛП(Выборка.СсылкаСтрока) + " (" + СокрЛП(Выборка.ПодразделениеСтрока) + ")";
				// TODO найти картинки для уволенных и для не работавших вообще
				Картинка = ?(Выборка.ПометкаУдаления, БиблиотекаКартинок.ПометитьНаУдаление, Неопределено);
				Значение.Добавить(Выборка.Ссылка, Представление, Выборка.ПометкаУдаления, Картинка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура АвтоподборСтрахователя(Форма, Элемент, Текст, СтандартнаяОбработка,Страхователь) Экспорт
	//СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст)>3 Тогда
		Если типЗНч(Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =  "ВЫБРАТЬ
			                |	Контрагенты.Ссылка КАК Ссылка
			                |ИЗ
			                |	Справочник.Контрагенты КАК Контрагенты
			                |ГДЕ
			                |	Контрагенты.Наименование ПОДОБНО &Наименование и пометкаУдаления = Ложь";
		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст =  "ВЫБРАТЬ
			                |	Контрагенты.Ссылка КАК Ссылка
			                |ИЗ
			                |	Справочник.ФизическиеЛица КАК Контрагенты
			                |ГДЕ
			                |	Контрагенты.Наименование ПОДОБНО &Наименование и пометкаУдаления = Ложь";
		КонецЕсли;	
		Запрос.УстановитьПараметр("Наименование","%"+Текст+"%");
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений .ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			ЗначениеВыбора = Форма.ВыбратьИзСписка(СписокЗначений,Элемент);
			Если Не ЗначениеВыбора = Неопределено Тогда
				Страхователь = ЗначениеВыбора.Значение;
			КонецЕсли;	
			//СписокЗначений.ПоказатьВыборЭлемента(,Элементы.Страхователь);
	Иначе
			СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры	


#Область ДинамическийСписок

////////////////////////////////////////////////////////////////////////////////
// Функции для работы с отборами и параметрами динамических списков.
//

// Найти элемент или группу отбора по заданному имени поля или представлению.
//
// Параметры:
//  ОбластьПоиска - ОтборКомпоновкиДанных
//                - ГруппаЭлементовОтбораКомпоновкиДанных    - контейнер с элементами и группами отбора,
//                                                             например Список.Отбор или группа в отборе.
//  ИмяПоля       - Строка - имя поля компоновки (не используется для групп).
//  Представление - Строка - представление поля компоновки.
//
// Возвращаемое значение:
//  Массив - коллекция отборов.
//
Функция НайтиЭлементыИГруппыОтбора(Знач ОбластьПоиска,
									Знач ИмяПоля = Неопределено,
									Знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Возврат МассивЭлементов;
	
КонецФункции

// Добавить группу отбора в коллекцию КоллекцияЭлементов.
//
// Параметры:
//  КоллекцияЭлементов - ОтборКомпоновкиДанных
//                     - ГруппаЭлементовОтбораКомпоновкиДанных    - контейнер с элементами и группами отбора,
//                                                                  например Список.Отбор или группа в отборе.
//  Представление      - Строка - представление группы.
//  ТипГруппы          - ТипГруппыЭлементовОтбораКомпоновкиДанных - тип группы.
//
// Возвращаемое значение:
//  ГруппаЭлементовОтбораКомпоновкиДанных - группа отбора.
//
Функция СоздатьГруппуЭлементовОтбора(Знач КоллекцияЭлементов, Представление, ТипГруппы) Экспорт
	
	Если ТипЗнч(КоллекцияЭлементов) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
		Или ТипЗнч(КоллекцияЭлементов) = Тип("ОтборКомпоновкиДанных") Тогда
		
		КоллекцияЭлементов = КоллекцияЭлементов.Элементы;
	КонецЕсли;
	
	ГруппаЭлементовОтбора = НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление);
	Если ГруппаЭлементовОтбора = Неопределено Тогда
		ГруппаЭлементовОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Иначе
		ГруппаЭлементовОтбора.Элементы.Очистить();
	КонецЕсли;
	
	ГруппаЭлементовОтбора.Представление    = Представление;
	ГруппаЭлементовОтбора.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	ГруппаЭлементовОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаЭлементовОтбора.ТипГруппы        = ТипГруппы;
	ГруппаЭлементовОтбора.Использование    = Истина;
	
	Возврат ГруппаЭлементовОтбора;
	
КонецФункции

// Добавить элемент компоновки в контейнер элементов компоновки.
//
// Параметры:
//  ОбластьДобавления - ОтборКомпоновкиДанных
//                    - ГруппаЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                              например, Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  ПравоеЗначение          - Произвольный - сравниваемое значение.
//  Представление           - Строка - представление элемента компоновки данных.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - элемент компоновки.
//
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено,
									знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	// Важно: установка идентификатора должна выполняться
	// в конце настройки элемента, иначе он будет скопирован
	// в пользовательские настройки частично заполненным.
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

// Изменить элемент отбора с заданным именем поля или представлением.
//
// Параметры:
//  ОбластьПоиска - ОтборКомпоновкиДанных
//                - ГруппаЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                          например Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  Представление           - Строка - представление элемента компоновки данных.
//  ПравоеЗначение          - Произвольный - сравниваемое значение.
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
//
// Возвращаемое значение:
//  Число - количество измененных элементов.
//
Функция ИзменитьЭлементыОтбора(ОбластьПоиска,
								Знач ИмяПоля = Неопределено,
								Знач Представление = Неопределено,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
		Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
			Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

// Удалить элементы отбора с заданным именем поля или представлением.
//
// Параметры:
//  ОбластьУдаления - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                               например, Список.Отбор или группа в отборе..
//  ИмяПоля         - Строка - имя поля компоновки (не используется для групп).
//  Представление   - Строка - представление поля компоновки.
//
Процедура УдалитьЭлементыГруппыОтбора(Знач ОбластьУдаления, Знач ИмяПоля = Неопределено, Знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив; // Массив из ЭлементОтбораКомпоновкиДанных, ГруппаЭлементовОтбораКомпоновкиДанных
	
	НайтиРекурсивно(ОбластьУдаления.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если Элемент.Родитель = Неопределено Тогда
			ОбластьУдаления.Элементы.Удалить(Элемент);
		Иначе
			Элемент.Родитель.Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавить или заменить существующий элемент отбора.
//
// Параметры:
//  ОбластьПоискаДобавления - ОтборКомпоновкиДанных
//                          - ГруппаЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                     например, Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  ПравоеЗначение          - Произвольный - сравниваемое значение.
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  Представление           - Строка - представление элемента компоновки данных.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
//
Процедура УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								Знач ИмяПоля,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Представление = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
		ПравоеЗначение, ВидСравнения, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив")
				Или ТипЗнч(ПравоеЗначение) = Тип("ФиксированныйМассив")
				Или ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		КонецЕсли;
		Если РежимОтображения = Неопределено Тогда
			РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
			ПравоеЗначение, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
КонецПроцедуры

// Добавить или заменить существующий элемент отбора динамического списка.
//
// Параметры:
//   ДинамическийСписок - ДинамическийСписок - список, в котором требуется установить отбор.
//   ИмяПоля            - Строка - поле, по которому необходимо установить отбор.
//   ПравоеЗначение     - Произвольный - значение отбора.
//       Необязательный. Значение по умолчанию Неопределено.
//       Внимание! Если передать Неопределено, то значение не будет изменено.
//   ВидСравнения  - ВидСравненияКомпоновкиДанных - условие отбора.
//   Представление - Строка - представление элемента компоновки данных.
//       Необязательный. Значение по умолчанию Неопределено.
//       Если указано, то выводится только флажок использования с указанным представлением (значение не выводится).
//       Для очистки (чтобы значение снова выводилось) следует передать пустую строку.
//   Использование - Булево - флажок использования этого отбора.
//       Необязательный. Значение по умолчанию: Неопределено.
//   РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - способ отображения этого отбора
//                                                                          пользователю:
//        РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ - в группе быстрых настроек над списком.
//        РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный       - в настройка списка (в подменю Еще).
//        РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный   - запретить пользователю менять этот отбор.
//   ИдентификаторПользовательскойНастройки - Строка - уникальный идентификатор этого отбора.
//       Используется для связи с пользовательскими настройками.
//
Процедура УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля,
	ПравоеЗначение = Неопределено,
	ВидСравнения = Неопределено,
	Представление = Неопределено,
	Использование = Неопределено,
	РежимОтображения = Неопределено,
	ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если РежимОтображения = Неопределено Тогда
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	Иначе
		ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	КонецЕсли;
	
	УстановитьЭлементОтбора(
		ОтборДинамическогоСписка,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравнения,
		Представление,
		Использование,
		РежимОтображения,
		ИдентификаторПользовательскойНастройки);
	
КонецПроцедуры

// Удалить элемент группы отбора динамического списка.
//
// Параметры:
//  ДинамическийСписок - ДинамическийСписок - реквизит формы, для которого требуется установить отбор.
//  ИмяПоля         - Строка - имя поля компоновки (не используется для групп).
//  Представление   - Строка - представление поля компоновки.
//
Процедура УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля = Неопределено, Представление = Неопределено) Экспорт
	
	УдалитьЭлементыГруппыОтбора(
		ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		ИмяПоля,
		Представление);
	
	УдалитьЭлементыГруппыОтбора(
		ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор,
		ИмяПоля,
		Представление);
	
КонецПроцедуры

// Установить или обновить значение параметра ИмяПараметра динамического списка Список.
//
// Параметры:
//  Список          - ДинамическийСписок - реквизит формы, для которого требуется установить параметр.
//  ИмяПараметра    - Строка             - имя параметра динамического списка.
//  Значение        - Произвольный        - новое значение параметра.
//  Использование   - Булево             - признак использования параметра.
//
Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		Если Использование И ЗначениеПараметраКомпоновкиДанных.Значение <> Значение Тогда
			ЗначениеПараметраКомпоновкиДанных.Значение = Значение;
		КонецЕсли;
		Если ЗначениеПараметраКомпоновкиДанных.Использование <> Использование Тогда
			ЗначениеПараметраКомпоновкиДанных.Использование = Использование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДинамическийСписок

Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Формы

////////////////////////////////////////////////////////////////////////////////
// Функции для работы с управляемыми формами.
//

// Получает значение реквизита формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма.
//  ПутьРеквизита - Строка - путь к данным реквизита формы, например: "Объект.МесяцНачисления".
//
// Возвращаемое значение:
//  Произвольный - реквизит формы.
//
Функция ПолучитьРеквизитФормыПоПути(Форма, ПутьРеквизита) Экспорт
	
	//МассивИмен = СтрРазделить(ПутьРеквизита, ".");
	МассивИмен =ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита,".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 По МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	
	Возврат Объект[ПоследнееПоле];
	
КонецФункции

// Устанавливает значение реквизиту формы.
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма-владелец реквизита.
//  ПутьРеквизита - Строка - путь к данным, например: "Объект.МесяцНачисления".
//  Значение - Произвольный - устанавливаемое значение.
//  ТолькоЕслиНеЗаполнен - Булево - позволяет не устанавливать значение реквизита,
//                                  если у него уже установлено какое-то значение.
//
Процедура УстановитьРеквизитФормыПоПути(Форма, ПутьРеквизита, Значение, ТолькоЕслиНеЗаполнен = Ложь) Экспорт
	
	//МассивИмен = СтрРазделить(ПутьРеквизита, ".");
	МассивИмен = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита,".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 По МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	Если НЕ ТолькоЕслиНеЗаполнен ИЛИ НЕ ЗначениеЗаполнено(Объект[ПоследнееПоле]) Тогда
		Объект[ПоследнееПоле] = Значение;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск элемента отбора в коллекции по заданному представлению.
//
// Параметры:
//  КоллекцияЭлементов - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                                  например, Список.Отбор.Элементы или группа в отборе.
//  Представление - Строка - представление группы.
// 
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - элемент отбора.
//
Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ЭлементОтбора.Представление = Представление Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

// Устанавливает свойство ИмяСвойства элемента формы с именем ИмяЭлемента в значение Значение.
// Применяется в тех случаях, когда элемента формы может не быть на форме из-за отсутствия прав у пользователя
// на объект, реквизит объекта или команду.
//
// Параметры:
//  ЭлементыФормы - ВсеЭлементыФормы
//                - ЭлементыФормы - коллекция элементов управляемой формы.
//  ИмяЭлемента   - Строка       - имя элемента формы.
//  ИмяСвойства   - Строка       - имя устанавливаемого свойства элемента формы.
//  Значение      - Произвольный - новое значение элемента.
// 
Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение) Экспорт
	
	ЭлементФормы = ЭлементыФормы.Найти(ИмяЭлемента);
	Если ЭлементФормы <> Неопределено И ЭлементФормы[ИмяСвойства] <> Значение Тогда
		ЭлементФормы[ИмяСвойства] = Значение;
	КонецЕсли;
	
КонецПроцедуры 

// Возвращает значение свойства ИмяСвойства элемента формы с именем ИмяЭлемента.
// Применяется в тех случаях, когда элемент формы может не быть на форме из-за отсутствия прав у пользователя
// на объект, реквизит объекта или команду.
//
// Параметры:
//  ЭлементыФормы - ВсеЭлементыФормы
//                - ЭлементыФормы - коллекция элементов управляемой формы.
//  ИмяЭлемента   - Строка       - имя элемента формы.
//  ИмяСвойства   - Строка       - имя свойства элемента формы.
// 
// Возвращаемое значение:
//   Произвольный - значение свойства ИмяСвойства элемента формы ИмяЭлемента.
// 
Функция ЗначениеСвойстваЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства) Экспорт
	
	ЭлементФормы = ЭлементыФормы.Найти(ИмяЭлемента);
	Возврат ?(ЭлементФормы <> Неопределено, ЭлементФормы[ИмяСвойства], Неопределено);
	
КонецФункции 

// Получает картинку для вывода на странице с комментарием в зависимости
// от наличия текста в комментарии.
//
// Параметры:
//  Комментарий  - Строка - текст комментария.
//
// Возвращаемое значение:
//  Картинка - картинка, которая должна отображаться на странице с комментарием.
//
Функция КартинкаКомментария(Комментарий) Экспорт

	Если НЕ ПустаяСтрока(Комментарий) Тогда
		Картинка = БиблиотекаКартинок.Комментарий;
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

#КонецОбласти













