
////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	Если ДатаОтчета = '00010101000000' Тогда
		#Если Клиент Тогда
		Предупреждение("Необходимо установить дату отчета");
		#КонецЕсли 
		Возврат;
	КонецЕсли;
	//Если ЗначениеНеЗаполнено(СК) Тогда
	//	Предупреждение("Необходимо выбрать Страховую компанию");
	//	Возврат;
	//КонецЕсли;
	//Если ЗначениеНеЗаполнено(Подразделение) Тогда
	//	Предупреждение("Необходимо выбрать Подразделение");
	//	Возврат;
	//КонецЕсли;
	
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	Макет       = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("СК", СК);
	Запрос.УстановитьПараметр("ВидНумерации", ВидНумерации);
	
	СтрокаУсловия = "";
	Если НЕ ЗначениеНеЗаполнено(СК) Тогда
		СтрокаУсловия = СтрокаУсловия + " СК = &СК ";
	КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(ВидНумерации) Тогда
		СтрокаУсловия = СтрокаУсловия + ?(СтрокаУсловия="",""," И ");
		СтрокаУсловия = СтрокаУсловия + " ВидНумерации = &ВидНумерации ";
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеНомераПолисовСрезПоследних.НомерПолиса,
	|	СвободныеНомераПолисовСрезПоследних.ВидНумерации,
	|	СвободныеНомераПолисовСрезПоследних.СК,
	|	Сумма(1) КАК Количество
	|ИЗ
	|	РегистрСведений.уб_СвободныеНомераПолисов.СрезПоследних(&ДатаКон,
	|"
	+ СтрокаУсловия +
	"
	|) КАК СвободныеНомераПолисовСрезПоследних
	|ГДЕ
	|	(НЕ СвободныеНомераПолисовСрезПоследних.НомерИспользован)
	|	И (НЕ СвободныеНомераПолисовСрезПоследних.НомерЗаблокирован)
	|	И (НЕ СвободныеНомераПолисовСрезПоследних.НомерЗарезервирован)
	|
	|СГРУППИРОВАТЬ ПО
	|	СвободныеНомераПолисовСрезПоследних.СК,
	|	СвободныеНомераПолисовСрезПоследних.ВидНумерации,
	|	СвободныеНомераПолисовСрезПоследних.НомерПолиса
	|ИТОГИ 
	|	СУММА(Количество)
	|ПО 
	|	СК, ВидНумерации, НомерПолиса
	|";
	
	
	РезЗапроса 	= Запрос.Выполнить();
	//РезТаблица = РезЗапроса.Выгрузить();
	
	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтКон 	= Формат(ДатаОтчета,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК		= СК;
	Обл.Параметры.ПечНумерация	= ВидНумерации;
	ДокументРезультат.Вывести(Обл);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ВыборкаСК	 	= РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаСК.Следующий() Цикл
		Обл 					= Макет.ПолучитьОбласть("СК");
		Обл.Параметры.СК		= ВыборкаСК.СК;
		Обл.Параметры.Кол		= ВыборкаСК.Количество;
		ДокументРезультат.Вывести(Обл,3,,Истина);
			
		ВыборкаВиды	 	= ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
		Пока ВыборкаВиды.Следующий() Цикл

			ОблВида 						= Макет.ПолучитьОбласть("ВидНумерации");
			ОблВида.Параметры.ВидНумерации	= "    "+ВыборкаВиды.ВидНумерации;
			ОблВида.Параметры.Кол			= ВыборкаВиды.Количество;
			ДокументРезультат.Вывести(ОблВида,4,,Истина);
					
			СчНомера = 0;
			ВыборкаНомера 	= ВыборкаВиды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаНомера.Следующий() Цикл
				СчНомера = 	СчНомера + 1;
				Обл 						= Макет.ПолучитьОбласть("Строка");
				Обл.Параметры.Ном			= СчНомера;
				Обл.Параметры.НомерПолиса	= ВыборкаНомера.НомерПолиса;
				ДокументРезультат.Вывести(Обл,5,,Ложь);
			КонецЦикла;
					
		КонецЦикла;
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	//Обл 					= Макет.ПолучитьОбласть("Итого");
	//Обл.Параметры.Сумма 	= ИтСумма;
	//ТабДокумент.Вывести(Обл);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 6;
	ДокументРезультат.ФиксацияСлева		= 0;

	ДокументРезультат.Показать("Остатки свободных номеров полисов");
	
	//Построитель = Новый ПостроительОтчета(Запрос.Текст);
	

КонецПроцедуры
