
Перем тзСписокСопровождающихДокументов;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПолучитьРасширеннуюИнформациюОНомереБСО(
	ТекСтрока,
	бТолькоПоследнийАКТ 				= Ложь,
	бНеподтвержденные 					= Истина,
	бИнфоДСП 							= Истина,
	тзСписокСопровождающихДокументов 	= Неопределено
	) Экспорт
	
	ИскомыйНомерБСО = ТекСтрока.НомерБСО;
	Если ПустаяСтрока(ИскомыйНомерБСО) Тогда
		Возврат "";
	КонецЕсли;
	тзИнф = Новый ТаблицаЗначений();
	тзИнф.Колонки.Добавить("ДокументСсылка");
	тзИнф.Колонки.Добавить("НаименованиеДокумента");
	тзИнф.Колонки.Добавить("Подтвержден");
	тзИнф.Колонки.Добавить("ДатаДокумента");
	тзИнф.Колонки.Добавить("НомерДокумента");
	тзИнф.Колонки.Добавить("СисНомер");
	тзИнф.Колонки.Добавить("ДопИнфо");
	тзИнф.Колонки.Добавить("ДопИнфоДСП");
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ДБС.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодПоступления
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&Период, &УсловиеВТ) КАК ДБС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДБ.Период,
	|	ДБ.Регистратор,
	|	ДБ.ВидБСО,
	|	ДБ.Поставщик,
	|	ДБ.ОрганизацияАгент,
	|	ДБ.Подтверждено,
	//|	ДБ.ДокПроведен,
	//|	ДБ.Активность Как ДокПроведен,
	|	ДБ.Активность Как Активность
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК ДБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодПоступления КАК ВТ_ПериодПоступления
	|		ПО (ДБ.Период >= ЕСТЬNULL(ВТ_ПериодПоступления.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)))
	|ГДЕ
	|	ДБ.Период < &Период";
	Запрос.УстановитьПараметр("Период", Дата);
	ТекстУсловиеВТ = "Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО И Подтверждено ";//И ДокПроведен
	Если ЗначениеЗаполнено(ТекСтрока.СК) Тогда
		ТекстУсловиеВТ = ТекстУсловиеВТ + " И СК = &СК";
		ТекстЗапроса = ТекстЗапроса + " И ДБ.СК = &СК";
		Запрос.УстановитьПараметр("СК", ТекСтрока.СК);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекСтрока.ВидБСО) Тогда
		ТекстУсловиеВТ = ТекстУсловиеВТ + " И ВидБСО = &ВидБСО";
		ТекстЗапроса = ТекстЗапроса + " И ДБ.ВидБСО = &ВидБСО";
		Запрос.УстановитьПараметр("ВидБСО", ТекСтрока.ВидБСО);
	КонецЕсли;
	ТекстУсловиеВТ = ТекстУсловиеВТ + " И НомерБСО = &НомерБСО";
	ТекстЗапроса = ТекстЗапроса + " И ДБ.НомерБСО = &НомерБСО";
	Запрос.УстановитьПараметр("НомерБСО", ИскомыйНомерБСО);
	ТекстЗапроса = ТекстЗапроса + " И (
	               | ДБ.Регистратор ССЫЛКА Документ.уб_ПередачаБСОПоставщику 
				   | ИЛИ ДБ.Регистратор ССЫЛКА Документ.уб_СтраховойПолис
				   | ИЛИ ДБ.Регистратор ССЫЛКА Документ.уб_ЗаявлениеОбУтрате
				   | ИЛИ ДБ.Регистратор ССЫЛКА Документ.уб_ОбъявлениеВСМИобУтратеБСО
				   | ИЛИ ДБ.Регистратор ССЫЛКА Документ.уб_УведомлениеПоставщикаОбУтратеБСО
				   | ИЛИ ДБ.Регистратор ССЫЛКА Документ.уб_ЗаявлениеВПолицию
				   |)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", ТекстУсловиеВТ);			   
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	бПодтвержденныйАктУжеДобавлен = Ложь;
	Пока Выборка.Следующий() Цикл
		Регс = Выборка.Регистратор;
		Если ТипЗнч(Регс) = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
			Стр = тзИнф.Добавить();
			Стр.ДокументСсылка = Выборка.Регистратор;
			Стр.НаименованиеДокумента = "Полис";
			Стр.Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Стр.ДатаДокумента = Выборка.Регистратор.Дата;
			Стр.НомерДокумента = СокрЛП(Выборка.Регистратор.Номер);
			Стр.СисНомер = "";
			Стр.ДопИнфо = "(" + Строка(Выборка.Регистратор.Страхователь) + ")";
			Стр.ДопИнфоДСП = "Агент: " + Строка(Выборка.Регистратор.Агент) + "";
			Если уб_СЛ.ОпределитьЭтоПолис(Выборка.ВидБСО) Тогда 
				//Формируем список отчетов поставщику по оплатам полиса
				оСП = Выборка.Регистратор.ПолучитьОбъект();
				ТЗОплат = оСП.ОП_ПолучитьТЗОплат();
				Для каждого Оплата Из ТЗОплат Цикл
					Если ЗначениеЗаполнено(Оплата.ОтчетПоставщику) Тогда
						ОП = Оплата.ОтчетПоставщику;
						ООП = ОП.ПолучитьОбъект();
						ОПАкт = оОП.ПолучитьДанныеАктуальногоОтчетаПоставщику();
						Стр = тзИнф.Добавить();
						Стр.ДокументСсылка 			= ОП;
						Стр.НаименованиеДокумента 	= "Отчет";
						Стр.Подтвержден 			= ОП.Проведен;
						Стр.ДатаДокумента 			= ОПАкт.Дата;
						Стр.НомерДокумента 			= ОПАкт.НомерОтчетаПоставщику;
						Стр.СисНомер 				= Строка(ОП.Номер);
						Стр.ДопИнфо 				= ?(ОПАкт.ИтогОС_КПеречислениюПоставщику = 0,"","(Сумма: " + Формат(ОПАкт.ИтогОС_КПеречислениюПоставщику,"ЧДЦ=2; ЧГ=") + ")");
						Стр.ДопИнфоДСП 				= "";
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли уб_СЛ.ОпределитьЭтоКвитанцияА7(Выборка.ВидБСО) Тогда
				оСП = Выборка.Регистратор.ПолучитьОбъект();
				ТЗОплат = оСП.ОП_ПолучитьТЗОплат();
				Для каждого Оплата Из ТЗОплат Цикл
					Если Оплата.НомерКвитанции = ИскомыйНомерБСО И НЕ ЗначениеНеЗаполнено(Оплата.ОтчетПоставщику) Тогда
						ОП = Оплата.ОтчетПоставщику;
						ООП = ОП.ПолучитьОбъект();
						ОПАкт = оОП.ПолучитьДанныеАктуальногоОтчетаПоставщику();
						Стр = тзИнф.Добавить();
						Стр.ДокументСсылка 			= ОП;
						Стр.НаименованиеДокумента 	= "Отчет";
						Стр.Подтвержден 			= ОП.Проведен;
						Стр.ДатаДокумента 			= ОПАкт.Дата;
						Стр.НомерДокумента 			= ОПАкт.НомерОтчетаПоставщику;
						Стр.СисНомер 				= Строка(ОП.Номер);
						Стр.ДопИнфо 				= ?(ОПАкт.ИтогОС_КПеречислениюПоставщику = 0,"","(Сумма: " + Формат(ОПАкт.ИтогОС_КПеречислениюПоставщику,"ЧДЦ=2; ЧГ=") + ")");
						Стр.ДопИнфоДСП 				= "";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Регс) = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
			Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Если (бТолькоПоследнийАКТ И НЕ бНеподтвержденные) И Подтвержден Тогда
				Если бПодтвержденныйАктУжеДобавлен Тогда
					Добавлять = Ложь;
				Иначе	
					бПодтвержденныйАктУжеДобавлен = Истина;
					Добавлять = Истина;
				КонецЕсли;
			Иначе	
				Добавлять = Истина;
			КонецЕсли;			
			Если Добавлять Тогда
				Стр = тзИнф.Добавить();
				Стр.ДокументСсылка 			= Выборка.Регистратор;
				Стр.НаименованиеДокумента 	= "АКТ п/п";
				Стр.Подтвержден 			= Подтвержден;
				Стр.ДатаДокумента 			= Выборка.Регистратор.Дата;
				Стр.НомерДокумента 			= Выборка.Регистратор.НомерДляОтчета;
				Стр.СисНомер 				= Формат(Выборка.Регистратор.Номер,"ЧГ=");
				Стр.ДопИнфо 				= "";
				Стр.ДопИнфоДСП 				= "";
			КонецЕсли;			
		ИначеЕсли ТипЗнч(Регс) = Тип("ДокументСсылка.уб_ЗаявлениеОбУтрате") Тогда
			Стр = тзИнф.Добавить();
			ДокСсылка = Выборка.Регистратор;
			Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Стр.ДокументСсылка 			= ДокСсылка;
			Стр.НаименованиеДокумента 	= "Заявление сотрудника об утрате БСО";
			Стр.Подтвержден 			= Истина;
			Стр.ДатаДокумента 			= ДокСсылка.Дата;
			Стр.НомерДокумента 			= Формат(ДокСсылка.Номер,"ЧГ=");
			Стр.СисНомер 				= "";
			Стр.ДопИнфо 				= "";
			//Ищем строку БСО в документе и уточняем данные
			ДопИнфоДСП = "Тип утраты: ";
			НайденнаяСтрока = ДокСсылка.БСО.Найти(ИскомыйНомерБСО, "НомерБСО");
			Если НайденнаяСтрока = Неопределено Тогда
				ДопИнфоДСП = ДопИнфоДСП
				+ ?(СокрЛП(НайденнаяСтрока.ТипУтраты) = "", "НЕ ОПРЕДЕЛЕНО", НайденнаяСтрока.ТипУтраты)
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ДатаУтратыПорчи),"", ", дата утраты/порчи: " + Формат(НайденнаяСтрока.ДатаУтратыПорчи,"ДФ='dd.MM.yyyy'"))
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ВидУтратыБСО),"", ", утрачено/испорчено: " + Строка(НайденнаяСтрока.ВидУтратыБСО))
				+ ?(СокрЛП(НайденнаяСтрока.Комментарий) = "","", ", " + СокрЛП(НайденнаяСтрока.Комментарий));
			Иначе	
				ДопИнфоДСП = ДопИнфоДСП + "НЕ ОПРЕДЕЛЕНО";
			КонецЕсли;
			Стр.ДопИнфоДСП = ДопИнфоДСП;
		ИначеЕсли ТипЗнч(Регс) = Тип("ДокументСсылка.уб_ОбъявлениеВСМИобУтратеБСО") Тогда
			Стр = тзИнф.Добавить();
			ДокСсылка = Выборка.Регистратор;
			Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Стр.ДокументСсылка = ДокСсылка;
			Стр.НаименованиеДокумента = "Объявление в СМИ об утрате БСО";
			Стр.Подтвержден = Подтвержден;
			Стр.ДатаДокумента = ДокСсылка.Дата;
			Стр.НомерДокумента = Формат(ДокСсылка.Номер,"ЧГ=");
			Стр.СисНомер = "";
			Стр.ДопИнфо = "Издание: '" + СокрЛП(ДокСсылка.НаименованиеИзданияСМИ) + "'" 
			+ ?(СокрЛП(ДокСсылка.НомерСМИ) = "","",", № выпуска: " + СокрЛП(ДокСсылка.НомерСМИ)) 
			+ ", дата выпуска: " + Формат(ДокСсылка.ДатаВыходаСМИ,"ДФ='dd.MM.yyyy'")
			+ ?(СокрЛП(ДокСсылка.НомерСтраницыСМИ) = "",""," (" + СокрЛП(ДокСсылка.НомерСтраницыСМИ) + ")")
			+ ?(СокрЛП(ДокСсылка.ДополнительныеСМИ) = "",""," (дополнительно опубликовано в " + СокрЛП(ДокСсылка.ДополнительныеСМИ) + ")")
			; 
			ДопИнфоДСП = "Ответственный: " + Строка(ДокСсылка.Ответственный) 
			+ ?(ЗначениеНеЗаполнено(ДокСсылка.Курьер),"",", курьер: " + Строка(ДокСсылка.Курьер));
			//Ищем строку БСО в документе и уточняем данные
			НайденнаяСтрока = ДокСсылка.БСО.Найти(ИскомыйНомерБСО, "НомерБСО");
			Если НайденнаяСтрока = Неопределено Тогда
				ДопИнфоДСП = ДопИнфоДСП + ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ДатаУтратыПорчи),"", ", дата утраты/порчи: " + Формат(НайденнаяСтрока.ДатаУтратыПорчи,"ДФ='dd.MM.yyyy'"))
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ВидУтратыБСО),"", ", утрачено/испорчено: " + Строка(НайденнаяСтрока.ВидУтратыБСО))
				+ ?(СокрЛП(НайденнаяСтрока.Комментарий) = "","", ", " + СокрЛП(НайденнаяСтрока.Комментарий));
			КонецЕсли;
			Стр.ДопИнфоДСП = ДопИнфоДСП;

		ИначеЕсли ТипЗнч(Регс) = Тип("ДокументСсылка.уб_УведомлениеПоставщикаОбУтратеБСО") Тогда
			Стр = тзИнф.Добавить();
			ДокСсылка = Выборка.Регистратор;
			Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Стр.ДокументСсылка = ДокСсылка;
			Стр.НаименованиеДокумента = "Уведомление поставшика об утрате БСО";
			Стр.Подтвержден = Подтвержден;
			Стр.ДатаДокумента = ДокСсылка.Дата;
			Стр.НомерДокумента = Формат(ДокСсылка.Номер,"ЧГ=");
			Стр.СисНомер = "";
			Стр.ДопИнфо = ""; 
			
			ДопИнфоДСП = "Ответственный: " + Строка(ДокСсылка.Ответственный) + ", тип утраты: ";
			
			//Ищем строку БСО в документе и уточняем данные
			НайденнаяСтрока = ДокСсылка.БСО.Найти(ИскомыйНомерБСО, "НомерБСО");
			Если НайденнаяСтрока = Неопределено Тогда
				ДопИнфоДСП = ДопИнфоДСП
				+ ?(СокрЛП(НайденнаяСтрока.ТипУтраты) = "", "НЕ ОПРЕДЕЛЕНО", НайденнаяСтрока.ТипУтраты)
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ДатаУтратыПорчи),"", ", дата утраты/порчи: " + Формат(НайденнаяСтрока.ДатаУтратыПорчи,"ДФ='dd.MM.yyyy'"))
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ВидУтратыБСО),"", ", утрачено/испорчено: " + Строка(НайденнаяСтрока.ВидУтратыБСО))
				+ ?(СокрЛП(НайденнаяСтрока.Комментарий) = "","", ", " + СокрЛП(НайденнаяСтрока.Комментарий));
			Иначе	
				ДопИнфоДСП = ДопИнфоДСП + "НЕ ОПРЕДЕЛЕНО";
			КонецЕсли;
			Стр.ДопИнфоДСП = ДопИнфоДСП;
		ИначеЕсли ТипЗнч(Регс) = Тип("ДокументСсылка.уб_ЗаявлениеВПолицию") Тогда
			Стр = тзИнф.Добавить();
			ДокСсылка = Выборка.Регистратор;
			Подтвержден = Выборка.Подтверждено И Выборка.Активность;
			Стр.ДокументСсылка = ДокСсылка;
			Стр.НаименованиеДокумента = "Уведомление поставшика об утрате БСО";
			Стр.Подтвержден = Подтвержден;
			Стр.ДатаДокумента = ДокСсылка.Дата;
			Стр.НомерДокумента = Формат(ДокСсылка.Номер,"ЧГ=");
			Стр.СисНомер = "";
			Стр.ДопИнфо = "На гражданина " + уб_Кэшируемые.ФИОФизлицаСтрокой(ДокСсылка.Агент, , Ложь)
			+ "в ОВД: " + ДокСсылка.ОВД.Наименование;
			
			ДопИнфоДСП = "Ответственный: " + Строка(ДокСсылка.Ответственный);
			
			//Ищем строку БСО в документе и уточняем данные
			НайденнаяСтрока = ДокСсылка.БСО.Найти(ИскомыйНомерБСО, "НомерБСО");
			Если НайденнаяСтрока = Неопределено Тогда
				ДопИнфоДСП = ДопИнфоДСП
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ДатаУтратыПорчи),"", ", дата хищения: " + Формат(НайденнаяСтрока.ДатаУтратыПорчи,"ДФ='dd.MM.yyyy'"))
				+ ?(ЗначениеНеЗаполнено(НайденнаяСтрока.ВидУтратыБСО),"", ", похищено: " + Строка(НайденнаяСтрока.ВидУтратыБСО))
				+ ?(СокрЛП(НайденнаяСтрока.Комментарий) = "","", ", " + СокрЛП(НайденнаяСтрока.Комментарий));
			КонецЕсли;
			Стр.ДопИнфоДСП = ДопИнфоДСП;
		КонецЕсли;	
	КонецЦикла;
	
	РсшИнф = "";
	
	Для каждого Стр Из тзИнф Цикл
		Если НЕ бНеподтвержденные И НЕ Стр.Подтвержден Тогда
			Продолжить;	
		КонецЕсли;
		
		Если СокрЛП(Стр.НомерДокумента) = "" Тогда
			хНомер = Стр.СисНомер;
		Иначе		
			хНомер = Стр.НомерДокумента;
		КонецЕсли;
		
		Если тзСписокСопровождающихДокументов <> Неопределено Тогда
			СтрокаСопроДок = тзСписокСопровождающихДокументов.Добавить();
			СтрокаСопроДок.Ссылка = Стр.ДокументСсылка;
			СтрокаСопроДок.Наименование = Стр.НаименованиеДокумента;
			СтрокаСопроДок.Дата = Стр.ДатаДокумента;
			СтрокаСопроДок.Номер = хНомер + ?(Стр.СисНомер = "",""," SN " + Стр.СисНомер);
		КонецЕсли;
		
		РсшИнф = РсшИнф + Стр.НаименованиеДокумента 
		+ " № " + хНомер 
		+ " от " + Формат(Стр.ДатаДокумента,"ДФ='dd.MM.yyyy'")
		+ ?(Стр.ДопИнфо = "",""," " + Стр.ДопИнфо);
		
		Если бИнфоДСП Тогда
			РсшИнф = РсшИнф + ?(Стр.ДопИнфоДСП = "",""," " + Стр.ДопИнфоДСП) 
			+ ?(Стр.СисНомер = "",""," SN " + Стр.СисНомер) 
			+ ?(Стр.Подтвержден,""," [НЕ ПОДТВЕРЖДЕН]");
		Иначе
			РсшИнф = РсшИнф + ?(Стр.Подтвержден,""," *");
		КонецЕсли;
		
		РсшИнф = РсшИнф + Символы.ВК + Символы.ПС;
 	КонецЦикла;
	
	Возврат РсшИнф;
КонецФункции	

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры


Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	СтруктураПараметров.Вставить("АгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Агент", Неопределено);
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);
//	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.СверкаБСО);
	//СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	//СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Ложь);
	//СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", Неопределено);
	СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Поставщик", Поставщик);
	СтруктураПараметров.Вставить("ОрганизацияАгент", ОрганизацияАгент);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	СтруктураПараметров.Вставить("ПроверкаПоложения", Ложь);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
	СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО", "УстановитьСостояниеБСО");
	СтруктураПараметров.Вставить("ИмяКолонкиПоложениеБСО", "УстановитьПоложениеБСО");
	
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////
Функция ПоложениеИСостояниеУбытия(ПоложениеБСО,СостояниеБСО) Экспорт 
	ПБ = Перечисления.уб_ПоложенияБСО;
	СБ = Перечисления.уб_СостоянияБСО;
	Если ПоложениеБСО = ПБ.ПереданВСК
	 или ПоложениеБСО = ПБ.Списан
	 или ПоложениеБСО = ПБ.ОтданКлиенту
	 или ПоложениеБСО = ПБ.ОтданБанку
	 или СостояниеБСО = СБ.Испорчен
	 или СостояниеБСО = СБ.Украден
	 или СостояниеБСО = СБ.Уничтожен
	 или СостояниеБСО = СБ.Утрачен
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ДайСостояниеИПоложениеБСОДляПостащика(ДанныеСтроки) Экспорт 
	ПБ = Перечисления.уб_ПоложенияБСО;
	СБ = Перечисления.уб_СостоянияБСО;
	
	Если ДанныеСтроки.УстановитьПоложениеБСО = ПБ.ПустаяСсылка() Тогда
		ПоложениеБСО = ДанныеСтроки.ПоложениеБСО;
	Иначе	
		ПоложениеБСО = ДанныеСтроки.УстановитьПоложениеБСО;
	КонецЕсли;
	
	Если ДанныеСтроки.УстановитьСостояниеБСО = СБ.ПустаяСсылка() Тогда
		СостояниеБСО = ДанныеСтроки.СостояниеБСО;
	Иначе	
		СостояниеБСО = ДанныеСтроки.УстановитьСостояниеБСО;
	КонецЕсли;
	
	
	Плж = "";
	Если ЛОЖЬ
		ИЛИ ПоложениеБСО = ПБ.ПолученИзСК
		ИЛИ ПоложениеБСО = ПБ.ВозвращенИзСК
		ИЛИ ПоложениеБСО = ПБ.ПереданНаТочку
		ИЛИ ПоложениеБСО = ПБ.ВозвращенСТочки
	Тогда
		Плж = "На руках";
	ИначеЕсли ПоложениеБСО = ПБ.ПереданВСК Тогда
		Плж = "Передан поставщику (СК)";
	ИначеЕсли ПоложениеБСО = ПБ.Списан Тогда
		Плж = "Списан";
	ИначеЕсли ЛОЖЬ
		или ПоложениеБСО = ПБ.ОтданКлиенту
	 	или ПоложениеБСО = ПБ.ОтданБанку
	Тогда
		Плж = "Отдан клиенту/банку";
	КонецЕсли;
	
	Сст = "";
	Если ЛОЖЬ
		или СостояниеБСО = СБ.ПустойБланк
		или СостояниеБСО = СБ.НеиспользованныйБланк
		или СостояниеБСО = СБ.НеПолностьюОформлен
	Тогда
		Сст = "Неиспользован";
	ИначеЕсли ЛОЖЬ
		или СостояниеБСО = СБ.НедействующийБланк
	Тогда
		Сст = "Не действующий бланк";
	ИначеЕсли ЛОЖЬ
		или СостояниеБСО = СБ.НеполныйБланк
	Тогда
		Сст = "Неполный бланк";
	ИначеЕсли ЛОЖЬ
		или СостояниеБСО = СБ.Оформлен
		или СостояниеБСО = СБ.НеПравильноОформлен
	Тогда
		Сст = "Оформлен";
	ИначеЕсли ЛОЖЬ
		или СостояниеБСО = СБ.Утрачен
		или СостояниеБСО = СБ.Уничтожен
		или СостояниеБСО = СБ.Украден
	Тогда
		Сст = "Утрачен";
	ИначеЕсли ЛОЖЬ
		или СостояниеБСО = СБ.Испорчен
	Тогда
		Сст = "Испорчен";
	КонецЕсли;
	
	СстПлж = Сст + ?(Сст = "","",", ") + Плж;
	СостояниеИПоложениеДляПоставщика = Новый Структура("Положение, Состояние, СостояниеИПоложение",Плж,Сст,СстПлж);
	Возврат СостояниеИПоложениеДляПоставщика;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		#Если Клиент Тогда
		ОчиститьСообщения();
		#КонецЕсли
	КонецЕсли;
	
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
	
КонецПроцедуры