//СПИСОК Действий с заявками
//
//ВнестиИзменения
//ИзменитьКурьера
//ПоказатьТаблицуБСО
//ПроверитьБСО
//СоздатьПеремещениеБСО
//СоздатьПеремещениеБСО_Возврат
//СоздатьПеремещениеБСО_ВозвратНеСостоялась
//СоздатьПеремещениеБСО_ВозвратЗаменаБСО
//СоздатьПеремещениеБСО_ВозвратЗаменаКурьера
//СоздатьПриемкуОплат
//СтруктураПодчиненности
//УстановитьПредыдущийСтатус
//УстановитьСтатус_БСОНаРукахУКурьера
//УстановитьСтатус_ДеньгиВКомпании
//УстановитьСтатус_ЗапросНаУдаление
//УстановитьСтатус_ЗаявкаОтработана
//DelУстановитьСтатус_КомплектДокументацииПодготовлен
//УстановитьСтатус_КомплектИДеньгиУКассира
//УстановитьСтатус_КомплектНаХраненииВБухгалтерии
//DelУстановитьСтатус_КурьерНаВыезде
//DelУстановитьСтатус_КурьерПрибылПоАдресу
//УстановитьСтатус_НазначениеКурьера
//УстановитьСтатус_СогласованиеСКлиентом
//УстановитьСтатус_СогласованиеСКлиентом_Доработка
//УстановитьСтатус_СтраховкаНеСостоялась
//УстановитьСтатус_СтраховкаСостоялась
//УстановитьСтатус_ФормированиеКомплектаБСО
//ДвижениеСтатусовОтчетКассира

Функция ДействиеКлиентское(Действие) Экспорт
	Если Действие = "ПоказатьТаблицуБСО"
		ИЛИ Действие = "ВнестиИзменения"
		ИЛИ Действие = "СтруктураПодчиненности"
		ИЛИ Действие = "ПоказатьТаблицуБСО"
		ИЛИ Действие = "ИсторияЗаявки"
		ИЛИ Действие = "СоздатьПриемкуОплат"
		//ИЛИ Действие = "ПроверитьПеремещения"
		ИЛИ Действие = "СоздатьПеремещениеБСО"
		Тогда
		Возврат Истина
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

//пока неактуальна
Функция СоответствиеДействийИСтатусов() Экспорт

	Пер = Перечисления.уб_СтатусыЗаявок;
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("УстановитьСтатус_БСОНаРукахУКурьера", 	Пер.БСОНаРукахУКурьера);
	Соответствие.Вставить("УстановитьСтатус_ДеньгиВКомпании",		Пер.ДеньгиВКомпании);

КонецФункции // СоответствиеДействийИСтатусов()

//порядок отправляется в форму документа заявки
Функция ВернутьСтатусЗаявки(Заявка, ДатаСреза = Неопределено,Структура  = Неопределено) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СЗ.Заявка,
	|	СЗ.Статус,
	|	СЗ.Период КАК ДатаСтатуса,
	|	СЗ.Статус.Порядок КАК СтатусПорядок
	|ИЗ
	|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(&ДатаСреза, Заявка = &Заявка) КАК СЗ");
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Если ДатаСреза = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаСреза","");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Статус;
		Структура = Новый Структура;
		Структура.Вставить("Заявка",Выборка.Заявка);
		Структура.Вставить("Статус",Выборка.Статус);
		Структура.Вставить("ДатаСтатуса",Выборка.ДатаСтатуса);
		Структура.Вставить("СтатусПорядок",Выборка.СтатусПорядок);
	Иначе	
		Результат = Перечисления.уб_СтатусыЗаявок.ПустаяСсылка();
		Структура = Новый Структура;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции	

Функция ОпределитьСтатуcЗаявкиИЗаписатьВРегистр(Заявка, СтрокаЗаявки = Неопределено, СписокСотрудниковБСО = Неопределено) Экспорт
	
	Если СтрокаЗаявки = Неопределено Тогда
		СтрокаЗаявки = ПолучитьРеквизитыЗаявки(Заявка);
	КонецЕсли;	
	Если СписокСотрудниковБСО = Неопределено Тогда
		СписокСотрудниковБСОвр = уб_temp.ВернутьСписокСотрудниковОУБСО(Истина);
		СписокСотрудниковБСОвр.Добавить(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
		ВсегоВОтделеБСО  = СписокСотрудниковБСОвр.Количество();
		СписокСотрудниковБСО = Новый Соответствие;
		Для Счетчик = 1  по  ВсегоВОтделеБСО  Цикл
			СписокСотрудниковБСО.Вставить(СписокСотрудниковБСОвр[Счетчик-1],СписокСотрудниковБСОвр[Счетчик-1]);	
		КонецЦикла;	
	КонецЕсли;		
	ТекСтатус = ОпределитьСтатуcЗаявки(Заявка,СтрокаЗаявки,СписокСотрудниковБСО);
	Выборка = Неопределено;
	ПредСтатус = ВернутьСтатусЗаявки(Заявка,СтрокаЗаявки.ДатаСтатуса,Выборка);
	Если ТекСтатус = ПредСтатус Тогда
	Иначе
		Если Выборка.ДатаСтатуса = СтрокаЗаявки.ДатаСтатуса Тогда
			СтрокаЗаявки.ДатаСтатуса = СтрокаЗаявки.ДатаСтатуса + 1;
		Конецесли;	
		//Попытка
		//	МЗ = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СоздатьМенеджерЗаписи();
		//	МЗ.Период = СтрокаЗаявки.ДатаСтатуса;
		//	МЗ.Заявка = Заявка;
		//	МЗ.Статус = ТекСтатус;
		//	МЗ.ТребуетсяВозвратБСО = НЕ СтрокаЗаявки.ПоложениеБСО = "Вернулось с точки";
		//	МЗ.Комментарий ="Автопростановка";
		//	МЗ.Записать();
		//Исключение
		//КонецПопытки;	
		УстановитьСтатусЗаявки(Заявка, текСтатус, "Автопростановка", Ложь, СтрокаЗаявки.ДатаСтатуса, Не СтрокаЗаявки.ПоложениеБСО = "Вернулось с точки");
	КонецЕсли;
	
КонецФункции	

Функция ОпределитьСтатуcЗаявки(Заявка, СтрокаЗаявки, СписокСотрудниковБСО) Экспорт
	
	ТекСтатус = Перечисления.уб_СтатусыЗаявок.ПустаяСсылка();
	ФлЕстьСданноеБСО = Ложь;
	Если НЕ СтрокаЗаявки.Проведен Тогда
		Если СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление Тогда
			ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление;
		ИначеЕсли СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена Тогда	
			ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена;
		Иначе
			ТекСтатус  = Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом;
		КонецЕсли;	
	ИначеЕсли НЕ СтрокаЗаявки.Подтверждена И НЕ СтрокаЗаявки.Самовыезд Тогда
		Если СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление Тогда
			ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление;
		ИначеЕсли СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена Тогда	
			ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена;
		Иначе
			ТекСтатус  = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера;
		КонецЕсли;	
	Иначе
		//Раскручивание структуры подчиненности
		МассивПеремещений = КритерииОтбора.СтруктураПодчиненности.Найти(СтрокаЗаявки.Ссылка);
		ВсегоВМассиве = МассивПеремещений.Количество();
		Если ВсегоВМассиве = 0 Тогда
			//Нет  перемещений  - дальше нечего раскручивать
			//Проверим статус удаления
			Если СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление Тогда
				ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление;
			ИначеЕсли СтрокаЗаявки.Статус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена Тогда	
				ТекСтатус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена;
			Иначе
				ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО;//"Формирование комплекта БСО";
			КонецЕсли;	
			СтрокаЗаявки.СтатусЗаявки = ТекСтатус;
			Возврат ТекСтатус;
		Иначе
			Если ВсегоВМассиве = 1 Тогда
				ПеремещениеБСО = МассивПеремещений[0];
			Иначе
				//Несколько перемещений
				ПеремещениеБСО = МассивПеремещений[0];
			КонецЕсли;	
			флПроведено = Ложь;
			ЗапросПерем = Новый Запрос("ВЫБРАТЬ
			|	МАКСИМУМ(уб_ПеремещениеБСО.Проведен) КАК Проведен,
			|	МАКСИМУМ(уб_ПеремещениеБСО.Дата) КАК ДатаСтатуса
			|ИЗ
			|	Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
			|ГДЕ
			|	уб_ПеремещениеБСО.Ссылка В(&Ссылка)");
			ЗапросПерем.УстановитьПараметр("Ссылка",МассивПеремещений);
			Выборка = ЗапросПерем.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				флПроведено = Выборка.Проведен;
				СтрокаЗаявки.ДатаСтатуса = Выборка.ДатаСтатуса;
			КонецЕсли;	
			Если НЕ флПроведено Тогда
				//Ни один из документов по БСО не проведен, далее нечего раскручивать
				ТекСтатус = Перечисления.уб_СтатусыЗаявок.ФормированиеКомплектаБСО;//КомплектДокументацииПодготовлен;//"Комплект документации подготовлен";
				СтрокаЗаявки.СтатусЗаявки = ТекСтатус;
				Возврат ТекСтатус;
			Иначе
				//
				//Если ВсегоВМассиве>1 Тогда
				//Проверим не было ли возвратов среди этих перемещений
				ТаблицаВыданногоБСОПОЗаявке = Новый ТаблицаЗначений;
				ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("СК");
				ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("ВидБСО");
				ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("НомерБСО");
				ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("Количество");
				Для СчетчикПеремещений = 0 по ВсегоВМассиве-1 Цикл
					ТекДокумент = МассивПеремещений[СчетчикПеремещений];
					Если НЕ СписокСотрудниковБСО[ТекДокумент.Агент] = Неопределено //.Найти(ТекДокумент.Агент) = Неопределено 
						И СписокСотрудниковБСО[ТекДокумент.АгентКуда] = Неопределено Тогда//И СписокСотрудниковБСО.Найти(ТекДокумент.АгентКуда) = Неопределено Тогда
						//Это Выдача из отдела БСО
						Для каждого СтрокаПеремещения из  ТекДокумент.БСО Цикл
							СтрокаБСО = ТаблицаВыданногоБСОПОЗаявке.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаБСО,СтрокаПеремещения);
							СтрокаБСО.Количество = ?(СтрокаПеремещения.Количество=0,1,СтрокаПеремещения.Количество);
						КонецЦикла;	
					ИначеЕсли СписокСотрудниковБСО[ТекДокумент.Агент] = Неопределено //.Найти(ТекДокумент.Агент) = Неопределено 
						И НЕ СписокСотрудниковБСО[ТекДокумент.АгентКуда] = Неопределено Тогда//И НЕ СписокСотрудниковБСО.Найти(ТекДокумент.АгентКуда) = Неопределено Тогда	
						//Это Возврат в отдел БСО
						Для каждого СтрокаПеремещения из  ТекДокумент.БСО Цикл
							СтрокаБСО = ТаблицаВыданногоБСОПОЗаявке.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаБСО,СтрокаПеремещения);
							СтрокаБСО.Количество = ?(СтрокаПеремещения.Количество = 0, -1, -СтрокаПеремещения.Количество);
						КонецЦикла;	
					ИначеЕсли НЕ СписокСотрудниковБСО[ТекДокумент.Агент] = Неопределено //.Найти(ТекДокумент.Агент) = Неопределено 
						И НЕ СписокСотрудниковБСО[ТекДокумент.АгентКуда] = Неопределено Тогда//И НЕ СписокСотрудниковБСО.Найти(ТекДокумент.АгентКуда) = Неопределено Тогда	
						//Отдел БСО Между собой
					Иначе
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Неведомое перемещение "+ТекДокумент.Агент+"/"+ТекДокумент.АгентКуда);
					КонецЕсли;	
					
				КонецЦикла;	
				Если ТаблицаВыданногоБСОПОЗаявке.Количество()>0 Тогда
					ТаблицаВыданногоБСОПОЗаявке.Свернуть("СК,ВидБСО,НомерБСО","Количество");
					ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("ПоложениеБСО");
					ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("СостояниеБСО");
					ТаблицаВыданногоБСОПОЗаявке.Колонки.Добавить("Агент");
					флЕстьОстатокБСО = Ложь;
					ФлЕстьСданноеБСО = Ложь;
					ФлБСОНаточке     = Ложь;
					Для каждого СтрокаБСО из ТаблицаВыданногоБСОПОЗаявке Цикл
						Если СтрокаБСО.Количество >0 Тогда
							флЕстьОстатокБСО = Истина;
							Срез = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(,Новый Структура("ВидБСО,НомерБСО", СтрокаБСО.ВидБСО, СтрокаБСО.НомерБСО));
							Если Срез.Количество()>0 Тогда
								Подсрез = Срез[0];
								Если Подсрез.ПоложениеБСО =  Перечисления.уб_ПоложенияБСО.ПереданНаТочку Тогда
									ФлБСОНаточке = Истина;
								КонецЕсли;	
								
								Если Подсрез.СостояниеБСО = Перечисления.уб_СостоянияБСО.Испорчен Тогда
									флЕстьОстатокБСО = Ложь;
								КонецЕсли;	
								СтрокаБСО.СостояниеБСО = Подсрез.СостояниеБСО;
								СтрокаБСО.ПоложениеБСО = Подсрез.ПоложениеБСО;
								СтрокаБСО.Агент  = Подсрез.Агент;
							КонецЕсли;	
						ИначеЕсли СтрокаБСО.Количество = 0 Тогда 
							ФлЕстьСданноеБСО = Истина;
						КонецЕсли;	
					КонецЦикла;	
					Если НЕ флЕстьОстатокБСО Тогда
						//все БСО вернули
						//ТекСтатус = Перечисления.уб_СтатусыЗаявок.БСОВозвращено;//"Курьер вернул БСО";				
						ТекСтатус = Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась;//"Курьер вернул БСО";				
						СтрокаЗаявки.СтатусЗаявки = ТекСтатус;
						СтрокаЗаявки.ПоложениеБСО = "Вернулось с точки";
						Возврат ТекСтатус;
					Иначе
						Если ФлБСОНаточке Тогда
							СтрокаЗаявки.ПоложениеБСО = "Передан на точку";
						Иначе	
							СтрокаЗаявки.ПоложениеБСО = "Вернулось с точки";
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			СтрокаЗаявки.ТаблицаБСО = ТаблицаВыданногоБСОПОЗаявке; 
			//КонецЕсли;	
			ТекСтатус = Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера;//"БСО на руках у курьера";
			//Ищем приемки
			//Заменить на запрос
			ЗапросПриемки = Новый Запрос ("ВЫБРАТЬ
			|	уб_ПриемкаОплат.ОтчетКассира,
			|	уб_ПриемкаОплат.ОтчетКассира.Проведен,
			|	уб_ПриемкаОплат.ОтчетКассира.ПометкаУдаления КАК ОКУдален,
			|	уб_ПриемкаОплат.ОтчетКассира.Подтверждено КАК ОКПодтвержден,
			|	уб_ПриемкаОплат.Ссылка,
			|	уб_ПриемкаОплат.Дата
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
			|ГДЕ
			|	уб_ПриемкаОплат.СозданНаОсновании В(&СозданНаОсновании)");
			ЗапросПриемки.УстановитьПараметр("СозданНаОсновании", МассивПеремещений);
			//СводныйМассивПриемок = Новый Массив;
			//Для СчетчикПеремещений = 1 по  ВсегоВМассиве Цикл
			//	ТекПеремещение = МассивПеремещений[СчетчикПеремещений-1];
			//	МассивПриемок = КритерииОтбора.СтруктураПодчиненности.Найти(ТекПеремещение);
			//	ВсегоВМассивеПриемок = МассивПриемок.Количество();
			//	Для СчетчикПриемок = 1 по  ВсегоВМассивеПриемок Цикл
			//		Если 
			//		СводныйМассивПриемок.Добавить(МассивПриемок[СчетчикПриемок-1]);
			//	КонецЦикла;	
			//КонецЦикла;
			ВыборкаПриемки = ЗапросПриемки.Выполнить().Выбрать();
			Если ВыборкаПриемки.Количество() = 0 Тогда
				//Курьер еще не отчитался
				СтрокаЗаявки.СтатусЗаявки = ТекСтатус;
				Возврат ТекСтатус;
			Иначе
				//Проверка всех БСО ?
				ТекСтатус = Перечисления.уб_СтатусыЗаявок.КомплектИДеньгиУКассира;//"Комплект и деньги у кассира";
				ФлПроверены = Истина;	
				Пока ВыборкаПриемки.Следующий() Цикл
					Если ВыборкаПриемки.ОтчетКассира.Пустая() Тогда
						ФлПроверены = Ложь;
					ИначеЕсли ВыборкаПриемки.ОКУдален Тогда
						ФлПроверены = Ложь;
					ИначеЕсли НЕ ВыборкаПриемки.ОКПодтвержден Тогда
						ФлПроверены = Ложь;
					Конецесли;	
					СтрокаЗаявки.ДатаСтатуса = ВыборкаПриемки.Дата;
				КонецЦикла;
				Если ФлПроверены = Ложь Тогда
				Иначе	
					ТекСтатус = Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании;//"Деньги в компании";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	СтрокаЗаявки.СтатусЗаявки = ТекСтатус;
	Если ФлЕстьСданноеБСО И ТекСтатус = Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Частично вернули БСО по заявке: "+СтрокаЗаявки.Ссылка);
	КонецЕсли;	
	Возврат ТекСтатус;
	
КонецФункции	

Функция ПолучитьРеквизитыЗаявки(Знач Заявка, СоСтатусом = Ложь) Экспорт
	
	Отказ = Ложь;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Заявки.Ссылка,
	|	Заявки.Менеджер,
	|	Заявки.Курьер,
	|	Заявки.Страхователь,
	|	Заявки.Проведен,
	|	Заявки.ПометкаУдаления,
	|	Заявки.Утверждено КАК Подтверждена,
	|	Заявки.Дата КАК ДатаСтатусаSVS,
	|	Заявки.Статус КАК СтатусSVS,
	|	Заявки.Самовыезд,
	|	Заявки.НомерЗаявки,
	|	Заявки.Номер,
	|	Заявки.Дата,
	|	Заявки.Утверждено КАК Утверждено,
	|	Заявки.НетБСО,
	|	ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка) КАК СтатусЗаявки,
	|	"""" КАК ПоложениеБСО,
	|	"""" КАК Представление,
	|	"""" КАК ТаблицаБСО,
	|	Заявки.БСО.(
	|		Ссылка,
	|		НомерСтроки,
	|		СК,
	|		ВидСП,
	|		ВидБСО,
	|		СтраховаяПремия,
	|		ПредоставленнаяСкидка,
	|		ПредоставленнаяСкидкаПроцент,
	|		ЛимитОтветственности,
	|		Основной,
	|		СуммаВзноса,
	|		Количество,
	|		ОбъектСтрахования,
	|		ДатаНачала,
	|		ДатаОформления,
	|		ДатаОкончания
	|	),
	|	Заявки.Тип,
	|	&ДопПоля,
	|	Заявки.СозданНаОсновании,
	|	ТИПЗНАЧЕНИЯ(Заявки.СозданНаОсновании) КАК ТипОснования
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки";
	Если СоСтатусом Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДопПоля", 
		"ЕСТЬNULL(СЗ.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(СЗ.Доработка, ЛОЖЬ) КАК Доработка,
		|	ЕСТЬNULL(СЗ.ТребуетсяВозвратБСО, ЛОЖЬ) КАК ТребуетсяВозвратБСО,
		|	ЕСТЬNULL(СЗ.Комментарий, """") КАК Комментарий,
		|	ЕСТЬNULL(СЗ.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаСтатуса");
		ТекстЗапроса = ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
		|		ПО (СЗ.Заявка = Заявки.Ссылка)";
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДопПоля", "ЛОЖЬ");
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|ГДЕ
	|	&УсловиеГде
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявки.МоментВремени";
	ТипПараметра = ТипЗнч(Заявка);
	Если ТипПараметра = Тип("Строка") Тогда
		Попытка
			Заявка = Число(Заявка);
			ТипПараметра = Тип("Число");
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_УСЗ.ПолучитьРеквизитыЗаявки(): некорректный параметр Заявка (типзнч Строка), значение: " + Заявка, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	Если Не Отказ Тогда
		Если ТипПараметра = Тип("Число") Тогда
			СтрокаЗамены = "Заявки.Номер = &Номер";
			Запрос.УстановитьПараметр("Номер", Заявка);
		ИначеЕсли ТипПараметра = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			СтрокаЗамены = "Заявки.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",	Заявка);
		Иначе
			Отказ = Истина;
		КонецЕсли;  
		Если Не Отказ Тогда
			ТекстЗапросаСУсловием = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", СтрокаЗамены);
			Запрос.Текст = ТекстЗапросаСУсловием;
			РезультатЗапроса = Запрос.Выполнить();
		КонецЕсли;
	КонецЕсли;
	Если Отказ Или РезультатЗапроса.Пустой() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", 	"ВЫБРАТЬ ПЕРВЫЕ 1");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", "ИСТИНА");
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТЗ = РезультатЗапроса.Выгрузить();
			ТЗ.Очистить();
			ТЗ.Добавить();
		КонецЕсли;
	Иначе
		ТЗ = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Структура = Новый Структура;
	СтрокаТЗ = ТЗ[0];;
	Для каждого Колонка из тз.Колонки Цикл 
		Если Колонка.Имя = "БСО" Тогда
			МассивБСО = Новый Массив;
			
			Для каждого СтрокаБСО из СтрокаТЗ.БСО Цикл
				МассивБСО.добавить(Новый Структура("СК,ВидБСО,СтраховаяПремия,ПредоставленнаяСкидка,СуммаВзноса,ОбъектСтрахования,ДатаНачала,ДатаОкончания,ДатаОформления",
				СтрокаБСО.СК,СтрокаБСО.ВидБСО,СтрокаБСО.СтраховаяПремия,СтрокаБСО.ПредоставленнаяСкидка,СтрокаБСО.СуммаВзноса,СтрокаБСО.ОбъектСтрахования,СтрокаБСО.ДатаНачала,СтрокаБСО.ДатаОкончания,СтрокаБСО.ДатаОформления));
			КонецЦикла;	
			Структура.Вставить(Колонка.Имя,МассивБСО);
		Иначе	
			Структура.Вставить(Колонка.Имя,СтрокаТЗ[Колонка.Имя]);
		КонецЕсли;	
	КонецЦикла;	
	//
	Возврат Структура;
КонецФункции	

Процедура ПроверитьВыполнитьДействиеПоЗаявке(Заявка, Действие, Роль = Неопределено) Экспорт
	
	Если Роль = Неопределено Тогда
		Роль = ПолучитьРольПользователяДляЗаявок();
	КонецЕсли;	
	ТекСтатус = ВернутьСтатусЗаявки (Заявка,ТекущаяДата());
	СтрокаРеквизитов = ПолучитьРеквизитыЗаявки(Заявка);
	СписокВозможныхДействий = ВернутьСписокДействийДляСтатуса(ТекСтатус,СтрокаРеквизитов);
	Если СписокВозможныхДействий.НайтиПоЗначению(Действие) = Неопределено Тогда
		Если ТекСтатус.Пустая() Тогда
			ИдентификаторСтатуса = "ПустаяСсылка";
		Иначе	
			ИндексСтатуса = Перечисления.уб_СтатусыЗаявок.Индекс(ТекСтатус);
			ИдентификаторСтатуса = Метаданные.Перечисления.уб_СтатусыЗаявок.ЗначенияПеречисления[ИндексСтатуса].Имя;
		КонецЕсли;	
		Если Действие = "УстановитьСтатус_" + ИдентификаторСтатуса Тогда
			//Этот статус уже установлен
			ОповеститьДляСервера("Консоль", "Статус " + ИдентификаторСтатуса +  " уже установлен для заявки № " + Заявка.Номер);
		Иначе	
			//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Действие "+ Действие +  " не доступно для "+Заявка);
			ОповеститьДляСервера("Консоль","Действие " + Действие + " не доступно для заявка № " + Заявка.Номер);
		Конецесли;	
	Иначе
		ОповеститьДляСервера("Консоль", "Проверка доступности и вызов действия " + Действие +  "  для заявки № " + Заявка.Номер);
		ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, Действие, СтрокаРеквизитов, Роль);
	КонецЕсли;	
	
КонецПроцедуры

Функция ОтменитьСтатусЗаявки(Заявка, ОтменяемыйСтатус, НомерЗаявки = Неопределено) Экспорт
	
	//Если текущий статус совпадает с переданным
	//устанавливается предыдущий статус
	Результат = Ложь;
	ВыборкаСтатуса = Неопределено;
	ТекСтатус = ВернутьСтатусЗаявки(Заявка, ТекущаяДата(), ВыборкаСтатуса);
	Если ТекСтатус = ОтменяемыйСтатус Тогда
		СтрокаРеквизитов = ПолучитьРеквизитыЗаявки(Заявка);
		Роль = ПолучитьРольПользователяДляЗаявок();
		Результат = ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, "УстановитьПредыдущийСтатус", СтрокаРеквизитов, Роль);
	Иначе
		Если НомерЗаявки = Неопределено Тогда
			НомерЗаявки = Заявка.Номер
		КонецЕсли;
		ОповеститьДляСервера("Консоль", "Нельзя отменить статус: " + ОтменяемыйСтатус + "; Текущий статус: " + ТекСтатус + "  для заявки № " + НомерЗаявки);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ВернутьСписокДействийДляСтатуса(
	ТекСтатус,
	СтрокаРеквизитов,
	ВыводитьСообщения 	= Истина,
	МассивРолей			= "",
	Интерактивные 		= Истина,
	КакМассив = ЛОЖЬ
	) 
	Экспорт
	
	Если МассивРолей = "" Тогда
		МассивРолей = Новый Массив;
	КонецЕсли;	
	ПравоНаДоработкуПослеУтв_ТолькоРСВС = Истина;
	СписокДействий = Новый СписокЗначений;
	Статусы = Перечисления.уб_СтатусыЗаявок;
	ЭтоОператор = НЕ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокОператоров().Найти(ПараметрыСеанса.уб_ТекущееФизЛицо) = Неопределено;
	Если СтрокаРеквизитов.ПометкаУдаления = Истина Тогда
		Если ВыводитьСообщения Тогда
			#Если Клиент Тогда
				Предупреждение("Для помеченной на удаление заявки не могут быть установлены статусы! "+СтрокаРеквизитов.Ссылка);
				ОповеститьДляСервера("Консоль","Для помеченной на удаление заявки не могут быть установлены статусы! "+СтрокаРеквизитов.Ссылка);
			#КонецЕсли
		КонецЕсли;	
		СписокДействий.Добавить("УстановитьСтатус_ЗапросНаУдаление","Отказ от страховки");
	ИначеЕсли ТекСтатус = Статусы.ПустаяСсылка() Тогда
		//СписокДействий.Добавить("УстановитьСтатус_СогласованиеСКлиентом", "Создание заявки");
		//Если Интерактивные Тогда
		//	СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась", "Страховка не состоялась");
		//КонецЕсли;
	ИначеЕсли ТекСтатус = Статусы.СогласованиеСКлиентом Тогда
		СписокДействий.Добавить("УстановитьСтатус_ЗапросНаУдаление","Отказ от страховки");
		//Если СтрокаРеквизитов.Самовыезд Тогда
			СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО", "Формирование комплекта БСО");
		//Иначе
		//	СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
		//КонецЕсли;	
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась", "Страховка не состоялась");
		КонецЕсли;
		СписокДействий.Добавить("УстановитьСтатус_ЗапросНаУдаление", "Отказ от страховки");
	ИначеЕсли ТекСтатус = Статусы.НазначениеКурьера Тогда
		//Если Не ((ЕстьРоль("Менеджер", МассивРолей) И Не (ЕстьРоль("РСВС", МассивРолей) Или ЕстьРоль("ПолныеПрава", МассивРолей))) И Не СтрокаРеквизитов.Самовыезд) Тогда
			СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО","Формирование комплекта БСО");
		//КонецЕсли;	
		СписокДействий.Добавить("УстановитьСтатус_ЗаявкаВПечати",	"Заявка в печати");
		//СписокДействий.Добавить("УстановитьСтатус_СогласованиеСКлиентом_Доработка", "Отменить заявку");
		СписокДействий.Добавить("УстановитьСтатус_БСОНаРукахУКурьера", "Заявка у курьера");
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");
		КонецЕсли;
		СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
	
		СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
	ИначеЕсли ТекСтатус = Статусы.ФормированиеКомплектаБСО Тогда
		
		//ВозможноНаДоработку = ?(ЕстьРоль("Контроль", МассивРолей) или ЕстьРоль("РСВС", МассивРолей) или ЕстьРоль("Печать", МассивРолей) или ЕстьРоль("ПолныеПрава", МассивРолей), Истина, ?(ПравоНаДоработкуПослеУтв_ТолькоРСВС, Ложь, Истина));
		//Если ВозможноНаДоработку Тогда
			СписокДействий.Добавить("УстановитьСтатус_СогласованиеСКлиентом_Доработка", "Создание заявки");
	//	КонецЕсли;	

		Если Интерактивные Тогда		
			СписокДействий.Добавить("СоздатьПеремещениеБСО", "Создать перемещение БСО");	
		КонецЕсли;
		СписокДействий.Добавить("УстановитьСтатус_ЗаявкаВПечати",	"Заявка в печати");
		
		Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
			СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
		КонецЕсли;
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась", "Страховка не состоялась");
			СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана", "Заявка отработана без приемки денег");
		КонецЕсли;
		//СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",	"Страховка состоялась");
		//Если ЕстьРоль("ПолныеПрава", МассивРолей) Тогда
			
		//КонецЕсли;
		СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
	ИначеЕсли ТекСтатус = Статусы.ЗаявкаВПечати Тогда
		//	Если Интерактивные Тогда		
	//		Если ЕстьПеремещениеПоЗаявке (СтрокаРеквизитов.Ссылка) Тогда
	        СписокДействий.Добавить("УстановитьСтатус_СогласованиеСКлиентом_Доработка", "Создание заявки");
			СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО","Формирование комплекта БСО");
	        Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
				СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
			КонецЕсли;
			СписокДействий.Добавить("УстановитьСтатус_БСОНаРукахУКурьера", "Заявка у курьера");
	//		КонецЕсли;	
			//ВозможноНаДоработку = ?(ЕстьРоль("РСВС", МассивРолей), Истина, ?(ПравоНаДоработкуПослеУтв_ТолькоРСВС, Ложь, Истина));
			//Если ВозможноНаДоработку Тогда
			
			//КонецЕсли;	
			
			//Если Не СтрокаРеквизитов.Самовыезд Тогда
			//	СписокДействий.Добавить("ИзменитьКурьера", "Cменить курьера");
			//КонецЕсли;	
			
			
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
				СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");
				//СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
				СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
			КонецЕсли;
			СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
	
			СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
			
		ИначеЕсли ТекСтатус = Статусы.КомплектДокументацииПодготовлен Тогда
			СписокДействий.Добавить("УстановитьСтатус_ЗаявкаВПечати",	"Заявка в печати");
			Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
				СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
			КонецЕсли;
				//	Если Интерактивные Тогда		
	//		Если ЕстьПеремещениеПоЗаявке (СтрокаРеквизитов.Ссылка) Тогда
	//			СписокДействий.Добавить("УстановитьСтатус_БСОНаРукахУКурьера", "Заявка у курьера");
	//		КонецЕсли;	
	//		ВозможноНаДоработку = ?(ЕстьРоль("РСВС", МассивРолей), Истина, ?(ПравоНаДоработкуПослеУтв_ТолькоРСВС, Ложь, Истина));
	//		Если ВозможноНаДоработку Тогда
	//			СписокДействий.Добавить("УстановитьСтатус_СогласованиеСКлиентом_Доработка", "Создание заявки");
	//		КонецЕсли;	
	//		Если Не СтрокаРеквизитов.Самовыезд Тогда
	//			СписокДействий.Добавить("ИзменитьКурьера", "Cменить курьера");
	//		КонецЕсли;	
	//	КонецЕсли;	
	//	КонецЕсли;	
	СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
	ИначеЕсли ТекСтатус = Статусы.БСОНаРукахУКурьера Тогда
		//СписокДействий.Добавить("УстановитьСтатус_КурьерНаВыезде", "Выехал из офиса по заявке");
		Если Интерактивные Тогда		
			СписокДействий.Добавить("СоздатьПеремещениеБСО_ВозвратЗаменаБСО",		"Создать перемещение на возврат");
			//СписокДействий.Добавить("СоздатьПеремещениеБСО_ВозвратЗаменаКурьера",	"Создать перемещение на возврат. ЗАМЕНА Курьера");
			//СписокДействий.Добавить("СоздатьПеремещениеБСО_ВозвратНеСостоялась",	"Создать перемещение на возврат полного комплекта БСО. Не состоялась");
		КонецЕсли;
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");
			СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
		КонецЕсли;
		//СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
		
		СписокДействий.Добавить("УстановитьСтатус_ЗаявкаВПечати",		"Заявка в печати");
		
		Если Не ((ЕстьРоль("Менеджер", МассивРолей) И Не (ЕстьРоль("РСВС", МассивРолей) Или ЕстьРоль("ПолныеПрава", МассивРолей))) И Не СтрокаРеквизитов.Самовыезд) Тогда
			СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО","Формирование комплекта БСО");
		КонецЕсли;	
		
		СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
		СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
		//Если Интерактивные Тогда		
		//	СписокДействий.Добавить("ВнестиИзменения",	"Внести изменения");	
		//	//СписокДействий.Добавить("ПроверитьБСО",		"Проверить: требуется ли возврат БСО");
		//КонецЕсли;	
	//ИначеЕсли ТекСтатус = Статусы.КурьерНаВыезде Тогда
	//	//СписокДействий.Добавить("УстановитьСтатус_КурьерПрибылПоАдресу",	"Отметить ""Курьер прибыл на место встречи с клиентом""");
	//	СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
	//	СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");
	//	СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
	//	Если Интерактивные Тогда		
	//		СписокДействий.Добавить("ВнестиИзменения",	"Внести изменения");	
	//		СписокДействий.Добавить("ПроверитьБСО",		"Проверить: требуется ли возврат БСО");
	//	КонецЕсли;
	//ИначеЕсли ТекСтатус = Статусы.КурьерПрибылПоАдресу Тогда
	//	СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
	//	СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");	
	//	СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
	//	Если Интерактивные Тогда		
	//		СписокДействий.Добавить("ВнестиИзменения",	"Внести изменения");	
	//		СписокДействий.Добавить("ПроверитьБСО",		"Проверить: требуется ли возврат БСО");
	//	КонецЕсли;	
	ИначеЕсли ТекСтатус = Статусы.СтраховкаНеСостоялась Тогда	
		Если Интерактивные Тогда		
			СписокДействий.Добавить("СоздатьПеремещениеБСО_Возврат","Создать перемещение на возврат полного комплекта БСО");
			СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;		
		
		СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО", "Формирование комплекта БСО");
		Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
			СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
		КонецЕсли;
		//СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
		КонецЕсли;	
	ИначеЕсли ТекСтатус = Статусы.СтраховкаСостоялась Тогда
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");		
			СписокДействий.Добавить("СоздатьПеремещениеБСО_Возврат",	"Создать перемещение на возврат полного комплекта БСО");
			СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
		КонецЕсли;
		//
		СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО", "Формирование комплекта БСО");
		Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
			СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
		КонецЕсли;
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");	
			СписокДействий.Добавить("УстановитьСтатус_ЗаявкаОтработана",		"Заявка отработана без приемки денег");
		КонецЕсли;	
		СписокДействий.Добавить("УстановитьПредыдущийСтатус", "Установить предыдущий статус (текущий статус некорректен)");
		
		//СписокДействий.Добавить("УстановитьСтатус_КомплектИДеньгиУКассира","Отметить наличие приемки по заявке");	
		//СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
		СписокДействий.Добавить("УстановитьСтатус_КомплектНаХраненииВБухгалтерии","Принять комплект документов на хранение в бухгалтерию");	
		//	ИначеЕсли ТекСтатус = Статусы.БСОВозвращено Тогда
		//Полностью возвращено БСО
	ИначеЕсли ТекСтатус = Статусы.ЗаявкаОтработана Тогда
		СписокДействий.Добавить("УстановитьСтатус_ФормированиеКомплектаБСО", "Формирование комплекта БСО");
		Если ЭтоОператор = ЛОЖЬ или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОтделПечати, Ложь)  Тогда
			СписокДействий.Добавить("УстановитьСтатус_НазначениеКурьера", "Комплект подготовлен");	
		КонецЕсли;
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьСтраховкаНеСостоялась, Ложь) Тогда
			СписокДействий.Добавить("УстановитьСтатус_СтраховкаНеСостоялась",	"Страховка не состоялась");	
		КонецЕсли;	
        //СписокДействий.Добавить("УстановитьСтатус_СтраховкаСостоялась",		"Страховка состоялась");	
	ИначеЕсли ТекСтатус = Статусы.КомплектНаХраненииВБухгалтерии Тогда	
		СписокДействий.Добавить("УстановитьПредыдущийСтатус","Вернуть комплект документов курьеру");		
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;
		СписокДействий.Добавить("СоздатьПриемкуОплат",				"Создать приемку денег");
		СписокДействий.Добавить("СоздатьПеремещениеБСО",			"Создать перемещение БСО");
		
	ИначеЕсли ТекСтатус = Статусы.КомплектИДеньгиУКассира Тогда	
		//нельзя ставить статус вручную
		СписокДействий.Добавить("УстановитьСтатус_ДеньгиВКомпании",	"Отметить отчет кассира проверенным");	
		СписокДействий.Добавить("ДвижениеСтатусовОтчетКассира", 	"Проверить отчет кассира");
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;
	ИначеЕсли ТекСтатус = Статусы.ДеньгиВКомпании Тогда	
		// Убрать в архив
		СписокДействий.Добавить("ДвижениеСтатусовОтчетКассира", "Проверить отчет кассира");
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;
	ИначеЕсли ТекСтатус = Статусы.ЗапросНаУдаление Тогда		
		// Убрать в архив
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;
	ИначеЕсли ТекСтатус = Статусы.Удалена Тогда			
		// Убрать в архив
		Если Интерактивные Тогда		
			//СписокДействий.Добавить("ПроверитьБСО","Проверить: требуется ли возврат БСО");
		КонецЕсли;
	КонецЕсли;		
	Если Интерактивные Тогда
		СписокДействий.Добавить("ПроверитьБСО",				"Проверить: требуется ли возврат БСО");
		СписокДействий.Добавить("ПроверитьПеремещения",		"Проверить: при необходимости создать перемещение");
		СписокДействий.Добавить("СтруктураПодчиненности",	"Показать структуру подчиненности");
		СписокДействий.Добавить("ПоказатьТаблицуБСО",		"Показать таблицу выданного БСО");
		СписокДействий.Добавить("ИсторияЗаявки",	"История заявки");
	КонецЕсли;
	Если КакМассив = Истина Тогда
		Массив = Новый Массив;
		Для каждого Элемент из СписокДействий Цикл
			Массив.Добавить(Новый Структура("Значение,Представление,Картинка",Элемент.Значение,Элемент.Представление,Элемент.Картинка));
		КонецЦикла;
		Возврат Массив
		//Возврат СписокДействий.ВыгрузитьЗначения();
	Иначе	
		Возврат СписокДействий;
	КонецЕсли;	
	
КонецФункции	

//TODO упразднить реквизит СтрокаРеквизитов для этой функции
//Результат: Истина - были перепроведены какие либо объекты, либо изменены статусы заявок
//	иначе Ложь
Функция ВыполнитьДействиеПоЗаявке(
	Заявка, 
	ТекСтатус				= Неопределено, 
	Действие, 
	СтрокаРеквизитов 		= Неопределено, 
	Знач МассивРолей		= Неопределено, 
	ТекстКоманды 			= "",
	ТребуетсяВозвратБСО		= Неопределено,
	ФормаИлиОбъектЗаявки	= Неопределено,
	Комментарий				= "",
	Предупреждать			= Истина
	) Экспорт
	//

	Результат = Ложь;
	ЭтоФорма = ФормаИлиОбъектЗаявки <> Неопределено и ТипЗнч(ФормаИлиОбъектЗаявки) <> Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста");
	Если МассивРолей = Неопределено Тогда
		МассивРолей = уб_УСЗ.ПолучитьРольПользователяДляЗаявок(, Истина)
	КонецЕсли;
	//Если СтрокаРеквизитов = Неопределено Тогда
	//	СтрокаРеквизитов = уб_УСЗ.ПолучитьРеквизитыЗаявки(Заявка);
	//КонецЕсли;
	Если 
		(ТекСтатус = Неопределено Или ТекСтатус = Перечисления.уб_СтатусыЗаявок.ПустаяСсылка())
		И Действие <> "ПроверитьБСО" //TODO некоторым действиям статус не нужен
		Тогда
		Попытка
			Если Заявка.Дата < Дата(2012,6,5) Тогда
				ОповеститьДляСервера("Консоль"," "+ Заявка + " до 05.06.12");
				Если Предупреждать Тогда
				#Если клиент Тогда
					Предупреждение("Действия над заявками до 05.06.12 не производятся",1);
				#КонецЕсли
				КонецЕсли;
				Возврат Ложь;
			КонецЕсли;	
		Исключение	
			ОповеститьДляСервера("Консоль","" + Заявка + " не доступна!");
		КонецПопытки;
	КонецЕсли;
	Статусы = Перечисления.уб_СтатусыЗаявок;	
	Если Не ПустаяСтрока(ТекстКоманды) И Найти("ВнестиИзменения,СтруктураПодчиненности,ПоказатьТаблицуБСО,ИзменитьКурьера,СоздатьПеремещениеБСО,СоздатьПриемкуОплат,ПроверитьБСО,ИсторияЗаявки,", Действие + ",") = 0 Тогда
		//Остальные действия производятся с подтверждением
		Если Предупреждать Тогда
		#Если Клиент Тогда
			КомандаПодсказки ="
			|Ш Подсказка о подтверждении действия
			|Р Требуется ваш ответ в диалоге
			|НП
			|СС Если нажмёте «Да» действие будет выполнено
			|СС Если нажмёте «Нет» или «Отмена» - никаких действий не будет произведено
			|КП
			|П";
			ОповеститьДляСервера("Подсказка", КомандаПодсказки);
			Ответ = Вопрос(ТекстКоманды + "?", РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Нет, "Подтверждение действия:",КодВозвратаДиалога.Нет);
			Если Не Ответ = КодВозвратаДиалога.Да  Тогда
				ОповеститьДляСервера("Консоль", "Не получено подтверждение для выполнения действия «" + ТекстКоманды + "»");
				Возврат Ложь;
			КонецЕсли;	
		#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(Действие) Тогда
	ИначеЕсли Действие = "ВнестиИзменения" Тогда 
		Обработка = Обработки.уб_СтатусыЗаявок;
		Форма = Обработка.ПолучитьФорму("ВнестиИзменения");
		Форма.Заявка = Заявка;
		СписокРолей = Новый СписокЗначений;
		СписокРолей.ЗагрузитьЗначения(МассивРолей);
		Форма.СписокРолей = СписокРолей;
		Форма.ОткрытьМодально();
		ОповеститьДляСервера("Консоль","Открытие формы «Внести изменения»");
		флВремяМесто       = Форма.флВремяМесто;
		флИзменениеКурьера = Форма.флИзменениеКурьера; 
		флСоставБСО        = Форма.флСоставБСО;
		Комментарий = Форма.Комментарий;
		Если Не (флВремяМесто Или флИзменениеКурьера Или флСоставБСО) Тогда
			ОповеститьДляСервера("Консоль","Ничего не отмечено.");
		Иначе
			Если флВремяМесто Или флИзменениеКурьера Тогда
				//флаг утверждено надо исправлять?
				НовыйДействие 	= "УстановитьСтатус_НазначениеКурьера";
				НовыйСтатус		= "НазначениеКурьера";
			ИначеЕсли флСоставБСО Тогда	
				НовыйДействие 	= "УстановитьСтатус_ФормированиеКомплектаБСО";
				НовыйСтатус		= "ФормированиеКомплектаБСО";
			Иначе 
				НовыйДействие = Неопределено;	
			КонецЕсли;	
			Если НовыйДействие <> Неопределено Тогда	
				Доработка = Истина;
				Результат = ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, НовыйДействие, СтрокаРеквизитов, ТекстКоманды, ТребуетсяВозвратБСО, ФормаИлиОбъектЗаявки);
				Если Результат Тогда
					Если Не ЕстьРоль("Менеджер", МассивРолей) Тогда
						Уведомление("Изменился статус: " + НовыйСтатус, "Менеджер", Заявка, "Изменился статус");
					КонецЕсли;
					Если Не ЕстьРоль("РСВС",МассивРолей) Тогда
						Уведомление("Изменился статус: " + НовыйСтатус, "РСВС", Заявка, "Изменился статус");
					КонецЕсли;
					Если Не ЕстьРоль("сБСО", МассивРолей) и флСоставБСО  Тогда
						Уведомление("Изменился статус: " + НовыйСтатус + ", требуется расформировать комплект БСО ", "сБСО", Заявка, "Расформировать");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Действие = "ИзменитьКурьера" Тогда 
		//РСВС при замене курьера, без изменения комплекта БСО 
		КурьерДо = Заявка.Курьер;
		Форма = Заявка.ПолучитьФорму();
		//TODO заявка при изменении должна
		Форма.ОткрытьМодально();
		ОповеститьДляСервера("Консоль", "Открытие формы заявки для изменения курьера");
		КурьерПосле = Заявка.Курьер;
		Если КурьерДо <> КурьерПосле Тогда
			Уведомление("Поменялся курьер в заявке: " + Заявка + " " + КурьерДо + "/" + КурьерПосле, "сБСО", Заявка, "Изменился курьер");
		КонецЕсли;	
	ИначеЕсли Действие = "ПоказатьТаблицуБСО" Тогда 
		#Если Клиент Тогда
			//TODO получать все реквизиты и дополнительные данные по заявке в одном запросе
			//или передавать полученные ранее
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	З.Номер,
			|	З.Курьер
			|ИЗ
			|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
			|ГДЕ
			|	З.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Заявка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Форма = Обработки.уб_СтатусыЗаявок.ПолучитьФорму("ФормаТаблицыБСО");
				Форма.Заявка 	= Заявка;
				Форма.Заголовок = "Таблица БСО по заявке № " + Выборка.Номер + " " + Выборка.Курьер;
				Форма.Открыть();
			КонецЕсли;
		#КонецЕсли
	ИначеЕсли Действие = "ПроверитьБСО" Тогда 
		тзСреза = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних( , Новый Структура("Заявка",Заявка)); 
		Если тзСреза.Количество() >= 1 Тогда
			ТекТребуетсяВозвратБСО = тзСреза[0].ТребуетсяВозвратБСО;
			Если ТребуетсяВозвратБСО = Неопределено Тогда
				ТребуетсяВозвратБСО = ПолучитьТаблицуБСОПоЗаявке(Заявка).Количество() > 0
			КонецЕсли;
			Если Не ТекТребуетсяВозвратБСО = ТребуетсяВозвратБСО Тогда
				Комментарий = "Проверка БСО";
				НовыйСтатус = тзСреза[0].Статус;
				Результат = УстановитьСтатусЗаявки(Заявка, тзСреза[0].Статус, Комментарий, тзСреза[0].Доработка,, ТребуетсяВозвратБСО);
				//#Если Клиент Тогда
				//	Сообщить("ЕСТЬ изменения заявки № " + СтрЗаменить(Заявка.Номер, Символ(160), "") + ": " + ?(ТребуетсяВозвратБСО, "", " не") + " требуется возврат БСО.")
				//#КонецЕсли
			КонецЕсли; 
		Иначе
			ОповеститьДляСервера("Консоль", "Не обнаружен текущий статус по заявке № " + Заявка.Номер);
		КонецЕсли;
	ИначеЕсли Действие = "ПроверитьПеремещения" Тогда 
		тзСреза = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних( , Новый Структура("Заявка",Заявка)); 
		ТекСтатус = тзСреза[0].Статус;
		уб_УСЗ.ПроверитьПеремещения(Заявка,ТекСтатус);
	ИначеЕсли Действие = "СоздатьПеремещениеБСО" Тогда 
		//сБСО
		Отказ 			= Ложь;
		ЗадаватьВопрос 	= Истина;
		МассивПеремещений = Новый Массив;
		Если ЕстьПеремещениеПоЗаявке(Заявка,, МассивПеремещений) Тогда
			#Если Клиент Тогда
				КомандаПодсказки ="
				|Ш Подсказка для заявки № "+Заявка.Номер+"
				|Р Требуется ваш ответ в диалоге
				|НП
				|СС Если нажмёте «Да»  - Откроется существующий документ
				|СС «Нет» - Откроется диалог создания нового документа Перемещение БСО
				|СС «Отмена» - никаких действий не будет произведено
				|КП
				|П";
				ОповеститьДляСервера("Подсказка",КомандаПодсказки);
				Ответ = Вопрос("Открыть документ? (Да - Откроется существующий документ, Нет - создаем новый документ, Отмена - никаких действий",РежимДиалогаВопрос.ДаНетОтмена,,,"Уже есть созданный документ 'Перемещение БСО'");
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Если МассивПеремещений.Количество() = 1 Тогда
						ВыбПеремещение = МассивПеремещений[0];
					Иначе
						ВыбПеремещение = ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
					КонецЕсли;	
					Если ВыбПеремещение <> Неопределено Тогда
						ВыбПеремещение.ПолучитьФорму().Открыть();
						ОповеститьДляСервера("Консоль","Открыто существующее перемещение " + ВыбПеремещение + " по :" + Заявка.Номер);
					Иначе
						ЗадаватьВопрос  = Ложь;
					КонецЕсли;
				ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
					ЗадаватьВопрос  = Ложь;
				Иначе
					ОповеститьДляСервера("Консоль", "Отмена создания перемещения при уже существующем по :" + Заявка.Номер);
					Отказ = Истина;
				Конецесли;	
			#Конецесли
		КонецЕсли;
		Если ЗадаватьВопрос Тогда
			#Если Клиент Тогда
			КомандаПодсказки ="
			|Ш Подсказка для заявки № " + Заявка.Номер + "
			|Р Требуется Ваш ответ в диалоге
			|НП
			|СС Если нажмёте «Да»  - Откроется диалог создания нового документа Перемещение БСО
			|СС «Нет» - никаких действий не будет произведено
			|П";
			ОповеститьДляСервера("Подсказка", КомандаПодсказки);
			Ответ = Вопрос(ТекстКоманды + "?", РежимДиалогаВопрос.ДаНет,,, "Подтверждение действия:");
			Если Не Ответ = КодВозвратаДиалога.Да Тогда
				ОповеститьДляСервера("Консоль", "Не получено подтверждение для выполнения действия «" + ТекстКоманды + "»");
				Возврат Ложь;
			КонецЕсли;	
			#КонецЕсли
		КонецЕсли;
		Если Не Отказ Тогда
			нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("Документ",	Заявка);
			СтруктураЗаполнения.Вставить("Проверять",	Ложь);
			нДокумент.Заполнить(СтруктураЗаполнения);
			нДокумент.ПолучитьФорму().Открыть();
			ОповеститьДляСервера("Консоль", "Создано перемещение на основании заявки № " + Заявка.Номер);
		КонецЕсли;
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_Возврат" Тогда 
		//сБСО
		МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			//ВыбПеремещение  = ВыбратьПеремещениеИзМассива(МассивПеремещений);
			ВыбПеремещение = ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		нДокумент.Заполнить(ВыбПеремещение);
		Форма = нДокумент.ПолучитьФорму();
		Форма.Открыть();
		ТекстОповещения = "Создано перемещение";
		Если ВыбПеремещение <> Неопределено Тогда
			ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		КонецЕсли;
		ОповеститьДляСервера("Консоль", ТекстОповещения);
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратНеСостоялась" Тогда 
		//сБСО
		МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		ВсегоПеремещений = МассивПеремещений.Количество();
		//Если ВсегоПеремещений = 0 Тогда
		//	#Если Клиент Тогда
		//	Предупреждение("Не обнаружено перемещений БСО, связанных с этой заявкой. Невозможно продолжить операцию!",,"Не найдены выданные БСО");	
		//	#КонецЕсли
		//    Возврат Ложь;
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			//ВыбПеремещение  = ВыбратьПеремещениеИзМассива(МассивПеремещений);
			ВыбПеремещение = ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		нДокумент.Заполнить(ВыбПеремещение);
		КомандаПодсказки = "
		|Ш Подсказка для заявки № " + Заявка.Номер + "
		|Р «Возврат БСО. Страховка не состоялась»				
		|НН
		|СС Проверьте состав БСО
		|СС После проведения и закрытия документа для Заявки "+ Заявка.Номер +" будет установлен статус «Страховка не состоялась»
		|СС Затем в заявке автоматически будет изменен курьер, если это необходимо.
		|КН
		|П
		|Ж";//Ждем 
		ОповеститьДляСервера("Подсказка", КомандаПодсказки);
		Форма  = нДокумент.ПолучитьФорму();
		Форма.Заголовок = "Проверьте состав БСО. После проведения и закрытия для Заявки "+ Заявка.Номер +" будет установлен статус «Страховка не состоялась»";
		Форма.ОткрытьМодально();
		ОповеститьДляСервера("Подсказка",	"НЖ");
		ТекстОповещения = "Создано перемещение";
		Если ВыбПеремещение <> Неопределено Тогда
			ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		КонецЕсли;
		ОповеститьДляСервера("Консоль",	ТекстОповещения);	
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратЗаменаБСО" Тогда 
		//сБСО
		МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		ВсегоПеремещений = МассивПеремещений.Количество();
		//Если ВсегоПеремещений = 0 Тогда
		//	#Если Клиент Тогда
		//	Предупреждение("Не обнаружено перемещений БСО, связанных с этой заявкой. Невозможно продолжить операцию!",,"Не найдены выданные БСО");	
		//	#КонецЕсли
		//  Возврат Ложь;	
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			//ВыбПеремещение = ВыбратьПеремещениеИзМассива(МассивПеремещений);
			ВыбПеремещение = ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		нДокумент.Заполнить(ВыбПеремещение);
		КомандаПодсказки ="
		|Ш Подсказка для заявки № " + Заявка.Номер + "
		|Р «Возврат БСО. Страховка не состоялась»				
		|НН
		|СС Проверьте состав БСО
		|СС После проведения и закрытия документа для Заявки "+Заявка.Номер +" будет установлен статус «Формирование комплекта БСО»
		|КН
		|П
		|Ж";//Ждем 
		ОповеститьДляСервера("Подсказка",КомандаПодсказки);
		Форма  = нДокумент.ПолучитьФорму();
		Форма.Заголовок = "Проверьте состав БСО. После проведения и закрытия для Заявки " + Заявка.Номер + " будет установлен статус «Формирование комплекта БСО». ";
		Форма.ОткрытьМодально();
		ОповеститьДляСервера("Подсказка","НЖ");
		ТекстОповещения = "Создано перемещение";
		Если ВыбПеремещение <> Неопределено Тогда
			ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		КонецЕсли;
		ОповеститьДляСервера("Консоль", ТекстОповещения);
		Если Не нДокумент.Ссылка.Пустая() Тогда
			Комментарий = "Возврат/замена";
			Результат = ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, "УстановитьСтатус_ФормированиеКомплектаБСО", СтрокаРеквизитов, МассивРолей, ТекстКоманды, ТребуетсяВозвратБСО, ФормаИлиОбъектЗаявки, Комментарий, Ложь);
			Если Результат Тогда
				ОповеститьДляСервера("Консоль", "Установлен статус Формирование комплекта БСО:" + Заявка);
			КонецЕсли;
			нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
			нДокумент.Заполнить(Заявка);
			Форма = нДокумент.ПолучитьФорму();
			Форма.Заголовок = "Измените/Добавьте БСО по замене";
			Форма.Открыть();
		КонецЕсли;	
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратЗаменаКурьера" Тогда 
		МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			ВыбПеремещение = ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		нДокумент.Заполнить(ВыбПеремещение);
		КомандаПодсказки = "
		|Ш Подсказка для заявки № "+Заявка.Номер+"
		|Р «Замена курьера»				
		|НН
		|СС Проверьте состав БСО
		|СС Измените «Агента куда» на нового курьера
		|СС После проведения и закрытия для Заявки "+Заявка.Номер +" будет установлен статус «БСО на руках у курьера»
		|СС Затем в заявке автоматически будет изменен курьер, если это необходимо.
		|КН
		|П
		|Ж";//Ждем 
		ОповеститьДляСервера("Подсказка", КомандаПодсказки);
		Форма = нДокумент.ПолучитьФорму();
		Форма.Заголовок = "Проверьте состав БСО. Измените «Агента куда» на нового курьера. После проведения и закрытия для Заявки " + Заявка.Номер + " будет установлен статус «БСО на руках», и в заявке будет заменен курьер.";
		Форма.ОткрытьМодально();
		ОповеститьДляСервера("Подсказка",	"НЖ"); //"Не ждем" Разрешаем прочий вывод
		ТекстОповещения = "Создано перемещение";
		Если ВыбПеремещение <> Неопределено Тогда
			ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		КонецЕсли;
		ОповеститьДляСервера("Консоль",	ТекстОповещения);
		//Не использовать! Если перемещение будет записано/даже закрыта форма без записи но объект останется возьмется значение курьера (пустое/другого типа)
		//перетрет курьера/установит курьера для самовыезда
		//	Если нДокумент.Ссылка = Неопределено  Тогда
		//	Иначе
		//		Если Заявка.Курьер <> нДокумент.АгентКуда И нДокумент.АгентКуда<>ВыбПеремещение.Агент Тогда
		//			Об = Заявка.Ссылка.ПолучитьОбъект();
		//			Об.Курьер  = нДокумент.АгентКуда;
		//			Попытка
		//				Об.Записать();
		//			Исключение
		//				Возврат Ложь;
		//			КонецПопытки;	
		//		КонецЕсли;	
		//		Комментарий = "Возврат/замена курьера";
		//		ОповеститьДляСервера("Консоль","Установлен статус БСО на руках:" + Заявка);
		//		УстановитьСтатусЗаявки(Заявка, Статусы.БСОНаРукахУКурьера, Комментарий,, ТребуетсяВозвратБСО);
		//	КонецЕсли;	
		//Исключение  
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине "+РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
		//КонецПопытки	
	ИначеЕсли Действие = "СоздатьПриемкуОплат" Тогда 
		//Кассир
		
		ЭтоЕОСАГО = Ложь;
		БСО = ЗапросПоБСО(Заявка);
		Если БСО.Количество() > 0 Тогда
			СуммаВзноса = 0;
			СуммаПрочих = 0;
			СуммаЕОсаго = 0;
			УИДПРОЧИХ="";
			Для каждого Строка из БСО Цикл
				СуммаВзноса = СуммаВзноса + Строка.ИтогСтраховаяПремия;
				Если Строка.ЭтоКорень Тогда
					Если Строка(Строка.ВидБСО) = "Е-ОСАГО" Тогда
						ЭтоЕОСАГО = Истина;
						УИДПРОЧИХ = Строка.УидСтроки;
						СуммаЕОсаго = СуммаЕОсаго+ Строка.ИтогСтраховаяПремия;
					КонецЕсли;	
				Иначе
					Если Строка.УидРодителя = УИДПРОЧИХ Тогда
						СуммаПрочих = СуммаПрочих + Строка.ИтогСтраховаяПремия;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
			Если ЭтоЕОСАГО = Истина Тогда
				//Сообщить(СуммаВзноса);
				//Сообщить(СуммаПрочих);
				нДокумент = Документы.уб_ПриемкаОплат.СоздатьДокумент();
				
				нДокумент.ПринятоОТ = Заявка.Менеджер;
				
				СтрокаП = нДокумент.Платежи.Добавить();
				СтрокаП.УИДСтроки    = Новый УникальныйИдентификатор;
				СтрокаП.ФормаОплаты  = Перечисления.уб_ФормыОплаты.Безнал;
				СтрокаП.Сумма        = СуммаВзноса;
				СтрокаП.СуммаВВалюте = СуммаВзноса;  
				СтрокаП.Валюта         = Константы.ВалютаРегламентированногоУчета.Получить();
				СтрокаП.Курс         = 1;
				//СтрокаП.ДатаКурса    = 1;
				СтрокаП.Кратность    = 1;
				//СтрокаП.НомерОбосновывающегоДокумента  
				//СтрокаП.ДатаОбосновывающегоДокумента
				СтрокаП.ОбоснованиеРазницы  = "Перечислил клиент";
				СтрокаП.Комментарий         = "";
				СтрокаП.Заявка              = Заявка;
				СтрокаП.ОтсутствуетВОплатах = Ложь;
				//
				СтрокаП = нДокумент.Платежи.Добавить();
				СтрокаП.УИДСтроки    = Новый УникальныйИдентификатор;
				СтрокаП.ФормаОплаты  = Перечисления.уб_ФормыОплаты.Поставщику;
				СтрокаП.Сумма        = - (СуммаЕОсаго);
				СтрокаП.СуммаВВалюте = - (СуммаЕОсаго);  
				СтрокаП.Валюта         = Константы.ВалютаРегламентированногоУчета.Получить();
				СтрокаП.Курс         = 1;
				//СтрокаП.ДатаКурса    = 1;
				СтрокаП.Кратность    = 1;
				//СтрокаП.НомерОбосновывающегоДокумента  
				//СтрокаП.ДатаОбосновывающегоДокумента
				СтрокаП.ОбоснованиеРазницы  = "Отправим в СК";
				СтрокаП.Комментарий         = "";
				СтрокаП.Заявка              = Заявка;
				СтрокаП.ОтсутствуетВОплатах = Ложь;
				
				Для каждого Строка из БСО Цикл
					Если Строка.ЭтоКорень = Ложь и Строка.УидРодителя = УИДПРОЧИХ Тогда
						СтрокаПолиса = нДокумент.Полисы.Добавить();
						СтрокаПолиса.ВидБСО                     = Строка.ВидБСО; 
						СтрокаПолиса.Заявка                     = Заявка;
						СтрокаПолиса.Поставщик                  = Строка.СК;
						СтрокаПолиса.ОрганизацияАгент           = ?(Строка.ОрганизацияАгент.Пустая(),Справочники.Организации.НайтиПоКоду("000000020"),Строка.ОрганизацияАгент);//Строка.ОрганизацияАгент;
						СтрокаПолиса.СК                         = Строка.СК;
						СтрокаПолиса.НомерБСО                   = "б/н";
						СтрокаПолиса.НомерПолиса                = "б/н";
						СтрокаПолиса.НомерКвитанции             = "";
						//СтрокаПолиса.ПоставщикКвитанции         =   ;
						//СтрокаПолиса.ОрганизацияАгентКвитанции  =   ;
						СтрокаПолиса.Сумма                      =  Строка.ИтогСтраховаяПремия;
						СтрокаПолиса.УИДСтроки                  =  Новый УникальныйИдентификатор ;
						СтрокаПолиса.УИДСтрокиЗаявки            =  Строка.УИДСтроки;
					КонецЕсли;         
				КонецЦикла;	                       
				
				//нДокумент.ПолучитьФорму().Открыть();
				//Возврат Ложь;
			КонецЕсли;
		КонецЕсли;	

		МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 0 Тогда
			
			Если ЭтоЕОСАГО Тогда
				нДокумент.ПолучитьФорму().Открыть();
			КонецЕсли;
			
			#Если Клиент Тогда
				Предупреждение("Не обнаружено перемещений БСО, связанных с этой заявкой. Невозможно продолжить операцию!",,"Не найдены выданные БСО");
			#КонецЕсли
			Возврат Ложь;
		Иначе	
			Попытка
				Если Не ЭтоЕОСАГО Тогда
					нДокумент = Документы.уб_ПриемкаОплат.СоздатьДокумент();
				КонецЕсли;	
				//нДокумент.Заполнить(ВыбПеремещение);
				нДокумент.Заполнить(Новый Структура("Документ,ТолькоВыдача,Заявка", МассивПеремещений, Ложь, Заявка));
				
				//нДокумент.ПолучитьФорму().Открыть();
				ОповеститьДляСервера("Консоль","Создана приемка на основании перемещения по заявке № "+Заявка.Номер);
			Исключение  
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
			КонецПопытки

		КонецЕсли;	
	ИначеЕсли Действие = "СтруктураПодчиненности" Тогда
		#Если клиент Тогда
			РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Заявка);
		#КонецЕсли
	ИначеЕсли Действие = "ИсторияЗаявки" Тогда	
		
		Попытка
			Отчет = Отчеты.ИсторияЗаявки.Создать();
			ФормаОтчета = Отчет.ПолучитьФорму();
			ФормаОтчета.Заявка = Заявка;
			ФормаОтчета.Открыть();
		Исключение
		КонецПопытки; 		
		
	ИначеЕсли Действие = "УстановитьПредыдущийСтатус" Тогда 
		//ФинОтветственный при возврате БСО с храненения
		Комментарий = "Предыдущий статус";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СЗ.Заявка,
		|	СЗ.Статус
		|ПОМЕСТИТЬ ВТ_ТекСтатус
		|ИЗ
		|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(, Заявка = &Заявка) КАК СЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(СЗ.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) КАК Статус,
		|	ВТ_ТекСтатус.Статус КАК ТекСтатус
		|ИЗ
		|	ВТ_ТекСтатус КАК ВТ_ТекСтатус
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок КАК СЗ
		|		ПО (СЗ.Заявка = ВТ_ТекСтатус.Заявка)
		|			И (СЗ.Статус <> ВТ_ТекСтатус.Статус)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СЗ.Период УБЫВ");
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не обнаружен текущий статус по заявке: " + Заявка);
			ОповеститьДляСервера("Консоль","Не обнаружен текущий статус по заявке № " + Заявка.Номер);
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Если Выборка.Статус.Пустая() Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не обнаружен предыдущий статус по заявке: " + Заявка);
				ОповеститьДляСервера("Консоль","Не обнаружен предыдущий статус по заявке № " + Заявка.Номер);
			Иначе
				Результат = УстановитьСтатусЗаявки(Заявка, Выборка.Статус, Комментарий,, ТребуетсяВозвратБСО);
			КонецЕсли;
		КонецЕсли;
		//тзСреза = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних( , Новый Структура("Заявка",Заявка)); 
		//Если тзСреза.Количество() >= 1 Тогда
		//	тзСреза = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(тзСреза[0].Период - 1 , Новый Структура("Заявка",Заявка)); 
		//	Если тзСреза.Количество() >= 1 Тогда
		//		УстановитьСтатусЗаявки(Заявка, тзСреза[0].Статус, Комментарий,, ТребуетсяВозвратБСО);
		//	Иначе
		//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не обнаружен предыдущий статус по заявке: "+Заявка);
		//		ОповеститьДляСервера("Консоль","Не обнаружен предыдущий статус по заявке № "+Заявка.Номер);
		//	КонецЕсли;
		//Иначе
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не обнаружен текущий статус по заявке: "+Заявка);
		//	ОповеститьДляСервера("Консоль","Не обнаружен текущий статус по заявке № "+Заявка.Номер);
		//КонецЕсли;
	ИначеЕсли Действие = "УстановитьСтатус_БСОНаРукахУКурьера" Тогда 
		//сБСО
		ФлЕстьОшибки = Ложь;
		НачатьТранзакцию();
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.БСОНаРукахУКурьера, Комментарий,,, ТребуетсяВозвратБСО);
		//Найти все связанные перемещения и провести
		
		
		
		
		Если Не ФлЕстьОшибки Тогда
			//оповещаем менеджера об изменении статуса
			Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
				ЭлПочта = уб_temp.КонтактнаяИнформация(Заявка.Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				Если Не ПустаяСтрока(ЭлПочта) Тогда
					Тема = "БСО по заявке № " + СтрЗаменить(Заявка.Номер, Символ(160), "") + " переданы курьеру";
					ТекстHTML = уб_temp.СводкаПоЗаявке(Заявка, "<b>" + Тема + "</b><br><br>", "ffffcc",Истина);
					Если Не ПустаяСтрока(ТекстHTML) Тогда
						МассивПолучателей = Новый Массив;
						МассивПолучателей.Добавить(ЭлПочта);
						Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
						ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
						Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
							Параметры.ОбратныйАдрес = ОбратныйАдрес;
						КонецЕсли;
						Параметры.Получатели 	= МассивПолучателей;
						Параметры.Тема			= Тема;
						Параметры.ТекстHTML		= ТекстHTML;
						//уб_ОбменДанными.SendMail(Параметры);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ЗафиксироватьТранзакцию();	
		Иначе
			ОтменитьТранзакцию();	 
		КонецЕсли;	
	ИначеЕсли Действие = "УстановитьСтатус_ДеньгиВКомпании" Тогда 
		Если Статусы.ДеньгиВКомпании = ТекСтатус Тогда
			Возврат Истина;
		КонецЕсли;	
		//Автоматически при подтверждении приемки
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.ДеньгиВКомпании, Комментарий,,, ТребуетсяВозвратБСО);	
		Если Результат = Истина Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Контакты,
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПредставлениеСтроки,
			               |	КонтактнаяИнформация.Представление КАК адрес,
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
			               |	уб_ИсторияСтатусовЗаявок.Заявка.Дата
			               |ИЗ
			               |	РегистрСведений.уб_ИсторияСтатусовЗаявок КАК уб_ИсторияСтатусовЗаявок
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
			               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |			ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер = КонтактнаяИнформация.Объект
			               |				И (КонтактнаяИнформация.Вид.Наименование = ""Адрес на kupipolis.ru"")
			               |		ПО уб_ИсторияСтатусовЗаявок.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
			               |			И (уб_ИсторияСтатусовЗаявок.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))
			               |ГДЕ
			               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Ссылка
			               |	И НЕ ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 200) = """"
			               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &Дата";
			Запрос.УстановитьПараметр("Ссылка",Заявка);	
			Запрос.УстановитьПараметр("Дата",ТекущаяДата()-14*24*3600);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() и Выборка.Количество() = 1 Тогда
				Если ПустаяСтрока(Выборка.Контакты) Тогда
					Контакты = уб_temp.ШифрСтроки(Выборка.ПредставлениеСтроки,Ложь);
				Иначе
					Контакты = Выборка.Контакты;
				КонецЕсли;
				Попытка
					Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
					Параметры.Вставить("ИмяСервиса","www.sluice");
					Параметры.Вставить("ИмяСервиса","smsc.ru");
					Параметры.Вставить("Режим","HTTP");
					Параметры.Вставить("ТолькоОдномуПолучателю", Истина);
					Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
						Параметры.Получатели 	= Контакты;
					Иначе
						Параметры.Получатели 	= "+79133616124";
					КонецЕсли;
					//Если Найти(нрег(Выборка.Адрес),"kupipolis.ru")>0 и Найти(Выборка.Адрес,"@") = 0 Тогда
					
					Параметры.Тема			= "Рассылка СМС";
					//Параметры.Сообщение		= "Прошу оценить мою работу: На Яндексе https://clck.ru/Jpmso (нужна авторизация) или на нашем сайте "+Выборка.Адрес+" Спасибо!";				
					Параметры.Сообщение		= "Прошу оценить мою работу: На Яндексе https://clck.ru/ai5v6 (нужна авторизация) или на нашем сайте "+Выборка.Адрес+" Спасибо!";				
					//"Прошу Вас оценить мою работу по ссылке: https://clck.ru/Jpmso";//+Выборка.Адрес;
					//"На выезд по страховке назначен "+Курьер+", тел. "+Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТелефонКурьера(Курьер);//89067775770";// "Bыeзд на cтpaxoвкy подтвержден. Для оформления КАСКО необх.: чистый Авто, ПТС, 2 ключa, права вод-лей, №ТО.+74952280942";		
					
					Попытка //TODO Временно добавлена попытка
						Ответ = "";
						уб_ОбменДанными.SendSMS(Параметры,Ответ);
						Если Найти (Ответ,"Ложь") = 0 Тогда
							Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение(Параметры.Сообщение,Выборка.Менеджер,Выборка.Номер,Ложь);
							Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Результат отправки SMS:"+СтрЗаменить(Ответ,"¶",""),Выборка.Менеджер,Выборка.Номер,Ложь);
							///КомментарийСлужебный = СокрЛП(КомментарийСлужебный)+"; "+СтрЗаменить(Ответ,"¶","")+Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm:ss'");
						Конецесли;	
					Исключение
						
						Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение("Ошибка при отправке SMS",Выборка.Менеджер,Выборка.Номер,Ложь);
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПроверитьИОтправитьСМС(). " + " -- " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина, , ,,"СМС-рассылка.Error.Заявка" );	
					КонецПопытки;
					
					//КонецЕсли;
				Исключение	
				КонецПопытки;
			КонецЕсли;
			//Если Результат = Истина Тогда
			//МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Объект = Заявка;
			//МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
			//МенеджерЗаписи.Параметр   = ""+Статусы.ДеньгиВКомпании;
			//МенеджерЗаписи.КоличествоПопытокВыполнения = 0;
			//МенеджерЗаписи.Записать();

		//КонецЕсли;
		КонецЕсли;
	ИначеЕсли Действие = "УстановитьСтатус_ЗапросНаУдаление" Тогда 
		//Менеджер 
		Если ТребуетсяВозвратБСО = Неопределено Тогда
			ТребуетсяВозвратБСО = ПолучитьТаблицуБСОПоЗаявке(Заявка).Количество() > 0
		КонецЕсли;
		Если Не ТребуетсяВозвратБСО Тогда
			Результат = УстановитьСтатусЗаявки(Заявка,Статусы.ЗапросНаУдаление,Комментарий,,, ТребуетсяВозвратБСО);
			//Если Не Заявка.ПометкаУдаления Тогда
			//	ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
			//	Попытка
			//		Если ЭтоФорма Тогда
			//			ОбъектИлиФорма.ЭтотОбъект.УстановитьПометкуУдаления(Истина);
			//			ФормаИлиОбъектЗаявки.Перечитать();
			//		Иначе
			//			ОбъектИлиФорма.УстановитьПометкуУдаления(Истина);
			//		КонецЕсли;
			//	Исключение
			//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
			//		//ОповеститьДляСервера("Консоль", "Ошибка при установке пометки удаления заявки № " + ОбъектИлиФорма.Номер);
			//	КонецПопытки;
			//КонецЕсли;
		Иначе
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Заявка может быть удалена только после сдачи БСО!");
			ОповеститьДляСервера("Консоль", "Заявка может быть удалена только после сдачи БСО!");
		КонецЕсли;	
	ИначеЕсли Действие = "УстановитьСтатус_ЗаявкаОтработана" Тогда 
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.ЗаявкаОтработана, Комментарий,,, ТребуетсяВозвратБСО);
		Если Результат = Истина Тогда
			МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Заявка;
			МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
			МенеджерЗаписи.Параметр   = ""+Статусы.ЗаявкаОтработана;
			МенеджерЗаписи.КоличествоПопытокВыполнения = 0;
			МенеджерЗаписи.Записать();
 		КонецЕсли;
	//ИначеЕсли Действие = "УстановитьСтатус_КомплектДокументацииПодготовлен" Тогда 
	//	//сБСО
	//	МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка);
	//	ВсегоПеремещений = МассивПеремещений.Количество();
	//	ФлЕстьОшибки = Ложь;
	//	НачатьТранзакцию();
	//	Комментарий = "";
	//	УстановитьСтатусЗаявки(Заявка, Статусы.КомплектДокументацииПодготовлен, Комментарий,,, ТребуетсяВозвратБСО);
	//	Если ВсегоПеремещений = 1 Тогда
	//		//Когда перемещение одно, 
	//		//отменяем его проведение
	//		Для Счетчик = 1 по ВсегоПеремещений Цикл
	//			СсылкаПеремещения = МассивПеремещений[Счетчик - 1];
	//			Если СсылкаПеремещения.Проведен Тогда
	//				Об = СсылкаПеремещения.ПолучитьОбъект();
	//				Попытка
	//					Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Отменено проведение перемещения: " + СсылкаПеремещения);
	//					ОповеститьДляСервера("Консоль", "Отменено проведение перемещения №" + Об.Номер);
	//				Исключение
	//					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
	//					ОповеститьДляСервера("Консоль", "Ошибка при отмене проведения перемещения №" + Об.Номер);
	//					ФлЕстьОшибки = Истина;
	//				КонецПопытки;	
	//			КонецЕсли;	
	//		КонецЦикла;
	//	КонецЕсли;	
	//	Если НЕ ФлЕстьОшибки Тогда
	//		ЗафиксироватьТранзакцию();	
	//	Иначе
	//		ОтменитьТранзакцию();	 
	//	Конецесли;	
	ИначеЕсли Действие = "УстановитьСтатус_КомплектИДеньгиУКассира" Тогда 	
		//Автоматически при проведении Приемки, или при отмене утверждения отчета кассира
		//Если ТекСтатус = Статусы.СтраховкаСостоялась Или ТекСтатус = Статусы.ДеньгиВКомпании Тогда
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.КомплектИДеньгиУКассира, Комментарий,,, ТребуетсяВозвратБСО);
		//Иначе
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Статус заявки должен быть «Страховка Состоялась»");
		//	ОповеститьДляСервера("Консоль","Статус заявки должен быть «Страховка Состоялась»");
		//КонецЕсли;	
	ИначеЕсли Действие = "УстановитьСтатус_КомплектНаХраненииВБухгалтерии" Тогда 
		//ФинОтветственный
		Комментарий = "";
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.КомплектНаХраненииВБухгалтерии, Комментарий,,, ТребуетсяВозвратБСО);
	//ИначеЕсли Действие = "УстановитьСтатус_КурьерНаВыезде" Тогда 
	//	//SMS, 
	//	//GPS
	//	//Курьер на спец ПК
	//	//РСВС за курьера
	//	Комментарий = "";
	//	УстановитьСтатусЗаявки(Заявка, Статусы.КурьерНаВыезде, Комментарий,,, ТребуетсяВозвратБСО);
	//ИначеЕсли Действие = "УстановитьСтатус_КурьерПрибылПоАдресу" Тогда 
	//	//SMS, 
	//	//GPS
	//	Комментарий = "";
	//	УстановитьСтатусЗаявки(Заявка, Статусы.КурьерПрибылПоАдресу, Комментарий,,, ТребуетсяВозвратБСО);
	ИначеЕсли Действие = "УстановитьСтатус_НазначениеКурьера" Тогда 
		//Менеджер при согласовании с клиентом
		//Менеджер при изменении времени/места/курьера при уже выданном БСО
		//РСВС при изменении времени/места/курьера при уже выданном БСО
		Если НЕ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПроверитьДК(Заявка) = Истина Тогда
			#Если клиент Тогда
			   Предупреждение("Не внесен номер ДК, статус нельзя поменять");
		    #Иначе   
			   
			#КонецЕсли
			Возврат Ложь;
		//ИначеЕсли НЕ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПроверитьОбъектСтрахования(Заявка) = Истина Тогда
		//	#Если клиент Тогда
		//	   Предупреждение("Не внесен объект страхования или даты оплаты в заявке, статус нельзя поменять");
		//	#Иначе   
		//	   
		//	#КонецЕсли
		//	Возврат Ложь;
		ИначеЕсли НЕ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПроверитьСтроки(Заявка) = Истина Тогда
			#Если клиент Тогда
			   Предупреждение("Не все строки готовы к печати и без отказа");
		    #Иначе   
			   
			#КонецЕсли
			Возврат Ложь;
		КонецЕсли;	
		НачатьТранзакцию();
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.НазначениеКурьера, Комментарий,,, ТребуетсяВозвратБСО);
		Если Не Заявка.Проведен Тогда
			Попытка 
				//ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
				Если ТипЗнч(Заявка)  = Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
					ОбъектИлиФорма = Заявка;
				Иначе	
					ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
				КонецЕсли;	
				//ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Проведение);
				ОповеститьДляСервера("Консоль","Проведение заявки №" + ОбъектИлиФорма.Номер);
			Исключение
				ОтменитьТранзакцию();	 
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
				Возврат Ложь;
			КонецПопытки;
			Результат = Истина;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	ИначеЕсли Действие = "УстановитьСтатус_ЗаявкаВПечати" Тогда 
		
		
		Если НЕ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПроверитьДК(Заявка) = Истина Тогда
			#Если клиент Тогда
			   Предупреждение("Не внесен номер ДК, статус нельзя поменять");
		    #Иначе   
			   
			#КонецЕсли
			Возврат Ложь;
		КонецЕсли;	
		
		НачатьТранзакцию();
		
		ВозможнаПечать = Истина;
		
		Для каждого СтрокаБСО  из Заявка.БСО Цикл
			
			Если СтрокаБСО.УидРодителя = "" ИЛИ СтрокаБСО.УидРодителя = СтрокаБСО.УидСтроки Тогда
				//Корень
				Если СтрокаБСО.Состояние <> Перечисления.уб_СостояниеОформления.Печать и СтрокаБСО.Состояние <> Перечисления.уб_СостояниеОформления.Отказ Тогда
					 ВозможнаПечать = Ложь;
					 Сообщить("Неподходящее состояние для печати "+СтрокаБСО.Состояние + " в строке "+СтрокаБСО.ВидБСО+"("+СтрокаБСО.УидСтроки+")");
				КонецЕсли;	
			КонецЕсли;	
			
		КОнецЦикла;	
		
//		Если ВозможнаПечать Тогда
			Результат = УстановитьСтатусЗаявки(Заявка, Статусы.ЗаявкаВПечати, Комментарий,,, ТребуетсяВозвратБСО);
		//Иначе
		//	Результат = Ложь;
		//КонецЕсли;	
		//Если Не Заявка.Проведен Тогда
		//	Попытка 
		//		ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
		//		ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Проведение);
		//		ОповеститьДляСервера("Консоль","Проведение заявки №" + ОбъектИлиФорма.Номер);
		//	Исключение
		//		ОтменитьТранзакцию();	 
		//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
		//		Возврат Ложь;
		//	КонецПопытки;
		//	Результат = Истина;
		//КонецЕсли;
		ЗафиксироватьТранзакцию();	
	ИначеЕсли Действие = "УстановитьСтатус_КомплектДокументацииПодготовлен" 
		//или Действие = "УстановитьСтатус_КомплектНаХраненииВБухгалтерии"
		Тогда 
		
		НачатьТранзакцию();
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.КомплектДокументацииПодготовлен, Комментарий,,, ТребуетсяВозвратБСО);
		//Если Не Заявка.Проведен Тогда
		//	Попытка 
		//		ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
		//		ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Проведение);
		//		ОповеститьДляСервера("Консоль","Проведение заявки №" + ОбъектИлиФорма.Номер);
		//	Исключение
		//		ОтменитьТранзакцию();	 
		//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
		//		Возврат Ложь;
		//	КонецПопытки;
		//	Результат = Истина;
		//КонецЕсли;
		ЗафиксироватьТранзакцию();		
	ИначеЕсли Действие = "УстановитьСтатус_СогласованиеСКлиентом" Тогда 
		//Менеджер при создании заявки
		//При записи заявки.
		НачатьТранзакцию();
		//Если Заявка.Проведен Или Заявка.Утверждено Тогда
			
			Пустой = Справочники.ФизическиеЛица.ПустойАгент;
			Если НЕ Заявка.Курьер = Пустой Тогда
				Если ТипЗнч(Заявка)  = Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
					ОбъектИлиФорма = Заявка;
				Иначе	
					ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
				КонецЕсли;	
				ОбъектИлиФорма.Курьер = Пустой;
				
				Попытка 
					//ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					ОтменитьТранзакцию();	 
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;

			//ОбъектИлиФорма.Утверждено = Ложь;
			//Попытка 
			//	ОбъектИлиФорма.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	ОповеститьДляСервера("Консоль", "Отмена проведения заявки №" + ОбъектИлиФорма.Номер);
			//Исключение
			//	ОтменитьТранзакцию();	 
			//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()),"Сообщить");
			//	Возврат Ложь;
			//КонецПопытки;
			Результат = Истина;
		//КонецЕсли;
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.СогласованиеСКлиентом, Комментарий,,, ТребуетсяВозвратБСО);
		
		ЗафиксироватьТранзакцию();
	ИначеЕсли Действие = "УстановитьСтатус_СогласованиеСКлиентом_Доработка" Тогда 
		//Менеджер в процессе формирования комплекта БСО
		//Менеджер в процессе назначении курьера РСВС
		//сБСО при невозможности собрать комплект документов
		//РСВС при уже поготовленном комплекте документов		
		//При откате статусов
		#Если Клиент Тогда
			Введено = ВвестиСтроку(Комментарий,"Введите причину доработки заявки №" + Заявка.Номер,,);
			ОповеститьДляСервера("Консоль","Запрос причины доработки №" + Заявка.Номер);
			Если Не Введено Тогда
				Комментарий = "Без указания причины";
			Иначе
				Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Сообщение(Комментарий,Заявка.Менеджер,Заявка.Номер);
			КонецЕсли;	
		#КонецЕсли
		Доработка = Истина;
		//При записи заявки.
		НачатьТранзакцию();
			
		//Если Заявка.Проведен Или Заявка.Утверждено Тогда
		Пустой = Справочники.ФизическиеЛица.ПустойАгент;
		Если НЕ Заявка.Курьер = Пустой Тогда
			Если ТипЗнч(Заявка)  = Тип("ДокументОбъект.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
				ОбъектИлиФорма = Заявка;
			Иначе	
				ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
			КонецЕсли;	
			ОбъектИлиФорма.Курьер = Пустой;
			//ОбъектИлиФорма.Утверждено = Ложь;
			Попытка 
				ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Запись);
				//ОбъектИлиФорма.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				//ОповеститьДляСервера("Консоль", "Отмена подтверждения и проведения по заявке №" + ОбъектИлиФорма.Номер);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
				ОтменитьТранзакцию();	 
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.СогласованиеСКлиентом, Комментарий, Доработка,, ТребуетсяВозвратБСО);
		//Если ТекСтатус = Статусы.НазначениеКурьера Тогда
		//	//Уведомить РСВС
		//	Если Не ЕстьРоль("РСВС", МассивРолей) Тогда
		//		Уведомление("Уже не надо назначать курьера", "РСВС", Заявка, "Отмена");
		//	КонецЕсли;	
		//Иначе
		//	Если Не ЕстьРоль("РСВС", МассивРолей) Тогда
		//		Уведомление("На доработку", "РСВС", Заявка, "Отмена");
		//	КонецЕсли;
		//КонецЕсли;
		ЗафиксироватьТранзакцию();
	ИначеЕсли Действие = "УстановитьСтатус_СтраховкаНеСостоялась" Тогда 
		//По Сигналу от курьера (SMS, по звонку)
		//Менеджером при отказе клиента
		//Если ЕстьРоль("Менеджер", МассивРолей) Или ЕстьРоль("РСВС", МассивРолей) Тогда
		#Если Клиент Тогда
			Введено = ВвестиСтроку(Комментарий, "Введите причину несостоявшейся страховки: ");
			ОповеститьДляСервера("Консоль", "Запрос причины отмены страховки №" + Заявка.Номер);
			Если Не Введено Тогда
				Комментарий = "";
			КонецЕсли;	
		#КонецЕсли
		Доработка = Ложь;
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.СтраховкаНеСостоялась, Комментарий, Доработка,, ТребуетсяВозвратБСО);
		Если Результат = Истина Тогда
			МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Заявка;
			МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
			МенеджерЗаписи.Параметр   = ""+Статусы.СтраховкаНеСостоялась;
			МенеджерЗаписи.КоличествоПопытокВыполнения = 0;
			МенеджерЗаписи.Записать();

		КонецЕсли;	
		
	ИначеЕсли Действие = "УстановитьСтатус_СтраховкаСостоялась" Тогда 
		//По Сигналу от курьера (SMS, по звонку)
		Результат = УстановитьСтатусЗаявки(Заявка, Статусы.СтраховкаСостоялась, Комментарий, Доработка,, ТребуетсяВозвратБСО);	
	ИначеЕсли Действие = "УстановитьСтатус_ФормированиеКомплектаБСО" Тогда 
		//Менеджер При самовыезде 
		//РСВС назначил курьера.
		Если 1 = 2 и Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТребуетсяПроверка(Заявка) Тогда
			#Если Клиент Тогда
				Предупреждение("Заявка требует проверки перед установкой статуса!",, "Действие отменено");
			#КонецЕсли
		Иначе
			НачатьТранзакцию();
			Доработка = Ложь;
			НетБСО = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НетБСОПоЗаявке(Заявка);
			Если НетБСО Тогда
				//пропускаем. Нет бланков - нечего формировать
				_ТекСтатус = Статусы.БСОНаРукахУКурьера
			Иначе
				_ТекСтатус = Статусы.ФормированиеКомплектаБСО
			КонецЕсли;
			Результат = УстановитьСтатусЗаявки(Заявка, _ТекСтатус, Комментарий, Доработка,, ТребуетсяВозвратБСО);
			
			//ЗАЦИКЛИВАЕТСЯ
			//Проводим документ, если не проведен /при самовыезде
			//Если Не Заявка.Утверждено Или Не Заявка.Проведен Тогда
			//	Попытка 
			//		ОбъектИлиФорма = ПолучитьОбъектИлиФорму(Заявка, ФормаИлиОбъектЗаявки);
			//		//ОбъектИлиФорма.Утверждено = Истина;
			//		
			//		Если ОбъектИлиФорма.УтвержденоДата = Дата(1,1,1) Тогда
			//			ОбъектИлиФорма.УтвержденоДата = ТекущаяДата();	
			//		КонецЕсли;

			//		ОбъектИлиФорма.Записать(РежимЗаписиДокумента.Проведение);
			//		ОповеститьДляСервера("Консоль","Проведена заявка №" + ОбъектИлиФорма.Номер);
			//	Исключение
			//		ОтменитьТранзакцию();	 
			//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
			//		Возврат Ложь;
			//	КонецПопытки;
			//	Результат = Истина;
			//КонецЕсли;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	ИначеЕсли Действие = "ДвижениеСтатусовОтчетКассира" Тогда
		//проверяет отчет кассира (может выставить статус либо "КомплектИДеньгиУКассира", либо "ДеньгиВКомпании"
		Если СтрокаРеквизитов = Неопределено Тогда
			//1 вариант вызова - из формы документа заявки. Имеем только заявку, нет конкретного отчета кассира
			МассивОтчетовКассира = Документы.уб_ОтчетКассира.МассивОтчетовКассираПоЗаявке(Заявка);
		Иначе
			//2 вариант вызова - из статусов заявок. В строке таблицы имеется как определенный нмоер заявки так и определенный отчет кассира,
			//но только в некоторых таблицах кассира
			//
			//строка реквизитов может быть структура и строка ТЗ
			Попытка
				МассивОтчетовКассира = Новый Массив;
				ОтчетКассира = СтрокаРеквизитов.ОтчетКассира;
				МассивОтчетовКассира.Добавить(СтрокаРеквизитов.ОтчетКассира);
			Исключение
				МассивОтчетовКассира = Документы.уб_ОтчетКассира.МассивОтчетовКассираПоЗаявке(Заявка);
			КонецПопытки
		КонецЕсли;
		Для Каждого ЭлементМассива Из МассивОтчетовКассира Цикл
			Документы.уб_ОтчетКассира.ДвижениеСтатусовЗаявок(ЭлементМассива);
		КонецЦикла;
	Иначе 
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не знаю, что делать с : " + Заявка + " - " + Действие);		
		ОповеститьДляСервера("Консоль","Не известно действие " + Действие);
		Возврат Ложь;
	КонецЕсли;	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьОбъектИлиФорму(Ссылка, Объект)

	Если Объект = Неопределено Тогда
		Результат = Ссылка.ПолучитьОбъект();
	//ИначеЕсли ТипЗнч(Объект) = Тип("Форма") Тогда
	//	Результат = Объект.ЭтотОбъект
	Иначе
		Результат = Объект	
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьОбъект()

//TODO ДатаСтатуса <> Неопределено - возможные конфликты
Функция УстановитьСтатусЗаявки(
	Заявка, 
	Статус, 
	Комментарий 		= "", 
	Доработка 			= Ложь, 
	ДатаСтатуса 		= Неопределено, 
	ТребуетсяВозвратБСО = Неопределено
	) Экспорт
	
	//Если ТребуетсяВозвратБСО = Неопределено Тогда
	//	ТребуетсяВозвратБСО = ПолучитьТаблицуБСОПоЗаявке(Заявка).Количество() > 0;
	//Конецесли;	
	УстановленТребуетсяВозвратБСО = Не ТребуетсяВозвратБСО = Неопределено;
	Если ДатаСтатуса = Неопределено Тогда
		ДатаСтатуса = ТекущаяДата();
	КонецЕсли;
	ДатаЗаписи = ТекущаяДата();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СЗ.Автор,
	|	СЗ.ДатаСоздания,
	|	СЗ.Статус,
	|	СЗ.ТребуетсяВозвратБСО,
	|	СЗ.Заявка.Номер КАК ЗаявкаНомер,
	|	СЗ.Заявка.Курьер КАК Курьер,
	|	СЗ.Заявка.Самовыезд КАК Самовыезд,
	|	СЗ.Заявка.Менеджер КАК Менеджер
	|ИЗ
	|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(&Период, Заявка = &Заявка) КАК СЗ");
	Запрос.УстановитьПараметр("Период", ДатаСтатуса);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус  =  Статус Тогда
			Возврат Истина
		КонецЕсли;	
		Записывать = Выборка.Статус <> Статус ;//Или Выборка.ТребуетсяВозвратБСО <> ТребуетсяВозвратБСО;
		Если Записывать Тогда
			ЭтоКурьер = (Выборка.Самовыезд=Ложь и ПараметрыСеанса.уб_ТекущееФизЛицо = Выборка.Курьер и НЕ уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")  и НЕ ПараметрыСеанса.уб_ТекущееФизЛицо = Выборка.Менеджер);
			Если ЭтоКурьер Тогда
				Записывать = Ложь;
			Иначе	
				Автор			= ?(Выборка.Автор.Пустая(), 			ПараметрыСеанса.ТекущийПользователь, 	Выборка.Автор);
				ДатаСоздания 	= ?(Выборка.ДатаСоздания = Дата(1,1,1), ДатаЗаписи,								Выборка.ДатаСоздания);
				ЗаявкаНомер		= Выборка.ЗаявкаНомер;
			КонецЕсли;	
		КонецЕсли;
		Если ТребуетсяВозвратБСО = Неопределено Тогда
			ТребуетсяВозвратБСО = Выборка.ТребуетсяВозвратБСО;
		КонецЕсли;	
	Иначе
		Записывать 		= Истина;
		Автор           = ПараметрыСеанса.ТекущийПользователь;
		ДатаСоздания	= ДатаЗаписи;
	КонецЕсли;
	Если Записывать Тогда
		МЗ = РегистрыСведений.уб_ИсторияСтатусовЗаявок.СоздатьМенеджерЗаписи();
		МЗ.Период 				= ДатаСтатуса;
		МЗ.Заявка 				= Заявка;
		МЗ.Статус 				= Статус;
		МЗ.ТребуетсяВозвратБСО 	= ТребуетсяВозвратБСО;
		МЗ.Доработка 			= Доработка;
		МЗ.Комментарий 			= Комментарий;
		МЗ.Модификатор			= ПараметрыСеанса.ТекущийПользователь;
		МЗ.ДатаИзменения		= ДатаЗаписи;
		МЗ.Автор				= Автор;
		МЗ.ДатаСоздания			= ДатаСоздания;
		Попытка
			МЗ.Записать();
			#Если Клиент Тогда
				Если ЗаявкаНомер = Неопределено Тогда
					ЗаявкаНомер = Заявка.Номер;
				КонецЕсли;
				ОповеститьДляСервера("Консоль", "Установлен статус «" + Статус + "»" + " для № " + ЗаявкаНомер);
				Оповестить("ОбновитьСтатусВЗаявке", Заявка);
			#КонецЕсли
			Результат = Истина;
			уб_Серверные.ОтправитьСтатус (Заявка,Строка(Статус));
		Исключение
			ОповеститьДляСервера("Консоль", "Ошибка при установке статуса «" + Статус + "»");
			Результат = Ложь;
		КонецПопытки;
		Если Результат Тогда
			//уб_Очередь = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			//уб_Очередь.Объект = Заявка;
			//уб_Очередь.ТипОчереди = Перечисления.уб_ТипыОчереди.ПроверкаПеремещений;
			//уб_Очередь.Параметр = ""+Статус;
			//уб_Очередь.КоличествоПопытокВыполнения = 0;
			//уб_Очередь.Записать();
			
			//Если НЕ УстановленТребуетсяВозвратБСО = Истина Тогда
			//	уб_Очередь = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			//	уб_Очередь.Объект = Заявка;
			//	уб_Очередь.ТипОчереди = Перечисления.уб_ТипыОчереди.ТребуетсяВозвратБСО;
			//	//уб_Очередь.Параметр = ""+Статус;
			//	уб_Очередь.Записать();
			//Иначе	
			//КонецЕсли;
		КонецЕсли;	
	Иначе
		//ничего не изменено
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьТаблицуБСОПоЗаявке(Заявка, ПоВсемЗаявкам = Ложь, ПоВсемСтатусам = Ложь,ПоместитьВХранилище = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_ДвиженияБСО.СК,
	|	уб_ДвиженияБСО.ВидБСО,
	|	уб_ДвиженияБСО.НомерБСО
	|ПОМЕСТИТЬ СписокДвижений
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	|ГДЕ
	|	уб_ДвиженияБСО.Заявка = &Заявка
	|	И уб_ДвиженияБСО.Подтверждено
	|	И уб_ДвиженияБСО.Активность
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	уб_ОстаткиБСО.СК,
	//|	уб_ОстаткиБСО.ВидБСО
	//|ПОМЕСТИТЬ СписокОстатков
	//|ИЗ
	//|	РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
	//|ГДЕ
	//|	уб_ОстаткиБСО.Заявка = &Заявка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	МАКСИМУМ(уб_ОстаткиБСО.Регистратор) КАК Регистратор,
	//|	уб_ОстаткиБСО.СК,
	//|	уб_ОстаткиБСО.ВидБСО
	//|ПОМЕСТИТЬ ПослДвижение
	//|ИЗ
	//|	РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОстатков КАК СписокОстатков
	//|		ПО уб_ОстаткиБСО.СК = СписокОстатков.СК
	//|			И уб_ОстаткиБСО.ВидБСО = СписокОстатков.ВидБСО
	//|ГДЕ
	//|	уб_ОстаткиБСО.Заявка = &Заявка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	уб_ОстаткиБСО.СК,
	//|	уб_ОстаткиБСО.ВидБСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ДвиженияБСОСрезПоследних.Период КАК Период,
	|	уб_ДвиженияБСОСрезПоследних.СК КАК СК,
	|	уб_ДвиженияБСОСрезПоследних.ВидБСО КАК ВидБСО,
	|	уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип КАК ТипБСО,
	|	уб_ДвиженияБСОСрезПоследних.НомерБСО КАК НомерБСО,
	|	уб_ДвиженияБСОСрезПоследних.Агент КАК Агент,
	|	уб_ДвиженияБСОСрезПоследних.ПоложениеБСО КАК ПоложениеБСО,
	|	уб_ДвиженияБСОСрезПоследних.СостояниеБСО КАК СостояниеБСО,
	|	1 КАК Количество,
	|	уб_ДвиженияБСОСрезПоследних.Заявка,
	|	уб_ДвиженияБСОСрезПоследних.Заявка.Номер КАК ЗаявкаНомер
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			,
	|			Подтверждено
	|				) КАК уб_ДвиженияБСОСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДвижений КАК Список
	|		ПО уб_ДвиженияБСОСрезПоследних.ВидБСО = Список.ВидБСО 
	|			И уб_ДвиженияБСОСрезПоследних.НомерБСО = Список.НомерБСО
	|			И уб_ДвиженияБСОСрезПоследних.СК = Список.СК
	|ГДЕ
	|	&УсловиеНомерных";
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	уб_ОстаткиБСО.Период,
	//|	уб_ОстаткиБСО.СК,
	//|	уб_ОстаткиБСО.ВидБСО,
	//|	уб_ОстаткиБСО.ВидБСО.Тип КАК ТипБСО,
	//|	"""",
	//|	уб_ОстаткиБСО.Агент,
	//|	NULL,
	//|	уб_ОстаткиБСО.СостояниеБСО,
	//|	ВЫБОР
	//|		КОГДА уб_ОстаткиБСО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА уб_ОстаткиБСО.Количество
	//|		ИНАЧЕ -уб_ОстаткиБСО.Количество
	//|	КОНЕЦ,
	//|	уб_ОстаткиБСО.Заявка,
	//|	уб_ОстаткиБСО.Заявка.Номер
	//|ИЗ
	//|	РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПослДвижение КАК ПослДвижение
	//|		ПО уб_ОстаткиБСО.Регистратор = ПослДвижение.Регистратор
	//|ГДЕ
	//|	&УсловиеКоличественных";	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	УсловиеНомерных 		= "";
	УсловиеКоличественных   = "";
	Если Не ПоВсемЗаявкам Тогда
		УсловиеНомерных 		= "уб_ДвиженияБСОСрезПоследних.Заявка = &Заявка";
		УсловиеКоличественных   = "уб_ОстаткиБСО.Заявка = &Заявка";
	КонецЕсли;
	Если Не ПоВсемСтатусам Тогда
		Если УсловиеНомерных <> "" Тогда
			УсловиеНомерных = УсловиеНомерных + " И "
		КонецЕсли;
		УсловиеНомерных = УсловиеНомерных + "уб_ДвиженияБСОСрезПоследних.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку)";
		Если УсловиеКоличественных <> "" Тогда
			УсловиеКоличественных = УсловиеКоличественных + " И "
		КонецЕсли;
		УсловиеКоличественных = УсловиеКоличественных + "ВЫБОР
		|		КОГДА уб_ОстаткиБСО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА уб_ОстаткиБСО.Количество
		|		ИНАЧЕ - уб_ОстаткиБСО.Количество
		|	КОНЕЦ = 0"
	КонецЕсли;
	Если УсловиеНомерных = "" Тогда
		УсловиеНомерных = "ИСТИНА"
	КонецЕсли;
	Если УсловиеКоличественных = "" Тогда
		УсловиеКоличественных = "ИСТИНА"
	КонецЕсли;
	
	//Собственного контрагента исключаем ВСЕГДА (далее функционально?)
	УсловиеНомерных  = УсловиеНомерных + "  и НЕ уб_ДвиженияБСОСрезПоследних.СК=&Служебная ";// И НЕ (уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип=&Карточки) ";
	
	Запрос.УстановитьПараметр("Служебная", ПараметрыСеанса.уб_константы.уб_СобственныйКонтрагент);
	//Запрос.УстановитьПараметр("Карточки", Перечисления.уб_ТипыБСО.Карточка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеНомерных", 		УсловиеНомерных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКоличественных",  УсловиеКоличественных);
	Запрос.Текст = ТекстЗапроса;
	
	Данные = Запрос.Выполнить().Выгрузить();
	Если ПоместитьВХранилище = Истина Тогда
		Возврат ПоместитьВоВременноеХранилище(Данные,Новый УникальныйИдентификатор);
	Иначе
		Возврат Данные;
	КонецЕсли	
		
	
	
КонецФункции

//Функция возвращает массив из созданных на основании перемещений и созданных на основании этих перемещений перемещений 
//(без рекурсии)
Функция ВернутьСвязанныеСЗаявкойПеремещения(Заявка,Создать = Ложь,МассивПеремещений = Неопределено) Экспорт
	
	Если МассивПеремещений = Неопределено Тогда
		МассивПеремещений = Новый Массив;
	КонецЕсли;	
	
	ЕстьПеремещениеПоЗаявке(Заявка,, МассивПеремещений);
	Если МассивПеремещений.Количество()=0  и Создать = Истина 
		//и Заявка.Самовыезд = Ложь
		Тогда
		
		Попытка
			Перемещение = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
			Если ТипЗнч(Заявка) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
				Для каждого СтрокаЗ из  Заявка.БСо Цикл
					ТекНомерБСО = ?(ЗначениеЗаполнено(СтрокаЗ.НомерБСО),СтрокаЗ.НомерБСО,СтрокаЗ.ДопНомерБСО);
					Если ЗначениеЗаполнено(ТекНомерБСО) Тогда
						СтрокаБСО = Перемещение.БСО.Добавить();
						СтрокаБСО.СК = СтрокаЗ.СК;
						СтрокаБСО.ВидБСО = СтрокаЗ.ВидБСО;
						СтрокаБСО.НомерБСО =ТекНомерБСО;
						СтрокаБСО.Подтверждено = Истина;
						Данные= ДанныеПоБланку(СтрокаБСО.ВидБСО,ТекНомерБСО);
						СтрокаБСО.Поставщик        = Данные.Поставщик;
						СтрокаБСО.ОрганизацияАгент = Данные.ОрганизацияАгент;
						СтрокаБСО.ЗаявкаОт   = Заявка;
						СтрокаБСО.ЗаявкаКуда = Заявка;
						СтрокаБСО.Количество = 1;
						СтрокаБСО.СостояниеБСО = Перечисления.уб_СостоянияБСО.Оформлен;
						//Поставщик
						Если Перемещение.Дата = Дата(1,1,1) Тогда
							Перемещение.Дата = СтрокаЗ.ДатаДвиженияБСО+1
						КонецЕсли;	
					КонецЕсли; 
				КонецЦикла; 
				Перемещение.Агент = Справочники.ПодразделенияОрганизаций.НайтиПоКоду("000000003");
				Перемещение.АгентКуда = ?(Заявка.Самовыезд,Заявка.Менеджер,Заявка.Курьер);
				Перемещение.Направление = 1;
			ИначеЕсли ТипЗнч(Заявка) = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
				тБСО = Заявка.БСО.Выгрузить();
				тБСО.ЗаполнитьЗначения(Перечисления.уб_СостоянияБСО.Испорчен,"СостояниеБСО");
				Перемещение.БСО.Загрузить(тБСО);
				
				Перемещение.АгентКуда = Заявка.Агент;
				Перемещение.Агент     = Заявка.АгентКуда;
				Перемещение.Направление =-1
			КонецЕсли;
			Если Перемещение.БСО.Количество()>0 Тогда
				Если Перемещение.Дата = Дата(1,1,1) Тогда
					Перемещение.Дата = Заявка.Дата+1;
				КонецЕсли;
				Перемещение.Автор = ПараметрыСеанса.уб_ТекущееФизЛицо;
				Перемещение.ДатаСоздания = ТекущаяДата();
				Перемещение.Модификатор = Перемещение.Автор;
				Перемещение.ДатаИзменения = Перемещение.ДатаСоздания;
				
				//Перемещение.Выдал  = Заявка.Курьер;
				Перемещение.СозданНаОсновании = Заявка;
				
				Перемещение.Комментарий = "При установке статуса";
				Перемещение.Направление = 1;
				Попытка
					Перемещение.Записать(РежимЗаписиДокумента.Запись);
					МассивПеремещений.Добавить(Перемещение.Ссылка);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки	
				
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	Возврат МассивПеремещений;
	//старый код
	//Если ТолькоНаОсновании Тогда
	//	Запрос  = Новый Запрос("ВЫБРАТЬ
	//	|	уб_ПеремещениеБСО.Ссылка,
	//	|	уб_ПеремещениеБСО.Агент,
	//	|	уб_ПеремещениеБСО.АгентКуда
	//	|ИЗ
	//	|	Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
	//	|ГДЕ
	//	|	уб_ПеремещениеБСО.СозданНаОсновании = &Заявка");
	//Иначе	
	//	Запрос  = Новый Запрос("ВЫБРАТЬ
	//	|	ЕСТЬNULL(уб_ПеремещениеБСО1.Ссылка, уб_ПеремещениеБСО.Ссылка) КАК Ссылка,
	//	|	ВЫБОР
	//	|		КОГДА уб_ПеремещениеБСО1.Ссылка ЕСТЬ NULL 
	//	|			ТОГДА уб_ПеремещениеБСО.Агент
	//	|		ИНАЧЕ уб_ПеремещениеБСО1.Агент
	//	|	КОНЕЦ КАК Агент,
	//	|	ВЫБОР
	//	|		КОГДА уб_ПеремещениеБСО1.Ссылка ЕСТЬ NULL 
	//	|			ТОГДА уб_ПеремещениеБСО.АгентКуда
	//	|		ИНАЧЕ уб_ПеремещениеБСО1.АгентКуда
	//	|	КОНЕЦ КАК АгентКуда
	//	|ИЗ
	//	|	Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
	//	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО1
	//	|		ПО уб_ПеремещениеБСО.СозданНаОсновании = уб_ПеремещениеБСО1.Ссылка
	//	|ГДЕ
	//	|	уб_ПеремещениеБСО.СозданНаОсновании = &Заявка");
	//Конецесли;					   
	//Запрос.УстановитьПараметр("Заявка",Заявка);						   
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

Функция ДанныеПоБланку(ВидБСО,НомерБСО)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			|	уб_ДвиженияБСОСрезПоследних.Период,
			|	уб_ДвиженияБСОСрезПоследних.Регистратор,
			|	уб_ДвиженияБСОСрезПоследних.НомерСтроки,
			|	уб_ДвиженияБСОСрезПоследних.Активность,
			|	уб_ДвиженияБСОСрезПоследних.СК,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО,
			|	уб_ДвиженияБСОСрезПоследних.НомерБСО,
			|	уб_ДвиженияБСОСрезПоследних.Поставщик,
			|	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент,
			|	уб_ДвиженияБСОСрезПоследних.Подтверждено,
			//|	уб_ДвиженияБСОСрезПоследних.ДокПроведен,
			//|	уб_ДвиженияБСОСрезПоследних.Активность Как ДокПроведен,
			|	уб_ДвиженияБСОСрезПоследних.АгентОтправитель,
			|	уб_ДвиженияБСОСрезПоследних.Агент,
			|	уб_ДвиженияБСОСрезПоследних.ПоложениеБСО,
			|	уб_ДвиженияБСОСрезПоследних.СостояниеБСО,
			|	уб_ДвиженияБСОСрезПоследних.НомерПолиса,
			|	уб_ДвиженияБСОСрезПоследних.ГодПолиса,
			|	уб_ДвиженияБСОСрезПоследних.СтраховойПолис,
			|	уб_ДвиженияБСОСрезПоследних.НаОснованииБумажногоДокумента,
			|	уб_ДвиженияБСОСрезПоследних.ДатаВозврата,
			|	уб_ДвиженияБСОСрезПоследних.Заявка,
			|	уб_ДвиженияБСОСрезПоследних.КодОперации,
			|	уб_ДвиженияБСОСрезПоследних.Комментарий,
			|	ПРЕДСТАВЛЕНИЕ(уб_ДвиженияБСОСрезПоследних.СостояниеБСО) КАК СостояниеБСОПредставление,
			|	ПРЕДСТАВЛЕНИЕ(уб_ДвиженияБСОСрезПоследних.ПоложениеБСО) КАК ПоложениеБСОПредставление,
			|	уб_ДвиженияБСОСрезПоследних.Поставщик.Представление,
			|	уб_ДвиженияБСОСрезПоследних.Агент.Представление,
			|	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент.Представление,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО.Тип КАК Тип,
			|	987 КАК ДопПоля,
			|	уб_ДвиженияБСОСрезПоследних.ВидБСО.ТипУчетаБСО КАК ТипУчетаБСО
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
			|			,
			|			ВидБСО = &ВидБСО
			|				И НомерБСО = &НомерБСО
			|				И Подтверждено = Истина
			|               И 1 = 1) КАК уб_ДвиженияБСОСрезПоследних";
			СтруктураОтвета = Новый Структура("ОрганизацияАгент,Поставщик",справочники.Организации.ПустаяСсылка(),Справочники.Контрагенты.ПустаяСсылка());
			Запрос.УстановитьПараметр("ВидБСО",ВидБСО);
			Запрос.УстановитьПараметр("НомерБСО",НомерБСО);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
			    ЗаполнитьЗначенияСвойств(СтруктураОтвета,Выборка);
				
			КонецЕсли;	
			Возврат СтруктураОтвета
	КонецФункции

Функция РасшифроватьПричину (ОписаниеОшибки) Экспорт
	//
	Возврат ОписаниеОшибки
КонецФункции	

Процедура Уведомление(Сообщение,КогоУведомить,Заявка,ВЗаголовок ="") Экспорт
	//	ЗаписатьОшибкуИСообщить(Сообщение);
	МЗ =  РегистрыСведений.уб_Чат_Сообщения.СоздатьМенеджерЗаписи();
	МЗ.Отправитель = ПараметрыСеанса.ТекущийПользователь;
	//
	ЗаполнитьПолучателяПоЗаявке(МЗ,КогоУведомить,Заявка);
	
	МЗ.ИДСообщения = Строка(Новый УникальныйИдентификатор);
	МЗ.Заголовок = "" + СтрЗаменить(Заявка.Номер,Символ(160),"")+" "+ВЗаголовок;
	МЗ.Сообщение = Сообщение;
	МЗ.Период = ТекущаяДата();
	МЗ.Вложения = СформироватьХранилищеТЗПОСсылке (Заявка);
	МЗ.ЕстьВложения = Истина;
	МЗ.НеОтображатьНаWeb = Истина;
	Если НЕ ЗначениеЗаполнено(МЗ.Получатель) И СокрЛП(МЗ.ИмяКанала)="" Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не получилось определить получателя для заявки: "+Заявка+" "+КогоУведомить);
	Иначе	
		МЗ.Записать();
	КонецЕсли;	
	
	//МЗ2 = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьМенеджерЗаписи();
	//МЗ2.Период = МЗ.Период;
	//МЗ2.ИДСообщения = МЗ.ИДСообщения;
	//МЗ2.Пользователь = МЗ.Получатель;
	//МЗ2.Отправитель = МЗ.Отправитель;
	//МЗ2.Записать();
	ОповеститьДляСервера("Консоль","Создано уведомление для «"+КогоУведомить+"» с текстом «"+Сообщение+"»");
КонецПроцедуры	

Функция СформироватьХранилищеТЗПОСсылке(Ссылка)
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Ссылка");
	ТЗ.Колонки.Добавить("ТипСсылки");
	
	НСтрока = ТЗ.Добавить();
	НСтрока.Ссылка 		= Ссылка;
	НСтрока.ТипСсылки 	= Строка(ТипЗнч(Ссылка));
	
	Хранилище = Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(ТЗ));
	
	Возврат Хранилище;
	
КонецФункции

Функция ВернутьСсылкуИзХранилища(Хранилище) Экспорт
	
	ЗначениеВнутр  = Хранилище.Получить();
	
	Результат = Неопределено;
	
	ТЗ = ЗначениеИзСтрокиВнутр(ЗначениеВнутр);
	
	Если ЗначениеВнутр = Неопределено Тогда
	Иначе
		Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
			Если ТЗ.Количество()>0 Тогда
				Результат =  ТЗ[0].Ссылка;
			КонецЕсли;	
		Конецесли;	
	Конецесли;	
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьПолучателяПоЗаявке(МЗ,КогоУведомить,Заявка)
	МЗ.ИмяКанала = КогоУведомить; 
	МЗ.Получатель = Справочники.Пользователи.ПустаяСсылка();
	Если КогоУведомить = "Менеджер" ИЛИ КогоУведомить = "ВажноМенеджер" Тогда
		МЗ.Получатель = ПолучитьПользователяДляФизическогоЛица(Заявка.Менеджер);
	ИначеЕсли КогоУведомить = "Курьер" ИЛИ КогоУведомить = "ВажноКурьер" Тогда
		Если Заявка.Самовыезд Тогда
			МЗ.Получатель = ПолучитьПользователяДляФизическогоЛица(Заявка.Менеджер);
		Иначе
			МЗ.Получатель = ПолучитьПользователяДляФизическогоЛица(Заявка.Курьер);
		КонецЕсли;	
	ИначеЕсли КогоУведомить = "РСВС" ИЛИ КогоУведомить = "ВажноРСВС" Тогда	
		МЗ.Получатель = ПолучитьПользователяДляФизическогоЛица(ПолучитьРуководителяСВС(Заявка.Курьер));
	Конецесли;	
КонецПроцедуры	

Функция ПолучитьПользователяДляФизическогоЛица(ФизЛицо) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо = &ФизЛицо");
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

// Только для "Управление брокером"
// Функция пытается выйти на самый ранний документ структуры
Функция ПолучитьИзначальныйДокумент (ТекущийДокумент, ТипТекущего = Неопределено)   Экспорт
	
	Если ТипТекущего = Неопределено Тогда
		ТипТекущего = ТипЗНЧ (ТекущийДокумент);
	КонецЕсли;	
	Если ТипТекущего = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СтруктураПодчиненности.Ссылка
		|ИЗ
		|	КритерийОтбора.СтруктураПодчиненности(&ОплатаПолиса) КАК СтруктураПодчиненности
		|ГДЕ
		|	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.уб_ПриемкаОплат");
		Запрос.УстановитьПараметр("ОплатаПолиса",ТекущийДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			//Возврат Выборка.Ссылка;
			///РЕКУРСИЯ///
			Возврат ПолучитьИзначальныйДокумент(Выборка.Ссылка);
		КонецЕсли;	
	ИначеЕсли ТипТекущего = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СтруктураПодчиненности.Ссылка
		|ИЗ
		|	КритерийОтбора.СтруктураПодчиненности(&СП) КАК СтруктураПодчиненности
		|ГДЕ
		|	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.уб_ОплатаПолисов");
		Запрос.УстановитьПараметр("СП",ТекущийДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>= 1 Тогда
			Выборка.Следующий();
			///РЕКУРСИЯ///
			Возврат ПолучитьИзначальныйДокумент(Выборка.Ссылка);
		КонецЕсли;		
	ИначеЕсли ТипТекущего = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда	
		ТекущийДокументСозданНаОсновании = ТекущийДокумент.СозданНаосновании;
		Если ЗначениеЗаполнено(ТекущийДокументСозданНаОсновании) Тогда
			//
			///РЕКУРСИЯ///
			Возврат ПолучитьИзначальныйДокумент(ТекущийДокументСозданНаОсновании);
		КонецЕсли;	
	ИначеЕсли ТипТекущего = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда	
		ТекущийДокументСозданНаОсновании = ТекущийДокумент.СозданНаосновании;
		Если ЗначениеЗаполнено(ТекущийДокументСозданНаосновании) Тогда
			//
			///РЕКУРСИЯ///
			Возврат ПолучитьИзначальныйДокумент(ТекущийДокументСозданНаОсновании);
		КонецЕсли;
	ИначеЕсли ТипТекущего = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда	
		ТекущийДокументСозданНаОсновании = ТекущийДокумент.СозданНаосновании;
		Если ЗначениеЗаполнено(ТекущийДокументСозданНаосновании) Тогда
			//
			///РЕКУРСИЯ///
			Возврат ПолучитьИзначальныйДокумент(ТекущийДокументСозданНаОсновании);
		КонецЕсли;
	КонецЕсли;
	Возврат ТекущийДокумент;
	
КонецФункции	

//В зависимости от доступных ролей, руководства отделом, работы в опред. подразделении определяет Роль 
Функция ПолучитьРольПользователяДляЗаявок(СтаршегоКакМенеджера = Истина, КакМассив = Ложь, ЭтоРуководитель = Неопределено) Экспорт
	
	Перем Параметры;
	
	Если КакМассив Тогда
		МассивРолей = Новый Массив;
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.УправлениеСтатусамиЗаявок, Ложь) Тогда
			//Руководители
			МассивРолей.Добавить("ПолныеПрава");
		КонецЕсли;
		Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
			МассивРолей.Добавить("Менеджер");//добавляем базовую роль
			Если ЭтоРуководитель = Неопределено Тогда
				уб_СС.ПодчиненныеРуководителя(,, Параметры);
				ЭтоРуководитель = Параметры.ЭтоРуководитель
			Иначе
				
			КонецЕсли;
			//
			Если ЭтоРуководитель Тогда
				МассивРолей.Добавить("СтаршийМенеджер");
			КонецЕсли;
		КонецЕсли;
		
		Если уб_Кэшируемые.СписокКонтролеров(Истина).Найти(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено Тогда
			МассивРолей.Добавить("Контроль");
		КонецЕсли;
		
		Если ПолучитьРуководителейСВС().Найти(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь) Тогда
			МассивРолей.Добавить("РСВС");
		КонецЕсли;
		
		Если Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокОператоров().Найти(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено Тогда
			МассивРолей.Добавить("Печать");
		ИначеЕсли уб_КЭШируемые.ДоступностьРоли("уб_СотрудникОтделаБСО") 
			И Не уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.НеОткрыватьСтатусыПриЗапуске, Ложь) 
			Тогда
			//Если уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо) = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			МассивРолей.Добавить("сБСО"); 	
			МассивРолей.Добавить("Кассир");
			МассивРолей.Добавить("ФинОтветственный");
		КонецЕсли;
		
		
		ПарСВС = уб_РасчетыСМенеджерами.ПараметрыСВС(ПараметрыСеанса.уб_ТекущееФизЛицо,ТекущаяДата());
		Если ПарСВС.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВС или ПарСВС.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя Тогда
			МассивРолей.Добавить("Курьер");	
		КонецЕсли;
		// бухгалтерии тоже требуется доступ в области БСО. Отображается для тех, у кого при запуске 1с запускаются статусы (теперь андеррайтерам не будут доступны статусы)
				
		Результат = МассивРолей;
	Иначе	
		Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.УправлениеСтатусамиЗаявок, Ложь) Тогда
			//Руководители
			Результат = "ПолныеПрава"
		ИначеЕсли уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь) Тогда
			Результат = "РСВС"
			//нет роли "Курьер"	
			//ИначеЕсли РольДоступна("уб_Курьер") Тогда
			//	Возврат "Курьер"	
		ИначеЕсли ПараметрыСеанса.уб_ЭтоМенеджер Тогда
			Если СтаршегоКакМенеджера Тогда
				Результат = "Менеджер"
			Иначе
				уб_СС.ПодчиненныеРуководителя(,, Параметры);
				Результат = ?(Параметры.ЭтоРуководитель, "СтаршийМенеджер", "Менеджер");
			КонецЕсли;
			//ИначеЕсли ПараметрыСеанса.уб_ТекущееФизЛицо = ПолучитьРуководителяСВС() Тогда
		ИначеЕсли Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокОператоров().Найти(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено Тогда
			Результат = "Печать"; 	
		ИначеЕсли уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо) = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			Результат = "сБСО" 	
			//ИначеЕсли уб_КЭШируемые.ДоступностьРоли("уб_Кассир") Тогда
			//	Результат = "Кассир"	
			//ИначеЕсли уб_КЭШируемые.ДоступностьРоли("уб_ФинансовыйАналитик, ПолныеПрава, уб_Бухгалтер") Тогда
			//	Результат = "ФинОтветственный"		
		Иначе
			Результат = "НеИзвестнаяРоль"	
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

//Получение руководителя СВС
Функция ПолучитьРуководителяСВС(Курьер) Экспорт
	
	//Возврат уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(, ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС).Сотрудник;
	//Возврат уб_СС.РуководительПодразделения(ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС);
	Параметры = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	Параметры.ВключаяВыбывших		= Истина;
	//Параметры.ТолькоТочкиПродаж		= Истина;
	//Курьер = Справочники.ФизическиеЛица.НайтиПоНаименованию("Валяев Алексей");
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Курьер);
	Параметры.СотрудникиПоДокументу = СЗ;
	уб_СС.ПодчиненныеРуководителя(Курьер,, Параметры);
	Возврат Параметры.РуководительСотрудника;
	
КонецФункции	

Функция ПолучитьРуководителейСВС() Экспорт
	
	//Возврат уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(, ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС).Сотрудник;
	Массив = Новый Массив;
	Для каждого Подразделение из ПолучитьПодразделенияВС() Цикл
		рук = уб_СС.РуководительПодразделения(Подразделение);
		Если ЗначениеЗаполнено(рук) Тогда
			Массив.Добавить(рук);
		КонецЕсли;
	КонецЦикла;
	Возврат Массив;
КонецФункции	

Функция ПолучитьПодразделенияВС(ТипПодразделения = Неопределено,КакСтруктура = Ложь) Экспорт
	ТипыПодразделений =  Новый Массив;
	Если ТипПодразделения = Неопределено Тогда
		ТипыПодразделений.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВС);
		ТипыПодразделений.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя);
	Иначе
		ТипыПодразделений.Добавить(ТипПодразделения);
	КонецЕсли;	
	
    Возврат  ПолучитьПодразделениеПоТипам(ТипыПодразделений,КакСтруктура)
	
КонецФункции	

Функция ПолучитьПодразделениеПоТипам(Типы,КакСтруктура=Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПодразделенияОрганизаций.Ссылка,
	               |	ПодразделенияОрганизаций.ТипПодразделения
	               |ИЗ
	               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	               |ГДЕ
	               |	ПодразделенияОрганизаций.ТипПодразделения В(&ТипыПодразделений)
	               |	И ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодразделенияОрганизаций.Наименование";
	Запрос.УстановитьПараметр("ТипыПодразделений",Типы);
	Если КакСтруктура Тогда
		Результат = Новый Массив;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Новый Структура("Ссылка,ТипПодразделения",Выборка.Ссылка,Выборка.ТипПодразделения));	
		КонецЦикла;	
	Иначе	
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;	
	Возврат Результат;
КонецФункции	
	

//Проверка доступности действия для роли
Функция ДействиеДоступноДляРоли(Действие, Роль) Экспорт
	//
	//ПолныеПрава,Менеджер,РСВС,Курьер,сБСО,Кассир,ФинОтветственный,НеИзвестнаяРоль
	Доступно = Ложь;
	Если Роль = "ПолныеПрава" Тогда
		Доступно =  Истина;
	Иначе
		Если Роль = "Менеджер" Тогда
			Доступные = "
				|ВнестиИзменения,
				//	|УстановитьПредыдущийСтатус,
				|УстановитьСтатус_ЗапросНаУдаление,
				//|УстановитьСтатус_НазначениеКурьера,
				//|УстановитьСтатус_СогласованиеСКлиентом,
				//|УстановитьСтатус_СогласованиеСКлиентом_Доработка,
				//|УстановитьСтатус_СтраховкаНеСостоялась,
				//|УстановитьСтатус_СтраховкаСостоялась,
				//|УстановитьСтатус_ЗаявкаОтработана,
				|УстановитьСтатус_ФормированиеКомплектаБСО,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|ИсторияЗаявки,
			|";
		ИначеЕсли Роль = "РСВС" Тогда
			Доступные = "
				|ВнестиИзменения,
				|ИзменитьКурьера,
				//|УстановитьПредыдущийСтатус,
				//|УстановитьСтатус_КурьерНаВыезде,
				//	|УстановитьСтатус_КурьерПрибылПоАдресу,
				|УстановитьСтатус_СогласованиеСКлиентом,
				|УстановитьСтатус_СогласованиеСКлиентом_Доработка,
				|УстановитьСтатус_СтраховкаНеСостоялась,	
				//|УстановитьСтатус_СтраховкаСостоялась,
				|УстановитьСтатус_ЗаявкаОтработана,
				|УстановитьСтатус_ФормированиеКомплектаБСО,
				//|УстановитьСтатус_ЗаявкаВПечати,
				|СтруктураПодчиненности,
				|УстановитьСтатус_СогласованиеСКлиентом_Доработка,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|УстановитьПредыдущийСтатус,
				|ИсторияЗаявки,
				|";
		ИначеЕсли Роль = "Контроль" Тогда
			Доступные = "
			    |УстановитьСтатус_СогласованиеСКлиентом_Доработка,
				|УстановитьСтатус_ФормированиеКомплектаБСО,
				|УстановитьСтатус_ЗаявкаВПечати,
				|УстановитьСтатус_НазначениеКурьера,
				//|УстановитьСтатус_СтраховкаСостоялась,
				|УстановитьСтатус_СтраховкаНеСостоялась,
				|УстановитьСтатус_ЗаявкаОтработана,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|ИсторияЗаявки,
				|";
			
		ИначеЕсли Роль = "Курьер" Тогда
			Доступные = "
			|УстановитьСтатус_БСОНаРукахУКурьера
				//|УстановитьСтатус_КурьерНаВыезде,
				//	|УстановитьСтатус_КурьерПрибылПоАдресу,
				//|УстановитьСтатус_СтраховкаНеСостоялась,	
				//|УстановитьСтатус_СтраховкаСостоялась,
			|";
		ИначеЕсли Роль = "сБСО" Тогда
			Доступные = "
				//ВнестиИзменения,
				|ИзменитьКурьера,
				|СоздатьПеремещениеБСО,
				|СоздатьПеремещениеБСО_Возврат,
				|СоздатьПеремещениеБСО_ВозвратЗаменаБСО,
				|СоздатьПеремещениеБСО_ВозвратЗаменаКурьера,
				|СоздатьПеремещениеБСО_ВозвратНеСостоялась,
				//|СоздатьПриемкуОплат,
				|УстановитьСтатус_НазначениеКурьера,
				|УстановитьСтатус_БСОНаРукахУКурьера,
				//|УстановитьСтатус_ДеньгиВКомпании,
				//|УстановитьСтатус_КомплектДокументацииПодготовлен,
				|УстановитьСтатус_СогласованиеСКлиентом,
				|УстановитьСтатус_СогласованиеСКлиентом_Доработка,
				//|УстановитьСтатус_ФормированиеКомплектаБСО,
				|ДвижениеСтатусовОтчетКассира,
				//|УстановитьСтатус_СтраховкаСостоялась,
				|УстановитьСтатус_СтраховкаНеСостоялась,
				|УстановитьСтатус_ЗаявкаОтработана,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|УстановитьПредыдущийСтатус,
				|ИсторияЗаявки,
			|";
		ИначеЕсли Роль = "Кассир" Тогда	
			Доступные = "
				//|УстановитьСтатус_СтраховкаСостоялась,
				|УстановитьСтатус_ЗаявкаОтработана,
				|СоздатьПриемкуОплат,
				|УстановитьСтатус_КомплектНаХраненииВБухгалтерии,
				|ДвижениеСтатусовОтчетКассира,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|УстановитьПредыдущийСтатус,
				|ИсторияЗаявки,
			|";
		ИначеЕсли Роль = "ФинОтветственный" Тогда	
			Доступные = "
				|УстановитьПредыдущийСтатус,
				//|УстановитьСтатус_ДеньгиВКомпании,
				|УстановитьСтатус_КомплектНаХраненииВБухгалтерии,
				|ДвижениеСтатусовОтчетКассира,
				|СтруктураПодчиненности,
				|ПроверитьБСО,
				|ПоказатьТаблицуБСО,
				|ИсторияЗаявки,
			|";
		ИначеЕсли Роль = "Печать" Тогда	
			Доступные = "
			|УстановитьСтатус_СогласованиеСКлиентом,
			|УстановитьСтатус_СогласованиеСКлиентом_Доработка,
			//|УстановитьСтатус_НазначениеКурьера,
			|УстановитьСтатус_ФормированиеКомплектаБСО,
			|УстановитьСтатус_ЗаявкаВПечати,
			|ИсторияЗаявки,
			|";
		Иначе
			Доступные = ""
		КонецЕсли;
		Доступно = Найти(Доступные,Действие) > 0;
	КонецЕсли;	
	Возврат Доступно;
	
КонецФункции	

//Процедура проверяет заявки запросом к временной таблице в переданном запросе, на соответствие 
//временным и другим показателям, добавляет уведомления в таблицы «Важно» заинтересованным лицам

Процедура ЗапуститьПроверку() Экспорт
	
	ПроверитьЗаявки();
	
КонецПроцедуры	

Процедура ПроверитьЗаявки(Запрос = Неопределено) Экспорт
	//
	Если Запрос = Неопределено Тогда
		//Производим основной запрос
		Запрос = Новый Запрос();
		Запрос.Текст = ПолучитьТекстОсновногоЗапроса();					  
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Выполнить();
	КонецЕсли;	
	
	//Выполняем подзапрос
	Запрос.Текст = "Выбрать * из СтатусыЗаявок ГДЕ НЕ ((СтатусыЗаявок.СтатусЗаявки = Значение(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)ИЛИ СтатусыЗаявок.СтатусЗаявки = Значение(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана)) И НЕ СтатусыЗаявок.ТребуетсяВозвратБСО=ИСТИНА) ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Статусы  = Перечисления.уб_СтатусыЗаявок;
	//ОповеститьДляСервера("Консоль","Получено "+выборка.Количество()+" заявок для проверки.");
	ТаблицаВажныхСообщений = ПолучитьВажныеСообщения();
	ДатаПроверки = ТекущаяДата();
	Пока Выборка.Следующий() Цикл
		Разница = ДатаПроверки - Выборка.Период;
		РазницаВЧасах = Окр(Разница/3600,1);
		РазницаВДнях = Окр(РазницаВЧасах/24,1);
		Заявка = Выборка.Заявка;
		Если Выборка.СтатусЗаявки  = Статусы.СтраховкаСостоялась Тогда
			//получитьПредыдущий
			ПредСтатус = ВернутьСтатусЗаявки (Выборка.Заявка,Выборка.Период-1);
			КонтрольныйПериод = 24;
			Представление = "Комплект документов не сдан после заключения страховки!";
			Если ПредСтатус = Статусы.КомплектНаХраненииВБухгалтерии Тогда
				КонтрольныйПериод = 1;
				Представление = "Комплект документов не сдан после получения с хранения.";
			КонецЕсли;	
			Если РазницаВЧасах >= КонтрольныйПериод Тогда
				УведомлениеСПроверкой(Представление,"ВажноРСВС",Заявка,ТаблицаВажныхСообщений,"Не сданы деньги"+"#"+Выборка.Период);
				Если (РазницаВЧасах - КонтрольныйПериод)>=24 Тогда
					//Второй уровень информирования
					УведомлениеСПроверкой(Представление,"ВажноМенеджер",Заявка,ТаблицаВажныхСообщений,"Не сданы деньги"+"#"+Выборка.Период);
					УведомлениеСПроверкой(Представление,"ВажноПолныеПрава",Заявка,ТаблицаВажныхСообщений,"Не сданы деньги"+"#"+Выборка.Период);
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Выборка.СтатусЗаявки  = Статусы.СтраховкаНеСостоялась Тогда	
			//получитьПредыдущий
			ПредСтатус = ВернутьСтатусЗаявки (Выборка.Заявка,Выборка.Период-1);
			КонтрольныйПериод = 24;
			Представление = "Не все БСО сданы по несостоявшейся страховке";
			Если ПредСтатус = Статусы.КомплектНаХраненииВБухгалтерии Тогда
				КонтрольныйПериод = 1;
				Представление = "Комплект документов не сдан после получения с хранения.";
			КонецЕсли;	
			Если РазницаВЧасах >= КонтрольныйПериод Тогда
				УведомлениеСПроверкой(Представление,"ВажноРСВС",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
				Если (РазницаВЧасах - КонтрольныйПериод)>=24 Тогда
					//Второй уровень информирования
					УведомлениеСПроверкой(Представление,"ВажноМенеджер",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
					УведомлениеСПроверкой(Представление,"ВажноПолныеПрава",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Выборка.СтатусЗаявки  = Статусы.КомплектНаХраненииВБухгалтерии Тогда		
			//
			Если РазницаВДнях >= 7  Тогда
				УведомлениеСПроверкой("Истек срок хранения комплекта документов!","ВажноФинОтветственный",Заявка,ТаблицаВажныхСообщений,"На хранении 7 дней"+"#"+Выборка.Период);
				УведомлениеСПроверкой("Истек срок хранения комплекта документов!","ВажноРСВС",Заявка,ТаблицаВажныхСообщений,"На хранении 7 дней"+"#"+Выборка.Период);
				Если РазницаВДнях >= 8 Тогда
					//Второй уровень информирования
					УведомлениеСПроверкой("Истек срок хранения комплекта документов!","ВажноПолныеПрава",Заявка,ТаблицаВажныхСообщений,"На хранении 7 дней"+"#"+Выборка.Период);
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Выборка.СтатусЗаявки  = Статусы.КомплектИДеньгиУКассира Тогда			
			//Скомпоновать все заявки по одному отчету кассира?
			Если РазницаВЧасах >= 24 Тогда
				УведомлениеСПроверкой("Не проверен отчет кассира!","ВажноФинОтветственный",Заявка,ТаблицаВажныхСообщений,"Проверка отчета кассира"+"#"+Выборка.Период);
				Если РазницаВЧасах >= 48 Тогда
					//Второй уровень информирования
					УведомлениеСПроверкой("Не проверен отчет кассира!","ВажноПолныеПрава",Заявка,ТаблицаВажныхСообщений,"Проверка отчета кассира"+"#"+Выборка.Период);
				КонецЕсли;	
			КонецЕсли;	
			
		ИначеЕсли (Выборка.СтатусЗаявки  = Статусы.ДеньгиВКомпании ИЛИ Выборка.СтатусЗаявки  = Статусы.ЗаявкаОтработана) И Выборка.ТребуетсяВозвратБСО=ИСТИНА Тогда			
			Если РазницаВЧасах >= 24 Тогда
				УведомлениеСПроверкой("Не все БСО сдано!","ВажносБСО",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
			КонецЕсли;	
		ИначеЕсли Выборка.ТребуетсяВозвратБСО=ИСТИНА Тогда
			Если РазницаВЧасах >= 24 Тогда
				УведомлениеСПроверкой("Не сдано БСО! Превышен срок нахождения в данном статусе: "+Выборка.СтатусЗаявки+" !","ВажносБСО",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
				Если РазницаВЧасах >= 48 Тогда
					//Второй уровень информирования
					УведомлениеСПроверкой("Не сдано БСО! Превышен срок нахождения в данном статусе: "+Выборка.СтатусЗаявки+" !","ВажноПолныеПрава",Заявка,ТаблицаВажныхСообщений,"Не сдано БСО"+"#"+Выборка.Период);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	//Оставшиеся удаляются из непрочитанных
	Для каждого СтрокаТЗ из ТаблицаВажныхСообщений Цикл
		Если Не СтрокаТЗ.учтена Тогда
			НачатьТранзакцию();
			
			НЗ = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();	
			НЗ.Отбор.ИДСообщения.Установить(СтрокаТЗ.ИДСообщения);
			Попытка
				НЗ.Очистить();
				НЗ.Записать();
			Исключение
				ОтменитьТранзакцию();
				//Возможно заблокирована/удалена пользователем попытаемся при следующей проверке
				Продолжить;
			КонецПопытки;	
			//Выборка = РегистрыСведений.уб_Чат_Сообщения.Выбрать (,,Новый Структура("ИДСообщения",СтрокаТЗ.ИДСообщения));
			//Пока Выборка.Следующий() Цикл
			//	МЗ = Выборка.ПолучитьМенеджерЗаписи();
			//	МЗ.ДатаОбновления = ТекущаяДата();
			//	МЗ.Записать();
			//КонецЦикла;	
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;	
	КонецЦикла;	
	//Уведомление("Важный тест","ВажноРСВС",Заявка);
	//Заявка = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка();
	//Уведомление("Важный тест","ВажносБСО",Заявка);
КонецПроцедуры	

Функция ПолучитьТекстОсновногоЗапроса() Экспорт
	
	Возврат "Выбрать 
|	Заявки.Ссылка,
|	Заявки.Менеджер,
|	ВЫБОР
|		КОГДА Заявки.Самовыезд
|			ТОГДА "" <Самовыезд> ""
|		ИНАЧЕ Заявки.Курьер
|	КОНЕЦ КАК Курьер,
|	Заявки.Проведен,
|	Заявки.Утверждено КАК Подтверждена,
|	Заявки.Утверждено КАК Утверждено,
|	Заявки.Дата КАК ДатаСтатуса,
|	Заявки.Статус КАК Статус,
|	Заявки.Самовыезд,
|	Заявки.ПометкаУдаления,
|	Заявки.НомерЗаявки,
|	Заявки.Номер,
|	Заявки.Дата,
|	Заявки.ВремяВстречиКлиент,
|	Заявки.Тип,
|	Заявки.Страхователь,
|	Заявки.Оператор,
|	Заявки.СтаршийОператор,
|	Заявки.Тип,
|	Заявки.Срочная,
|	Заявки.ПредставлениеЗаявки,
|   Заявки.ТребуетсяУтверждениеАндеррайтера,
|   Заявки.УтвердилАндеррайтер,
|   Заявки.Оператор,
|   Заявки.РезультатПроверки,
|   ВЫБОР
|		КОГДА уб_ПеремещениеБСО.Ссылка ЕСТЬ NULL 
|			ТОГДА ЛОЖЬ
|		ИНАЧЕ ИСТИНА
|	КОНЕЦ КАК ЕстьПеремещение

|поместить заявки0
|из 
|Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
|ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
|		ПО Заявки.Ссылка = уб_ПеремещениеБСО.СозданНаОсновании

|ГДЕ 
|Заявки.Тип <> ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)
//|и РАЗНОСТЬДАТ(Заявки.Дата, &ДатаПо, МЕСЯЦ) <= &ПоказыватьМесяцевПрочие
|			и Заявки.Дата >= &ДатаС
|					И Заявки.Дата <= &ДатаПо
|					И 4 = 4
|//ИНДЕКСИРОВАТЬ ПО  Заявки.Ссылка
|;
|Выбрать заявки0.Ссылка как Заявка, Минимум(БСО.ДатаНачала),Максимум(БСО.ДатаОкончания)  Поместить СрокиСтрахования из заявки0 как заявки0
|внутреннее соединение Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО как БСО по БСО.Ссылка = заявки0.Ссылка
|Сгруппировать по заявки0.Ссылка
|;
|ВЫБРАТЬ //РАЗЛИЧНЫЕ
|	Срез.Заявка,
|	Срез.Статус КАК СтатусЗаявки,
|	Срез.Доработка,
|	Заявки.*,
|	"""" КАК ПоложениеБСО,
|	"""" КАК Представление,
|	"""" КАК ТаблицаБСО,
|	
|	Срез.ТребуетсяВозвратБСО КАК ТребуетсяВозвратБСОВСрезе,
|	ВЫБОР
|		КОГДА Срез.ТребуетсяВозвратБСО = ИСТИНА
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК ТребуетсяВозвратБСО,
|	ВЫРАЗИТЬ(Срез.Комментарий КАК СТРОКА(100)) КАК Комментарий,
|	Срез.Статус.Порядок КАК Сортировка,
|   Isnull(СрокиСтрахования.ДатаНачала,ДатаВремя(1,1,1)) как ДатаНачала,
|   Isnull(СрокиСтрахования.ДатаОкончания,ДатаВремя(1,1,1)) как ДатаОкончания,
|	Срез.Период
|	
|ПОМЕСТИТЬ СтатусыЗаявок
|ИЗ
|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(, Заявка в (Выбрать ссылка из Заявки0)и 0 = 0) КАК Срез
|		ЛЕВОЕ СОЕДИНЕНИЕ Заявки0 КАК Заявки
|		ПО Срез.Заявка = Заявки.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиСтрахования КАК СрокиСтрахования
|		ПО Срез.Заявка = СрокиСтрахования.Заявка
|		
|ГДЕ
|	1 = 1
|	И 2 = 2
|	И 3 = 3
|	
|   И ВЫБОР
|		КОГДА Срез.ТребуетсяВозвратБСО = ИСТИНА
|			ТОГДА ИСТИНА Когда Заявки.ПометкаУдаления Тогда Ложь
//|		КОГДА Срез.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании),ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
//|			ТОГДА Заявки.Дата >= &ДатаС
//|					И Заявки.Дата <= &ДатаПо
|		//КОГДА Срез.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ФормированиеКомплектаБСО), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаВПечати), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.НазначениеКурьера), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектДокументацииПодготовлен), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.БСОНаРукахУКурьера), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась))
|		//	ТОГДА РАЗНОСТЬДАТ(Заявки.Дата, &ДатаПо, МЕСЯЦ) <= &ПоказыватьМесяцевПрочие
|		ИНАЧЕ //ИСТИНА
|		Истина
|	КОНЕЦ
|   ";
	
КонецФункции	

Функция ПолучитьТекстОсновногоЗапроса0() Экспорт
	
	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Срез.Заявка,
	|	Срез.Статус КАК СтатусЗаявки,
	|	Срез.Доработка,
	|	Заявки.Ссылка,
	|	Заявки.Менеджер,
	|	ВЫБОР
	|		КОГДА Заявки.Самовыезд
	|			ТОГДА "" <Самовыезд> ""
	|		ИНАЧЕ Заявки.Курьер
	|	КОНЕЦ КАК Курьер,
	|	Заявки.Проведен,
	|	Заявки.Утверждено КАК Подтверждена,
	|	Заявки.Утверждено КАК Утверждено,
	|	Заявки.Дата КАК ДатаСтатуса,
	|	Заявки.Статус КАК Статус,
	|	Заявки.Самовыезд,
	|	Заявки.ПометкаУдаления,
	|	Заявки.НомерЗаявки,
	|	Заявки.Номер,
	|	Заявки.Дата,
	|	Заявки.Тип,
	|	Заявки.Страхователь,
	|	Заявки.Оператор,
	|	Заявки.СтаршийОператор,
	|	Заявки.Тип,
	|	Заявки.Срочная,
	|	"""" КАК ПоложениеБСО,
	|	"""" КАК Представление,
	|	"""" КАК ТаблицаБСО,
	|	Заявки.ПредставлениеЗаявки,
	|   Заявки.ТребуетсяУтверждениеАндеррайтера,
	|   Заявки.УтвердилАндеррайтер,
	|	Срез.ТребуетсяВозвратБСО КАК ТребуетсяВозвратБСОВСрезе,
	|	ВЫБОР
	|		КОГДА Срез.ТребуетсяВозвратБСО = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяВозвратБСО,
	|	ВЫРАЗИТЬ(Срез.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	|	Срез.Статус.Порядок КАК Сортировка,
	|	Срез.Период,
	|	ВЫБОР
	|		КОГДА уб_ПеремещениеБСО.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьПеремещение,
	|   Заявки.РезультатПроверки
	|ПОМЕСТИТЬ СтатусыЗаявок
	|ИЗ
	|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних(, 0 = 0) КАК Срез
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
	|		ПО Срез.Заявка = Заявки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
	|		ПО Срез.Заявка = уб_ПеремещениеБСО.СозданНаОсновании
	|ГДЕ
	|	1 = 1
	|	И 2 = 2
	|	И 3 = 3
	|   И ВЫБОР
	|		КОГДА Срез.ТребуетсяВозвратБСО = ИСТИНА
	|			ТОГДА ИСТИНА Когда Заявки.ПометкаУдаления Тогда Ложь
	|		КОГДА Срез.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании),ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана))
	|			ТОГДА Заявки.Дата >= &ДатаС
	//|					И Заявки.Дата <= &ДатаПо
	|		//КОГДА Срез.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ФормированиеКомплектаБСО), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаВПечати), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.НазначениеКурьера), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектДокументацииПодготовлен), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.БСОНаРукахУКурьера), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась))
	|		//	ТОГДА РАЗНОСТЬДАТ(Заявки.Дата, &ДатаПо, МЕСЯЦ) <= &ПоказыватьМесяцевПрочие
	|		ИНАЧЕ //ИСТИНА
	|		РАЗНОСТЬДАТ(Заявки.Дата, &ДатаПо, МЕСЯЦ) <= &ПоказыватьМесяцевПрочие
	|	КОНЕЦ
	|   И Заявки.Тип <> ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.Административный)";
	
КонецФункции	

//Функция получает таблицу сообщений каналов Важно%
Функция ПолучитьВажныеСообщения ()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_Чат_НепрочитанныеСообщенияСрезПоследних.Период,
	|	уб_Чат_НепрочитанныеСообщенияСрезПоследних.ИДСообщения,
	|	уб_Чат_НепрочитанныеСообщенияСрезПоследних.Пользователь,
	|	уб_Чат_НепрочитанныеСообщенияСрезПоследних.Отправитель,
	|	уб_Чат_СообщенияСрезПоследних.Заголовок,
	|	уб_Чат_СообщенияСрезПоследних.Сообщение,
	|	уб_Чат_СообщенияСрезПоследних.ЕстьВложения,
	|	уб_Чат_СообщенияСрезПоследних.Вложения,
	|	уб_Чат_СообщенияСрезПоследних.ИмяКанала
	|ИЗ
	|	РегистрСведений.уб_Чат_НепрочитанныеСообщения.СрезПоследних КАК уб_Чат_НепрочитанныеСообщенияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_Сообщения.СрезПоследних КАК уб_Чат_СообщенияСрезПоследних
	|		ПО уб_Чат_НепрочитанныеСообщенияСрезПоследних.ИДСообщения = уб_Чат_СообщенияСрезПоследних.ИДСообщения
	|ГДЕ
	|	уб_Чат_СообщенияСрезПоследних.ИмяКанала ПОДОБНО ""Важно%""");
	ТаблицаВажных = Запрос.Выполнить().Выгрузить();						  
	ТаблицаВажных.Колонки.Добавить("Заявка");
	ТаблицаВажных.Колонки.Добавить("Учтена");
	Для каждого СтрокаТЗ из ТаблицаВажных Цикл
		СтрокаТЗ.Заявка  = ВернутьСсылкуИзХранилища(СтрокаТЗ.Вложения);
		СтрокаТЗ.Учтена = Ложь;
	КонецЦикла;	
	Возврат ТаблицаВажных;
	
КонецФункции	

//Процедура проверяет отсутствие сообщения по заявке в канале и выводит его
Процедура УведомлениеСПроверкой(
	Сообщение, 
	КогоУведомить, 
	Заявка, 
	Знач ТаблицаСообщений, 
	ВЗаголовок = ""
	)
	
	СтруктураПоиска = Новый Структура("ИмяКанала, Заявка", КогоУведомить, Заявка);
	МассивСтрок =  ТаблицаСообщений.НайтиСтроки(СтруктураПоиска);
	ВсегоСтрок = МассивСтрок.Количество();
	Если ВсегоСтрок = 0 Тогда
		//По данной заявке уведомлений нет, отправляем
		Уведомление(Сообщение, КогоУведомить, Заявка, ВЗаголовок);
	Иначе
		Для Счетчик = 0 по ВсегоСтрок - 1 Цикл
			текСтрока = МассивСтрок[Счетчик];
			текСтрока.Учтена = Истина;
		КонецЦикла	
	Конецесли;
	
КонецПроцедуры	

//Оповещение выводится только для соединения типа "клиент"
Функция ОповеститьДляСервера(ИмяСобытия = Неопределено, Параметр = Неопределено, Источник = Неопределено)
	
	#Если Клиент Тогда
		Оповестить(ИмяСобытия, Параметр, Источник);
	#КонецЕсли
	
КонецФункции

//Преобразование 
Функция ПредставлениеКонтрольнойДаты(Разница) Экспорт
	
	РазницаДней = Цел(Разница / (60 * 60 * 24));
	ЦелыхДней 	= Цел(РазницаДней);
	ПредставлениеКонтрольнойДаты ="";
	Если РазницаДней > 5 Тогда
		ПредставлениеКонтрольнойДаты = "" + ЦелыхДней+" дн ";
	Иначе
		РазницаЧасов = Цел(Разница / (60 * 60));
		Если РазницаЧасов >= 1 Тогда
			РазницаЧасов = Цел(РазницаЧасов) - ЦелыхДней * 24;
			ПредставлениеКонтрольнойДаты = "" + ?(ЦелыхДней=0,"",""+ЦелыхДней +" дн. ")+?(РазницаЧасов<9," "+РазницаЧасов,РазницаЧасов)+" ч";
		Иначе	
			//Минуты
			РазницаМинут = Цел(Разница/60);
			ПредставлениеКонтрольнойДаты = "" + РазницаМинут+" мин.";
		КонецЕсли;
	Конецесли;	
	Возврат ПредставлениеКонтрольнойДаты;
	
КонецФункции	

Функция ЕстьПеремещениеПоЗаявке(Заявка, ПроверятьСостав = Истина, Список = Неопределено) Экспорт
	
	//пустые заявки не нужны, пусть берутся только с данными
	Запрос = Новый Запрос;
	Если ПроверятьСостав и ТипЗнч(Заявка) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	П.Ссылка
		|ИЗ
		|	Документ.уб_ПеремещениеБСО.БСО КАК П
		|ГДЕ
		|	П.ЗаявкаКуда = &СозданНаОсновании
		|	И НЕ П.Ссылка.ПометкаУдаления";
	Иначе	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	П.Ссылка
		|ИЗ
		|	Документ.уб_ПеремещениеБСО КАК П
		|ГДЕ
		|	П.СозданНаОсновании = &СозданНаОсновании
		|	И НЕ П.ПометкаУдаления";
	КонецЕсли;
	Запрос.УстановитьПараметр("СозданНаОсновании", Заявка);
	Результат = Запрос.Выполнить();
	Список = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Не Результат.Пустой();
	
КонецФункции	

Функция ЕстьРоль(СтрокаРоли,Массив)
	
	Возврат НЕ Массив.Найти(СтрокаРоли) = Неопределено
	
КонецФункции	

Функция ВыбратьПеремещениеИзМассива(МассивПеремещений) Экспорт
	
	ФормаВыбора = Документы.уб_ПеремещениеБСО.ПолучитьФормуВыбора();
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(МассивПеремещений);
	Отбор = ФормаВыбора.ЭлементыФормы.ДокументСписок.Значение.Отбор;
	Отбор.Ссылка.ВидСравнения  	= ВидСравнения.ВСписке;
	Отбор.Ссылка.Значение 		= СЗ;
	Отбор.Ссылка.Использование 	= Истина;
	ФормаВыбора.Заголовок = "Выберите документ «Перемещение БСО», который необходимо открыть";
	КомандаПодсказки = "
	|Ш Подсказка о выборе из списка перемещений
	|Р «Обнаружено несколько документов»				
	|С Выберите из списка документов тот, который необходимо обработать .
	|П
	|Ж";//Ждем 
	ОповеститьДляСервера("Подсказка", КомандаПодсказки);
	ВыбПеремещение = ФормаВыбора.ОткрытьМодально();
	ОповеститьДляСервера("Подсказка", "НЖ");
	Возврат ВыбПеремещение;
	
КонецФункции

//переделанная процедура ВыбратьПеремещениеИзМассива без использования отборов списка
Функция ВыбратьПеремещениеПоЗаявке(НомерЗаявки)

	ФормаВыбора = Документы.уб_ПеремещениеБСО.ПолучитьФормуВыбора();
	Поле = ФормаВыбора.ЭлементыФормы.эуПоискЗаявка;
	Поле.Значение 	= НомерЗаявки;
	Поле.Locked		= Истина;
	ФормаВыбора.Заголовок = "Выберите документ «Перемещение БСО», который необходимо открыть";
	КомандаПодсказки = "
	|Ш Подсказка о выборе из списка перемещений
	|Р «Обнаружено несколько документов»				
	|С Выберите из списка документов тот, который необходимо обработать .
	|П
	|Ж";//Ждем 
	ОповеститьДляСервера("Подсказка", КомандаПодсказки);
	ВыбПеремещение = ФормаВыбора.ОткрытьМодально();
	ОповеститьДляСервера("Подсказка", "НЖ");
	Возврат ВыбПеремещение;

КонецФункции // ВыбратьПеремещениеПоЗаявке()

Функция ШапкаПодсказки(Заголовок = "Подсказки:") Экспорт
	
	Шапка ="<HTML><HEAD>
	|<TITLE>"+Заголовок+
	"</TITLE>
	|<STYLE>
	//|table{
	//| border-collapse:collapse;
	//|}
	//|td {
	//|  ms-filter:'progid:DXImageTransform.Microsoft.Alpha(opacity=99)';
	//|  filter:progid:DXImageTransform.Microsoft.Alpha(opacity=99);
	//|
	//   |  border: 1px solid RGB(203,210,214);
	//|  padding:5px;
	//|  }
	|  .green {
	|  color: RGB(0,128,0);
	|  }
	|body {
	|  font-family: Arial, Times, sans-serif; /* Гарнитура текста */
	|  font-size: 10pt;
	|  margin-top: 0px; /* отступ между заголовком и текстом сверху*/
	|  margin-bottom: 0px; /* отступ между заголовком и текстом снизу*/
	|}
	|h4 {
	|  color: navy; /* Цвет текста */
	|  font-size: 12pt;
	|}
	|ul {
	|  margin-top: 0px; /* отступ между заголовком и текстом сверху*/
	|  margin-bottom: 0px; /* отступ между заголовком и текстом снизу*/
	|}
	|ol {
	|  margin-top: 0px; /* отступ между заголовком и текстом сверху*/
	|  margin-bottom: 0px; /* отступ между заголовком и текстом снизу*/
	|}
	|li {
	|  color: red; /* Цвет маркеров */
	|  margin-bottom: 3px; 
	|}
	|br {
	|  margin-top: 0px; 
	|  margin-bottom: 0px; 
	|}
	|li span {
	|  color: navy; /* Цвет текста */
	|  margin-bottom: 3px; 
	|}
	|p {
	|  margin-top: 0px; /* отступ между заголовком и текстом сверху*/
	|  margin-bottom: 3px; /* отступ между заголовком и текстом снизу*/
	|  margin-left: 30px; /* Отступ слева*/
	|  color: black; /* Цвет текста */
	|}
	|</STYLE>
	|</HEAD>
	|<BODY>
	|";	
	Возврат Шапка;
	
КонецФункции	

Функция ПодвалПодсказки(Нумерованный = Истина) Экспорт
	
	Возврат "
	|</BODY></HTML>";
	
КонецФункции	

Функция ДобавитьПеречисление(Текст, Значение) Экспорт
	
	Возврат Текст + "
	|<LI><SPAN>" + Значение + "<SPAN>";
	
КонецФункции	

Функция ЗаголовокРаздела(Текст) Экспорт
	
	Возврат "<BR>" + "<h4>" + Текст + "<hr></h4>"
	
КонецФункции	

Процедура ОткрытьПриВыбореЕслиТипКолонкиДокумент(ВыбраннаяСтрока,ИмяКолонки,СтандартнаяОбработка) Экспорт
	
	#Если Клиент Тогда
		Попытка
			ЗначениеКолонки = ВыбраннаяСтрока[ИмяКолонки];
			ТипЗначения = ТипЗнч(ЗначениеКолонки);
			Если НЕ ТипЗначения  = Тип("Число") 
				И НЕ ТипЗначения = Тип("Строка") 
				И НЕ ТипЗначения = Тип("Дата") 
				И НЕ ТипЗначения = Тип("Булево") 
				И НЕ Метаданные.Документы.Найти(ЗначениеКолонки.Метаданные().Имя) = Неопределено Тогда				
				ЗначениеКолонки.ПолучитьФорму().Открыть();
				СтандартнаяОбработка = Ложь;
			КонецЕсли;	
		Исключение
			Возврат;
		КонецПопытки;
	#КонецЕсли
	
Конецпроцедуры	

//по любой таблице, имеющей ВидБСО и НомерБСО, определяет связанные заявки с флагом Требуется возврат БСО или нет
//выполняется раза в три дольше чем функция по отдельной заявке ПолучитьТаблицуБСОПоЗаявке
Функция ТребуетсяВозвратБСОПоСсылке(Ссылка, ТипРезультата = "тз", Параметры = Неопределено) Экспорт

	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровДляТребуетсяВозвратБСО(ТипЗнч(Ссылка));
	КонецЕсли;
	ТипРезультата = Лев(НРег(СокрЛП(ТипРезультата)), 3);
	Запрос = Новый Запрос;
	ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(ДБ.Период) КАК Период
	//|ПОМЕСТИТЬ ВТ_ПериодРегистратора
	//|ИЗ
	//|	РегистрСведений.уб_ДвиженияБСО КАК ДБ
	//|ГДЕ
	//|	ДБ.Регистратор = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	"ВЫБРАТЬ
	|	Источник.ВидБСО КАК ВидБСО,
	|	Источник.НомерБСО КАК НомерБСО,
	|	&ТекстДляЗаявки КАК Заявка
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	&Источник КАК Источник
	|ГДЕ
	|	Источник.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДБ.Заявка КАК Заявка
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО КАК ДБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ДБ.Период) КАК Период
	|			ИЗ
	|				РегистрСведений.уб_ДвиженияБСО КАК ДБ
	|			ГДЕ
	|				ДБ.Регистратор = &Ссылка) КАК ВТ_ПериодРегистратора
	|			ПО (ИСТИНА)
	|		ПО ВТ_Документ.ВидБСО = ДБ.ВидБСО
	|			И ВТ_Документ.НомерБСО = ДБ.НомерБСО
	|			И (ДБ.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка))
	|			И (ВТ_ПериодРегистратора.Период >= ДБ.Период)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Документ.Заявка
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|ГДЕ
	|	ВТ_Документ.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДБ.СК,
	|	ДБ.ВидБСО,
	|	ДБ.НомерБСО,
	|	ДБ.Заявка
	|ПОМЕСТИТЬ СписокДвижений
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО КАК ДБ
	|		ПО (ДБ.Заявка = ВТ_Заявки.Заявка)
	|ГДЕ
	|	ДБ.Подтверждено
	|	И ДБ.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОБ.СК,
	|	ОБ.ВидБСО,
	|	ОБ.Заявка
	|ПОМЕСТИТЬ СписокОстатков
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уб_ОстаткиБСО КАК ОБ
	|		ПО (ОБ.Заявка = ВТ_Заявки.Заявка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ОБ.Регистратор) КАК Регистратор,
	|	ОБ.СК,
	|	ОБ.ВидБСО
	|ПОМЕСТИТЬ ПослДвижение
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уб_ОстаткиБСО КАК ОБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОстатков КАК СписокОстатков
	|			ПО ОБ.СК = СписокОстатков.СК
	|				И ОБ.ВидБСО = СписокОстатков.ВидБСО
	|		ПО (ОБ.Заявка = ВТ_Заявки.Заявка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОБ.СК,
	|	ОБ.ВидБСО,
	|	ОБ.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДБ.Заявка,
	|	ВЫБОР
	|		КОГДА ДБ.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяВозвратБСО,
	|	ДБ.ВидБСО,
	|	ДБ.НомерБСО
	|ПОМЕСТИТЬ ВТ_Срез
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО.СрезПоследних(, Подтверждено) КАК ДБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДвижений КАК Список
	|			ПО ДБ.ВидБСО = Список.ВидБСО
	|				И ДБ.НомерБСО = Список.НомерБСО
	|				И ДБ.СК = Список.СК
	|		ПО ВТ_Заявки.Заявка = ДБ.Заявка
	|ГДЕ
	|	&УсловиеГдеДвиженияБСО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОБ.Заявка,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ОБ.Количество
	|				ИНАЧЕ -ОБ.Количество
	|			КОНЕЦ = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ОБ.ВидБСО,
	|	""""
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уб_ОстаткиБСО КАК ОБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПослДвижение КАК ПослДвижение
	|			ПО ОБ.Регистратор = ПослДвижение.Регистратор
	|		ПО ВТ_Заявки.Заявка = ОБ.Заявка
	|ГДЕ
	|	&УсловиеГдеОстаткиБСО";
	Если Параметры.ПолучитьТаблицуБСО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Срез", "");
	Иначе
		ТекстЗапроса = ТекстЗапроса + " 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заявки.Заявка КАК Заявка,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА ВТ_Срез.Заявка ЕСТЬ NULL 
		|				ИЛИ НЕ ВТ_Срез.ТребуетсяВозвратБСО
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ) КАК ТребуетсяВозвратБСО
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Срез КАК ВТ_Срез
		|		ПО ВТ_Заявки.Заявка = ВТ_Срез.Заявка
		|
		|СГРУППИРОВАТЬ ПО 
		|	ВТ_Заявки.Заявка";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Источник", 		Параметры.Источник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстДляЗаявки",	Параметры.ТекстДляЗаявки);
	УсловиеГдеДвиженияБСО 	= ?(Параметры.ПоВсемСтатусам, "ИСТИНА", "ДБ.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку)");
	УсловиеГдеОстаткиБСО	= ?(Параметры.ПоВсемСтатусам, "ИСТИНА", 
	"ВЫБОР
	|			КОГДА ОБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ОБ.Количество
	|			ИНАЧЕ -ОБ.Количество
	|		КОНЕЦ = 0");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГдеДвиженияБСО",	УсловиеГдеДвиженияБСО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГдеОстаткиБСО",	УсловиеГдеОстаткиБСО);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если Параметры.Установить И Не Параметры.ПолучитьТаблицуБСО Тогда
		СписокОбработанныхЗаявок = Новый СписокЗначений;
		Роль = уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
				Выборка.Заявка,
				,
				"ПроверитьБСО",
				,
				Роль,
				,
				Выборка.ТребуетсяВозвратБСО
				)
				Тогда
				СписокОбработанныхЗаявок.Добавить(Выборка.Заявка);
			КонецЕсли;
		КонецЦикла;
		#Если Клиент Тогда
		Если СписокОбработанныхЗаявок.Количество() > 0 Тогда
			Оповестить("уб_СтатусыЗаявокОбновитьСписки", СписокОбработанныхЗаявок, Параметры.ИмяОбъекта)
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	Если Параметры.ПолучитьТаблицуБСО Тогда
		Параметры.ТаблицаБСО = РезультатЗапроса.Выгрузить();
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("Заявка");
		Результат.Колонки.Добавить("ТребуетсяВозвратБСО");
		Для Каждого СтрокаТЗ Из Параметры.ТаблицаБСО Цикл
			Если ЗначениеЗаполнено(СтрокаТЗ.Заявка) Тогда
				СтрокаТЗРез = Результат.Найти(СтрокаТЗ.Заявка);
				Если СтрокаТЗРез = Неопределено Тогда
					СтрокаТЗРез = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗРез, СтрокаТЗ);
				ИначеЕсли Не СтрокаТЗРез.ТребуетсяВозвратБСО Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТЗРез, СтрокаТЗ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипРезультата = "тз" Тогда
		Результат = РезультатЗапроса.Выгрузить();
	ИначеЕсли ТипРезультата = "рез" Тогда
		Результат = РезультатЗапроса;
	ИначеЕсли ТипРезультата = "выб" Тогда
		Результат = РезультатЗапроса.Выбрать();
	ИначеЕсли ТипРезультата = "соо" Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Результат = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Заявка, Выборка.ТребуетсяВозвратБСО);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ТребуетсяВозвратБСОПоСсылке()

Функция СтруктураПараметровДляТребуетсяВозвратБСО(ТипЗнч) Экспорт

	Структура = Новый Структура;
	Структура.Вставить("Источник",				"");
	Структура.Вставить("ТекстДляЗаявки",		"NULL");
	Структура.Вставить("Установить",			Истина);
	Структура.Вставить("ИмяОбъекта",			"");
	Структура.Вставить("ПоВсемСтатусам",		Ложь);
	Структура.Вставить("ПолучитьТаблицуБСО",	Ложь);
	Структура.Вставить("ТаблицаБСО",			Новый ТаблицаЗначений);
	Если ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		Структура.ИмяОбъекта		= "Документ.уб_ПеремещениеБСО";
		Структура.Источник			= Структура.ИмяОбъекта + ".БСО";
		Структура.ТекстДляЗаявки 	= "Источник.ЗаявкаКуда";
		Структура.Установить		= Ложь;
	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		Структура.ИмяОбъекта		= "Документ.уб_СтраховойПолис";
		Структура.Источник			= Структура.ИмяОбъекта + ".БСО";
		Структура.ТекстДляЗаявки	= "Источник.Ссылка.Заявка";
	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_УведомлениеПоставщикаОбУтратеБСО") Тогда
		Структура.ИмяОбъекта		= "Документ.уб_УведомлениеПоставщикаОбУтратеБСО";
		Структура.Источник			= Структура.ИмяОбъекта + ".БСО";
	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда
		Структура.ИмяОбъекта		= "Документ.уб_ПриемкаОплат";
		Структура.Источник			= Структура.ИмяОбъекта + ".Полисы";
		Структура.ТекстДляЗаявки	= "Источник.Заявка";
		Структура.ПоВсемСтатусам	= Истина;
		//для приемки требуется проверка по видам и номерам БСО
		Структура.ПолучитьТаблицуБСО = Истина;
		Структура.Установить		= Ложь;
	КонецЕсли;
	Возврат Структура;

КонецФункции // СтруктураПараметровДляТребуетсяВозвратБСО()


Функция ЗапросПоБСО(Заявка)
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СК,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидСП,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СтраховаяПремия,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогСтраховаяПремия,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогПредоставленнаяСкидка,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ФормаОплаты,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки,
	                |	ВЫБОР
	                |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя = """"  или уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя=уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ЭтоКорень,
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОрганизацияАгент
	                |ИЗ
	                |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	                |ГДЕ
	                |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЭтоКорень УБЫВ";
	 Запрос.УстановитьПараметр("Ссылка",Заявка);
	 Возврат Запрос.Выполнить().Выгрузить();
 КонецФункции	
 Функция ЗапросПоБСОВМассив(Заявка) Экспорт
	Возврат уб_СЕРВЕРные.ТаблицаЗначенийВМассив(ЗапросПоБСО(Заявка));
КонецФункции	

//неактуальна, замена ТребуетсяВозвратБСОПоСсылке()
//Процедура ПроверитьНеобходимостьВозвратаПоСвязаннымЗаявкам(Ссылка) Экспорт
//	
//	Попытка
//		ТипСсылки = ТипЗнч(Ссылка);
//		ТипЗаявка = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста");
//		СписокСвязанныхЗаявок = Новый Массив;
//		Заявка = уб_УСЗ.ПолучитьИзначальныйДокумент(Ссылка);
//		Если типЗнч(Заявка)= ТипЗаявка
//			и НЕ Заявка.Пустая() Тогда
//			СписокСвязанныхЗаявок.Добавить(Заявка);
//		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
//			//не используется и не актуальна (проверка делается в ДвижениеПоРегистрам модуля менеджера перемещения)
//			Запрос = Новый Запрос("ВЫБРАТЬ
//			|	уб_ДвиженияБСО.Регистратор как Ссылка
//			|ИЗ
//			|	РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
//			|ГДЕ
//			|	уб_ДвиженияБСО.СК = &СК
//			|	И уб_ДвиженияБСО.ВидБСО = &ВидБСО
//			|	И уб_ДвиженияБСО.НомерБСО = &НомерБСО
//			|	И уб_ДвиженияБСО.Регистратор ССЫЛКА Документ.уб_ПеремещениеБСО
//			|	И НЕ уб_ДвиженияБСО.Регистратор = &Ссылка");
//			Запрос.УстановитьПараметр("Ссылка", Ссылка);
//			Для каждого СтрокаТЧ из Ссылка.БСО Цикл
//				ТекВидБСО = СтрокаТЧ.ВидБСО;
//				Если уб_СЛ.ОпределитьВедетсяНомернойУчет(ТекВидБСО) Тогда
//					Если Не ЗначениеЗаполнено(СтрокаТЧ.НомерБСО) Тогда 
//						Продолжить;
//					КонецЕсли;	 
//					Запрос.УстановитьПараметр("СК",			СтрокаТЧ.СК);
//					Запрос.УстановитьПараметр("ВидБСО",		ТекВидБСО);
//					Запрос.УстановитьПараметр("НомерБСО",	СтрокаТЧ.НомерБСО);
//					ВыборкаПеремещений = Запрос.Выполнить().Выбрать();
//					Пока ВыборкаПеремещений.Следующий() Цикл
//						Заявка = ПолучитьИзначальныйДокумент(ВыборкаПеремещений.Ссылка);
//						Если типЗнч(Заявка)= Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") 
//							и НЕ Заявка.Пустая() Тогда
//							Если СписокСвязанныхЗаявок.Найти(Заявка)=Неопределено Тогда
//								СписокСвязанныхЗаявок.Добавить(Заявка);
//							КонецЕсли;	
//						КонецЕсли;	
//					КонецЦикла;	
//				КонецЕсли;
//			КонецЦикла;	
//		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда 	
//			//TODO Заявка используется другой алгоритм?
//			СписокСвязанныхЗаявок.Добавить(Ссылка.Заявка);
//		КонецЕсли;	
//		ВсегоЗаявок = СписокСвязанныхЗаявок.Количество();
//		Для  СчетчикЗаявок = 0 по ВсегоЗаявок - 1 Цикл
//			Заявка = СписокСвязанныхЗаявок[СчетчикЗаявок];
//			ПроверитьВыполнитьДействиеПоЗаявке(Заявка, "ПроверитьБСО");
//		КонецЦикла;	
//		#Если Клиент Тогда
//			Если ВсегоЗаявок>0 Тогда 
//				Оповестить("уб_СтатусыЗаявок","ОбновитьСписки");
//			КонецЕсли;	
//		#КонецЕсли	
//	Исключение
//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не проведена проверка необходимости возврата БСО " + Ссылка + "" + Символы.ПС + "Ошибка: " + ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
//	КонецПопытки;
//	
//КонецПроцедуры


Функция ПроверитьПеремещения(Заявка,ТекСтатус,Создать = ЛОЖЬ) Экспорт
	ФлЕстьОшибки = Ложь;
	//Если ПравоДоступа("Проведение", Метаданные.Документы.уб_ПеремещениеБСО) Тогда
	Если ТекСтатус= Перечисления.уб_СтатусыЗаявок.НазначениеКурьера
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати	
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера	
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.КурьерНаВыезде	
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.КурьерПрибылПоАдресу
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.СтраховкаСостоялась
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.ЗаявкаОтработана 
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.КомплектИДеньгиУКассира	
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.КомплектНаХраненииВБухгалтерии	
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании
		или ТекСтатус= Перечисления.уб_СтатусыЗаявок.ЗапросНаУдаление	Тогда
		ДолжноБытьПроведено = Истина;
	Иначе
		ДолжноБытьПроведено = ЛОЖЬ;
	КонецЕсли;
	
	ДолженБытьКурьер = ?(Заявка.Самовыезд,Заявка.Менеджер,Заявка.Курьер);
	
	Если Найти("000000000,000081966,000081967,000081969,000081970",ДолженБытьКурьер.Код)>0 Тогда
		//Это пустой или не выбранный
		ДолжноБытьПроведено = ЛОЖЬ;
	КонецЕсли;	
	
	СоздаемПеремещение = ДолжноБытьПроведено;
	МассивПеремещений = Новый Массив;
	МассивПеремещений  = ВернутьСвязанныеСЗаявкойПеремещения(Заявка,СоздаемПеремещение,МассивПеремещений);
	
		
	ВсегоПеремещений = МассивПеремещений.Количество();
	
	Для Счетчик = 1 по ВсегоПеремещений Цикл
		СсылкаПеремещения = МассивПеремещений[Счетчик - 1];
		
		Если СсылкаПеремещения.Проведен <> ДолжноБытьПроведено
			или СсылкаПеремещения.АгентКуда<>ДолженБытьКурьер
			Тогда
			Об = СсылкаПеремещения.ПолучитьОбъект();
			Об.АгентКуда=ДолженБытьКурьер;
			Попытка
				Об.Записать(?(ДолжноБытьПроведено,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения));
				#Если Клиент Тогда
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(?(ДолжноБытьПроведено,"Проведено","Отмена проведения")+" перемещение: " + СсылкаПеремещения);
				#КонецЕсли
				ОповеститьДляСервера("Консоль","Проведение перемещения № " + Об.Номер);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
				ОповеститьДляСервера("Консоль","Ошибка при проведении перемещения № " + Об.Номер);
				ФлЕстьОшибки = Истина;
				Прервать;
			КонецПопытки;	
		КонецЕсли;	
		
		Если ТекСтатус = Перечисления.уб_СтатусыЗаявок.СтраховкаНеСостоялась Тогда
			МассивПеремещений2 = Новый Массив;
			МассивПеремещений2  = ВернутьСвязанныеСЗаявкойПеремещения(СсылкаПеремещения,СоздаемПеремещение,МассивПеремещений2);
			Для СчетчикВозврат = 1 по МассивПеремещений2.Количество() Цикл
				СсылкаВозврат = МассивПеремещений2[СчетчикВозврат - 1];
				Если СсылкаПеремещения.Проведен <> СсылкаВозврат.Проведен
					или СсылкаПеремещения.АгентКуда<>СсылкаВозврат.Агент
					Тогда
					ОбВозврат = СсылкаВозврат.ПолучитьОбъект();
					ОбВозврат.Агент=СсылкаПеремещения.АгентКуда;
					Попытка
						ОбВозврат.Записать(?(ДолжноБытьПроведено и СсылкаПеремещения.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения));
						#Если Клиент Тогда
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(?(ДолжноБытьПроведено,"Проведено","Отмена проведения")+" перемещение: " + СсылкаВозврат);
						#КонецЕсли
						ОповеститьДляСервера("Консоль","Проведение перемещения № " + ОбВозврат.Номер);
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
						ОповеститьДляСервера("Консоль","Ошибка при проведении перемещения № " + ОбВозврат.Номер);
						ФлЕстьОшибки = Истина;
						Прервать;
					КонецПопытки;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
		
	
	//КонецЕсли;
	Возврат ФлЕстьОшибки = ЛОЖЬ;
КонецФункции 		
