

Функция НайтиЗаявку(НомерПолиса,СтраховаяКомпания,Vin="",УидСтроки = "",Страхователь="",СтраховаяПремия = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст  ="ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.МаркаТС,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.МодельТС,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Vin,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Менеджер КАК Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ЛимитОтветственности,
				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Аддендум,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаНачала,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОкончания,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОбъектСтрахования,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СуммаВзноса,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.КВБрокераПлан,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос1Сумма,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Сумма,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Сумма,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Сумма,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ПредоставленнаяСкидка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СК,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Страхователь КАК Страхователь,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.ФормаОплаты,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Поставщик,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОрганизацияАгент,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерСтроки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |ГДЕ
	               |	(3 = 1
	               |			ИЛИ 2 = 1
	               |			ИЛИ 0 = 1)
	               |	И 1 = 1
				   | Упорядочить по Выбор когда 3 = 1 Тогда 0 Когда 0 = 1 тогда 1 Когда 2 = 1 тогда 2 Иначе 3 Конец";
	Если ЗначениеЗаполнено(СтраховаяКомпания)
		Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1","уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СК = &СК")
	КонецЕсли; 
	
	//Если ЗначениеЗаполнено(УидСтроки) = ЛОЖЬ Тогда
		//Поиск по номеру
		Запрос.Текст= СтрЗаменить(Запрос.Текст,"3 = 1","(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО <> """"
		|				И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО ПОДОБНО &НомерБСО)");
	//КонецЕсли;			   
	
	Если ЗначениеЗаполнено(УидСтроки) Тогда
		//Выбрана заявка вручную
		Запрос.Текст= СтрЗаменить(Запрос.Текст,"2 = 1","(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки ПОДОБНО &УидСтроки)");
		Запрос.УстановитьПараметр("УидСтроки",УидСтроки);

	ИначеЕсли ЗначениеЗаполнено(Vin)
		Тогда
		Запрос.Текст= СтрЗаменить(Запрос.Текст,"2 = 1","(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Vin = &Vin  и уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Дата >=&Дата1)");
		Запрос.УстановитьПараметр("Vin",Vin);
		Запрос.УстановитьПараметр("Дата1",ДобавитьМесяц(ТекущаяДата(),-3));
	ИначеЕсли ЗначениеЗаполнено(Страхователь) и СтраховаяПремия>0 Тогда 	
		Запрос.Текст= СтрЗаменить(Запрос.Текст,"0 = 1","(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СуммаВзноса = &СтраховаяПремия и уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Страхователь = &Страхователь и уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Дата >=&Дата1)");
		Запрос.УстановитьПараметр("СтраховаяПремия",СтраховаяПремия);
		Запрос.УстановитьПараметр("Страхователь",Страхователь);
		Запрос.УстановитьПараметр("Дата1",ДобавитьМесяц(ТекущаяДата(),-3));
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СК",СтраховаяКомпания);
	Если СтрДлина(НомерПолиса)<7 Тогда
		//ошибочные данные по ним не ищем
		Запрос.УстановитьПараметр("НомерБСО","989898989898989");
	Иначе	
		Запрос.УстановитьПараметр("НомерБСО",Номер3(НомерПолиса));
	КонецЕсли;	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Если Данные.Количество()>1 Тогда
		СтруктураПоиска = Новый Структура;
		Если ЗначениеЗаполнено(СтраховаяКомпания) Тогда
			СтруктураПоиска.Вставить("СК",СтраховаяКомпания);
		КонецЕсли;	
		
		нСтроки = данные.НайтиСтроки(СтруктураПоиска);
		Если нСтроки.Количество() = 1 Тогда
			Возврат СтруктураСтрокиЗаявки(нСтроки[0]);	
		КонецЕсли;	
		
		
		СтруктураПоиска.Вставить("СуммаВзноса",СтраховаяПремия);
		
		нСтроки = данные.НайтиСтроки(СтруктураПоиска);
		Если нСтроки.Количество() = 1 Тогда
			Возврат СтруктураСтрокиЗаявки(нСтроки[0]);	
		КонецЕсли;	
		

	КонецЕсли;	
	
	Для каждого Выборка из Данные Цикл
		
		Возврат СтруктураСтрокиЗаявки(Выборка);	
	КонецЦикла;
	Возврат Новый Структура();
	
КонецФункции

Функция СтруктураСтрокиЗаявки(Выборка) Экспорт 
	Возврат Новый Структура("Заявка,УидСтроки,МаркаТС,МодельТС,Vin,Менеджер,ВидБСО,НомерБСО,СтраховаяСумма,Аддендум,ДатаНачала,ДатаОкончания,ДатаОформления,ОбъектСтрахования,СтраховаяПремия,КВ,Взнос1Сумма,Взнос2Сумма,Взнос3Сумма,Взнос4Сумма,Взнос1Дата,Взнос2Дата,Взнос3Дата,Взнос4Дата,ПредоставленнаяСкидка,СК,Страхователь,ФормаОплаты,Поставщик,ОрганизацияАгент,Сумма,НомерСтроки",
		Выборка.Ссылка,Выборка.УидСтроки,Выборка.МаркаТС,Выборка.МодельТС,Выборка.Vin,Выборка.Менеджер,Выборка.ВидБСО,СОКРЛП(Выборка.НомерБСО),
		Выборка.ЛимитОтветственности,Выборка.Аддендум,Выборка.ДатаНачала,Выборка.ДатаОкончания,Выборка.ДатаОформления,Выборка.ОбъектСтрахования,Выборка.СуммаВзноса,Выборка.КВБрокераПлан,
		Выборка.Взнос1Сумма,Выборка.Взнос2Сумма,Выборка.Взнос3Сумма,Выборка.Взнос4Сумма,Выборка.ДатаОформления,Выборка.Взнос2Дата,Выборка.Взнос3Дата,Выборка.Взнос4Дата,
		Выборка.ПредоставленнаяСкидка,
		Выборка.СК,Выборка.Страхователь,Выборка.ФормаОплаты,
		Выборка.Поставщик,Выборка.ОрганизацияАгент,Выборка.СуммаВзноса-Выборка.ПредоставленнаяСкидка,Выборка.НомерСтроки);

КонецФункции	

Функция Номер3(Знач Номер1) Экспорт
	Если Найти(Номер1,"от")>0 Тогда	
		Номер3 = "%"+Лев(Номер1,Найти(Номер1,"от")-1)+"%"
	ИначеЕсли Найти("TTT,ТТТ,XXX,ХХХ",Лев(Номер1,3)) > 0 Тогда
		Номер3 = "%"+Прав(Номер1,9)+"%";
	ИначеЕсли СтрЧислоВхождений(Номер1,"-")>0 и Найти(Номер1,"-")<7 Тогда
	//	//Номер3 = "%"+Сред(Номер1,Найти(Номер1,"-"))+"%";
		Номер3 = "%"+СокрЛП(Номер1)+"%"
	//ИначеЕсли Найти(Номер1,"/") > 0 Тогда
	//	//это суффикс надо увеличить подстроку на его длину
	//	Номер3 = "%"+Прав(Номер1,7+СтрДлина(Номер1)-Найти(Номер1,"/")+1)+"%";
	//Иначе
	//	Номер3 = "%"+Прав(Номер1,7)+"%";
	Иначе 
		Номер3 = "%"+СокрЛП(Номер1)+"%"
	КонецЕсли;	
	Возврат Номер3
КонецФункции



Функция НайтиСоздатьПолис (СтрокаЗагрузки,СтрокаПриемки,флОбновлятьПолиса,Комментарий) Экспорт
	
	
	Если СтрокаЗагрузки.ДатаОформления = Дата(1,1,1) Тогда
		Если СтрокаЗагрузки.ДатаОплаты = Дата(1,1,1) Тогда
			ДатаОформления = СтрокаЗагрузки.ДатаНачала; 
		Иначе	
			ДатаОформления = СтрокаЗагрузки.ДатаОплаты;
		КонецЕсли;	
	Иначе
		ДатаОформления = СтрокаЗагрузки.ДатаОформления;
	КонецЕсли;	
	
	//приоритет даты Оплаты/Оформления/Начала
	Если СтрокаЗагрузки.ДатаОплаты = Дата(1,1,1) Тогда
		Если СтрокаЗагрузки.ДатаОформления = Дата(1,1,1) Тогда
			ДатаВзноса= СтрокаЗагрузки.ДатаНачала 
		Иначе	
			ДатаВзноса= СтрокаЗагрузки.ДатаОформления; 
		КонецЕсли;	
	Иначе	
		ДатаВзноса= СтрокаЗагрузки.ДатаОплаты;
	КонецЕсли;	
	СтрокаЗагрузки.ДатаОплаты = ДатаВзноса;
	
	Если ДатаОформления<Дата(2023,4,1) Тогда	
		Сообщить ("Полис "+СтрокаЗагрузки.НомерПолиса+": дата  ранее апреля 2023 не создается");
		Возврат ЛОЖЬ;
	ИначеЕсли ДатаВзноса = Дата(1,1,1) или ДатаОформления = Дата(1,1,1) тогда
		Возврат Ложь;
	КонецЕсли;	

	

	Если ЗначениеЗаполнено(СтрокаЗагрузки.Полис) Тогда
		РежимЗаполнения = флОбновлятьПолиса;
		Если флОбновлятьПолиса Тогда
			ОбъектПолис = СтрокаЗагрузки.Полис.ПолучитьОбъект();
		КонецЕсли;
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_СтраховойПолис.Ссылка
		               |ИЗ
		               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		               |ГДЕ
		               |	уб_СтраховойПолис.Номер ПОДОБНО &Номер
		               |	И уб_СтраховойПолис.СК = &СК
					   //|	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью)
					   //|	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.ДействиеОкончено)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	уб_СтраховойПолис.Дата УБЫВ";
		
		//Номер3 = "%"+Сред(СтрокаЗагрузки.НомерПолиса,5)+"%";
		//Номер3 = "%"+Сред(СтрокаЗагрузки.НомерПолиса,5)+"%";
		//Номер3 = "%"+Прав(СтрокаЗагрузки.НомерПолиса,7)+"%";
		Номер1 = СтрокаЗагрузки.НомерПолиса;
		Номер3 = Обработки.ЗагрузкаПолисовИзB2B.Номер3(Номер1);
		
		Если СтрДлина(Номер3)<8 Тогда
			//скорее всего левый номер, исключим ложное срабатываение
			Номер3 = "09876543210";
		КонецЕсли;	
		Запрос.УстановитьПараметр("Номер",Номер3);
		//Запрос.УстановитьПараметр("Номер",СтрокаЗагрузки.НомерПолиса);
		
				
		//Запрос.УстановитьПараметр("Дата",ДатаОформления);
		Запрос.УстановитьПараметр("СК",СтрокаЗагрузки.СК);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтрокаЗагрузки.Полис  = Выборка.Ссылка;
			РежимЗаполнения = флОбновлятьПолиса;
			Если флОбновлятьПолиса Тогда
				ОбъектПолис = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;	  
			Сообщить("Найден "+Выборка.Ссылка);
		Иначе
			ОбъектПолис = Документы.уб_СтраховойПолис.СоздатьДокумент();
			РежимЗаполнения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаполнения Тогда
		Если ОбъектПолис.ЭтоНовый() Тогда
			Сообщить("Заполняем полис"); 
		Иначе	
			Сообщить("Обновляем");
		КонецЕсли;
			ОбъектПолис.Номер  = СтрокаЗагрузки.НомерПолиса;
		
		//не затираем дату возможно второй взнос
		Если ОбъектПолис.Дата = Дата(1,1,1) Тогда
			ОбъектПолис.Дата = ДатаОформления+61;
			ОбъектПолис.ДатаВыдачи = ОбъектПолис.Дата;
		КонецЕсли;
		
		Попытка
			ОбъектПолис.Аддендум    = СтрокаЗагрузки.Аддендум;
		Исключение
		КонецПопытки;	
		//Если СтрокаЗагрузки.ДатаНачала = Дата(1,1,1) и СтрокаЗагрузки.ДатаОкончания <>Дата(1,1,1) Тогда
		//	ОбъектПолис.ДатаНачала = ДобавитьМесяц(СтрокаЗагрузки.ДатаОкончания,-12);
		//Иначе
			ОбъектПолис.ДатаНачала    = СтрокаЗагрузки.ДатаНачала;
		//КонецЕсли;	
		
		//Если СтрокаЗагрузки.ДатаОкончания = Дата(1,1,1) и СтрокаЗагрузки.ДатаНачала <>Дата(1,1,1) Тогда
		//	ОбъектПолис.ДатаОкончания = ДобавитьМесяц(СтрокаЗагрузки.ДатаНачала,12);
		//Иначе
		ОбъектПолис.ДатаОкончания = СтрокаЗагрузки.ДатаОкончания;
		Если ОбъектПолис.ДатаОкончания<=ОбъектПолис.ДатаНачала или ОбъектПолис.ДатаОкончания = Дата(1,1,1) Тогда
			ОбъектПолис.ДатаОкончания = Дата(Год(ОбъектПолис.ДатаНачала)+1,Месяц(ОбъектПолис.ДатаНачала),День(ОбъектПолис.ДатаНачала))-1;
		КонецЕсли;	
		//КонецЕсли;	
		
		Если ЗначениеЗаполнено(ОбъектПолис.СостояниеПолиса) = ЛОЖЬ Тогда
			ОбъектПолис.СостояниеПолиса = Перечисления.уб_СостоянияПолиса.Действует;
		КонецЕсли;	
		
		
		ОбъектПолис.Комментарий   = Комментарий;
		ОбъектПолис.ОбъектСтрахования = СтрокаЗагрузки.ОбъектСтрахования;
		ОбъектПолис.Заявка            = СтрокаПриемки.Заявка;
		Если НЕ ЗначениеЗаполнено(ОбъектПолис.Заявка) Тогда
			ОбъектПолис.Заявка = СтрокаЗагрузки.Заявка;
		КонецЕсли;	
		
		Если Строка(СтрокаПриемки.Приемка.ПринятоОт) = "_Дежурный Выходные Дни" Тогда
			Если НЕ ТипЗнч(ОбъектПолис.Страхователь) =  Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектПолис.Страхователь = ОбъектПолис.Заявка.Страхователь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектПолис.Заявка) Тогда
			ОбъектПолис.НомерЗаявки = ОбъектПолис.Заявка.НомерЗаявки;
			ОбъектПолис.Агент = ОбъектПолис.Заявка.Менеджер;
			ОбъектПолис.Курьер = ОбъектПолис.Заявка.Курьер;
		Иначе
			Если ЗначениеЗаполнено(ОбъектПолис.Агент) = ЛОЖЬ Тогда
				ОбъектПолис.Агент = СтрокаЗагрузки.Менеджер;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбъектПолис.НомерЗаявки) = ЛОЖЬ Тогда
				ОбъектПолис.НомерЗаявки = 300000;
			КонецЕсли;	
			
		КонецЕсли;	
		ОбъектПолис.ОрганизацияАгент  = СтрокаПриемки.ОрганизацияАгент;
		
		ОбъектПолис.СК                = СтрокаПриемки.СК;
		ОбъектПолис.ВидУчетаСтраховки = Перечисления.уб_ВидыУчетаСтраховок.Первичная;
		
		ОбъектПолис.Поставщик         = СтрокаПриемки.Поставщик;
		ОбъектПолис.Подразделение     = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("ОУ БСО");
		ОбъектПолис.ПодразделениеОП = уб_СС.ПолучитьПодразделениеАгента(ОбъектПолис.Агент, ОбъектПолис.Дата);
		
		ОбъектПолис.Страхователь      = СтрокаЗагрузки.Страхователь;
		
		СтраховаяПремия = ?(СтрокаЗагрузки.СтраховаяПремия <=0,0.01,СтрокаЗагрузки.СтраховаяПремия);
		
		ОбъектПолис.СтраховаяПремия   = СтраховаяПремия;
		ОбъектПолис.СтраховаяСумма         = СтрокаЗагрузки.СтраховаяСумма;
		ОбъектПолис.СтраховойПродукт      = СтрокаЗагрузки.СтраховойПродукт;
		ОбъектПолис.ДатаДвиженияБСО = ОбъектПолис.Дата;
		
		//Если преиемка создана задним числом. Значит и бсо проводим тем же числом, 
		//иначе начинаются проблемы с допроведением для заполнения страхователя
		Попытка
			ОбъектПолис.ДатаДвиженияБСО = СтрокаПриемки.Приемка.Дата+60;
		Исключение
		КонецПопытки;
		
		//
		ОбъектПолис.СуммаПремийПоОплатам  = ОбъектПолис.СтраховаяПремия;
		ОбъектПолис.СостояниеОплаченности = 2;
		
		
		
		ВспомогательныеРеквизитыПолиса(ОбъектПолис);
		
		
		Попытка
			ЗаполнитьПлатежиПоЗаявке(ОбъектПолис,СтрокаЗагрузки,СтраховаяПремия);
		Исключение
			Сообщить("При заполнении платежей по полису "+СтрокаЗагрузки.НомерПолиса+" "+ОписаниеОшибки());
		КонецПопытки;	
				
		Если ОбъектПолис.Платежи.НайтиСтроки(Новый Структура("Сумма",СтраховаяПремия)).Количество() = 0 Тогда
			ЕстьДатаВзноса = Ложь;
			Для каждого СтрокаПроверка из ОбъектПолис.Платежи Цикл
				Если НачалоМесяца(СтрокаПроверка.Дата) = НачалоМесяца(СтрокаЗагрузки.ДатаОплаты) Тогда
					ЕстьДатаВзноса = Истина;
				КонецЕсли;	
			КонецЦикла;	
			Если ЕстьДатаВзноса = Ложь Тогда
				Платеж  = ОбъектПолис.Платежи.Добавить();
				
				Платеж.Дата = СтрокаЗагрузки.ДатаОплаты;
				Платеж.Сумма    = СтраховаяПремия;
			КонецЕсли;
		КонецЕсли;	
		
		ОбъектПолис.СтраховаяПремия = ОбъектПолис.Платежи.Итог("Сумма");
		
		ЗаполнитьРиски(ОбъектПолис);
		
		
		Если ОбъектПолис.БСО.Количество() = 0 Тогда
			БСО = ОбъектПолис.БСО.Добавить();
		Иначе
			БСО = ОбъектПолис.БСО[0];
		КонецЕсли;	
		
		БСО.ВидБСО     = СтрокаПриемки.ВидБСО;
		БСО.НомерБСО      =СтрокаЗагрузки.НомерПолиса;
		БСО.НомерПолиса   = СтрокаЗагрузки.НомерПолиса;
		БСО.Обязательно = Истина;
		БСО.Оформлен = Истина;
		БСО.Агент     = ОбъектПолис.Агент;
		
		ОбъектПолис.Записать();
		СтрокаЗагрузки.Полис  = ОбъектПолис.Ссылка;
		Сообщить("Создан "+ОбъектПолис);
	иначе
		Сообщить("Пропущен");
	КонецЕсли;	
	
	
КонецФункции	

Процедура ЗаполнитьПлатежиПоЗаявке(ОбъектПолис,СтрокаЗагрузки,СтраховаяПремия) Экспорт
	Если СтрокаЗагрузки.ДатаОформления = Дата(1,1,1)
		или СтрокаЗагрузки.Взнос1Сумма = 0 Тогда
		//Старый код
		Если ОбъектПолис.Платежи.Количество()<=1 Тогда
			Если ОбъектПолис.Платежи.Количество() = 0 Тогда
				Платеж  = ОбъектПолис.Платежи.Добавить();
			Иначе
				Платеж = ОбъектПолис.Платежи[0];
			КонецЕсли;
			
			Платеж.Дата     = ОбъектПолис.Дата;
			Платеж.Сумма    = СтраховаяПремия;
		КонецЕсли;
	Иначе
		//возможно несколько платежей
		Если ОбъектПолис.Платежи.Количество()<1 Тогда
			Платеж  = ОбъектПолис.Платежи.Добавить();
		Иначе	
			Платеж  = ОбъектПолис.Платежи[0];
		КонецЕсли;
		Платеж.Дата     = СтрокаЗагрузки.ДатаОформления;
		Платеж.Сумма    = СтрокаЗагрузки.Взнос1Сумма;
		//2
		Если СтрокаЗагрузки.Взнос2Дата = Дата(1,1,1)
			или СтрокаЗагрузки.Взнос2Сумма = 0 Тогда
			Если ОбъектПолис.Платежи.Количество()>1 Тогда
				ОбъектПолис.Платежи.Удалить(1);
			КонецЕсли;	
		Иначе
			Если ОбъектПолис.Платежи.Количество()<2 Тогда
				Платеж  = ОбъектПолис.Платежи.Добавить();
			Иначе	
				Платеж  = ОбъектПолис.Платежи[1];
			КонецЕсли;
			Платеж.Дата     = СтрокаЗагрузки.Взнос2Дата;
			Платеж.Сумма    = СтрокаЗагрузки.Взнос2Сумма;
		КонецЕсли;
		
		//3
		Если СтрокаЗагрузки.Взнос3Дата = Дата(1,1,1)
			или СтрокаЗагрузки.Взнос3Сумма = 0 Тогда
		Иначе
			Если ОбъектПолис.Платежи.Количество()<3 Тогда
				Платеж  = ОбъектПолис.Платежи.Добавить();
			Иначе	
				Платеж  = ОбъектПолис.Платежи[2];
			КонецЕсли;
			Платеж.Дата     = СтрокаЗагрузки.Взнос3Дата;
			Платеж.Сумма    = СтрокаЗагрузки.Взнос3Сумма;
		КонецЕсли;
		
		//4
		Если СтрокаЗагрузки.Взнос4Дата = Дата(1,1,1)
			или СтрокаЗагрузки.Взнос4Сумма = 0 Тогда
		Иначе
			Если ОбъектПолис.Платежи.Количество()<4 Тогда
				Платеж  = ОбъектПолис.Платежи.Добавить();
			Иначе	
				Платеж  = ОбъектПолис.Платежи[3];
			КонецЕсли;
			Платеж.Дата     = СтрокаЗагрузки.Взнос4Дата;
			Платеж.Сумма    = СтрокаЗагрузки.Взнос4Сумма;
		КонецЕсли;
		
	КонецЕсли;
	ОбъектПолис.СтраховаяПремия = ОбъектПолис.Платежи.Итог("Сумма");
КонецПроцедуры
		
Процедура  ЗаполнитьРиски(ОбъектПолис) Экспорт
	Если ОбъектПолис.Риски.Количество() = 0 Тогда
		Риски = ОбъектПолис.Риски.Добавить();
	Иначе
		Риски = ОбъектПолис.Риски[0];
	КонецЕсли;	
	Если ТипЗнч(ОбъектПолис.СтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
		Попытка
			Риски.СтраховойРиск = ОбъектПолис.СтраховойПродукт.ТипыОбъектовИРиски[0].Риск;
		Исключение
		КонецПопытки;	
	ИначеЕсли ТипЗнч(ОбъектПолис.СтраховойПродукт) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Риски.СтраховойРиск = ОбъектПолис.СтраховойПродукт;
	Иначе
		Попытка
			Если ЗначениеЗаполнено(ОбъектПолис.ВидСП) Тогда
				Риски.СтраховойРиск = ОбъектПолис.ВидСП;	
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	Риски.СтраховаяСумма  = ОбъектПолис.СтраховаяСумма;
	Риски.СтраховаяПремия = ОбъектПолис.Платежи.Итог("Сумма");//ОбъектПолис.СтраховаяПремия;
	Риски.Тариф     = ?(ОбъектПолис.СтраховаяСумма=0,0,100*Риски.СтраховаяПремия/ОбъектПолис.СтраховаяСумма);
	
КонецПроцедуры		

Функция ВспомогательныеРеквизитыПолиса(ОбъектПолис)
	ОбъектПолис.ВалютаДокумента  = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ЗначениеЗаполнено(ОбъектПолис.Заявка) Тогда
		ОбъектПолис.НомерЗаявки = ОбъектПолис.Заявка.НомерЗаявки;
			
	Иначе
		ОбъектПолис.НомерЗаявки = 300000;
	КонецЕсли;	
	ОбъектПолис.Ответственный     = ПараметрыСеанса.ТекущийПользователь;
	ОбъектПолис.Ответственный2     = ПараметрыСеанса.ТекущийПользователь;
КонецФункции	

Функция НайтиСоздатьОплатуПолиса (СтрокаЗагрузки,СтрокаПриемки,ПриемкиНеБыло = ЛОЖЬ,флОбновлятьОплаты,ТОЛЬКОПОИСК = ЛОЖЬ)  Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Полис) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если СтрокаЗагрузки.ДатаОплаты = Дата(1,1,1) Тогда
		ДатаОплаты = СтрокаЗагрузки.Полис.Дата; 
		СтрокаЗагрузки.ДатаОплаты = ДатаОплаты;
	Иначе	
		ДатаОплаты = СтрокаЗагрузки.ДатаОплаты;
	КонецЕсли;	
	
	Если ДатаОплаты = Дата(1,1,1)  тогда
		Сообщить (""+СтрокаЗагрузки.Полис+" не определена дата оплаты, пропущен");
		Возврат Ложь;
	КонецЕсли;	
	
	Полис = СтрокаЗагрузки.Полис;
	Если Не Полис.СостояниеПолиса = Перечисления.уб_СостоянияПолиса.Действует Тогда
		Сообщить ("Полис "+Полис+" не действует, автоматически оплаты к нему не создаются, потому что могут быть расхождения сумм, чтобы не плодить дубли");
		Возврат ЛОЖЬ;
	ИначеЕсли Полис.Дата<Дата(2023,4,1) Тогда	
		Сообщить ("Полис "+Полис+" дата  ранее апреля 2023. Оплата не создается");
		Возврат ЛОЖЬ;
	КонецЕсли;	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Оплата.Ссылка,
	               |	Оплата.ФормаОплаты,
	               |	Оплата.НачисленнаяСуммаВзноса,
	               |	НАЧАЛОПЕРИОДА(Оплата.Дата, МЕСЯЦ) КАК ДатаОплаты,
	               |	Оплата.АВилиСкидкаСумма,
	               |	Оплата.СкидкаВыплаченаяКлиенту,
	               |	Оплата.НомерКвитанции
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК Оплата
	               |ГДЕ
	               |	Оплата.СтраховойПолис = &СтраховойПолис
	               |	И Оплата.ИсключенаИзВзаиморасчетов = ЛОЖЬ
	               |	И Оплата.ИсключитьИзРасчетаЗП = ЛОЖЬ
	               |	И Оплата.НеВключатьВОтчетыПоставщикам = ЛОЖЬ
	               |	И (Оплата.ФормаОплаты = &ФормаОплаты
	               |			ИЛИ Оплата.Дата >= &Дата)";
				   
				   //|	И Оплата.НачисленнаяСуммаВзноса = &НачисленнаяСуммаВзноса
				   //|	И НАЧАЛОПЕРИОДА(Оплата.Дата, МЕСЯЦ) = &МесяцОплаты";
	Запрос.УстановитьПараметр("СтраховойПолис",Полис);
	Запрос.УстановитьПараметр("ФормаОплаты", СтрокаПриемки.ФормаОплаты);
	//на случай если форма оплаты поменяли, в один день две формы маловероятно
	Запрос.УстановитьПараметр("Дата", СтрокаЗагрузки.ДатаОплаты-21*3600*24);
	
	//Запрос.УстановитьПараметр("НачисленнаяСуммаВзноса", СтрокаЗагрузки.СтраховаяПремия);
	//Запрос.УстановитьПараметр("МесяцОплаты", НачалоМесяца(СтрокаЗагрузки.ДатаОплаты));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаПремийПоОплатам = 0; 
	СуммаСкидкиПоОплатам = 0;
	НомерВзноса = 0;
	Пока Выборка.Следующий() Цикл
		НомерВзноса = НомерВзноса+1;
		СуммаПремийПоОплатам = СуммаПремийПоОплатам + Выборка.НачисленнаяСуммаВзноса;
		СуммаСкидкиПоОплатам = СуммаСкидкиПоОплатам + Выборка.АВилиСкидкаСумма ;
	КонецЦикла;	
	
	//Попытка
	//	НЕОплачен = Найти (СтрокаЗагрузки.Статус,"Не оплачен")>0;
	//Исключение
	//	НЕОплачен = Ложь;
	//КонецПопытки;	
	
	Попытка
		//загрузка из приемки
		НомерКвитанции = СтрокаПриемки.НомерКвитанции;
		ЕстьКвитанция  = ЗначениеЗаполнено(НомерКвитанции);
	Исключение
		НомерКвитанции = "";
		ЕстьКвитанция  = ЛОЖЬ;
	КонецПопытки;		
	
	СсылкаОплата = Неопределено;
	_ДатаОплаты = НачалоМесяца(СтрокаЗагрузки.ДатаОплаты);
	_ДатаПроверкиОплаты = НачалоМесяца(СтрокаЗагрузки.ДатаОплаты-21*3600*24);
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДатаОплаты >=  _ДатаПроверкиОплаты Тогда
		ИначеЕсли ЕстьКвитанция = ИСТИНА и НомерКвитанции = Выборка.НомерКвитанции Тогда	
		Иначе
			//другой взнос ?
			Продолжить;
		КонецЕсли;	
		//Если Выборка.НачисленнаяСуммаВзноса = СтрокаЗагрузки.СтраховаяПремия
		//	и 
		//	Тогда
		//Иначе
		//	//другой взнос ?
		//	Продолжить;
		//КонецЕсли;	
		СсылкаОплата = Выборка.Ссылка;
		Если Выборка.ФормаОплаты <> СтрокаЗагрузки.ФормаОплаты Тогда
			РежимЗаполнения = ЛОЖЬ;
			Попытка
				Сообщить("В строке "+СтрокаЗагрузки.НомерСтроки+" в оплате полиса другая форма оплаты, пропускаем "+Выборка.ФормаОплаты);
			Исключение
			КонецПопытки;	
			СтрокаЗагрузки.Оплата = СсылкаОплата;
			Возврат ЛОЖЬ;
		Иначе
			РежимЗаполнения = флОбновлятьОплаты или ПриемкиНеБыло = ИСТИНА;// или Найти (СтрокаЗагрузки.Статус,"Не оплачен")>0;
			Если РежимЗаполнения Тогда
				ОбьектОплаты = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если ТОЛЬКОПОИСК = Истина Тогда
		СтрокаЗагрузки.Оплата = СсылкаОплата;
		Возврат НЕ СсылкаОплата = Неопределено;
	КонецЕсли;	
	Если СсылкаОплата = Неопределено и ТОЛЬКОПОИСК = ЛОЖЬ Тогда
		ОбьектОплаты = Документы.уб_ОплатаПолисов.СоздатьДокумент();
		РежимЗаполнения = Истина;
		СуммаПремийПоОплатам = СуммаПремийПоОплатам + СтрокаЗагрузки.СтраховаяПремия;
		НомерВзноса = НомерВзноса+1;
	КонецЕсли;
	Если РежимЗаполнения = Истина Тогда
		Сообщить("Создаем");
		ОбьектОплаты.Дата = ДатаОплаты;
		ОбьектОплаты.ДатаМониторинга  = ДатаОплаты;
		ОбьектОплаты.ОрганизацияАгент  = СтрокаПриемки.ОрганизацияАгент;
		ОбьектОплаты.Поставщик         = СтрокаПриемки.Поставщик;
		ОбьектОплаты.СК                = СтрокаЗагрузки.СК;
		ОбьектОплаты.СтраховойПолис    = СтрокаЗагрузки.Полис;
		ОбьектОплаты.СтраховойПродукт      = СтрокаЗагрузки.СтраховойПродукт;
		ОбьектОплаты.ЗарплатныйПериод = НачалоДня(КонецМесяца(ОбьектОплаты.Дата));
		ОбьектОплаты.НачисленнаяСуммаВзноса        = СтрокаЗагрузки.СтраховаяПремия;
		ОбьектОплаты.ФормаОплаты        = СтрокаЗагрузки.ФормаОплаты;
		Если СтрокаЗагрузки.СуммаВПриемке>0 Тогда
			ОбьектОплаты.ОплаченоФакт       = СтрокаЗагрузки.СуммаВПриемке;
		Иначе
			Если ОбьектОплаты.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
				ОбьектОплаты.ОплаченоФакт       = СтрокаЗагрузки.СтраховаяПремия;
				ОбьектОплаты.СкидкаВыплаченаяКлиенту = СтрокаЗагрузки.ПредоставленнаяСкидка;
			Иначе	
				ОбьектОплаты.ОплаченоФакт       = СтрокаЗагрузки.СтраховаяПремия-СтрокаЗагрузки.ПредоставленнаяСкидка;
			КонецЕсли;	
		КонецЕсли;	
		ОбьектОплаты.АВилиСкидкаСумма   = ОбьектОплаты.НачисленнаяСуммаВзноса-ОбьектОплаты.ОплаченоФакт+ОбьектОплаты.СкидкаВыплаченаяКлиенту;
		Если ОбьектОплаты.АВилиСкидкаСумма = 0 Тогда
			ОбьектОплаты.АВилиСкидкаПроцент = 0;
		Иначе
			ОбьектОплаты.АВилиСкидкаПроцент = Окр(?(ОбьектОплаты.НачисленнаяСуммаВзноса=0,0,100*ОбьектОплаты.АВилиСкидкаСумма/ОбьектОплаты.НачисленнаяСуммаВзноса),2);
			СуммаСкидкиПоОплатам = СуммаСкидкиПоОплатам+ОбьектОплаты.АВилиСкидкаСумма;
		КонецЕсли;
		
		
		ОбьектОплаты.Агент              = Полис.Агент;
		ОбьектОплаты.Подразделение      = Полис.ПодразделениеОП;
		
		
		
		//ОбьектОплаты.Направление        = Перечисления.Уб_Направления.НовыйКлиент;
		Если  ОбьектОплаты.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
			ОбьектОплаты.НаправлениеПлатежа  =  Перечисления.уб_НаправленияПлатежа.Поставщику;
		Иначе
			ОбьектОплаты.НаправлениеПлатежа  =  Перечисления.уб_НаправленияПлатежа.ВБрокер;
		КонецЕсли;	
		ОбьектОплаты.Курьер              = Полис.Курьер;
		ОбьектОплаты.Валюта  = Константы.ВалютаРегламентированногоУчета.Получить();
		ОбьектОплаты.Курс = 1;
		
		ОбьектОплаты.ВидСП               = СтрокаЗагрузки.ВидСП;
		Если ОбьектОплаты.ВидСП <> Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО и ОбьектОплаты.ВидСП <> Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО Тогда
			ОбьектОплаты.ПроверенаЗП = Истина;
		КонецЕсли;	
		ОбьектОплаты.ДатаПроведенияБСО   = ОбьектОплаты.Дата;
		
		Попытка
			//загрузка из приемки
			ОбьектОплаты.ЕстьКвитанция  = ЕстьКвитанция;
			ОбьектОплаты.НомерКвитанции = НомерКвитанции;
		Исключение	
			//загрузка из заявки
			ОбьектОплаты.ЕстьКвитанция       = Ложь;
		КонецПопытки;	
		ОбьектОплаты.НачисленнаяСуммаВзносаВВалюте = СтрокаЗагрузки.СтраховаяПремия;
		ОбьектОплаты.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику = СтрокаЗагрузки.СтраховаяПремия;
		ОбьектОплаты.ПолнаяСтраховаяПремия = СтрокаЗагрузки.СтраховаяПремия;
		
		ОбьектОплаты.КВПроцент           = СтрокаЗагрузки.ПроцентКВ;
		ОбьектОплаты.КВПроцентДляАгента  = ОбьектОплаты.КВПроцент;
		ОбьектОплаты.КВПроцентДляОтчета  = СтрокаЗагрузки.ПроцентКВДляОтчета;
		ОбьектОплаты.КВСумма             = СтрокаЗагрузки.СуммаКВ;
		ОбьектОплаты.КВСуммаДляАгента    = ОбьектОплаты.КВСумма;
		ОбьектОплаты.КВСуммаДляОтчета    = СтрокаЗагрузки.СуммаКВДляОтчета;
		Если Полис.НомерЗаявки  = Перечисления.уб_ВидыЗаявок.Личная Тогда
			
			
			//Если 
			//НЕ (ОбьектОплаты.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР
			//ИЛИ ОбьектОплаты.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека)
			//и ОбьектОплаты.ЗарплатныйПериод>=Дата(2026,1,1)	 
			//и ОбьектОплаты.ФормаОплаты     = Перечисления.уб_ФормыОплаты.Поставщику
			//Тогда
			//	Дельта = 9;
			//Иначе	
				Дельта = 6; //Дл
			//КонецЕсли;	
			
			ОбьектОплаты.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
			ОбьектОплаты.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
			ОбьектОплаты.КВПроцентДляАгента = ОбьектОплаты.КВПроцент-Дельта;
			ОбьектОплаты.КВСуммаДляАгента = ОбьектОплаты.НачисленнаяСуммаВзноса* ОбьектОплаты.КВПроцентДляАгента/100;
			ОбьектОплаты.ВМРасчетное = ОбьектОплаты.КВСуммаДляАгента-ОбьектОплаты.АВилиСкидкаСумма;
			ОбьектОплаты.ДБ = ОбьектОплаты.КВСумма-ОбьектОплаты.КВСуммаДляАгента;
			ОбьектОплаты.АВилиСкидкаСумма = Макс(ОбьектОплаты.АВилиСкидкаСумма,ОбьектОплаты.КВСуммаДляАгента);
			ОбьектОплаты.АВилиСкидкаПроцент = Окр(?(ОбьектОплаты.НачисленнаяСуммаВзноса=0,0,100*ОбьектОплаты.АВилиСкидкаСумма/ОбьектОплаты.НачисленнаяСуммаВзноса),2);
			ОбьектОплаты.ВМпоРезультатамПериодаЗП = Ложь;
		Иначе	
			ОбьектОплаты.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме;
			ОбьектОплаты.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ;
			ОбьектОплаты.ДБ = ОбьектОплаты.КВСумма-ОбьектОплаты.АВилиСкидкаСумма;
			ОбьектОплаты.ВМпоРезультатамПериодаЗП = Истина;
			
			//Если 
			//НЕ (ОбьектОплаты.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР
			//ИЛИ ОбьектОплаты.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека)
			//и ОбьектОплаты.ЗарплатныйПериод>=Дата(2026,1,1)	 
			//и ОбьектОплаты.ФормаОплаты     = Перечисления.уб_ФормыОплаты.Поставщику
			//Тогда
			//	Дельта = 3;
			//Иначе	
				Дельта = 0;
			//КонецЕсли;	
			ОбьектОплаты.КВПроцентДляАгента =  Макс(0,ОбьектОплаты.КВПроцент-Дельта);
			ОбьектОплаты.КВСуммаДляАгента = ОбьектОплаты.НачисленнаяСуммаВзноса* ОбьектОплаты.КВПроцентДляАгента/100;

		КонецЕсли;
		
		ОбьектОплаты.РежимОкругления = Перечисления.уб_РежимОкругления.Вбольшую;
		ОбьектОплаты.РазрядностьОкругления = 2;
		ОбьектОплаты.НомерВзноса = НомерВзноса; 
		
		Если ОбьектОплаты.ФормаОплаты     = Перечисления.уб_ФормыОплаты.Поставщику Тогда
			ОбьектОплаты.Баланс_Брокер_Поставщик = -ОбьектОплаты.КВСуммаДляОтчета;
		Иначе	
			ОбьектОплаты.Баланс_Брокер_Поставщик = ОбьектОплаты.НачисленнаяСуммаВзноса-ОбьектОплаты.КВСуммаДляОтчета;
		КонецЕсли;	
		
		уб_РасчетыСМенеджерами.ПроверитьВидСтрахования(ОбьектОплаты);
		
		_Параметры = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
		//Параметры.ДанныеПоЗПМенеджерам = ДанныеПоЗПМенеджерам;
		уб_РасчетыСМенеджерами.ОП_ПересчетСумм(ОбьектОплаты,,, _Параметры);
		ОбьектОплаты.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создана "+ОбьектОплаты);
		Попытка
			ОбьектОплаты.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
		
		СсылкаОплата = ОбьектОплаты.Ссылка;
		
		ОбьектПолис = Полис.ПолучитьОбъект();
		ВспомогательныеРеквизитыПолиса(ОбьектПолис);
		Если СуммаПремийПоОплатам<>ОбьектПолис.СуммаПремийПоОплатам Тогда
			ОбьектПолис.СуммаПремийПоОплатам = СуммаПремийПоОплатам;
		КонецЕсли;
		
		Если СуммаСкидкиПоОплатам<>ОбьектПолис.СуммаСкидкиПоОплатам Тогда
			ОбьектПолис.СуммаСкидкиПоОплатам = СуммаСкидкиПоОплатам;
		КонецЕсли;
		
		Попытка
			ОбьектПолис.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
		КонецПопытки;	
		
	Иначе
		Сообщить("Пропускаем "+СсылкаОплата);
	КонецЕсли;	
	
	СтрокаЗагрузки.Оплата = СсылкаОплата;
	
	уб_СС.ДобавитьКвитовкуОплат(СтрокаПриемки.УИДСтроки, СтрокаПриемки.Приемка, СсылкаОплата, Неопределено);	
	
	 Сообщить("Квитуем "+СтрокаПриемки.Приемка+" с "+СсылкаОплата);
	
	
	
	
	
КонецФункции	

Функция НайтиПростойОбъектСтрахования(ВидСп,НаименованиеТипа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	уб_ОбъектыСтрахования.Ссылка,
	                |	уб_ОбъектыСтрахования.Наименование
	                |ИЗ
	                |	Справочник.уб_ОбъектыСтрахования КАК уб_ОбъектыСтрахования
	                |ГДЕ
	                |	уб_ОбъектыСтрахования.Тип.Наименование = &НаименованиеТипа
	                |	Или уб_ОбъектыСтрахования.Наименование = &Наименование";
					Запрос.УстановитьПараметр("НаименованиеТипа",НаименованиеТипа);
					Запрос.УстановитьПараметр("Наименование",ВидСп);
	Выборка = Запрос.Выполнить().Выбрать();				
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Сообщить("Не найден объект страхования "+ ВидСП);
	КонецЕсли;
	Возврат Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
		
КонецФункции


Функция ИсправитьНомераВзносов() Экспорт
	
Запрос = новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
|	Платежи.Ссылка.Ссылка КАК Ссылка1,
|	МАКСИМУМ(Платежи.НомерСтроки) КАК НомерСтроки,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос1Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СтраховаяПремия,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления
|ИЗ
|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис.Платежи КАК Платежи
|		ПО (Платежи.Ссылка.Номер = уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО)
|ГДЕ
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Дата <> ДАТАВРЕМЯ(1, 1, 1)
|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО = """"
|	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Дата > ДАТАВРЕМЯ(2024, 1, 1)

|СГРУППИРОВАТЬ ПО
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка,
|	Платежи.Ссылка.Ссылка,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос2Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос3Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Дата,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос4Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Взнос1Сумма,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СтраховаяПремия,
|	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления

|ИМЕЮЩИЕ
|	МАКСИМУМ(Платежи.НомерСтроки) = 1";
Выборка  = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	Ссылка = Выборка.Ссылка1;
	ОбъектПолис = Ссылка.ПолучитьОбъект();
	Обработки.ЗагрузкаПолисовИзB2B.ЗаполнитьПлатежиПоЗаявке(ОбъектПолис,Выборка,Выборка.СтраховаяПремия);
	ОбъектПолис.Записать();
	
	
КонецЦикла;	
КонецФункции