// Функция получает данные из файла Excel
//
// Параметры:
//   пФайл     - Имя файла
//   пЛист     - Имя листа с данными
//   СтруктураКолонок - Структура вида "ИмяКолонки" - "НомерКолонки"
//                      если не задано, созадуться колонки вида "К1", "К2"
//   XLSОбъект - COM объект типа "Excel.Application"
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция Excel_ПолучитьДанные_COMArray(пФайл, пЛист, СтруктураКолонок = Неопределено, Знач НачСтрока = 0, Знач КонСтрока = 0, XLSОбъект = Неопределено) Экспорт

    #Если Клиент Тогда
    Состояние("Открытие Excel");
    #КонецЕсли

    Если XLSОбъект = Неопределено Тогда
        XLSОбъект = Новый COMОбъект("Excel.Application");
        XLSОбъект.Visible       = Ложь;
        XLSОбъект.DisplayAlerts = Ложь;
    КонецЕсли;

    Попытка
        Book = XLSОбъект.Workbooks.Open(пФайл, , Истина);
    Исключение
        Сообщить ("Проблемы с подключением к Excel" );
        Возврат Неопределено;
    КонецПопытки;

    Лист = Book.Sheets(1);
    КолвоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
    КолвоСтрок   = Лист.Cells(1,1).SpecialCells(11).Row;
	Если КолвоКолонок = 1 Тогда
		Попытка
			Лист = Book.Sheets(2);
    		КолвоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
    		КолвоСтрок   = Лист.Cells(1,1).SpecialCells(11).Row;
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	

    Таблица = Новый ТаблицаЗначений;

    Если СтруктураКолонок = Неопределено Тогда

		Колонка = Таблица.Колонки.Добавить("НомерСтроки",,"Номер строки");
        Для Счетчик = 1 По КолвоКолонок Цикл
            Колонка = Таблица.Колонки.Добавить("К" + Счетчик);
        КонецЦикла;

    Иначе

        МаксимальныйНомерКолонки = 0;
        Для каждого КлючИЗначение Из СтруктураКолонок Цикл
            Колонка = Таблица.Колонки.Добавить(КлючИЗначение.Ключ);
            МаксимальныйНомерКолонки = Макс(МаксимальныйНомерКолонки, КлючИЗначение.Значение);
        КонецЦикла;

        КолвоКолонок = Мин(КолвоКолонок, МаксимальныйНомерКолонки);

    КонецЕсли;

    НачСтрока = ?(НачСтрока = 0, 1, НачСтрока);
    КонСтрока = ?(КонСтрока = 0, КолвоСтрок, КонСтрока);
    КонСтрока = Мин(КонСтрока, КолвоСтрок);

    // Массив типа COMSafeArray
    Массив = Лист.Range(Лист.Cells(НачСтрока, 1), Лист.Cells(КонСтрока, КолвоКолонок)).Value;
    КолвоСтрок   = Массив.GetUpperBound(1);

    Для НомерСтроки = 1 По КолвоСтрок Цикл

        #Если Клиент Тогда
        Состояние("Чтение файла: " + Формат(НомерСтроки) + " из " + Формат(КолвоСтрок));
        ОбработкаПрерыванияПользователя();
        #КонецЕсли

        НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.НомерСтроки = Таблица.Количество();

        Если СтруктураКолонок = Неопределено Тогда

            Для НомерКолонки = 1 По КолвоКолонок Цикл

				ТекЗнач = Массив.GetValue(НомерКолонки, НомерСтроки);
				Если Найти(ТекЗнач,Символы.ПС) Тогда
					ТекЗнач = СтрЗаменить(ТекЗнач,Символы.ПС," ");
				КонецЕсли;	
                НоваяСтрока["К" + Формат(НомерКолонки, "ЧГ=0")] = ТекЗнач;

            КонецЦикла;

        Иначе

            Для каждого КлючИЗначение Из СтруктураКолонок Цикл

                НоваяСтрока[КлючИЗначение.Ключ] = Массив.GetValue(КлючИЗначение.Значение, НомерСтроки);

            КонецЦикла;

        КонецЕсли;

    КонецЦикла;

    XLSОбъект.Application.Quit();
    Возврат Таблица;

КонецФункции



// Функция получает список листов Excel
//
// Параметры:
//   пФайл - Имя файла
//   XLSОбъект - COM объект типа "Excel.Application"
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция Excel_ПолучитьСписокЛистов(пФайл, XLSОбъект = Неопределено) Экспорт

    Если XLSОбъект = Неопределено Тогда
        XLSОбъект = Новый COMОбъект("Excel.Application");
        XLSОбъект.Visible       = Ложь;
        XLSОбъект.DisplayAlerts = Ложь;
    КонецЕсли;

    Попытка
        Book = XLSОбъект.Workbooks.Open(пФайл, , Истина);
    Исключение
        Возврат Новый СписокЗначений;
    КонецПопытки;

    СписокЛистов = Новый СписокЗначений;
    Для каждого Лист Из XLSОбъект.Sheets Цикл
        СписокЛистов.Добавить(Лист.Name);
    КонецЦикла;

    XLSОбъект.Application.Quit();
    Возврат СписокЛистов;

КонецФункции   