Процедура ВыполнитьВнешнююОбработку(ВнешняяОбработкаСсылка) Экспорт
	
	ЭтоОбработка = ?(ВнешняяОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка, Истина, Ложь);
	ЭтоОтчет = ?(ВнешняяОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет, Истина, Ложь);
	
	Если НЕ (ЭтоОбработка ИЛИ ЭтоОтчет) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = КаталогВременныхФайлов() + ВнешняяОбработкаСсылка.УникальныйИдентификатор() + ".tmp";
	ДвоичныеДанные = ВнешняяОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	
	Если ЭтоОбработка Тогда
		
		Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
		
	Иначе
		
		Форма = ВнешниеОтчеты.ПолучитьФорму(ИмяФайла);
		
	КонецЕсли;
	
	Если Не Форма = Неопределено Тогда
		
		Форма.Открыть();
		
	Иначе
		
		Если ЭтоОбработка Тогда
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Не ВнешняяОбработкаСсылка.ОтключитьБезопасныйРежим);
		Иначе
			ВнешнийОтчет = ВнешниеОтчеты.Создать(ИмяФайла, Не ВнешняяОбработкаСсылка.ОтключитьБезопасныйРежим);
			Форма = ВнешнийОтчет.ПолучитьФорму();
			Если Форма <> Неопределено Тогда
				Форма.Открыть();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
