Процедура ПечатьПоКнопке (Форма,Кнопка,Параметры = неопределено) Экспорт
	
	ДеревоМакетов 		= Форма.ПечатныеФормы;
	Объект				= Форма.Объект;
	//ТекстКнопки			= Кнопка.Текст;
	ЭлементыФормы		= Форма.Элементы;
	ИмяКнопки			= Кнопка.Имя;
	СохранятьПФВФайл    = ?(ЭлементыФормы.Найти("СохранятьПФВФайл") <> Неопределено, ЭлементыФормы.СохранятьПФВФайл, Ложь);
	Если Не Форма = Неопределено Тогда
		Если Не ПроверитьМодифицированностьВФорме(Объект,Форма) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ИмяФормы = СтрЗаменить(Кнопка.Имя,"ВыполнитьКомандуПечати_","");
	
	СтрокиКнопки = Форма.ПечатныеФормы.НайтиСтроки(Новый Структура("КодПФ",ИмяФормы));
	Если СтрокиКнопки.Количество() = 0 Тогда
		Возврат
	КонецЕсли;	
	СтрокаКнопки  = СтрокиКнопки[0];
	//СтрокаКнопки = ДеревоМакетов.Строки.Найти(ТекстКнопки, "Текст");
	Если СтрокаКнопки = Неопределено Тогда
		Предупреждение("Печать не доступна. Изменился набор реквизитов!");
		//Возврат;		
	КонецЕсли;
	Расшифровка = Неопределено;
	//Попытка
	//	Расшифровка = СтрокаКнопки.Расшифровка
	//Исключение
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПечатьПоДополнительнойКнопке(): Описание ошибки: " + ОписаниеОшибки() + ", ПФ: " + Кнопка.Имя, ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
	//КонецПопытки;
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		НаПринтер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(уб_ВызовСервера.ТекущийПользователь(), "ПечатьДокументовБезПредварительногоПросмотра") = Истина;
		ТабДокумент = уб_ВызовСервера.НапечататьВнешнююФорму(Объект.Ссылка, Расшифровка, Параметры);
		//ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
		//TODO заполнить второй и третий параметры аналогично строке ниже
		//НапечататьДокумент(ТабДокумент, 0, Форма.НаПринтер, ?(ЭтоДокумент, ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект), Строка(Объект)), Объект.Ссылка, Расшифровка);
		//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент,,, ?(ЭтоДокумент, ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект), Строка(Объект)), Объект.Ссылка, Расшифровка);
		Если ТипЗнч(ТабДокумент) = Тип("ТабличныйДокумент") Тогда
			ТабДокумент.Показать(Расшифровка.Наименование)
		КонецЕсли;
	ИначеЕсли Лев(ИмяКнопки, 2) = "ПФ" Или Лев(ИмяКнопки, 2) = "СА" Тогда
		Контекст = уб_ПФ.ИнициализироватьКонтекстПечати();
		//чкн
		Если НЕ Параметры = Неопределено И ТипЗнч(Параметры) = Тип("Массив") Тогда 
			Контекст.МассивОбъектов = Параметры;
		КонецЕсли;
		//чкн
		Контекст.СохранятьПФВФайл   = СохранятьПФВФайл;
		Контекст.ИмяОбъекта 		= Объект.Метаданные().Имя;
		Контекст.ЭтоПФСубагент		= Лев(ИмяКнопки, 2) = "СА";
		Если Контекст.ЭтоПФСубагент Тогда
			Контекст.ПроцентСубагента 	= Объект.ПроцентСубагента;
			Контекст.Субагент			= Объект.Субагент;
		КонецЕсли;
		Если ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Параметры, "ЭтоИсторияОП", Истина) Тогда
			Контекст.ЭтоИсторияОП = Истина;
			Контекст.ОплатыСписок = Параметры.ОплатыСписок;
		Иначе
			Контекст.ЭтоИсторияОП = Ложь
		КонецЕсли;
		Код = Сред(ИмяКнопки, 3);
		СсылкаПФ = уб_ВызовСервера.НайтиПоКоду("Справочники","уб_ПечатныеФормы",Код);
		Если СсылкаПФ <> Неопределено И Не СсылкаПФ.Пустая() Тогда
			Контекст.СсылкаПФ = СсылкаПФ;
			//Контекст.ОбъектПФ = СсылкаПФ.ПолучитьОбъект();
			Контекст.СтруктураОбъектаПФ = уб_ПФ.ПолучитьСтруктуруОбъектаПФИзСсылки(СсылкаПФ);
		КонецЕсли;
		уб_ПФ.Печать(Контекст, Объект, ИмяКнопки)
	Иначе
		//это макеты конфигуратора
		Адрес = уб_ВызовСервера.ПечатьВнутреннихМакетов(Форма.Объект.Ссылка,Кнопка.Имя,Параметры);
		
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(Адрес);
		
		ПоказатьТабличныйДокумент(ТабличныйДокумент); 
		
	КонецЕсли;

Конецпроцедуры	


Функция ПроверитьМодифицированностьВФорме(Объект, Форма) Экспорт

	Результат = Ложь;
	Если Форма.Модифицированность Тогда
		Проведен    = Объект.Проведен;
		СтрПроведен = ?(Проведен, " и провести","");		
		Ответ = Вопрос("Документ изменен. Для печати его необходимо записать "+ СтрПроведен +".
		               |Записать" + СтрПроведен + "?",
		               РежимДиалогаВопрос.ОКОтмена, , 
		               КодВозвратаДиалога.Отмена,
		               "Документ изменен");
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Попытка
				Результат = Форма.ЗаписатьВФорме();
			Исключение
				Предупреждение("Операция не выполнена!");
				Результат = Ложь;
			КонецПопытки;
		Иначе
			Результат = Ложь;
		КонецЕсли;
	Иначе
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
                             
КонецФункции // ПроверитьМодифицированность()




Функция ПоказатьТабличныйДокумент(ТабличныйДокумент,Описание ="") 
	Параметры = Новый Структура("ТабличныйДокумент",ТабличныйДокумент);
	Форма = ПолучитьФорму("Справочник.уб_ПечатныеФормы.Форма.ФормаПечати",Параметры);
	Форма.Заголовок = Описание;
	Форма.Открыть();
	//Фрм = Справочники.уб_ПечатныеФормы.ПолучитьФорму("ФормаРамкаПечати",, КлючУник);
	//Фрм.Заголовок 	= ЗаголовокФормы;
	//Фрм.Контекст	= Контекст;
	//ПТД = Фрм.ЭлементыФормы.ПТД;
	//ПТД.Очистить();
	//ТабДок = Контекст.ТабличныйДокумент;
	//СкопироватьТабличныйДокументВПолеТабличногоДокумента(Контекст.ТабличныйДокумент, ПТД);
	//Фрм.Открыть();	
КонецФункции



Функция _УстановитьЗначение(Объект,ИмяРеквизита,Значение) Экспорт
	Если НЕ Объект[ИмяРеквизита] = Значение Тогда
		Объект[ИмяРеквизита] = Значение;
		Возврат Истина;
	Иначе
		Возврат ЛОЖЬ
	КонецЕсли;	
КонецФункции	


//Процедура УстановитьОтборыСписка(Список,Отборы) Экспорт
//	Для каждого Отбор из Отборы Цикл
//		ОтборВидСравнения = Неопределено;
//		Если НЕ Отбор.Свойство("ВидСравнения",ОтборВидСравнения) Тогда;
//			ОтборВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//		КонецЕсли;	
//		ОбщийМодуль = Вычислить("уб_ФормыВызовСервера");
//		ОбщийМодуль.УстановитьОтборСписка(Список,Отбор.ИмяПоля, Отбор.Значение,ОтборВидСравнения,Отбор.Использование);
//	КонецЦикла;	
//КонецПроцедуры	

Функция ДиалогДобавленияФайла(Документ,УникальныйИдентификаторФормы,Знач СтруктураЗаполнения  = Неопределено)   Экспорт
	Если СтруктураЗаполнения = Неопределено Тогда
		СтруктураЗаполнения = Новый Структура;
		
	КонецЕсли;	
	
	Если СтруктураЗаполнения.Свойство("ВидДокумента") = Ложь Тогда
		СтруктураЗаполнения.Вставить("ВидДокумента",ПредопределенноеЗначение("Справочник.уб_ВидыДокументовКПолисам.ПустаяСсылка"));
	КонецЕсли;	
	
	СтруктураЗаполнения.Вставить("СтраховойПолис",Документ);
	
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Истина;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файлы'; en = 'Select file'");
   	ПараметрыДиалога.Фильтр = уб_temp.ПолучитьФильтрФайлов();
	
    ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеПомещениеФайлаНаСервер", ЭтотОбъект,СтруктураЗаполнения);
	//ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	//ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
    НачатьПомещениеФайловНаСервер(ЗавершениеОбратныйВызов,,,,УникальныйИдентификаторФормы);

КонецФункции


Процедура НачалоВыбораНомераЗаявки(Форма, Элемент, СтандартнаяОбработка,Изменилось = ЛОЖЬ) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		СтароеЗначение = Элемент.Значение;
		Ссылка = Форма.Ссылка;
		УправляемаяФорма = ЛОЖЬ;
	Исключение
		УправляемаяФорма = Истина;
		СтароеЗначение = Форма.Объект.НомерЗаявки;
		Ссылка         = Форма.Объект.Ссылка;
	КонецПопытки;	
	ТипСтЗн = ТипЗнч(СтароеЗначение);
	Если ТипСтЗн = Тип("Число") Тогда
		НомерЗаявки = СтароеЗначение;
	Иначе
		НомерЗаявки = 0;
	КонецЕсли;
	Список = Новый СписокЗначений;
	ЭлНом = Список.Добавить(НомерЗаявки,							"Номер заявки в БАЗЕ");
	ЭлЛич = Список.Добавить(ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Личная"),		"Личная страховка");
	ЭлЛич = Список.Добавить(ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Агентская"),	"Внешний агент");
	//Список.Добавить(Перечисления.уб_ВидыЗаявок.КоробочнаяПродажа,	"Кросс-продажа коробочного продукта");
	ЭлементПоУмолчанию = ?(ТипСтЗн = Тип("ПеречислениеСсылка.уб_ВидыЗаявок"), ЭлЛич, ЭлНом);
	Если УправляемаяФорма = ЛОЖЬ Тогда
		
		ВыбранныйЭлемент = Форма.ВыбратьИзменю(Список,Элемент);
		ВыбранноеЗначение = ?(ВыбранныйЭлемент = Неопределено, СтароеЗначение, ВыбранныйЭлемент.Значение);
		Если УправляемаяФорма = ЛОЖЬ Тогда
			Элемент.Значение = ВыбранноеЗначение;
		Иначе
			Форма.Объект.НомерЗаявки = ВыбранноеЗначение;
		КонецЕсли;	
		Элемент.РедактированиеТекста = ТипЗнч(ВыбранноеЗначение) = Тип("Число");
		Изменилось = НЕ ВыбранноеЗначение = СтароеЗначение;
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда
			Форма.УстСостоянияПолейПриИзменении();
			//ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.") Тогда
			
		КонецЕсли;
	Иначе
		Форма.ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПриВыбореНомераЗаявки",Форма),Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПомещениеФайлаНаСервер(ОписанияПомещенногоФайла, СтруктураЗаполнения) Экспорт
	//Сообщить("Отладка 1");
	Если ОписанияПомещенногоФайла = Неопределено Тогда
		//Сообщить("Отладка 2");
		Возврат
	КонецЕсли;
	ЕстьИзменения = ЛОжь;
	Для каждого ОписаниеПомещенногоФайла из ОписанияПомещенногоФайла Цикл
		Попытка
			ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
			//Сообщить(ИмяФайла);
			//ИмяФайлаПолное = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
			АдресФайла = ОписаниеПомещенногоФайла.Адрес;       
			СтруктураЗаполнения.Вставить("ФайлРасширение",ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
			СтруктураЗаполнения.Вставить("ФайлИмя",ИмяФайла);
			//СтруктураЗаполнения.Вставить("ПолноеИмяФайла",ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.Имя);
			
		Исключение
			//Сообщить(ОписаниеОшибки());
			//Сообщить(ТипЗнч(ОписаниеПомещенногоФайла.СсылкаНаФайл));
		КонецПопытки;	
		Если уб_ВызовСервера.ДобавитьФайлИзВременногоХранилища(АдресФайла,СтруктураЗаполнения) = Истина Тогда
			ЕстьИзменения = Истина;
			
		КонецЕсли;	

	КонецЦикла;
	Если ЕстьИзменения = Истина Тогда
		Оповестить("ОбновитьСписокФайлов",СтруктураЗаполнения.СтраховойПолис,"ЗавершениеПомещениеФайлаНаСервер");
	КонецЕсли;	
		
	//Попытка                                                         
	//	Листы = ИмяЛиста;
	//	Таблица = ПрочитатьФайлИзХранилища(АдресФайла,ИмяФайла,Листы);
	//	Элементы.ИмяЛиста.СписокВыбора.ЗагрузитьЗначения(Листы);           
	//	//АвтоопределениеНастроек();
	//Исключение   
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки;
КонецПроцедуры	  


//Процедура ПриНажатииФлажкаРазмещения(Элемент, ИмяКолонки, Документ, СтруктураЗаполнения = Неопределено) Экспорт
//		
//	ТекущиеДанные = Элемент.ТекущиеДанные;
//	Если ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;	
//		
//	Если ТекущиеДанные.СсылкаСправочника = Неопределено Тогда
//		ТекущиеДанные[Колонка.Имя] = Ложь;
//		Возврат;	
//	КонецЕсли;	
//	
//КонецПроцедуры



Процедура АвтоПодборТекстаСТранслитом(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ИмяСправочника, Владелец = Неопределено) Экспорт
	
	ТекстДляПоиска = СокрЛП(Текст);
	ДлинаТекста = СтрДлина(ТекстДляПоиска);
	Если ДлинаТекста < 3 Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ТекстВДругойРаскладке = уб_Фильтры.ПеревестиСтроку(ТекстДляПоиска);
	ТранслитТекстДляПоиска = ОбщегоНазначения.ПолучитьТранслит(ТекстДляПоиска);
	ТранслитТекстВДругойРаскладке = ОбщегоНазначения.ПолучитьТранслит(ТекстВДругойРаскладке);
	Массив = уб_ВызовСервера.ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец);
	Если Массив.Количество()>0 Тогда
		Для каждого Выборка из Массив Цикл
		//Если Выборка.Количество() = 1 Тогда
		//	Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
		//	Форма.ОповеститьОВыборе(Выборка.Ссылка);
		//	ТекстАвтоПодбора = Выборка.Наименование;
		//Иначе
			ТекстАвтоПодбора = Выборка.Наименование;
		//КонецЕсли;
	//ИначеЕсли ПроверитьВозможностьИспользованияПолнотекствогоПоиска() Тогда
	//	
	//	Если ДлинаТекста < 4 Тогда
	//		КоличествоОтличий = "#1";
	//	Иначе
	//		КоличествоОтличий = "#2";
	//	КонецЕсли;
	//			
	//	ПоискПолнотекстовый = ТекстДляПоиска + "* OR " + ТекстВДругойРаскладке + "* OR " + ТекстДляПоиска + КоличествоОтличий + " OR " + ТекстВДругойРаскладке + КоличествоОтличий;
	//	Список = ВыполнитьПолнотекстовыйПоискВСправочнике(ПоискПолнотекстовый, ИмяСправочника, 30, Владелец);
	//	//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	//	//ТекстСРезультатомПоиска = ТекстДляПоиска;
	//	//ТранслитТекстаСРезультатомПоиска = ТранслитТекстДляПоиска;
	//	//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	//	Если Список <> Неопределено Тогда
	//		Количество = Список.Количество();
	//		
	//		ЭлементСписка = Список.Получить(0);
	//		Если Количество = 1 Тогда
	//			Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
	//			Форма.ОповеститьОВыборе(ЭлементСписка.Значение);
	//		Иначе
	//			ЭлементСпискаПодходящийПредставление = ЭлементСписка.Представление;
	//			//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	//			//ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
	//			//СчетчикПодходящихЭлементов = 0;
	//			//Для Каждого ЭлементСписка Из Список Цикл
	//			//	ЭлементСпискаПредставление = ЭлементСписка.Представление;
	//			//	Если Нрег(ТекстСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Или Нрег(ТранслитТекстаСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Тогда
	//			//		СчетчикПодходящихЭлементов = СчетчикПодходящихЭлементов + 1;
	//			//		Если СчетчикПодходящихЭлементов = 1 Или СтрДлина(ЭлементСпискаПредставление) < СтрДлина(ЭлементСпискаПодходящийПредставление) Тогда
	//			//			ЭлементСпискаПодходящийПредставление = ЭлементСпискаПредставление;
	//			//			ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
	//			//		КонецЕсли;
	//			//	КонецЕсли;
	//			//КонецЦикла;
	//			//Если СчетчикПодходящихЭлементов = 1 Тогда
	//			//	Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
	//			//	Форма.ОповеститьОВыборе(ЭлементСпискаПодходящийЗначение);
	//			//Иначе
	//			//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	//				Если СтрДлина(ЭлементСпискаПодходящийПредставление) > ДлинаТекста Тогда
	//					ТекстАвтоПодбора = ЭлементСпискаПодходящийПредставление;
	//				КонецЕсли;
	//			//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос	
	//			//КонецЕсли;
	//			//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	//		КонецЕсли;
	//	КонецЕсли;
	КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает пустую ТаблицуЗначений для описания ошибок
//
// Возвращаемое значение:
//   ТаблицаЗначений   – пустая таблица состоящая из 4 колонок:
//                       Ошибка, Элемент, Строка, ИмяОбработки
//
//Функция СоздатьТаблицуОшибок() Экспорт
//	ТзОшибки = Новый Массив;
//	//ТзОшибки.Колонки.Добавить("Ошибка");
//	//ТзОшибки.Колонки.Добавить("Элемент");
//	//ТзОшибки.Колонки.Добавить("Строка");
//	//ТзОшибки.Колонки.Добавить("ИмяОбработки");
//	//ТзОшибки.Колонки.Добавить("Панель");
//	//ТзОшибки.Колонки.Добавить("Страница");
//	//ТзОшибки.Колонки.Добавить("Статус");
//	Возврат ТзОшибки;
//КонецФункции // СоздатьТаблицуОшибок

Функция СтруктураОшибки() Экспорт
	Возврат Новый Структура("Ошибка,Элемент,Строка,ИмяОбработки,Панель,Страница,Статус");
КонецФункции	


Процедура ОбновитьВидыОплаты(Элемент,СуммаВзноса,ПодразделениеМенеджера,ДокументМенеджер) Экспорт
	//уб_temp.ЗаполнитьФормыОплаты(Элементы.ВидОплаты.СписокВыбора); требует проверки
	ЭлВидОплаты = Элемент.СписокВыбора;
	ЭлВидОплаты.Очистить();
	ДобавитьВидОплаты("Наличными (0%)",ЭлВидОплаты,СуммаВзноса);
	ДобавитьВидОплаты("На р\с в КПП (0%)",ЭлВидОплаты,СуммаВзноса);
	ДобавитьВидОплаты("В страховую -3%(потерянная сумма)",ЭлВидОплаты,СуммаВзноса);// (0 руб.) - было Безналично Поставщику
	//ДобавитьВидОплаты("СБП  (2.4%)",ЭлВидОплаты);// (*** руб.) - Новое
	//ДобавитьВидОплаты("Терминал (3%)",ЭлВидОплаты,СуммаВзноса);// (*** руб.)
	ДобавитьВидОплаты("По QR коду (0%)",ЭлВидОплаты,СуммаВзноса);// (*** руб.)

	//ДобавитьВидОплаты("В кредит (0%)",ЭлВидОплаты);// (0 руб.)
	//ДобавитьВидОплаты("На карту (0%)",ЭлВидОплаты);// (*** руб.) - было На карту сотрудника
	Для каждого СтрокаКарты из уб_ВызовСервера.ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,ДокументМенеджер) Цикл
		
		ДобавитьВидОплаты("На карту "+СокрЛП(СтрокаКарты.Представление)+"(0%)",ЭлВидОплаты,СуммаВзноса);
	КонецЦикла;	
	//ДобавитьВидОплаты("По ссылке в КПП (3%)",ЭлВидОплаты);// (*** руб.) - было По ссылке в Kupipolis
	
КонецПроцедуры	



Процедура ДобавитьВидОплаты(СтрокаВидОплаты,ЭлВидОплаты,СуммаВзноса)
	ЭлВидОплаты.Добавить(СтрокаВидОплаты,ПосчитатьПроцент(СуммаВзноса,СтрокаВидОплаты));
КонецПроцедуры	


Функция ПосчитатьПроцент(СуммаВзноса,Представление, КакЧисло = Ложь)
	Процент = 0;
	
	Если Представление = "СБП  (2.4%)" Тогда
		Процент = 2.4;
	ИначеЕсли Представление = "Терминал (3%)" Тогда
		Процент = 3.0;
	ИначеЕсли Представление = "На карту (0%)" Тогда
		Процент = 0.0;	
	ИначеЕсли Представление = "По ссылке в КПП (3%)" Тогда
		Процент = 3.0;	
	ИначеЕсли Представление = "В страховую -3%(потерянная сумма)" Тогда
		Процент = 3.0;		
		
	КонецЕсли;	
	
	ВремПремия = Окр(СуммаВзноса* Процент/100,2);
	Если КакЧисло Тогда
		Возврат ВремПремия
	Иначе
		Возврат ""+Представление+"     ("+Формат(ВремПремия,"ЧН=")+" руб.)";  
	КонецЕсли;	
КонецФункции	

Процедура ЗаполнитьФормуОплатыИКошелек(ВидОплаты,_ЭтотОбъект,ПодразделениеМенеджера,ДокументМенеджер) Экспорт
	
	Если ВидОплаты = "На р\с в КПП (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Безнал");
	ИначеЕсли ВидОплаты = "Наличными (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Касса");
	ИначеЕсли ВидОплаты = "В кредит (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ВКредит");	
	ИначеЕсли ВидОплаты = "На карту (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");		
	ИначеЕсли ВидОплаты = "СБП  (2.4%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");			
	ИначеЕсли ВидОплаты = "По ссылке в КПП (3%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПоСсылкеБрокеру");			
	ИначеЕсли ВидОплаты = "В страховую -3%(потерянная сумма)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Поставщику");				
	ИначеЕсли ВидОплаты = "Терминал (3%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Терминал");
	ИначеЕсли ВидОплаты = "По QR коду (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПоQR");
	
	ИначеЕсли Найти(ВидОплаты,"На карту")=1	Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");		
		Для каждого СтрокаКарты из уб_ВызовСервера.ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,ДокументМенеджер) Цикл
			Если Найти(ВидОплаты,""+СтрокаКарты.Карта)>0 Тогда
				_ЭтотОбъект.Кошелек = СтрокаКарты.Карта;
				прервать;
			КонецЕсли;		
		КонецЦикла;
	ИначеЕсли ПустаяСтрока(ВидОплаты) Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьПолПоФамилии(Фамилия) Экспорт
	
	Возврат ФункцииРасширения.ОпределитьПолПоФамилии(Фамилия);
КонецФункции

Функция Должность_Склонение(Должность = "", Падеж = 1) Экспорт
	Возврат ФункцииРасширения.Должность_Склонение(Должность = "", Падеж = 1);
КонецФункции	

Функция ПадежП(Знач z1,Знач z2,z3=0) Экспорт
	Возврат ФункцииРасширения.ПадежП(z1,z2,z3=0);
КонецФункции	




#Область РасчетОСАГО
Процедура ОбработатьОшибкиРасчетаПродления(Данные) Экспорт
	Если Данные.Свойство("ОшибкаВПаспорте") Тогда
		Сообщить("Ошибка в паспорте");
	КонецЕсли;
	
	Если Данные.Свойство("ОшибкаVIN") Тогда
		Сообщить("Ошибка vin");
		ПоказатьЗначение(,Данные.ОбъектСтрахования);
	КонецЕсли;
	
	Если Данные.Свойство("ОшибкаВДР") Тогда
		Сообщить("Ошибка в дате рождения");
		ПоказатьЗначение(,Данные.СтраховательСсылка);
	Иначе	
		Если Данные.Свойство("ОшибкаВПаспорте") Тогда
			ПоказатьЗначение(,Данные.СтраховательСсылка);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


Процедура ДобавитьОтбор(Настройки,ПараметрыОтбора) Экспорт
	ОтборНайден = Ложь;
	Для каждого ТекОтбор из Настройки.Отбор.Элементы Цикл
		Если ПараметрыОтбора.ЛевоеЗначение = ТекОтбор.ЛевоеЗначение Тогда
			ОтборНайден = Истина;
			ЭлементОтбора = ТекОтбор;
		КонецЕсли;	
	КонецЦикла;	
	Если ОтборНайден = ЛОЖЬ Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	ЭлементОтбора.ЛевоеЗначение		= ПараметрыОтбора.ЛевоеЗначение;
	ЭлементОтбора.ВидСравнения 		= ПараметрыОтбора.ВидСравнения;
	ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
	ЭлементОтбора.Представление		= ПараметрыОтбора.ПравоеЗначение;
	ЭлементОтбора.ПравоеЗначение	= ПараметрыОтбора.ПравоеЗначение;

КонецПроцедуры	
