#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументСсылка",ДокументСсылка) Тогда
		ВывестиДеревоДокументов();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда;
		Если ДоступенПросмотрДокумента(ТекущиеДанные.Ссылка) и НЕ ЭтаФорма.ДокументСсылка = ТекущиеДанные.Ссылка  Тогда
			ОткрытьЗначение(ТекущиеДанные.Ссылка);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область Основныефункции
&НаСервере
Процедура ВывестиДеревоДокументов()
	
	мКэшРеквизитовДокумента = Новый Соответствие;
	//Попытка
		ДеревоДокументов.ПолучитьЭлементы().Очистить();
		//мДерево = ДеревоДокументов;	
		мУжеВСписке.Очистить();
		
		ВывестиРодительскиеДокументы(уб_УСЗ.ПолучитьИзначальныйДокумент(ДокументСсылка),,мКэшРеквизитовДокумента);	
		//Элементы.ДеревоДокументов.ТекущаяСтрока = мДерево;
		Для каждого СтрокаДерева из ДеревоДокументов.ПолучитьЭлементы() Цикл 
			ВывестиПодчиненныеДокументы(СтрокаДерева,,мКэшРеквизитовДокумента);
		КонецЦикла;
	//Исключение
	//КонецПопытки;
	
КонецПроцедуры

// Процедура выполняет вывод родительских документов
&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка, СразуВПодчиненные = Ложь,мКэшРеквизитовДокумента)
	
	МассивИменИсключаемыхРеквизитов = КритерииОтбора.СтруктураПодчиненности.МассивИменИсключаемыхРеквизитовПоТипуДокумента(ТипЗнч(ДокументСсылка));
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		Если МассивИменИсключаемыхРеквизитов.Найти(Реквизит.Имя) = Неопределено Тогда
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			    Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита)
					И ПравоДоступа("Чтение", МетаданныеРеквизита) 
					Тогда
					Попытка
						ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
					Исключение
						Прервать;
					КонецПопытки;
					Если ЗначениеРеквизита <> Неопределено 
						И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
						И Не ЗначениеРеквизита.Пустая()
						И мУжеВСписке.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено 
						И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено 
						Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		СтрРеквизитов = "";		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И Метаданные.Документы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;	
	//Частный случай аннулированного полиса
	//
	ЕслиЭтоПолисДополнитьАннулированным(ДокументСсылка,СписокРеквизитов);
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Добавить(ДокументСсылка);
	//
	ВсегоРеквизитов = СписокРеквизитов.Количество();
	ПоТаблице = Новый ТаблицаЗначений;
	ПоТаблице.Колонки.Добавить("Ссылка");
	ТипОсновного = ТипЗНЧ(ДокументСсылка);
	Для СчетчикРеквизитов = 1 по  ВсегоРеквизитов  Цикл
		ЗначениеРеквизита = СписокРеквизитов.Получить(ВсегоРеквизитов-СчетчикРеквизитов).Значение;
		ТипРеквизита = ТипЗнч(ЗначениеРеквизита);
		
		Если СразуВПодчиненные 
			ИЛИ (ТипРеквизита = Тип("ДокументСсылка.уб_ОтчетКассира") 
			ИЛИ ТипРеквизита = Тип("ДокументСсылка.уб_СтраховойПолис")) 
			ИЛИ (ТипРеквизита = Тип("ДокументСсылка.уб_ОплатаПолисов") И ТипОсновного=Тип("ДокументСсылка.уб_ПриемкаОплат"))
			ИЛИ (ТипРеквизита = Тип("ДокументСсылка.уб_ОтчетПоставщику") И ТипОсновного=Тип("ДокументСсылка.уб_ОплатаПолисов"))
			Тогда
			СтрокаИсключенных = ПоТаблице.Добавить();
			СтрокаИсключенных.Ссылка = ЗначениеРеквизита;
			СписокРеквизитов.Удалить(ВсегоРеквизитов-СчетчикРеквизитов);
		КОнецесли;	
		
	КонецЦикла;	
		
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение,,мКэшРеквизитовДокумента);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов,мКэшРеквизитовДокумента);		
	КонецЕсли;

	//Если мУжеВСписке[ДокументСсылка] = Неопределено Тогда
	СтрокаДерева = ДеревоДокументов.ПолучитьЭлементы().Добавить();
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
						   | ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
						   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		СтрокаДерева.Ссылка= Выборка.Ссылка;
		СтрокаДерева.Проведен = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
		СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		СтрокаДерева.ВидДокумента = Выборка.Метаданные;				
		СтрокаДерева.Описание = ПолучитьОписаниеДокумента(СтрокаДерева.Ссылка);
		Если Выборка.ПометкаУдаления Тогда
			СтрокаДерева.Картинка = 1
		ИначеЕсли Выборка.Проведен Тогда
			СтрокаДерева.Картинка = 0
		Иначе
			СтрокаДерева.Картинка = 3;
		КонецЕсли;
	Иначе
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента = ДокументСсылка.СуммаДокумента;
		СтрокаДерева.Описание = ПолучитьОписаниеДокумента(СтрокаДерева.Ссылка);
		СтрокаДерева.Картинка = 3;
	КонецЕсли;
	
	
	//КонецЕсли;
	Если ПоТаблице.Количество() > 0 И НЕ ТипОсновного = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда 
		ВывестиПодчиненныеДокументы(СтрокаДерева,ПоТаблице,мКэшРеквизитовДокумента);	
		
	КонецЕсли;	
	мДерево = СтрокаДерева;
КонецПроцедуры

// Процедура осуществляет вывод родительских документов с ограничением по уровню в дереве
&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов,мКэшРеквизитовДокумента)
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			Если мУжеВСписке.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
	            СтрокаДерева = ДеревоДокументов.ПолучитьЭлементы().Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				СтрокаДерева.ВидДокумента = Выборка.Метаданные;			
				СтрокаДерева.СуммаДокумента = Выборка.СуммаДокумента;
				СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
				СтрокаДерева.ОграничениеПоРодителям = Истина;
				СтрокаДерева.Описание = ПолучитьОписаниеДокумента(СтрокаДерева.Ссылка);
				Если Выборка.ПометкаУдаления Тогда
					СтрокаДерева.Картинка = 1
				ИначеЕсли Выборка.Проведен Тогда
					СтрокаДерева.Картинка = 0
				Иначе
					СтрокаДерева.Картинка = 3;
				КонецЕсли;

				мУжеВСписке.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры

// Процедура осуществляет вывод подчиненных документов
&НаСервере
Процедура ВывестиПодчиненныеДокументы(Знач СтрокаДерева,ПоТаблице=Неопределено,мКэшРеквизитовДокумента)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	Если ПоТаблице = Неопределено Тогда
		Таблица = ПолныеПрава.ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент);	
	Иначе
		Таблица = ПоТаблице;
	КонецЕсли;	
	
	//ЕслиЭтоПолисДополнитьАннулированным(ТекущийДокумент,Таблица,"Таблица");
	
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента,мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	ЕСли КэшПоТипамДокументов.Количество() = 0 ТОгда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
					|ВЫБРАТЬ ", "
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + "
					|Дата, Ссылка, Представление, Проведен, ПометкаУдаления,
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"], "СуммаДокумента", "NULL") + " КАК СуммаДокумента,
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"], "ВалютаДокумента", "NULL") + " КАК ВалютаДокумента
					|ИЗ Документ." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ОбработкаПрерыванияПользователя();
		Если мУжеВСписке.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			
			Если  ТипЗНЧ(Выборка.Ссылка)= Тип("ДокументСсылка.уб_ПередачаБСОПоставщику")//ему подчиененных быть не может, сразу выходим.
								
				//В полной структуре они последние и дальше не крутим, когда они являются основным документом, крутим только ближайшие.
				ИЛИ ТипЗНЧ(ДокументСсылка)= Тип("ДокументСсылка.уб_ОтчетПоставщику")
				ИЛИ ТипЗНЧ(ДокументСсылка)= Тип("ДокументСсылка.уб_ОтчетКассира")
				
				//ИЛИ ТипЗНЧ(Выборка.Ссылка)= Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста")
				Тогда
				
				НоваяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
				НоваяСтрока.Ссылка = Выборка.Ссылка;
				НоваяСтрока.ДокументПредставление = Выборка.Представление;
				НоваяСтрока.СуммаДокумента = Выборка.СуммаДокумента;
				НоваяСтрока.ВалютаДокумента = Выборка.ВалютаДокумента;
				НоваяСтрока.Проведен = Выборка.Проведен;
				НоваяСтрока.ПометкаУдаления = Выборка.ПометкаУдаления;
				НоваяСтрока.Описание = ПолучитьОписаниеДокумента(НоваяСтрока.Ссылка);
				Если Выборка.ПометкаУдаления Тогда
					СтрокаДерева.Картинка = 1;
				ИначеЕсли Выборка.Проведен Тогда
					СтрокаДерева.Картинка = 0;
				Иначе
					СтрокаДерева.Картинка = 3;
				КонецЕсли;

				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
				мДерево = СтрокаДерева;
				Продолжить;
			КонецЕсли;
			//НоваяСтрока=СтрокаДерева;
			мДерево = СтрокаДерева;
	
			Если ( ТипЗНЧ(ТекущийДокумент)= Тип("ДокументСсылка.уб_ОтчетПоставщику")
				И ТипЗНЧ(Выборка.Ссылка)= Тип("ДокументСсылка.уб_ОплатаПолисов"))
				Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗНЧ(ТекущийДокумент)= Тип("ДокументСсылка.уб_ОтчетКассира") Тогда
				 Продолжить;
			КонецЕсли;
				ВывестиРодительскиеДокументы(Выборка.Ссылка,Истина,мКэшРеквизитовДокумента);//Родителей выведем в подчиненные
			//Если НЕ ( ТипЗНЧ(ТекущийДокумент)= Тип("ДокументСсылка.уб_ОтчетПоставщику")
			//	И ТипЗНЧ(Выборка.Ссылка)= Тип("ДокументСсылка.уб_ОплатаПолисов"))
			//	//И НЕ ТипЗНЧ(ТекущийДокумент)= Тип("ДокументСсылка.уб_ОтчетКассира")
			//	Тогда
			
				ВывестиПодчиненныеДокументы(мДерево,,мКэшРеквизитовДокумента);
			//КонецЕсли;
			//Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура  ЕслиЭтоПолисДополнитьАннулированным(ДокументСсылка,СписокРеквизитов,Режим="")
	
	Если ТипЗНЧ(ДокументСсылка)  = Тип ("ДокументСсылка.уб_СтраховойПолис") Тогда
	Иначе
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос ("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА уб_ЗаменаПолисов.АннулированныйПолис = &ПроверяемыйДокумент
	|			ТОГДА уб_ЗаменаПолисов.НовыйПолис
	|		ИНАЧЕ уб_ЗаменаПолисов.АннулированныйПолис
	|	КОНЕЦ КАК Полис
	|ИЗ
	|	РегистрСведений.уб_ЗаменаПолисов КАК уб_ЗаменаПолисов
	|ГДЕ
	|	(уб_ЗаменаПолисов.АннулированныйПолис = &ПроверяемыйДокумент
	|			ИЛИ уб_ЗаменаПолисов.НовыйПолис = &ПроверяемыйДокумент)");
	Запрос.УстановитьПараметр("ПроверяемыйДокумент",ДокументСсылка);						   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначениеРеквизита = Выборка.Полис;
		Если Режим ="" Тогда
			ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() 
				И мУжеВСписке.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено И СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
				Попытка
					СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
				Исключение
					ОтладкаТекстОшибки = ОписаниеОшибки();
				КонецПопытки;	
			КонецЕсли;
		Иначе
			Если СписокРеквизитов.Найти(ЗначениеРеквизита,"Ссылка") = Неопределено Тогда
				СтрокаТаблицы = СписокРеквизитов.Добавить();
				СтрокаТаблицы.Ссылка  = ЗначениеРеквизита;
			Конецесли;	
		Конецесли;
	КонецЦикла;
	

КонецПроцедуры	

#КонецОбласти

#Область Вспомогательные

&НаСервере
Функция ПолучитьОписаниеДокумента(СсылкаДок) 
	
	Тип = ТипЗнч(СсылкаДок);
	
	Описание="";
	Попытка
		Если Тип = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			Описание="Заявка "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Менеджер,,Ложь,2,Ложь))+
			?(СсылкаДок.Самовыезд," (Самовыезд)"," для курьера: "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Курьер,,Ложь,2,Ложь)));
			//ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Курьер,,Ложь,2));
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
			Описание="Перемещение БСО "+
			?(ТипЗнч(СсылкаДок.Агент)=Тип("СправочникСсылка.ФизическиеЛица"),"от "+уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Агент,,Ложь,2,Ложь),"из "+СсылкаДок.Агент)
			+ ?(ТипЗнч(СсылкаДок.АгентКуда)=Тип("СправочникСсылка.ФизическиеЛица")," к "+уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.АгентКуда,,Ложь,3,Ложь)," в " +СсылкаДок.АгентКуда);
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
			Описание="Передача от "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Агент,,Ложь,2,Ложь))+" для "+ СсылкаДок.Поставщик+ ?(ЗначениеЗаполнено(СсылкаДок.Курьер)," через "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Курьер,,Ложь,2,Ложь)), "");
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда	
			Описание= "Оплата от "+
			?(ТипЗнч(СсылкаДок.СтраховойПолис.Страхователь)=Тип("СправочникСсылка.ФизическиеЛица"),уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.СтраховойПолис.Страхователь,,Ложь,2,Ложь),СсылкаДок.СтраховойПолис.Страхователь)+ " через "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Курьер,,Ложь,4,Ложь))+"/"+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Агент,,Ложь,4,Ложь));
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда	
			Описание= "Полис для "+?(ТипЗнч(СсылкаДок.Страхователь)=Тип("СправочникСсылка.ФизическиеЛица"),уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Страхователь,,Ложь,2,Ложь),СсылкаДок.Страхователь)+ " менеджером: "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Агент,,Ложь,5,Ложь))+" через "+СсылкаДок.СК;	
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ЗаявлениеОбУтрате") Тогда	
			Описание= "Заявление об утрате от "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Агент,,Ложь,2,Ложь));
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_УведомлениеПоставщикаОбУтратеБСО") Тогда	
			Описание= "Уведомление об утрате для "+ СсылкаДок.Поставщик;
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда	
			СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
			Если СистемаТЧПлатежи Тогда
				Описание = "Приемка денег от "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.ПринятоОТ,,Ложь,2,Ложь));
			Иначе
				Описание = "Приемка денег от "+ ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.ПринятоОТ,,Ложь,2,Ложь))+" ("+СсылкаДок.ФормаОплаты+")";
			КонецЕсли;
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда	
			Описание= "Отчет кассира "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Ответственный,,Ложь,2,Ложь))+". Проверено: "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.ОтветственныйФинансы,,Ложь,5,Ложь));
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда		
			Описание= "Отчет поставщику "+СсылкаДок.Поставщик+" создан: "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.ОтветственныйБСО,,Ложь,5,Ложь))+". Проверено: "+ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.ОтветственныйФинансы,,Ложь,5,Ложь));	
		//ППС 24-07-2014	
		ИначеЕсли Тип = Тип("ДокументСсылка.уб_ЗаявкаНаПечать") Тогда	
		    ФЛ = ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Менеджер,,Ложь,2,Ложь));
			Если Не ПустаяСтрока(ФЛ) Тогда
				Описание= "Заявка на печать " + ФИО(уб_КЭШируемые.ФИОФизлицаСтрокой(СсылкаДок.Менеджер,,Ложь,2,Ложь));
			Конецесли;
		Конецесли;
		//ППС 24-07-2014
	Исключение
	КонецПопытки;
	Возврат Описание;
КонецФункции	

Функция ФИО(ФИО)
	ФИО = СокрЛП(ФИО);
	ЧислоПробелов = СтрЧислоВхождений(ФИО," ");
	Если ЧислоПробелов=2 Тогда
		ВремСтрока=ФИО; 
		ФИО="" ;
		Пока Найти(ВремСтрока," ")>0 Цикл
			ФИО = ФИО+Лев(ВремСтрока,Найти(ВремСтрока," "));
			ВремСтрока = Сред(ВремСтрока,Найти(ВремСтрока," ")+1);
		КонецЦикла;	
		ФИО  =СокрЛП(ФИО);
	Иначе
		ЧислоТочек = СтрЧислоВхождений(ФИО,".");
		Если ЧислоТочек=2 Тогда
			ФИО = Лев(ФИО,СтрДлина(ФИО)-2);
		КонецЕсли;	
			
	КонецЕсли;
	Возврат ФИО;
КонецФункции	

&НаСервереБезКонтекста
Функция ДоступенПросмотрДокумента(Док,СоответствиеДоступаКВидуДок = Неопределено)
	Если СоответствиеДоступаКВидуДок = Неопределено Тогда
		СоответствиеДоступаКВидуДок = Новый Соответствие;
	КонецЕсли;	
	Тип = ТипЗнч(Док);
	Можно = СоответствиеДоступаКВидуДок.Получить(Тип);
	Если Можно = Неопределено Тогда
		Можно = ПравоДоступа("Просмотр",Док.Метаданные());
		СоответствиеДоступаКВидуДок.Вставить(Тип,Можно);
	КонецЕсли;	
	Если Можно Тогда
		//
		Можно = ПроверитьПравоДоступаКСодержимому(Док);
	КонецЕсли;	
	Возврат Можно;
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПравоДоступаКСодержимому(Док)
	
	Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
		МассивИменПолей = уб_temp.МассивИменПроверяемыхПолей(ТипЗнч(Док));
		Если МассивИменПолей.Количество() = 0 Тогда
			Результат = Истина
		Иначе
			Результат = уб_temp.ДоступКДанным(Док, МассивИменПолей);
		КонецЕсли;
	Иначе
		Результат = Истина
	КонецЕсли;
	Возврат Результат;
	//Если ЭтоПолныеПрава Тогда
	//	Возврат Истина;
	//ИначеЕсли ЭтоАгент ИЛИ ЭтоРуководительОП Тогда	
	//	Если СписокСотрудников = Неопределено Тогда
	//		СписокСотрудников = уб_Temp.ПолучитьСписокПодчиненныхРуководителя(ПараметрыСеанса.уб_ТекущееФизЛицо,,Истина,Истина);
	//	Конецесли;	
	//	ТипЗнч = ТипЗнч(Док);
	//	Если ТипЗнч = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
	//		Возврат НЕ СписокСотрудников.Найти(Док.Агент)= Неопределено;
	//	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
	//		Возврат НЕ СписокСотрудников.Найти(Док.Агент)= Неопределено ИЛИ НЕ СписокСотрудников.Найти(Док.АгентКуда)= Неопределено;
	//	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
	//		Возврат НЕ СписокСотрудников.Найти(Док.Агент)= Неопределено;
	//	ИначеЕсли ТипЗнч = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
	//		Возврат НЕ СписокСотрудников.Найти(Док.Менеджер)= Неопределено ИЛИ НЕ СписокСотрудников.Найти(Док.Курьер)= Неопределено;	
	//		
	//		
	//	Иначе			Возврат Истина;
	//	КонецЕсли;	
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;	
	
КонецФункции	

Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента,мКэшРеквизитовДокумента)
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	Если РеквизитыДокумента = Неопределено Тогда
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента", МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
	КонецЕсли;
	
КонецПроцедуры

Функция ОсновнойДокументЕщеДоступен()
	
	ИмяТекущегоДокумента = ДокументСсылка.Метаданные().Имя;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Представление ИЗ Документ." + ИмяТекущегоДокумента + " ГДЕ Ссылка = &ТекущийДокумент";
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти