// Процедура-обработчик ПередЗаписью набора записей
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		//При удалении может быть пустой набор
		Возврат;
	Иначе	
		
		МЗ = ЭтотОбъект[0];
		Если МЗ.ДатаСоздания=Дата(1,1,1) Тогда
			МЗ.ДатаСоздания = МЗ.ДатаИзменения;
		ИначеЕсли НЕ МЗ.Период = МЗ.ДатаСоздания Тогда
			МЗ.Период = МЗ.ДатаСоздания;
		КонецЕсли;	
		ДатаЗаписи =  МЗ.ДатаШтрафа;	
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Новый") Тогда
			МЗ0 = Мз;
			СообщитьОШтрафе(МЗ0.Физлицо,"Назначен"+?(МЗ0.СуммаШтрафа>=0," штраф","а  премия"),МЗ0.Штраф,?(МЗ0.СуммаШтрафа>=0,МЗ0.СуммаШтрафа,-МЗ0.СуммаШтрафа),МЗ0.Комментарий,ДатаЗаписи,МЗ0.ОтветственныйЗаНачисление,Истина);
		Иначе
			СообщитьОШтрафе(МЗ0.Физлицо,"Изменен"+?(МЗ0.СуммаШтрафа>=0," штраф","а премия"),МЗ0.Штраф,?(МЗ0.СуммаШтрафа>=0,МЗ0.СуммаШтрафа,-МЗ0.СуммаШтрафа),МЗ0.Комментарий,ДатаЗаписи,МЗ0.ОтветственныйЗаНачисление,Истина);
			
		КонецЕсли;	
		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаЗаписи) Тогда
		Сообщить("Не задана дата штрафа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	ДатаНеактуальности = НачалоМесяца(ДатаЗаписи);
	//ТЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(,Новый Структура("РасчетныйПериод",ДатаНеактуальности));
	//Если ТЗ.Количество() = 0 Тогда
	//Иначе
	//	Если Не ТЗ[0].Актуален Тогда
	//		Возврат;
	//	КонецЕсли
	//КонецЕсли;
	
	Если НЕ уб_РасчетыСМенеджерами.ЗарплатныйПериодАктуален(ДатаНеактуальности,Новый Структура("Актуален,Объект",Ложь,"РС.Штрафы")) Тогда
		Возврат
	КонецЕсли;	
	//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
	//МЗ.Актуален 		= Ложь;
	//МЗ.РасчетныйПериод 	= ДатаНеактуальности;
	//МЗ.Период 			= ТекущаяДата();
	//МЗ.Объект 			= "РС.Штрафы";
	//Попытка
	//	МЗ.Записать();
	//Исключение
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка регистрации неактуальности периода расчета ЗП: " + ОписаниеОшибки());
	//КонецПопытки;	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	ПериодЗаписи = Отбор.Период.Значение;
	ФизЛицоЗаписи = Отбор.ФизЛицо.Значение;
	МЗ0 = РегистрыСведений.уб_Штрафы.СоздатьМенеджерЗаписи();
	МЗ0.Физлицо = ФизЛицоЗаписи;
	МЗ0.Период = ПериодЗаписи;
	МЗ0.Прочитать();
		
	Если ЭтотОбъект.Количество() = 0 Тогда
		//При удалении может быть пустой набор, но запись еще в базе.
		//ПериодЗаписи = ЭтотОбъект.Отбор.Период.Значение;
		//ФизЛицоЗаписи = ЭтотОбъект.Отбор.ФизЛицо.Значение;
		Если МЗ0.Выбран() Тогда
			ДатаЗаписи =  МЗ0.ДатаШтрафа;
			СообщитьОШтрафе(МЗ0.Физлицо,"Отмена "+?(МЗ0.СуммаШтрафа>=0," штрафа","премии"),МЗ0.Штраф,?(МЗ0.СуммаШтрафа>=0,МЗ0.СуммаШтрафа,-МЗ0.СуммаШтрафа),МЗ0.Комментарий,ДатаЗаписи,МЗ0.ОтветственныйЗаНачисление,Истина);
			Возврат;
		КонецЕсли;			
		ДатаНеактуальности = НачалоМесяца(ДатаЗаписи);
		
		
		Если НЕ уб_РасчетыСМенеджерами.ЗарплатныйПериодАктуален(ДатаНеактуальности,Новый Структура("Актуален,Объект",Ложь,"РС.Штрафы")) Тогда
			Возврат
		КонецЕсли;	
		//ТЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(, Новый Структура("РасчетныйПериод", ДатаНеактуальности));
		//Если ТЗ.Количество() = 0 Тогда
		//Иначе
		//	Если Не ТЗ[0].Актуален Тогда
		//		Возврат;
		//	КонецЕсли
		//КонецЕсли;
		//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
		//МЗ.Актуален = Ложь;
		//МЗ.РасчетныйПериод = ДатаНеактуальности;
		//МЗ.Период = ТекущаяДата();
		//МЗ.Объект = "РС.Штрафы";
		//Попытка
		//	МЗ.Записать();
		//Исключение
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка регистрации неактуальности периода расчета ЗП:" + ОписаниеОшибки());			
		//КонецПопытки;
	Иначе
		
	КонецЕсли;
	
	Если МЗ0.Выбран() = Ложь Или ЭтотОбъект[0].ДатаИзменения= ЭтотОбъект[0].ДатаСоздания  Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Новый",Истина);
	КонецЕсли;	
	
КонецПроцедуры


Функция СообщитьОШтрафе(Агент,Причина,ВидШтрафа,Сумма,Комментарий,Период,Автор,Срочно = Истина)
	Возврат Истина;
	Попытка
	Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
		Объект = Агент;
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			СтруктураРуководителей = уб_temp.РуководительПодразделенияПоАгенту(Агент);
			Если Не СтруктураРуководителей.Руководитель.Пустая() Тогда
				МассивОбъектов.Добавить(СтруктураРуководителей.Руководитель)
			КонецЕсли;
			Если Не СтруктураРуководителей.Заместитель.Пустая() Тогда
				МассивОбъектов.Добавить(СтруктураРуководителей.Заместитель)
			КонецЕсли;
		КонецЕсли;
		
		//получаем электронные почты
		Индекс = 0;
		МассивПолучателей = Новый Массив;
		Для Каждого Объект Из МассивОбъектов Цикл
			Индекс = Индекс + 1;
			ЭлПочта = уб_temp.КонтактнаяИнформация(Объект, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
			Если Не ПустаяСтрока(ЭлПочта) Тогда
				МассивПолучателей.Добавить(ЭлПочта)
			ИначеЕсли Срочно И Индекс = 1 Тогда
				//пустая электронная почта главного ответственного. Не пишем в регистр в таком случае
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не заполнена электронная почта '" + Объект + "'! Срочная ошибка не будет создана", "Сообщить");
				Прервать
			КонецЕсли;
		КонецЦикла;
		Если МассивПолучателей.Количество() > 0 Тогда
			//отправляем почту
			//Запрос = Новый Запрос(
			//"ВЫБРАТЬ
			//|	уб_ОшибкиСрезПоследних.Статус,
			//|	уб_ОшибкиСрезПоследних.Приоритет,
			//|	уб_ОшибкиСрезПоследних.КритическаяДата,
			//|	уб_ОшибкиСрезПоследних.ТипПодразделения,
			//|	уб_ОшибкиСрезПоследних.ОписаниеОшибки,
			//|	уб_ОшибкиСрезПоследних.Модификатор
			//|ИЗ
			//|	РегистрСведений.уб_Ошибки.СрезПоследних (, Объект = &Объект И УИД = &УИД) КАК уб_ОшибкиСрезПоследних");
			//
			//получаем электронную почту отправителя
			Если Срочно Тогда
				//добавляем в список получателей электронную почту для копий
				СистемнаяПочта = ПараметрыСеанса.уб_Константы.ЭлектроннаяПочтаДляКопий;
				//ШтрафПоТекущейДате  = РегистрыСведений.уб_Ошибки.ОшибкиСуммаШтрафа(Ссылка, ТекСтрока, Истина);
				//Если ВыборкаРегистра = Неопределено Тогда
				//	КритическаяДатаПоШтрафу = КритическаяДата;
				//Иначе
				//	КритическаяДатаПоШтрафу = ВыборкаРегистра.КритическаяДата;
				//КонецЕсли;
				ДопТекстПодвал ="";// "<br><br><font color = ""#ff0000"">" + ?(ШтрафПоТекущейДате = 0, "", "<b>Начисленный штраф: " + ШтрафПоТекущейДате + " руб.</b><br><br>") + "<i>За неисправление ошибки, начиная с даты " + Формат(КритическаяДата + 1, "ДФ=dd.MM.yyyy") + " г. в " + Формат(КритическаяДата + 1, "ДЛФ=T") + " будет начислен ежедневный штраф " + ЕжедневныйШтраф + " руб. за каждый день просрочки!</i></font>";
				Если ТипЗнч(СистемнаяПочта) = Тип("Строка") Тогда
					МассивПолучателей.Добавить(СистемнаяПочта)
				КонецЕсли;
			Иначе
				ДопТекстПодвал = "";
			КонецЕсли;
			ДопТекстСрочно ="";// ?(Срочно, "<b><font color = ""#ff0000"">СРОЧНО!</font></b><br><br>", "");
			ДопТекстЦветФона = "";//?(Срочно, " bgcolor = ""#ffcccc""", "");
			ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина, Истина);
			ТекстHTML = "<html><body"  + ДопТекстЦветФона + "><br> " + ДопТекстСрочно + "
			|<b>Агент:</b>            " + Агент + "<br>
			|<b>Дата штрафа:</b>   "    + Период + "<br>
			|<b>Вид:</b>      " +ВидШтрафа + "<br>
			|<b>Сумма:</b>      " +Сумма + "<br>
			|<b>Назначил:</b>      " +Автор + "<br>
			|<b>Комментарий:</b>      " + Комментарий + "<br>"
			+ ДопТекстПодвал + "
			|</body></html>";
			Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
				Параметры.ОбратныйАдрес = ОбратныйАдрес;
			КонецЕсли;
			Параметры.Получатели					= МассивПолучателей;
			Параметры.Тема							= Причина+" для " + Агент;
			Параметры.ТекстHTML						= ТекстHTML;
			Параметры.ПисатьВЖурналТемуПриОшибке    = Ложь;
			Параметры.ТипСообщенияПриИсключении		= "Предупреждение";
			Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
				Параметры.ОбратныйАдрес = ОбратныйАдрес
			КонецЕсли;
			ЗаписыватьВРегистр = уб_ОбменДанными.SendMail(Параметры);
		КонецЕсли;
		
	Иначе
		ЗаписыватьВРегистр = Истина;
	КонецЕсли;
Исключение
	КонецПопытки;
КонецФункции


