&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	
	ПараметрыФункции = Неопределено;
	уб_СС.ПодчиненныеРуководителя(, ТекущаяДата(), ПараметрыФункции);
	Если РольДоступна("ПолныеПрава") Тогда
		СписокСотрудников = 	уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(ТекущаяДата());
	Иначе
		СписокСотрудников = ПараметрыФункции.СписокСотрудников;
		//Элементы.НастройкиОтчета.Доступность = Ложь;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если СписокСотрудников.Количество() = 0 Тогда
			СписокСотрудников.Добавить(ПараметрыСеанса.уб_ТекущееФизЛицо);
		КонецЕсли;	
	КонецЕсли;	
	Если СписокСотрудников.Количество() = 1 Тогда
		Менеджер = СписокСотрудников[0].Значение ;
		Элементы.Менеджер.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(СписокСотрудников.ВыгрузитьЗначения());

	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(уб_temp.ПолучитьСписокАктуальныхПодразделений().ВыгрузитьЗначения());

	
КонецПроцедуры


&НаКлиенте
Процедура НовыйПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СКПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры



&НаСервере
Процедура УстановитьОтбор()
	Обработка = РеквизитФормыВЗначение("Отчет");
	
	
	_КомпоновщикНастроек = Обработка.КомпоновщикНастроек.Настройки;

	СписокСотрудников = Элементы.Менеджер.СписокВыбора.ВыгрузитьЗначения();	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Агент");
	Настройка = Обработка.КомпоновщикНастроек.Настройки;
	
	//Отбор по доступным менеджера 
	Если  СписокСотрудников.Количество()>0 Тогда
		
		ФлЕстьОтбор = Ложь;
		Для каждого ЭлементОтбора из Настройка.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
				и ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке Тогда
				ФлЕстьОтбор = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
		Если ФлЕстьОтбор = ЛОЖЬ Тогда
			ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;	
		ЭлементОтбора.ЛевоеЗначение		= ПолеОтбора;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование 	= Истина;
		//ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
		ЭлементОтбора.Представление		= ""+СписокСотрудников;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
	
	КонецЕсли;	
		
	//Отбор по менеджеру
	ФлЕстьОтбор = Ложь;
	Для каждого ЭлементОтбора из Настройка.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
			и ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно Тогда
			ФлЕстьОтбор = Истина;
			Прервать
		КонецЕсли;
	КонецЦикла;	
	
	Если ФлЕстьОтбор = ЛОЖЬ Тогда
		ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Агент");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= ЗначениеЗаполнено(Менеджер);
	//ЭлементОтбора.Представление		= Поставщик;
	ЭлементОтбора.ПравоеЗначение	= Менеджер;
	
		
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Агент");
	Парам.Значение      = Менеджер;
	Парам.Использование = Истина;  	
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Дата1");
	Парам.Значение      = Период.ДатаНачала;
	Парам.Использование = Истина;
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Дата2");
	Парам.Значение      = Период.ДатаОкончания;
	Парам.Использование = Истина;
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("ВидСП");
	Парам.Значение      = ВидСП;
	Парам.Использование = Истина;
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Поставщик");
	Парам.Значение      = СК;
	Парам.Использование = Истина;
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Режим");
	Парам.Значение      = РежимОтчета;
	Парам.Использование = Истина;
	
	Парам = _КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Подразделение");
	Парам.Значение      = Подразделение;
	Парам.Использование = Истина;
	
	
	найден = Ложь;
	
	ЛевоеЗначение =  Новый ПолеКомпоновкиДанных("НовыйКлиент");
	Для каждого ЭлементОтбора из _КомпоновщикНастроек.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение  =	ЛевоеЗначение Тогда
			найден = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если найден = Ложь Тогда
		ЭлементОтбора = _КомпоновщикНастроек.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  =	ЛевоеЗначение;
	КонецЕсли;	
	
	ЭлементОтбора.ПравоеЗначение      = НовыйКлиент;
	ЭлементОтбора.Использование = НовыйКлиент<>-1;

	
	
	ЗначениеВРеквизитФормы(Обработка,"Отчет");
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура РежимОтчетаПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ВидСППриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),Элемент);

КонецПроцедуры 

