//Функция привязывает документ расчетов к отчету поставщика
Функция ПривязатьДокумент(
	Взаиморасчет, 
	Документ, 
	СуммаПривязки, 
	ПривязыватьСколькоЕсть 	= Ложь, 
	ЕстьПустых				= 0,
	ЭтоРекурсия				= Ложь,
	УИДСтроки				= "",
	ПроверятьРеквизиты		= Истина
	) Экспорт
	
	Если СуммаПривязки = 0 Тогда
		СообщениеОшибки = "Сумма по этому документу полностью задействована!";
		#Если Клиент Тогда
		Предупреждение(СообщениеОшибки);
		Возврат СообщениеОшибки;
		#КонецЕсли
	КонецЕсли;
	ВидДокумента = Документ.Метаданные().Имя;
	//для приемки оплат и оплаты полисов не требуется проверка на поставщиков и оргагентов
	Если ВидДокумента = "уб_ПриемкаОплат" Или ВидДокумента = "уб_ОплатаПолисов" Тогда
	ИначеЕсли ПроверятьРеквизиты Тогда	
		//Проверка основных реквизитов
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Документ.Проведен,
		|	Документ.Поставщик,
		|	Документ.ОрганизацияАгент
		|ИЗ
		|	Документ." + ВидДокумента + " КАК Документ
		|ГДЕ
		|	Документ.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Не Выборка.Поставщик = Взаиморасчет.Контрагент Тогда
				СообщениеОшибки = "Не совпадают Контрагенты для " + Документ + " и " + Взаиморасчет;
				Сообщить(СообщениеОшибки);
				Возврат СообщениеОшибки;
			КонецЕсли;
			Если Не Выборка.ОрганизацияАгент = Взаиморасчет.ОрганизацияАгент Тогда
				СообщениеОшибки  = "Не совпадают Организация-агент для " + Документ + " и " + Взаиморасчет;
				Сообщить(СообщениеОшибки);
				Возврат СообщениеОшибки;
			КонецЕсли;
		Иначе
			СообщениеОшибки = "Не обнаружен документ " + Документ;
			Сообщить(СообщениеОшибки);
			Возврат СообщениеОшибки;
		КонецЕсли;
	КонецЕсли;
	ВзаиморасчетОбъект = Взаиморасчет.ПолучитьОбъект();
	//Копирование ТЧ
	Распределение = ВзаиморасчетОбъект.Распределение.Выгрузить();
	ПустыеРаспределение = Распределение.Скопировать(Новый Структура("ОтчетПоставщику",Документы.уб_ОтчетПоставщику.ПустаяСсылка()));
	НаправлениеРасчетов = ВзаиморасчетОбъект.НаправлениеРасчетов;
	пВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов;
	Если (ВидДокумента = "уб_ОтчетПоставщику" и (НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщику ИЛИ НаправлениеРасчетов = пВидОперации.ПоступлениеКВОтПоставщика)) 
	    Или 
		(ВидДокумента = "уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы" И
			           (
					    (НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщику и Документ.ВидОперации = пВидОперации.Штраф)
			            Или (НаправлениеРасчетов = пВидОперации.ПоступлениеКВОтПоставщика и Документ.ВидОперации = пВидОперации.ДВОУ)
			            Или НаправлениеРасчетов = пВидОперации.Корректировка 
			            Или НаправлениеРасчетов = пВидОперации.НачальныйОстаток)
		               )
		Или 
		(ВидДокумента = "уб_ПриемкаОплат"  //Квитовка поступлений от страхователя
		 //И ((НаправлениеРасчетов = пВидОперации.БрокеруПоБезналу ИЛИ НаправлениеРасчетов = пВидОперации.ОтБрокераПоБезналу) И (ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина Или Документ.ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал))
		)			   
		Или 
		(ВидДокумента = "уб_ВзаиморасчетСПоставщиком"  //Возврат ошибочно перечисленной суммы
		 И ((НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщику И Документ.НаправлениеРасчетов = пВидОперации.ПоступлениеКВОтПоставщика)
		 	Или (НаправлениеРасчетов = пВидОперации.БрокеруПоБезналу И Документ.НаправлениеРасчетов = пВидОперации.ОтБрокераПоБезналу)
			Или (НаправлениеРасчетов = пВидОперации.ОтБрокераПоБезналу И Документ.НаправлениеРасчетов = пВидОперации.БрокеруПоБезналу))
		)
		Или (ВидДокумента = "уб_ВзаиморасчетСПоставщиком" //Возврат ошибочно перечисленной суммы 
		 И (НаправлениеРасчетов = пВидОперации.ПоступлениеКВОтПоставщика и Документ.НаправлениеРасчетов = пВидОперации.ПеречислениеПоставщику)
		)
		Или 
		(ВидДокумента = "уб_ОплатаПолисов"  //Возврат ошибочно перечисленной суммы
		 И (НаправлениеРасчетов = пВидОперации.СкидкаКлиенту
		 	Или НаправлениеРасчетов = пВидОперации.БрокеруПоБезналу
		 	Или НаправлениеРасчетов = пВидОперации.ОтчетПоставщику)
		)
		Тогда
		//Определение доступной к распределению суммы
		ЕстьПустых = ПустыеРаспределение.Итог("Сумма");		
		Если  ЕстьПустых >= СуммаПривязки Тогда
			ЕстьПустых = СуммаПривязки;
		Иначе	
			Если ПривязыватьСколькоЕсть Тогда     
				СуммаПривязки = СуммаПривязки - ЕстьПустых;
				//			
			Иначе
				СообщениеОшибки = "В документе " + Взаиморасчет + ". Доступна сумма привязки всего: " + ЕстьПустых;
				Сообщить(СообщениеОшибки);
				Возврат СообщениеОшибки;
			КонецЕсли;	
		Конецесли;			
		//Уменьшаем доступную сумму
		СтрокаСторно = Распределение.Добавить();
		СтрокаСторно.ОтчетПоставщику 	= Документы.уб_ОтчетПоставщику.ПустаяСсылка();
		СтрокаСторно.Сумма 				= - ЕстьПустых;
		//Привязка
		СтрокаПривязки = Распределение.Добавить();
		СтрокаПривязки.ОтчетПоставщику 	= Документ;
		СтрокаПривязки.Сумма			= ЕстьПустых;
		СтрокаПривязки.УИДСтроки		= УИДСтроки;
		//заполняем значения полей Поставщик, Контрагент и Организация-агент взаиморасчета для приемки оплат
		Если ВидДокумента = "уб_ПриемкаОплат" Тогда
			//TODO платеж за двух контрагентов возможен, как разделять?
			Если Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Поставщик) Или Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Контрагент) Тогда
				текСтрахователь = Неопределено;
				Для Каждого СтрокаТЧ Из Документ.Полисы Цикл		
					ОплатаПолисаДляОтчетаАгента = Документы.уб_ПриемкаОплат.ПолучитьОплатуПолисаДляОтчетаАгента(СтрокаТЧ.УИДСтроки, СтрокаТЧ.НомерКвитанции);
					Если Не ОплатаПолисаДляОтчетаАгента.Пустая() Тогда
						Страхователь = ОплатаПолисаДляОтчетаАгента.СтраховойПолис.Страхователь;
						Если ЗначениеЗаполнено(Страхователь) Тогда
							Если текСтрахователь = Неопределено Тогда
								текСтрахователь = Страхователь
							ИначеЕсли текСтрахователь <> Страхователь Тогда
								//2 различных страхователя в приемке
								текСтрахователь = Неопределено;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если текСтрахователь <> Неопределено Тогда
					Если Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Поставщик) Тогда
						ВзаиморасчетОбъект.Поставщик = текСтрахователь
					КонецЕсли;
					Если Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Контрагент) Тогда
						ВзаиморасчетОбъект.Контрагент = текСтрахователь
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ВзаиморасчетОбъект.ОрганизацияАгент.Пустая() Тогда
				//получаем список организаций агентов в ТЧ приемки
				Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Приемка.ОрганизацияАгент
				|ИЗ
				|	Документ.уб_ПриемкаОплат.Полисы КАК Приемка
				|ГДЕ
				|	Приемка.Ссылка = &Ссылка");
				Запрос.УстановитьПараметр("Ссылка", Документ);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Количество() = 1 Тогда
					Выборка.Следующий();
					ВзаиморасчетОбъект.ОрганизацияАгент = Выборка.ОрганизацияАгент;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидДокумента = "уб_ОплатаПолисов" Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ОП.ОрганизацияАгент,
			|	ОП.Поставщик,
			|	ОП.СтраховойПолис.Страхователь КАК Страхователь
			|ИЗ
			|	Документ.уб_ОплатаПолисов КАК ОП
			|ГДЕ
			|	ОП.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Документ);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Не ЗначениеЗаполнено(ВзаиморасчетОбъект.ОрганизацияАгент) Тогда
					ВзаиморасчетОбъект.ОрганизацияАгент = Выборка.ОрганизацияАгент
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Поставщик) Тогда
					ВзаиморасчетОбъект.Поставщик = Выборка.Поставщик
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.Страхователь) И Не ЗначениеЗаполнено(ВзаиморасчетОбъект.Контрагент) Тогда
					ВзаиморасчетОбъект.Контрагент = Выборка.Страхователь
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;		
	//Свертка и зачистка нулевых строк
	Распределение.Свернуть("ОтчетПоставщику, УИДСтроки", "Сумма");
	ВсегоСтрок = Распределение.Количество();
	МассивУдаляемыхСтрок = Новый Массив;
	Для Счетчик = 1 по ВсегоСтрок Цикл
		ТекСтрока = Распределение[ВсегоСтрок - Счетчик];
		Если ТекСтрока.Сумма = 0 Тогда
			//Пустая строка
			МассивУдаляемыхСтрок.Добавить(ТекСтрока);
			//Распределение.Удалить(ТекСтрока);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивУдаляемыхСтрок Цикл
		Распределение.Удалить(ЭлементМассива);
	КонецЦикла;
	//Загрузка обратно
	ВзаиморасчетОбъект.Распределение.Загрузить(Распределение);
	ВзаиморасчетОбъект.НераспределенныйОстаток = ВзаиморасчетОбъект.Распределение.Выгрузить(Новый Структура("ОтчетПоставщику",Документы.уб_ОтчетПоставщику.ПустаяСсылка()), "Сумма").Итог("Сумма");
	Попытка
		ВзаиморасчетОбъект.Записать();
	Исключение
		СообщениеОшибки = "Ошибка при привязке " + Взаиморасчет + " к " + Документ;
		Сообщить(СообщениеОшибки);
		Возврат СообщениеОшибки;
	КонецПопытки;		
	Если Не ЭтоРекурсия Тогда
		Если ВидДокумента = "уб_ВзаиморасчетСПоставщиком" Тогда
			//Циклическая привязка
			ПривязатьДокумент(
				Документ, 
				Взаиморасчет, 
				ЕстьПустых, 
				Ложь,
				,
				Истина,
				УИДСтроки,
				ПроверятьРеквизиты
			);// !РЕКУРСИЯ!
		КонецЕсли;
		#Если Клиент Тогда
			Оповестить("ИзменениеВзаиморасчета", Документ);
		#КонецЕсли
	КонецЕсли;	
	Возврат Истина;
	
КонецФункции

Функция ОтвязатьДокумент(
	Взаиморасчет, 
	Документ,
	ЭтоРекурсия = Ложь,
	УИДСтроки	= ""
	) Экспорт
	
	Результат = Ложь;
	Если Взаиморасчет.Распределение.Найти(Документ) <> Неопределено Тогда
		ВзаиморасчетОбъект = Взаиморасчет.ПолучитьОбъект();
		//Копирование ТЧ
		Распределение = ВзаиморасчетОбъект.Распределение.Выгрузить();
		//НайденнаяСтрока = Распределение.Найти(Документ);
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОтчетПоставщику", Документ);
		ПараметрыОтбора.Вставить("УИДСтроки",		УИДСтроки);
		МассивСтрок = Распределение.НайтиСтроки(ПараметрыОтбора);
		МассивСтрокКоличество = МассивСтрок.Количество();
		Если МассивСтрокКоличество = 0 Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Документ.уб_ВзаиморасчетСПоставщиком.ОтвязатьДокумент() не найдено строк по условиям ОтчетПоставщику: " + Документ + ", УИДСтроки: " + УИДСтроки, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
		ИначеЕсли МассивСтрокКоличество > 1 Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Документ.уб_ВзаиморасчетСПоставщиком.ОтвязатьДокумент() найдено несколько строк по условиям ОтчетПоставщику: " + Документ + ", УИДСтроки: " + УИДСтроки, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
			//Увеличиваем доступную сумму
			СтрокаСторно = Распределение.Добавить();
			СтрокаСторно.ОтчетПоставщику = Документы.уб_ОтчетПоставщику.ПустаяСсылка();
			СтрокаСторно.Сумма = НайденнаяСтрока.Сумма;
			Распределение.Удалить(НайденнаяСтрока);
			//Свертка и зачистка нулевых строк
			Распределение.Свернуть("ОтчетПоставщику, УИДСтроки", "Сумма");
			ВсегоСтрок = Распределение.Количество();
			МассивУдаляемыхСтрок = Новый Массив;
			Для Счетчик = 1 по ВсегоСтрок Цикл
				ТекСтрока = Распределение[ВсегоСтрок-Счетчик];
				Если ТекСтрока.Сумма = 0 Тогда
					//Пустая строка
					//Распределение.Удалить(ТекСтрока);
					МассивУдаляемыхСтрок.Добавить(ТекСтрока);
				КонецЕсли;	
			КонецЦикла;
			Для Каждого ЭлементМассива Из МассивУдаляемыхСтрок Цикл
				Распределение.Удалить(ЭлементМассива);
			КонецЦикла;
	        //Загрузка обратно
			ВзаиморасчетОбъект.Распределение.Загрузить(Распределение);
			ВзаиморасчетОбъект.НераспределенныйОстаток = ВзаиморасчетОбъект.Распределение.Выгрузить(Новый Структура("ОтчетПоставщику", Документы.уб_ОтчетПоставщику.ПустаяСсылка()), "Сумма").Итог("Сумма");
			Попытка
				ВзаиморасчетОбъект.Записать();
			Исключение
				Сообщить("Ошибка при отвязке " + Документ + " от " + Взаиморасчет);
				Возврат Ложь;
			КонецПопытки;	
			Если НЕ ЭтоРекурсия и ТипЗнч(Документ) = Тип("ДокументСсылка.уб_ВзаиморасчетСПоставщиком") Тогда
				ОтвязатьДокумент(Документ, Взаиморасчет, Истина, УИДСтроки);
			Конецесли;	
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Если Результат Тогда
		#Если Клиент Тогда
			Оповестить("ИзменениеВзаиморасчета", Документ);
		#КонецЕсли
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция СуммаПодвязкиПоСсылке(Ссылка, НаправлениеРасчетов = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Р.Сумма), 0) КАК Сумма
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Р
	|ГДЕ
	|	Р.ОтчетПоставщику = &Ссылка
	|	И &УсловиеГде";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	УсловиеГде = "ИСТИНА";
	Если НаправлениеРасчетов <> Неопределено Тогда
		УсловиеГде = "Р.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
		Запрос.УстановитьПараметр("НаправлениеРасчетов", НаправлениеРасчетов);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Сумма;

КонецФункции // ДанныеПоКвитовкам()

Функция НаправлениеПлатежаКартинка(НаправлениеРасчетов) Экспорт
	
	Пер = Перечисления.уб_ВидОперацииВзаиморасчетов;
	Если НаправлениеРасчетов = Пер.ПеречислениеПоставщику Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаПраво;
	ИначеЕсли НаправлениеРасчетов = Пер.ПоступлениеКВОтПоставщика Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаЛево;
	ИначеЕсли НаправлениеРасчетов = Пер.ПеречислениеПоставщикуСтрахователем Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаПравоРозовый;		
	ИначеЕсли НаправлениеРасчетов = Пер.БрокеруПоБезналу Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаЛевоЗел;	
	ИначеЕсли НаправлениеРасчетов = Пер.ОтБрокераПоБезналу Или НаправлениеРасчетов = Пер.СкидкаКлиенту Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаПравоОранж;	
	ИначеЕсли НаправлениеРасчетов = Пер.НачальныйОстаток Тогда
		Иконка =  БиблиотекаКартинок.уб_НаправлениеПлатежаНачОстаток;
	ИначеЕсли НаправлениеРасчетов = Пер.Корректировка Тогда
		Иконка = БиблиотекаКартинок.уб_НаправлениеПлатежаКорректировка;
	Иначе
		Иконка = Новый Картинка;
	КонецЕсли;
	Возврат Иконка;
	
КонецФункции

Функция РаскраситьСтрокуВзаиморасчетов(ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	//Если вид взаиморасчетов "Корректировка" - красим в строку в желтый цвет
	Если ДанныеСтроки.НаправлениеРасчетов = Перечисления.уб_ВидОперацииВзаиморасчетов.Корректировка Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255, 255, 100);
	КонецЕсли;	
	//Если исключенные или за датой взаиморасчетов красим в красный
	Если ДанныеСтроки.Контрагент.ДатаВеденияВзаиморасчётов > ДанныеСтроки.Дата 
		ИЛИ ДанныеСтроки.Ссылка.ИсключитьИзВзаиморасчетов Тогда
		ОформлениеСтроки.ЦветФона = Новый Цвет(255, 200, 200);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокВзаиморасчетов(
	Ссылка, 
	Привязано 						= 0,
	УИДСтроки 						= "",
	Знач ФормаОплаты 				= Неопределено,
	Знач ВидВзаиморасчетов			= Неопределено,
	ТипСравненияВидВзаиморасчетов   = "Равно"
	) Экспорт
	
	Результат = Новый СписокЗначений;
	Если Не Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Вз.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(Вз.Ссылка) КАК ВзаиморасчетСтрока,
		|	Вз.Сумма КАК ВзаиморасчетСумма,
		|	Вз.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Вз.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	Вз.Ссылка.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(Вз.Ссылка.ФормаОплаты) КАК ФормаОплатыСтрока
		|ИЗ
		|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Вз
		|ГДЕ
		|	Вз.ОтчетПоставщику = &ОтчетПоставщику
		|	И Вз.УИДСтроки = &УИДСтроки
		|	И &УсловиеГде";
		УсловиеГде = "ИСТИНА";
		ПараметрУстановлен = Ложь;
		Если ЗначениеЗаполнено(ФормаОплаты) Тогда
			Если ТипЗнч(ФормаОплаты) <> Тип("ПеречислениеСсылка.уб_ФормаОплатыВзаиморасчеты") Тогда
				Если ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
					УсловиеГде = "Вз.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)";
					ПараметрУстановлен = Истина;
				Иначе
					ФормаОплаты = КонверторПеречисленийФормыОплаты(ФормаОплаты);
				КонецЕсли;
			КонецЕсли;
			Если Не ПараметрУстановлен И ЗначениеЗаполнено(ФормаОплаты) Тогда
				УсловиеГде = "Вз.Ссылка.ФормаОплаты = &ФормаОплаты 
				|	И НЕ Вз.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)";
				Запрос.УстановитьПараметр("ФормаОплаты", ФормаОплаты);
			КонецЕсли;
		ИначеЕсли ВидВзаиморасчетов <> Неопределено Тогда
			Если НРег(ТипСравненияВидВзаиморасчетов) = "равно" Тогда
				УсловиеГде = УсловиеГде + " И Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
			Иначе
				УсловиеГде = УсловиеГде + " И НЕ Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
			КонецЕсли;
			Запрос.УстановитьПараметр("НаправлениеРасчетов", ВидВзаиморасчетов);
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
		Запрос.УстановитьПараметр("ОтчетПоставщику", 	Ссылка);
		Запрос.УстановитьПараметр("УИДСтроки",			УИДСтроки);
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(
				Выборка.Ссылка,
				ПредставлениеСтрокиСпискаВыбораКвитовкиПлатежа(Выборка)
			);
			//Результат = Выборка.Ссылка;
			Привязано = Привязано + Выборка.ВзаиморасчетСумма;
		КонецЦикла;		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСтрокиСпискаВыбораКвитовкиПлатежа(Выборка) Экспорт

	Возврат Формат(Выборка.ВзаиморасчетСумма, "ЧЦ=15; ЧДЦ=2") + " - " + Выборка.ФормаОплатыСтрока + ?(ЗначениеЗаполнено(Выборка.НомерВходящегоДокумента), " по №" + Выборка.НомерВходящегоДокумента + " от " + ?(ЗначениеЗаполнено(Выборка.ДатаВходящегоДокумента), Выборка.ДатаВходящегоДокумента, Выборка.Дата), " по " + Выборка.ВзаиморасчетСтрока)

КонецФункции // ПредставлениеСтрокиСпискаВыбораКвитовкиПлатежа()


Функция КонверторПеречисленийФормыОплаты(Ссылка) Экспорт

	Прч 	= Перечисления.уб_ФормыОплаты;
	ПрчВ    = Перечисления.уб_ФормаОплатыВзаиморасчеты;
	ТипЗнчСсылка = ТипЗнч(Ссылка);
	Если ТипЗнчСсылка = Тип("ПеречислениеСсылка.уб_ФормыОплаты") Тогда
		Если Ссылка = Прч.Безнал Тогда
			Результат = ПрчВ.Безналично;
		ИначеЕсли Ссылка = Прч.Касса Тогда
			Результат = ПрчВ.Наличными
		Иначе
			Результат = ПрчВ.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнчСсылка = Тип("ПеречислениеСсылка.уб_ФормаОплатыВзаиморасчеты") Тогда
		Если Ссылка = ПрчВ.Безналично Тогда
			Результат = Прч.Безнал;
		ИначеЕсли Ссылка = ПрчВ.Наличными Тогда
			Результат = Прч.Касса
		Иначе
			Результат = Прч.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если Результат = Неопределено Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_ВзаиморасчетСПоставщиком.КонверторПеречисленийФормыОплаты(): некорректный тип параметра Ссылка: " + Ссылка + ", Тип: " + ТипЗнчСсылка, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
	КонецЕсли;
	Возврат Результат

КонецФункции // КонверторПеречисленийФормыОплаты()

&НаКлиенте
Процедура НачалоКвитовкиПлатежа(Элемент, СтандартнаяОбработка, Параметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	УИДСтроки = ?(Параметры.Свойство("УИДСтроки"), Параметры.УИДСтроки, "");
	Если Параметры.Свойство("НаправлениеРасчетов") Тогда
		НаправлениеРасчетов = Параметры.НаправлениеРасчетов
	КонецЕсли;
	Если Параметры.Свойство("ВидСравненияНаправлениеРасчетов") Тогда
		ВидСравненияНаправлениеРасчетов = Параметры.ВидСравненияНаправлениеРасчетов
	Иначе
		ВидСравненияНаправлениеРасчетов = "Равно";
	КонецЕсли;
	ТаблицаПлатежейПоДокументу = уб_Взаиморасчеты.ТаблицаПлатежейПоДокументу(Параметры.Ссылка, УИДСтроки, НаправлениеРасчетов, ВидСравненияНаправлениеРасчетов);
	ФормаВыбора = Документы.уб_ВзаиморасчетСПоставщиком.ПолучитьФормуВыбора(, Элемент);	
	стрСтрахователь = "";
	ФормаВыбора.НаправлениеРасчетов = Параметры.Направление;
	Если НЕ Параметры.СуммаДокумента = 0 Тогда //не фильтруем по сумме при переданном 0
		ФормаВыбора.СуммаДокумента = Параметры.СуммаДокумента - ТаблицаПлатежейПоДокументу.Итог("Сумма"); //TODO проверка на превышение
	КонецЕсли;	
	ФормаВыбора.ЭлементыФормы.ФлажокПоставщик.Заголовок = Параметры.ЗаголовокПоставщика;
	ФормаВыбора.Заголовок = Параметры.ЗаголовокФормы;
	ФормаВыбора.Поставщик = Параметры.Поставщик;
	Если Параметры.Свойство("ФормаОплаты") Тогда
		ФормаВыбора.эуПоискФормаОплаты = Параметры.ФормаОплаты;
	КонецЕсли;
	Если Параметры.Свойство("УбратьИзСпискаВыбораПеречислениеПоставщикуСтрахователем") И Параметры.УбратьИзСпискаВыбораПеречислениеПоставщикуСтрахователем = Истина Тогда
		СтрокаСЗ = ФормаВыбора.ЭлементыФормы.НаправлениеРасчетов.СписокВыбора.НайтиПоЗначению(Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем);
		Если СтрокаСЗ <> Неопределено Тогда
			ФормаВыбора.ЭлементыФормы.НаправлениеРасчетов.СписокВыбора.Удалить(СтрокаСЗ);
		КонецЕсли;
	КонецЕсли;
	СписокПоставщика = Неопределено;
	Если Параметры.Свойство("СписокПоставщика",СписокПоставщика) = Истина и СписокПоставщика<>Неопределено Тогда
		эу = ФормаВыбора.ЭлементыФормы.Поставщик;
		эу.СписокВыбора 		= СписокПоставщика;
		эу.КнопкаСпискаВыбора 	= Истина;
	КонецЕсли;	
	_естьПоставщик = ЗначениеЗаполнено(Параметры.Поставщик);
	ФормаВыбора.ФлажокПоставщик = _естьПоставщик;
	ФормаВыбора.ЭлементыФормы.ДокументСписок.РежимВыделения = РежимВыделенияТабличногоПоля.Множественный;
	ЗакрыватьПриВыборе = Истина;
	Если Параметры.Свойство("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе) = Ложь Тогда
		ЗакрыватьПриВыборе = Истина;
	КонецЕсли;	
	ФормаВыбора.ЗакрыватьПриВыборе 	= ЗакрыватьПриВыборе;
	// существует два варианта подвязок. Если уходить от модальной формы, нужно проверить
	Элемент.Значение = ФормаВыбора.ОткрытьМодально();

Конецпроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораПлатежа(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Параметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СуммаФакт = 0;
	Если Параметры.Свойство("УИДСтроки") Тогда
		УИДСтроки = Параметры.УИДСтроки;
	Иначе
		УИДСтроки = "";
	КонецЕсли;
	Если Параметры.Свойство("НеУстанавливатьКартинку") И Параметры.НеУстанавливатьКартинку = Истина Тогда
		УстанавливатьКартинку = Ложь;
	Иначе
		УстанавливатьКартинку = Истина;
	КонецЕсли;
	Если Параметры.Свойство("СРазницей") И Параметры.СРазницей Тогда
		ТаблицаПлатежейПоДокументу = уб_Взаиморасчеты.ТаблицаПлатежейПоДокументу(Параметры.ЭтотОбъект.Ссылка, УИДСтроки);
		СуммаТекущих = ТаблицаПлатежейПоДокументу.Итог("Сумма");
	Иначе
		СуммаТекущих = 0;
	КонецЕсли;
	СуммаДляПривязки = Параметры.СуммаДляПривязки - СуммаТекущих;
	Если НЕ Документы.уб_ВзаиморасчетСПоставщиком.ПривязатьДокумент(
		ВыбранноеЗначение, 
		Параметры.ЭтотОбъект.Ссылка, 
		СуммаДляПривязки,
		Истина,
		,
		,
		УИДСтроки
		) = Истина Тогда
		#Если Клиент Тогда
			Предупреждение ("Ошибка при привязке платежа!");
		#КонецЕсли	
	Иначе	
		Элемент.СписокВыбора = Документы.уб_ВзаиморасчетСПоставщиком.ПолучитьСписокВзаиморасчетов(Параметры.ЭтотОбъект.Ссылка, СуммаФакт, УИДСтроки);
		#Если Клиент Тогда                                                                                                       
			Оповестить("Привязка платежа",ВыбранноеЗначение);
		#КонецЕсли
	КонецЕсли;	
	Если Не ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(Параметры, "УстанавливатьПараметрыОтображения", Ложь) Тогда
		УстановитьПараметрыОтображенияПлатежа(Элемент,СуммаФакт < Параметры.СуммаДляПривязкиПолная, УстанавливатьКартинку);//Иконка и кнопки выбора
	КонецЕсли;
	Если СуммаФакт < Параметры.СуммаДляПривязкиПолная Тогда
		Элемент.Подсказка = "Сквитовано: " + Формат(СуммаФакт,"ЧЦ=15; ЧДЦ=2")+ " Остаток для квитовки = " + Формат(Параметры.СуммаДляПривязкиПолная - СуммаФакт, "ЧЦ=15; ЧДЦ=2");
	Иначе
		Элемент.Подсказка = "Поле для квитовки поступивших/выданных безналичных платежей";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаКвитовкиПлатежей(
	Элемент, 
	СтандартнаяОбработка,
	Объект,
	УИДСтроки = "",
	ПолучатьСписокВзаиморасчетов = Истина
	) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Список = Элемент.СписокВыбора;
	Если Список.Количество() > 0 Тогда
		Для Каждого ЭлементСписка из Список Цикл
			Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
				Документы.уб_ВзаиморасчетСПоставщиком.ОтвязатьДокумент(ЭлементСписка.Значение, Объект.Ссылка,, УИДСтроки);
				Оповестить("Привязка платежа", ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		Если ПолучатьСписокВзаиморасчетов Тогда
			Элемент.СписокВыбора = Документы.уб_ВзаиморасчетСПоставщиком.ПолучитьСписокВзаиморасчетов(Объект.Ссылка,, УИДСтроки);
			УстановитьПараметрыОтображенияПлатежа(Элемент);//Иконка и кнопки выбора
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДоступностьКвитовкиПлатежа(
	эу, 
	Доступность, 
	Объект, 
	СуммаТребуемая 			= 0,
	УИДСтроки				= "",
	ФормаОплаты				= Неопределено,
	УстанавливатьКартинку   = Истина,
	НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль = Ложь,
	НеУстанавливатьКартинкуВопрос						= Ложь,
	ВидВзаиморасчетов									= Неопределено,
	ТипСравненияВидВзаиморасчетов                       = "Равно"
	) Экспорт
	
	эу.Доступность = Доступность; 
	Если Доступность Тогда
		СуммаФакт =0 ;
		эу.СписокВыбора = Документы.уб_ВзаиморасчетСПоставщиком.ПолучитьСписокВзаиморасчетов(Объект.Ссылка, СуммаФакт, УИДСтроки, ФормаОплаты, ВидВзаиморасчетов, ТипСравненияВидВзаиморасчетов);
		УстановитьПараметрыОтображенияПлатежа(эу, СуммаФакт < СуммаТребуемая, УстанавливатьКартинку, НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль, СуммаТребуемая, НеУстанавливатьКартинкуВопрос);//Иконка и кнопки выбора
		Попытка
			Если СуммаФакт < СуммаТребуемая Тогда
				эу.Подсказка = "Сквитовано: " + Формат(СуммаФакт,"ЧЦ=15; ЧДЦ=2")+ " Остаток для квитовки = " + Формат(СуммаТребуемая-СуммаФакт,"ЧЦ=15; ЧДЦ=2");
			Иначе
				эу.Подсказка = "Поле для квитовки поступивших/выданных безналичных платежей";
			КонецЕсли;
		Исключение
			//На всякий случай
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отсутствует свойство 'Подсказка' у поля "+эу.Имя; 
			Сообщение.Сообщить();
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура УстановитьПараметрыОтображенияПлатежа(
	эу, 
	СуммыНеРавны 										= Ложь, 
	УстанавливатьКартинку 								= Истина, 
	НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль = Ложь, 
	СуммаТребуемая 										= 0, 
	НеУстанавливатьКартинкуВопрос						= Ложь
	) Экспорт
	
	Если эу.СписокВыбора.Количество() = 0 Тогда
		Если УстанавливатьКартинку Тогда
			Если НеУстанавливатьКартинкуВопрос Или (НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль И СуммаТребуемая = 0) Тогда
				эу.Картинка = Новый Картинка;
			Иначе
				эу.Картинка	= БиблиотекаКартинок.уб_ОплатаВопрос;
			КонецЕсли;
		КонецЕсли;
		эу.КнопкаВыбора   = Истина;
		эу.КнопкаСпискаВыбора = Ложь;
	Иначе
		Если УстанавливатьКартинку Тогда
			эу.Картинка	= ?(СуммыНеРавны = Ложь,БиблиотекаКартинок.уб_ОплатаОК, БиблиотекаКартинок.уб_ОплаченоЧастично);
		КонецЕсли;
		эу.КнопкаВыбора   = СуммыНеРавны;
		эу.КнопкаСпискаВыбора = Истина;
	КонецЕсли;	
    эу.КартинкаКнопкиВыбора = БиблиотекаКартинок.уб_Подсоединить_;
	
КонецПроцедуры

Процедура ОткрытьИзСпискаВыбора(Элемент, Форма) Экспорт
	
	выбЭлемент = Форма.ВыбратьИзМеню(Элемент.СписокВыбора,Элемент);
	Если выбЭлемент <> Неопределено Тогда
		Попытка
			выбЭлемент.Значение.ПолучитьФорму().Открыть();
		Исключение
			Сообщить("Не подходящий объект для открытия " + ТипЗнч(выбЭлемент.Значение));
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура НастройкаОтраженияВзаиморасчетов(Параметры) Экспорт

	Если Параметры.ОбрабатыватьПоле Тогда
		СписокВзаиморасчетов(Параметры);
		Если Параметры.Поле <> Неопределено Тогда
			Поле = Параметры.Поле;
			Поле.КнопкаВыбора 			= Параметры.ТребуемаяСумма <> 0 И Параметры.ДокументРазблокирован Или Параметры.СуммаПодвязано <> 0;
			Поле.РедактированиеТекста   = Параметры.ДокументРазблокирован;
			Картинка = Новый Картинка;
			СуммыНеРавны = Параметры.СуммаПодвязано < Параметры.ТребуемаяСумма;
			Если Параметры.СписокВзаиморасчетов.Количество() = 0 Тогда
				Если Не Параметры.НеУстанавливатьКартинку Тогда
					Если Не (Параметры.НеУстанавливатьКартинкуВопрос Или (Параметры.НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль И Параметры.ТребуемаяСумма = 0)) Тогда
						Картинка = БиблиотекаКартинок.уб_ОплатаВопрос;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не Параметры.НеУстанавливатьКартинку Тогда
					Картинка = ?(СуммыНеРавны, БиблиотекаКартинок.уб_ОплаченоЧастично, БиблиотекаКартинок.уб_ОплатаОК);
				КонецЕсли;
			КонецЕсли;
			Параметры.СписокВыбора = Параметры.СписокВзаиморасчетов.Скопировать();
			КартинкаКнопкиВыбора = БиблиотекаКартинок.уб_СписокВыбора;
			Если СуммыНеРавны Тогда
				Если Параметры.ДокументРазблокирован Тогда
					Параметры.СписокВыбора.Вставить(0, Документы.уб_ВзаиморасчетСПоставщиком.ПустаяСсылка(), "Подвязать взаиморасчет",, БиблиотекаКартинок.уб_Подсоединить_);
				КонецЕсли;
				Если Параметры.СуммаПодвязано = 0 Тогда
					КартинкаКнопкиВыбора = БиблиотекаКартинок.уб_Подсоединить_;
				КонецЕсли;
			КонецЕсли;
			Поле.КартинкаКнопкиВыбора   = КартинкаКнопкиВыбора;
			Поле.СписокВыбора 			= Параметры.СписокВыбора;
			Поле.Картинка 				= Картинка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// параметры - структура
// Ссылка
// ФормаОплаты
// ВидВзаиморасчетов
// параметр-результат СуммаПодвязано
Функция СписокВзаиморасчетов(ПараметрыИлиСсылка) Экспорт

	Результат = Новый СписокЗначений;
	Если ТипЗнч(ПараметрыИлиСсылка) <> Тип("Структура") Тогда
		Ссылка = ПараметрыИлиСсылка;
		Параметры = Новый Структура;
		Параметры.Вставить("Ссылка", Ссылка);
		ИзменятьПараметр = Ложь;
	Иначе
		Параметры = ПараметрыИлиСсылка;
		ИзменятьПараметр = Истина;
	КонецЕсли;
	Если Параметры.Свойство("Ссылка") И ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Привязано = 0;
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Вз.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(Вз.Ссылка) КАК ВзаиморасчетСтрока,
		|	Вз.Сумма КАК ВзаиморасчетСумма,
		|	Вз.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Вз.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	Вз.Ссылка.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(Вз.Ссылка.ФормаОплаты) КАК ФормаОплатыСтрока
		|ИЗ
		|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Вз
		|ГДЕ
		|	Вз.ОтчетПоставщику = &ОтчетПоставщику
		|	И Вз.УИДСтроки = &УИДСтроки
		|	И &УсловиеГде";
		УсловиеГде = "ИСТИНА";
		ПараметрУстановлен = Ложь;
		Если Параметры.Свойство("ФормаОплаты") И ЗначениеЗаполнено(Параметры.ФормаОплаты) Тогда
			ФормаОплаты = Параметры.ФормаОплаты;
			Если ТипЗнч(ФормаОплаты) <> Тип("ПеречислениеСсылка.уб_ФормаОплатыВзаиморасчеты") Тогда
				Если ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
					УсловиеГде = "Вз.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)";
					ПараметрУстановлен = Истина;
				Иначе
					ФормаОплаты = КонверторПеречисленийФормыОплаты(ФормаОплаты);
				КонецЕсли;
			КонецЕсли;
			Если Не ПараметрУстановлен И ЗначениеЗаполнено(ФормаОплаты) Тогда
				УсловиеГде = "Вз.Ссылка.ФормаОплаты = &ФормаОплаты 
				|	И НЕ Вз.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)";
				Запрос.УстановитьПараметр("ФормаОплаты", ФормаОплаты);
			КонецЕсли;
		ИначеЕсли Параметры.Свойство("ВидВзаиморасчетов") И Параметры.ВидВзаиморасчетов <> Неопределено Тогда
			Если Параметры.Свойство("ВидСравненияВидВзаиморасчетов") И Параметры.ВидСравненияВидВзаиморасчетов = ВидСравнения.НеРавно Тогда
				УсловиеГде = УсловиеГде + " И НЕ Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
			Иначе
				УсловиеГде = УсловиеГде + " И Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
			КонецЕсли;
			Запрос.УстановитьПараметр("НаправлениеРасчетов", Параметры.ВидВзаиморасчетов);
		КонецЕсли;
		УИДСтроки = "";
		Если Параметры.Свойство("УИДСтроки") Тогда
			УИДСтроки = Параметры.УИДСтроки;
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
		Запрос.УстановитьПараметр("ОтчетПоставщику", 	Параметры.Ссылка);
		Запрос.УстановитьПараметр("УИДСтроки",			УИДСтроки);
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(
				Выборка.Ссылка,
				ПредставлениеСтрокиСпискаВыбораКвитовкиПлатежа(Выборка)
			);
			//Результат = Выборка.Ссылка;
			Привязано = Привязано + Выборка.ВзаиморасчетСумма;
		КонецЦикла;
		Если Не Параметры.Свойство("СуммаПодвязано") Тогда
			Параметры.Вставить("СуммаПодвязано");
		КонецЕсли;
		Параметры.СуммаПодвязано 		= Привязано;
		Параметры.СписокВзаиморасчетов 	= Результат;
	КонецЕсли;
	Если ИзменятьПараметр Тогда
		ПараметрыИлиСсылка = Параметры
	КонецЕсли;
	Возврат Результат;

КонецФункции // СписокВзаиморасчетов()

Функция СтруктураНастроекПоляКвитовки() Экспорт

	Параметры = Новый Структура;
	// входящие параметры расчетов
	Параметры.Вставить("Ссылка");
	Параметры.Вставить("ТребуемаяСумма", 				0);
	Параметры.Вставить("УИДСтроки",						""); // не актуально
	Параметры.Вставить("ФормаОплаты");
	Параметры.Вставить("ВидВзаиморасчетов");
	Параметры.Вставить("ВидСравненияВидВзаиморасчетов", ВидСравнения.Равно);
	// входящие параметры отображения поля
	Параметры.Вставить("Поле");
	Параметры.Вставить("НеУстанавливатьКартинку", 								Ложь);
	Параметры.Вставить("НеУстанавливатьКартинкуВопросЕслиСуммаТребуемаяНоль",	Ложь);
	Параметры.Вставить("НеУстанавливатьКартинкуВопрос",							Ложь);
	Параметры.Вставить("ОбрабатыватьПоле",										Не ПараметрыСеанса.уб_ЭтоМенеджер);
	Параметры.Вставить("ДокументРазблокирован",									Ложь);
	// исходящие параметры
	Параметры.Вставить("СписокВзаиморасчетов", 	Новый СписокЗначений);
	Параметры.Вставить("СписокВыбора",			Новый СписокЗначений);
	Параметры.Вставить("СуммаПодвязано",		0);
	Возврат Параметры;

КонецФункции // СтруктураНастроекПоляКвитовки()


Функция НайтиИОбработатьБезналОтСтрахователя(Дата = Неопределено) Экспорт
	Если Дата = Неопределено Тогда
		Дата = Дата(2026,5,1);
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявки.Ссылка КАК Ссылка,
	               |	ПОДСТРОКА(Заявки.Страхователь.Наименование, 1, 6) КАК Наименование,
	               |	РАЗНОСТЬДАТ(&Дата, Заявки.Дата, ДЕНЬ) КАК Поле1,
	               |	Заявки.Страхователь КАК Страхователь
	               |ПОМЕСТИТЬ Заявки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(&Дата, Заявки.Дата, ДЕНЬ) > -20
	               |	И Заявки.Утверждено
	               |	И Заявки.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ВзаиморасчетСПоставщиком.Ссылка КАК Взаиморасчет,
	               |	уб_ВзаиморасчетСПоставщиком.Контрагент КАК Контрагент,
	               |	ПОДСТРОКА(уб_ВзаиморасчетСПоставщиком.ПоставщикСтрока, 6, 40) КАК ФИО,
	               |	уб_ВзаиморасчетСПоставщиком.НераспределенныйОстаток КАК НераспределенныйОстаток,
	               |	уб_ВзаиморасчетСПоставщиком.ПоставщикСтрока КАК ПоставщикСтрока,
	               |	уб_ВзаиморасчетСПоставщиком.СуммаДокумента КАК СуммаДокумента,
	               |	Заявка.Страхователь КАК Страхователь,
	               |	Заявка.Ссылка КАК Заявка,
	               |	ЗаявкаБСО.ОрганизацияАгент КАК ОрганизацияАгент,
	               |	ЗаявкаБСО.ВидБСО КАК ВидБСО,
	               |	ЗаявкаБСО.УидСтроки КАК УидСтроки,
	               |	уб_ВзаиморасчетСПоставщиком.Номер КАК Номер,
	               |	уб_ВзаиморасчетСПоставщиком.Дата КАК Дата
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заявки КАК Заявка
	               |		ПО (ПОДСТРОКА(уб_ВзаиморасчетСПоставщиком.ПоставщикСтрока, 6, 6) = Заявка.Наименование)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК ЗаявкаБСО
	               |		ПО (ЗаявкаБСО.Ссылка = Заявка.Ссылка)
	               |			И (уб_ВзаиморасчетСПоставщиком.СуммаДокумента = ЗаявкаБСО.ИтогСтраховаяПремия - ЗаявкаБСО.ИтогПредоставленнаяСкидка)
	               |			И (НЕ ЗаявкаБСО.Состояние = ЗНАЧЕНИЕ(Перечисление.уб_СостояниеОформления.Отказ))
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(&Дата, уб_ВзаиморасчетСПоставщиком.Дата, ДЕНЬ) > -20
	               |	И уб_ВзаиморасчетСПоставщиком.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу)
	               |	И уб_ВзаиморасчетСПоставщиком.ПоставщикСтрока ПОДОБНО ""ИНН%""
	               |	И уб_ВзаиморасчетСПоставщиком.НераспределенныйОстаток > 0
	               |	И ЗаявкаБСО.НомерБСО <> """"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_ВзаиморасчетСПоставщиком.Дата";
	Данные = Запрос.Выполнить().Выбрать();
	Пока Данные.Следующий() Цикл
		ОбработатьСтрокуВзаиморасчетаСЗаявкой(Данные);
		//Прервать;
	КонецЦикла;	
				   
КонецФункции	

Процедура ОбработатьСтрокуВзаиморасчетаСЗаявкой(Строка)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.КлючДанных = Строка.Взаиморасчет;
	Сообщение.Текст = "Обрабатываем "+ Строка.Взаиморасчет;
	Сообщение.Сообщить();
	//ставим флаг приняты деньги
	ДокументОбъект = Строка.Заявка.ПолучитьОбъект();
	нСтроки = ДокументОбъект.БСО.НайтиСтроки(Новый Структура("ВидБСО,УидСтроки",Строка.ВидБСО,Строка.УидСтроки));
	ЕстьПравки = Ложь;
	Для каждого СтрокаЗаявки из нСтроки Цикл
		Если СтрокаЗаявки.ПринятыДеньги = ЛОЖЬ Тогда
			СтрокаЗаявки.ПринятыДеньги = Истина;
			СтрокаЗаявки.ФормаОплатыСтрока = Перечисления.уб_ФормыОплаты.ПоQR;
			ЕстьПравки = Истина;
		КонецЕсли;	
		Прервать;
	КонецЦикла;	 
	Если ЕстьПравки = Истина Тогда
		ДокументОбъект.Записать();
	КонецЕсли;	
	КэшПриемок = Новый Соответствие;
	ОбъектПриемки = Документы.уб_ПриемкаОплат.СоздатьПриемкуКЗаявке(ДокументОбъект.Ссылка,КэшПриемок,Строка.Взаиморасчет);
	
	Если типзнч(ОбъектПриемки) = Тип("ДокументОбъект.уб_ПриемкаОплат") Тогда
		ОбъектПриемки.Записать(РежимЗаписиДокумента.Проведение);
		Если Документы.уб_ВзаиморасчетСПоставщиком.ПривязатьДокумент(Строка.Взаиморасчет, ОбъектПриемки.Ссылка, Строка.СуммаДокумента, Истина) Тогда
			Документы.уб_ПриемкаОплат.СоздатьПолисыКПриемке(ОбъектПриемки.Ссылка,,ИСТИНА);
			ВзаиморасчетОбъект = Строка.Взаиморасчет.ПолучитьОбъект();
			ВзаиморасчетОбъект.Контрагент = Строка.Страхователь; 
			ВзаиморасчетОбъект.Записать();
			
		КонецЕсли;
		//
		ПривязатьПечатнуюФормуКЗаявке(Строка,ДокументОбъект);
	КонецЕсли;	
КонецПроцедуры	

Процедура ПривязатьПечатнуюФормуКЗаявке(Строка,ДокументОбъект)
	ТабличныйДокумент = ПечатнаяФорма(Строка.Взаиморасчет);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
	ИмяФайла = СтрЗаменить(ИмяФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяФайла,"\"),Строка.Номер+Формат(Строка.Дата,"ДФ=yyyy-MM-dd")+".pdf");
	ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(74);
	уб_ВызовСервера.ДобавитьФайлКЗаявке(ДокументОбъект,Новый Структура("УидСтроки,ПолноеИмяФайла,ВидДокумента",Строка.УидСтроки,ИмяФайла,ВидДокумента));
КонецПроцедуры

Функция ПечатнаяФорма(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ВзаиморасчетСПоставщиком.Ссылка КАК Ссылка,
	               |	уб_ВзаиморасчетСПоставщиком.НомерВходящегоДокумента КАК Номер,
	               |	Выбор когда уб_ВзаиморасчетСПоставщиком.ДатаВходящегоДокумента = ДатаВремя(1,1,1) тогда дата   иначе уб_ВзаиморасчетСПоставщиком.ДатаВходящегоДокумента Конец КАК Дата,
	               |	уб_ВзаиморасчетСПоставщиком.Комментарий КАК Комментарий,
	               |	уб_ВзаиморасчетСПоставщиком.Поставщик КАК Поставщик,
	               |	уб_ВзаиморасчетСПоставщиком.Контрагент КАК Контрагент,
	               |	уб_ВзаиморасчетСПоставщиком.СуммаДокумента КАК СуммаДокумента,
	               |	уб_ВзаиморасчетСПоставщиком.Категория КАК Категория,
	               |	уб_ВзаиморасчетСПоставщиком.ФормаОплаты КАК ФормаОплаты,
	               |	уб_ВзаиморасчетСПоставщикомРаспределение.ОтчетПоставщику КАК ОтчетПоставщику,
	               |	уб_ВзаиморасчетСПоставщиком.ПоставщикСтрока КАК ПоставщикСтрока
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК уб_ВзаиморасчетСПоставщикомРаспределение
	               |		ПО (уб_ВзаиморасчетСПоставщикомРаспределение.Ссылка = уб_ВзаиморасчетСПоставщиком.Ссылка)
	               |ГДЕ
	               |	уб_ВзаиморасчетСПоставщиком.Ссылка = &Ссылка
	               |	И уб_ВзаиморасчетСПоставщикомРаспределение.НомерСтроки = 1";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Макет = Документы.уб_ВзаиморасчетСПоставщиком.ПолучитьМакет("ПлатежноеПоручение");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область = Макет.ПолучитьОбласть("Секция");
		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.Заполнить(Новый Структура("Дата",Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")));
		ТабличныйДокумент.РазмерСтраницы = "A5";
		ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.ЭкземпляровНаСтранице=1;
		ТабличныйДокумент.Автомасштаб=истина;
		ТабличныйДокумент.Вывести(Область);
		Возврат ТабличныйДокумент
	КонецЕсли;	
	
КонецФункции	