
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ИсключитьИзВзаиморасчетов ИЛИ НЕ ЗначениеЗаполнено(Поставщик) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗНЧ(Контрагент)=тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Контрагент.ДатаВеденияВзаиморасчётов) Тогда
		Если Дата<Контрагент.ДатаВеденияВзаиморасчётов Тогда
			//Документы загружены, но движений не делают
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	Если СуммаДокумента=0 Тогда
		Возврат;
	КонецЕсли;	
	
	ВидНаправления = Перечисления.уб_ВидОперацииВзаиморасчетов;
	Если НаправлениеРасчетов = ВидНаправления.ПеречислениеПоставщику Тогда
			Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
			Движение.Активность  = Истина;
			Движение.Валюта      = ВалютаДокумента;
			Движение.ВидДвижения = ВидДВиженияНакопления.Расход;
			Движение.Контрагент  = Контрагент;
			Движение.ОрганизацияАгент = ОрганизацияАгент;
			Движение.Описание    = "Оплата поставщику"+ ?(ФормаОплаты=Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,"по банку.","через кассу.");
			Движение.Период      = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Сумма       = СуммаДокумента;
			Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	ИначеЕсли НаправлениеРасчетов = ВидНаправления.ПоступлениеКВОтПоставщика Тогда
			Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
			Движение.Активность  = Истина;
			Движение.Валюта      = ВалютаДокумента;
			Движение.ВидДвижения = ВидДВиженияНакопления.Расход;
			Движение.Контрагент  = Контрагент;
			Движение.ОрганизацияАгент = ОрганизацияАгент;
			Движение.Описание    = "Оплата поставщиком КВ"+ ?(ФормаОплаты=Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,"по банку.","через кассу.");
			Движение.Период      = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Сумма       = 0;
			Движение.СуммаКВ     = СуммаДокумента;
			Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	//ИначеЕсли НаправлениеРасчетов = ВидНаправления.НачальныйОстаток Тогда
	//		Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
	//		Движение.Активность  = Истина;
	//		Движение.Валюта      = ВалютаДокумента;
	//		Движение.ВидДвижения = ВидДВиженияНакопления.Приход;
	//		Движение.Контрагент  = Поставщик;
	//		Движение.ОрганизацияАгент = ОрганизацияАгент;
	//		Движение.Описание    = "Начальный остаток";
	//		Движение.Период      = Дата;
	//		Движение.Регистратор = Ссылка;
	//		Движение.Сумма       = СуммаДокумента;
	//		Движение.СуммаКВ     = 0;
	//		Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	//ИначеЕсли НаправлениеРасчетов = ВидНаправления.НачальныйОстатокПоКВ Тогда
	//		Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
	//		Движение.Активность  = Истина;
	//		Движение.Валюта      = ВалютаДокумента;
	//		Движение.ВидДвижения = ВидДВиженияНакопления.Приход;
	//		Движение.Контрагент  = Поставщик;
	//		Движение.ОрганизацияАгент = ОрганизацияАгент;
	//		Движение.Описание    = "Начальный остаток по КВ";
	//		Движение.Период      = Дата;
	//		Движение.Регистратор = Ссылка;
	//		Движение.Сумма       = 0;
	//		Движение.СуммаКВ     = СуммаДокумента;
	//		Движение.Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	//		
	//ИначеЕсли НаправлениеРасчетов = ВидНаправления.КорректировкаКатегорииПоКВ Тогда
	//		Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
	//		Движение.Активность  = Истина;
	//		Движение.Валюта      = ВалютаДокумента;
	//		Движение.ВидДвижения = ВидДВиженияНакопления.Приход;
	//		Движение.Контрагент  = Поставщик;
	//		Движение.ОрганизацияАгент = ОрганизацияАгент;
	//		Движение.Описание    = "Коррректировка категории по КВ";
	//		Движение.Период      = Дата;
	//		Движение.Регистратор = Ссылка;
	//		Движение.Сумма       = 0;
	//		Движение.СуммаКВ     = СуммаДокумента;
	//		Движение.Категория = Категория;
	//ИначеЕсли НаправлениеРасчетов = ВидНаправления.КорректировкаКатегорииПоОсновнойСумме Тогда
	//		Движение = Движения.уб_РасчетыСПоставщиками.Добавить();
	//		Движение.Активность  = Истина;
	//		Движение.Валюта      = ВалютаДокумента;
	//		Движение.ВидДвижения = ВидДВиженияНакопления.Приход;
	//		Движение.Контрагент  = Поставщик;
	//		Движение.ОрганизацияАгент = ОрганизацияАгент;
	//		Движение.Описание    = "Коррректировка категории";
	//		Движение.Период      = Дата;
	//		Движение.Регистратор = Ссылка;
	//		Движение.Сумма       = СуммаДокумента;
	//		Движение.СуммаКВ     = 0;
	//		Движение.Категория = Категория;
	КонецЕсли;	
	//
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = НЕ ПравоДоступа("ОтменаПроведения", Метаданные());
	Возврат;	
	
КонецПроцедуры

Функция ПроверкаЗаполнения()
	Статус = СтатусСообщения.Важное;	
	
	Рез = Истина;
	
	Если ЗначениеНеЗаполнено(Номер) Тогда 
		УстановитьНовыйНомер();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда 
		Если Не Проведен Тогда
			oАг = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
			Если oАг <> Неопределено Тогда
				Организация = oАг;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда 
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не заполнено поле 'Организация'!");
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если Ответственный.Пустая() Тогда 
		Если Не Проведен Тогда
			Ответственный = уб_СС.ПолучитьФИНОтветственного();
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(Ответственный) Тогда 
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не заполнено поле 'Ответственный'!");
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	
	Возврат Рез;	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	IDизБухДок="";
	ДокументБух="";
	НеИзменятьПриЗагрузке = ложь;  
	ИсключитьИзВзаиморасчетов =ложь;
	Если ДанныеЗаполнения=Неопределено Тогда
		//Тип("ДокументСсылка.уб_ВзаиморасчетСПоставщиком") 
		//Ввод нового
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НаправлениеРасчетов = Перечисления.уб_ВидОперацииВзаиморасчетов.Корректировка Тогда
	ИначеЕсли НЕ Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят Тогда
		Категория = Перечисления.уб_КатегорияЗадолженности.ОтчетПоставщикуПринят;
	КонецЕсли;
	Разница = СуммаДокумента - Распределение.Итог("Сумма");
	Если НЕ Разница = 0 Тогда
		ОтразитьРазницуВПустоте(Разница);
	КонецЕсли;	
	//Удаление нулевых строк
	МассивСтрок = Распределение.НайтиСтроки(Новый Структура("Сумма",0));
	ВсегоСтрок = МассивСтрок.Количество();
	Для СчетчикСтрок = 1 ПО ВсегоСтрок Цикл
		Распределение.Удалить(МассивСтрок[ВсегоСтрок-1]);
	КонецЦикла;	
	
	СписокПустыхСтрокРаспределения = Распределение.Выгрузить(Новый Структура("ОтчетПоставщику",Документы.уб_ОтчетПоставщику.ПустаяСсылка()), "Сумма");
	НераспределенныйОстаток = СписокПустыхСтрокРаспределения.Итог("Сумма");
	Если СписокПустыхСтрокРаспределения.Количество() > 0 И НераспределенныйОстаток = 0 Тогда
		//Удаление полностью "пустой" строки
		МассивСтрок = Распределение.НайтиСтроки(Новый Структура("ОтчетПоставщику",Документы.уб_ОтчетПоставщику.ПустаяСсылка()));
		ВсегоСтрок = МассивСтрок.Количество();
		Для СчетчикСтрок = 1 ПО ВсегоСтрок Цикл
			Распределение.Удалить(МассивСтрок[ВсегоСтрок-1]);
		КонецЦикла;	
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ОтразитьРазницуВПустоте(Разница)
	
	Если Разница <> 0 Тогда
		ТЧ = Распределение.Выгрузить();
		Строка = ТЧ.Добавить();
		Строка.ОтчетПоставщику = Документы.уб_ОтчетПоставщику.ПустаяСсылка();
		Строка.Сумма = Разница;
		ТЧ.Свернуть("ОтчетПоставщику,Уточнение","Сумма");
		Распределение.Загрузить(ТЧ);
	Конецесли;
	
КонецПроцедуры	
