


Функция ОП_ПолучитьТЗОплат() Экспорт
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	О.*,
	               |	О.Дата КАК Период
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК О
	               |ГДЕ
	               |	О.ОтчетАгента = &ОтчетАгента
				   |    И НЕ О.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("ОтчетАгента", ?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка));
	ТЗОплат = Запрос.Выполнить().Выгрузить();
	Возврат ТЗОплат;
КонецФункции

Процедура ПодборГраницПериодаОтчета() Экспорт
	ТЗОплат = ОП_ПолучитьТЗОплат();
	
	Если ЗначениеНеЗаполнено(НачОтчетПериод) Тогда	
		НачОтчетПериод = ДобавитьМесяц(Дата, -1); 
	КонецЕсли;	
	Если ЗначениеНеЗаполнено(КонОтчетПериод) Тогда	
		КонОтчетПериод = Дата;
	КонецЕсли;	
	
	Для Каждого оОплата из ТЗОплат Цикл
		Если оОплата.Дата < НачОтчетПериод Тогда
			НачОтчетПериод = оОплата.Дата;
		КонецЕсли;	
		Если оОплата.Дата > КонОтчетПериод Тогда
			КонОтчетПериод = оОплата.Дата;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Функция ПроверкаЗаполнения()
	Статус = СтатусСообщения.Важное;	
	
	Рез = Истина;
	
	Если ЗначениеНеЗаполнено(Номер) Тогда 
		УстановитьНовыйНомер();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(НачОтчетПериод) ИЛИ ЗначениеНеЗаполнено(КонОтчетПериод) Тогда 
		ПодборГраницПериодаОтчета();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(Агент) Тогда 
		Если Не Проведен Тогда
			oАг = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
			Если oАг <> Неопределено Тогда
				Агент = oАг;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(Агент) Тогда 
			Сообщить("Не заполнено поле 'Агент'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если ОтветственныйБСО.Пустая() Тогда 
		Если Не Проведен Тогда
			МОЛпоБСО = уб_КЭШируемые.ПолучитьМОЛпоБСОДляПользователя(ПараметрыСеанса.ТекущийПользователь);
			Если МОЛпоБСО <> Неопределено Тогда
				ОтветственныйБСО = МОЛпоБСО;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОтветственныйБСО) Тогда 
			Сообщить("Не заполнено поле 'ОтветственныйБСО'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 

	Если ОтветственныйФинансы.Пустая() Тогда 
		Если Не Проведен Тогда
			ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОтветственныйФинансы) Тогда 
			Сообщить("Не заполнено поле 'Фин. Ответственный'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 

	
	Возврат Рез;	
КонецФункции

Процедура ОбновитьКоличествоСтрокОплат() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК Кол
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	               |ГДЕ
	               |	уб_ОплатаПолисов.ОтчетАгента = &ОтчетАгента
	               |	И НЕ уб_ОплатаПолисов.ПометкаУдаления";
	Запрос.УстановитьПараметр("ОтчетАгента", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Кол = Выборка.Кол;
	Если КоличествоСтрокОплат <> Кол Тогда
		КоличествоСтрокОплат = Кол;	
	КонецЕсли;
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//SS TODO При проведении проверять, проведены ли квитанции.
// Если не проведены - отказ и уведомление, что надо сначала провести соответствующий страховой полис.


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПравоПроведенияОА = ПравоДоступа("Проведение", Метаданные());

	ДокументОК = ПроверкаЗаполнения();
	
	Отказ = НЕ (ДокументОК И ПравоПроведенияОА);
	
	Возврат;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = НЕ ПравоДоступа("ОтменаПроведения", Метаданные());
	Возврат;	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Клиент Тогда
	Оповестить("ПриЗаписиОтчетаАгента", Проведен, ЭтотОбъект);
	#КонецЕсли
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКоличествоСтрокОплат();

КонецПроцедуры
  