
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресТаблицыЗначений") Тогда
		ИнициализироватьТаблицу(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыЗначений));
		Если Параметры.Свойство("ТолькоПросмотр") Тогда
			Элементы.ТаблицаЗначений.ТолькоПросмотр = Истина;
			ЭтаФорма.ЗакрыватьПриВыборе = Истина;
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицу(ТаблицаЗначенийИсходная)
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаЗначений", Новый ОписаниеТипов("ТаблицаЗначений")));
	
	Для Каждого Колонка Из ТаблицаЗначенийИсходная.Колонки Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаЗначений"));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);      
	
	ЭлементТаблица = Элементы.Добавить("ТаблицаЗначений", Тип("ТаблицаФормы"));
	ЭлементТаблица.ПутьКДанным = "ТаблицаЗначений";
	ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	ЭлементТаблица.УстановитьДействие("Выбор","Выбор");
	
	Для Каждого Колонка Из ТаблицаЗначенийИсходная.Колонки Цикл
		ЭлементКолонка = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ЭлементТаблица);       
		ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКолонка.ПутьКДанным = "ТаблицаЗначений." + Колонка.Имя;
		ЭлементКолонка.Ширина = 10;
	КонецЦикла;
	ЭтаФорма.ТаблицаЗначений.Загрузить(ТаблицаЗначенийИсходная);
	
КонецПроцедуры	

&НаКлиенте
Процедура Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтаФорма.ЗакрыватьПриВыборе = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Структура = Новый Структура;
		Данные =  Элементы.ТаблицаЗначений.ТекущиеДанные;
		Для каждого Поле из Элементы.ТаблицаЗначений.ПодчиненныеЭлементы Цикл
			Структура.Вставить(Поле.Имя,Данные[Поле.Имя]);
		КонецЦикла;	
		ОповеститьОвыборе(Структура);
		
	КонецЕсли;	
КонецПроцедуры	
	