Функция ПолучитьДанные(Объект, Прочерки = Истина) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТС.РегистрационныйЗнак КАК ОбъектСтрахованияРегистрационныйЗнак,
	|	ТС.ИдентификационныйНомер КАК ОбъектСтрахованияИдентификационныйНомер,
	|	ТС.МаркаТС КАК ОбъектСтрахованияМаркаТС,
	|	ТС.МодельТС КАК ОбъектСтрахованияМодельТС,
	|	ТС.ТипТС КАК ОбъектСтрахованияТипТС,
	|	ТС.Категория КАК ОбъектСтрахованияКатегория,
	|	ТС.ГодВыпуска КАК ОбъектСтрахованияГодВыпуска,
	|	ТС.ДвигательНомер КАК ОбъектСтрахованияДвигательНомер,
	|	ТС.ШассиНомер КАК ОбъектСтрахованияШассиНомер,
	|	ТС.КузовНомер КАК ОбъектСтрахованияКузовНомер,
	|	ТС.Цвет КАК ОбъектСтрахованияЦвет,
	|	ТС.МощностьДвигателя КАК ОбъектСтрахованияМощностьДвигателя,
	|	ТС.МаксМасса КАК ОбъектСтрахованияМаксМасса,
	|	ТС.КолПассажирскихМест КАК ОбъектСтрахованияКолПассажирскихМест,
	|	ТС.Грузоподъемность КАК ОбъектСтрахованияГрузоподъемность,
	|	ТС.ПротивоугоннаяСистема КАК ОбъектСтрахованияПротивоугоннаяСистема,
	|	ТС.ПаспортСерия КАК ОбъектСтрахованияПаспортСерия,
	|	ТС.ПаспортНомер КАК ОбъектСтрахованияПаспортНомер,
	|	ТС.ПаспортДатаВыдачи КАК ОбъектСтрахованияПаспортДатаВыдачи
	|ИЗ
	|	РегистрСведений.уб_ТранспортныеСредства КАК ТС
	|ГДЕ
	|	ТС.Объект = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	Данные = Новый Структура; //TODO начальная структура в зависимости от типа объекта страхования
	Если Выборка.Следующий() Тогда
		Данные.Вставить("ОбъектСтрахованияРегистрационныйЗнак",     Выборка.ОбъектСтрахованияРегистрационныйЗнак);
		Данные.Вставить("ОбъектСтрахованияИдентификационныйНомер",  Выборка.ОбъектСтрахованияИдентификационныйНомер);
		Данные.Вставить("ОбъектСтрахованияМаркаТС",     			Выборка.ОбъектСтрахованияМаркаТС);
		Данные.Вставить("ОбъектСтрахованияМодельТС",     			Выборка.ОбъектСтрахованияМодельТС);
		Данные.Вставить("ОбъектСтрахованияТипТС",     				Выборка.ОбъектСтрахованияТипТС);
		Данные.Вставить("ОбъектСтрахованияКатегория",     			Выборка.ОбъектСтрахованияКатегория);
		Данные.Вставить("ОбъектСтрахованияГодВыпуска",     			Выборка.ОбъектСтрахованияГодВыпуска);
		Данные.Вставить("ОбъектСтрахованияДвигательНомер",    		Выборка.ОбъектСтрахованияДвигательНомер);
		Данные.Вставить("ОбъектСтрахованияШассиНомер",     			Выборка.ОбъектСтрахованияШассиНомер);
		Данные.Вставить("ОбъектСтрахованияКузовНомер",     			Выборка.ОбъектСтрахованияКузовНомер);
		Данные.Вставить("ОбъектСтрахованияЦвет",     				Выборка.ОбъектСтрахованияЦвет);
		Данные.Вставить("ОбъектСтрахованияМощностьДвигателя",     	Выборка.ОбъектСтрахованияМощностьДвигателя);
		Данные.Вставить("ОбъектСтрахованияМаксМасса",     			Выборка.ОбъектСтрахованияМаксМасса);
		Данные.Вставить("ОбъектСтрахованияКолПассажирскихМест",     Выборка.ОбъектСтрахованияКолПассажирскихМест);
		Данные.Вставить("ОбъектСтрахованияГрузоподъемность",     	Выборка.ОбъектСтрахованияГрузоподъемность);
		Данные.Вставить("ОбъектСтрахованияПротивоугоннаяСистема",   Выборка.ОбъектСтрахованияПротивоугоннаяСистема);
		Данные.Вставить("ОбъектСтрахованияПаспортСерия",    	 	Выборка.ОбъектСтрахованияПаспортСерия);
		Данные.Вставить("ОбъектСтрахованияПаспортНомер",     		Выборка.ОбъектСтрахованияПаспортНомер);
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачи",     	Выборка.ОбъектСтрахованияПаспортДатаВыдачи);
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиДень",	Выборка.ОбъектСтрахованияПаспортДатаВыдачи);
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиМесяц",	Выборка.ОбъектСтрахованияПаспортДатаВыдачи);
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиГод",	Выборка.ОбъектСтрахованияПаспортДатаВыдачи);
		Данные.Вставить("ОбъектСтрахованияПредставление",			СокрЛП(Строка(Выборка.ОбъектСтрахованияМаркаТС) + " " + Выборка.ОбъектСтрахованияМодельТС));
	Иначе
		Данные.Вставить("ОбъектСтрахованияРегистрационныйЗнак",     "");
		Данные.Вставить("ОбъектСтрахованияИдентификационныйНомер",  "");
		Данные.Вставить("ОбъектСтрахованияМаркаТС",     			"");
		Данные.Вставить("ОбъектСтрахованияМодельТС",     			"");
		Данные.Вставить("ОбъектСтрахованияТипТС",     				"");
		Данные.Вставить("ОбъектСтрахованияКатегория",     			"");
		Данные.Вставить("ОбъектСтрахованияГодВыпуска",     			0);
		Данные.Вставить("ОбъектСтрахованияДвигательНомер",    		"");
		Данные.Вставить("ОбъектСтрахованияШассиНомер",     			"");
		Данные.Вставить("ОбъектСтрахованияКузовНомер",     			"");
		Данные.Вставить("ОбъектСтрахованияЦвет",     				"");
		Данные.Вставить("ОбъектСтрахованияМощностьДвигателя",     	0);
		Данные.Вставить("ОбъектСтрахованияМаксМасса",     			0);
		Данные.Вставить("ОбъектСтрахованияКолПассажирскихМест",     0);
		Данные.Вставить("ОбъектСтрахованияГрузоподъемность",     	0);
		Данные.Вставить("ОбъектСтрахованияПротивоугоннаяСистема",   "");
		Данные.Вставить("ОбъектСтрахованияПаспортСерия",    	 	"");
		Данные.Вставить("ОбъектСтрахованияПаспортНомер",     		"");
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачи",     	Дата(1,1,1));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиДень",	Дата(1,1,1));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиМесяц",	Дата(1,1,1));
		Данные.Вставить("ОбъектСтрахованияПаспортДатаВыдачиГод",	Дата(1,1,1));
		Данные.Вставить("ОбъектСтрахованияПредставление",			"Не указано");
	КонецЕсли;
	Возврат Данные;
	
КонецФункции	



//ППС 30-07-2014                                                         
Функция ПолучитьМаркуАвтоПоVINНомеру(VINНомер, КакМассив = Ложь) Экспорт
	
	WMI = СокрЛП(VINНомер);
	
	Если СтрДлина(WMI) >= 3 Тогда
		
		WMI = Лев(WMI, 3);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ТранспортныеСредства.МаркаТС КАК МаркаТС
		|ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		|ГДЕ
		|	ПОДСТРОКА(уб_ТранспортныеСредства.ИдентификационныйНомер, 1, 3) = &WMI
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаркаТС";
		
		Запрос.УстановитьПараметр("WMI", WMI);

		МассивМарокАвто = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаркаТС");
	Иначе
		МассивМарокАвто = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивМарокАвто;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивМарокАвто);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьМодельныйГодАвтоПоVINНомеру(VINНомер, КакМассив = Ложь) Экспорт
	
	МодельныйГод = СокрЛП(VINНомер);
	
	Если СтрДлина(МодельныйГод) >= 10 Тогда
		
		МодельныйГод = Сред(МодельныйГод, 10, 1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ТранспортныеСредства.ГодВыпуска КАК ГодВыпуска
		|ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		|ГДЕ
		|	уб_ТранспортныеСредства.ГодВыпуска > 1900
		|	И ПОДСТРОКА(уб_ТранспортныеСредства.ИдентификационныйНомер, 10, 1) = &МодельныйГод
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГодВыпуска";
		
		Запрос.УстановитьПараметр("МодельныйГод", МодельныйГод);

		МассивГодВыпускаАвто = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГодВыпуска");
	Иначе
		МассивГодВыпускаАвто = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивГодВыпускаАвто;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивГодВыпускаАвто);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции
//ППС 30-07-2014

//ППС 31-07-2014
Функция ПолучитьМощностьДвигателя(МаркаТС, МодельТС, кВт = Ложь, КакМассив = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(МаркаТС) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ";
		
		Если кВт Тогда
			Запрос.Текст = Запрос.Текст + "	Выразить(уб_ТранспортныеСредства.МощностьДвигателя * 0.7355 КАК Число(10, 2)) КАК МощностьДвигателя ";
		Иначе
			Запрос.Текст = Запрос.Текст + "	уб_ТранспортныеСредства.МощностьДвигателя КАК МощностьДвигателя ";
		КонецЕсли;
	
	    Запрос.Текст = Запрос.Текст +
		" ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		| ГДЕ
		|	уб_ТранспортныеСредства.МаркаТС = &МаркаТС ";
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.Текст = Запрос.Текст + " И уб_ТранспортныеСредства.МодельТС = &МодельТС ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
		"	И МощностьДвигателя > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	МощностьДвигателя";
		
		Запрос.УстановитьПараметр("МаркаТС", МаркаТС);
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.УстановитьПараметр("МодельТС", МодельТС);
		КонецЕсли;
		
		МассивМощностьДвигателя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МощностьДвигателя");
	Иначе
		МассивМощностьДвигателя = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивМощностьДвигателя;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивМощностьДвигателя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
Функция ПолучитьМаксимальнуюМассу(МаркаТС, МодельТС, КакМассив = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(МаркаТС) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ТранспортныеСредства.МаксМасса КАК МаксимальнаяМасса
		|ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		|ГДЕ
		|	уб_ТранспортныеСредства.МаркаТС = &МаркаТС ";
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.Текст = Запрос.Текст + " И уб_ТранспортныеСредства.МодельТС = &МодельТС ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
		"	И уб_ТранспортныеСредства.МаксМасса > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаксимальнаяМасса";
		
		Запрос.УстановитьПараметр("МаркаТС", МаркаТС);
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.УстановитьПараметр("МодельТС", МодельТС);
		КонецЕсли;
		
		МассивМаксимальныхМасс = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаксимальнаяМасса");
	Иначе
		МассивМаксимальныхМасс = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивМаксимальныхМасс;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивМаксимальныхМасс);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьГрузоподъемность(МаркаТС, МодельТС, КакМассив = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(МаркаТС) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ТранспортныеСредства.Грузоподъемность КАК Грузоподъемность
		|ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		|ГДЕ
		|	уб_ТранспортныеСредства.МаркаТС = &МаркаТС ";
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.Текст = Запрос.Текст + " И уб_ТранспортныеСредства.МодельТС = &МодельТС ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
		"	И уб_ТранспортныеСредства.Грузоподъемность > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Грузоподъемность";
		
		Запрос.УстановитьПараметр("МаркаТС", МаркаТС);
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.УстановитьПараметр("МодельТС", МодельТС);
		КонецЕсли;
		
		МассивГрузоподъемность = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Грузоподъемность");
	Иначе
		МассивГрузоподъемность = Новый Массив;
	КонецЕсли;
	
	Если КакМассив Тогда
		Результат = МассивГрузоподъемность;
	Иначе	
		Результат = Новый СписокЗначений;
		Результат.ЗагрузитьЗначения(МассивГрузоподъемность);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	
