Перем мОбъектКопирования Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ

Процедура ПриКопировании(Объект)
	мОбъектКопирования = Объект;		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Если Не ЗначениеНеЗаполнено(мОбъектКопирования) Тогда
	//	СтОтбора = Новый Структура("Объект", мОбъектКопирования.Ссылка);
	//	Выборка = РегистрыСведений.уб_ТранспортныеСредства.Выбрать(СтОтбора);
	//	Если Выборка.Следующий() Тогда
	//		Запись = Выборка.ПолучитьМенеджерЗаписи();
	//		Запись.Объект = Ссылка;
	//		Запись.Записать();
	//	КонецЕсли;
	//	// очистим
	//	ОбъектКопирования = Неопределено;
	//КонецЕсли;
КонецПроцедуры //ПриЗаписи


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Тип;
	КонецЕсли;
	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
			
КонецПроцедуры	