
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ДатаОбновления) Тогда
		//Если Отправитель = ПараметрыСеанса.ТекущийПользователь //или РольДоступна("ПолныеПрава") 
		//	Тогда
		//	ТолькоПросмотр = (ТекущаяДата()-РегистрСведенийМенеджерЗаписи.Период)>3600*24;//через сутки блокируется
		//Иначе
		ТолькоПросмотр = Истина;	
		//КонецЕсли;
	Иначе
		ЗаполнитьЗначенияСвойств(Запись,Параметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	МассивПолучателей = Новый Массив;
	ЭлПочта = уб_temp.КонтактнаяИнформация(Запись.Получатель.ФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
	Если ЭлПочта = "bso_remote_02@kupipolis.ru" Тогда
		Возврат;
	КонецЕсли;	
	Если Не ПустаяСтрока(ЭлПочта) Тогда
		//Сообщить(ЭлПочта);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			МассивПолучателей.Добавить(ЭлПочта);
		Иначе
			МассивПолучателей.Добавить(ПараметрыСеанса.уб_Константы.АдресДоставкиЛога);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Запись.Руководителю Тогда
		
		СтруктураРуководителей = уб_temp.РуководительПодразделенияПоАгенту(Запись.Получатель.ФизЛицо);
		Если Не СтруктураРуководителей.Руководитель.Пустая() Тогда
			ЭлПочта = уб_temp.КонтактнаяИнформация(СтруктураРуководителей.Руководитель, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
			Если Не ПустаяСтрока(ЭлПочта) Тогда
				МассивПолучателей.Добавить(ЭлПочта)
			КонецЕсли;
		КонецЕсли;
		Если Не СтруктураРуководителей.Заместитель.Пустая() Тогда
			ЭлПочта = уб_temp.КонтактнаяИнформация(СтруктураРуководителей.Заместитель, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
			Если Не ПустаяСтрока(ЭлПочта) Тогда
				МассивПолучателей.Добавить(ЭлПочта)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	Если МассивПолучателей.Количество() > 0 Тогда
		//добавляем в список получателей электронную почту для копий
		//СистемнаяПочта = ПараметрыСеанса.уб_Константы.ЭлектроннаяПочтаДляКопий;
		//ДопТекстПодвал = "";//<br><br><font color = ""#ff0000"">" + ?(ШтрафПоТекущейДате = 0, "", "<b>Начисленный штраф: " + ШтрафПоТекущейДате + " руб.</b><br><br>") + "<i>За неисправление ошибки, начиная с даты " + Формат(КритическаяДата + 1, "ДФ=dd.MM.yyyy") + " г. в " + Формат(КритическаяДата + 1, "ДЛФ=T") + " будет начислен ежедневный штраф " + ЕжедневныйШтраф + " руб. за каждый день просрочки!</i></font>";
		//ДопТекстЦветФона = " bgcolor = ""#ffcccc""";
		//ДопТекстСрочно = "";
		//Если ТипЗнч(СистемнаяПочта) = Тип("Строка") Тогда
		//	МассивПолучателей.Добавить(СистемнаяПочта)
		//КонецЕсли;
		
		//ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина, Истина);
		ТекстHTML ="<body>ЗАЯВКА на выезд: <b>"+Запись.ИмяКанала+"</b>"+"<br><br><div style='    background: #7cd1ef;   color: #fff;  font-size: 16px; padding:15px; font-weight: 600; border-radius: 8px;'>"+Запись.Сообщение+"</div><br><br>Отправитель: <b>"+Запись.Отправитель+"</b><br>---  Отвечать на адрес 1c@kupipolis.ru не следует, это никто не прочитает</body>";
		ПараметрыСообщения = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		ОбратныйАдрес = уб_temp.КонтактнаяИнформация(Запись.Отправитель.ФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		//Сообщить(ОбратныйАдрес);
		Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
			ПараметрыСообщения.ОбратныйАдрес = ОбратныйАдрес;
		КонецЕсли;
		ПараметрыСообщения.Получатели					= МассивПолучателей;
		ПараметрыСообщения.Тема							= Запись.Заголовок;// +" - сообщение от "+РегистрСведенийМенеджерЗаписи.Отправитель;
		ПараметрыСообщения.ТекстHTML						= ТекстHTML;
		ПараметрыСообщения.ПисатьВЖурналТемуПриОшибке    = Ложь;
		ПараметрыСообщения.ТипСообщенияПриИсключении		= "Предупреждение";
		//Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
		//	Параметры.ОбратныйАдрес = ОбратныйАдрес
		//КонецЕсли;
		
		ЗаписыватьВРегистр = уб_ОбменДанными.SendMail(ПараметрыСообщения);
		//Если ЗаписыватьВРегистр Тогда
		//	ЗакрытьОчередь(Выборка.Ссылка,пРассылка);
		//Иначе
		//	ОшибкаОчереди(Выборка.Ссылка,пРассылка);
		//КонецЕсли;
	Иначе
		Сообщить("Электронный адрес получаетеля не обнаружен, поэтому дополнительно email-сообщение не отправлено");	
	КонецЕсли;	
	
КонецПроцедуры
