
Процедура ПодборГраницПериодаОтчета_2()
		
	Если ЗначениеНеЗаполнено(НачалоОтчетногоПериода) Тогда	
		НачалоОтчетногоПериода = ДобавитьМесяц(Дата, -1); 
	КонецЕсли;	
	Если ЗначениеНеЗаполнено(КонецОтчетногоПериода) Тогда	
		КонецОтчетногоПериода = Дата;
	КонецЕсли;	
		
КонецПроцедуры

Функция ПроверкаЗаполнения()
	Статус = СтатусСообщения.Важное;	
	
	Рез = Истина;
	
	Если ЗначениеНеЗаполнено(Номер) Тогда 
		УстановитьНовыйНомер();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(НачалоОтчетногоПериода) ИЛИ ЗначениеНеЗаполнено(КонецОтчетногоПериода) Тогда 
		ПодборГраницПериодаОтчета_2();
	КонецЕсли; 
	
	Если ЗначениеНеЗаполнено(Организация) Тогда 
		Если Не Проведен Тогда
			oАг = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
			Если oАг <> Неопределено Тогда
				Организация = oАг;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(Организация) Тогда 
			Сообщить("Не заполнено поле 'Организация'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если ОтветственныйБСО.Пустая() Тогда 
		Если Не Проведен Тогда
			МОЛпоБСО = уб_КЭШируемые.ПолучитьМОЛпоБСОДляПользователя(ПараметрыСеанса.ТекущийПользователь);
			Если МОЛпоБСО <> Неопределено Тогда
				ОтветственныйБСО = МОЛпоБСО;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОтветственныйБСО) Тогда 
			Сообщить("Не заполнено поле 'ОтветственныйБСО'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 

	Если ОтветственныйФинансы.Пустая() Тогда 
		Если Не Проведен Тогда
				ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОтветственныйФинансы) Тогда 
			Сообщить("Не заполнено поле 'Фин. Ответственный'!",Статус);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 

	
	Возврат Рез;	
КонецФункции

Функция ОП_ПолучитьНаборЗаписей() Экспорт
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//SS TODO При проведении проверять, проведены ли квитанции.
// Если не проведены - отказ и уведомление, что надо сначала провести соответствующий страховой полис.


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПравоПроведенияОА = ПравоДоступа("Проведение", Метаданные());

	ДокументОК = ПроверкаЗаполнения();
	
	Отказ = НЕ (ДокументОК И ПравоПроведенияОА);
	
	Ошибка = ПроверкаОплатыСписок();
	Если Ошибка Тогда
		Сообщить("Было изменено несколько оплат! Проведение невозможно!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не Отказ Тогда
		Для Каждого Оплата Из ОплатыСписок Цикл
			ДО = Оплата.ПолучитьОбъект();
			ДО.ДокументВыгрузкиВУП = Ссылка;
			ДО.Записать();
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = НЕ ПравоДоступа("ОтменаПроведения", Метаданные());
	
	Если Не Отказ Тогда
		Для Каждого Оплата Из ОплатыСписок Цикл
			ДО = Оплата.ПолучитьОбъект();
			ДО.ДокументВыгрузкиВУП = Документы.уб_ДокументДляВыгрузкиВУП.ПустаяСсылка();
			ДО.Записать();
		КонецЦикла;
	КонецЕсли;	
	
	Возврат;	

КонецПроцедуры

Функция ПроверкаОплатыСписок() Экспорт
	Ошибка = Ложь;
	КолИзменОплат = 0;
	Для Каждого Оплата Из ОплатыСписок Цикл
		ДО  =Оплата.ПолучитьОбъект();
		
		Если Оплата.Изменена Тогда
			Продолжить;
		КонецЕсли;	
		ЕстьИзменения = Ложь;
		СообщениеИзменений = "";
		ТекстИзменения = "";
		Если Не Оплата.Агент = ДО.Агент Тогда
			ТекстИзменения = ""+Символы.ПС+"был изменен Агент с "+Оплата.Агент+" на "+ДО.Агент+"";
			ЕстьИзменения = Истина;
		КонецЕсли;	
		Если Не Оплата.Поставщик = ДО.Поставщик Тогда
			ТекстИзменения = ТекстИзменения +Символы.ПС+"был изменен Поставщик с "+Оплата.Поставщик+" на "+ДО.Поставщик+"";
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Не Оплата.КВСумма = ДО.КВСумма Тогда
			ТекстИзменения = ТекстИзменения +Символы.ПС+"было изменено КВ с "+Оплата.КВСумма+" на "+ДО.КВСумма+"";
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Не Оплата.АВилиСкидкаСумма = ДО.АВилиСкидкаСумма Тогда
			ТекстИзменения = ТекстИзменения +Символы.ПС+"было изменено АВ с "+Оплата.АВилиСкидкаСумма+" на "+ДО.АВилиСкидкаСумма+"";
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Не Оплата.НачисленнаяСуммаВзноса = ДО.НачисленнаяСуммаВзноса Тогда
			ТекстИзменения = ТекстИзменения +Символы.ПС+"была изменена Начисленная сумма взноса с "+Оплата.НачисленнаяСуммаВзноса+" на "+ДО.НачисленнаяСуммаВзноса+"";
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если Не Оплата.СуммаКОплатеПоставщику = ДО.СуммаКОплатеПоставщику Тогда
			ТекстИзменения = ТекстИзменения +Символы.ПС+"была изменена сумма к оплате поставщику с "+Оплата.СуммаКОплатеПоставщику+" на "+ДО.СуммаКОплатеПоставщику+"";
			ЕстьИзменения = Истина;
		КонецЕсли;
		Если ЕстьИзменения Тогда
			Ошибка = Истина;
			КолИзменОплат = КолИзменОплат + 1;
			СообщениеИзменений = "В оплате:" +ТекстИзменения;
			Оплата.Примечание = СообщениеИзменений;
			Оплата.Изменена = Истина;
		КонецЕсли;
			
	КонецЦикла;
	Возврат Ошибка;
КонецФункции	

