///////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "Перед записью".
//
// Параметры:
//  Отказ - <Булево>
//        - Признак отказа от записи элемента. Если в теле
//          процедуры-обработчика установить данному параметру
//          значение Истина, запись элемента выполнена не будет.
//          Значение по умолчанию: Ложь.
//
Процедура ПередЗаписью(Отказ)

	Если Не ОбменДанными.Загрузка Тогда
		Если ПустаяСтрока(Идентификатор) Тогда
			//ОбщегоНазначения.СообщитьОбОшибке("Не указан идентификатор обработки обслуживания!");
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не указан идентификатор обработки обслуживания!","Сообщить");
			Отказ = Истина;
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|    СпрОбработки.Код КАК Код
			|ИЗ
			|    Справочник.ОбработкиОбслуживанияТО КАК СпрОбработки
			|ГДЕ
			|    СпрОбработки.Идентификатор = &Идентификатор
			|    И СпрОбработки.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
			Запрос.УстановитьПараметр("Ссылка",        Ссылка);
			Запрос = Запрос.Выполнить();
			Если Не Запрос.Пустой() Тогда
				Запрос = Запрос.Выгрузить()[0];
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Идентификатор """
				                 + Идентификатор
				                 + """ уже используется для элемента с кодом "
				                 + Запрос.Код,"Сообщить");
				//ОбщегоНазначения.СообщитьОбОшибке("Идентификатор """
								 //+ Идентификатор
								 //+ """ уже используется для элемента с кодом "
								 //+ Запрос.Код);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
