Функция ОбъектВОчереди(Параметры,Данные = Неопределено,Добавить = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	уб_Очередь.Объект,
	               |	уб_Очередь.ТипОчереди,
	               |	уб_Очередь.КоличествоПопытокВыполнения
	               |ИЗ
	               |	РегистрСведений.уб_Очередь КАК уб_Очередь
	               |ГДЕ
	               |	уб_Очередь.Объект = &Объект
	               |	И уб_Очередь.ТипОчереди = &ТипОчереди";
	Запрос.УстановитьПараметр("Объект",Параметры.Объект);
	Запрос.УстановитьПараметр("ТипОчереди",Параметры.ТипОчереди);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Новый Структура;
		Данные.Вставить("КоличествоПопытокВыполнения",Выборка.КоличествоПопытокВыполнения);
		Возврат Истина;
	Иначе	
		Если Добавить = Истина Тогда
			ДобавитьВОчередь(Параметры);
		КонецЕсли;	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ДобавитьВОчередь(Параметры) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Параметры);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции	