//Функция проверки ХЭШ суммы
Функция CheckKey(key)
	Если уб_B2B.ПолучитьПрочитатьKey(key) Тогда
		Возврат(уб_B2B.JSON(Новый Структура("status","ok")));
	Иначе
		Возврат(уб_B2B.JSON(Новый Структура("status","error")));
	КонецЕсли;
КонецФункции

//Получает данныe пользователя по Сессионному ключу
//Если активного ключа нет, запрашиваем данные с сервера В2В
Функция ДайДанныеПоSid(sid)
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	уб_СессионныеКлючиB2B.СрокЖизни КАК СрокЖизни,
	|	уб_СессионныеКлючиB2B.Ключ КАК Ключ,
	|	уб_СессионныеКлючиB2B.Поставщик КАК Поставщик,
	|	уб_СессионныеКлючиB2B.ОргАгент КАК ОргАгент,
	|	уб_СессионныеКлючиB2B.ПользовательB2B как Пользователь
	|ИЗ
	|	РегистрСведений.уб_СессионныеКлючиB2B КАК уб_СессионныеКлючиB2B
	|ГДЕ
	|	уб_СессионныеКлючиB2B.СрокЖизни >= &ТекущаяДата
	|	И уб_СессионныеКлючиB2B.Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ",sid);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выгрузить();
	
	//Если найден активный ключ и группа опеределена
	Если Выборка.Количество() <> 0 И НЕ Выборка[0].Поставщик.Пустая() И НЕ Выборка[0].ОргАгент.Пустая() Тогда
		СтруктураПользователя = Новый Структура("Пользователь, Поставщик, ОргАгент",
		Выборка[0].Пользователь,
		Выборка[0].Поставщик,
		Выборка[0].ОргАгент);
	Иначе
		//Запрашиваем данные пользователя по сессионному ключу у В2В
		ОтветСервера = уб_B2B.ОтправитьPOSTЗапросНаСервер("{""stask"":""getjuid"",""data"":{""sid"":"""+sid+"""}}");
		Если ОтветСервера.Получить("status") = "error" Тогда
			уб_B2B.ЗаписатьОшибкуИСообщить(ОтветСервера.Получить("msg"), ,Истина, УровеньЖурналаРегистрации.Ошибка);
		Иначе
			СтруктураПользователя = Новый Структура("Пользователь, Поставщик, ОргАгент", 
			Справочники.уб_ПользователиB2B.НайтиПоРеквизиту("JoomlaID",ОтветСервера.Получить("juid")),
			Справочники.Контрагенты.НайтиПоКоду(ОтветСервера.Получить("post")),
			Справочники.Организации.НайтиПоКоду(ОтветСервера.Получить("org")));
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_СессионныеКлючиB2B.ПользовательB2B,
		|	уб_СессионныеКлючиB2B.Поставщик,
		|	уб_СессионныеКлючиB2B.ОргАгент
		|ИЗ
		|	РегистрСведений.уб_СессионныеКлючиB2B КАК уб_СессионныеКлючиB2B
		|ГДЕ
		|	уб_СессионныеКлючиB2B.ПользовательB2B = &ПользовательB2B";
		
		Запрос.УстановитьПараметр("ПользовательB2B", СтруктураПользователя.Пользователь);
		НайденныйКлюч = Запрос.Выполнить().Выбрать();
		//Если ключ еще не создан, создаем
		Если НайденныйКлюч.Количество()=0 Тогда
			НовыйКлюч = РегистрыСведений.уб_СессионныеКлючиB2B.СоздатьМенеджерЗаписи(); 
			НовыйКлюч.ПользовательB2B = СтруктураПользователя.Пользователь; 
			НовыйКлюч.Поставщик = СтруктураПользователя.Поставщик; 
			НовыйКлюч.ОргАгент = СтруктураПользователя.ОргАгент; 
			НовыйКлюч.Ключ = sid;
			ОшибкаЗаписи = Истина;
			ДобавкаСекунд = 0;
			КоличествоЦиклов = 0;
			Пока ОшибкаЗаписи Цикл
				Попытка
					НовыйКлюч.СрокЖизни = ТекущаяДата() + 60*60 + ДобавкаСекунд; // + час + секунды
					НовыйКлюч.Записать(); 			
					ОшибкаЗаписи = Ложь;
				Исключение
					ДобавкаСекунд = ДобавкаСекунд + 1;
				КонецПопытки;
				КоличествоЦиклов = КоличествоЦиклов + 1;
				Если КоличествоЦиклов = 5 Тогда
					уб_B2B.ЗаписатьОшибкуИСообщить("Ошибка записи срока жизни ключа!" + СтруктураПользователя.Пользователь.ПолучитьОбъект(),, Истина, УровеньЖурналаРегистрации.Ошибка, , , "" + ОписаниеОшибки(), СтатусСообщения.Важное);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураПользователя;
	
КонецФункции

//Получает данныe пользователя по Сессионному ключу
//Если активного ключа нет, запрашиваем данные с сервера В2В
Функция ДайДанныеПоSid_Старая(sid)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ПользователиB2BСессионыеКлючи.Ссылка КАК Пользователь,
	|	уб_ПользователиB2BСессионыеКлючи.Поставщик КАК Поставщик,
	|	уб_ПользователиB2BСессионыеКлючи.ОргАгент КАК ОргАгент
	|ИЗ
	|	Справочник.уб_ПользователиB2B.СессионыеКлючи КАК уб_ПользователиB2BСессионыеКлючи
	|ГДЕ
	|	уб_ПользователиB2BСессионыеКлючи.Ключ = &Ключ
	
	|	И уб_ПользователиB2BСессионыеКлючи.СрокЖизни >= &ТекущаяДата");
	
	Запрос.УстановитьПараметр("Ключ",sid);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выгрузить();
	
	//Если найден активный ключ и группа опеределна
	Если Выборка.Количество() <> 0 И НЕ Выборка[0].Поставщик.Пустая() И НЕ Выборка[0].ОргАгент.Пустая() Тогда
		СтруктураПользователя = Новый Структура("Пользователь, Поставщик, ОргАгент",
		Выборка[0].Пользователь,
		Выборка[0].Поставщик,
		Выборка[0].ОргАгент);
	Иначе
		//Запрашиваем данные пользователя по сессионному ключу у В2В
		ОтветСервера = уб_B2B.ОтправитьPOSTЗапросНаСервер("{""stask"":""getjuid"",""data"":{""sid"":"""+sid+"""}}");
		Если ОтветСервера.Получить("status") = "error" Тогда
			уб_B2B.ЗаписатьОшибкуИСообщить(ОтветСервера.Получить("msg"), ,Истина, УровеньЖурналаРегистрации.Ошибка);
		Иначе
			СтруктураПользователя = Новый Структура("Пользователь, Поставщик, ОргАгент", 
			Справочники.уб_ПользователиB2B.НайтиПоРеквизиту("JoomlaID",ОтветСервера.Получить("juid")),
			Справочники.Контрагенты.НайтиПоКоду(ОтветСервера.Получить("post")),
			Справочники.Организации.НайтиПоКоду(ОтветСервера.Получить("org")));
		КонецЕсли;
		
		Пользователь = СтруктураПользователя.Пользователь.ПолучитьОбъект();
		НайденныйКлюч = Пользователь.СессионыеКлючи.Найти(sid, "Ключ");
		//Если ключ еще не создан, создаем
		Если НайденныйКлюч = Неопределено Тогда
			НовыйКлюч = Пользователь.СессионыеКлючи.Добавить();
			НовыйКлюч.Ключ = sid;
			НовыйКлюч.Поставщик = СтруктураПользователя.Поставщик;
			НовыйКлюч.ОргАгент = СтруктураПользователя.ОргАгент;
			НовыйКлюч.СрокЖизни = ТекущаяДата() + 60*60;// + час
		Иначе
			НайденныйКлюч.Поставщик = СтруктураПользователя.Поставщик;
			НайденныйКлюч.ОргАгент = СтруктураПользователя.ОргАгент;
		КонецЕсли;	
		Попытка 
			Пользователь.Записать();
		Исключение
			уб_B2B.ЗаписатьОшибкуИСообщить("Ошибка записи пользователя!" + Пользователь,, Истина, УровеньЖурналаРегистрации.Ошибка, , , "" + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
	Возврат СтруктураПользователя;
	
КонецФункции


//Возвращает список ГруппДоговоров для текущего пользователя
//
Функция GetGroups(sid)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров.Наименование, """") КАК name,
	|	ЕСТЬNULL(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров.Поставщик.Код, """") + "","" + ЕСТЬNULL(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров.ОргАгент.Код, """") КАК id,
	|	ЕСТЬNULL(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров.ОргАгент.folder, """") КАК name_agent,
	|	ЕСТЬNULL(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров.Поставщик.folder, """") КАК name_provider
	|ИЗ
	|	РегистрСведений.уб_СвязкаВ2ВПользователиГруппы КАК уб_СвязкаВ2ВПользователиГруппы
	|ГДЕ
	|	уб_СвязкаВ2ВПользователиГруппы.Пользователь = &Пользователь");
	
	Запрос.УстановитьПараметр("Пользователь", СтруктураПользователя.Пользователь);
	ВыборкаГрупп = Запрос.Выполнить().Выгрузить();
	
	Если ВыборкаГрупп.Количество() <> 0 Тогда
		Структура = Новый Структура("status, group",
		"ok",
		ВыборкаГрупп);
	Иначе
		Структура = Новый Структура("status, msg",
		"error",
		?(СтруктураПользователя.Пользователь.Пустая(),
		"Пользователь в базе не найден, обратитесь к администратору!",
		"Групп для пользователя не определено, обратитесь к администратору!"));
	КонецЕсли;
	
	Возврат уб_B2B.JSON(Структура)
	
КонецФункции

//Возвращает следующий уровень дерева	//Переделать INCOMING
//
Функция GetFolderData(sid, id)
	
	СтруктураПользователя = ДайДанныеПоSid(sid);
	СтруктураФайлов = Новый Структура;
	
	//Разбиваем полученную строку на массив
	ПолученныйМассив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(id, "/");
	КоличествоЭлементовМассива = ПолученныйМассив.Количество();
	
	//Если до 2ого уровня ищем по параметрам
	Если КоличествоЭлементовМассива >= 1 и КоличествоЭлементовМассива < 3 Тогда
		МассивПоставщикОргАгент = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПолученныйМассив[0]);
		ПараметрПоставщик	= МассивПоставщикОргАгент[0];
		ПараметрОргАгент	= МассивПоставщикОргАгент[1];
		Если КоличествоЭлементовМассива = 2 Тогда
			Если ПолученныйМассив[1] <> "INCOMING" Тогда
				ПараметрДатаНачала = Дата("20" + ПолученныйМассив[1] + "01");
				ПараметрINCOMING = 0;
			Иначе
				ПараметрINCOMING = 1;
			КонецЕсли;
		КонецЕсли;
		//Если 3ого уровня ищем по Страховому полису
	ИначеЕсли КоличествоЭлементовМассива >= 3 Тогда
		Если ПолученныйМассив[1] <> "INCOMING" Тогда
			НовыйУИД = Новый УникальныйИдентификатор(ПолученныйМассив[2]);
			ПараметрСП	= Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
			Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
				ПараметрСП	= Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
			КонецЕсли;
			Если КоличествоЭлементовМассива > 3 Тогда
				ПараметрВидФайла = ПолученныйМассив[3];
			КонецЕсли;
		Иначе
			ПараметрINCOMING = 1;
			МассивПоставщикОргАгент = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПолученныйМассив[0]);
			ПараметрПоставщик	= МассивПоставщикОргАгент[0];
			ПараметрОргАгент	= МассивПоставщикОргАгент[1];
			ПараметрДатаINCOMING = Дата("20" + ПолученныйМассив[2] + "01");
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрСП) Тогда
		Если НЕ ЗначениеЗаполнено(ПараметрДатаНачала) Тогда
			
			Если ПараметрINCOMING = 1 Тогда
				Если НЕ ЗначениеЗаполнено(ПараметрДатаINCOMING) Тогда
					СтруктураУровень3INCOMING = ДайТретийУровеньДереваIncoming(ПараметрОргАгент, ПараметрПоставщик);
					
					Структура = Новый Структура("status, folder",
					"ok",
					СтруктураУровень3INCOMING);
				Иначе
					СтруктураУровень4INCOMING = ДайЧетвертыйУровеньДереваIncoming(ПараметрДатаINCOMING, ПараметрОргАгент, ПараметрПоставщик);
					
					Структура = Новый Структура("status, content",
					"ok",
					СтруктураУровень4INCOMING);
				КонецЕсли;
			Иначе
				
				СтуктураУровень2 = ДайВторойУровеньДерева(ПараметрОргАгент, ПараметрПоставщик);
				
				Структура = Новый Структура("status, folder",
				"ok",
				СтуктураУровень2);
			КонецЕсли;
		Иначе
			
			СтруктураУровень3 = ДайТретийУровеньДерева(ПараметрДатаНачала, ПараметрОргАгент, ПараметрПоставщик);
			
			Структура = Новый Структура("status, folder",
			"ok",
			СтруктураУровень3);
			
		КонецЕсли;
	Иначе
		Если ТипЗнч(ПараметрСП) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уб_ОтчетПоставщику.НомерОтчетаПоставщику,
			|	уб_ОтчетПоставщику.Номер,
			|	ЕСТЬNULL(уб_ОтчетПоставщику.Поставщик.НаименованиеПолное, """") КАК ПоставщикНаименованиеПолное,
			|	ЕСТЬNULL(уб_ОтчетПоставщику.ОрганизацияАгент.НаименованиеДляДоговоровИПлатежныхДокументов, """") КАК ОрганизацияАгентНаименование,
			|	уб_ОтчетПоставщику.НачалоОтчетногоПериода,
			|	уб_ОтчетПоставщику.КонецОтчетногоПериода,
			|	ПРЕДСТАВЛЕНИЕ(уб_ОтчетПоставщику.ВидСП) КАК ВидСП,
			|	уб_ОтчетПоставщику.ИтогОС_НачисленнаяСуммаВзноса,
			|	уб_ОтчетПоставщику.ИтогОС_КВ,
			|	уб_ОтчетПоставщику.ИтогОС_КВДоп,
			|	уб_ОтчетПоставщику.КоличествоСтрокОплат,
			|	уб_ОтчетПоставщику.ДатаСогласования
			|ИЗ
			|	Документ.уб_ОтчетПоставщику КАК уб_ОтчетПоставщику
			|ГДЕ
			|	уб_ОтчетПоставщику.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", ПараметрСП);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				FolderComment = 
				"Отчет поставщику <span>№ " + Выборка.НомерОтчетаПоставщику + " (" + Выборка.Номер + ")" + "</span><br/>" +
				" Поставщик: <span>" + Выборка.ПоставщикНаименованиеПолное + "</span><br/>" +
				" Организация агент: <span>" + Выборка.ОрганизацияАгентНаименование + "</span><br/>" +
				" Отчетный период: <span>с " + Формат(Выборка.НачалоОтчетногоПериода, "ДФ=""дд ММММ гггг 'г.'""") + " по " + Формат(Выборка.КонецОтчетногоПериода, "ДФ=""дд ММММ гггг 'г.'""") + "</span><br/>" +
				" Вид страхового продукта: <span>" + Выборка.ВидСП + "</span><br/>" +
				" Итог взносов: <span>" +  Формат(Выборка.ИтогОС_НачисленнаяСуммаВзноса, "ЧЦ=15; ЧДЦ=2; ЧН=0") + "</span><br/>" +
				" Итог КВ: <span>" + Формат(Выборка.ИтогОС_КВ, "ЧЦ=15; ЧДЦ=2; ЧН=0") + "</span><br/>" +
				" Итог КВ Доп.: <span>" + Формат(Выборка.ИтогОС_КВДоп, "ЧЦ=15; ЧДЦ=2; ЧН=0") + "</span><br/>" +
				" Количество строк оплат: <span>" + Выборка.КоличествоСтрокОплат + "</span>";
				Если ЗначениеЗаполнено(Выборка.ДатаСогласования) Тогда
					FolderComment = FolderComment +	"<br/>" + 
					" Дата согласования: <span> " + Формат(Выборка.ДатаСогласования, "ДФ=""дд ММММ гггг 'г.'""") + "</span>";
				КонецЕсли;
			Иначе
				FolderComment = "Отчет поставщику не найден."
			КонецЕсли;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уб_СтраховойПолис.Номер,
			|	ЕСТЬNULL(уб_СтраховойПолис.ОбъектСтрахования.Наименование, """") КАК ОбъектСтрахованияНаименование,
			|	ЕСТЬNULL(уб_СтраховойПолис.Страхователь.Наименование, """") КАК СтраховательНаименование,
			|	ЕСТЬNULL(уб_СтраховойПолис.СК.НаименованиеПолное, """") КАК СКНаименованиеПолное,
			|	ЕСТЬNULL(уб_СтраховойПолис.ОрганизацияАгент.НаименованиеДляДоговоровИПлатежныхДокументов, """") КАК ОрганизацияАгентНаименование,
			|	уб_СтраховойПолис.ДатаНачала,
			|	уб_СтраховойПолис.ДатаОкончания,
			|	ЕСТЬNULL(уб_СтраховойПолис.Агент.Наименование, """") КАК АгентНаименование,
			|	ЕСТЬNULL(уб_СтраховойПолис.СтраховойПродукт.Наименование, """") КАК СтраховойПродуктНаименование,
			|	уб_СтраховойПолис.Курьер,
			|	ЕСТЬNULL(уб_СтраховойПолис.Курьер.Наименование, """") КАК КурьерНаименование
			|ИЗ
			|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
			|ГДЕ
			|	уб_СтраховойПолис.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", ПараметрСП);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				FolderComment = 
				"Страховой полис <span>№ " + Выборка.Номер + "</span><br/>" +
				" Объект страхования: <span>" + Выборка.ОбъектСтрахованияНаименование + "</span><br/>" +
				" Страхователь: <span>" + Выборка.СтраховательНаименование + "</span><br/>" +
				" Страховая компания: <span>" + Выборка.СКНаименованиеПолное+ "</span><br/>" +
				" Организация агент: <span>" + Выборка.ОрганизацияАгентНаименование + "</span><br/>" +
				" Срок страхования: <span>с " + Формат(Выборка.ДатаНачала, "ДФ=""дд ММММ гггг 'г.'""") + " по " + Формат(Выборка.ДатаОкончания, "ДФ=""дд ММММ гггг 'г.'""") + "</span><br/>" +
				" Агент: <span>" + Выборка.АгентНаименование + "</span><br/>" +
				" Вид страхового продукта: <span>" + Выборка.СтраховойПродуктНаименование + "</span>" +
				?(НЕ ЗначениеЗаполнено(Выборка.Курьер), "" , "<br/>" + "Курьер: <span>" + Выборка.КурьерНаименование + "</span>");
			Иначе
				FolderComment = "Страховой полис не найден."
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПараметрВидФайла) Тогда
			
			СтруктураУровень4 = ДайЧетвертыйУровеньДерева(ПараметрСП);
			
			Структура = Новый Структура("status, folder, comment",
			"ok",
			СтруктураУровень4,
			СтрЗаменить(FolderComment, """", ""));
		Иначе
			
			Структура5Уровня = ДайПятыйУровеньДерева(ПараметрСП, ПараметрВидФайла);
			
			Структура = Новый Структура("status, content, comment",
			"ok",
			Структура5Уровня,
			СтрЗаменить(FolderComment, """", ""));
		КонецЕсли;
	КонецЕсли;
	
	Возврат уб_B2B.JSON(Структура);
КонецФункции

Функция GetTree(sid, id)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	СтруктураСтруктур = Новый Структура;
	
	//Разбиваем полученную строку на массив
	СтруктураПараметров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(id, "/");
	КоличествоПараметров = СтруктураПараметров.Количество();
	
	Если КоличествоПараметров >= 1 Тогда
		МассивПоставщикОргАгент = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров[0]);
		ПараметрПоставщик	= МассивПоставщикОргАгент[0];
		ПараметрОргАгент	= МассивПоставщикОргАгент[1];
		
		Структура1Уровня = ДайПервыйУровеньДерева(ПараметрОргАгент, ПараметрПоставщик);
		
		СтруктураСтруктур.Вставить("folder1",Структура1Уровня);
		
		Структура2Уровня = ДайВторойУровеньДерева(ПараметрОргАгент, ПараметрПоставщик);
		
		СтруктураСтруктур.Вставить("folder2",Структура2Уровня);
	КонецЕсли;
	
	
	Если КоличествоПараметров >= 2 Тогда
		Если СтруктураПараметров[1] <> "INCOMING" Тогда
			ПараметрДатаНачала = Дата("20" + СтруктураПараметров[1] + "01");
			Структура3Уровня = ДайТретийУровеньДерева(ПараметрДатаНачала, ПараметрОргАгент, ПараметрПоставщик);
		Иначе
			Структура3Уровня = ДайТретийУровеньДереваIncoming(ПараметрОргАгент, ПараметрПоставщик);
		КонецЕсли;
		
		СтруктураСтруктур.Вставить("folder3", Структура3Уровня);
	КонецЕсли;
	
	Если КоличествоПараметров >= 3 И СтруктураПараметров[1] <> "INCOMING" Тогда
		НовыйУИД = Новый УникальныйИдентификатор(СтруктураПараметров[2]);
		ПараметрСП	= Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
		Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
			ПараметрСП	= Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
		КонецЕсли;
		
		Структура4Уровня = ДайЧетвертыйУровеньДерева(ПараметрСП);
		
		СтруктураСтруктур.Вставить("folder4",Структура4Уровня);
	КонецЕсли;
	
	СтруктураСтруктурСтруктур = Новый Структура("status, content",
	"ok",
	СтруктураСтруктур);
	Возврат(уб_B2B.JSON(СтруктураСтруктурСтруктур));
КонецФункции

//Возвращает список файлов, соотвествующего критериям поиска
Функция GetSearchResult(sid, name, number, car_mark, car_model, product, date_begin, date_end)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	СтруктураФайлов = Новый Структура;
	Запрос = Новый Запрос;
	Доп = "";
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_ФайлыКПолисам.ФайлИмя КАК ФайлИмя,
	|	уб_ФайлыКПолисам.УИД КАК УИД,
	|	уб_ФайлыКПолисам.ДатаПубликации КАК date,
	|	Представление(уб_ФайлыКПолисам.ВидДокумента) КАК ВидДокумента,
	|	уб_ФайлыКПолисам.ФайлРасширение КАК ФайлРасширение,
	|	уб_ФайлыКПолисам.ФайлРазмер КАК ФайлРазмер
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	|		ПО уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
	|ГДЕ
	|	уб_ФайлыКПолисам.Размещен = ИСТИНА
	|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент = &ОрганизацияАгент
	|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик = &Поставщик");
	Запрос.УстановитьПараметр("ОрганизацияАгент", СтруктураПользователя.ОргАгент);
	Запрос.УстановитьПараметр("Поставщик", СтруктураПользователя.Поставщик);
	
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Если ПубликоватьОтчетыПоставщику <> Истина Тогда
		Доп = доп + Символы.ПС + "И Не уб_ФайлыКПолисам.СтраховойПолис Ссылка Документ.уб_ОтчетПоставщику";
	КонецЕсли;
	
	//Ищем по Страхователю
	Если ЗначениеЗаполнено(name) Тогда
		Доп = доп + Символы.ПС + "И уб_ФайлыКПолисам.СтраховойПолис.Страхователь.Наименование ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование", "%"+name+"%");
	КонецЕсли;
	
	//Ищем по Номеру Страхового полиса
	Если ЗначениеЗаполнено(number) Тогда
		Доп = доп + Символы.ПС + "И уб_ФайлыКПолисам.СтраховойПолис.Номер ПОДОБНО &Номер";
		Запрос.УстановитьПараметр("Номер", "%"+number+"%");
	КонецЕсли;
	
	//Ищем по Страховому продукту
	Если ЗначениеЗаполнено(product) Тогда
		Доп = доп + Символы.ПС + "И уб_ФайлыКПолисам.СтраховойПолис.ВидС = &ВидСП";
		Запрос.УстановитьПараметр("ВидСП", Перечисления.уб_ВидыСтрахования[product]);
	КонецЕсли;
	
	//Ищем за дате оформления Страхового полиса (ДатаНач)
	Если ЗначениеЗаполнено(date_begin) Тогда
		Доп = доп + Символы.ПС + "И уб_ФайлыКПолисам.СтраховойПолис.Дата >= &ДатаНач";
		Запрос.УстановитьПараметр("ДатаНач", Дата(СтрЗаменить(date_begin, ".","")));
	КонецЕсли;
	
	//Ищем за дате оформления Страхового полиса (ДатаКон)
	Если ЗначениеЗаполнено(date_end) Тогда
		Доп = доп + Символы.ПС + "И уб_ФайлыКПолисам.СтраховойПолис.Дата <= &ДатаКон";
		Запрос.УстановитьПараметр("ДатаКон", Дата(СтрЗаменить(date_end, ".","")));
	КонецЕсли;
	
	//Ищем по Марке транспортного средства
	Если ЗначениеЗаполнено(car_mark) Тогда
		Доп = доп + Символы.ПС + "И уб_ТранспортныеСредства.МаркаТС.Код = &МаркаТС";
		Запрос.УстановитьПараметр("МаркаТС", Число(car_mark));
	КонецЕсли;
	
	//Ищем по Моделе транспортного средства
	Если ЗначениеЗаполнено(car_model) Тогда
		Доп = доп + Символы.ПС + "И уб_ТранспортныеСредства.МодельТС.Код = &МодельТС";
		Запрос.УстановитьПараметр("МодельТС", Число(car_model));
	КонецЕсли;
	
	//чкн
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросGetSearchResult(СтруктураПользователя, name, number, car_mark, car_model, product, date_begin, date_end);
	Иначе
		Запрос.Текст = Запрос.Текст + доп;
	КонецЕсли;
	//чкн
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество()=0 Тогда 
		Структура = Новый Структура;
		Структура.Вставить("status","error");
		Структура.Вставить("msg","Не найдено ни одного документа, соответствующего запросу! Убедитесь, что все слова написаны без ошибок");	
		Возврат(уб_B2B.JSON(Структура));
		//Перевести в констанкты	
	ИначеЕсли Выборка.Количество()>300 Тогда
		Структура = Новый Структура;
		Структура.Вставить("status","error");
		Структура.Вставить("msg","Количество найденых документов превышает допустимое! Уточните поиск");	
		Возврат(уб_B2B.JSON(Структура));
	КонецЕсли;
	
	For i = 0 to Выборка.Количество()-1 Do
		Структура3Влож = Новый Структура;
		Структура3Влож.Вставить("name", Выборка[i].ФайлИмя);
		Структура3Влож.Вставить("name_short", Выборка[i].ВидДокумента);
		Структура3Влож.Вставить("id", Выборка[i].УИД);
		Структура3Влож.Вставить("size", Выборка[i].ФайлРазмер);
		Структура3Влож.Вставить("elem_type", Выборка[i].ФайлРасширение);
		Структура3Влож.Вставить("date", Строка(Выборка[i].date));
		
		СтруктураФайлов.Вставить("f"+i,Структура3Влож);
	КонецЦикла;
	
	Структура = Новый Структура;
	Структура.Вставить("status","ok");
	Структура.Вставить("content",СтруктураФайлов);	
	
	Возврат(уб_B2B.JSON(Структура));
КонецФункции

//чкн
// запрос для справочника файлов
Функция ЗапросGetSearchResult(СтруктураПользователя, name, number, car_mark, car_model, product, date_begin, date_end)
	
	Доп = "";
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлИмя КАК ФайлИмя,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код КАК УИД,
	        |	уб_СтраховойПолисСписокФайлов.ДатаПубликации КАК date,
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидДокумента) КАК ВидДокумента,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлРасширение КАК ФайлРасширение,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлРазмер КАК ФайлРазмер
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	        |		ПО уб_СтраховойПолисСписокФайлов.Ссылка.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
	        |ГДЕ
	        |	уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Если ПубликоватьОтчетыПоставщику <> Истина Тогда
		Доп = доп + Символы.ПС + "И Не уб_СтраховойПолисСписокФайлов.Ссылка Ссылка Документ.уб_ОтчетПоставщику";
	КонецЕсли;
	
	//Ищем по Страхователю
	Если ЗначениеЗаполнено(name) Тогда
		Доп = доп + Символы.ПС + "И уб_СтраховойПолисСписокФайлов.Ссылка.Страхователь.Наименование ПОДОБНО &Наименование";
	КонецЕсли;
	
	//Ищем по Номеру Страхового полиса
	Если ЗначениеЗаполнено(number) Тогда
		Доп = доп + Символы.ПС + "И уб_СтраховойПолисСписокФайлов.Ссылка.Номер ПОДОБНО &Номер";
	КонецЕсли;
	
	//Ищем по Страховому продукту
	Если ЗначениеЗаполнено(product) Тогда
		Доп = доп + Символы.ПС + "И уб_СтраховойПолисСписокФайлов.Ссылка.ВидС = &ВидСП";
	КонецЕсли;
	
	//Ищем за дате оформления Страхового полиса (ДатаНач)
	Если ЗначениеЗаполнено(date_begin) Тогда
		Доп = доп + Символы.ПС + "И уб_СтраховойПолисСписокФайлов.Ссылка.Дата >= &ДатаНач";
	КонецЕсли;
	
	//Ищем за дате оформления Страхового полиса (ДатаКон)
	Если ЗначениеЗаполнено(date_end) Тогда
		Доп = доп + Символы.ПС + "И уб_СтраховойПолисСписокФайлов.Ссылка.Дата <= &ДатаКон";
	КонецЕсли;
	
	//Ищем по Марке транспортного средства
	Если ЗначениеЗаполнено(car_mark) Тогда
		Доп = доп + Символы.ПС + "И уб_ТранспортныеСредства.МаркаТС.Код = &МаркаТС";
	КонецЕсли;
	
	//Ищем по Моделе транспортного средства
	Если ЗначениеЗаполнено(car_model) Тогда
		Доп = доп + Символы.ПС + "И уб_ТранспортныеСредства.МодельТС.Код = &МодельТС";
	КонецЕсли;
	
	Текст = Текст + доп;
	
	Возврат  Текст;
	
КонецФункции
//чкн

//*******************************************************************************

//Поставщик, ОргАгент
Функция ДайПервыйУровеньДерева(ОргАгент, Поставщик)
	
	//СсылкаОргАгент	= Справочники.Организации.НайтиПоКоду(ОргАгент);
	//СсылкаПоставщик	= Справочники.Контрагенты.НайтиПоКоду(Поставщик);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.folder, """") КАК ОрганизацияАгентFolder,
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Поставщик.folder, """") КАК ПоставщикFolder,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.УИД) КАК amountFile
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	|		КОНЕЦ
	|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
	|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
	|	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ФайлыКПолисам.СтраховойПолис.Поставщик,
	|	уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент,
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.folder, """"),
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Поставщик.folder, """")");
	
	Запрос.УстановитьПараметр("ОрганизацияАгент",ОргАгент);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда
		Запрос.Текст = ЗапросПервыйУровеньДерева();
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выгрузить();
	
	amountFile = Выборка[0].amountFile;
	
	Возврат	Новый Структура("f0",
	Новый Структура("cleaf, title, id, amountFile",
	1,
	Выборка[0].ПоставщикFolder + " - [" + Выборка[0].ОрганизацияАгентFolder + "]",
	Поставщик + "," + ОргАгент,
	amountFile));
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросПервыйУровеньДерева()
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.folder, """") КАК ОрганизацияАгентFolder,
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.folder, """") КАК ПоставщикFolder,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код) КАК amountFile
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.Код = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.Код = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.folder, """"),
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.folder, """")";
	
	Возврат Текст;
	
КонецФункции
//чкн

//ггММ
Функция ДайВторойУровеньДерева(ОргАгент, Поставщик)
	СтруктураФайлов = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ГодПолиса) КАК Год,
	|	ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.МесяцПолиса) КАК Месяц,
	|	уб_ФайлыКПолисам.ГодПолиса КАК Год2,
	|	уб_ФайлыКПолисам.МесяцПолиса КАК Месяц2,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.УИД) КАК amountFile
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	|		КОНЕЦ
	|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
	|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
	|	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ФайлыКПолисам.ГодПолиса,
	|	уб_ФайлыКПолисам.МесяцПолиса
	|
	|УПОРЯДОЧИТЬ ПО
	|	Год2 УБЫВ,
	|	Месяц2 УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ГОД(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Год,
	|	ПРЕДСТАВЛЕНИЕ(МЕСЯЦ(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Месяц,
	|	ГОД(уб_ФайлыКПолисамВходящие.ДатаРазмещения) КАК Год2,
	|	МЕСЯЦ(уб_ФайлыКПолисамВходящие.ДатаРазмещения) КАК Месяц2
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	|ГДЕ
	|	уб_ФайлыКПолисамВходящие.Поставщик.Код = &Поставщик
	|	И уб_ФайлыКПолисамВходящие.ОргАгент.Код = &ОрганизацияАгент
	|	И уб_ФайлыКПолисамВходящие.Размещен = ИСТИНА");
	Запрос.УстановитьПараметр("ОрганизацияАгент",ОргАгент);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросВторойУровеньДерева();
	КонецЕсли;

	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выгрузить();
	ВыборкаIncoming = Результат[1].Выбрать();
	
	Если ВыборкаIncoming.Количество() <> 0 Тогда
		СтруктураФайлов.Вставить("f"+Выборка.Количество(),Новый Структура("cleaf, title, id, parent",
		1,
		"INCOMING",
		"INCOMING",
		Поставщик + "," + ОргАгент));
	КонецЕсли;
	
	For i = 0 to Выборка.Количество()-1 Do
		id = ?(СтрДлина(Выборка[i].Месяц)=1,
		Прав(Выборка[i].Год, 2) + "0" + Выборка[i].Месяц,
		Прав(Выборка[i].Год, 2) + Выборка[i].Месяц);
		
		МесяцП = Выборка[i].Месяц2;
		
		amountFile = Выборка[i].amountFile;

		СтруктураФайлов.Вставить("f"+i,Новый Структура("cleaf, title, id, parent, amountFile",
		1,
		//Формат(Дата("0001"+Выборка[i].Месяц+"01000000"),"ДФ=ММММ") + " 2" + Прав(Выборка[i].Год, 3) + "г.",
		МесяцПропписьюB2B(МесяцП) + " 2" + Прав(Выборка[i].Год, 3) + "г.",
		id,
		Поставщик + "," + ОргАгент,
		amountFile));
	КонецЦикла;
	
	Возврат СтруктураФайлов;
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросВторойУровеньДерева()
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПРЕДСТАВЛЕНИЕ(ГОД(уб_СтраховойПолисСписокФайлов.Ссылка.Дата)) КАК Год,
	        |	ПРЕДСТАВЛЕНИЕ(МЕСЯЦ(уб_СтраховойПолисСписокФайлов.Ссылка.Дата)) КАК Месяц,
	        |	ГОД(уб_СтраховойПолисСписокФайлов.Ссылка.Дата) КАК Год2,
	        |	МЕСЯЦ(уб_СтраховойПолисСписокФайлов.Ссылка.Дата) КАК Месяц2,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код) КАК amountFile
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.Код = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.Код = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ГОД(уб_СтраховойПолисСписокФайлов.Ссылка.Дата),
	        |	МЕСЯЦ(уб_СтраховойПолисСписокФайлов.Ссылка.Дата),
	        |	ПРЕДСТАВЛЕНИЕ(ГОД(уб_СтраховойПолисСписокФайлов.Ссылка.Дата)),
	        |	ПРЕДСТАВЛЕНИЕ(МЕСЯЦ(уб_СтраховойПолисСписокФайлов.Ссылка.Дата))
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Год2 УБЫВ,
	        |	Месяц2 УБЫВ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПРЕДСТАВЛЕНИЕ(ГОД(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Год,
	        |	ПРЕДСТАВЛЕНИЕ(МЕСЯЦ(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Месяц,
	        |	ГОД(уб_ФайлыКПолисамВходящие.ДатаРазмещения) КАК Год2,
	        |	МЕСЯЦ(уб_ФайлыКПолисамВходящие.ДатаРазмещения) КАК Месяц2
	        |ИЗ
	        |	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	        |ГДЕ
	        |	уб_ФайлыКПолисамВходящие.Поставщик.Код = &Поставщик
	        |	И уб_ФайлыКПолисамВходящие.ОргАгент.Код = &ОрганизацияАгент
	        |	И уб_ФайлыКПолисамВходящие.Размещен = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//чкн

//Страховой полис
Функция ДайТретийУровеньДерева(ДатаНачала, ОргАгент, Поставщик)
	СтруктураФайлов = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_ФайлыКПолисам.СтраховойПолис КАК СП,
	|	ВЫБОР
	|		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	|			ТОГДА ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.НомерОтчетаПоставщику, """")
	|		ИНАЧЕ ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Страхователь.Наименование, """")
	|	КОНЕЦ КАК Страхователь,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.УИД) КАК amountFile,
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """") КАК Номер,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.СтраховойПолис.ВидСП), """") КАК ВидСП
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	|		КОНЕЦ
	|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
	|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
	|	И уб_ФайлыКПолисам.СтраховойПолис.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ФайлыКПолисам.СтраховойПолис,
	|	ВЫБОР
	|		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	|			ТОГДА ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.НомерОтчетаПоставщику, """")
	|		ИНАЧЕ ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Страхователь.Наименование, """")
	|	КОНЕЦ,
	|	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """"),
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.СтраховойПолис.ВидСП), """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Страхователь");
	Запрос.УстановитьПараметр("ДатаНач",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ОрганизацияАгент",ОргАгент);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросТретийУровеньДерева();
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выгрузить();	
	
	For i = 0 to Выборка.Количество()-1 Do
		
		Если ТипЗнч(Выборка[i].СП) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
			title = уб_B2B.УбратьСимволы(Выборка[i].Страхователь) + " " + Выборка[i].ВидСП + " (" + Строка(Выборка[i].Номер) + ")";
		Иначе
			title = уб_B2B.УбратьСимволы(Выборка[i].Страхователь);
		КонецЕсли;
		
		amountFile = Выборка[i].amountFile;
		
		СтруктураФайлов.Вставить("f"+i, Новый Структура("cleaf, title, id, parent, amountFile",
		1,
		title,
		Выборка[i].СП.УникальныйИдентификатор(),
		Формат(ДатаНачала, "ДФ=""ггММ"""),
		amountFile));
		
	КонецЦикла;
	
	Возврат СтруктураФайлов;
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросТретийУровеньДерева()
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	уб_СтраховойПолисСписокФайлов.Ссылка КАК СП,
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Страхователь.Наименование, """") КАК Страхователь,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код) КАК amountFile,
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Номер, """") КАК Номер,
	        |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.Ссылка.ВидС), """") КАК ВидСП
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.Код = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.Код = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	уб_СтраховойПолисСписокФайлов.Ссылка,
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Страхователь.Наименование, """"),
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.Ссылка.Номер, """"),
	        |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.Ссылка.ВидС), """")
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Страхователь";
	
	Возврат Текст;
	
КонецФункции
//чкн

//ФОТО и тп
Функция ДайЧетвертыйУровеньДерева(СП)
	СтруктураФайлов = Новый Структура;
	
	//Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВЫБОР
	//|		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	//|			ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8)
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ВидФайлаB2B)
	//|	КОНЕЦ КАК ВидФайлаB2B,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.УИД) КАК amountFile
	//|ИЗ
	//|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	//|		КОНЕЦ
	//|	И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
	//|	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	//|			ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8)
	//|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ВидФайлаB2B)
	//|	КОНЕЦ
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ВидФайлаB2B");
	Запрос = Новый Запрос;   //РТ+ Новый Запрос
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8)
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ВидФайлаB2B)
	               |	КОНЕЦ КАК ВидФайлаB2B,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.УИД) КАК amountFile
	               |ИЗ
	               |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	               |		КОНЕЦ
	               |	И (уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
	               |			ИЛИ уб_ФайлыКПолисам.СтраховойПолис В
	               |				(ВЫБРАТЬ
	               |					СП.Заявка
	               |				ИЗ
	               |					документ.уб_СтраховойПолис как СП
	               |				ГДЕ
	               |					СП.Ссылка = &СтраховойПолис
	               |					И НЕ СП.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)))
	               |	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	               |			ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8)
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ВидФайлаB2B)
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидФайлаB2B";
	Запрос.УстановитьПараметр("СтраховойПолис",СП);
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросЧетвертыйУровеньДерева();
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выгрузить();	
	ЭтоОтчетПоставщику = ТипЗнч(СП) = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	Выборка.Колонки.Добавить("title");
	
	Для Каждого СтрокаТЗ Из Выборка Цикл
		Если ЭтоОтчетПоставщику Тогда
			СтрокаТЗ.title = Справочники.уб_ПечатныеФормы.НайтиПоКоду(Число(Сред(СтрокаТЗ.ВидФайлаB2B,3))).Наименование;
		Иначе
			СтрокаТЗ.title = СтрокаТЗ.ВидФайлаB2B;
		КонецЕсли;
	КонецЦикла;
	Выборка.Сортировать("title");
	For i = 0 to Выборка.Количество()-1 Do
		amountFile = Выборка[i].amountFile;
		СтруктураФайлов.Вставить("f"+i, Новый Структура("cleaf, title, id, parent, amountFile",
		0,
		Выборка[i].title,
		Выборка[i].ВидФайлаB2B,
		Строка(СП.УникальныйИдентификатор()),
		amountFile));
	КонецЦикла;
	
	Возврат СтруктураФайлов;
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросЧетвертыйУровеньДерева()
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B) КАК ВидФайлаB2B,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код) КАК amountFile
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B)
	        |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Текст;
	
КонецФункции
//чкн

//Файлы
Функция ДайПятыйУровеньДерева(СП, ВидФайла)
	СтруктураФайлов = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	уб_ФайлыКПолисам.ФайлИмя КАК name,
	                      |	ВЫБОР
	                      |		КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	                      |			ТОГДА уб_ФайлыКПолисам.ДатаПубликации
	                      |		ИНАЧЕ ЕСТЬNULL(уб_ФайлыКПолисам.ВидДокумента.Наименование, """")
	                      |	КОНЕЦ КАК name_short,
	                      |	уб_ФайлыКПолисам.УИД КАК id,
	                      |	уб_ФайлыКПолисам.ФайлРазмер КАК size,
	                      |	уб_ФайлыКПолисам.ФайлРасширение КАК elem_type,
	                      |	ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисам.ДатаПубликации) КАК date
	                      |ИЗ
	                      |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
	                      |				ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8) = &Параметр
	                      |			ИНАЧЕ уб_ФайлыКПолисам.ВидФайлаB2B = &Параметр
	                      |		КОНЕЦ
						  |	И (уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
						  |	//РТ+
	                      |			ИЛИ уб_ФайлыКПолисам.СтраховойПолис В
	                      |				(ВЫБРАТЬ
	                      |					СП.Заявка
	                      |				ИЗ
	                      |					документ.уб_СтраховойПолис как СП
	                      |				ГДЕ
	                      |					СП.Ссылка = &СтраховойПолис
	                      |					И НЕ СП.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)))
						  |//РТ-
	                      |	И уб_ФайлыКПолисам.Размещен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	name");
	Запрос.УстановитьПараметр("СтраховойПолис",СП);
	
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
	
	ЭтоОтчетПоставщика = ТипЗнч(СП) = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	Если ЭтоОтчетПоставщика Тогда
		ЗначениеПараметра = ВидФайла;
	Иначе
		ЗначениеПараметра = Перечисления.уб_ВидыФайловB2B[СтрЗаменить(ВидФайла, " ", "_")];
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр", ЗначениеПараметра);
	
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросПятыйУровеньДерева();
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выгрузить();
	Если ЭтоОтчетПоставщика Тогда
		Для Каждого СтрокаТЗ Из Выборка Цикл
			ДатаПубликации = СтрокаТЗ.name_short;
			СтрокаТЗ.name_short = Формат(ДатаПубликации, "ДФ=дд.ММ.гг");//+ " " + Формат(ДатаПубликации, "ДФ=ЧЧ-мм-сс")
		КонецЦикла;
	КонецЕсли;
	
	//For i = 0 to Выборка.Количество()-1 Do
	//	Структура3Влож = Новый Структура("name, name_short, id, size, elem_type, date",
	//									Выборка[i].name,
	//									Выборка[i].name_short,
	//									Выборка[i].id,
	//									Выборка[i].size,
	//									Выборка[i].elem_type,
	//									Строка(Выборка[i].date));
	//	СтруктураФайлов.Вставить("f"+i,Структура3Влож);
	//КонецЦикла;
	//
	//Возврат СтруктураФайлов;
	Возврат Выборка;
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросПятыйУровеньДерева()
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлИмя КАК name,
	        |	ЕСТЬNULL(уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидДокумента.Наименование, """") КАК name_short,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код КАК id,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлРазмер КАК size,
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлРасширение КАК elem_type,
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ДатаПубликации) КАК date
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B = &Параметр
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	name";
	
	Возврат Текст;
	
КонецФункции
//чкн

//**************************************

//ггММ для Incoming
Функция ДайТретийУровеньДереваIncoming(ОргАгент, Поставщик)
	СтруктураФайлов = Новый Структура;
	
	ЗапросIncoming = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	ПРЕДСТАВЛЕНИЕ(ГОД(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Год,
	                              |	ПРЕДСТАВЛЕНИЕ(МЕСЯЦ(уб_ФайлыКПолисамВходящие.ДатаРазмещения)) КАК Месяц,
	                              |	уб_ФайлыКПолисамВходящие.ДатаРазмещения,
	                              |	уб_ФайлыКПолисамВходящие.ДатаРазмещения КАК ДатаРазмещения1
	                              |ИЗ
	                              |	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	                              |ГДЕ
	                              |	уб_ФайлыКПолисамВходящие.Размещен = ИСТИНА
	                              |	И уб_ФайлыКПолисамВходящие.Поставщик.Код = &Поставщик
	                              |	И уб_ФайлыКПолисамВходящие.ОргАгент.Код = &ОрганизацияАгент");
	ЗапросIncoming.УстановитьПараметр("ОрганизацияАгент",ОргАгент);
	ЗапросIncoming.УстановитьПараметр("Поставщик",Поставщик);
	ВыборкаIncoming = ЗапросIncoming.Выполнить().Выгрузить();	
	For i = 0 to ВыборкаIncoming.Количество()-1 Do
		id = ?(СтрДлина(ВыборкаIncoming[i].Месяц)=1,
		Прав(ВыборкаIncoming[i].Год, 2) + "0" + ВыборкаIncoming[i].Месяц,
		Прав(ВыборкаIncoming[i].Год, 2) + ВыборкаIncoming[i].Месяц);
		МесяцП = Число(ВыборкаIncoming[i].Месяц);
		СтруктураФайлов.Вставить("f"+i,Новый Структура("cleaf, title, id, parent",
		0,
		МесяцПропписьюB2B(МесяцП) + " " + ВыборкаIncoming[i].Год + "г.",
		id,
		"INCOMING"));
	КонецЦикла;
	
	Возврат СтруктураФайлов;
КонецФункции

//Файлы
Функция ДайЧетвертыйУровеньДереваINCOMING(ДатаНачала, ОргАгент, Поставщик)
	СтруктураФайлов = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_ФайлыКПолисамВходящие.ИмяФайла КАК name,
	|	уб_ФайлыКПолисамВходящие.ИмяФайла КАК name_short,
	|	уб_ФайлыКПолисамВходящие.УИД КАК id,
	|	уб_ФайлыКПолисамВходящие.РазмерФайла КАК size,
	|	уб_ФайлыКПолисамВходящие.РасширениеФайла КАК elem_type,
	|	ПРЕДСТАВЛЕНИЕ(уб_ФайлыКПолисамВходящие.ДатаРазмещения) КАК date,
	|	уб_ФайлыКПолисамВходящие.Комментарий КАК comment
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	|ГДЕ
	|	уб_ФайлыКПолисамВходящие.Размещен = ИСТИНА
	|	И уб_ФайлыКПолисамВходящие.Поставщик.Код = &Поставщик
	|	И уб_ФайлыКПолисамВходящие.ОргАгент.Код = &ОргАгент
	|	И уб_ФайлыКПолисамВходящие.ДатаРазмещения МЕЖДУ &ДатаНач И &ДатаКон
	|
	|УПОРЯДОЧИТЬ ПО
	|	name");
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ОргАгент",ОргАгент);
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ДатаНачала));
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
КонецФункции

//*******************************************************************************


//Функция возвращает список СтраховыхПродуктов по параметру
// param - код СтраховойКомпании
// isauto - признак СтраховогоПродукта для авто
// isauto = 1, если ОСАГО, КАСКО, ДСАГО
// Справочник.уб_СтраховыеПродукты
Функция GetSP(param)
	Структура = Новый Структура;
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Представление(уб_СтраховыеПродукты.Вид) КАК code,
	|	Представление(уб_СтраховыеПродукты.Вид) КАК name,
	|	ВЫБОР
	|		КОГДА уб_СтраховыеПродукты.Вид В (&СписокСП)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК isauto
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты КАК уб_СтраховыеПродукты";
	Если param <> "-1" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	уб_СтраховыеПродукты.Владелец.Код = &СК";
		Запрос.УстановитьПараметр("СК",Строка(param));
	КонецЕсли;
	
	СписокСП = Новый СписокЗначений; //Виды для СП для машин
	СписокСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.ДСАГО);
	СписокСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО);
	СписокСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО);
	СписокСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО);
	СписокСП.Добавить(Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО);
	
	Запрос.УстановитьПараметр("СписокСП",СписокСП);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		Структура.Вставить("status", "ok");
		Структура.Вставить("data", Выборка);
	Иначе 
		Структура.Вставить("status", "error");
		Структура.Вставить("msg", "Пустой запрос!");
	КонецЕсли;
	возврат уб_B2B.JSON(Структура)
КонецФункции

//Функция возвращает путь до места хранение входящих файлов B2B
Функция GetCatalog()
	Возврат уб_B2B.JSON(Новый Структура("status, catalog", 
	"ok", 
	Новый Структура("code, name", 
	"incoming", 
	Справочники.уб_ХранилищаФайловБ2Б.INCOMING.Путь)))
КонецФункции

//Возвращает список МарокТранспортныхСредств
// Справочник.уб_МаркиТС
Функция GetMarkaTS(sid)
	ЗапросМаркаТС = Новый Запрос("ВЫБРАТЬ
	|	уб_МаркиТС.Код КАК code,
	|	уб_МаркиТС.Наименование КАК name
	|ИЗ
	|	Справочник.уб_МаркиТС КАК уб_МаркиТС
	|
	|УПОРЯДОЧИТЬ ПО
	|	name");
	
	ВыборкаМаркаТС = ЗапросМаркаТС.Выполнить().Выгрузить();
	
	Если ВыборкаМаркаТС.Количество() <> 0 Тогда
		For i = 0 to ВыборкаМаркаТС.Количество()-1 Do
			ВыборкаМаркаТС[i].name = СтрЗаменить(ВыборкаМаркаТС[i].name, """", "");
		КонецЦикла;
		Возврат уб_B2B.JSON( Новый Структура("status, data",
		"ok",
		ВыборкаМаркаТС));
	Иначе 
		Возврат уб_B2B.JSON( Новый Структура("status, msg",
		"error",
		"Марок транспортных средсв в базе не найдено. Обратитесь к Администратору"));
	КонецЕсли;
КонецФункции

//Возвращает список МоделейТранспортныхСредств по параметру
// param - код МаркиТС
// Справочник.уб_МоделиТС, по владельцу МаркаТС
Функция GetModelTS(sid, param)
	ЗапросМодельТС = Новый Запрос("ВЫБРАТЬ
	|	уб_МоделиТС.Код КАК code,
	|	уб_МоделиТС.Наименование КАК name
	|ИЗ
	|	Справочник.уб_МоделиТС КАК уб_МоделиТС
	|ГДЕ
	|	уб_МоделиТС.Владелец.Код = &Marka
	|
	|УПОРЯДОЧИТЬ ПО
	|	name");
	
	ЗапросМодельТС.УстановитьПараметр("Marka",Число(param));
	ВыборкаМодельТС = ЗапросМодельТС.Выполнить().Выгрузить();
	Если ВыборкаМодельТС.Количество() <> 0 Тогда
		Возврат уб_B2B.JSON( Новый Структура("status, data",
		"ok",
		ВыборкаМодельТС));
	Иначе
		Возврат уб_B2B.JSON( Новый Структура("status, msg",
		"error",
		"Моделей транспортных средств для марки: " + Справочники.уб_МаркиТС.НайтиПоКоду(param) + " в базе не найдено. Обратитесь к Администратору!"));
	КонецЕсли;
КонецФункции


Функция RecoverPassword(mail)
	
	User = Справочники.уб_ПользователиB2B.НайтиПоРеквизиту("mail", mail);
	Если ЗначениеЗаполнено(User) Тогда
		ТС = "Ваш пароль: " + user.Пароль;
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Получатели 	= mail;
		Параметры.Тема			= "Восстановление пароля B2B";
		Параметры.Сообщение		= ТС;
		ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
			Параметры.ОбратныйАдрес = ОбратныйАдрес;
		КонецЕсли;
		Отправлено = уб_ОбменДанными.SendMail(Параметры);
		Если Отправлено Тогда
			Возврат уб_B2B.JSON(Новый Структура("status", "ok"));
		Иначе
			Возврат уб_B2B.JSON(Новый Структура("status, msg", "error", "При восстановлении пароля возникла ошибка, обратитесь к администратору"));
		КонецЕсли;
	Иначе
		Возврат уб_B2B.JSON(Новый Структура("status, msg", "error", "Пользователь с адресом электронной почты '" + mail + "' в базе не найден, обратитесь к администратору"));	
	КонецЕсли;
	
КонецФункции

//Сделать проверку можно ли этому пользователю смотреть?
Функция GetFilePath(sid, id)
	//Вставить проверку если id > 36 символом ошибку!
	СтруктураПользователя = ДайДанныеПоSid(sid);
	НЗфайлы = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
	НЗфайлы.Отбор.УИД.Значение      = id;
	НЗфайлы.Отбор.УИД.Использование = Истина;
	НЗфайлы.Отбор.УИД.ВидСравнения 	= ВидСравнения.Равно;
	НЗфайлы.Прочитать();
	//КоличествоЗаписей = НЗфайлы.Выгрузить().Количество();
	КоличествоЗаписей = НЗфайлы.Количество();
	Если КоличествоЗаписей = 0 Тогда
		НЗфайлы = РегистрыСведений.уб_ФайлыКПолисамВходящие.СоздатьНаборЗаписей();
		НЗфайлы.Отбор.УИД.Значение      = id;
		НЗфайлы.Отбор.УИД.Использование = Истина;
		НЗфайлы.Отбор.УИД.ВидСравнения 	= ВидСравнения.Равно;
		НЗфайлы.Прочитать();
		Incoming = Истина;
	Иначе
		Incoming = Ложь;
	КонецЕсли;
	
	ПутьКХранилищу = ?(СокрЛП(НЗфайлы[0].Хранилище.Путь) = "","",НЗфайлы[0].Хранилище.Путь + "\");
	ПолныйПуть = ПутьКХранилищу + НЗфайлы[0].ПутьКПапке + "\" + ?(КоличествоЗаписей = 0, НЗфайлы[0].ИмяФайла, НЗфайлы[0].ФайлИмя);
	ПолныйПуть = СтрЗаменить(ПолныйПуть, "\", "\\");
	Структура = Новый Структура("status, path, sk, ggmm, type",
	"ok",
	ПолныйПуть,
	?(Incoming, СтруктураПользователя.Поставщик.Код ,НЗфайлы[0].СтраховойПолис.Поставщик.Код),
	?(Incoming, Формат(НЗфайлы[0].ДатаРазмещения, "ДФ=""ггММ""") ,Формат(НЗфайлы[0].СтраховойПолис.Дата, "ДФ=""ггММ""")),
	НЗфайлы[0].Хранилище);
	Возврат уб_B2B.JSON(Структура);
КонецФункции

//!!!ДУБЛИКАТЬ! см GetFilePath подумать как заменить
Функция GetFilesPath(sid, id)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
	                      |			ТОГДА """"
	                      |		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
	                      |	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
	                      |ИЗ
	                      |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	                      |ГДЕ
	                      |	уб_ФайлыКПолисам.УИД В(&УИДы)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(уб_ФайлыКПолисамВходящие.Хранилище.Путь, """") + ""\"" + уб_ФайлыКПолисамВходящие.ПутьКПапке + ""\"" + уб_ФайлыКПолисамВходящие.ИмяФайла
	                      |ИЗ
	                      |	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	                      |ГДЕ
	                      |	уб_ФайлыКПолисамВходящие.УИД В(&УИДы)");
	Запрос.УстановитьПараметр("УИДы", уб_B2B.UnJSON(id));
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		Запрос.Текст = ЗапросGetFilesPath();
	КонецЕсли;
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат уб_B2B.JSON(Рез);
КонецФункции

//чкн
//запрос для справочника файлов
Функция ЗапросGetFilesPath()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код В(&УИДы)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	ЕСТЬNULL(уб_ФайлыКПолисамВходящие.Хранилище.Путь, """") + ""\"" + уб_ФайлыКПолисамВходящие.ПутьКПапке + ""\"" + уб_ФайлыКПолисамВходящие.ИмяФайла
	        |ИЗ
	        |	РегистрСведений.уб_ФайлыКПолисамВходящие КАК уб_ФайлыКПолисамВходящие
	        |ГДЕ
	        |	уб_ФайлыКПолисамВходящие.УИД В(&УИДы)";
	
	Возврат Текст;
	
КонецФункции
//чкн

//Вставить проверку можно смотреть пользователю или нет?
//Размещен или нет?
Функция GetFilePathId(sid, id)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	СтруктураФайлов = Новый Структура;
	НЗфайлы = РегистрыСведений.уб_ФайлыКПолисам.СоздатьНаборЗаписей();
	НЗфайлы.Отбор.УИД.Установить(id);
	НЗфайлы.Прочитать();
	
	Структура = Новый Структура;
	Структура.Вставить("status", "ok");
	Структура.Вставить("path", НЗфайлы[0].СтраховойПолис.Поставщик.Код + "," + НЗфайлы[0].СтраховойПолис.ОрганизацияАгент.Код + "/" + Формат(НЗфайлы[0].СтраховойПолис.Дата, "ДФ=""ггММ""") + "/" + НЗфайлы[0].СтраховойПолис.УникальныйИдентификатор() + "/" + НЗфайлы[0].ВидФайлаB2B);
	
	Возврат уб_B2B.JSON(Структура);
КонецФункции

Функция GetFilesPathFromDir(sid, id)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	СписокId = уб_B2B.UnJSON(id);
	
	РезультатОбъединения = Новый ТаблицаЗначений;
	РезультатОбъединения.Колонки.Добавить("path");
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	Для Каждого СтрокаId Из СписокId Цикл
		//Разбиваем полученную строку на массив
		СтруктураПараметров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаId, "/");
		КоличествоПараметров = СтруктураПараметров.Количество();
		
		Если КоличествоПараметров = 1 Тогда
			МассивПервогоПараметра		= ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров[0]);
			КоличествоПервогоПараметра	= МассивПервогоПараметра.Количество();
			
			//Это файл
			Если КоличествоПервогоПараметра = 1 Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
				|			ТОГДА """"
				|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
				|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
				|ИЗ
				|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				|ГДЕ
				|	уб_ФайлыКПолисам.УИД = &УИД
				|	И уб_ФайлыКПолисам.Размещен
				|	И ВЫБОР
				|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
				|		КОНЕЦ");
				
				Запрос.УстановитьПараметр("УИД", СтрокаId);
				Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
				Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
					Запрос.Текст = GetFilesPathFromDirI();
				КонецЕсли;
				Рез = Запрос.Выполнить().Выгрузить();
				//Это путь папки 1 уровня Поставщик-ОргАгент
			Иначе
				ПараметрПоставщик	= МассивПервогоПараметра[0];
				ПараметрОргАгент	= МассивПервогоПараметра[1];
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
				|			ТОГДА """"
				|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
				|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
				|ИЗ
				|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				|ГДЕ
				|	ВЫБОР
				|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
				|		КОНЕЦ
				|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
				|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
				|	И уб_ФайлыКПолисам.Размещен");
				Запрос.УстановитьПараметр("Поставщик", ПараметрПоставщик);
				Запрос.УстановитьПараметр("ОрганизацияАгент", ПараметрОргАгент);
				Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
				Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
					Запрос.Текст = GetFilesPathFromDirII();
				КонецЕсли;
				Рез = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			//Это путь папки 2 уровня Поставщик-ОргАгент/дата
		ИначеЕсли КоличествоПараметров = 2 Тогда
			МассивПервогоПараметра		= ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров[0]);
			ПараметрПоставщик	= МассивПервогоПараметра[0];
			ПараметрОргАгент	= МассивПервогоПараметра[1];
			ДатаНачала = Дата("20" + СтруктураПараметров[1] + "01");
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ
			|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
			|	И уб_ФайлыКПолисам.СтраховойПолис.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
			|	И уб_ФайлыКПолисам.Размещен");
			
			Запрос.УстановитьПараметр("ДатаНач",ДатаНачала);
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ДатаНачала));					  
			
			Запрос.УстановитьПараметр("Поставщик", ПараметрПоставщик);
			Запрос.УстановитьПараметр("ОрганизацияАгент", ПараметрОргАгент);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
				Запрос.Текст = GetFilesPathFromDirIII();
			КонецЕсли;
			Рез = Запрос.Выполнить().Выгрузить();
			//Это путь папки 3 уровня Поставщик-ОргАгент/дата/СП
		ИначеЕсли КоличествоПараметров = 3 Тогда
			НовыйУИД = Новый УникальныйИдентификатор(СтруктураПараметров[2]);
			ПараметрСП = Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
			Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
				ПараметрСП = Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	уб_ФайлыКПолисам.Размещен
			|	И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
			|	И ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ");
			
			Запрос.УстановитьПараметр("СтраховойПолис", ПараметрСП);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
				Запрос.Текст = GetFilesPathFromDirIV();
			КонецЕсли;
			Рез = Запрос.Выполнить().Выгрузить();
			
			//Это путь папки 4 уровня Поставщик-ОргАгент/дата/СП/Вид
		ИначеЕсли КоличествоПараметров = 4 Тогда
			НовыйУИД = Новый УникальныйИдентификатор(СтруктураПараметров[2]);
			ПараметрСП	= Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
			Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
				ПараметрСП	= Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
				ЗначениеПараметра = СтруктураПараметров[3];
			Иначе
				ЗначениеПараметра = Перечисления.уб_ВидыФайловB2B[СтрЗаменить(СтруктураПараметров[3], " ", "_")];
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ
			|	И уб_ФайлыКПолисам.Размещен
			|	И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
			|	И ВЫБОР
			|			КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|				ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8) = &Параметр
			|			ИНАЧЕ уб_ФайлыКПолисам.ВидДокумента.ВидФайлаB2B = &Параметр
			|		КОНЕЦ");
			
			Запрос.УстановитьПараметр("СтраховойПолис", ПараметрСП);
			Запрос.УстановитьПараметр("Параметр", ЗначениеПараметра);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
				Запрос.Текст = GetFilesPathFromDirV();
			КонецЕсли;
			Рез = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		Для каждого строка из Рез Цикл
			НовСтр = РезультатОбъединения.Добавить();
			НовСтр.path = строка.path;
		КонецЦикла;
		
	КонецЦикла;

	Возврат уб_B2B.JSON(РезультатОбъединения);
КонецФункции

//чкн
//запрос для справочника файлов
Функция GetFilesPathFromDirI()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Код = &УИД
	        |	И ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//запрос для справочника файлов
Функция GetFilesPathFromDirII()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.Код = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.Код = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//запрос для справочника файлов
Функция GetFilesPathFromDirIII()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.ОрганизацияАгент.Код = &ОрганизацияАгент
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка.Поставщик.Код = &Поставщик
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//запрос для справочника файлов
Функция GetFilesPathFromDirIV()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис
	        |	И ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//запрос для справочника файлов
Функция GetFilesPathFromDirV()
	Текст = "ВЫБРАТЬ
	        |	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолисСписокФайлов.ПолноеИмя) КАК path
	        |ИЗ
	        |	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ ЛОЖЬ
	        |		КОНЕЦ
	        |	И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис
	        |	И уб_СтраховойПолисСписокФайлов.ВидДокумента.ВидФайлаB2B = &Параметр
	        |	И уб_СтраховойПолисСписокФайлов.Опубликован = ИСТИНА";
	
	Возврат Текст;
	
КонецФункции
//чкн

//Добавляем документ
Функция AddFile(sid, filename, comment)
	
	СтруктураПользователя = ДайДанныеПоSid(sid);
	
	NewFile = Новый Файл(filename);
	
	НовыйФайл = РегистрыСведений.уб_ФайлыКПолисамВходящие.СоздатьМенеджерЗаписи();
	НовыйФайл.ИмяФайла = NewFile.Имя;
	НовыйФайл.УИД = Строка(Новый УникальныйИдентификатор);
	НовыйФайл.РасширениеФайла = НРег(Прав(NewFile.Расширение, СтрДлина(NewFile.Расширение)-1));
	НовыйФайл.РазмерФайла = NewFile.Размер();
	НовыйФайл.Поставщик = СтруктураПользователя.Поставщик;
	НовыйФайл.ОргАгент = СтруктураПользователя.ОргАгент;
	НовыйФайл.Хранилище = Справочники.уб_ХранилищаФайловБ2Б.INCOMING;
	tempПуть = Прав(NewFile.Путь,СтрДлина(NewFile.Путь)-СтрДлина(Справочники.уб_ХранилищаФайловБ2Б.INCOMING.Путь)-1);
	НовыйФайл.ПутьКПапке = Лев(tempПуть, СтрДлина(tempПуть) - 1);
	НовыйФайл.Размещен = Истина;
	НовыйФайл.Комментарий = comment;
	НовыйФайл.Автор = СтруктураПользователя.Пользователь.ФизЛицо;
	НовыйФайл.ДатаРазмещения = ТекущаяДата();
	НовыйФайл.Записать(Истина);
	
	Возврат уб_B2B.JSON(Новый Структура("status", "ok"));
	
КонецФункции



Функция GetSavePath(sid)
	СтруктураПользователя = ДайДанныеПоSid(sid);
	
	Папка = "" + СтруктураПользователя.Поставщик.Folder + " - [" +СтруктураПользователя.ОргАгент.Folder + "]\" + Формат(ТекущаяДата(), "ДФ=""ггММ""") + "\";
	
	ПутьДоПапки = Новый Файл(Справочники.уб_ХранилищаФайловБ2Б.INCOMING.Путь + "\" + Папка);
	Если НЕ ПутьДоПапки.Существует() Тогда
		СоздатьКаталог(ПутьДоПапки.ПолноеИмя);
	КонецЕсли;
	
	Возврат уб_B2B.JSON(Новый Структура("status, data",
	"ok",
	Новый Структура("path", ПутьДоПапки.ПолноеИмя)))
КонецФункции


// УДАЛИТЬ!!!!!!!!!!


//Функция возвращает список Поставщиков и страховых компаний
// broker - принадлежность к группе поставщиков
// Справочник.Контрагенты, папки Поставщики и СтрахованыеКомпании
Функция GetPostavwik()
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Код КАК code,
	|	Контрагенты.Наименование КАК name,
	|	ВЫБОР
	|		КОГДА Контрагенты.Родитель.Ссылка = &ГруппаПоставщиков
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК broker
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И (Контрагенты.Родитель.Ссылка = &ГруппаПоставщиков
	|			ИЛИ Контрагенты.Родитель.Ссылка = &ГруппаСК)
	|
	|УПОРЯДОЧИТЬ ПО
	|	name";
	Запрос.УстановитьПараметр("ГруппаПоставщиков",ПараметрыСеанса.уб_Константы.уб_ГруппаПоставщиков);
	Запрос.УстановитьПараметр("ГруппаСК",ПараметрыСеанса.уб_Константы.уб_ГруппаСК);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob = уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция возвращает список Организаций
// Справочник.Организации
Функция GetOrganizacii()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Код КАК code,
	|	Организации.Наименование КАК name
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	name";
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob =  уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция возвращает список СтраховыхКомпаний
// Справочник.Контрагенты, папка СтраховыеКомпании
Функция GetSK()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Код КАК code,
	|	Контрагенты.Наименование КАК name
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Родитель.Ссылка = &СтраховыеКомпании
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	name";
	Запрос.УстановитьПараметр("СтраховыеКомпании",ПараметрыСеанса.уб_Константы.уб_ГруппаСК);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob = уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция возвращает список Сотрудников
// Справочник.ФизическиеЛица, папка Сотрудники 
Функция GetSotrudniki()
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Код КАК code,
	|	ФизическиеЛица.Наименование КАК name
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Родитель.Ссылка = &Сотрудники
	|	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	name";
	Запрос.УстановитьПараметр("Сотрудники",ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудников);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob = уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция возвращает список Курьеров
// Справочник.ФизическиеЛица, папка Курьеры
Функция GetKurier()
	Структура = Новый Структура;
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Код КАК code,
	|	ФизическиеЛица.Наименование КАК name
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Родитель.Ссылка = &Сотрудники
	|	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	name";
	Запрос.УстановитьПараметр("Сотрудники",ПараметрыСеанса.уб_Константы.уб_ГруппаСотрудниковКурьеров);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		Структура.Вставить("status", "ok");
		Структура.Вставить("data", Запрос.Выполнить().Выгрузить());
	Иначе 
		Структура.Вставить("status", "error");
		Структура.Вставить("msg", "Пустой запрос!");
	КонецЕсли;
	Возврат уб_B2B.JSON(Структура);
КонецФункции

//Функция возвращает список Страхователей
// param - код СтраховойКомпании
// date - примерная дата СтраховогоПолюса
// от этой даты +/- 14 дней (1209600 в секундах)
// требует доработки на вывод созданных через сайт
Функция GetStrahovatel(param, date)
	Попытка
		date = СтрЗаменить(date, "-", "");
		date = Дата(date);
	Исключение 
		Возврат "[{ ""code"":""0"", ""name"":""Некорректно заполнено поле Дата"" }]"
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА уб_СтраховойПолис.Страхователь.Родитель = &ГруппаЮрЛиц
	|			ТОГДА ""U"" + ЕстьNULL(уб_СтраховойПолис.Страхователь.Код, """")
	|		ИНАЧЕ ""F"" + ЕстьNULL(уб_СтраховойПолис.Страхователь.Код, """")
	|	КОНЕЦ КАК code,
	|	ЕстьNULL(уб_СтраховойПолис.Страхователь.Наименование, """") КАК name,
	|	ВЫБОР
	|		КОГДА уб_СтраховойПолис.Страхователь.Родитель = &ГруппаЮрЛиц
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК isindividual
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|ГДЕ
	|	уб_СтраховойПолис.СК = &СК
	|	И уб_СтраховойПолис.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""U"" + Контрагенты.Код,
	|	Контрагенты.Наименование,
	|	0
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Родитель = &ГруппаЮрЛиц
	|	И Контрагенты.Автор = &Автор
	|	И Контрагенты.ДатаСоздания > &ДатаСоздания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""F"" + ЕстьNULL(ФизическиеЛица.Код, """"),
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))),
	|	1
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	ФизическиеЛица.Автор = &Автор
	|	И ФизическиеЛица.ДатаСоздания > &ДатаСоздания
	|
	|УПОРЯДОЧИТЬ ПО
	|	name";
	//
	Запрос.УстановитьПараметр("СК",Справочники.Контрагенты.НайтиПоКоду(param));
	Запрос.УстановитьПараметр("ГруппаЮрЛиц", ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейЮрЛиц);
	Запрос.УстановитьПараметр("ГруппаФизЛиц", ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейЮрЛиц);
	Запрос.УстановитьПараметр("ДатаНач", date - 1209600);// минус 2 недели
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(date + 1209600));// плюс 2 недели
	Запрос.УстановитьПараметр("ДатаСоздания", ТекущаяДата() - 2419200);//минус месяц
	Запрос.УстановитьПараметр("Автор", Справочники.Пользователи.НайтиПоКоду("ws"));
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob = уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция возвращает список докуметов
//Перечисление.уб_ВидыФайловB2B
Функция GetDocType()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Представление(уб_ВидыФайловB2B.Ссылка) КАК code,
	|	Представление(уб_ВидыФайловB2B.Ссылка) КАК name
	|ИЗ
	|	Перечисление.уб_ВидыФайловB2B КАК уб_ВидыФайловB2B";
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob = уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob = "[]";
	КонецЕсли;
	Возврат ob;
КонецФункции

//Функция создает нового страхователя ФизическиеЛица
// familija, imja, otchestvo - ФИО, задается отдельно
// birthday - дата рождения (YYYY-MM-DD)
// sex - пол.
//   male-мужской
//   female - женский
// Проверка на заполнение всех полей, дату на корректность
// Проверка на дубликаты. Ищет запросом по ФИО(Наименование), ДатаРождения, Пол
Функция CreateStrahovatelF(familija, imja, otchestvo, birthday, sex)
	error = "";
	Если familija = "" Или  imja = "" Или otchestvo = "" Или birthday = "" Или sex = "" Тогда 
		Если familija = "" Тогда error = error + "фамилия "; КонецЕсли;
		Если imja = "" Тогда error = error + "имя "; КонецЕсли;
		Если otchestvo = "" Тогда error = error + "отчество "; КонецЕсли;
		Если birthday = "" Тогда error = error + "дату рождения "; КонецЕсли;
		Если sex = "" Тогда error = error + "пол "; КонецЕсли;
		Возврат "[{ ""code"":""0"", ""name"":""Заполните следующие поля:"+error+" }]"
	КонецЕсли;	
	Попытка
		birthday = СтрЗаменить(birthday, "-", "");
		birthday = Дата(birthday);
	Исключение 
		Возврат "[{ ""code"":""0"", ""name"":""Некорректно заполнено поле Дата рождения"" }]"
	КонецПопытки;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Код КАК code,
	|	ФизическиеЛица.Наименование КАК name
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Наименование = &Наименование
	|	И ФизическиеЛица.ДатаРождения = &ДатаРождения
	|	И ФизическиеЛица.Пол = &Пол";
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Familija) + " " + СокрЛП(Imja) + " " + СокрЛП(Otchestvo));
	Запрос.УстановитьПараметр("ДатаРождения", birthday);
	Если sex = "male" Тогда
		Запрос.УстановитьПараметр("Пол", Перечисления.ПолФизическихЛиц.Мужской);
	ИначеЕсли sex = "female" Тогда
		Запрос.УстановитьПараметр("Пол", Перечисления.ПолФизическихЛиц.Женский);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		Возврат уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	НовыйСтрахователь = Справочники.ФизическиеЛица.СоздатьЭлемент();
	НовыйСтрахователь.Наименование = СокрЛП(Familija) + " " + СокрЛП(Imja) + " " + СокрЛП(Otchestvo);
	НовыйСтрахователь.Родитель = ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейФизЛиц;
	НовыйСтрахователь.Автор = Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	ТекДата = ТекущаяДата();
	НовыйСтрахователь.ДатаСоздания = ТекДата;
	НовыйСтрахователь.ДатаИзменения = ТекДата;
	НовыйСтрахователь.Модификатор = НовыйСтрахователь.Автор;
	НовыйСтрахователь.Комментарий = "B2B";
	Если sex = "male" Тогда
		НовыйСтрахователь.Пол = Перечисления.ПолФизическихЛиц.Мужской;
	ИначеЕсли sex = "female" Тогда
		НовыйСтрахователь.Пол = Перечисления.ПолФизическихЛиц.Женский;
	КонецЕсли;
	НовыйСтрахователь.ДатаРождения = birthday;
	НовыйСтрахователь.Записать();
	МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ФизЛицо = НовыйСтрахователь.Ссылка;
	МенеджерЗаписи.Падеж = Перечисления.Падежи.Именительный;
	МенеджерЗаписи.Период = '19000101';
	МенеджерЗаписи.Фамилия = СокрЛП(Familija);
	МенеджерЗаписи.Имя = СокрЛП(Imja);
	МенеджерЗаписи.Отчество = СокрЛП(Otchestvo);
	МенеджерЗаписи.Записать(Истина);
	Возврат "[{ ""code"":""" + НовыйСтрахователь.Код + """, ""name"":""" + НовыйСтрахователь.Наименование + """ }]";
КонецФункции

//Функция возвращает список
//
Функция CreateStrahovatelU(name)
	Если name<>"" Тогда
		НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Name);
		Если НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			НовыйСтрахователь = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйСтрахователь.Наименование = name;
			НовыйСтрахователь.Родитель = ПараметрыСеанса.уб_Константы.уб_ГруппаСтрахователейЮрЛиц;
			НовыйСтрахователь.Автор = Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			НовыйСтрахователь.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			НовыйСтрахователь.НаименованиеПолное = name;
			НовыйСтрахователь.НаименованиеКраткое = name;
			ТекДата = ТекущаяДата();
			НовыйСтрахователь.ДатаСоздания = ТекДата;
			НовыйСтрахователь.ДатаИзменения = ТекДата;
			НовыйСтрахователь.Модификатор = НовыйСтрахователь.Автор;
			НовыйСтрахователь.Комментарий = "B2B";
			НовыйСтрахователь.Записать();
			НовыйСтрахователь.ГоловнойКонтрагент = НовыйСтрахователь.Ссылка;
			НовыйСтрахователь.Записать();
			Возврат "[{ ""code"":""" + НовыйСтрахователь.Код + """, ""name"":""" + НовыйСтрахователь.Наименование + """ }]"
		Иначе
			Возврат "[{ ""code"":""" + НайденныйКонтрагент.Код + """, ""name"":""" + НайденныйКонтрагент.Наименование + """ }]"
		КонецЕсли;
		
	Иначе
		Возврат "[{ ""code"":""0"", ""name"":""Введите имя!+" + ПользователиИнформационнойБазы.ТекущийПользователь().Имя + "  "" }]"
	КонецЕсли;
КонецФункции

//Функция возвращает название папки по параметрам
// post - КодПоставщика, справочник контрагентов папка поставщиков
// org - КодОрганизации, справочник организации
// при необходимости вставить проверку на принадлежность папке поставщиков
// используется на сайте для хранения информации
Функция GetFolderName(post, org)
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Folder + "" - ["" + Организации.Folder  + ""]"" КАК code,
	|	Контрагенты.Folder + "" - ["" + Организации.Folder + ""]"" КАК Folder 
	|ИЗ
	|	Справочник.Организации КАК Организации,
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Организации.Код = &org
	|	И Контрагенты.Код = &post";
	Запрос.УстановитьПараметр("post",post);
	Запрос.УстановитьПараметр("org",org);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() <> 0 Тогда
		ob =  уб_B2B.JSON(Запрос.Выполнить().Выгрузить());
	Иначе ob="[]";
	КонецЕсли;
	Возврат ob
КонецФункции

Функция МесяцПропписьюB2B (Месяц_П)
	
	Если Месяц_П = 1 Тогда
		Месяц_П = "Январь";
	ИначеЕсли Месяц_П = 2 Тогда
		Месяц_П = "Февраль";
	ИначеЕсли Месяц_П = 3 Тогда
		Месяц_П = "Март";
	ИначеЕсли Месяц_П = 4 Тогда
		Месяц_П = "Апрель";
	ИначеЕсли Месяц_П = 5 Тогда
		Месяц_П = "Май";
	ИначеЕсли Месяц_П = 6 Тогда
		Месяц_П = "Июнь";
	ИначеЕсли Месяц_П = 7 Тогда
		Месяц_П = "Июль";
	ИначеЕсли Месяц_П = 8 Тогда
		Месяц_П = "Август";
	ИначеЕсли Месяц_П = 9 Тогда
		Месяц_П = "Сентябрь";
	ИначеЕсли Месяц_П = 10 Тогда
		Месяц_П = "Октябрь";	
	ИначеЕсли Месяц_П = 11 Тогда
		Месяц_П = "Ноябрь";	 	
	ИначеЕсли Месяц_П = 12 Тогда
		Месяц_П = "Декабрь";
	ИначеЕсли НЕ ЗначениеЗаполнено(Месяц_П) Тогда
		Месяц_П = "Неопределено";		
	КонецЕсли;
	
	
	Возврат Строка(Месяц_П);
КонецФункции

Функция GetProviderList()
	//СтруктураПользователя = ДайДанныеПоSid(sid);
	//Если СтруктураПользователя.Пользователь.Пустая() Тогда
	//	Структура = Новый Структура("status, list","error","Пользователь в базе не найден, обратитесь к администратору!");
	//Иначе
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕстьNULL(уб_ГруппыДоговораB2B.Поставщик.Код, """") как Code,
	|	ЕстьNULL(уб_ГруппыДоговораB2B.Поставщик.Наименование, """") как Descr
	|ИЗ
	|	Справочник.уб_ГруппыДоговораB2B КАК уб_ГруппыДоговораB2B";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой()	Тогда
		Структура = Новый Структура("status, list","error","Отсутствуют группы пользователей B2B!");
	Иначе	
		Структура = Новый Структура("status, list","ok", Результат.Выгрузить());
	КонецЕсли;
	//КонецЕсли;	
	Возврат  уб_B2B.JSON(Структура)
	
КонецФункции

Функция GetOrgList()
	//СтруктураПользователя = ДайДанныеПоSid(sid);
	//Если СтруктураПользователя.Пользователь.Пустая() Тогда
	//	Структура = Новый Структура("status, list","error","Пользователь в базе не найден, обратитесь к администратору!");
	//Иначе
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕстьNULL(уб_ГруппыДоговораB2B.ОргАгент.Код, """") КАК Code,
	|	ЕстьNULL(уб_ГруппыДоговораB2B.ОргАгент.Наименование, """") КАК Descr
	|ИЗ
	|	Справочник.уб_ГруппыДоговораB2B КАК уб_ГруппыДоговораB2B";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой()	Тогда
		Структура = Новый Структура("status, list","error","Отсутствуют группы пользователей B2B!");
	Иначе	
		Структура = Новый Структура("status, list","ok", Результат.Выгрузить());
	КонецЕсли;
	//КонецЕсли;	
	Возврат  уб_B2B.JSON(Структура)
	
КонецФункции
