
Функция ЦветСтатуса(Статус) Экспорт
	пСтатусы = Перечисления.уб_СтатусыЗаявкиНаПечать;
	Если Статус = пСтатусы.ВведенаМенеджером Тогда
		Возврат Новый Цвет(250,200,200);
	ИначеЕсли Статус = пСтатусы.Заполняется Тогда
		Возврат Новый Цвет(255,255,155);
	ИначеЕсли Статус = пСтатусы.Проверена Тогда	
		Возврат Новый Цвет(255,255,155);
	ИначеЕсли Статус = пСтатусы.ВыполненаКалькуляция Тогда	
		Возврат Новый Цвет(212,255,155);
	ИначеЕсли Статус = пСтатусы.ОтправленаВСК Тогда
		Возврат Новый Цвет(120, 255, 130);
	ИначеЕсли Статус = пСтатусы.ПринятаСК Тогда	
		Возврат Новый Цвет();
	ИначеЕсли Статус = пСтатусы.НаДоработкеМенеджера Тогда			
		Возврат Новый Цвет(255, 155, 50);
	ИначеЕсли Статус = пСтатусы.КомплектДокументовПодготовлен Тогда		
		Возврат Новый Цвет(120, 255, 130);
	ИначеЕсли Статус = пСтатусы.КомплектДокументовОтдан Тогда			
		Возврат Новый Цвет(120, 255, 130);
	Иначе
		Возврат Новый Цвет();
	Конецесли;	
	
КонецФункции	