
Функция РазделитьНомерПолиса(НомерПолиса, СК) Экспорт

	текНомер = СокрЛП(НомерПолиса);
	
	Если ПустаяСТрока(текНомер) Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Пустой номер передан в функцию РазделитьНомерПолиса() по СК: " + СК,, Истина);
		Возврат Новый Структура("Серия, Номер, Суффикс", "", текНомер, "");
	КонецЕсли;
	//серии
	СЗСерий		= СписокСерийПоступленияНомеровПолисов(СК, "СерияПолиса");
	текДлина 	= 0;
	текСерия 	= "";
	Для Каждого Значение Из СЗСерий Цикл
		Серия 		= СокрЛП(Значение);
		ДлинаСерии	= СтрДлина(Серия);
		Если ДлинаСерии > текДлина И Лев(текНомер, ДлинаСерии) = Серия Тогда
			текДлина = ДлинаСерии;
			текСерия = Серия;
		КонецЕсли;
	КонецЦикла;
	//Обрезка префикса/серии
	текНомер 	= Сред(текНомер, текДлина + 1);
	//суффиксы
	СЗСуффиксов = СписокСерийПоступленияНомеровПолисов(СК, "СуффиксПолиса");
	текДлина 	= 0;
	текСуффикс 	= "";
	Для Каждого Значение Из СЗСуффиксов Цикл
		Суффикс			= СокрЛП(Значение);
		ДлинаСуффикса   = СтрДлина(Суффикс);
		Если ДлинаСуффикса > текДлина И Прав(текНомер, ДлинаСуффикса) = Суффикс Тогда
			текДлина 	= ДлинаСуффикса;
			текСуффикс 	= Суффикс;
		КонецЕсли;
	КонецЦикла;
	//Обрезка суффикса
	текНомер = Сред(текНомер, 1, СтрДлина(текНомер) - текДлина);
	
	//попытка преобразовать в число
	Если ПустаяСТрока(текНомер) Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Пустой номер " +НомерПолиса+" в РазделитьНомерПолиса() после обрезки суффиксов и префиксов по СК: " + СК ,,Истина);
		Возврат Новый Структура("Серия, Номер, Суффикс", "", НомерПолиса, "");
	Иначе	
		Попытка
			Число = Число(текНомер);
			Возврат Новый Структура("Серия, Номер, Суффикс", текСерия, текНомер, текСуффикс);
		Исключение
			тОшибки = ОписаниеОшибки();
			тОшибки = ?(Найти(тОшибки,"Преобразование значения к типу Число не может быть выполнено")>0,"",тОшибки);//Уже известное не выводим.
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Преобразование значения к типу Число не может быть выполнено "+текНомер+" в РазделитьНомерПолиса("+НомерПолиса+") по СК: " + СК + " " + тОшибки,,Истина);
			Возврат Новый Структура("Серия, Номер, Суффикс", "", НомерПолиса, "");
		КонецПопытки;
	КонецЕсли;
КонецФункции // РазделитьНомерПолиса()

Функция СписокСерийПоступленияНомеровПолисов(СК, Реквизит) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПНП." + Реквизит + " КАК Поле
	|ИЗ
	|	Документ.уб_ПоступлениеНомеровПолисов.НомераПолисов КАК ПНП
	|ГДЕ
	|	ПНП.Ссылка.СК = &СК
	|	И ПНП." + Реквизит + " <> """"");
	Запрос.УстановитьПараметр("СК", СК);
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Поле"));
	Возврат СЗ;

КонецФункции // СЗСерийПоступленийНомеровПолисов()

