////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция БылиДвиженияНомеров()

	ЕстьДвижения = Ложь;
	Для Каждого СтрокаТЧ Из НомераПолисов Цикл
		
		ТЗ = уб_СтраховойБрокер.СформироватьСписокНомеровПолисов(СтрокаТЧ);
		МассивНомеровПолисов = ТЗ.ВыгрузитьКолонку("НомерПолиса");
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Д.НомерПолиса
		               |ИЗ
		               |	РегистрСведений.уб_СвободныеНомераПолисов КАК Д
		               |ГДЕ
		               |	Д.Период > &НаДату
		               |	И Д.СК = &СК
		               |	И Д.НомерПолиса В(&МассивНомеровПолисов)
		               |	И Д.Регистратор <> &Ссылка";
			
		Запрос.УстановитьПараметр("НаДату", МоментВремени().Дата);
		Запрос.УстановитьПараметр("СК", СК);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("МассивНомеровПолисов", МассивНомеровПолисов);
			
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
			
		ЕстьДвижения = НЕ Результат.Пустой();
		Если ЕстьДвижения Тогда
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ЕстьДвижения;
	
КонецФункции

Процедура ПроверитьИспользованиеНомеровПолисов(ТЗ, Отказ, Заголовок) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д.НомерПолиса,
	               |	Д.Регистратор
	               |ИЗ
	               |	РегистрСведений.уб_СвободныеНомераПолисов КАК Д
	               |ГДЕ
	               |	Д.СК = &СК
	               |	И Д.НомерПолиса В(&СписокНомеров)
	               |	И Д.КодОперации В(&СписокОпераций)
	               |	И Д.Регистратор ССЫЛКА Документ.уб_ПоступлениеНомеровПолисов";
	
	СписокОпераций = Новый Массив;
	СписокОпераций.Добавить(Перечисления.уб_КодыОперацийНомеровПолисов.ПолучениеНомера);
	Запрос.УстановитьПараметр("СписокОпераций", СписокОпераций);
	Запрос.УстановитьПараметр("СК", СК);
	Запрос.УстановитьПараметр("СписокНомеров", ТЗ.ВыгрузитьКолонку("НомерПолиса"));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	Выборка = Результат.Выбрать();
	Счетчик = 0;
	Пока Выборка.Следующий() И Счетчик < 10 Цикл
		Счетчик = Счетчик + 1;
		СтрокаСообщения = "Номер полиса """ + Выборка.НомерПолиса + """ уже внесен в систему документом: "+ Строка(Выборка.Регистратор);
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
	КонецЦикла;
	
	Если Выборка.Количество()>10 Тогда
		СтрокаСообщения = "Всего найдено " + Выборка.Количество() + " полисов, уже внесенных в систему."+ Строка(Выборка.Регистратор);
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли	
КонецПроцедуры

 // Проверяет правильность заполнения строк табличной части.
//
// Параметры: 
//  Отказ		- флаг отказа в проведении.
//  Заголовок	- строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиНомераПолисов(Отказ, Заголовок)

	Для Каждого СтрокаТЧ Из НомераПолисов Цикл
		Если СтрокаТЧ.КоличествоПолисов < 1 Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) + ": ";
			СтрокаСообщения = "Количество номеров полисов равно 0";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОбязательныхПолей = Новый Структура("ВидНумерации");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "НомераПолисов", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиБСО()

// Формируем движения по регистрам.
//
Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	Для Каждого СтрокаТЧ Из НомераПолисов Цикл
		ТЗ = уб_СтраховойБрокер.СформироватьСписокНомеровПолисов(СтрокаТЧ);
		ПроверитьИспользованиеНомеровПолисов(ТЗ, Отказ, Заголовок);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			Движение = Движения.уб_СвободныеНомераПолисов.Добавить();
			// измерения
			Движение.Период				= Дата;
			Движение.СК					= СК;
			Движение.Поставщик		 	= Поставщик;
			Движение.ОрганизацияАгент 	= ОрганизацияАгент;
			Движение.НомерПолиса		= СтрокаТЗ.НомерПолиса;
			// ресурсы
			Движение.ВидНумерации		= СтрокаТЧ.ВидНумерации;
			Движение.ГодПолиса			= СтрокаТЧ.ГодПолиса;
			Движение.НомерИспользован	= Ложь;
			Движение.НомерЗаблокирован 	= Ложь;
			Движение.НомерЗарезервирован= Ложь;			
			Движение.КодОперации	 	= Перечисления.уб_КодыОперацийНомеровПолисов.ПолучениеНомера;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Функция КраткийСоставДокумента()

	КСД = "";
	Для Каждого СтрокаТЧ Из НомераПолисов Цикл
		КСД = КСД + СокрЛП(СтрокаТЧ.СерияПолиса) + СтрокаТЧ.НачНомерПолиса + ?(СтрокаТЧ.КонНомерПолиса = СтрокаТЧ.НачНомерПолиса Или ПустаяСтрока(СтрокаТЧ.КонНомерПолиса), "", "-" + СтрокаТЧ.КонНомерПолиса) + СокрЛП(СтрокаТЧ.СуффиксПолиса) + ", "
	КонецЦикла;
	Возврат Сред(КСД, 1, СтрДлина(КСД) - 2)

КонецФункции // КраткийСоставДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, Режим)
	 
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	ПроверитьЗаполнениеТабличнойЧастиНомераПолисов(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если БылиДвиженияНомеров() Тогда
		#Если Клиент Тогда
		Если Вопрос("Один или несколько номеров уже были использованы. Все равно отменить проведение?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Найдены документы, использующие номера полисов. Нельзя отменить проведение!","Сообщить");
			//ОбщегоНазначения.СообщитьОбОшибке("Найдены документы, использующие номера полисов. Нельзя отменить проведение!", Отказ);
			Возврат;
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КСД = КраткийСоставДокумента();
	УстановитьЗначение(КраткийСоставДокумента, КСД);
	
КонецПроцедуры



