
//Процедура открывает форму поиска БСО по переданной строки
//также вызывается из фомы таблицы БСО
Процедура ОткрытьПоискБСО(ТекДанные, Владелец = Неопределено, ПередаватьТолькоНомер = Ложь) Экспорт
	
	#Если Клиент Тогда
		НомерЗаявки = ТекДанные.ЗаявкаНомер;
		ФормаПоиска = ПолучитьОбщуюФорму("уб_ПоискНомераБСО", Владелец);
		Параметры = Новый Структура("СК, ВидБСО, НомерБСО, ИскатьВДокументах, ИскатьВОплатах", 
		ТекДанные.СК, ТекДанные.ВидБСО, ТекДанные.НомерБСО, Истина, Истина);
		Если ПередаватьТолькоНомер Тогда
			Параметры.СК 			= Неопределено;
			Параметры.ВидБСО 		= Неопределено;
		КонецЕсли;
		ФормаПоиска.НомерЗаявки = НомерЗаявки;
		ФормаПоиска.Параметры 	= Параметры;
		Если ЗначениеЗаполнено(НомерЗаявки) Тогда
			ФормаПоиска.СтруктураИскомойСтроки = Новый Структура("НомерБСО, НомерЗаявки", ТекДанные.НомерБСО, НомерЗаявки); 
			ФормаПоиска.Заголовок = ФормаПоиска.Заголовок + " (текущая заявка № " + НомерЗаявки + ")";
		Иначе
			ФормаПоиска.СтруктураИскомойСтроки = Новый Структура("НомерБСО", ТекДанные.НомерБСО)
		КонецЕсли;
		ФормаПоиска.Открыть();
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриВыводеСтрокиТаблицыБСО(Элемент, ОформлениеСтроки, ДанныеСтроки, Заявка) Экспорт

	ОформлениеСтроки.Ячейки.Заявка.Текст = ДанныеСтроки.ЗаявкаНомер;
	Если Заявка <> ДанныеСтроки.Заявка Тогда
		Цвет = ЦветаСтиля.ЦветФонаНовогоАвтоДокумента
	ИначеЕсли ДанныеСтроки.ПоложениеБСО <> Перечисления.уб_ПоложенияБСО.ПереданНаТочку Тогда
		Цвет = ЦветаСтиля.ЦветФонаПроведен
	Иначе
		Цвет = Новый Цвет
	КонецЕсли;
	ОформлениеСтроки.ЦветФона = Цвет;

КонецПроцедуры
