#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступность();
	
	СтрИнформацияПоОбъекту = ДанныеПоОбъектуСтрахования(Объект.ОбъектСтрахования);
	Госномер = СтрИнформацияПоОбъекту.РегистрационныйЗнак;
	Vin      = СтрИнформацияПоОбъекту.ИдентификационныйНомер;
	
	ИнициализироватьСписки();
	ВыбСрок  = ОпределитьВыбСрок();
	СрокДней = ОпределитьСрокДней();
	НайтиЗаменыПолисов();
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ЗаявкаНомерОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.Заявка);
КонецПроцедуры

&НаКлиенте
Процедура НачальныйПолисОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,НачальныйПолис);
КонецПроцедуры

&НаКлиенте
Процедура ВыданВзаменОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,ВыданВзамен);
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеФункции
&НаСервере
Процедура УстановитьДоступность()
	ТолькоПросмотр = Истина;
	Элементы.СрокДней.ТолькоПросмотр = Истина;
	Элементы.ВыбСрок.ТолькоПросмотр = Истина;
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьСписки()
	СписокСроков = Элементы.выбСрок.СписокВыбора;
	СписокСроков.Очистить();
	СписокСроков.Добавить(1,	"1 мес.");
	СписокСроков.Добавить(3, 	"3 мес.");
	СписокСроков.Добавить(6, 	"6 мес.");
	СписокСроков.Добавить(12, 	"1 год");
	СписокСроков.Добавить(24, 	"2 года");
	СписокСроков.Добавить(36, 	"3 года");
	
	Оплаты.Параметры.УстановитьЗначениеПараметра("СтраховойПолис",Объект.Ссылка);
КонецПроцедуры
	

&НаСервереБезКонтекста
Функция ДанныеПоОбъектуСтрахования(ОбъектСтрахования)
	
	Если Не ОбъектСтрахования.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ТранспортныеСредства.РегистрационныйЗнак,
		|	уб_ТранспортныеСредства.ИдентификационныйНомер
		|ИЗ
		|	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
		|ГДЕ
		|	уб_ТранспортныеСредства.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", ОбъектСтрахования);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Новый Структура("РегистрационныйЗнак,ИдентификационныйНомер",Выборка.РегистрационныйЗнак,Выборка.ИдентификационныйНомер)
			//Если Не ПустаяСтрока(Выборка.РегистрационныйЗнак) Тогда
			//	Заголовок = СокрЛП(Выборка.РегистрационныйЗнак);	
			//	Если Не ПустаяСтрока(Выборка.ИдентификационныйНомер) Тогда
			//		Заголовок = Заголовок+" "+Выборка.ИдентификационныйНомер;
			//	КонецЕсли;	
			//ИначеЕсли Не ПустаяСтрока(Выборка.ИдентификационныйНомер) Тогда
			//	Заголовок = Выборка.ИдентификационныйНомер;//"..." + Прав(СокрЛП(Выборка.ИдентификационныйНомер),4);
			//Иначе
			//	Заголовок = "";
			//КонецЕсли;
		Иначе	
			//Заголовок = "";
		КонецЕсли;				
	Иначе	
		//Заголовок = "";
	КонецЕсли;
	
	//Возврат Заголовок;
	Возврат Новый Структура("РегистрационныйЗнак,ИдентификационныйНомер","","");
	
КонецФункции

Функция ОпределитьВыбСрок()
	
	выбСрок = 0;
	Для Каждого ЭлементСЗ из Элементы.выбСрок.СписокВыбора Цикл
		фСрок = ЭлементСЗ.Значение;
		Если Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, фСрок) - 86400 Тогда//60*60*24
			выбСрок = фСрок;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Возврат выбСрок
	
КонецФункции

Функция ОпределитьСрокДней()
	
	Если Объект.ДатаОкончания <> Дата(1, 1, 1) и Объект.ДатаНачала <> Дата(1, 1, 1) И Объект.ДатаОкончания > Объект.ДатаНачала Тогда
		СрокДней = (Объект.ДатаОкончания - Объект.ДатаНачала) / 86400;
	Иначе
		СрокДней = 0;
	КонецЕсли;
	Возврат СрокДней;
КонецФункции

Процедура НайтиЗаменыПолисов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаменаПолисовСрезПоследних.АннулированныйПолис КАК АннулированныйПолис,
	               |	уб_ЗаменаПолисовСрезПоследних.НовыйПолис КАК НовыйПолис
	               |ИЗ
	               |	РегистрСведений.уб_ЗаменаПолисов.СрезПоследних КАК уб_ЗаменаПолисовСрезПоследних
	               |ГДЕ
	               |	уб_ЗаменаПолисовСрезПоследних.АннулированныйПолис = &ЭтотПолис
	               |	ИЛИ уб_ЗаменаПолисовСрезПоследних.НовыйПолис = &ЭтотПолис";
	Запрос.УстановитьПараметр("ЭтотПолис",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.АннулированныйПолис = Объект.Ссылка Тогда
			ВыданВзамен    = Выборка.НовыйПолис;
		Иначе
			НачальныйПолис = Выборка.АннулированныйПолис;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти



