///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ 

Функция ОпределитьЭтаИнформационнаяБазаФайловая(СтрокаСоединенияСБД = "") Экспорт
			
	СтрокаСоединенияСБД = ?(ПустаяСтрока(СтрокаСоединенияСБД), СтрокаСоединенияИнформационнойБазы(), СтрокаСоединенияСБД);
	
	// в зависимости от того файловый это вариант БД или нет немного по-разному путь в БД формируется
	ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "FILE=");
	
	Возврат ПозицияПоиска = 1;	
	
КонецФункции


#Если НЕ Клиент И НЕ ВнешнееСоединение Тогда

Функция глЗначениеПеременной(Имя) Экспорт
	
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();
	КэшИзменен = Ложь;
	ПолученноеЗначение = ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, Кэш, КэшИзменен);
	
	Если КэшИзменен Тогда
		ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, Кэш, Значение);
	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);	
	
КонецПроцедуры


#КонецЕсли

#Если Клиент Тогда
// Процедура перезапуска сеанса работы с программой
Процедура ПерезапуститьСеансРаботыСПрограммой() Экспорт
	
	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ОЖИДАНИЯ

// Процедура выполняет отключение пользователей от информационной 
// базы в случае, если был запущен сеанс с параметром "ЗавершитьРаботуПользователей"
//
Процедура КонтрольРежимаЗавершенияРаботыПользователей() Экспорт

	ТекущийРежим = ПолучитьБлокировкуУстановкиСоединений();
	БлокировкаУстановлена = ТекущийРежим.Установлена;
	ВремяНачалаБлокировки = ТекущийРежим.Начало;
	ВремяОкончанияБлокировки = ТекущийРежим.Конец;
	
	ИнтервалПредупреждения    = 5 * 60;
	ИнтервалЗакрытьСЗапросом  = 0;
	ИнтервалЗакрытьБезЗапроса = - 1 * 60;
	ИнтервалПрекратить        = - 2 * 60;
	ТекущийМомент = ТекущаяДата();
	
	Если БлокировкаУстановлена Тогда
		
		Если ВремяОкончанияБлокировки <> '00010101' И ТекущийМомент > ВремяОкончанияБлокировки Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВремяНачалаБлокировки) 
			ИЛИ ВремяНачалаБлокировки - ТекущийМомент <= ИнтервалПрекратить Тогда
			
			ПрекратитьРаботуСистемы(Истина);
			
		ИначеЕсли ВремяНачалаБлокировки - ТекущийМомент <= ИнтервалЗакрытьБезЗапроса Тогда
			Предупреждение("Работа системы завершается." + ?(ПустаяСтрока(ТекущийРежим.Сообщение), "", Символы.ПС + ТекущийРежим.Сообщение), 30);
			
			ЗавершитьРаботуСистемы(Ложь, Истина);
			
		ИначеЕсли ВремяНачалаБлокировки - ТекущийМомент <= ИнтервалЗакрытьСЗапросом Тогда
			
			Предупреждение("Работа системы завершается." + ?(ПустаяСтрока(ТекущийРежим.Сообщение), "", Символы.ПС + ТекущийРежим.Сообщение), 30);
			
			ЗавершитьРаботуСистемы(Истина, Истина);
			
		ИначеЕсли ВремяНачалаБлокировки - ТекущийМомент <= ИнтервалПредупреждения Тогда
			
			Предупреждение("Работа системы будет завершена в " + ВремяНачалаБлокировки + "." + ?(ПустаяСтрока(ТекущийРежим.Сообщение), "", Символы.ПС + ТекущийРежим.Сообщение), 30);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // КонтрольРежимаЗавершенияРаботыПользователей

// Завершение работы только при условии удачной установки монопольного режима работы
// Вызывается, только при запуске системы от имени администратора с параметром запуска "ЗавершитьРаботуПользователей"
//
Процедура ЗавершитьРаботуПользователей() Экспорт

	Соединения = ПолучитьСоединенияИнформационнойБазы();
	
	Если Соединения.Количество() = 1 Тогда
		// Отключены все пользователи, кроме текущего сеанса
		// В последнюю очередь завершается сеанс, запущенный с параметром "ЗавершитьРаботуПользователей".
		// Такой порядок отключений необходим для обновления конфигурации с помощью пакетного файла
		
		ЗавершитьРаботуСистемы(Ложь);
		
		Возврат;
	КонецЕсли; 
	
	// Получим текущее значение параметров блокировки
	ТекущийРежим = ПолучитьБлокировкуУстановкиСоединений();
	БлокировкаУстановлена = ТекущийРежим.Установлена;
	ВремяНачалаБлокировки = ТекущийРежим.Начало;
		
	ИнтервалОтключения    = - 5 * 60;
	
	ТекущийМомент = ТекущаяДата();
	
	Если БлокировкаУстановлена и
		(НЕ ЗначениеЗаполнено(ВремяНачалаБлокировки) 
			ИЛИ ВремяНачалаБлокировки - ТекущийМомент <= ИнтервалОтключения) Тогда
			
		// через 5 минут после начала блокировки сеансы всех пользователей должны быть отключены	
		// если этого не произошло пробуем принудительно прервать соединение в клиент-серверном режиме работы.
		ОтключитьОбработчикОжидания("ЗавершитьРаботуПользователей");
		
		ПодстрокиСтрокиСоединения  = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаСоединенияИнформационнойБазы(),";");
		
		Если ПодстрокиСтрокиСоединения.Количество()> 1 и Лев(ПодстрокиСтрокиСоединения[0], 5) = "Srvr=" и Лев(ПодстрокиСтрокиСоединения[1], 4) = "Ref=" Тогда
			
			ИмяСервера = Сред(ПодстрокиСтрокиСоединения[0],7, СтрДлина(ПодстрокиСтрокиСоединения[0]) - 7);
			ИмяИБ      = Сред(ПодстрокиСтрокиСоединения[1],6, СтрДлина(ПодстрокиСтрокиСоединения[1]) - 6);
			
			Попытка
				connector = Новый COMОбъект("V8.ComConnector");
				server = connector.ConnectServer(ИмяСервера);
				
				ПодстрокиПараметровЗапуска = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска,";");
				Если ПодстрокиПараметровЗапуска.Количество() > 2 и Врег(ПодстрокиПараметровЗапуска[0]) = Врег("ЗавершитьРаботуПользователей") Тогда
					server.AddAuthentication(ПодстрокиПараметровЗапуска[1], ПодстрокиПараметровЗапуска[2]);
				КонецЕсли;
				
				ibDesc = server.CreateInfoBaseInfo();
				ibDesc.Name = ИмяИБ;
				connections = server.GetIBConnections(ibDesc);
				
				Для каждого connection Из connections Цикл
					
					Если Не ИмяПользователя() = connection.userName Тогда
						server.Disconnect(connection);
					КонецЕсли; 
					
				КонецЦикла;
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки(),"Сообщить");
				//ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЕсли;
		
		Соединения = ПолучитьСоединенияИнформационнойБазы();
		Если Соединения.Количество() > 1 Тогда
			
			Сообщение = "Не удалось завершить работу пользователей:";
			
			Для каждого Соединение Из Соединения Цикл
				Если Не Соединение.НомерСоединения = НомерСоединенияИнформационнойБазы() Тогда
					Сообщение = Сообщение + Символы.ПС + " - " + Соединение;
				КонецЕсли;
			КонецЦикла; 
			
			Сообщить(Сообщение, СтатусСообщения.Внимание);
			ЗаписьЖурналаРегистрации("Завершение работы пользователей", УровеньЖурналаРегистрации.Предупреждение, , , Сообщение);
		Иначе
			Сообщить("Завершение работы пользователей выполнено успешно.", СтатусСообщения.Информация);
		КонецЕсли;
		
		ЗавершитьРаботуСистемы(Ложь);
		
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРаботуПользователей

// процедура служит для поддержки работы регламентных заданий в файловой версии
Процедура ПоддержкаРегламентныхЗаданиеДляФайловойВерсии() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
КонецПроцедуры


// Проверяет в конфигурации ИБ наличие изменений появившихся после старта сеанса
//
Процедура ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ() Экспорт

	// Если в конфигурации после старта текущего сеанса что-то изменилось
	Если КонфигурацияБазыДанныхИзмененаДинамически() Тогда

		уб_temp.УстановитьПараметрыСеансаКонстант();
		
		// Завершим проверку обновления
		ЗавершитьПроверкуДинамическогоОбновленияИБ();

		// Спросим пользователя о его желании перезапустить сеанс
		ТекстВопроса = "В конфигурацию ИБ внесены изменения." + Символы.ПС +
						"Для работы с ними рекомендуется перезапустить программу." + Символы.ПС +
						"Перезапустить?";
		РезультатВопроса = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);

		// Если пользователь не хочет перезапускать сеанс
		Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
			// Запустим проверку обновления опять
			НачатьПроверкуДинамическогоОбновленияИБ();
			Возврат;
		КонецЕсли;

	
		// Попробуем перезапустить
		ПерезапуститьСеансРаботыСПрограммой();

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРКА ДИНАМИЧЕСКОГО ОБНОВЛЕНИЯ
//

// Начинает проверку динамического обновления конфигурации ИБ
//
Процедура НачатьПроверкуДинамическогоОбновленияИБ()Экспорт
	
	// проверка дин. обновления конфигурации каждый час
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ", 60 * 60);

КонецПроцедуры

// Завершает проверку динамического обновления конфигурации ИБ
//
Процедура ЗавершитьПроверкуДинамическогоОбновленияИБ()Экспорт

	// Отключим соответствующий обработчик ожидания
	ОтключитьОбработчикОжидания("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ");

КонецПроцедуры
#КонецЕсли

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ПАРАМЕТРОВ СЕАНСА

// Процедура инициализирует глобальную переменную глУчетнаяПолитикаПоПерсоналуОрганизации.
// Переменная содержит соответствие, где организация является ключом, а поддержка 
// поддержка внутреннего совместительства значением.
//
// Параметры:
//  Нет.
//
Функция ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации() Экспорт

	УчетнаяПолитикаПоПерсоналуОрганизации = Новый Соответствие;
	УчетнаяПолитикаПоПерсоналуОрганизации.Вставить(Справочники.Организации.ПустаяСсылка(), Новый Структура("ПоддержкаВнутреннегоСовместительства,УпрощенныйУчетНДФЛ", Ложь, Ложь));

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналу.ПоддержкаВнутреннегоСовместительства, ЛОЖЬ) КАК ПоддержкаВнутреннегоСовместительства,
	|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналу.УпрощенныйУчетНДФЛ, ЛОЖЬ) КАК УпрощенныйУчетНДФЛ
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоПерсоналу КАК УчетнаяПолитикаПоПерсоналу
	|		ПО (ВЫБОР
	|				КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА Организации.Ссылка
	|				ИНАЧЕ Организации.ГоловнаяОрганизация
	|			КОНЕЦ = УчетнаяПолитикаПоПерсоналу.Организация)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		УчетнаяПолитикаПоПерсоналуОрганизации.Вставить(Выборка.Организация, 
		                                      Новый Структура("ПоддержкаВнутреннегоСовместительства,УпрощенныйУчетНДФЛ", Выборка.ПоддержкаВнутреннегоСовместительства, Выборка.УпрощенныйУчетНДФЛ));

	КонецЦикла;
	
	Возврат УчетнаяПолитикаПоПерсоналуОрганизации;
КонецФункции // ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации

// Функция применяется при необходимости получить сведения об учетной политике организации.
//
// Параметры:
// Учет - строка. Определяет регистр сведений, из которого будут получены данные:
//   "НалоговыйУчет" или "БухгалтерскийУчет".
//
// Возвращаемое значение - таблица значений. Таблица, каждая строка которой 
//  соответствует записи регистра. 
//
Функция ЗаполнениеУчетнойПолитики() Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитика";
	
	УчетнаяПолитика = Запрос.Выполнить().Выгрузить();
	УчетнаяПолитика.Сортировать("Период");
	
	Возврат УчетнаяПолитика;
	
КонецФункции


//Керим
// Определяет заполнено ли переданное значение
//
// Параметры: 
//  Значение - значение, заполенение которого надо проверить
//
// Возвращаемое значение:
//  Истина - значение не заполнено, ложь - иначе.
//
Функция ЗначениеНеЗаполнено(Значение) Экспорт

	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение = NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Если СокрЛП(Значение) = "" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Если Значение = 0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
	#Если Клиент Тогда	
	ИначеЕсли ТипЗначения = Тип("Форма") Тогда
		Результат = НЕ Значение.Открыта();
	//Отдельное определение, так как конструкторов данного типа не существует	
	#КонецЕсли
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
		Если Значение = РежимПроведенияДокумента.Неоперативный или Значение = РежимПроведенияДокумента.Оперативный тогда
			Результат = Ложь;
		КонецЕсли;
		
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		Попытка
			Если Значение = Новый(ТипЗначения) Тогда
				Результат = Истина;
			КонецЕсли; 
		Исключение
			//Используем стандартную функцию
			Результат = НЕ ЗначениеЗаполнено(Значение);
		КонецПопытки;	
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции // ЗначениеНеЗаполнено()

Функция ПоложениеИСостояниеУбытия(ПоложениеБСО,СостояниеБСО)
	ПБ = Перечисления.уб_ПоложенияБСО;
	СБ = Перечисления.уб_СостоянияБСО;
	Если ПоложениеБСО = ПБ.ПереданВСК
	 или ПоложениеБСО = ПБ.Списан
	 или ПоложениеБСО = ПБ.ОтданКлиенту
	 или ПоложениеБСО = ПБ.ОтданБанку
	 или СостояниеБСО = СБ.Испорчен
	 или СостояниеБСО = СБ.Украден
	 или СостояниеБСО = СБ.Уничтожен
	 или СостояниеБСО = СБ.Утрачен
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ЕстьИзмененияВНовойЗаписи(Движение,ЗаписьРег,МетаданныеРегистра = Неопределено)	
	Если ЗаписьРег = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;	
	Результат = Ложь;
	
	Если МетаданныеРегистра = Неопределено Тогда
		МетаданныеРегистра =  Метаданные.РегистрыСведений.уб_ДвиженияБСО;
	КонецЕсли;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		Если Движение[Ресурс.Имя] <> ЗаписьРег[Ресурс.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Если Движение[Измерение.Имя] <> ЗаписьРег[Измерение.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		Если Реквизит.Имя <> "КодОперации" И Движение[Реквизит.Имя] <> ЗаписьРег[Реквизит.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Возврат Результат;
КонецФункции


Процедура ДополнитьПараметрыПоОбъекту(СтруктураПараметров,Объект)
	//Если свойство есть в параметрах - оно принимается, как ВЕРНОЕ, иначе производится вставка в структуру со значением по умолчанию
	
	времПеременная = Неопределено;
	//Дата
	СтруктураПараметров.Вставить("Дата",Объект.Дата);
	//ДатаСреза
	Если СтруктураПараметров.Свойство("ДатаСреза",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Новый Граница(Объект.МоментВремени(),ВидГраницы.Исключая);
		СтруктураПараметров.Вставить("ДатаСреза",времПеременная);
	КонецЕсли;	
	//Ссылка
	Если СтруктураПараметров.Свойство("Ссылка",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Объект.Ссылка;
		СтруктураПараметров.Вставить("Ссылка",времПеременная);
	КонецЕсли;	
	//ИмяОбъекта
	Если СтруктураПараметров.Свойство("ИмяОбъекта",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Объект.Метаданные().Имя;
		СтруктураПараметров.Вставить("ИмяОбъекта",времПеременная);
	КонецЕсли;	
	//Движения
	Если СтруктураПараметров.Свойство("Движения",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Объект.Движения;
		СтруктураПараметров.Вставить("Движения",времПеременная);
	КонецЕсли;
	
	//АгентВТЧДокумента
    Если СтруктураПараметров.Свойство("АгентВТЧДокумента",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ЛОЖЬ;
		СтруктураПараметров.Вставить("АгентВТЧДокумента",времПеременная);
	КонецЕсли;	
	
	//АгентОтправительВТЧДокумента
	Если СтруктураПараметров.Свойство("АгентОтправительВТЧДокумента",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ЛОЖЬ;
		СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента",времПеременная);
	КонецЕсли;	
	
	//Агент
	Если СтруктураПараметров.Свойство("Агент",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Объект.Агент;
		СтруктураПараметров.Вставить("Агент",времПеременная);
	КонецЕсли;
	
	//АгентОтправитель
	Если СтруктураПараметров.Свойство("АгентОтправитель",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("АгентОтправитель",времПеременная);
	КонецЕсли;
	
	//СостояниеПоУмолчанию
	Если СтруктураПараметров.Свойство("СостояниеПоУмолчанию",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("СостояниеПоУмолчанию",времПеременная);
	КонецЕсли;	
	//ПоложениеПоУмолчанию
	Если СтруктураПараметров.Свойство("ПоложениеПоУмолчанию",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ПоложениеПоУмолчанию",времПеременная);
	КонецЕсли;	

	//ИмяКолонкиВТЧТипСписания
	Если СтруктураПараметров.Свойство("ИмяКолонкиВТЧТипСписания",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания",времПеременная);
	КонецЕсли;	
	
	//ИмяКолонкиСостояниеБСО
	Если СтруктураПараметров.Свойство("ИмяКолонкиСостояниеБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО",времПеременная);
	КонецЕсли;	
	//ИмяКолонкиПоложениеБСО  
	Если СтруктураПараметров.Свойство("ИмяКолонкиПоложениеБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ИмяКолонкиПоложениеБСО",времПеременная);
	КонецЕсли;	
    //НеКонтролироватьНаличиеБСОПриПроведении
	Если СтруктураПараметров.Свойство("НеКонтролироватьНаличиеБСОПриПроведении",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ЛОЖЬ;
		СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении",времПеременная);
	КонецЕсли;	
	//НаОсновеБумажногоДокумента
	Если СтруктураПараметров.Свойство("НаОсновеБумажногоДокумента",времПеременная) = ЛОЖЬ Тогда
		Попытка
			времПеременная = Объект.НаОсновеБумажногоДокумента;
		Исключение	
			времПеременная = Ложь;
		КонецПопытки;	
		СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента",времПеременная);
	КонецЕсли;	
	//СделатьДвиженияПоКоличественнымБСО
    Если СтруктураПараметров.Свойство("СделатьДвиженияПоКоличественнымБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ЛОЖЬ;
		СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО",времПеременная);
	КонецЕсли;	
	
	//ВидДвиженияНакопленияОстаткиБСО
    Если СтруктураПараметров.Свойство("ВидДвиженияНакопленияОстаткиБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО",времПеременная);
	КонецЕсли;	
	
	//ПоставщикВТЧДокумента
	Если СтруктураПараметров.Свойство("ПоставщикВТЧДокумента",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Истина;
		СтруктураПараметров.Вставить("ПоставщикВТЧДокумента",времПеременная);
	КонецЕсли;	
	//ОрганизацияАгентВТЧДокумента
    Если СтруктураПараметров.Свойство("ОрганизацияАгентВТЧДокумента",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ИСТИНА;
		СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента",времПеременная);
	КонецЕсли;	
	//Поставщик
	Если СтруктураПараметров.Свойство("Поставщик",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("Поставщик",времПеременная);
	КонецЕсли;	
	//ОрганизацияАгент
	Если СтруктураПараметров.Свойство("ОрганизацияАгент",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ОрганизацияАгент",времПеременная);
	КонецЕсли;	
	//ПроверкаПоложения
	Если СтруктураПараметров.Свойство("ПроверкаПоложения",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ИСТИНА;
		СтруктураПараметров.Вставить("ПроверкаПоложения",времПеременная);
	КонецЕсли;	
	
	//СКВТЧДокумента
	Если СтруктураПараметров.Свойство("СКВТЧДокумента",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ИСТИНА;
		СтруктураПараметров.Вставить("СКВТЧДокумента",времПеременная);
	КонецЕсли;	
	//СК
	Если СтруктураПараметров.Свойство("СК",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("СК",времПеременная);
	КонецЕсли;	
	
	//СделатьДвиженияПоБлокировкамБСО
	Если СтруктураПараметров.Свойство("СделатьДвиженияПоБлокировкамБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = ЛОЖЬ;
		СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО",времПеременная);
	КонецЕсли;	
	//ПодразделениеОт
	Если СтруктураПараметров.Свойство("ПодразделениеОт",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ПодразделениеОт",времПеременная);
	КонецЕсли;	
	//ПодразделениеКуда
	Если СтруктураПараметров.Свойство("ПодразделениеКуда",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Неопределено;
		СтруктураПараметров.Вставить("ПодразделениеКуда",времПеременная);
	КонецЕсли;	
	Если СтруктураПараметров.Свойство("ПропускатьПустойНомерБСО",времПеременная) = ЛОЖЬ Тогда
		времПеременная = Ложь;
		СтруктураПараметров.Вставить("ПропускатьПустойНомерБСО",времПеременная);
	КонецЕсли;	
КонецПроцедуры	

Процедура ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок,Объект, СтруктураПараметров) Экспорт
	
	ДополнитьПараметрыПоОбъекту(СтруктураПараметров,Объект);
	
	Дата = СтруктураПараметров.Дата;
	ДатаСреза = СтруктураПараметров.ДатаСреза;
	Агент = СтруктураПараметров.Агент;
	АгентОтправитель = СтруктураПараметров.АгентОтправитель;
	Ссылка = СтруктураПараметров.Ссылка;
	ИмяОбъекта = СтруктураПараметров.ИмяОбъекта;
	Движения = СтруктураПараметров.Движения;
	КодОперации = СтруктураПараметров.КодОперации;
	СостояниеПоУмолчанию = СтруктураПараметров.СостояниеПоУмолчанию;
	НеКонтролироватьНаличиеБСОПриПроведении = СтруктураПараметров.НеКонтролироватьНаличиеБСОПриПроведении;
	АгентВТЧДокумента = СтруктураПараметров.АгентВТЧДокумента;
	АгентОтправительВТЧДокумента = СтруктураПараметров.АгентОтправительВТЧДокумента;
	ИмяКолонкиВТЧТипСписания = СтруктураПараметров.ИмяКолонкиВТЧТипСписания;
	НаОсновеБумажногоДокумента = СтруктураПараметров.НаОсновеБумажногоДокумента;
	СделатьДвиженияПоКоличественнымБСО = СтруктураПараметров.СделатьДвиженияПоКоличественнымБСО;
	СделатьДвиженияПоБлокировкамБСО = СтруктураПараметров.СделатьДвиженияПоБлокировкамБСО;
	ПоложениеПоУмолчанию = 	СтруктураПараметров.ПоложениеПоУмолчанию;
	//ОсновнаяОрганизация = Неопределено;
	//СтруктураПараметров.Свойство("ОсновнаяОрганизация", ОсновнаяОрганизация);
	ПоставщикВТЧДокумента = СтруктураПараметров.ПоставщикВТЧДокумента;
	ОрганизацияАгентВТЧДокумента =	СтруктураПараметров.ОрганизацияАгентВТЧДокумента;
	Поставщик = СтруктураПараметров.Поставщик;
	ОрганизацияАгент = 	СтруктураПараметров.ОрганизацияАгент;
	СКВТЧДокумента = СтруктураПараметров.СКВТЧДокумента;
	СК = СтруктураПараметров.СК;
	ИмяКолонкиПоложениеБСО = СтруктураПараметров.ИмяКолонкиПоложениеБСО;
	ИмяКолонкиСостояниеБСО = СтруктураПараметров.ИмяКолонкиСостояниеБСО;
	ПроверкаПоложения  = СтруктураПараметров.ПроверкаПоложения;
	
	Движения.уб_ДвиженияБСО.Очистить();
	Если СделатьДвиженияПоКоличественнымБСО = Истина Тогда
		Движения.уб_ОстаткиБСО.Очистить();
	КонецЕсли;
	
	Если СделатьДвиженияПоБлокировкамБСО = Истина Тогда
		Движения.уб_БлокировкаБСО.Очистить();
	КонецЕсли;
	
	ТЗОшибок = СоздатьТаблицуОшибок();
	пПлж = Перечисления.уб_ПоложенияБСО;
	пСст = Перечисления.уб_СостоянияБСО;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*,
	|	ВЫБОР
	|		КОГДА ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойЕстьПолис)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисСоответствуетНомеруБСО)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойНетПолиса)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисИзСвободных)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную)
	|			ТОГДА Истина
	|       Когда ТИПЗНАЧЕНИЯ(ДокументБСО.ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов) Тогда Истина
	|		ИНАЧЕ Ложь
	|	КОНЕЦ КАК НомернойУчет,
	|	ВЫБОР
	|		КОГДА ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйНетПолиса)
	|			ТОГДА Истина
	|		ИНАЧЕ Ложь
	|	КОНЕЦ КАК КоличествнныйУчет,
	|	ДокументБСО.Ссылка.Проведен КАК СсылкаПроведен,
	|	ДокументБСО.ВидБСО.Представление КАК ВидБСОПредставление,
	|   ДокументБСО.ВидБСО.Владелец КАК СКВидаБСО
	|ИЗ
	//|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК ДокументБСО
	|	Документ." + ИмяОбъекта + ".БСО КАК ДокументБСО
	|ГДЕ
	|	ДокументБСО.Ссылка = &Ссылка
	|	И (НЕ(ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных)
	|				//ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную)
	|				ИЛИ ДокументБСО.ВидБСО.ТипУчетаБСО = ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяНетПолиса))
	|      ИЛИ ТИПЗНАЧЕНИЯ(ДокументБСО.ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументБСО.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	ВыборкаТЧ = Результат.Выбрать();
	
	ТипЗнчСсылка = ТипЗнч(Ссылка);
	ЭтоПеремещениеБСО = Ложь;
	ЭтоСписаниеБСО = Ложь;
	ЭтоПередачаБСОПоставщику = Ложь;
	ЭтоСверкаБСО = Ложь;
	ЭтоЗаявка = Ложь;
	ЭтоИнвентаризацияБСО = Ложь;
	Если ТипЗнчСсылка = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		ЭтоПеремещениеБСО = Истина;
		ВсеБСО = Результат.Выгрузить();
		СуммыЗаявок = Документы.уб_ИнвентаризацияБСО.СуммыЗаявок(ВсеБСО.ВыгрузитьКолонку("ЗаявкаКуда"));
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда	
		ЭтоЗаявка = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
		ЭтоПередачаБСОПоставщику = Истина;	
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_СписаниеБСО") Тогда
		ЭтоСписаниеБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_СверкаБСО") Тогда
		ЭтоСверкаБСО = Истина;
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.уб_ИнвентаризацияБСО") Тогда
		ЭтоИнвентаризацияБСО = Истина;
	КонецЕсли;
	ЕстьКолонкаСтраховойПолис = Результат.Колонки.Найти("СтраховойПолис") <> Неопределено;
	ЕстьКолонкаДатаВозврата = Результат.Колонки.Найти("ДатаВозврата") <> Неопределено;
	ЕстьКолонкаПодтверждено = Результат.Колонки.Найти("Подтверждено") <> Неопределено;
	ЕстьКолонкаКомментарий = Результат.Колонки.Найти("Комментарий") <> Неопределено;
	ЕстьКолонкаНомерПолиса = Результат.Колонки.Найти("НомерПолиса") <> Неопределено;
	ЕстьКолонкаГодПолиса = Результат.Колонки.Найти("ГодПолиса") <> Неопределено;
	
	Пока ВыборкаТЧ.Следующий() Цикл
		ТекНомерБСО = ВыборкаТЧ.НомерБСО;
		Если СтруктураПараметров.ПропускатьПустойНомерБСО = Истина и ПустаяСтрока(ТекНомерБСО) Тогда
			Если ЭтоЗаявка Тогда
				ТекНомерБСО = ВыборкаТЧ.ДопНомерБСО;
				Если ПустаяСтрока(ТекНомерБСО) Тогда
					Продолжить;
				КонецЕсли;	
			Иначе
				Продолжить;
			КонецЕсли;	
			
		КонецЕсли;	
		СООхвост = " Сохранение информации невозможно! (строка № " + Строка(ВыборкаТЧ.НомерСтроки) + ")";
		Если ЭтоСверкаБСО Тогда
		#Если Клиент Тогда
			Оповестить("Движение_ДляИндикатора", Ссылка);
		#КонецЕсли
		КонецЕсли;
		
		Номерной = Ложь;
		ЕстьИнфоОБСО = Ложь;
		Если ЭтоЗаявка Тогда
			ДатаСреза0 = ВыборкаТЧ.ДатаДвиженияБСО;
			Если ДатаСреза0 = Дата(1,1,1) Тогда
				ДатаСреза0 = Ссылка.Дата-1;
			КонецЕсли;	
		Иначе
			ДатаСреза0 = ДатаСреза;
		КонецЕсли;	
		Отказ0 = Ложь;
		Если ДатаСреза <> Неопределено Тогда
			
			ВыборкаРС = уб_СС.ПолучитьВыборкуРС(ВыборкаТЧ, ДатаСреза0, Номерной, ?(ЭтоЗаявка,Отказ0,Отказ), Заголовок, СООХвост, ТЗОшибок);
			ЕстьИнфоОБСО = ВыборкаРС <> Неопределено;
			Если СтруктураПараметров.Свойство("ПроверитьСостояние") и СтруктураПараметров.ПроверитьСостояние = Истина Тогда
				Если ЕстьИнфоОБСО и ВыборкаРС.СостояниеБСО = СостояниеПоУмолчанию Тогда
					Сообщить("Состояние данного БСО уже 'Забронировано' проведение невозможно. Удалите данный бланк из предыдущей заявки.");
					Если НЕ ЭтоЗаявка Тогда
						Отказ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			Конецесли;	
		КонецЕсли;
		Если Не ПустаяСтрока(ТекНомерБСО) Тогда
			Номерной = Истина;
		КонецЕсли;
		
		Если АгентВТЧДокумента = Истина Тогда
			Если Агент = Неопределено Тогда
				//Выбытие
				АгентКому = Неопределено;
			Иначе
				//Из ТЧ
				АгентКому = ВыборкаТЧ[Агент];
			КонецЕсли;
		Иначе
			АгентКому = Агент;
		КонецЕсли;
		
		Если АгентОтправительВТЧДокумента = Истина Тогда
			Если АгентОтправитель = Неопределено Тогда
				Если ЕстьИнфоОБСО Тогда
					//Берутся предыдущие данные
					АгентОтКого = ВыборкаРС.Агент;	
				Иначе	
					АгентОтКого = Неопределено;
				КонецЕсли;	
			Иначе
				АгентОтКого = ВыборкаТЧ[АгентОтправитель];
			КонецЕсли;
		Иначе
			Если ЭтоСписаниеБСО Тогда
				АгентОтКого = ВыборкаТЧ.Агент;
				АгентКому   = ВыборкаТЧ.Агент;
			Иначе
				Если АгентОтправитель = Неопределено И ЕстьИнфоОБСО Тогда
					//Берутся предыдущие данные
					АгентОтКого = ВыборкаРС.Агент;
				Иначе	
					АгентОтКого = АгентОтправитель;
				КонецЕсли;		
				Если Агент = Неопределено И ЕстьИнфоОБСО Тогда
					АгентКому = ВыборкаРС.Агент;
				КонецЕСли;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПоставщикВТЧДокумента <> Ложь Тогда
			Поставщик = ВыборкаТЧ.Поставщик;
		КонецЕсли;
		
		Если ОрганизацияАгентВТЧДокумента <> Ложь Тогда
			ОрганизацияАгент = ВыборкаТЧ.ОрганизацияАгент;
		КонецЕсли;
		
		Если ЭтоЗаявка и ЗначениеЗаполнено(ОрганизацияАгент) = ЛОЖЬ и Номерной = Истина Тогда
			
			СтрокаТЗ 			= ТЗОшибок.Добавить();
			СтрокаТЗ.Ошибка 	= "Не указана Организация-агент в БСО";
			СтрокаТЗ.Строка		= ВыборкаТЧ.НомерСтроки - 1;
			СтрокаТЗ.Элемент	= "БСО";
			Отказ = Истина;
 		КонецЕсли;	
		
		Если СКВТЧДокумента <> Ложь Тогда
			СК = ВыборкаТЧ.СК;
		ИначеЕсли ЗначениеЗаполнено(СК) = ЛОЖЬ и ЗначениеЗаполнено(ВыборкаТЧ.СКВидаБСО) = Истина Тогда
			СК = ВыборкаТЧ.СКВидаБСО;
		КонецЕсли;
		
		ИнфоЗапись = НЕ (ВыборкаТЧ.СсылкаПроведен И ?(ЕстьКолонкаПодтверждено, ВыборкаТЧ.Подтверждено, Истина));
		
		//Если ВыборкаТЧ.НомернойУчет Тогда
		Если Номерной Тогда
			
			Движение = Движения.уб_ДвиженияБСО.Добавить();
			Если ЭтоЗаявка Тогда
				Движение.Период = ?(ЗначениеЗаполнено(ВыборкаТЧ.ДатаДвиженияБСО),ВыборкаТЧ.ДатаДвиженияБСО,Дата);
				Движение.Заявка = Ссылка; 
			Иначе
				Движение.Период = Дата;
			КонецЕсли;
			Движение.СК = СК;
			Движение.ВидБСО = ВыборкаТЧ.ВидБСО;
			Движение.НомерБСО = СокрЛП(ТекНомерБСО);
				
			
			Если ЭтоПеремещениеБСО Тогда
				Движение.Заявка = ВыборкаТЧ.ЗаявкаКуда;
				Если ПоложениеПоУмолчанию = Перечисления.уб_ПоложенияБСО.ПереданНаТочку Тогда
					Остаток = Документы.уб_ИнвентаризацияБСО.ОстатокЗаявки(СуммыЗаявок,ВыборкаТЧ,"ЗаявкаКуда");
				Иначе
					Остаток = 0;
				Конецесли;	
				Движение.СтраховаяПремия = Остаток;
				
			КонецЕсли;
			
			Движение.Подтверждено = ?(ЕстьКолонкаПодтверждено, ВыборкаТЧ.Подтверждено, Истина);
			//Движение.ДокПроведен = ВыборкаТЧ.СсылкаПроведен;
			Движение.Активность = ВыборкаТЧ.СсылкаПроведен;
			
			Движение.АгентОтправитель = АгентОтКого;
			Движение.Агент = АгентКому;
			
			Если ЗначениеЗаполнено(ПоложениеПоУмолчанию) Тогда
				Движение.ПоложениеБСО = ПоложениеПоУмолчанию;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СостояниеПоУмолчанию) Тогда
				Движение.СостояниеБСО = СостояниеПоУмолчанию;
			КонецЕсли;
			
			Если ЕстьИнфоОБСО Тогда
				Попытка
					Движение.Актуальная = ВыборкаРС.Актуальная;
				Исключение
				КонецПопытки;
				Движение.НомерПолиса = ВыборкаРС.НомерПолиса;
				Движение.ДопНомерБСО = ВыборкаРС.ДопНомерБСО;
				Если ЭтоЗаявка Тогда
					Если ЗначениеЗаполнено(ВыборкаТЧ.ДопНомерБСО) Тогда
						Движение.ДопНомерБСО = ВыборкаТЧ.ДопНомерБСО;
					КонецЕсли;
				КонецЕсли;	
				Движение.ГодПолиса = ВыборкаРС.ГодПолиса;
				Движение.СтраховойПолис = ВыборкаРС.СтраховойПолис;
				
				
				Если ЭтоИнвентаризацияБСО Тогда
					Движение.Поставщик = Поставщик;
					Движение.ОрганизацияАгент = ОрганизацияАгент;
					Движение.АгентОтправитель = ВыборкаРС.АгентОтправитель;
					Движение.ДатаВозврата = ВыборкаРС.ДатаВозврата;
				Иначе
					Движение.Поставщик = ВыборкаРС.Поставщик;
					Движение.ОрганизацияАгент = ВыборкаРС.ОрганизацияАгент;
				КонецЕсли;
				
				Если Не ЭтоПеремещениеБСО Тогда
					Движение.Заявка = ВыборкаРС.Заявка;
				КонецЕсли;
				
				Если ЭтоСверкаБСО Тогда
					Если ВыборкаТЧ[ИмяКолонкиПоложениеБСО] = ВыборкаРС.ПоложениеБСО Или ВыборкаТЧ[ИмяКолонкиПоложениеБСО] = Перечисления.уб_ПоложенияБСО.ПустаяСсылка()
						 И ВыборкаТЧ[ИмяКолонкиСостояниеБСО] = ВыборкаРС.СостояниеБСО Или ВыборкаТЧ[ИмяКолонкиСостояниеБСО] = Перечисления.уб_СостоянияБСО.ПустаяСсылка()
						 Тогда
						 ЗаписыватьДвижениеОтКогоКуда = Ложь;
					 Иначе
						 ЗаписыватьДвижениеОтКогоКуда = Истина;
					 КонецЕсли;
					 Если ЗаписыватьДвижениеОтКогоКуда Тогда
						 Движение.АгентОтправитель	= ВыборкаРС.Агент;
					 КонецЕсли;
					 
					 Если НЕ ПоложениеИСостояниеУбытия(ВыборкаТЧ[ИмяКолонкиПоложениеБСО], ВыборкаТЧ[ИмяКолонкиСостояниеБСО]) Тогда
						 Движение.Агент = ВыборкаРС.Агент;
					 КонецЕсли;
					 Движение.ДатаВозврата = ВыборкаРС.ДатаВозврата;
				КонецЕсли;
				
				Если Не ЭтоСписаниеБСО И Не ЗначениеЗаполнено(Движение.ПоложениеБСО) Тогда
					Движение.ПоложениеБСО = ВыборкаРС.ПоложениеБСО;
				КонецЕсли;
				Если ЭтоПеремещениеБСО И ПоложениеПоУмолчанию = пПлж.ПустаяСсылка() Тогда//документ перемещение
					текПлж = ВыборкаРС.ПоложениеБСО;
					//Корректировка ранеее внесенного неверного положения при перемещении внутри головного офиса
					//Если текущее положение: ПереданНаТочку или ПереданВСК, то исправляем на ВозвращенСТочки
					//(по факту: раз оформляем перемещение по головному офису, то тех положений не может быть)
					Если текПлж = пПлж.ПереданНаТочку ИЛИ текПлж = пПлж.ПереданВСК Тогда
						Движение.ПоложениеБСО = пПлж.ВозвращенСТочки;
					Иначе
						Движение.ПоложениеБСО = ВыборкаРС.ПоложениеБСО;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ЭтоПеремещениеБСО И ПоложениеПоУмолчанию = пПлж.ПустаяСсылка() Тогда
					//Корректировка непонятного положения при перемещении внутри головного офиса
					Движение.ПоложениеБСО = пПлж.ПолученИзСК;
				КонецЕсли;
				Если ЕстьКолонкаНомерПолиса Тогда
					Движение.НомерПолиса = ВыборкаТЧ.НомерПолиса;
				КонецЕсли;
				Если ЕстьКолонкаГодПолиса Тогда
					Движение.ГодПолиса = ВыборкаТЧ.ГодПолиса;
				КонецЕсли;
				Если ЕстьКолонкаСтраховойПолис Тогда
					Движение.СтраховойПолис = ВыборкаТЧ.СтраховойПолис;
				КонецЕсли;
				Движение.Поставщик = Поставщик;
				Движение.ОрганизацияАгент = ОрганизацияАгент;
			КонецЕсли;
			Если ЕстьКолонкаДатаВозврата Тогда
				Движение.ДатаВозврата = ВыборкаТЧ.ДатаВозврата;
			КонецЕсли;
			
			//Если ПоложениеПоУмолчанию = Неопределено Тогда
			Если ИмяКолонкиВТЧТипСписания <> Неопределено Тогда
				СостояниеВТЧ = ВыборкаТЧ[ИмяКолонкиВТЧТипСписания];
				Если ЗначениеЗаполнено(СостояниеВТЧ) Тогда
					Если СостояниеВТЧ = "Испорчен" Тогда
						Движение.СостояниеБСО	= пСст.Испорчен;
					ИначеЕсли СостояниеВТЧ = "Украден" Тогда
						Движение.СостояниеБСО	= пСст.Украден;
					ИначеЕсли СостояниеВТЧ = "Уничтожен" Тогда
						Движение.СостояниеБСО	= пСст.Уничтожен;
					ИначеЕсли СостояниеВТЧ = "Утрачен" Тогда
						Движение.СостояниеБСО	= пСст.Утрачен;
					ИначеЕсли СостояниеВТЧ = "Оформлен, отдан Клиенту" Тогда
						Движение.СостояниеБСО	= пСст.Оформлен;
						Если Не ЗначениеЗаполнено(Движение.ПоложениеБСО)  Тогда
							Движение.ПоложениеБСО	= пПлж.ОтданКлиенту;
						КонецЕсли;
					ИначеЕсли СостояниеВТЧ = "Оформлен, отдан Банку" Тогда
						Движение.СостояниеБСО	= пСст.Оформлен;
						Если Не ЗначениеЗаполнено(Движение.ПоложениеБСО)  Тогда
							Движение.ПоложениеБСО	= пПлж.ОтданБанку;
						КонецЕсли;
					Иначе
						Движение.СостояниеБСО	= СостояниеПоУмолчанию;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Движение.ПоложениеБСО) И НЕ Движение.СостояниеБСО	= пСст.Оформлен Тогда
						Движение.ПоложениеБСО	= пПлж.Списан;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//КонецЕсли;
			
			Если ИмяКолонкиПоложениеБСО <> Неопределено И  ЗначениеЗаполнено(ВыборкаТЧ[ИмяКолонкиПоложениеБСО]) Тогда
				Движение.ПоложениеБСО = ВыборкаТЧ[ИмяКолонкиПоложениеБСО];
			КонецЕсли;
			
			Если ИмяКолонкиСостояниеБСО <> Неопределено И Не ВыборкаТЧ[ИмяКолонкиСостояниеБСО].Пустая() Тогда
				Движение.СостояниеБСО = ВыборкаТЧ[ИмяКолонкиСостояниеБСО];
			ИначеЕсли ЕстьИнфоОБСО И Не ЗначениеЗаполнено(Движение.СостояниеБСО) Тогда
				Если ЭтоПеремещениеБСО и ВыборкаРС.СостояниеБСО = Перечисления.уб_СостоянияБСО.НеПолностьюОформлен Тогда
					Движение.СостояниеБСО = Перечисления.уб_СостоянияБСО.НеполныйБланк;
				Иначе	
					Движение.СостояниеБСО = ВыборкаРС.СостояниеБСО;
				КонецЕсли;	
				
			КонецЕсли;
			
			Движение.КодОперации = КодОперации;
			Если ЕстьКолонкаКомментарий Тогда
				Движение.Комментарий = ВыборкаТЧ.Комментарий;
			КонецЕсли;
			Движение.НаОснованииБумажногоДокумента = НаОсновеБумажногоДокумента;
			
			ПроверитьДвижение = Истина;
			Если ЭтоИнвентаризацияБСО Тогда
				Движение.СтраховаяПремия =  ВыборкаТЧ.СтраховаяПремия;
			//	Если Не ЕстьИзмененияВНовойЗаписи(Движение, ВыборкаРС) Тогда
			//		Движения.уб_ДвиженияБСО.Удалить(Движение);
			//		ПроверитьДвижение = Ложь;
			//	КонецЕсли;
			КонецЕсли;
			
			//проверка
			Если ПроверитьДвижение Тогда
			СтруктураОшибок = уб_СС.ПроверкиНомерныхДвижений(
			    Движение,
				ВыборкаРС, 
				Отказ, 
				Инфозапись,
				Ложь,
				ПроверкаПоложения,
				Заголовок, 
				СООхвост,
				НеКонтролироватьНаличиеБСОПриПроведении,
				ТЗОшибок,
				СтруктураПараметров,
				ВыборкаТЧ.НомерСтроки);
			КонецЕсли;
			//Если Отказ Тогда
			//	Возврат;
			//КонецЕсли;
		ИначеЕсли Не ИнфоЗапись И СделатьДвиженияПоКоличественнымБСО = Истина Тогда
			//Количественный учет
			уб_СС.ПроверкиКоличественныхДвижений(Отказ, ВыборкаТЧ.Количество, Поставщик, ОрганизацияАгент, ВыборкаТЧ.ВидБСО, АгентОтКого, ВыборкаТЧ.НомерСтроки, Заголовок, СООХвост, ТЗОшибок);
			//Если Отказ Тогда
			//	Возврат;
			//КонецЕсли;
			// проверим остатки
			Если ДатаСреза <> Неопределено Тогда
				СтруктураОтбора = Новый Структура("Период, Поставщик, ОрганизацияАгент, СК, ВидБСО, Агент"
				,ДатаСреза
				,Поставщик
				,ОрганизацияАгент
				,СК
				,ВыборкаТЧ.ВидБСО
				,АгентОтКого
				);
				ЗаписьРег = уб_СС.ПолучитьВыборкуРН(СтруктураОтбора, ВыборкаТЧ, Отказ, Заголовок, СООхвост, НеКонтролироватьНаличиеБСОПриПроведении, ТЗОшибок);
			КонецЕсли;
			ЕстьИнфоОБСО = ЗаписьРег <> Неопределено;
			//Если Отказ Тогда
			//	Возврат;
			//КонецЕсли;
			Если ЭтоПеремещениеБСО Тогда
				//  уменьшаем количество, откуда перемещается
				Движение = Движения.уб_ОстаткиБСО.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				// измерения
				Если ЗаписьРег <> Неопределено Тогда
					Движение.Поставщик = ЗаписьРег.Поставщик;
					Движение.ОрганизацияАгент = ЗаписьРег.ОрганизацияАгент;
				Иначе
					Движение.Поставщик = ?(ЗначениеНеЗаполнено(Поставщик), СК, Поставщик);
					//#Если Клиент Тогда
					//	Движение.ОрганизацияАгент = ?(ЗначениеНеЗаполнено(ОрганизацияАгент), ОсновнаяОрганизация, ОрганизацияАгент);
					//#Иначе
						Движение.ОрганизацияАгент = ОрганизацияАгент;
					//#КонецЕсли
				КонецЕсли;
				Движение.СК = СК;
				Движение.ВидБСО	= ВыборкаТЧ.ВидБСО;
				Движение.Агент = АгентОтКого;
				// ресурсы
				Движение.Количество	= ВыборкаТЧ.Количество;
				// реквизиты
				Движение.КодОперации = КодОперации;
				Движение.Заявка = ВыборкаТЧ.ЗаявкаОт;
				//  увеличиваем количество, куда перемещается
				Движение = Движения.уб_ОстаткиБСО.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Если ЕстьИнфоОБСО Тогда
					Движение.Поставщик = ЗаписьРег.Поставщик;
					Движение.ОрганизацияАгент = ЗаписьРег.ОрганизацияАгент;
				Иначе
					Движение.Поставщик = ?(ЗначениеНеЗаполнено(Поставщик), СК, Поставщик);
					//#Если Клиент Тогда
					//	Движение.ОрганизацияАгент = ?(ЗначениеНеЗаполнено(ОрганизацияАгент), ОсновнаяОрганизация, ОрганизацияАгент);
					//#Иначе
						Движение.ОрганизацияАгент = ОрганизацияАгент;
					//#КонецЕсли
				КонецЕсли;
				Движение.СК = СК;
				Движение.ВидБСО = ВыборкаТЧ.ВидБСО;
				Движение.Агент = АгентКому;
				// ресурсы
				Движение.Количество = ВыборкаТЧ.Количество;
				// реквизиты
				Движение.КодОперации = КодОперации;
				Движение.Заявка = ВыборкаТЧ.ЗаявкаКуда;
			Иначе
				Движение = Движения.уб_ОстаткиБСО.Добавить();
				ВидДвиженияНакопленияОстаткиБСО = СтруктураПараметров.ВидДвиженияНакопленияОстаткиБСО;
				Если ЗначениеЗаполнено(ВидДвиженияНакопленияОстаткиБСО) Тогда
					Движение.ВидДвижения = ВидДвиженияНакопленияОстаткиБСО;
				Иначе
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				КонецЕсли;
				Движение.Период = Дата;
				//измерения
				Движение.Поставщик = Поставщик;
				Движение.ОрганизацияАгент = ОрганизацияАгент;
				Движение.СК = СК;
				Движение.ВидБСО = ВыборкаТЧ.ВидБСО;
				Если ЭтоПередачаБСОПоставщику Тогда
					Движение.Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
				Иначе					
					Движение.Агент = АгентКому;
				КонецЕсли;
				//ресурсы
				Движение.Количество = ВыборкаТЧ.Количество;
				//реквизиты
				Движение.КодОперации = КодОперации;
				Если ИмяКолонкиВТЧТипСписания <> Неопределено Тогда
					Если ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Испорчен" Тогда
						Движение.СостояниеБСО = пСст.Испорчен;
					ИначеЕсли ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Украден" Тогда
						Движение.СостояниеБСО = пСст.Украден;
					ИначеЕсли ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Уничтожен" Тогда
						Движение.СостояниеБСО = пСст.Уничтожен;
					ИначеЕсли ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Утрачен" Тогда
						Движение.СостояниеБСО = пСст.Утрачен;
					ИначеЕсли ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Оформлен, отдан Клиенту" Тогда
						Движение.СостояниеБСО = пСст.Оформлен;
					ИначеЕсли ВыборкаТЧ[ИмяКолонкиВТЧТипСписания] = "Оформлен, отдан Банку" Тогда
						Движение.СостояниеБСО = пСст.Оформлен;
					Иначе
						Движение.СостояниеБСО = СостояниеПоУмолчанию;
					КонецЕсли;
				Иначе
					Движение.СостояниеБСО = СостояниеПоУмолчанию;
				КонецЕсли;
				Если ЕстьИнфоОБСО И Не ЭтоПередачаБСОПоставщику = Истина и НЕ ЭтоСписаниеБСО = Истина Тогда
					Движение.Заявка = ЗаписьРег.Заявка;
				Иначе
					Движение.Заявка = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СделатьДвиженияПоБлокировкамБСО = Истина И Не Отказ Тогда
			Если ВыборкаТЧ.Блокировка Тогда
				ДвижениеБлокировка = Движения.уб_БлокировкаБСО.Добавить();
				ЗаполнитьЗначенияСвойств(ДвижениеБлокировка, ВыборкаТЧ);
				ДвижениеБлокировка.Период = Дата;
				ДвижениеБлокировка.СК = СК;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПроверкаУникальностиЗаписейРегистра(Движения.уб_ДвиженияБСО, Отказ, ТЗОшибок);
	
	Если ТЗОшибок.Количество() <> 0 и Отказ = Истина Тогда
		//Форма = ЭтотОбъект.ПолучитьФорму();
		Форма = Ссылка.ПолучитьФорму();
		Если Форма.Открыта() Тогда
			ОткрытьСообщениеОбОшибках(ТзОшибок, Форма);
		Иначе
			Для Каждого Строка Из ТЗОшибок Цикл
				Сообщить(Строка.Ошибка);
			КонецЦикла;
		КонецЕсли;
		//Отказ = Истина;
		Возврат;
	ИначеЕсли Не Отказ Тогда
		Движения.уб_ДвиженияБСО.Записать();
		Если СделатьДвиженияПоКоличественнымБСО = Истина Тогда
			Движения.уб_ОстаткиБСО.Записать();
		КонецЕсли;
		Если СделатьДвиженияПоБлокировкамБСО = Истина Тогда
			Движения.уб_БлокировкаБСО.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//чкн
Процедура ПроверкаУникальностиЗаписейРегистра(Движения, Отказ, ТЗОшибок, Режим = ЛОЖЬ)Экспорт
	
	//получим имя регистра
	СтруктурныеДанные = Движения.Метаданные();
	ИмяРегистра = Движения.Метаданные().Имя;
	Если Метаданные.РегистрыНакопления.Содержит(СтруктурныеДанные) тогда
		ТипРегистра = РегистрыНакопления;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтруктурныеДанные) тогда
		ТипРегистра = РегистрыСведений;
	Иначе
		СОО = "Неверный тип регистра. Проверка не выполнена";
		СтрокаТЗ 			= ТЗОшибок.Добавить();
		СтрокаТЗ.Ошибка 	= СОО;
		СтрокаТЗ.Строка		= 0;
		СтрокаТЗ.Элемент	= "БСО";

	КонецЕсли;
	
	//сформируем структуру по измерениям регистра
	СтруктураПоиска = Новый Структура;
	Для Каждого Измерение ИЗ Движения.Метаданные().Измерения Цикл   
		СтруктураПоиска.Вставить(Измерение.Имя, "");
	КонецЦикла;
	
	Для Каждого Измерение ИЗ Движения.Метаданные().СтандартныеРеквизиты Цикл   
		Если Измерение.Имя = "Период" ИЛИ Измерение.Имя = "Регистратор" тогда
			СтруктураПоиска.Вставить(Измерение.Имя, "");
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДвижений = Движения.Выгрузить();
	
	МассивУдаления = Новый Массив;
	
	//проверяем таблицу движений на дубли
	Для Каждого СтрокаТаблицы ИЗ ТаблицаДвижений цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		МассивНайденных = ТаблицаДвижений.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНайденных.Количество() > 1 тогда
			Текст = "№ ";
			Сч = 0;
			//дублирующиеся строки
			Для Каждого СтрокаМассива Из МассивНайденных цикл
				ТекНСтроки = СтрокаМассива.НомерСтроки;
				Текст = Текст + СтрокаМассива.НомерСтроки+" ";
				Сч = Сч + 1;
				Если Сч >= 1 И Сч-1 < МассивНайденных.ВГраница() тогда
					Текст = Текст + "И ";
				КонецЕсли;
				//добавим строки на удаление, все, кроме первой
				Если Сч > 1 тогда
					нСтрУдаления = МассивУдаления.Найти(СтрокаМассива);
					Если нСтрУдаления = Неопределено тогда
						МассивУдаления.Добавить(СтрокаМассива);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//СОО = "Дублирующиеся строки: "+Текст+"";
			////записываем строку ошибок, без дублирования
			//пСтрокаОшибки = ТЗОшибок.Найти(СОО, "Ошибка");
			//Если пСтрокаОшибки = Неопределено тогда
			//	СтрокаТЗ 			= ТЗОшибок.Добавить();
			//	СтрокаТЗ.Ошибка 	= СОО;
			//	СтрокаТЗ.Строка		= ТекНСтроки-1;
			//	СтрокаТЗ.Элемент	= "БСО";
			//КонецЕсли;
			
			//удалим дубли строк
			//Если Режим тогда
				Для Каждого СтрУдаления ИЗ МассивУдаления цикл
					ТаблицаДвижений.Удалить(СтрУдаления);
				КонецЦикла;
				Движения.Загрузить(ТаблицаДвижений);
			//КонецЕсли;
			
			//Отказ = ИСТИНА;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//чкн

Процедура Состояние_(Текст, Пауза=0) Экспорт
	#Если Клиент Тогда
		Состояние(Текст);
		Если Пауза>0 Тогда
			Попытка
				уб_temp.Пауза(Пауза);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	#КонецЕсли
КонецПроцедуры	



Функция УстановитьЗначение(Реквизит, НовоеЗначение, СтароеЗначение = Неопределено, УстанавливатьНеопределено = Истина) Экспорт
	СтароеЗначение = Реквизит;
	Если Реквизит <> НовоеЗначение Тогда
		Если НовоеЗначение = Неопределено и УстанавливатьНеопределено = ЛОЖЬ Тогда
		Иначе	
			Реквизит = НовоеЗначение;
			Возврат Истина;
		КонецЕсли;	
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


Функция ПРег(знач Фраза) Экспорт 
	//Первая буква в предложении - прописная, остальные - строчные
	Возврат ВРег(Лев(Фраза,1)) + НРег(Прав(Фраза,СтрДлина(Фраза) - 1));
КонецФункции

Функция ДатаПрописью(ДатаЗнач, СЗаглавнойБуквы = Ложь, Падеж = Неопределено) Экспорт 
	
	День_П 	= День(ДатаЗнач);
	Месяц_П = Месяц(ДатаЗнач);
	Год_П	= Год(ДатаЗнач);
	
	Если Падеж = Перечисления.Падежи.Родительный ИЛИ Падеж = 2 Тогда
		День_Зн = ДеньПрописью(День_П);
	Иначе
		Если Прав(День_П, 1) = 3 Тогда
			День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2);
			Если День_П = 13 Тогда 
				День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2) + "е";
			КонецЕсли;	
		ИначеЕсли День_П = 23 Тогда
			День_Зн = "двадцать третье"
		Иначе
			День_Зн = Сред(ДеньПрописью(День_П), 1, СтрДлина(ДеньПрописью(День_П)) - 2) + "е";
		КонецЕсли
	КонецЕсли;
	
	Месяц_Зн = МесяцПрописью(Месяц_П);
	Год_Зн 	 = ГодПрописью(Год_П);
	
	ТекстДата = День_Зн + " " + Месяц_Зн + " " + Год_Зн;
	
	Если СЗаглавнойБуквы Тогда
		ТекстДата = ВРег(Лев(ТекстДата,1)) + Прав(ТекстДата,СтрДлина(ТекстДата) - 1);
	КонецЕсли;
	
	Возврат ТекстДата;
КонецФункции

Функция ДеньПрописью(День_П) Экспорт
	
	Если День_П = 1 Тогда
		День_П = "первого";
	ИначеЕсли День_П = 2 Тогда
		День_П = "второго";
	ИначеЕсли День_П = 3 Тогда
		День_П = "третьего";
	ИначеЕсли День_П = 4 Тогда
		День_П = "четвертого";
	ИначеЕсли День_П = 5 Тогда
		День_П = "пятого";
	ИначеЕсли День_П = 6 Тогда
		День_П = "шестого";
	ИначеЕсли День_П = 7 Тогда
		День_П = "седьмого";
	ИначеЕсли День_П = 8 Тогда
		День_П = "восьмого";
	ИначеЕсли День_П = 9 Тогда
		День_П = "девятого";
	ИначеЕсли День_П = 10 Тогда
		День_П = "десятого";
	ИначеЕсли День_П = 11 Тогда
		День_П = "одиннадцатого";
	ИначеЕсли День_П = 12 Тогда
		День_П = "двенадцатого";
	ИначеЕсли День_П = 13 Тогда
		День_П = "тринадцатого";
	ИначеЕсли День_П = 14 Тогда
		День_П = "четырнадцатого";
	ИначеЕсли День_П = 15 Тогда
		День_П = "пятнадцатого";
	ИначеЕсли День_П = 16 Тогда
		День_П = "шестнадцатого";
	ИначеЕсли День_П = 17 Тогда
		День_П = "семнадцатого";
	ИначеЕсли День_П = 18 Тогда
		День_П = "восемнадцатого";
	ИначеЕсли День_П = 19 Тогда
		День_П = "девятнадцатого";
	ИначеЕсли День_П = 20 Тогда
		День_П = "двадцатого";
	ИначеЕсли День_П = 21 Тогда
		День_П = "двадцать первого";
	ИначеЕсли День_П = 22 Тогда
		День_П = "двадцать второго";
	ИначеЕсли День_П = 23 Тогда
		День_П = "двадцать третьего";
	ИначеЕсли День_П = 24 Тогда
		День_П = "двадцать четвертого";
	ИначеЕсли День_П = 25 Тогда
		День_П = "двадцать пятого";
	ИначеЕсли День_П = 26 Тогда
		День_П = "двадцать шестого";
	ИначеЕсли День_П = 27 Тогда
		День_П = "двадцать седьмого";
	ИначеЕсли День_П = 28 Тогда
		День_П = "двадцать восьмого";
	ИначеЕсли День_П = 29 Тогда
		День_П = "двадцать девятого";
	ИначеЕсли День_П = 30 Тогда
		День_П = "тридцатого";
	ИначеЕсли День_П = 31 Тогда
		День_П = "тридцать первого";
	КонецЕсли;
	
	Возврат День_П;
	
КонецФункции

Функция Abs(Ч) Экспорт
	Возврат ?(Ч < 0, Ч * -1, Ч);
КонецФункции

Функция МесяцПрописью(Месяц_П, СЗаглавнойБуквы = Ложь, Падеж = 2) Экспорт
	
	Если Месяц_П = 1 Тогда
		Месяц_П = "январь";
	ИначеЕсли Месяц_П = 2 Тогда
		Месяц_П = "февраль";
	ИначеЕсли Месяц_П = 3 Тогда
		Месяц_П = "март";
	ИначеЕсли Месяц_П = 4 Тогда
		Месяц_П = "апрель";
	ИначеЕсли Месяц_П = 5 Тогда
		Месяц_П = "май";
	ИначеЕсли Месяц_П = 6 Тогда
		Месяц_П = "июнь";
	ИначеЕсли Месяц_П = 7 Тогда
		Месяц_П = "июль";
	ИначеЕсли Месяц_П = 8 Тогда
		Месяц_П = "август";
	ИначеЕсли Месяц_П = 9 Тогда
		Месяц_П = "сентябрь";
	ИначеЕсли Месяц_П = 10 Тогда
		Месяц_П = "октябрь";	
	ИначеЕсли Месяц_П = 11 Тогда
		Месяц_П = "ноябрь";	 	
	ИначеЕсли Месяц_П = 12 Тогда
		Месяц_П = "декабрь";
	КонецЕсли;	
	Месяц_П = ФункцииРасширения.Склонение(Месяц_П, Падеж);
	Возврат ?(СЗаглавнойБуквы, ВРег(Лев(Месяц_П,1)) + Прав(Месяц_П,СтрДлина(Месяц_П) - 1), Месяц_П);
	
КонецФункции

Функция ГодПрописью(Год_П) Экспорт
	
	ПолныйГод = Год_П;
	
	Если Число(Прав(Год_П, 1)) = 0 Тогда 
		Десятки = ПреобразоватьДесятки(Год_П, Истина);
		Год_Зн = "" + Десятки + " года";
	Иначе 
		Если Число(Прав(Год_П, 2)) < 10 Или Число(Прав(Год_П, 2)) >= 20 Тогда
			Десятки = ПреобразоватьДесятки(Число(Лев(Прав(Год_П,2), 1) + "0"), Ложь);
			Еденицы = ПреобразоватьЕденицы(Число(Прав(Год_П, 1)));
			Год_Зн = "" + Десятки + Еденицы + " года";
		Иначе 
			ВыборТекст = "один" + Символы.ПС + "две" + Символы.ПС + "три" + Символы.ПС + "четыр" + Символы.ПС + "пят" + Символы.ПС + "шест" + Символы.ПС + "сем" + Символы.ПС + "восем" + Символы.ПС + "девят";
			Год_Зн = " " + СтрПолучитьСтроку(ВыборТекст, Прав(Год_П, 1)) + "надцатого года";
		КонецЕсли;
	КонецЕсли;
	
	Если ПолныйГод = 2000 Тогда 
		Возврат "двухтысячного года";
	ИначеЕсли ПолныйГод > 2000 Тогда 
		Возврат "две тысячи" + Год_Зн;
	ИначеЕсли ПолныйГод = 1900 Тогда  
		Возврат "одна тысяча девятьсотого" + Год_Зн;
	Иначе
		Возврат "одна тысяча девятьсот" + Год_Зн;
	КонецЕсли;	
	
КонецФункции

Функция ПреобразоватьДесятки(ЧислоДесятки, Нуль)
	
	ЧислоДесятки = Число(Прав(ЧислоДесятки,2));
	
	Если ЧислоДесятки = 10 Тогда
		Месяц_П = " десятого";
	ИначеЕсли ЧислоДесятки = 20 Тогда 
		Месяц_П = " двадцатого";
		Месяц_П_1 = " двадцать";
	ИначеЕсли ЧислоДесятки = 30 Тогда
		Месяц_П = " тридцатого";
		Месяц_П_1 = " тридцать";
	ИначеЕсли ЧислоДесятки = 40 Тогда
		Месяц_П = " сорокового";
		Месяц_П_1 = " сорок";
	ИначеЕсли ЧислоДесятки = 50 Тогда
		Месяц_П = " пятидесятого";
		Месяц_П_1 = " пятьдесят";
	ИначеЕсли ЧислоДесятки = 60 Тогда
		Месяц_П = " шестидесятого";
		Месяц_П_1 = " шестьдесят";
	ИначеЕсли ЧислоДесятки = 70 Тогда
		Месяц_П = " семидесятого";
		Месяц_П_1 = " семьдесят";
	ИначеЕсли ЧислоДесятки = 80 Тогда
		Месяц_П = " восьмидесятого";
		Месяц_П_1 = " восемьдесят";
	ИначеЕсли ЧислоДесятки = 90 Тогда
		Месяц_П = " девяностого";
		Месяц_П_1 = " девяносто";
	КонецЕсли;
	
	Если Нуль Тогда
		Возврат Месяц_П;
	Иначе
		Возврат Месяц_П_1;
	КонецЕсли;
	
КонецФункции

Функция ПреобразоватьЕденицы(ЧислоЕденицы)
	
	Если ЧислоЕденицы = 1 Тогда 
		myDay = " первого";
	ИначеЕсли ЧислоЕденицы = 2 Тогда 
		myDay = " второго";
	ИначеЕсли ЧислоЕденицы = 3 Тогда
		myDay = " третьего";
	ИначеЕсли ЧислоЕденицы = 4 Тогда
		myDay = " четвертого";
	ИначеЕсли ЧислоЕденицы = 5 Тогда
		myDay = " пятого";
	ИначеЕсли ЧислоЕденицы = 6 Тогда
		myDay = " шестого";
	ИначеЕсли ЧислоЕденицы = 7 Тогда
		myDay = " седьмого";
	ИначеЕсли ЧислоЕденицы = 8 Тогда
		myDay = " восьмого";
	ИначеЕсли ЧислоЕденицы = 9 Тогда
		myDay = " девятого";
	КонецЕсли;
	
	Возврат  myDay;
	
КонецФункции


//Переводит строку из кириллицы в транслит
Функция Транслит(ТекстК) Экспорт 

	Транслит_СписокЗамен = Новый СписокЗначений;
	Транслит_СписокЗамен.Добавить("а","a");
	Транслит_СписокЗамен.Добавить("б","b");
	Транслит_СписокЗамен.Добавить("в","v");
	Транслит_СписокЗамен.Добавить("г","g");
	Транслит_СписокЗамен.Добавить("д","d");
	Транслит_СписокЗамен.Добавить("е","e");
	Транслит_СписокЗамен.Добавить("ё","e");
	Транслит_СписокЗамен.Добавить("ж","zh");
	Транслит_СписокЗамен.Добавить("з","z");
	Транслит_СписокЗамен.Добавить("и","i");
	Транслит_СписокЗамен.Добавить("й","y");
	Транслит_СписокЗамен.Добавить("к","k");
	Транслит_СписокЗамен.Добавить("л","l");
	Транслит_СписокЗамен.Добавить("м","m");
	Транслит_СписокЗамен.Добавить("н","n");
	Транслит_СписокЗамен.Добавить("о","o");
	Транслит_СписокЗамен.Добавить("п","p");
	Транслит_СписокЗамен.Добавить("р","r");
	Транслит_СписокЗамен.Добавить("с","s");
	Транслит_СписокЗамен.Добавить("т","t");
	Транслит_СписокЗамен.Добавить("у","u");
	Транслит_СписокЗамен.Добавить("ф","f");
	Транслит_СписокЗамен.Добавить("х","kh");
	Транслит_СписокЗамен.Добавить("ц","ts");
	Транслит_СписокЗамен.Добавить("ч","ch");
	Транслит_СписокЗамен.Добавить("ш","sh");
	Транслит_СписокЗамен.Добавить("щ","shch");
	Транслит_СписокЗамен.Добавить("ъ","");//Ъ ъ - ''
	Транслит_СписокЗамен.Добавить("ы","y");
	Транслит_СписокЗамен.Добавить("ь","");//Ь ь - '
	Транслит_СписокЗамен.Добавить("э","e");
	Транслит_СписокЗамен.Добавить("ю","yu");
	Транслит_СписокЗамен.Добавить("я","ya");
	
	Транслит_СписокЗамен.Добавить("А","A");
	Транслит_СписокЗамен.Добавить("Б","B");
	Транслит_СписокЗамен.Добавить("В","V");
	Транслит_СписокЗамен.Добавить("Г","G");
	Транслит_СписокЗамен.Добавить("Д","D");
	Транслит_СписокЗамен.Добавить("Е","E");
	Транслит_СписокЗамен.Добавить("Ё","E");
	Транслит_СписокЗамен.Добавить("Ж","Zh");
	Транслит_СписокЗамен.Добавить("З","Z");
	Транслит_СписокЗамен.Добавить("И","I");
	Транслит_СписокЗамен.Добавить("Й","Y");
	Транслит_СписокЗамен.Добавить("К","K");
	Транслит_СписокЗамен.Добавить("Л","L");
	Транслит_СписокЗамен.Добавить("М","M");
	Транслит_СписокЗамен.Добавить("Н","N");
	Транслит_СписокЗамен.Добавить("О","O");
	Транслит_СписокЗамен.Добавить("П","P");
	Транслит_СписокЗамен.Добавить("Р","R");
	Транслит_СписокЗамен.Добавить("С","S");
	Транслит_СписокЗамен.Добавить("Т","T");
	Транслит_СписокЗамен.Добавить("У","U");
	Транслит_СписокЗамен.Добавить("Ф","F");
	Транслит_СписокЗамен.Добавить("Х","Kh");
	Транслит_СписокЗамен.Добавить("Ц","Ts");
	Транслит_СписокЗамен.Добавить("Ч","Ch");
	Транслит_СписокЗамен.Добавить("Ш","Sh");
	Транслит_СписокЗамен.Добавить("Щ","Shch");
	Транслит_СписокЗамен.Добавить("Ъ","");//Ъ ъ - ''
	Транслит_СписокЗамен.Добавить("Ы","Y");
	Транслит_СписокЗамен.Добавить("Ь","");//Ь ь - '
	Транслит_СписокЗамен.Добавить("Э","E");
	Транслит_СписокЗамен.Добавить("Ю","Yu");
	Транслит_СписокЗамен.Добавить("Я","Ya");

	ТекстК = СокрЛП(ТекстК);
	ТекстК = СтрЗаменить(ТекстК, Символы.ВК + Символы.ПС," ");
	РезультатЗамены = ТекстК;
	
	ВерхГр = Транслит_СписокЗамен.Количество()-1;
	Для х = 0 по ВерхГр  Цикл
		Элемент = Транслит_СписокЗамен.Получить(х);
		РезультатЗамены = СтрЗаменить(РезультатЗамены, Элемент.Значение,Элемент.Представление);
	КонецЦикла;
	
	Возврат РезультатЗамены;
КонецФункции


Функция Месяца(Дата) Экспорт 
	сДТ = Формат(Дата,"ДФ='dd MMMM'");
	Возврат Прав(сДТ, СтрДлина(сДТ) - 3);
КонецФункции
