#Если ТолстыйКлиент ИЛИ Сервер Тогда
//&НаСервере
Функция ДанныеБСОПолиса(Документ) Экспорт
	лТип  = ТипЗнч(Документ);
	Если лТип = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		СтруктураБСО = ДанныеБСОПоРегистраторуИОперации(Документ,Перечисления.уб_КодыОперацийБСО.ОформлениеПолиса)[0];
	ИначеЕсли лТип = Тип("ДокументОбъект.уб_СтраховойПолис") Тогда	
		Если Документ.Модифицированность() Тогда
			//Перебираем по ТЧ, данные по БСО могли изменится
			СтруктураБСО = ДанныеБСОПолисаИзОбъекта(Документ);
		Иначе
			СтруктураБСО = ДанныеБСОПоРегистраторуИОперации(Документ.Ссылка,Перечисления.уб_КодыОперацийБСО.ОформлениеПолиса)[0];
		КонецЕсли;	
	КонецЕсли;
	Возврат СтруктураБСО
КонецФункции

//&НаСервере
Функция ДанныеБСОПоРегистраторуИОперации(Регистратор,КодОперации) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|  уб_ДвиженияБСО.*,
	|  уб_ДвиженияБСО.ВидБСО.Тип как Тип,
	|  уб_ДвиженияБСО.ВидБСО.ТипУчетаБСО как ТипУчетаБСО
	|ИЗ
	|  РегистрСведений.уб_ДвиженияБСО КАК уб_ДвиженияБСО
	|ГДЕ
	|  уб_ДвиженияБСО.Регистратор = &Регистратор
	|  И уб_ДвиженияБСО.КодОперации = &КодОперации
    |
	|УПОРЯДОЧИТЬ ПО
	|  Период УБЫВ");
	
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Запрос.УстановитьПараметр("КодОперации",КодОперации);
	Массив = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
			ЗаполнитьЗначенияСвойств(СтруктураБСО,Выборка);
			Массив.Добавить(СтруктураБСО);
		КонецЦикла;
	Иначе
		СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
		Массив.Добавить(СтруктураБСО);
	КонецЕсли;

	
	Возврат Массив;
КонецФункции

//&НаСервере
Функция ДанныеБСОПолисаИзОбъекта(Документ) Экспорт
	//TODO исправить на новый формат
	Для каждого ТекСтрока Из Документ.БСО  Цикл
		Тип = Неопределено;
		ВидБСО = ТекСтрока.ВидБСО;
		ТипУчетаБСО =Неопределено;
		Если уб_СЛ.ОпределитьЭтоПолис(ВидБСО,Тип) Тогда
			Если уб_СЛ.ОпределитьВедетсяНомернойУчет(ВидБСО,ТипУчетаБСО) Тогда
				НомерБСО = ТекСтрока.НомерБСО;		
			Иначе
				
				НомерБСО = уб_СЛ.ДайНомерБСОДляКоличУчета(Документ.Номер);		
			КонецЕсли;
			СтруктураПоиска = Новый Структура("СК, ВидБСО, НомерБСО"
			, ?(ВидБСО.УниверсальноеБСО,ВидБСО.Владелец,Документ.СК)
			, ВидБСО
			, НомерБСО);								  
			оАгент = ТекСтрока.Агент;
			Если НЕ ЗначениеЗаполнено(оАгент) Тогда
				оАгент = ?( ЗначениеЗаполнено(Документ.Курьер), Документ.Курьер,Документ.Агент);	
			КонецЕсли;
			оПоставщик = ?(ВидБСО.УниверсальноеБСО,ВидБСО.Владелец,Документ.Поставщик);
			оОргАгент = ?(ВидБСО.УниверсальноеБСО,Неопределено,Документ.ОрганизацияАгент);							  								  
			ТекСостояниеБСО = Неопределено;
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ТекСтрока",СтруктураПоиска);
			СтруктураПараметров.Вставить("ТекСостояниеБСО",ТекСостояниеБСО);
			СтруктураПараметров.Вставить("НаДату",Документ.ДатаДвиженияБСО);
			СтруктураПараметров.Вставить("тсАгент",оАгент);
			СтруктураПараметров.Вставить("тсПоставщик",оПоставщик);
			СтруктураПараметров.Вставить("тсОрганизацияАгент",оОргАгент);
			СтруктураПараметров.Вставить("хВидГраницы",ВидГраницы.Исключая);			
			
			СтруктураБСО = уб_СС.ПрочитатьТекущееСостояниеБСОПоСтрокеТЧ();
			ТекСостояниеБСО = СтруктураПараметров.ТекСостояниеБСО;
			//СтруктураПоиска
			//, ТекСостояниеБСО
			//, Документ.ДатаДвиженияБСО
			//, оАгент
			//, оПоставщик
			//, оОргАгент
			////, ?(Проведен,ВидГраницы.Включая,ВидГраницы.Исключая));
			//, ВидГраницы.Исключая
			Возврат СтруктураБСО;
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

//&НаСервере
Функция ЧислоДнейИсправленияСрочнойОшибки() Экспорт

	ЧислоДнейИсправления = ПараметрыСеанса.уб_Константы.ЧислоДнейИсправленияСрочнойОшибки;
	Если ТипЗнч(ЧислоДнейИсправления) <> Тип("Число") Тогда
		ЧислоДнейИсправления = 3 //три дня
	КонецЕсли;
	Возврат ЧислоДнейИсправления;

КонецФункции // ЧислоДнейИсправленияСрочнойОшибки()
	
#КонецЕсли