Перем мВалютаРегламентированногоУчета Экспорт;
Перем _НеОповещатьОЗаписи_ Экспорт;
Перем СтруктураВидБСО Экспорт;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Модифицированность();
	
	ВидСП = ?(ТипЗнч(Страховойпродукт)=Тип("СправочникСсылка.уб_СтраховыеПродукты"),Страховойпродукт.Вид,Страховойпродукт);
	
	уб_РасчетыСМенеджерами.ПроверитьВидСтрахования(ЭтотОбъект,ВидСП);
	
	//уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"ВидС", ВидСтрахования);

	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ПодразделениеОП) Тогда
		ПодразделениеОП = уб_СС.ПолучитьПодразделениеАгента(Агент, Дата);
	КонецЕсли;	
	

	Если Не ЗначениеЗаполнено(Собственник) Тогда
		Собственник = Страхователь;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("Заявка",Заявка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
		               |	ЛОЖЬ КАК Проведен,
		               |	ЛОЖЬ КАК ПометкаУдаления,
		               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Куратор
		               |ИЗ
		               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста";
	Иначе
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
			|	уб_СтраховойПолис.Ссылка,
			|	уб_СтраховойПолис.Проведен,
			|	уб_СтраховойПолис.ПометкаУдаления,
			|	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Куратор, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Куратор
			|ИЗ
			|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
			|		ПО уб_СтраховойПолис.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
			|ГДЕ
		|	уб_СтраховойПолис.Ссылка = &Ссылка";		
	КонецЕсли;		   
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	Если ВыборкаСсылка.Следующий() Тогда
		бУстановкаПометкиУдаления = НЕ ВыборкаСсылка.ПометкаУдаления И ПометкаУдаления;
		бСнятиеПометкиУдаления = ВыборкаСсылка.ПометкаУдаления И НЕ ПометкаУдаления;
		
		бПроведение = НЕ ВыборкаСсылка.Проведен И Проведен;
		бСнятиеПроведения = ВыборкаСсылка.Проведен И НЕ Проведен;
		Если ЗначениеЗаполнено(ВыборкаСсылка.Куратор) и не Куратор = ВыборкаСсылка.Куратор Тогда
			Куратор = ВыборкаСсылка.Куратор;
		КонецЕсли;
	Иначе
		бУстановкаПометкиУдаления = ПометкаУдаления;
		бСнятиеПометкиУдаления = НЕ ПометкаУдаления;
		бПроведение  = Проведен;
		бСнятиеПроведения = НЕ Проведен;
	КонецЕсли;
	
	
	// Нельзя помечать на удаление полисы, содержащие оплаты
	Если бУстановкаПометкиУдаления Тогда
		ТЗОплат = ОП_ПолучитьТЗОплат();
		Если ТЗОплат.Количество() > 0 Тогда
			Отказ = Истина;
			#Если Клиент Тогда
			Предупреждение("Нельзя помечать как удаленный полис, в котором есть оплаты!
			|
			|Сначала удалите все оплаты.
			|
			|(Для удаления оплаты, ее необходимо вначале отсоединить от отчетов Агенту и Поставщику)",15,"Внимание! Операция отменена!");
			#КонецЕсли
			Возврат;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;		
	Если ПараметрыСеанса.уб_Константы.ОтключитьДвиженияВПолисе Тогда
		Возврат;	
	КонецЕсли;	
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов Тогда
		ОчиститьСообщения();
	КонецЕсли;	
	#КонецЕсли
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Запись документа """ + СокрЛП(Ссылка) + """: ";
	Если Не Отказ И НЕ Проведен Тогда
		ТаблицаБСО = ДвиженияПоРегистрам(Отказ, Заголовок);		
		Если Не Отказ Тогда
			//Проверить сдачу БСО выданного по заявке, связанной с полисом
			//уб_УСЗ.ПроверитьНеобходимостьВозвратаПоСвязаннымЗаявкам(Ссылка);		
			//Установка/Исправление флага крупной сделки оплат 
			Если ПараметрыСеанса.уб_Константы.уб_ИспользуетсяМеханизмСделок = ИСТИНА Тогда
				ЭтоКрупнаяСделка = НЕ Сделка.Пустая() И НЕ (НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная или НомерЗаявки = Перечисления.уб_ВидыЗаявок.Агентская) И Сделка.Крупная ;			
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	уб_ОплатаПолисов.Ссылка
				|ИЗ
				|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
				|ГДЕ
				|	уб_ОплатаПолисов.ПометкаУдаления = ЛОЖЬ
				|	И НЕ уб_ОплатаПолисов.ЭтоКрупнаяСделка = &ЭтоКрупнаяСделка
				|	И уб_ОплатаПолисов.СтраховойПолис = &СтраховойПолис");			
				Запрос.УстановитьПараметр("СтраховойПолис", Ссылка);
				Запрос.УстановитьПараметр("ЭтоКрупнаяСделка", ЭтоКрупнаяСделка);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОБОплата =  Выборка.Ссылка.ПолучитьОбъект();
					ОБОплата.ЭтоКрупнаяСделка = ЭтоКрупнаяСделка;
					Попытка
						//ОБОплата.ЭтоПереустановкаЗПКрупнойСделки = Истина;//Отключаем проверку правки периода старых оплат (в случае удаления оплаты из крупной сделки возможны проблемы)
						ОБОплата.Записать();
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка при исключении оплаты из крупной сделки. Попробуйте записать полис."+Символы.ПС+
						"Техническая информация: "+ОписаниеОшибки(),
						"Сообщить", 
						Истина,
						УровеньЖурналаРегистрации.Ошибка,
						Ссылка.Метаданные(),
						Ссылка,
						"Error");
					КонецПопытки;	
				КонецЦикла;	
			КонецЕсли;
			Если Не Проведен Тогда
				Если ДополнительныеСвойства.Свойство("НеДвигатьСтатусы") Тогда
				Иначе
					уб_УСЗ.ТребуетсяВозвратБСОПоСсылке(Ссылка);
				КонецЕсли;
				
			КонецЕсли;
		Иначе	
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Отказ после движения по регистрам при проведении",
			"Сообщить", 
			Истина,
			УровеньЖурналаРегистрации.Ошибка,
			Ссылка.Метаданные(),
			Ссылка,
			"Error");
		КонецЕсли;
	Иначе
		Если Отказ Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Отказ при записи документа",
			"Сообщить", 
			Истина,
			УровеньЖурналаРегистрации.Ошибка,
			Ссылка.Метаданные(),
			Ссылка,
			"Error");
		КонецЕсли;
	КонецЕсли;

	Если Отказ = Ложь и ПустаяСтрока(КоличествоФайловB2B) Тогда
		уб_СтраховойБрокер.ПроставитьСтрахователяВФайлахПоЗаявке(Ссылка);
		_НеОповещатьОЗаписи_ = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ОбъектКопирования.Дата;
	//стираем данные агента, т.к. при копировании без права ЗП_ПолныйДоступ Агента нельзя менять даже в незаписанном документе
	Если Не уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Тогда
		Агент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ПараметрыСеанса.уб_Константы.ОтключитьДвиженияВПолисе Тогда
		Возврат;	
	КонецЕсли;	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("СК, СтраховойПродукт, ОбъектСтрахования, Страхователь, ВалютаДокумента, НомерЗаявки, Поставщик, ОрганизацияАгент, Ответственный, Ответственный2, СтраховаяСумма, СтраховаяПремия");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		СтрокаСообщения = "Номер полиса не заполнен. Проведение не возможно!";
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;	
	// Проверяем правильность выбора типа объекта страхования
	Если ТипЗНЧ(СтраховойПродукт) = Тип("СправочникСсылка.уб_ОбъектыСтрахования") Тогда
		ТипОбъектаСтрахованияУказанВерно = ЛОЖЬ; 		
		Если Не СтраховойПродукт.Пустая() И Не ОбъектСтрахования.Пустая() Тогда
			Для Каждого СтрокаТЧ из СтраховойПродукт.ТипыОбъектовИРиски Цикл
				Если СтрокаТЧ.ТипОбъекта = ОбъектСтрахования.Тип Тогда
					ТипОбъектаСтрахованияУказанВерно = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если СтраховойПродукт.ТипыОбъектовИРиски.Количество() = 0 Тогда
				ДопИнфо = " (Отсутствуют страховые риски)";
			Иначе
				ДопИнфо = "";	
			КонецЕсли;
			Если НЕ ТипОбъектаСтрахованияУказанВерно Тогда
				СтрокаСообщения = "Тип объекта не найден в страховом продукте! "+ДопИнфо+". "+Ссылка;
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли; 
	Иначе
		ТипОбъектаСтрахованияУказанВерно = Истина; 		
	КонецЕсли; 
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	Если ТипОбъектаСтрахованияУказанВерно Тогда
		ПроверитьЗаполнениеТабличнойЧастиРиски(Отказ, Заголовок);
	КонецЕсли;
	ПроверитьЗаполнениеТабличнойЧастиОплаты(Отказ, Ложь, Истина, Ложь, Ложь, 1,,,Истина);	
	// Движения по документу
	Если Не Отказ Тогда
		ТаблицаБСО = ДвиженияПоРегистрам(Отказ, Заголовок);
		Если ДополнительныеСвойства.Свойство("НеДвигатьСтатусы") Тогда
		Иначе
			уб_УСЗ.ТребуетсяВозвратБСОПоСсылке(Ссылка);
		КонецЕсли;
	КонецЕсли;	
	#Если Клиент Тогда
	Оповестить("ПриЗаписиСтраховогоПолиса", Проведен, ЭтотОбъект);
	#КонецЕсли

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для Каждого НаборЗаписей Из Движения Цикл
		Если НаборЗаписей <> Движения.уб_СвободныеНомераПолисов Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
    
Функция ДвиженияПоРегистрам(Отказ, Заголовок)
	
	ТаблицаБСО = ПодготовитьТаблицуБСО();
	Если Поставщик.Пустая() Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указан Поставщик", Отказ, Заголовок);
		Возврат ТаблицаБСО;	
	КонецЕсли;
	Если ОрганизацияАгент.Пустая() Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана Организация-Агент", Отказ, Заголовок);
		Возврат ТаблицаБСО;	
	КонецЕсли;
	// удаляем движения по регистрам
	Для Каждого НаборЗаписей Из Движения Цикл
		Если НаборЗаписей <> Движения.уб_СвободныеНомераПолисов Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	ПолисАннулирован = уб_СЛ.ПолисАннулирован(СостояниеПолиса);
	//Признак того, что данное движение должно быть записано КАК ЕСТЬ (только для информации с соответствующими флажками)
	ИнфоЗапись = Не Ссылка.Проведен Или ОтключитьКонтрольНомеровБСО;
	пНзнБСО = Перечисления.уб_НазначенияБСО;
	пПлжБСО = Перечисления.уб_ПоложенияБСО;
	пСстБСО = Перечисления.уб_СостоянияБСО;
	КонтролироватьНаличиеБСО = ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО;
	Для Каждого СтрокаТЧ Из ТаблицаБСО Цикл
		НаборДвижений = Новый Массив;
		НаборДвижений.Добавить("Основное");
		Если ПолисАннулирован Тогда
			Если ДатаАннулирования = Дата(1,1,1) Тогда
				ДатаАннулирования = ДатаИзменения;
			КонецЕсли;	
			НаборДвижений.Добавить("Аннулирование");
		КонецЕсли;
		ВидБСО = СтрокаТЧ.ВидБСО;
		Если СтрокаТЧ.ЭтоКвитанцияВОплате Тогда
			s1 = "Закладка 'Оплаты'. ";
			s2 = "Взнос № ";
			s3 = "";
		Иначе
			s1 = "Закладка 'БСО'. ";
			s2 = "Строка № ";
			s3 = "БСО ";
		КонецЕсли;
		sГде = s1 + s2 + СокрЛП(Строка(СтрокаТЧ.НомерСтроки)) + ": ";
		сВидБСО = Строка(СтрокаТЧ.ВидБСО);
		сНомБСО = СокрЛП(СтрокаТЧ.НомерБСО);
		sБСО = s3 + "'" + сВидБСО + "' с номером " + сНомБСО;
		sГде_и_БСО = sГде + sБСО;
		Если ТипЗнч(СтрокаТЧ.ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
			актуалСК = СК;
		Иначе	
			актуалСК = ?(СтрокаТЧ.ВидБСО.УниверсальноеБСО, СтрокаТЧ.ВидБСО.Владелец, СК);
		КонецЕсли;	
		актуалПоставщик = Неопределено;
		актуалОргАгент 	= Неопределено;
		АктуалЗаявка    = Неопределено;
	
		Если СтрокаТЧ.ВедетсяНомернойУчет = Истина Тогда 
			_ЕстьОшибка = Ложь;
			////////////////////////////////////////////////////////////////////
			// Проверки ключеых измерений, если они не заполнены, в регистр не пишем ни при каких обстояельсвах
			Если сНомБСО = "" Тогда
				_ЕстьОшибка = Истина;
				СтрокаСообщения = sГде +" Не указан номер БСО!";
			КонецЕсли;
			Если СК.Пустая() = "" Тогда
				_ЕстьОшибка = Истина;
				СтрокаСообщения = "Не указана сраховая компания!";
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ВидБСО) Тогда
				_ЕстьОшибка = Истина;
				СтрокаСообщения = sГде + " Не указан Вид БСО!";
			КонецЕсли;
			Если _ЕстьОшибка Тогда
				Если ИнфоЗапись Тогда
					Отказ_Пустышка = Ложь;
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ_Пустышка, Заголовок);
				Иначе
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				Продолжить;	
			КонецЕсли;
			////////////////////////////////////////////////////////////////////
			СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();		
			СтруктураБСО.Период 	= Новый Граница(СтрокаТЧ.ДатаДвижения, ВидГраницы.Исключая);
			СтруктураБСО.СК 		= актуалСК;			
			СтруктураБСО.ВидБСО 	= ВидБСО;
			СтруктураБСО.НомерБСО 	= сНомБСО;	
			уб_СЛ.ПрочитатьСостояниеБСО(СтруктураБСО);
			Если СтруктураБСО.Существует Тогда 
				//Если ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО")
				//	И ВидБСО.УниверсальноеБСО Тогда
				//	актуалПоставщик = СтруктураБСО.Поставщик;
				//	актуалОргАгент 	= СтруктураБСО.ОрганизацияАгент;
				//Иначе	
					актуалПоставщик = Поставщик;
					актуалОргАгент 	= ОрганизацияАгент;
				//КонецЕсли;				
				//По идее, такого случаться не должно 
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.АгентОТ) Тогда
					СтрокаТЧ.АгентОТ = СтруктураБСО.Агент;	
				КонецЕсли;
			Иначе
				Если ТипЗнч(ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
					актуалПоставщик = Поставщик;
					актуалОргАгент 	= ОрганизацияАгент;
				Иначе
					Если Не ВидБСО.УниверсальноеБСО Тогда
						актуалПоставщик = Поставщик;
						актуалОргАгент 	= ОрганизацияАгент;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;			
			//TO DO  Когда это может быть
			Если Лев(сНомБСО,4) = "=НЕТ" Тогда
				СтруктураБСО.Существует = Истина;				
				СтруктураБСО.СК = актуалСК;
				СтруктураБСО.ВидБСО 			= ВидБСО;
				СтруктураБСО.НомерБСО 			= сНомБСО;
				СтруктураБСО.Поставщик 			= ?(Не ЗначениеЗаполнено(актуалПоставщик), актуалСК, актуалПоставщик);
				СтруктураБСО.ОрганизацияАгент 	= ?(Не ЗначениеЗаполнено(актуалОргАгент), ПараметрыСеанса.уб_ОсновнаяОрганизация, актуалОргАгент);
				СтруктураБСО.Подтверждено  		= Истина;
				//СтруктураБСО.ДокПроведен 		= Истина;
				//СтруктураБСО.Активность 		= Истина;
				//СтруктураБСО.ДокПроведен 		= Проведен;
				СтруктураБСО.Активность 		= Проведен;
				//СтруктураБСО.АгентОтправитель
				СтруктураБСО.Агент				= СтрокаТЧ.АгентОТ;	
				СтруктураБСО.ПоложениеБСО 		= пПлжБСО.ПолученИзСК;
				СтруктураБСО.СостояниеБСО 		= пСстБСО.ПустойБланк;
				СтруктураБСО.Блокировка 		= Ложь;
				СтруктураБСО.НомерПолиса 		= СокрЛП(Номер);
				СтруктураБСО.ГодПолиса 			= "";
				//СтруктураБСО.СтраховойПолис 	= ;
				СтруктураБСО.НаОснованииБумажногоДокумента = Ложь;
				СтруктураБСО.ДатаВозврата 		= Неопределено;
			КонецЕсли;			
			Проводить = Истина;			
			////////////////////////////////////////////////////////////////////
			Если ТипЗнч(СтруктураБСО.ВидБСО) = ТИП("СправочникСсылка.уб_ВидыБСО")  и НЕ СтруктураБСО.ВидБСО.ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную Тогда
				Если НЕ СтруктураБСО.Существует Тогда
					Проводить = Ложь;
					Если КонтролироватьНаличиеБСО Тогда
						_ЕстьОшибка = Истина;
						СтрокаСообщения = sГде_и_БСО + " не найден(а) для указанной СК: '" + актуалСК.Наименование + "'";
					КонецЕсли;		
				ИначеЕсли КонтролироватьНаличиеБСО Тогда				
					Если НЕ Пересортица Тогда
						СОО2 = "Установите флаг 'Пересортица' на закладке оплаты или устраните ошибку путем переоформления квитанции";
						Если СтруктураБСО.Поставщик <> актуалПоставщик Тогда
							Проводить 	= Ложь;
							_ЕстьОшибка = Истина;
							СтрокаСообщения = sГде_и_БСО + " не может быть оформлено! Т.к. поступало от поставщика: '" + 
							СтруктураБСО.Поставщик.Наименование + "', а в полисе указан поставщик: '" + актуалПоставщик.Наименование + "'"
							+ Символы.ВК + Символы.ПС + СОО2;
						КонецЕсли;					
						Если СтруктураБСО.ОрганизацияАгент <> актуалОргАгент Тогда
							Проводить 	= Истина;
							_ЕстьОшибка = Ложь;
							ИнфоЗапись 	= Ложь;
							СтрокаСообщения = sГде_и_БСО + " может быть оформлено в исключительных случаях! Т.к. числится на Организации-Агенте: '" + 
							СтруктураБСО.ОрганизацияАгент.Наименование + "', а в полисе указан ОргАгент: '" + актуалОргАгент.Наименование + "'"
							+ Символы.ВК + Символы.ПС + СОО2;
							//теперь оргагент - это ресурс, нельзя дублировать записи
							//НаборДвижений.Добавить("СписатьСДругогоОргАгента");
						КонецЕсли;
					КонецЕсли;								
				КонецЕсли;
			КонецЕсли;
			ТекСост = СтруктураБСО.СостояниеБСО;
			бЗапретПроведенияПоТекСостоянию = Ложь;
			Если Проводить Тогда
				Если ТекСост = пСстБСО.Оформлен Тогда
					Если ТипЗнч(СтруктураБСО.Регистратор) <> Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда
						бЗапретПроведенияПоТекСостоянию = Ложь;
					КонецЕсли;
				ИначеЕсли ТекСост <> пСстБСО.ПустойБланк И ТекСост <> пСстБСО.НеиспользованныйБланк Тогда
					бЗапретПроведенияПоТекСостоянию = Ложь;
				КонецЕсли;
			КонецЕсли;			
			Если бЗапретПроведенияПоТекСостоянию Тогда
				Проводить = Ложь;
				_ЕстьОшибка = Истина;
				СтрокаСообщения = sГде_и_БСО + " имеет состояние '" + Строка(ТекСост) + "' и не может быть оформлен!";
			КонецЕсли;				
			Если Проводить И СтруктураБСО.Блокировка = Истина Тогда
				Проводить = Ложь;
				_ЕстьОшибка = Истина;
				СтрокаСообщения = sГде_и_БСО + "' с номером " + сНомБСО + " заблокирован!";
			КонецЕсли;			
			//Определение кода операции
			Если СтруктураБСО.Тип = Перечисления.уб_ТипыБСО.Полис ИЛИ СтруктураБСО.Тип = Перечисления.уб_ТипыБСО.ПолисОсаго Тогда 
				оснКодОперации = Перечисления.уб_КодыОперацийБСО.ОформлениеПолиса;
			ИначеЕсли СтрокаТЧ.ЭтоКвитанцияВОплате = Истина Тогда	
				оснКодОперации = Перечисления.уб_КодыОперацийБСО.ОформлениеКвитанции;
			Иначе
				оснКодОперации = Перечисления.уб_КодыОперацийБСО.ОформлениеБСО;
			КонецЕсли;	
			Для Каждого ОтдельноеДвижение ИЗ НаборДвижений Цикл			
				Если ОтдельноеДвижение = "Аннулирование" Тогда
					Период = ?(СтрокаТЧ.ДатаДвижения < ДатаАннулирования, ДатаАннулирования, СтрокаТЧ.ДатаДвижения + 60);
					АгентКуда 		= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
					СостояниеБСО 	= пСстБСО.Испорчен;	
					ПоложениеБСО	= пПлжБСО.ВозвращенСТочки;
					КодОперации		= Перечисления.уб_КодыОперацийБСО.АннулированиеПолиса;
				//ИначеЕсли ОтдельноеДвижение = "СписатьСДругогоОргАгента" Тогда	
				//	//неактуальное
				//	СостояниеБСО 	= пСстБСО.Оформлен;	
				//	ПоложениеБСО	= пПлжБСО.Списан;
				//	актуалОргАгент  = СтруктураБСО.ОрганизацияАгент;
				//	КодОперации = оснКодОперации;
				//	продолжить;//TODO Старое действие, аккуратно убрать
				Иначе // "Основное"
					Период = СтрокаТЧ.ДатаДвижения;
					АгентКуда = СтрокаТЧ.АгентКУДА;
					СостояниеБСО = пСстБСО.Оформлен;						
					Если СтрокаТЧ.НазначениеБСО = пНзнБСО.ДляКлиента Тогда
						ПоложениеБСО	= пПлжБСО.ОтданКлиенту;
					ИначеЕсли СтрокаТЧ.НазначениеБСО = пНзнБСО.ДляБанка Тогда
						ПоложениеБСО	= пПлжБСО.ОтданБанку;
					Иначе
						Если СтруктураБСО.Существует Тогда
							текПлж = СтруктураБСО.ПоложениеБСО;
							Если Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.ГоловнойОфис 
								И (текПлж = пПлжБСО.ПереданНаТочку ИЛИ текПлж = пПлжБСО.ПереданВСК ИЛИ текПлж = пПлжБСО.Списан)
								Тогда
								//раз оформляем перемещение по головному офису, то тех положений не может быть) 
								ПоложениеБСО	= пПлжБСО.ВозвращенСТочки;
							Иначе
								ПоложениеБСО	= СтруктураБСО.ПоложениеБСО;
							КонецЕсли;
						Иначе 
							Если Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.ГоловнойОфис Тогда
								ПоложениеБСО	= пПлжБСО.ВозвращенСТочки;
							Иначе
								ПоложениеБСО	= пПлжБСО.ПереданНаТочку;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					КодОперации = оснКодОперации;
				КонецЕсли;
				Если (НЕ _ЕстьОшибка И Проводить) ИЛИ ИнфоЗапись Тогда
					СтрокаТЧ.УчавствуетВдвижениях = Истина;
					Движение = Движения.уб_ДвиженияБСО.Добавить();
					// измерения
					Движение.Период				= Период;						
					Движение.СК					= СтруктураБСО.СК;
					Движение.ВидБСО				= ВидБСО;
					Движение.НомерБСО			= сНомБСО;				
					Если СтруктураБСО.Тип = перечисления.уб_ТипыБСО.КвитанцияА7 Тогда
						//Из оплаты
						Движение.ДопНомерБСО		= СтрокаТЧ.ДопНомерБСО;				
					Иначе	
						//Из движений
						Движение.ДопНомерБСО		= СтруктураБСО.ДопНомерБСО;				
					КонецЕсли;	
					Движение.Поставщик			= актуалПоставщик;
					Движение.ОрганизацияАгент	= актуалОргАгент;					
					Если ОтдельноеДвижение = "Аннулирование" Тогда
						Движение.Период				= ?(ДатаАннулирования=Дата(1,1,1),Период,ДатаАннулирования);						
						Движение.Подтверждено 	= Истина;
						//Движение.ДокПроведен	= Ложь;
						//Движение.Активность		= Ложь;
					Иначе
						Движение.Подтверждено   	= (Не ИнфоЗапись И СтруктураБСО.Существует) И Лев(сНомБСО,4) <> "=НЕТ" ;
						//или СтруктураБСО.ВидБСО.ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную; // И (НЕ уб_СЛ.ПолисАннулирован(СостояниеПолиса) И НЕ ОтдельноеДвижение = "Аннулирование" )
						//Движение.ДокПроведен 		= Ссылка.Проведен;
						//Движение.Активность 		= Ссылка.Проведен;
					КонецЕсли;
					//Движение.ДокПроведен 		= Проведен;
					Движение.Активность 		= Проведен;
					// ресурсы
					Движение.АгентОтправитель 	= СтрокаТЧ.АгентОТ;
					Движение.Агент 				= АгентКуда;	
					Движение.ПоложениеБСО		= ПоложениеБСО;
					Движение.СостояниеБСО		= СостояниеБСО;
					//Движение.Блокировка			= ?(СтруктураБСО.Существует, СтруктураБСО.Блокировка, Ложь);					
					Движение.НомерПолиса		= СокрЛП(Номер); // номер документа
					Движение.ГодПолиса			= СтруктураБСО.ГодПолиса;
					Движение.СтраховойПолис		= Ссылка;
					Движение.НаОснованииБумажногоДокумента = Истина;					
					Движение.ДатаВозврата 		= ?(СтруктураБСО.Существует, СтруктураБСО.ДатаВозврата, Неопределено);					
					Движение.КодОперации		= КодОперации;
					Движение.Заявка         	= СтруктураБСО.Заявка;
				КонецЕсли;				
			КонецЦикла; //НаборДвижений			
			Если _ЕстьОшибка Тогда
				Если ИнфоЗапись Тогда
					Отказ_Пустышка = Ложь;
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ_Пустышка, Заголовок);
					Если ОтключитьКонтрольНомеровБСО Тогда
						Сообщить("Эти ошибки не влияют на запись и проведение документа, поскольку установлен флаг 'Отключить контроль номеров БСО'!");
					Иначе	
						Сообщить("Эти ошибки будут критичны при проведении, но не влияют на запись документа!");
					КонецЕсли;
				Иначе
					ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.ВедетсяКоличественныйУчет = Истина Тогда			
			Если ИнфоЗапись Тогда
				Продолжить;	
			КонецЕсли;			
			//Ранее может быть осуществлена приемка оплаты по данному полису
			//В от момент уже списыался 1 бланк с того, от кого получены деньги
			//И тогда в РС "Движения БСО" будет запись для данного номера БСО (производное от номера полиса)
			//Поэтому, если найдем запись в РС Движения БСО , то списывать полис по остаткам не будем
			
			//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО, Подтверждено, ДокПроведен"
			//, актуалСК, ВидБСО, сНомБСО,Истина,Истина);
			//НаМомент = Новый Граница(СтрокаТЧ.ДатаДвижения, ВидГраницы.Исключая);
			//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(НаМомент, СтруктураОтбора);
			//Если тзРег.Количество() > 0 Тогда
			//	Если тзРег.Количество() > 1 Тогда
			//		тзРег.Сортировать("Период УБЫВ");
			//	КонецЕсли;
			//	актуалПоставщик = тзРег[0].Поставщик;
			//	актуалОргАгент  = тзРег[0].ОрганизацияАгент;
			//	АктуалЗаявка    = тзРег[0].Заявка; 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДБ.Поставщик,
			|	ДБ.ОрганизацияАгент,
			|	ДБ.Заявка
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО КАК ДБ
			|ГДЕ
			|	ДБ.ВидБСО = &ВидБСО
			|	И ДБ.НомерБСО = &НомерБСО
			|	И ДБ.Подтверждено
			|	И ДБ.Активность
			|	И ДБ.Поставщик = &Поставщик
			|	И ДБ.ОрганизацияАгент = &ОрганизацияАгент
			|	И ДБ.Регистратор ССЫЛКА Документ.уб_ПриемкаОплат
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДБ.Период УБЫВ";
			Запрос.УстановитьПараметр("ВидБСО",				ВидБСО);
			Запрос.УстановитьПараметр("НомерБСО",			сНомБСО);			
			Запрос.УстановитьПараметр("Поставщик",			Поставщик);
			Запрос.УстановитьПараметр("ОрганизацияАгент",	ОрганизацияАгент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				АктуалЗаявка = Выборка.Заявка;			
				Для Каждого ОтдельноеДвижение ИЗ НаборДвижений Цикл					
					//TODO перенести под условие ниже уб_СЛ.ОпределитьУчетНеВедется(СтрокаТЧ.ВидБСО, СтрокаТЧ.ТипУчетаБСО)
					Если ОтдельноеДвижение = "Аннулирование" Тогда
						Период 			= ?(СтрокаТЧ.ДатаДвижения < ДатаАннулирования, ДатаАннулирования, СтрокаТЧ.ДатаДвижения + 60);
						АгентКуда 		= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
						СостояниеБСО 	= пСстБСО.Испорчен;	
						ПоложениеБСО	= пПлжБСО.ВозвращенСТочки;
						КодОперации		= Перечисления.уб_КодыОперацийБСО.АннулированиеПолиса;
					Иначе // "Основное"
						Период 			= СтрокаТЧ.ДатаДвижения;
						АгентКуда 		= СтрокаТЧ.АгентКУДА;
						СостояниеБСО 	= пСстБСО.Оформлен;							
						Если СтрокаТЧ.НазначениеБСО = пНзнБСО.ДляКлиента Тогда
							ПоложениеБСО = пПлжБСО.ОтданКлиенту;
						ИначеЕсли СтрокаТЧ.НазначениеБСО = пНзнБСО.ДляБанка Тогда
							ПоложениеБСО = пПлжБСО.ОтданБанку;
						ИначеЕсли Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.ГоловнойОфис Тогда
							ПоложениеБСО = пПлжБСО.ВозвращенСТочки;
						Иначе
							ПоложениеБСО = пПлжБСО.ПереданНаТочку;
						КонецЕсли;
						КодОперации	= Перечисления.уб_КодыОперацийБСО.ОформлениеБСО;
					КонецЕсли;					
					Если уб_СЛ.ОпределитьУчетНеВедется(СтрокаТЧ.ВидБСО, СтрокаТЧ.ТипУчетаБСО)
						и СтрокаТЧ.Оформлен
						и СтрокаТЧ.НазначениеБСО = пНзнБСО.Остается
						Тогда 
						//ТекМОЛ = СоотвМОЛ.Получить(СтрокаТЧ.ВидБСО);
						Движение = Движения.уб_ДвиженияБСО.Добавить();
						// измерения
						Движение.Период			  = Период;
						Движение.СК				  = актуалСК;
						Движение.ВидБСО			  = СтрокаТЧ.ВидБСО;
						Движение.НомерБСО		  = уб_СЛ.ДайНомерБСОДляКоличУчета(Номер);
						Движение.Поставщик		  = актуалПоставщик;
						Движение.ОрганизацияАгент = актуалОргАгент;
						Движение.Подтверждено     = НЕ ИнфоЗапись;
						//Движение.ДокПроведен 	  = Ссылка.Проведен;
						//Движение.Активность 	  = Ссылка.Проведен;
						//Движение.ДокПроведен 	  = Проведен;
						Движение.Активность 	  = Проведен;
						// ресурсы
						Движение.АгентОтправитель = СтрокаТЧ.АгентОТ;
						Движение.Агент	= АгентКУДА;							
						Движение.ПоложениеБСО	= ПоложениеБСО;
						Движение.СостояниеБСО	= СостояниеБСО;
						//Движение.Блокировка		= Ложь;
						Движение.НомерПолиса	= СокрЛП(Номер); // номер документа
						Движение.ГодПолиса		= "";
						Движение.СтраховойПолис	= Ссылка;
						Движение.НаОснованииБумажногоДокумента = Истина;					
						Движение.ДатаВозврата	= Неопределено;					
						Движение.КодОперации	= КодОперации;
						Движение.Заявка         = АктуалЗаявка;
					КонецЕсли;
				КонецЦикла; //НаборДвижений				
				Продолжить;
			КонецЕсли;
			актуалПоставщик = Поставщик;
			актуалОргАгент	= ОрганизацияАгент;
			СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
			СтруктураБСО.Период = Новый Граница(СтрокаТЧ.ДатаДвижения, ВидГраницы.Исключая);
			//!!!TO DO!!!
			//СтруктураБСО.Поставщик 	= актуалПоставщик;
			СтруктураБСО.Поставщик 	= Поставщик;
			//СтруктураБСО.ОрганизацияАгент 	= актуалОргАгент;
			СтруктураБСО.ОрганизацияАгент 	= ОрганизацияАгент;
			СтруктураБСО.СК 		= актуалСК;
			СтруктураБСО.ВидБСО 	= ВидБСО;
			СтруктураБСО.Агент		= СтрокаТЧ.АгентОТ;
			тзОстатки = уб_СЛ.ПолучитьОстаткиБСО(СтруктураБСО);			
			НадоКолБСО = СтрокаТЧ.КоличествоБСО;
			ОстКолБСО = НадоКолБСО;
			Для Каждого СтрокаТЗ из тзОстатки Цикл
				Если СтрокаТЗ.Количество >= ОстКолБСО Тогда
					ЕстьКолБСО = ОстКолБСО;
				ИначеЕсли СтрокаТЗ.Количество > 0 Тогда
					ЕстьКолБСО = СтрокаТЗ.Количество;
				Иначе
					ЕстьКолБСО = 0;
				КонецЕсли;
				Если ЕстьКолБСО > 0 Тогда
					СтрокаТЧ.УчавствуетВдвижениях = Истина;
					Движение				= Движения.уб_ОстаткиБСО.Добавить();					
					Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
					Движение.Период			= СтрокаТЧ.ДатаДвижения;
					// измерения
					//!!!TO DO!!!
					//Движение.Поставщик		= актуалПоставщик;
					Движение.Поставщик		= Поставщик;
					//Движение.ОрганизацияАгент 	= актуалОргАгент;
					Движение.ОрганизацияАгент 	= ОрганизацияАгент;
					актуалПоставщик = Поставщик;
					актуалОргАгент 	= ОрганизацияАгент;
					Движение.СК				= актуалСК;
					Движение.ВидБСО			= СтрокаТЗ.ВидБСО;
					Движение.Агент			= СтрокаТЧ.АгентОТ;	
					// ресурсы
					Движение.Количество		= ЕстьКолБСО;
					// реквизиты
					Движение.КодОперации	= Перечисления.уб_КодыОперацийБСО.ОформлениеБСО;					
					//TODO Заявка Добавить движение
					Движения.уб_ОстаткиБСО.Записать();					
					ОстКолБСО = ОстКолБСО - ЕстьКолБСО;
				КонецЕсли;
				Если ОстКолБСО = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПараметрыСеанса.уб_Константы.уб_КонтролироватьОстаткиБСО И ОстКолБСО > 0 Тогда
				НаКом = ?(Не ЗначениеЗаполнено(СтруктураБСО.Агент), "", " у Агента '" + СтруктураБСО.Агент + "'");				
				// ошибка, нет остатка
				СтрокаСообщения = sГде + " Нет необходимого количества (" + Строка(НадоКолБСО)+" шт.) " + s3 + "'" + Строка(ВидБСО) + "'" 
				+ " (поставщик: '" + актуалПоставщик + "', ОргАгент: '" + актуалОргАгент + "', СК: '" + актуалСК + "') "
				+ НаКом 
				+ ". Наличие: " + Строка(тзОстатки.Итог("Количество")) + " шт.";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		//ИначеЕсли уб_СЛ.ОпределитьУчетНеВедется(ВидБСО,СтрокаТЧ.ТипУчетаБСО) Тогда
			//Ничего не делаем... пока.... 				
		КонецЕсли;		
	КонецЦикла;	
	//--------------------------------
	// Выполним движения для Количественных БСО и БСО у которых учет не велся, 
	// но только для тех, которые были оформлены и остались на точке	
	//--------------------------------	
	Попытка
		//чкн
		ТЗОшибок = Новый ТаблицаЗначений;
		ТЗОшибок.Колонки.Добавить("Ошибка");
		ТЗОшибок.Колонки.Добавить("Строка");
		ТЗОшибок.Колонки.Добавить("Элемент");
		ПроверкаУникальностиЗаписейРегистра(Движения.уб_ДвиженияБСО, Отказ, ТЗОшибок);
		Если ТЗОшибок.Количество() <> 0 Тогда
			//Форма = ЭтотОбъект.ПолучитьФорму();
			Форма = Ссылка.ПолучитьФорму();
			Если Форма.Открыта() Тогда
				ОткрытьСообщениеОбОшибках(ТзОшибок, Форма);
			Иначе
				Для Каждого Строка Из ТЗОшибок Цикл
					Сообщить(Строка.Ошибка);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Движения.уб_ДвиженияБСО.Записать();
		//чкн
	Исключение
		Отказ = Истина;
		СОО = ОписаниеОшибки();
		Сообщить(СОО);	
		Если Найти(СОО, "Запись с такими ключевыми полями существует!") > 0 Тогда
			ДатаДвиженияБСО = ДатаДвиженияБСО + 60; 
			Сообщить("Эта ошибка возникает, когда дата документа совпадает с датой другого документа, производящего движение БСО." + Символы.ВК + Символы.ПС + "Дата этого документа автоматически увеличена на 1 мин. Попробуйте еще раз.");
		КонецЕсли;
	КонецПопытки;	
	Движения.уб_ОстаткиБСО.Записать();		
	Если ОтключитьКонтрольНомераПолиса Тогда
		ДвижениеНомераПолиса("ТолькоПроверитьНомерИОчиститьДвижения", Отказ);
		Возврат ТаблицаБСО;
	КонецЕсли;		
	Если ПометкаУдаления Тогда
		ДвижениеНомераПолиса("ТолькоОчиститьДвижения", Отказ);
		Возврат ТаблицаБСО;
	КонецЕсли;	
	Если Проведен Тогда  //Отказ
		ДвижениеНомераПолиса("Оформить", Отказ);
	Иначе
		Если РезервироватьНомерПолиса Тогда
			ДвижениеНомераПолиса("Зарезервировать", Отказ);
		иначе
			ДвижениеНомераПолиса("ТолькоОчиститьДвижения", Отказ);
		КонецЕсли;
	КонецЕсли;	
	Возврат ТаблицаБСО;
	
КонецФункции

// Функция возвращает количество документов привязанных полису
Функция ПолучитьКоличествоФайловКПолису(ДокументПроверки = Неопределено) Экспорт
	
	Если ДокументПроверки = Неопределено Тогда
		ДокументПроверки = Ссылка;
	КонецЕсли;	
	//======================Список файлов======================
	ЗапросФайлы = Новый Запрос(
	"ВЫБРАТЬ
	|	ФОТО.КоличествоФОТО,
	|	БСОДОК.КоличествоБСОДОК,
	|	ДСП.КоличествоДСП
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.ФайлИмя) КАК КоличествоФОТО
	|	ИЗ
	|		РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|	ГДЕ
	|		уб_ФайлыКПолисам.ВидФайлаB2B = &ВидФайлаB2BФОТО
	|		И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис) КАК ФОТО,
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.ФайлИмя) КАК КоличествоБСОДОК
	|	ИЗ
	|		РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|	ГДЕ
	|		(уб_ФайлыКПолисам.ВидФайлаB2B = &ВидФайлаB2BБСОДОК
	|				ИЛИ уб_ФайлыКПолисам.ВидФайлаB2B = &ВидФайлаB2BПРОЧЕЕ)
	|		И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис) КАК БСОДОК,
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_ФайлыКПолисам.ФайлИмя) КАК КоличествоДСП
	|	ИЗ
	|		РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	|	ГДЕ
	|		уб_ФайлыКПолисам.ВидФайлаB2B = &ВидФайлаB2BДСП
	|		И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис) КАК ДСП
	|ГДЕ
	|	(БСОДОК.КоличествоБСОДОК <> 0
	|			ИЛИ ФОТО.КоличествоФОТО <> 0
	|			ИЛИ ДСП.КоличествоДСП <> 0)");
	ЗапросФайлы.УстановитьПараметр("ВидФайлаB2BФОТО", 	Перечисления.уб_ВидыФайловB2B.ФОТО);
	ЗапросФайлы.УстановитьПараметр("ВидФайлаB2BБСОДОК", Перечисления.уб_ВидыФайловB2B.БСО_ДОК);
	ЗапросФайлы.УстановитьПараметр("ВидФайлаB2BДСП", 	Перечисления.уб_ВидыФайловB2B.ДСП);
	ЗапросФайлы.УстановитьПараметр("ВидФайлаB2BПРОЧЕЕ", Перечисления.уб_ВидыФайловB2B.ПРОЧЕЕ);
	ЗапросФайлы.УстановитьПараметр("СтраховойПолис", 	ДокументПроверки.Ссылка);	
	//чкн
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА Тогда 
		ЗапросФайлы.Текст = ЗапросПолучитьКоличествоФайловКПолису();
	КонецЕсли;
	//чкн
	РезультатФайлы = ЗапросФайлы.Выполнить().Выгрузить();
	РезультатСтрока = "";
	Если РезультатФайлы.Количество() > 0 Тогда
		РезультатСтрока = Строка(РезультатФайлы[0].КоличествоФОТО) + "/" + Строка(РезультатФайлы[0].КоличествоБСОДОК) + "/" + Строка(РезультатФайлы[0].КоличествоДСП);
	КонецЕсли;
	Возврат РезультатСтрока;
	
КонецФункции

//чкн
Функция ЗапросПолучитьКоличествоФайловКПолису()
	Текст = "ВЫБРАТЬ
	        |	ФОТО.КоличествоФОТО,
	        |	БСОДОК.КоличествоБСОДОК,
	        |	ДСП.КоличествоДСП
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлИмя) КАК КоличествоФОТО
	        |	ИЗ
	        |		Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |	ГДЕ
	        |		уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B = &ВидФайлаB2BФОТО
	        |		И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис) КАК ФОТО,
	        |	(ВЫБРАТЬ
	        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлИмя) КАК КоличествоБСОДОК
	        |	ИЗ
	        |		Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |	ГДЕ
	        |		(уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B = &ВидФайлаB2BБСОДОК
	        |				ИЛИ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B = &ВидФайлаB2BПРОЧЕЕ)
	        |		И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис) КАК БСОДОК,
	        |	(ВЫБРАТЬ
	        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ФайлИмя) КАК КоличествоДСП
	        |	ИЗ
	        |		Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
	        |	ГДЕ
	        |		уб_СтраховойПолисСписокФайлов.СсылкаСправочника.ВидФайлаB2B = &ВидФайлаB2BДСП
	        |		И уб_СтраховойПолисСписокФайлов.Ссылка = &СтраховойПолис) КАК ДСП
	        |ГДЕ
	        |	(БСОДОК.КоличествоБСОДОК <> 0
	        |			ИЛИ ФОТО.КоличествоФОТО <> 0
	        |			ИЛИ ДСП.КоличествоДСП <> 0)";
	
	Возврат Текст;
КонецФункции
//чкн
 
 // Функция возвращает флаг наличия ошибки в предоставденных документах
 Функция ПолучитьФлагОшибкиВПредоставленныхДокументах(ДокументПроверки = Неопределено) Экспорт
	 
	Если ДокументПроверки = Неопределено Тогда
		ДокументПроверки = Ссылка;
	КонецЕсли;	
	ЗапросДокументы = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ПредоставленныеДокументыСП.Объект,
	|	NULL КАК УИД,
	|	NULL КАК Приоритет,
	|	NULL КАК КритическаяДата,
	|	NULL КАК ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.уб_ПредоставленныеДокументыСП КАК уб_ПредоставленныеДокументыСП
	|ГДЕ
	|	уб_ПредоставленныеДокументыСП.Объект = &Объект
	|	И уб_ПредоставленныеДокументыСП.Используется
	|	И НЕ уб_ПредоставленныеДокументыСП.Предоставлен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уб_ОшибкиСрезПоследних.Объект,
	|	уб_ОшибкиСрезПоследних.УИД,
	|	уб_ОшибкиСрезПоследних.Приоритет,
	|	уб_ОшибкиСрезПоследних.КритическаяДата,
	|	уб_ОшибкиСрезПоследних.ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.уб_Ошибки.СрезПоследних КАК уб_ОшибкиСрезПоследних
	|ГДЕ
	|	уб_ОшибкиСрезПоследних.Объект = &Объект
	|	И уб_ОшибкиСрезПоследних.Статус.Родитель = &СтатусНеРешено");
	ЗапросДокументы.УстановитьПараметр("Объект", 			ДокументПроверки.Ссылка);
	ЗапросДокументы.УстановитьПараметр("СтатусНеРешено", 	Справочники.уб_СостоянияОшибок.НеРешено);
	ФлОшибка = Ложь;
	//РезультатДокументы = ЗапросДокументы.Выполнить().Выгрузить();
	//Если РезультатДокументы.Количество() > 0 Тогда
	Результат = ЗапросДокументы.Выполнить();
	Если Не Результат.Пустой() Тогда
		ФлОшибка = Истина;
	КонецЕсли;
	Возврат ФлОшибка;
	
КонецФункции 	 
	 



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПЕЧАТИ ДОКУМЕНТА

Функция ПолучитьТС(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС.РегистрационныйЗнак,
	|	ТС.ИдентификационныйНомер,
	|	ТС.МаркаТС,
	|	ТС.МодельТС,
	|	ТС.ТипТС,
	|	ТС.Категория,
	|	ТС.ГодВыпуска,
	|	ТС.ДвигательНомер,
	|	ТС.ШассиНомер,
	|	ТС.КузовНомер,
	|	ТС.Цвет,
	|	ТС.МощностьДвигателя,
	|	ТС.МаксМасса,
	|	ТС.КолПассажирскихМест,
	|	ТС.Грузоподъемность,
	|	ТС.ПротивоугоннаяСистема,
	|	ТС.ПаспортСерия,
	|	ТС.ПаспортНомер,
	|	ТС.ПаспортДатаВыдачи
	|ИЗ
	|	РегистрСведений.уб_ТранспортныеСредства КАК ТС
	|ГДЕ
	|	ТС.Объект = &Объект";	
	Запрос.УстановитьПараметр("Объект", Объект);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	

КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	ТабПФ = уб_ПФ.ПустаяТЗСтруктурыПФ();
	//Если ЭтоНовый() Или (Не СтраховойПродукт.Пустая() И СтраховойПродукт.Вид = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО) Тогда
	//	СтрТабПФ = ТабПФ.Добавить();
	//	СтрТабПФ.КодПФ 			= "ОсагоПустое";
	//	СтрТабПФ.Наименование   = "ОСАГО внесенные значения";
	//	СтрТабПФ = ТабПФ.Добавить();
	//	СтрТабПФ.КодПФ 			= "ОсагоЗаполненное";
	//	СтрТабПФ.Наименование   = "ОСАГО полный бланк";
	//КонецЕсли;
	//СтрТабПФ = ТабПФ.Добавить();
	//СтрТабПФ.КодПФ 			= "ПечатьДокумента";
	//СтрТабПФ.Наименование   = "Печатать бланк документа";
	Возврат ТабПФ;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

///////////////////////////////////////////////////////////////////////////////
Функция ОП_ПолучитьВыборкуОплат() Экспорт
	
	//При использовании данной функции следует учитывать что попадают помеченные на удаление
	Возврат Документы.уб_ОплатаПолисов.Выбрать(,,Новый Структура("СтраховойПолис",Ссылка),"Дата Возр");
	
КонецФункции

Функция ОП_ПолучитьТЗОплат() Экспорт
	
	//возвращает таблицу - список оплат, отсортированных по дате платежа
	Запрос = Новый Запрос;
	Если НЕ Ссылка.Пустая() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	О.*
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК О
		|ГДЕ
		|	О.СтраховойПолис = &СтраховойПолис
		|    И НЕ О.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		Запрос.УстановитьПараметр("СтраховойПолис", Ссылка);
		ТЗОплат = Запрос.Выполнить().Выгрузить();
	Иначе
		ТЗОплат = Новый ТаблицаЗначений();
	КонецЕсли;
	
	Возврат ТЗОплат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
Функция ДайСКогоУходитБСО() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Агент) Тогда
		#Если ТолстыйКлиент ИЛИ Сервер Тогда
			рез = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
		#КонецЕсли
	Иначе
		рез = Агент;
	КонецЕсли;
	Возврат рез;
	
КонецФункции

Функция ДайАгентаОТДляКоличественногоБСО(СтрокаТЧ) Экспорт
	
	//С кого списывается Количественное БСО: 
	// - в случае отсутствия ограничений по агенту: берем то, что указано в поле Агент ТЧ БСО 
	// - в случае ограничений по агенту: значение переменной СКогоУходитБСО
	_Агент = СтрокаТЧ.Агент;
	Если Не ЗначениеЗаполнено(_Агент) Тогда
		_Агент = ?(Не ЗначениеЗаполнено(Курьер), Агент, Курьер);	
	КонецЕсли;
	Возврат _Агент;
	
КонецФункции

Функция ДайНомерБСОСтраховогоПолиса() Экспорт
	
	ТекНомерБСО = "";
	ОпределитьТекВидБСО(ТекНомерБСО);
	Возврат ТекНомерБСО;
	
КонецФункции

Функция ОпределитьТекВидБСО(ТекНомерБСО = "") Экспорт
	
	Результат = Новый Структура;
	Если ТипЗнч(СтраховойПродукт) = ТИп("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Если ПустаяСтрока(Номер) и БСо.Количество() >0 Тогда
			Номер = БСО[0].НомерБСО;
		КонецЕсли;	
		Результат.Вставить("ВидБСО", 								СтраховойПродукт);
		Результат.Вставить("ВидБСОСтрока",							Строка(СтраховойПродукт));
		Результат.Вставить("ТипУчетаБСО",   						Перечисления.уб_ТипыУчетаБСО.НомернойПолисВручную);
		Результат.Вставить("НомерБСО",								СтрЗаменить(Номер,"'",""));
		Результат.Вставить("КоличественныйУчет",    				Ложь);
		Результат.Вставить("НомернойУчет",							Истина);
		Результат.Вставить("НомерПолисаЗаполняетсяВручную",         ЛОЖЬ);
		Результат.Вставить("ИспользуютсяСвободныеНомераПолисов",	ЛОЖЬ);
		Результат.Вставить("УниверсальноеБСО",						Ложь);
	Иначе	
		Результат.Вставить("ВидБСО", 								Справочники.уб_ВидыБСО.ПустаяСсылка());
		Результат.Вставить("ВидБСОСтрока",							"");
		Результат.Вставить("ТипУчетаБСО",   						Перечисления.уб_ТипыУчетаБСО.ПустаяСсылка());
		Результат.Вставить("НомерБСО",								"");
		Результат.Вставить("КоличественныйУчет",    				Ложь);
		Результат.Вставить("НомернойУчет",							Ложь);
		Результат.Вставить("НомерПолисаЗаполняетсяВручную",         Ложь);
		Результат.Вставить("ИспользуютсяСвободныеНомераПолисов",	Ложь);
		Результат.Вставить("УниверсальноеБСО",						Ложь);
		ТекВидБСО = Справочники.уб_ВидыБСО.ПустаяСсылка();
		ТекНомерБСО = "";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВБ.Ссылка КАК ВидБСО,
		|	ПРЕДСТАВЛЕНИЕ(ВБ.Ссылка) КАК ВидБСОСтрока,
		|	ВБ.Тип КАК Тип,
		|	ВБ.ТипУчетаБСО КАК ТипУчетаБСО,
		|	ВЫБОР
		|		КОГДА ВБ.ТипУчетаБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КоличественныйУчет,
		|	ВЫБОР
		|		КОГДА ВБ.ТипУчетаБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойЕстьПолис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисСоответствуетНомеруБСО), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НомернойУчет,
		|	ВЫБОР
		|		КОГДА ВБ.ТипУчетаБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НомерПолисаЗаполняетсяВручную,
		|	ВЫБОР
		|		КОГДА ВБ.ТипУчетаБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуютсяСвободныеНомераПолисов,
		|	ВБ.УниверсальноеБСО КАК УниверсальноеБСО
		|ИЗ
		|	Справочник.уб_ВидыБСО КАК ВБ
		|ГДЕ
		|	ВБ.Ссылка В(&Массив)
		|	И ВБ.ТипУчетаБСО В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойЕстьПолис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисСоответствуетНомеруБСО), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.НомернойПолисВручную), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.КоличественныйПолисВручную), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисИзСвободных), ЗНАЧЕНИЕ(Перечисление.уб_ТипыУчетаБСО.УчетНеВедетсяПолисВручную))
		|	И ВБ.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОСАГО))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомернойУчет УБЫВ";
		Запрос.УстановитьПараметр("Массив", БСО.ВыгрузитьКолонку("ВидБСО"));
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;	
	КонецЕсли;
Если Результат.НомернойУчет Тогда
		СтрокаТЧ = БСО.Найти(Результат.ВидБСО, "ВидБСО");
		Если СтрокаТЧ <> Неопределено Тогда
			ТекНомерБСО = СтрокаТЧ.НомерБСО;
			Результат.НомерБСО = ТекНомерБСО;
		КонецЕсли;
	КонецЕсли;
	//Запрос.УстановитьПараметр("Массив", БСО.ВыгрузитьКолонку("ВидБСО"));
	//Выборка = Запрос.Выполнить().Выбрать();
	//Отбор = Новый Структура("ВидБСО");
	//Для Каждого СтрокаТЧ Из БСО Цикл
	//	Выборка.Сбросить();
	//	Отбор.ВидБСО = СтрокаТЧ.ВидБСО;
	//	Выборка.НайтиСледующий(Отбор);
	//	Если уб_СЛ.ЕстьНомерПолиса(СтрокаТЧ.ВидБСО, Выборка.ТипУчетаБСО) Тогда
	//		ТекВидБСО = СтрокаТЧ.ВидБСО;
	//		Результат.ВидБСО = ТекВидБСО;
	//		Результат.ТипУчетаБСО = Выборка.ТипУчетаБСО;
	//		Результат.Тип = Выборка.Тип;
	//		Результат.КоличественныйУчет = уб_СЛ.ОпределитьВедетсяКоличественныйУчет(ТекВидБСО,Выборка.ТипУчетаБСО);
	//		Результат.ИспользуютсяСвободныеНомераПолисов = уб_СЛ.ОпределитьИспользуютсяСвободныеНомераПолисов(ТекВидБСО, Выборка.ТипУчетаБСО);
	//		Результат.НомерПолисаЗаполняетсяВручную = уб_СЛ.НомерПолисаЗаполняетсяВручную(ТекВидБСО, Выборка.ТипУчетаБСО);
	//		Результат.НомернойУчет = уб_СЛ.ОпределитьВедетсяНомернойУчет(ТекВидБСО, Выборка.ТипУчетаБСО);
	//		Если Результат.НомернойУчет Тогда
	//			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерБСО) Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			Если НЕ уб_СЛ.ОпределитьЭтоПолис(ТекВидБСО, Выборка.Тип) Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			ТекНомерБСО = СтрокаТЧ.НомерБСО;
	//			Результат.НомерБСО = ТекНомерБСО;
	//		КонецЕсли;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ОпределитьТекВидБСО_Старая(ТекНомерБСО = "") Экспорт
	
	ТекВидБСО = Справочники.уб_ВидыБСО.ПустаяСсылка();
	ТекНомерБСО = "";
	Для Каждого СтрокаТЧ из БСО Цикл
		Если уб_СЛ.ЕстьНомерПолиса(СтрокаТЧ.ВидБСО) Тогда
			ТекВидБСО = СтрокаТЧ.ВидБСО;
			Если уб_СЛ.ОпределитьВедетсяНомернойУчет(ТекВидБСО) Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерБСО) Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ уб_СЛ.ОпределитьЭтоПолис(ТекВидБСО) Тогда
					Продолжить;
				КонецЕсли;
				ТекНомерБСО = СтрокаТЧ.НомерБСО;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ТекВидБСО;
	
КонецФункции

Функция МожноИспользоватьНомер(Знач НомерПолиса, Сообщение = "")
	
	Если уб_СЛ.ПолисАннулирован(СостояниеПолиса) Тогда
		Возврат Истина;
	КонецЕсли;	
	НомерПолиса = уб_СЛ.ДайНомерПолисаБезПометкиАннулирования(НомерПолиса); 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СН.Регистратор,
	|	СН.КодОперации,
	|	СН.НомерИспользован,
	|	СН.НомерЗаблокирован,
	|	СН.НомерЗарезервирован
	|ИЗ
	|	РегистрСведений.уб_СвободныеНомераПолисов КАК СН
	|ГДЕ
	|	СН.Регистратор <> &Ссылка
	|	И СН.НомерПолиса = &НомерПолиса
	|	И СН.СК = &СК
	|	И СН.КодОперации В(&СписокОпераций)
	|	И НЕ СН.Регистратор.СостояниеПолиса В (&Аннулированные)";
	СписокОпераций = Новый Массив;
	СписокОпераций.Добавить(Перечисления.уб_КодыОперацийНомеровПолисов.ОформлениеПолиса);
	СписокОпераций.Добавить(Перечисления.уб_КодыОперацийНомеровПолисов.БлокировкаНомера);
	СписокОпераций.Добавить(Перечисления.уб_КодыОперацийНомеровПолисов.РезервированиеНомера);
	//при аннулировании есть возможность использовать номер повторно - исключаем из запроса
	Аннулированные = Новый СписокЗначений;
	Аннулированные.Добавить(Перечисления.уб_СостоянияПолиса.АннулированВыписанНовый);
	Аннулированные.Добавить(Перечисления.уб_СостоянияПолиса.АннулированЗаменаБланка);
	Аннулированные.Добавить(Перечисления.уб_СостоянияПолиса.АннулированПолностью);
	Запрос.УстановитьПараметр("Аннулированные",	Аннулированные);
	Запрос.УстановитьПараметр("СписокОпераций", СписокОпераций);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("НомерПолиса", 	НомерПолиса);
	Запрос.УстановитьПараметр("СК", 			СК);	
	Результат = Запрос.Выполнить();
	Рез = Истина;
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.ОформлениеПолиса Тогда
				Сообщение = "Номер полиса `" + НомерПолиса + "` уже был использован документом: " + Строка(Выборка.Регистратор) + ", необходимо выбрать другой номер!";
				Рез = Ложь;
				Прервать;
			ИначеЕсли Выборка.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.БлокировкаНомера Тогда
				Сообщение = "Номер полиса `" + НомерПолиса + "` был заблокирован документом: " + Строка(Выборка.Регистратор) + ", необходимо выбрать другой номер!";
				Рез = Ложь;
				Прервать;
			ИначеЕсли Выборка.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.РезервированиеНомера Тогда
				Сообщение = "Номер полиса `" + НомерПолиса + "` уже был зарезервирован документом: " + Строка(Выборка.Регистратор) + ", необходимо выбрать другой номер!";
				Рез = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Возврат Рез;

КонецФункции

//НИ
Функция КвитанцияСуществуетДляСК(НомерКвитанции)
	
	//ВидБСОТипаКвА7 = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СК);
	Структура = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СК);
	ВидБСОТипаКвА7 = Структура.ВидБСО;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДБ.ВидБСО
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&Период,
	|			ВидБСО = &ВидБСО
	|				И НомерБСО = &НомерБСО
	|				И Подтверждено) КАК ДБ";
	Запрос.УстановитьПараметр("ВидБСО", 	ВидБСОТипаКвА7);
	Запрос.УстановитьПараметр("НомерБСО", 	НомерКвитанции);
	Запрос.УстановитьПараметр("Период", 	ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ДвижениеНомераПолиса(ВидДвижения, Отказ) Экспорт
	
	СтруктураВидБСО = ОпределитьТекВидБСО();
	ТекВидБСО = СтруктураВидБСО.ВидБСО;
	ИспользуютсяСвободныеНомера = СтруктураВидБСО.ИспользуютсяСвободныеНомераПолисов;
	Если НЕ ИспользуютсяСвободныеНомера = Истина ИЛИ "ТолькоОчиститьДвижения" = ВидДвижения 
	//Если НЕ уб_СЛ.ОпределитьИспользуютсяСвободныеНомераПолисов(ТекВидБСО, СтруктураВидБСО.ТипУчетаБСО) ИЛИ "ТолькоОчиститьДвижения" = ВидДвижения 
		ИЛИ уб_СЛ.ПолисАннулирован(СостояниеПолиса)
		Тогда
		Движения.уб_СвободныеНомераПолисов.Очистить();
		Движения.уб_СвободныеНомераПолисов.Записать();
		#Если Клиент Тогда
		Оповестить("ДвиженияСвободныхНомеровПолисов",Ссылка);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	сНомер = СокрЛП(Номер);
	СтруктураНомеров = уб_СтраховойБрокер.ПолучитьСтруктуруНомеровПолисов();
	СтруктураНомеров.Период 		= Новый Граница(ДатаДвиженияБСО, ВидГраницы.Исключая);
	СтруктураНомеров.СК 			= СК;
	СтруктураНомеров.НомерПолиса	= сНомер;
	уб_СтраховойБрокер.ПрочитатьСостояниеНомераПолиса(СтруктураНомеров);
	СообщениеОшибки = СообщениеОшибкиСвободногоНомераПолиса(СтруктураНомеров, СтруктураВидБСО);	
	ДолженБытьОтказ = Не ПустаяСтрока(СообщениеОшибки);
	Если ДолженБытьОтказ Тогда
		Сообщить(СообщениеОшибки)
	КонецЕсли;
	Если "ТолькоПроверитьНомерИОчиститьДвижения" = ВидДвижения Тогда
		Движения.уб_СвободныеНомераПолисов.Очистить();
		Движения.уб_СвободныеНомераПолисов.Записать();
		#Если Клиент Тогда
		Оповестить("ДвиженияСвободныхНомеровПолисов",Ссылка);
		Если ДолженБытьОтказ Тогда
			Сообщить("Эта ошибка не влияет на запись и проведение документа, поскольку установлен флаг 'Ручной ввод номера полиса'!");
		КонецЕсли;
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	//--------------------------
	Если ДолженБытьОтказ Тогда
		Сообщить("Нет возможности " + ВидДвижения + " полис!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//--------------------------		
	Движения.уб_СвободныеНомераПолисов.Очистить();
	Движения.уб_СвободныеНомераПолисов.Записать();	
	Движение = Движения.уб_СвободныеНомераПолисов.Добавить();	
	Движение.Период 			= ДатаДвиженияБСО;
	Движение.СК					= СК;
	Движение.Поставщик			= СтруктураНомеров.Поставщик;
	Движение.ОрганизацияАгент	= ОрганизацияАгент;
	Движение.НомерПолиса		= сНомер;
	//НЕ записываем вид нумерации в регистр
	//часто требуется изменять виды нумерации в поступлении, и во избежание перепроведения движений номеров полисов
	//с измененной нумерацией, будем считать, что вид нумерации будет определяться только поступлением и получать данные
	//нумерации из регистра срезом первых только для нумераций
	//Движение.ВидНумерации		= СтруктураНомеров.ВидНумерации;
	Движение.ГодПолиса			= СтруктураНомеров.ГодПолиса;
	Движение.НомерИспользован	= СтруктураНомеров.НомерИспользован;   
	Движение.НомерЗаблокирован	= СтруктураНомеров.НомерЗаблокирован;
	Движение.НомерЗарезервирован= СтруктураНомеров.НомерЗарезервирован;
	Движение.НомерВыданАгенту		= СтруктураНомеров.НомерВыданАгенту;	
	Если ВидДвижения = "Оформить" Тогда
		Движение.НомерИспользован	= Истина;
		Движение.НомерЗарезервирован	= Ложь;
		Движение.КодОперации		= Перечисления.уб_КодыОперацийНомеровПолисов.ОформлениеПолиса;
	ИначеЕсли ВидДвижения = "Зарезервировать" Тогда
		Движение.НомерИспользован	= Ложь;
		Движение.НомерЗарезервирован	= Истина;
		Движение.КодОперации			= Перечисления.уб_КодыОперацийНомеровПолисов.РезервированиеНомера;
	КонецЕсли;	
	Движения.уб_СвободныеНомераПолисов.Записать();
	#Если Клиент Тогда
	Оповестить("ДвиженияСвободныхНомеровПолисов", Ссылка);
	#КонецЕсли

КонецПроцедуры

Функция СообщениеОшибкиСвободногоНомераПолиса(СтруктураНомеров = Неопределено, СтруктураВидБСО = Неопределено) Экспорт

	Если СтруктураВидБСО = Неопределено Тогда
		СтруктураВидБСО = ОпределитьТекВидБСО();		
	КонецЕсли;
	ТекВидБСО = СтруктураВидБСО.ВидБСО;
	ИспользуютсяСвободныеНомера = СтруктураВидБСО.ИспользуютсяСвободныеНомераПолисов;
	//Если Не (уб_СЛ.ОпределитьИспользуютсяСвободныеНомераПолисов(ТекВидБСО, СтруктураВидБСО.ТипУчетаБСО) Или ЭтоСвободныйНомер) Тогда
	Если Не (ИспользуютсяСвободныеНомера = Истина Или ЭтоСвободныйНомер) Тогда
		Возврат ""
	КонецЕсли;
	сНомер = уб_СЛ.ДайНомерПолисаБезПометкиАннулирования(Номер);;
	Если СтруктураНомеров = Неопределено Тогда
		СтруктураНомеров = уб_СтраховойБрокер.ПолучитьСтруктуруНомеровПолисов();
		СтруктураНомеров.Период 		= Новый Граница(ДатаДвиженияБСО, ВидГраницы.Исключая);
		СтруктураНомеров.СК 			= СК;
		СтруктураНомеров.НомерПолиса	= сНомер;
		уб_СтраховойБрокер.ПрочитатьСостояниеНомераПолиса(СтруктураНомеров);
	КонецЕсли;
	Сообщение = "";
	Если Не СтруктураНомеров.Существует Тогда
		Сообщение = "Указанный свободный номер полиса """ + сНомер + """ не существует!";
	ИначеЕсли Не МожноИспользоватьНомер(сНомер, Сообщение) Тогда
		// Если сообщение не получено - номер существует, проверим правильность выбора нумерации
	ИначеЕсли НЕ ЗначениеЗаполнено(СтруктураНомеров.ВидНумерации) Тогда
		Сообщение = "Номер полиса имеет пустой вид нумерации!";
	ИначеЕсли СтруктураНомеров.ВидНумерации.ВидыБСО.Найти(ТекВидБСО, "ВидБСО") = Неопределено Тогда
		Сообщение = "Нумерация полисов (" + СтруктураНомеров.ВидНумерации + ") не соответствует Виду БСО. Необходимо выбрать другой номер полиса!";
	ИначеЕсли ЕстьКредитныйДоговор И Не СтруктураНомеров.ВидНумерации.ДляКредитныхПолисов Тогда
		Сообщение = "Номер полиса """ + сНомер + """ не соответствует типу договора. Номер не предназначен для кредитных полисов!";
	ИначеЕсли Не ЕстьКредитныйДоговор И НЕ СтруктураНомеров.ВидНумерации.ДляОбычныхПолисов Тогда
		Сообщение = "Номер полиса """ + сНомер + """ не соответствует типу договора. Номер не предназначен для НЕ кредитных полисов!";
	ИначеЕсли РассрочкаПлатежа И Не СтруктураНомеров.ВидНумерации.СРассрочкой Тогда
		Сообщение = "Номер полиса """ + сНомер + """ не соответствует типу договора. Номер не предназначен для договоров с рассрочкой платежа!";
	ИначеЕсли Не РассрочкаПлатежа И Не СтруктураНомеров.ВидНумерации.БезРассрочки Тогда
		Сообщение = "Номер полиса """ + сНомер + """ не соответствует типу договора. Номер не предназначен для договоров без рассрочки платежа!";
	КонецЕсли;
	Возврат Сообщение;

КонецФункции // ывпаывп()

//Ч
Функция ПолучитьСписокДоступныхРисков(фСтраховойПродукт, фОбъектСтрахования) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Если НЕ ЗначениеЗаполнено(фСтраховойПродукт) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	Если  ЗначениеЗаполнено(фОбъектСтрахования) Тогда
		Для Каждого СтрокаТЧ из фСтраховойПродукт.ТипыОбъектовИРиски Цикл
			Если СтрокаТЧ.ТипОбъекта = фОбъектСтрахования.Тип Тогда
				СписокВыбора.Добавить(СтрокаТЧ.Риск);
			КонецЕсли;
		КонецЦикла;
	Иначе
		//если объект не указан - берем все риски
		Для Каждого СтрокаТЧ из фСтраховойПродукт.ТипыОбъектовИРиски Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТЧ.Риск)=Неопределено Тогда
				СписокВыбора.Добавить(СтрокаТЧ.Риск);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВыбора;
КонецФункции

//Ч
Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);
	Для Каждого СтрокаТЧ из БСО Цикл
    	СОО = "Закладка БСО, строка № """+ СокрЛП(СтрокаТЧ.НомерСтроки) + ": ";
		Если СтрокаТЧ.Оформлен Тогда			
			//Если СтраховойПродукт.ВидыБСО.Найти(СтрокаТЧ.ВидБСО,"ВидБСО") = Неопределено Тогда
				//Если СтрокаТЧ.ВидБСО.УниверсальноеБСО Тогда
				//	Если НЕ уб_СЛ.ЭтоУниверсальноеБСОДляВидаСтраховогоПродукта(СтрокаТЧ.ВидБСО,СтраховойПродукт.Вид) Тогда
				//		СОО = СОО + "Выбран не допустимый для вида страхового продукта (" + Строка(СтраховойПродукт.Вид) + ") универсальный вид БСО: '"+Строка(СтрокаТЧ.ВидБСО)+"'!";
				//		ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
				//	КонецЕсли;
				//Иначе
					//СОО = СОО + "Для страхового продукта выбранный вид БСО: '"+Строка(СтрокаТЧ.ВидБСО)+"' не существует!";
					//ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
				//КонецЕсли;
			//КонецЕсли;			
			Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО) Тогда 
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерБСО) Тогда
					СОО = СОО + " Не указан Номер БСО для '" + Строка(СтрокаТЧ.ВидБСО) + "'";
					ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.Обязательно Тогда
			СОО = СОО + "Не выбран БСО, обязательный для заполнения: '"+Строка(СтрокаТЧ.ВидБСО)+"'!";
			ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиБСО()

//Ч
Процедура ПроверитьЗаполнениеТабличнойЧастиРиски(Отказ, Заголовок)
	
	//СтруктураОбязательныхПолей = Новый Структура("СтраховойРиск");
	//ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Риски", СтруктураОбязательныхПолей, Отказ, Заголовок);
	//СписокДоступныхРисков = ПолучитьСписокДоступныхРисков(СтраховойПродукт, ОбъектСтрахования);
	Для Каждого СтрокаТЧ из Риски Цикл
		СтрокаНачалаСообщенияОбОшибке = "Таблица Риски. В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) + ": ";		
		//Если СписокДоступныхРисков.НайтиПоЗначению(СтрокаТЧ.СтраховойРиск) = Неопределено Тогда
		//	СтрокаСообщения = "Выбран не допустимый для страхового продукта риск: " + Строка(СтрокаТЧ.СтраховойРиск) + "!";
		//	ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		//КонецЕсли;		
		Если СтрокаТЧ.СтраховаяСумма <> 0  Тогда
			Если СтрокаТЧ.СтраховаяПремия = 0  Тогда
				СтрокаСообщения = "Указана страховая сумма, но не заполнена страховая премия.";
				Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения);
			КонецЕсли;
		КонецЕсли;		
		Если (СтрокаТЧ.СтраховаяПремия <> 0 или СтрокаТЧ.СуммаФраншизы <> 0)
		   и (СтрокаТЧ.СтраховаяСумма = 0)	Тогда
			СтрокаСообщения = "Указана страховая премия, но не заполнена страховая сумма.";
			Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры 

//<<<<<<<<<<<<<<<< процедуры проверки оплат <<<<<<<<<<<<<<<<

//Ч
Процедура ПроверитьЗаполнениеТабличнойЧастиОплаты(
	  Отказ
	, ПроверятьТолькоНомерКвитанции = Ложь
	, ПроверятьТолькоКритические = Ложь
	, КонтрольПоРСДвиженияБСО = Ложь
	, ОстановитьсяПриОшибке = Ложь
	, ТипСообщения = 0 //0 - Диалог, 1 - Стандартные сообщения при проведении, 2 - простое сообщение по списку
	, Форма = Неопределено
	, oОплатыСписок = Неопределено
	, НеПроверятьЕслиЕстьДвижКвит = Ложь
	) Экспорт               
	
	ТзОшибки = СоздатьТаблицуОшибок();	
	ТЗОплат = ОП_ПолучитьТЗОплат();
	iНомерСтроки = 0;
	Для Каждого оОплата из ТЗОплат Цикл		
		iНомерСтроки = iНомерСтроки + 1;
		Если НЕ ЗначениеЗаполнено(оОплата.НомерВзноса) И оОплата.НомерВзноса <> iНомерСтроки Тогда
			ФиксироватьНовыеНомераОплат = Истина;
			ДокОП = оОплата.Ссылка.ПолучитьОбъект();			
			ДокОП.НомерВзноса = iНомерСтроки;
			Попытка
				ДокОП.Записать();	
			Исключение
			КонецПопытки;
		КонецЕсли;
		//Типа, мысль такая: если уже было движение китанции, то остальная часть проверки не нужна
		//В том случае, если установлен флаг НеПроверятьЕслиЕстьДвижКвит (это при проведении)
		// А вот при проверке оплаты на вшивость из формы по кнопке, проверяем все подряд
		// (тогда передается НеПроверятьЕслиЕстьДвижКвит = ЛОЖЬ)		
		//В случае, если проведен отчет агента, то считаем, что уже поздняк метаться.
		#Если ТолстыйКлиент ИЛИ Сервер Тогда
		Если уб_СС.ЕстьДвиженияКвитанцииПоЭтомуСП(оОплата.НомерКвитанции, Ссылка) 
			И НеПроверятьЕслиЕстьДвижКвит Тогда
			Продолжить;	
		КонецЕсли;
		
		уб_СС.ОП_Проверить(
				ТзОшибки
				, oОплатыСписок
				, оОплата
				, ПроверятьТолькоНомерКвитанции
				, ПроверятьТолькоКритические
				, КонтрольПоРСДвиженияБСО
				, ОстановитьсяПриОшибке
				, ЭтотОбъект
				, ОтключитьКонтрольНомеровБСО
				,"СтраховойПолис"
			   );
		#КонецЕсли
	КонецЦикла;
	Если ТзОшибки.Количество() <> 0 Тогда
		Для Каждого COO из ТзОшибки Цикл
			Если COO.Статус = СтатусСообщения.Важное ИЛИ COO.Статус = СтатусСообщения.ОченьВажное Тогда
				Отказ = Истина;
		    КонецЕсли;
		КонецЦикла;		
		Если ТипСообщения = 0 Тогда
			ОткрытьСообщениеОбОшибках(ТзОшибки, Форма);
		ИначеЕсли ТипСообщения = 1 Тогда
			ОтказДоЦикла = Отказ; //Что бы восстановить состояние переменной после цикла  
			Для Каждого COO из ТзОшибки Цикл
				ОбщегоНазначения.ОшибкаПриПроведении(COO.Ошибка,Отказ,,COO.Статус);
			КонецЦикла;
			Отказ = ОтказДоЦикла;  
		Иначе
			СообщитьСОО(ТзОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//>>>>>>>>>>>>>> процедуры проверки оплат >>>>>>>>>>>>>>>>>

Функция ПодготовитьТаблицуБСО()
	
	ИнфоЗапись = НЕ Ссылка.Проведен;
	ТаблицаБСО = Новый ТаблицаЗначений;
	ТаблицаБСО.Колонки.Добавить("ДатаДвижения");
	ТаблицаБСО.Колонки.Добавить("ВидБСО");
	ТаблицаБСО.Колонки.Добавить("НомерБСО");
	ТаблицаБСО.Колонки.Добавить("ДопНомерБСО");
	ТаблицаБСО.Колонки.Добавить("КоличествоБСО");
	ТаблицаБСО.Колонки.Добавить("Оформлен");
	ТаблицаБСО.Колонки.Добавить("НазначениеБСО");
	ТаблицаБСО.Колонки.Добавить("НомерСтроки");
	ТаблицаБСО.Колонки.Добавить("АгентОТ");
	ТаблицаБСО.Колонки.Добавить("АгентКУДА");
	ТаблицаБСО.Колонки.Добавить("ЭтоКвитанцияВОплате");
	ТаблицаБСО.Колонки.Добавить("СсылкаНаОплату");
	ТаблицаБСО.Колонки.Добавить("УчавствуетВдвижениях");
	ТаблицаБСО.Колонки.Добавить("СсылкаНаОплаты");
	ТаблицаБСО.Колонки.Добавить("ВедетсяНомернойУчет");
	ТаблицаБСО.Колонки.Добавить("ВедетсяКоличественныйУчет");
	ТаблицаБСО.Колонки.Добавить("ТипУчетаБСО");
	//В реквизите СКогоУходитБСО, как правило, хранится физлицо или контрагент, 
	// соотвтетстующий текущему пользователю
	//Отправителем Номерного БСО является: 
	// - в случае отсутствия ограничений по агенту: Агент по полису 
	// - в случае ограничений по агенту: значение переменной СКогоУходитБСО	
	АгентОТДляНомерного = Агент;	
	//Получателем Номерного БСО является: 
	// - в случае отсутствия ограничений по агенту: Основное Подразделение По Учету БСО 
	// - в случае ограничений по агенту: значение переменной СКогоУходитБСО
	// Если помечено "Списать БСО с Агента, то всегда - Основное Подразделение По Учету БСО"		
	АгентКУДА	= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;	
	Для Каждого СтрокаТЧ Из БСО Цикл
		Если СтрокаТЧ.Оформлен Тогда		
			ТипУчетаБСО = Неопределено;
			Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО,ТипУчетаБСО) Тогда 				
				СтрокаТЗ = ТаблицаБСО.Добавить();
				СтрокаТЗ.ВедетсяНомернойУчет 	= Истина;
				СтрокаТЗ.ДатаДвижения		 	= ДатаДвиженияБСО;
				СтрокаТЗ.НомерСтроки 			= СтрокаТЧ.НомерСтроки;
				СтрокаТЗ.ВидБСО 				= СтрокаТЧ.ВидБСО;
				СтрокаТЗ.НомерБСО 				= СтрокаТЧ.НомерБСО;
				СтрокаТЗ.КоличествоБСО 			= 1;
				СтрокаТЗ.Оформлен 				= Истина;
				СтрокаТЗ.НазначениеБСО		 	= СтрокаТЧ.НазначениеБСО;
				СтрокаТЗ.АгентОТ 				= АгентОТДляНомерного;
				СтрокаТЗ.АгентКУДА 				= АгентКУДА;
				СтрокаТЗ.ЭтоКвитанцияВОплате 	= Ложь;
				СтрокаТЗ.СсылкаНаОплату 		= Неопределено;
				СтрокаТЗ.УчавствуетВдвижениях 	= Ложь;
				СтрокаТЗ.ТипУчетаБСО 			= ТипУчетаБСО;
			ИначеЕсли уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО,ТипУчетаБСО) Тогда 			
				СтрокаТЗ = ТаблицаБСО.Добавить();
				СтрокаТЗ.ВедетсяКоличественныйУчет 	= Истина;
				СтрокаТЗ.ДатаДвижения 				= ДатаДвиженияБСО;
				СтрокаТЗ.НомерСтроки 				= 0;
				СтрокаТЗ.ВидБСО 					= СтрокаТЧ.ВидБСО;
				Если ТипЗнч(СтрокаТЧ.ВидБСО) = ТИП("СправочникСсылка.уб_ВидыБСО") Тогда
				Иначе	
					ТипУчетаБСО = СтрокаТЧ.ВидБСО.ТипУчетаБСО;
					Если ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.КоличественныйПолисВручную ИЛИ ТипУчетаБСО = Перечисления.уб_ТипыУчетаБСО.КоличественныйПолисИзСвободных Тогда
						СтрокаТЗ.НомерБСО = СтрокаТЧ.НомерБСО;
					Иначе	
						СтрокаТЗ.НомерБСО = "";
					КонецЕсли;
				КонецЕсли;
				СтрокаТЗ.КоличествоБСО 			= 1;
				СтрокаТЗ.Оформлен 				= Истина;
				СтрокаТЗ.НазначениеБСО 			= СтрокаТЧ.НазначениеБСО;
				СтрокаТЗ.АгентОТ 				= ДайАгентаОТДляКоличественногоБСО(СтрокаТЧ);
				СтрокаТЗ.АгентКУДА 				= АгентКУДА;
				СтрокаТЗ.ЭтоКвитанцияВОплате 	= Ложь;
				СтрокаТЗ.СсылкаНаОплату 		= Неопределено;
				СтрокаТЗ.УчавствуетВдвижениях 	= Ложь;				
				СтрокаТЗ.ТипУчетаБСО 			= ТипУчетаБСО;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СтруктураБСО = уб_СЛ.ПолучитьСтруктуруБСО();
	Если ТипЗНЧ(СтраховойПродукт) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
		#Если ТолстыйКлиент ИЛИ Сервер Тогда
		оБСОквА7 = уб_СС.ПолучитьБСОТипаКвА7дляСтраховогоПродукта(СтраховойПродукт);	
		//Структура : "Существует, ВидБСО, ТипБСО, Обязательно, НазначениеБСО, ТипУчетаБСО, НомернойУчет"
		Если Не оБСОквА7.Существует Тогда
			//Если Найти(СтраховойПродукт,"ЕОСАГО") = 0 Тогда
			//	Сообщить("Для данного страхового продукта не установлено БСО типа 'Квитанция А7'.");
			//КонецЕсли;	
		Иначе	
			ВидБСОТипаКвА7 = оБСОквА7.ВидБСО;
			НазначениеБСОквА7 = оБСОквА7.НазначениеБСО;
			ТЗОплат = ОП_ПолучитьТЗОплат();
			iНомерСтроки = 0;
			Для Каждого Оплата из ТЗОплат Цикл
				iНомерСтроки = iНомерСтроки + 1;
				Если Не Оплата.ЕстьКвитанция Или ПустаяСтрока(Оплата.НомерКвитанции) Или уб_СС.ЕстьДвиженияКвитанцииПоДругомуСП(Оплата.НомерКвитанции, Ссылка) Тогда
					Продолжить;	
				КонецЕсли;
				СОО = "";	
				Если уб_СС.ОП_ПроверитьНаДублиНомерКвитанции(Оплата.Ссылка, СОО) Тогда 
					Прервать;	
				КонецЕсли;
				Если СОО <> "" Тогда
					Если ИнфоЗапись Тогда
						Сообщить("Оплата № " + iНомерСтроки + " от " + Формат(Оплата.Дата, "ДФ=dd.MM.yyyy") +  " сохранена, но в ней есть ошибки: " + СОО + "");
					Иначе	
						Сообщить("Квитанция № " + Оплата.НомерКвитанции + " не может быть проведена из-за ошибок в оплате (№ " + iНомерСтроки + " от " + Формат(Оплата.Дата,"ДФ=dd.MM.yyyy") +  ") [Ошибка: " + СОО + "].");
						Продолжить;	
					КонецЕсли;
				КонецЕсли;			
				//Устанавливаем, с кого уходит БСО для оплаты
				МенеджерКвитанции = ?(Оплата.СписатьСКурьера = Ложь Или Оплата.Курьер.Пустая(), Оплата.Агент, Оплата.Курьер);
				СКогоУходитБСОВОплате = ?(НЕ ЗначениеЗаполнено(МенеджерКвитанции),уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь),МенеджерКвитанции);			
				АгентКУДАКвитанции = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;		
				АгентОТДляКвитанции = МенеджерКвитанции;
				СтрокаТЗ = ТаблицаБСО.Добавить();
				СтрокаТЗ.ДатаДвижения 				= Оплата.ДатаПроведенияБСО;
				СтрокаТЗ.НомерСтроки 				= Оплата.НомерВзноса;
				СтрокаТЗ.ВидБСО 					= ВидБСОТипаКвА7;
				СтрокаТЗ.НомерБСО 					= Оплата.НомерКвитанции;
				СтрокаТЗ.ДопНомерБСО 				= Оплата.ДопНомерКвитанции;
				СтрокаТЗ.КоличествоБСО				= 1;
				СтрокаТЗ.Оформлен 					= Истина;
				СтрокаТЗ.НазначениеБСО 				= НазначениеБСОквА7;
				СтрокаТЗ.АгентОТ 					= АгентОТДляКвитанции;
				СтрокаТЗ.АгентКУДА 					= АгентКУДАКвитанции;
				СтрокаТЗ.ЭтоКвитанцияВОплате 		= Истина;
				СтрокаТЗ.СсылкаНаОплату 			= Оплата;
				СтрокаТЗ.ТипУчетаБСО 				= оБСОквА7.ТипУчетаБСО;
				СтрокаТЗ.ВедетсяНомернойУчет 		= Истина;//Когда будет по другому раскомментировать: уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЗ.ВидБСО,СтрокаТЗ.ТипУчетаБСО)
				СтрокаТЗ.ВедетсяКоличественныйУчет 	= Ложь;
				СтрокаТЗ.УчавствуетВдвижениях 		= Ложь;
			КонецЦикла;
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	// TODO - уйти от свертки - при количественном БСО и НомерБСО="" выше не добавлять, а искать строку по видуБСО, НазначениеБСО,АгентОТ,АгентКУДА	и итерировать количество - таких случаи будут редки, и производительней
	ТаблицаБСО.Свернуть("ДатаДвижения,НомерСтроки,ВидБСО,НомерБСО,ДопНомерБСО,Оформлен,НазначениеБСО,АгентОТ,АгентКУДА,ЭтоКвитанцияВОплате,СсылкаНаОплату,СсылкаНаОплаты,УчавствуетВдвижениях,ВедетсяНомернойУчет,ВедетсяКоличественныйУчет,ТипУчетаБСО","КоличествоБСО");
	Возврат ТаблицаБСО;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ


Функция РасчитатьСуммуОплаченнойПремииПоОПлатам(УстанавливатьЗначенияПолей = Ложь, СуммаСкидки = 0, ЕстьИзменения = Ложь) Экспорт
	
	Если ПараметрыСеанса.уб_Константы.ВестиВзаиморасчетыПоОперациям = Истина Тогда
		СтруктураПоказателей = уб_Взаиморасчеты.ПоказателиГруппы(Ссылка);
	Иначе
		СтруктураПоказателей = Новый Структура("гПремия,гНачисленнаяСуммаВзноса,гПринятаяСумма,гСкидкаКлиенту,гАВ", СтраховаяПремия, 0, 0, 0, 0);
		ТЗОплат = ОП_ПолучитьТЗОплат();
		Для Каждого Оплата из ТЗОплат Цикл
			//ТОДО Сменить на проверку факта сквитованности по принятым оплатам
			Если Оплата.ОплаченоФакт<>0 //Оплата.ОтчетАгента.Проведен 
				Тогда
				СтруктураПоказателей.гНачисленнаяСуммаВзноса = СтруктураПоказателей.гНачисленнаяСуммаВзноса + Оплата.НачисленнаяСуммаВзноса;
				Если Оплата.ВидРасчетаСАгентом  = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме Тогда
					СтруктураПоказателей.гСкидкаКлиенту = СтруктураПоказателей.гСкидкаКлиенту + Оплата.АВилиСкидкаСумма;
				Иначе	
					СтруктураПоказателей.гАВ = СтруктураПоказателей.гАВ+Оплата.АВилиСкидкаСумма;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если УстанавливатьЗначенияПолей Тогда
		#Если Клиент Тогда
			ЕстьИзменения = Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"СуммаПремийПоОплатам", СтруктураПоказателей.гНачисленнаяСуммаВзноса) ИЛИ ЕстьИзменения;
			ЕстьИзменения = Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"СкидкаОбщаяПроцент", ?(СтруктураПоказателей.гНачисленнаяСуммаВзноса = 0,0,Окр(СтруктураПоказателей.гСкидкаКлиенту / СтруктураПоказателей.гНачисленнаяСуммаВзноса * 100,2))) ИЛИ ЕстьИзменения;
			ЕстьИзменения = Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"СуммаСкидкиПоОплатам", Окр(СтруктураПоказателей.гСкидкаКлиенту+СтруктураПоказателей.гАВ,2)) ИЛИ ЕстьИзменения;
		#Иначе	
			ЕстьИзменения = Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"СуммаПремийПоОплатам", СтруктураПоказателей.гНачисленнаяСуммаВзноса) ИЛИ ЕстьИзменения;
			ЕстьИзменения = Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"СкидкаОбщаяПроцент", ?(СтруктураПоказателей.гНачисленнаяСуммаВзноса = 0,0,Окр(СтруктураПоказателей.гСкидкаКлиенту / СтруктураПоказателей.гНачисленнаяСуммаВзноса * 100,2))) ИЛИ ЕстьИзменения;
			ЕстьИзменения = Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"СуммаСкидкиПоОплатам", Окр(СтруктураПоказателей.гСкидкаКлиенту+СтруктураПоказателей.гАВ,2)) ИЛИ ЕстьИзменения;
		#КонецЕсли
		Если СуммаПремийПоОплатам <= 0 Тогда
			хСост = 0; 	
		ИначеЕсли СтруктураПоказателей.гПремия > СуммаПремийПоОплатам И СуммаПремийПоОплатам > 0 И (СтруктураПоказателей.гПремия > СтруктураПоказателей.гПринятаяСумма) Тогда
			хСост = 1; 	
		ИначеЕсли СтруктураПоказателей.гПремия = СуммаПремийПоОплатам Тогда
			хСост = 2; 	
		ИначеЕсли СтруктураПоказателей.гПремия < СуммаПремийПоОплатам Тогда
			хСост = 3; 	
		КонецЕсли;
		#Если Клиент Тогда
			ЕстьИзменения = Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"СостояниеОплаченности", хСост) ИЛИ ЕстьИзменения;
		#Иначе	
			ЕстьИзменения = Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"СостояниеОплаченности", хСост) ИЛИ ЕстьИзменения;
		#КонецЕсли	
	КонецЕсли;
	Возврат СтруктураПоказателей;
	
КонецФункции

Процедура ОбновитьПлатежи(
	ОбновлятьФлагРассрочки 				= Ложь,
	ОбновлятьДатуНачисленияКВ 			= Ложь,
	ОбновлятьСуммуЕдинственногоПлатежа 	= Ложь,
	ИсправлятьНекорректныеДатыОплат 	= Ложь
	) Экспорт
	
	дДата = НачалоДня(?(НЕ ЗначениеЗаполнено(Дата),ТекущаяДата(),Дата)); 
	ДатаПлатежаПоУмолячанию = НачалоДня(?(НЕ ЗначениеЗаполнено(ДатаВыдачи),дДата,ДатаВыдачи));
	Если Платежи.Количество() = 0 Тогда
		НовыйПлатеж = Платежи.Добавить();
		НовыйПлатеж.Дата = ДатаПлатежаПоУмолячанию;
		НовыйПлатеж.Сумма = СтраховаяПремия;
	КонецЕсли;
	Если Платежи.Количество() = 1 Тогда
		ПервыйПлатеж = Платежи[0];
		Если НЕ ЗначениеЗаполнено(ПервыйПлатеж.Дата) ИЛИ ПервыйПлатеж.Дата < дДата  ИЛИ ПервыйПлатеж.Дата > (дДата + (1*60*60*24*31))  Тогда
			ПервыйПлатеж.Дата = ДатаПлатежаПоУмолячанию;
		КонецЕсли;
		Если ОбновлятьСуммуЕдинственногоПлатежа Тогда 
			#Если Клиент Тогда
				Уб_Клиент._УстановитьЗначение(ПервыйПлатеж,"Сумма",СтраховаяПремия);
			#Иначе	
				Уб_ВызовСервера._УстановитьЗначение(ПервыйПлатеж,"Сумма",СтраховаяПремия);
			#КонецЕсли				
		КонецЕсли; 	
	КонецЕсли;	
	Если ОбновлятьФлагРассрочки Тогда 
		//ЭтотОбъект.РассрочкаПлатежа = Платежи.Количество() > 1;
		#Если Клиент Тогда
			Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"РассрочкаПлатежа",Платежи.Количество() > 1); 
		#Иначе	
			Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"РассрочкаПлатежа",Платежи.Количество() > 1); 
		#КонецЕсли
	КонецЕсли; 	
	Если ОбновлятьДатуНачисленияКВ И НЕ РассрочкаПлатежа Тогда 
		//ЭтотОбъект.КВБеретсяНаДатуПлатежа = ЛОЖЬ;
		#Если Клиент Тогда
				Уб_Клиент._УстановитьЗначение(ЭтотОбъект,"КВБеретсяНаДатуПлатежа",Ложь) 
		#Иначе	
			Уб_ВызовСервера._УстановитьЗначение(ЭтотОбъект,"КВБеретсяНаДатуПлатежа",Ложь) 
		#КонецЕсли
	КонецЕсли; 	
	Если ИсправлятьНекорректныеДатыОплат Тогда 
		Для й = 0 По Платежи.Количество() - 1 Цикл
			Платеж = Платежи[й];
			Если Платеж.Дата < дДата И Платеж.Дата < ДатаПлатежаПоУмолячанию И Платеж.Дата < ДатаНачала Тогда
				Платеж.Дата = ДатаПлатежаПоУмолячанию;
				Сообщить("Изменена дата платежа " + Платеж.НомерСтроки + " Полис: " + Строка(Ссылка));
			ИначеЕсли Платеж.Дата > КонецДня(ДатаОкончания) Тогда
				Если й = 0 Тогда
					Платеж.Дата = НачалоДня(ДатаОкончания);
				Иначе
					Платеж.Дата = Мин(НачалоДня(Платежи[й-1].Дата + 60*60*24),НачалоДня(ДатаОкончания));
				КонецЕсли;
				Сообщить("Изменена дата платежа " + Платеж.НомерСтроки + " Полис: " + Строка(Ссылка));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ДайЗамененныйПолис() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотПолис", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	З.*
	|ИЗ
	|	РегистрСведений.уб_ЗаменаПолисов КАК З
	|ГДЕ
	|	З.НовыйПолис = &ЭтотПолис";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
	
КонецФункции

Процедура ЗаполнитьДокументПоСтруктуре(Структ) Экспорт
		
	Агент = Структ.Агент;
	Если Не ЗначениеЗаполнено(Агент) Тогда
		ПодразделениеОП = Неопределено;
	ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПодразделениеОП = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети
	ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ПодразделениеОП = Агент
	ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		#Если ТолстыйКлиент ИЛИ Сервер Тогда
			ПодразделениеОП = уб_СС.ПолучитьПодразделениеАгента(Агент, Дата);
		#КонецЕсли
	КонецЕсли;
	СтраховойПродукт	= Структ.СтраховойПродукт;
	ВалютаДокумента 	= Структ.Валюта;
	СК 					= Структ.СК;
	НомерЗаявки			= Структ.НомерЗаявки;
	Если НЕ Структ.ДатаОформления = Дата(1,1,1) Тогда
		Дата				= Структ.ДатаОформления;
		ДатаВыдачи			= Структ.ДатаОформления;
	КонецЕсли;
	ДатаНачала			= Структ.ДатаНачала;
	ДатаОкончания		= Структ.ДатаОкончания;
	Страхователь		= Структ.Страхователь;
	
	Заявка 				= Структ.Заявка;
	НомерКартыСтрахователя = Заявка.НомерКартыСтрахователя;
	Если Структ.НомерВзноса = 1 Тогда
		//обычно, если номер взноса не первый, курьер редко совпадает с данными приемки
		Курьер = Структ.Курьер;
	КонецЕсли;
	КурсДокумента 		= Структ.Курс;
	ОрганизацияАгент 	= Структ.ОрганизацияАгент;
	Поставщик 			= Структ.Поставщик;
	Номер 				= СокрЛП(Структ.НомерПолиса);
	ДопДанные = Неопределено;
	
	Структ.Свойство("Аддендум",Аддендум);
	
	Если Структ.Свойство("ДопДанные",ДопДанные) Тогда
		//Часть данных получено ранее из "Заявки на печать"
		Если ЗначениеЗаполнено(ДопДанные.ОбъектСтрахования) Тогда
			ОбъектСтрахования = ДопДанные.ОбъектСтрахования;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДопДанные.Собственник) Тогда
			Собственник = ДопДанные.Собственник;
		КонецЕсли;	
		//ДобавитьЗначениеПараметраЗаявки("ОбъектСтрахования",ЗаявкаПараметры,Структура,Справочники.уб_ОбъектыСтрахования.ПустаяСсылка());
		////ДобавитьЗначениеПараметраЗаявки("Страхователь",ЗаявкаПараметры,Структура);
		//ДобавитьЗначениеПараметраЗаявки("Собственник",ЗаявкаПараметры,Структура);
		Если ЗначениеЗаполнено(ДопДанные.СтраховаяПремияВсего) Тогда
			СтраховаяПремия = ДопДанные.СтраховаяПремияВсего;
		КонецЕсли;	
		
		Если Платежи.Количество() = 0 Тогда
			Пл = Платежи.Добавить();
			Пл.Дата  = Структ.ДатаОформления;
			Пл.Сумма = СтраховаяПремия;
		КонецЕсли;
		
		//TODO Переделать в допДанных на массив
		врСвойство = Неопределено;
		Если ДопДанные.Свойство("Водитель1",врСвойство) Тогда
			Водитель = Застрахованные.Добавить();
			Водитель.ФИО = врСвойство;
		КонецЕсли;	
		Если ДопДанные.Свойство("Водитель2",врСвойство) Тогда
			Водитель = Застрахованные.Добавить();
			Водитель.ФИО = врСвойство;
		КонецЕсли;	
		Если ДопДанные.Свойство("Водитель3",врСвойство) Тогда
			Водитель = Застрахованные.Добавить();
			Водитель.ФИО = врСвойство;
		КонецЕсли;	
		Если ДопДанные.Свойство("Водитель4",врСвойство) Тогда
			Водитель = Застрахованные.Добавить();
			Водитель.ФИО = врСвойство;
		КонецЕсли;	
		Если ДопДанные.Свойство("Водитель5",врСвойство) Тогда
			Водитель = Застрахованные.Добавить();
			Водитель.ФИО = врСвойство;
		КонецЕсли;	
		Если ДопДанные.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО
			или ДопДанные.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО
			Тогда
			СтрокаТЧ = Риски.Добавить();
			СтрокаТЧ.Валюта = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
			СтрокаТЧ.СтраховойРиск = ДопДанные.ВидСП;//Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО;//ПараметрыСеанса.уб_Константы.уб_РискОсаго;
			СтрокаТЧ.СтраховаяСумма = ПараметрыСеанса.уб_Константы.уб_СуммаОсаго;
			СтрокаТЧ.Тариф = ?(НЕ СтрокаТЧ.СтраховаяСумма = 0,СтраховаяПремия*100/СтрокаТЧ.СтраховаяСумма,0);
			СтрокаТЧ.СтраховаяПремия = СтраховаяПремия;
			СтраховаяСумма = СтрокаТЧ.СтраховаяСумма;
		КонецЕсли;
	КонецЕсли;	
	//Номер = уб_СЛ.ДайНомерПолисаСУчетомСостояния(СтруктураЗаполнения.НомерБСО, СостояниеПолиса);
	БСО.Очистить();
	СтрокаТЧ = БСО.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, Структ);
	СтрокаТЧ.Обязательно 	= Истина;
	СтрокаТЧ.Оформлен    	= Истина;
	//TODO получать все значения структуры Структ одним запросом чтобы получать все в одном месте
	СтрокаТЧ.НазначениеБСО = НазначениеБСОПоВидуБСО(Структ.ВидБСО);
	//Если уб_СЛ.НомерПолисаЗаполняетсяПриПоступлении(Структ.ВидБСО) Тогда
	//	НомерНачалоВыбора(ЭлементыФормы.Номер,, Истина);
	//КонецЕсли;
	//Если ЭтаФорма.ДополнительныеСвойства.Свойство("ИмяОбъекта") Тогда
	//	АвтоматическоеОбновлениеФормы();
	//КонецЕсли;
	//замена реквизита ЗаполненНеПолностью, чтобы записать без проверок на данных при создании полиса из приемки
	//однако этот случай отключения проверки должен работать только при создании из приемки,
	//а не если мы создали вручную новый полис и ввели любые данные. Поэтому этот реквизит, на всякий случай
	ОбъектНаОснованииПриемки = Истина;
	//заполнение предоставленных документов по заявке
	//нужно после записи
	//ЗаполнитьПредоставленныеДокументыПоЗаявке(Структ.Заявка);
	
	Если Структ.Свойство("СтрокаЗаявки") Тогда
			СтрокаЗаявки = Структ.СтрокаЗаявки;
			Если СтрокаЗаявки.Свойство("ОбъектСтрахования") Тогда
				ОбъектСтрахования = СтрокаЗаявки.ОбъектСтрахования;			
			КонецЕсли;
			Если ЗначениеЗаполнено(СтраховойПродукт) = Ложь Тогда
				СписокСтрахПр = уб_СЛ.ПолучитьСписокСтрахПродуктов(СК, Дата, СтрокаТЧ.ВидБСО);
				Если СписокСтрахПр.Количество() = 1 Тогда
					СтраховойПродукт = СписокСтрахПр[0].Значение;
				КонецЕсли;	
			КонецЕсли;
			Обработки.ЗагрузкаПолисовИзB2B.ЗаполнитьПлатежиПоЗаявке(ЭтотОбъект,СтрокаЗаявки,СтраховаяПремия);
			Если СтрокаЗаявки.Свойство("ЛимитОтветственности") Тогда
				ЭтотОбъект.СтраховаяСумма = СтрокаЗаявки.ЛимитОтветственности;
			КонецЕсли;	
			Если СтрокаЗаявки.Свойство("СтраховаяПремия") Тогда
				ЭтотОбъект.СтраховаяПремия = СтрокаЗаявки.СтраховаяПремия;
			КонецЕсли;	
			Обработки.ЗагрузкаПолисовИзB2B.ЗаполнитьРиски(ЭтотОбъект);
			
		//	Для каждого СтрокаДоп Из Допы(Структ.Заявка,Структ.СтрокаЗаявки)  Цикл  
		//		СтрокаДоп.ВидБСО   
		//		СтрокаДоп.НомерБСО  
		//		СтрокаДоп.НомерПолиса 
		//		СтрокаДоп.Обязательно 
		//		СтрокаДоп.Оформлен      
		//		СтрокаДоп.НазначениеБСО
		//		СтрокаДоп.Агент
		//	КонецЦикла;     
	КонецЕсли;	
КонецПроцедуры	
//
//Функция Допы(Заявка,УидЗаявки)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СК,
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогСтраховаяПремия,
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки,
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОрганизацияАгент
//				   |ИЗ
//				   |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
//				   |ГДЕ
//				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка
//				   |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя = &УидРодителя
//				   |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогСтраховаяПремия > 0";
//	Запрос.УстановитьПараметр("УидРодителя",УидЗаявки);
//	Запрос.УстановитьПараметр("Ссылка",Заявка);
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//	//Пока Выборка.Следующий() Цикл
//	//	Если Выборка.ИтогСтраховаяПремия > 0 Тогда
//	//		
//	//	КонецЕсли;	
//	//КонецЦикла;
//КонецФункции	
//

//требуется для перечитывания данных назначения БСО из страхового продукта, т.к. он может меняться
Функция НазначениеБСОПоВидуБСО(ВидБСО) Экспорт

	Если ЗначениеЗаполнено(СтраховойПродукт) И ЗначениеЗаполнено(ВидБСО) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СП.НазначениеБСО
		|ИЗ
		|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
		|ГДЕ
		|	СП.Ссылка = &СтраховойПродукт
		|	И СП.ВидБСО = &ВидБСО
		|
		|УПОРЯДОЧИТЬ ПО
		|	СП.Обязательно УБЫВ");
		Запрос.УстановитьПараметр("СтраховойПродукт", 	СтраховойПродукт);
		Запрос.УстановитьПараметр("ВидБСО",				ВидБСО);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.НазначениеБСО
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции // НазначениеБСОПоВидуБСО()

_НеОповещатьОЗаписи_ = Ложь;
//мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
мВалютаРегламентированногоУчета = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;


