
//возвращает Истина, если заблокирован для пользователя
Функция СостояниеБлокировки(
	ОбъектИлиМассивОбъектов,
	ПользовательИлиМассивПользователей	= Неопределено,
	Знач Период 						= Неопределено
	) Экспорт

	//объект
	ТипЗнчОбъектИлиМассивОбъектов = ТипЗнч(ОбъектИлиМассивОбъектов);
	Если ТипЗнчОбъектИлиМассивОбъектов = Тип("Массив") Или ТипЗнчОбъектИлиМассивОбъектов = Тип("СписокЗначений") Тогда
		МассивОбъектов = ОбъектИлиМассивОбъектов
	Иначе
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ОбъектИлиМассивОбъектов);
		Если ТипЗнчОбъектИлиМассивОбъектов = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
			МассивОбъектов.Добавить(ОбъектИлиМассивОбъектов.ОтчетПоставщику)
		КонецЕсли;
	КонецЕсли;
	//для пользователя
	ТипЗнчПользовательИлиМассивПользователей = ТипЗнч(ПользовательИлиМассивПользователей);
	Если ТипЗнчПользовательИлиМассивПользователей = Тип("Массив") Или ТипЗнчПользовательИлиМассивПользователей = Тип("СписокЗначений") Тогда
		МассивПользователей = ПользовательИлиМассивПользователей
	Иначе
		МассивПользователей = Новый Массив;
		Если ПользовательИлиМассивПользователей = Неопределено Тогда
			МассивПользователей.Добавить(ПараметрыСеанса.ТекущийПользователь)
		Иначе
			МассивПользователей.Добавить(ПользовательИлиМассивПользователей)
		КонецЕсли;
	КонецЕсли;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	//период
	Если Период = Неопределено Тогда
		Период = ТекущаяДата()
	КонецЕсли;
	//
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РОДляОтчета.Разблокирован
	|ИЗ
	|	РегистрСведений.уб_РазблокировкаОбъектов.СрезПоследних(
	|			&Период,
	|			Объект В (&МассивОбъектов)
	|				И ДляПользователя В (&МассивПользователей)) КАК РОДляОтчета");
	Запрос.УстановитьПараметр("Период",					ТекущаяДата());
	Запрос.УстановитьПараметр("МассивОбъектов",	    	МассивОбъектов);
	Запрос.УстановитьПараметр("МассивПользователей",	МассивПользователей);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Результат = Истина
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Результат = Не Выборка.Разблокирован;
	КонецЕсли;
	Возврат Результат

КонецФункции // СостояниеБлокировки()
