Перем мIDКалькуляции Экспорт; 
Перем СтруктураКБМ;

Процедура ВыполнитьКалькуляцию(Текст) Экспорт 
	
	XMLОтвет = queryWinHttp();
	
	//РезультатЗапроса.Очистить();
	Данные  = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Параметр");
	Данные.Колонки.Добавить("Наименование");
	Данные.Колонки.Добавить("Результат");
	
	ФайлXML = Новый COMОбъект("MSXML2.DOMDocument");
	ФайлXML.loadXML(XMLОтвет);
	
	СтрокаXPath = "//S:Envelope/S:Body/ns2:calcProductResponse/data/contract/*";
	ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
		
	Для каждого ХМЛнода из ВыборкаXMLНод Цикл
		Если ХМЛнода.nodeName = "error" Тогда 
			СтрокаДанные = Данные.Добавить();
			СтрокаДанные.Параметр = "error";
			СтрокаДанные.Результат = ХМЛнода.Text;
		ИначеЕсли ХМЛнода.nodeName = "result" Тогда 
			СтрокаДанные = Данные.Добавить();
			СтрокаДанные.Параметр = ХМЛнода.nodeName;
			СтрокаДанные.Наименование = "Результат";
			СтрокаДанные.Результат = ХМЛнода.Text;
		ИначеЕсли ХМЛнода.nodeName = "datecalc" Тогда 
			ДатаКалькуляции = ХМЛнода.Text;
			ДатаКалькуляции = СтрЗаменить(ДатаКалькуляции, "-", "");
			ДатаКалькуляции = СтрЗаменить(ДатаКалькуляции, "T", "");
			ДатаКалькуляции = СтрЗаменить(ДатаКалькуляции, ".", "");
			ДатаКалькуляции = СтрЗаменить(ДатаКалькуляции, ":", "");
			ДатаКалькуляции = СтрЗаменить(ДатаКалькуляции, "+", "");
			мIDКалькуляции = ДатаКалькуляции;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаДанные = Данные.Добавить();
	СтрокаДанные.Наименование = "Коэфициенты";
	СтрокаXPath = "//S:Envelope/S:Body/ns2:calcProductResponse/data/contract/coeff/*";
	ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
	
	Для каждого ХМЛнода из ВыборкаXMLНод Цикл
		Если ХМЛнода.nodeName = "brief" Тогда 
			СтрокаДанные = Данные.Добавить();
			СтрокаДанные.Параметр = ХМЛнода.Text;
		КонецЕсли;
		Если ХМЛнода.nodeName = "name" Тогда
			СтрокаДанные.Наименование = ХМЛнода.Text;
		КонецЕсли;
		Если ХМЛнода.nodeName = "result" Тогда
			СтрокаДанные.Результат = ХМЛнода.Text;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаДанные = Данные.Добавить();
	СтрокаДанные.Наименование = "Параметры расчета";
	СтрокаXPath = "//S:Envelope/S:Body/ns2:calcProductResponse/data/contract/param/*";
	ВыборкаXMLНод = ФайлXML.selectNodes(СтрокаXPath);
	
	Для каждого ХМЛнода из ВыборкаXMLНод Цикл
		Если ХМЛнода.nodeName = "brief" Тогда 
			СтрокаДанные = Данные.Добавить();
			СтрокаДанные.Параметр = ХМЛнода.Text;
		КонецЕсли;
		Если ХМЛнода.nodeName = "name" Тогда
			СтрокаДанные.Наименование = ХМЛнода.Text;
		КонецЕсли;
		Если ХМЛнода.nodeName = "result" Тогда
			СтрокаДанные.Результат = ХМЛнода.Text;
		КонецЕсли;
	КонецЦикла;
	
	//Если ТестовыйРежим Тогда 
	//	Данные.ВыбратьСтроку();
	//КонецЕсли;
	
	Текст = ОбработатьРезультат(Данные);
	
	//Возврат Текст;
	//Если Лог тогда
	//	Сообщить("Результат ответа сервера:");
	//	Сообщить(XMLОтвет);
	//КонецЕсли;
КонецПроцедуры

Функция ОбработатьРезультат(ДанныеОтвет)

	Текст = Новый ТекстовыйДокумент;
	
	Если НЕ ДанныеДляЗаполнения = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Параметр", "error");
		МассивОшибок = ДанныеОтвет.НайтиСтроки(Отбор);
		Если МассивОшибок.Количество() > 0 Тогда 
			Текст.ДобавитьСтроку("-----Ошибки калькуляции Веб-Сервиса 'Согласие'-----");
			Для Каждого Ошибка Из МассивОшибок Цикл 
				Текст.ДобавитьСтроку("* "+Ошибка.Результат+"");
			КонецЦикла;
			Возврат Текст;
		КонецЕсли;
		
		Соответствие = ПрочитатьОтветРСА(ДанныеОтвет);
		СтраховаяПремия = 0;
		Для каждого ЭлементСоответствия из Соответствие Цикл
			ИмяДанных =  ЭлементСоответствия.Значение.Имя;
			
			Если ПустаяСтрока(ИмяДанных) = ЛОЖЬ Тогда
				нСтрокиДанные =	Документ.Данные.НайтиСтроки(Новый Структура("Параметр",ИмяДанных));
				Если нСтрокиДанные.Количество()>0 Тогда
					//
					//Если ЗначениеЗаполнено (нСтрокиДанные[0].Значение) Тогда		
					//Иначе	
					Попытка
						нСтрокиДанные[0].Значение = Число(ЭлементСоответствия.Значение.Значение);
					Исключение
						нСтрокиДанные[0].Значение = ЭлементСоответствия.Значение.Значение;
					КонецПопытки;
					//КонецЕсли;	
				Иначе
					//!!! 
					//Сообщить ("Заполнение по РСА: не найден  параметр с именем "+ИмяДанных);
				КонецЕсли;	
				Если ИмяДанных = "СтраховаяПремияВсего" Тогда 
					СтраховаяПремия = Число(ЭлементСоответствия.Значение.Значение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; 
		Документ.УстановитьПараметр("СтраховаяПремияРиск",  СтраховаяПремия);
		Документ.УстановитьПараметр("ПлатежСумма",          СтраховаяПремия);
		
		//ИмяМакета = "ШаблонИмпорта";
		//Результат = Документ.ЗаполнитьМакет(ИмяМакета,ДанныеДляЗаполнения);
		//
		//Текст.ДобавитьСтроку(Результат);
		IDКалькуляции = мIDКалькуляции;
		
		Возврат Текст;
	Иначе
		Текст.ДобавитьСтроку("Калькуляция не проведена");
		Возврат Текст;
	КонецЕсли;
КонецФункции

Функция ПрочитатьОтветРСА(Таблица)
	Соотв = Новый Соответствие;
	
	Соотв.Вставить("result",Новый Структура("Имя,Значение","СтраховаяПремияВсего"));
	//коэфициенты
	Соотв.Вставить("БазовыйТариф",Новый Структура("Имя,Значение","Базовый тариф"));
	Соотв.Вставить("Кбм",Новый Структура("Имя,Значение","Коэфф. бонус-малус"));
	Соотв.Вставить("КБМ_РСА",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("Км",Новый Структура("Имя,Значение","Коэфф. за мощность двигателя"));
	Соотв.Вставить("Кн",Новый Структура("Имя,Значение","Коэфф-т по грубым нарушениям"));
	Соотв.Вставить("Ко",Новый Структура("Имя,Значение","Коэфф. допуск к управлению"));
	Соотв.Вставить("Кс",Новый Структура("Имя,Значение","Коэфф-т по периоду использования"));
	Соотв.Вставить("Кт",Новый Структура("Имя,Значение","Коэфф. региональный"));
	//параметры расчета
	Соотв.Вставить("Кс_для_периода",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("СобственникЮЛ",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("ТарифнаяЗона",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("Км_пар",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("Ко_",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("КрымИлиСевастополь",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("Кт",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("ТипСобственника",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("ТипТССокр",Новый Структура("Имя,Значение",""));

	Для Каждого Строка Из Таблица Цикл 
		ИмяПараметра  = Строка.Параметр;
		ИскомоеСвойство = Соотв.Получить(ИмяПараметра);
		
		ЗначениеПараметра = Строка.Результат;
		Если НЕ ИскомоеСвойство = Неопределено Тогда 
			ИскомоеСвойство.Значение = ЗначениеПараметра;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Соотв;

КонецФункции

Функция queryWinHttp(СтрокаОшибки="")
	
	request = СформироватьЗапрос();
	
	//request = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ccm=""http://ccm.b2b.soglasie.ru/"">
	//|<soapenv:Header/>
	//|<soapenv:Body>
	//|<ccm:getProductDesc> 
	//|     <!--Optional:--> 
	//|     <product_brief>ОСАГО-B2B</product_brief> 
	//|     <!--Optional:--> 
	//|     <statedate>?</statedate> 
	//|  </ccm:getProductDesc>
	//|</soapenv:Body>
	//|</soapenv:Envelope>";
	
	// получить данные авторизации
	//Авторизация = Справочники.уб_УчетныеЗаписи.НайтиПоНаименованию("https://b2b.soglasie.ru/CCM/CCMPort.wsdl");
		
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");

	WinHttp.Option(2,"UTF-8");
	WinHttp.Option(4, 13056); //intSslErrorIgnoreFlags
	//WinHttp.Option(6, true);//blnEnableRedirects    
	//WinHttp.Option(12, true);//blnEnableHttpsToHttpRedirects
	
	WinHttp.Open("POST", "https://b2b.soglasie.ru/CCM/CCMPort", 0);
	//WinHttp.SetCredentials(Авторизация.POP3User, Авторизация.POP3Password, 0);
	WinHttp.SetCredentials("test_user", "jashgj675237512", 0);
	
	//WinHttp.SetRequestHeader("Accept-Encoding", "gzip,deflate");
	WinHttp.setRequestHeader("Content-Type"," text/xml;charset=UTF-8");   
	//WinHttp.setRequestHeader("Cache-Control", "no-cache"); 

	Попытка
		WinHttp.Send(request); //, ИСТИНА, "test_user", "jashgj675237512");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

	Попытка
		Статус = WinHttp.Status;
	Исключение
	КонецПопытки;
	
	//Проверка ответа и его обработка
	Если WinHttp.Status <> 200 Тогда			//Если не ОК
		СтрокаОшибки = "Статус - "+WinHttp.Status + Символы.ПС + "Статус текст - "+WinHttp.StatusText +Символы.ПС + "Ответ сервера - "+WinHttp.ResponseText;
		Сообщить(СтрокаОшибки);
		WinHttp = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаОтвета = WinHttp.ResponseText;
	СтрокаОшибки = "";
	WinHttp = Неопределено;
	
	Возврат СтрокаОтвета;
	
КонецФункции

Функция СформироватьЗапрос()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда 
		Документ = СсылкаНаОбъект.ПолучитьОбъект();
	КонецЕсли;
	Если НЕ Документ = Неопределено Тогда 
		Если ДанныеДляЗаполнения = Неопределено Тогда 
			Документ.ПодготовитьДанные("000_00", ДанныеДляЗаполнения);
		КонецЕсли;
	КонецЕсли;
		
	ПроверкаКМБ               = Документ.ПолучитьПараметр("Запрос КБМ в РСА");
	ДатаРасчетаПолиса         = Документ.ПолучитьПараметр("ДатаРасчетаПолиса");
	НачалоДействия            = Документ.ПолучитьПараметр("НачалоДействия");
	ОкончаниеДействия         = Документ.ПолучитьПараметр("ОкончаниеДействия");
	Страхователь              = Документ.ПолучитьПараметр("Страхователь");
	мЛет = 0;
	РазобратьРазностьДат(ТекущаяДата(), Страхователь.ДатаРождения, мЛет);
	Возраст                   = мЛет;
	ТипОграниченияДопуска     = ?(Документ.ПолучитьПараметр("ТипОграниченияДопуска") = "Без ограничений", 1, 0);
	ОбъектСтрахования         = Документ.ПолучитьПараметр("ОбъектСтрахования");
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ
	                |	уб_ТранспортныеСредства.Объект,
	                |	уб_ТранспортныеСредства.МощностьДвигателя,
	                |	уб_ТранспортныеСредства.КолПассажирскихМест,
	                |	уб_ТранспортныеСредства.ТипТС,
	                |	уб_ТранспортныеСредства.МаксМасса
	                |ИЗ
	                |	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	                |ГДЕ
	                |	уб_ТранспортныеСредства.Объект = &Объект";
	мЗапрос.УстановитьПараметр("Объект", ОбъектСтрахования);
	Выборка = мЗапрос.Выполнить().Выбрать();
	Мощность = 0;
	МаксМасса = 0;
	КолПассажирскихМест = 0;
	Если Выборка.Следующий() Тогда 
		Мощность              = Формат(Выборка.МощностьДвигателя, "ЧН=0; ЧГ=0");
		МаксМасса             = Формат(Выборка.МаксМасса, "ЧН=0; ЧГ=0");
		КолПассажирскихМест   = Выборка.КолПассажирскихМест;
		мТипТС                = Выборка.ТипТС;
	КонецЕсли;
					
	ПериодИспользованияСтрока = Документ.ПолучитьПараметр("ПериодИспользованияСтрока");
	ЧислоПериодИспользования = НайтиЧислаВСтроке(ПериодИспользованияСтрока);
	мЛет = 0;
	РазобратьРазностьДат(ТекущаяДата(), Страхователь.ВодительскоеУдостоверениеДатаНачалаСтажа, мЛет);
	Стаж                      = мЛет;
	ВидИспользованияТС        = ПолучитьВидИспользованияТС(Документ);
	ИспользованиеТСКодКладр   = Документ.ПолучитьПараметр("ИспользованиеТСКодКладр");
	ТипСобственника           = ПолучитьТипСобственника(Документ);
	ТипТС                     = Документ.ПолучитьПараметр("ТипТС");
	Если ПроверкаКМБ Тогда 
		СтруктураКБМ = ПолучитьКМБ();
		мКоэфициент = СтруктураКБМ.КоэффицентКБМ;
	Иначе
		мКоэфициент = Документ.ПолучитьПараметр("Коэфф. бонус-малус");
	КонецЕсли;
	
	Коэфициент                = мКоэфициент;
	КлиентБезАварий           = ?(Документ.ПолучитьПараметр("КлиентБезАварий"), 0, 1);
	СрокСтрах                 = ПолучитьСрокСтрахования(НачалоДействия, ОкончаниеДействия);
	ДатаКалькуляции           = ""+Год(ДатаРасчетаПолиса)+"-"+Месяц(ДатаРасчетаПолиса)+"-"+День(ДатаРасчетаПолиса)+"";
	ДатаНачала                = ""+Год(НачалоДействия)+"-"+Месяц(НачалоДействия)+"-"+День(НачалоДействия)+"";
	ДатаОкончание             = ""+Год(ОкончаниеДействия)+"-"+Месяц(ОкончаниеДействия)+"-"+День(ОкончаниеДействия)+"";
	
	ТекстЗапроса = "<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ccm=""http://ccm.b2b.soglasie.ru/"">
	|<soapenv:Header/>
	|<soapenv:Body>
	|<ccm:calcProduct>
	|<!--Optional:-->
	|<data>
	|<debug>false</debug>
	|<checkonly>false</checkonly>
	|<product>
	|<brief>ОСАГО-B2B</brief>
	|</product>
	|<contract>
	|<param>
	|<brief>Возраст</brief>
	|<val>"+Возраст+"</val>
	|</param>
	|<param>
	|<brief>ДопускБезОграничений</brief>
	|<val>"+ТипОграниченияДопуска+"</val>
	|</param>
	|<param>
	|<brief>РазрМаксМасса</brief>
	|<val>"+МаксМасса+"</val>
	|</param>
	|<param>
	|<brief>Мощность</brief>
	|<val>"+Мощность+"</val>
	|</param>
	|<param>
	|<brief>НаличиеГрубыхНарушений</brief>
	|<val>"+КлиентБезАварий+"</val>
	|</param>
	|<param>
	|<brief>ПериодИсп</brief>
	|<val>"+ЧислоПериодИспользования+"</val>
	|</param>
	|<param>
	|<brief>СрокСтрах</brief>
	|<val>"+СрокСтрах+"</val>
	|</param>
	|<param>
	|<brief>Стаж</brief>
	|<val>"+Стаж+"</val>
	|</param>
	|<param>
	|<brief>СтрахованиеПрицепаОСАГО</brief>
	|<val>0</val>
	|</param>
	|<param>
	|<brief>ТаксиПрокатТестДрайв</brief>
	|<val>"+ВидИспользованияТС+"</val>
	|</param>
	|<param>
	|<brief>ТерриторияИспользования</brief>
	|<val>"+ИспользованиеТСКодКладр+"</val>
	|</param>
	|<param>
	|<brief>ТипСобственникаТС</brief>
	|<val>"+ТипСобственника+"</val>
	|</param>
	|<param>
	|<brief>ТипТСОСАГО</brief>
	|<val>2</val>
	|</param>
	|<param>
	|<brief>ТранзитныйНомер</brief>
	|<val>0</val>
	|</param>
	|<param>
	|<brief>ТСИностранное</brief>
	|<val>0</val>
	|</param>
	|<param>
	|<brief>ЧислоПассМест</brief>
	|<val>"+КолПассажирскихМест+"</val>
	|</param>
	|<coeff>
	|<brief>КБМ_РСА</brief>
	|<val>"+Коэфициент+"</val>
	|<forceuse>false</forceuse>
	|</coeff>
	|<datecalc>"+ДатаКалькуляции+"T00:00:00Z</datecalc>
	|<datebeg>"+ДатаНачала+"T00:00:00Z</datebeg>
	|<dateend>"+ДатаОкончание+"T00:00:00Z</dateend>
	|</contract>
	|</data>
	|</ccm:calcProduct>
	|</soapenv:Body>
	|</soapenv:Envelope>";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура вычисляет количество лет, месяцев и дней между двумя датами
//
// Параметры
//  Дата1	– дата, первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату)
//  Дата2	– дата, вторая дата (ранняя дата, с нее начинается "течение" стажа)
//  Лет		– Число, в этот параметр будет записано кол-во лет между двумя датами (Дата1-Дата2)
//  Месяцев	– Число, в этот параметр будет записано кол-во месяцев между двумя датами (Дата1-Дата2)
//  Дней	– Число, в этот параметр будет записано кол-во дней между двумя датами (Дата1-Дата2)
//
Процедура РазобратьРазностьДат(Дата1, Дата2, Лет = 0, Месяцев = 0, Дней = 0)
	
	Лет		= 0;
	Месяцев	= 0;
	Дней	= 0;
	Если Дата1 > Дата2 Тогда
		
		ВременнаяДата = Дата1;
		Если День(ВременнаяДата) < День(Дата2) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
		КонецЕсли;
		Если Месяц(ВременнаяДата) < Месяц(Дата2) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
			Месяцев = 12;
		КонецЕсли;
		Лет		= Макс(			 Год(ВременнаяДата)		- Год(Дата2),	0);
		Месяцев	= Макс(Месяцев	+ Месяц(ВременнаяДата)	- Месяц(Дата2),	0);
		Дней	= Макс(Дней		+ День(ВременнаяДата)	- День(Дата2),	0);
		
		// скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах
		Если Дата2 <> (ДобавитьМесяц(Дата1,-Лет*12-Месяцев)-Дней*86400) Тогда
			Дней = Дней + ((ДобавитьМесяц(Дата1,-Лет*12-Месяцев)-Дней*86400) - Дата2)/86400;
			//(День(КонецМесяца(Дата2)) - День(НачалоМесяца(Дата2))) - (День(КонецМесяца(ДобавитьМесяц(Дата1,-1))) - День(НачалоМесяца(ДобавитьМесяц(Дата1,-1))));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры	// РазобратьРазностьДат

Функция НайтиЧислаВСтроке(Строка = "ыдлвапдлцоук234124ывпо555епрст1я") // для примера возьмем такую строку

   МассивЧисел = Новый Массив; // сюда поместим все найденные числа. В данном примере в массив должно попасть 3 числа: 234224, 555 и 1

   СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
         МассивЧисел.Добавить(Число(СтрокаЧисел));
      КонецЕсли;
   
   КонецЦикла;

   Возврат МассивЧисел[0];

КонецФункции

Функция ПолучитьВидИспользованияТС(Документ) 
	ВидИспользованияТС = Документ.ПолучитьПараметр("ВидИспользованияТС");
	КодИсполТС = "";
	
	Если ВидИспользованияТС = "Личное" Тогда 
		КодИсполТС = 1;
	ИначеЕсли ВидИспользованияТС = "Маршрутное такси" ИЛИ ВидИспользованияТС = "Такси" Тогда 
		КодИсполТС = 5;
	ИначеЕсли ВидИспользованияТС = "Учебная" Тогда 
		КодИсполТС = 2;
	ИначеЕсли ВидИспользованияТС = "Инкассация" Тогда 
		КодИсполТС = 3;
	ИначеЕсли ВидИспользованияТС = "Скорая помощь" Тогда 
		КодИсполТС = 4;
	ИначеЕсли ВидИспользованияТС = "Дорожные и специальные ТС" Тогда 
		КодИсполТС = 6;
	ИначеЕсли ВидИспользованияТС = "Прочие" Тогда 
		КодИсполТС = 9;
	ИначеЕсли ВидИспользованияТС = "Прокат" ИЛИ ВидИспользованияТС = "Аренда" Тогда 
		КодИсполТС = 11;
	ИначеЕсли ВидИспользованияТС = "Городской пассажирский транспорт" Тогда 
		КодИсполТС = 12;
	ИначеЕсли ВидИспользованияТС = "Служебное" Тогда  
		КодИсполТС = 13;
	КонецЕсли;
	
	Возврат КодИсполТС;	
КонецФункции

Функция ПолучитьТипСобственника(Документ)
	 
	ЗначениеПараметраТипаСубъекта = Документ.ПолучитьПараметр("ЗначениеПараметраТипаСубъекта");
	КодСобственника = "";
	
	Если ЗначениеПараметраТипаСубъекта = "ФЛ" Тогда 
		КодСобственника = "1001";
	ИначеЕсли ЗначениеПараметраТипаСубъекта = "ЮЛ" Тогда 
		КодСобственника = "1002";
	Иначе 
		КодСобственника = "1004";
	КонецЕсли;
	
	Возврат Формат(КодСобственника, "ЧГ=0");
	
КонецФункции

Функция ПолучитьСрокСтрахования(НачалоДействия, ОкончаниеДействия)
	Лет = 0;
	Месяцев = 0;
	Дней = 0;
	
	РазобратьРазностьДат(КонецДня(ОкончаниеДействия)+1, НачалоДействия, Лет, Месяцев, Дней);
	
	КодСтрокСтрах = "";
	
	Если Лет = 1 Тогда
		КодСтрокСтрах = 8;
	ИначеЕсли Лет = 0 И Месяцев = 0 И Дней = 15 Тогда 
		КодСтрокСтрах = 20;
	ИначеЕсли Лет = 0 И Месяцев = 1 Тогда
		КодСтрокСтрах = 2;
	ИначеЕсли Лет = 0 И Месяцев = 2 Тогда
		КодСтрокСтрах = 3;
	ИначеЕсли Лет = 0 И Месяцев = 3 Тогда 
		КодСтрокСтрах = 4;
	ИначеЕсли Лет = 0 И Месяцев = 4 Тогда 
		КодСтрокСтрах = 5;
	ИначеЕсли Лет = 0 И Месяцев = 5 Тогда 
		КодСтрокСтрах = 6;
	ИначеЕсли Лет = 0 И Месяцев = 6 Тогда 
		КодСтрокСтрах = 7;
	ИначеЕсли Лет = 0 И Месяцев = 7 Тогда 
		КодСтрокСтрах = 12;
	ИначеЕсли Лет = 0 И Месяцев = 8 Тогда 
		КодСтрокСтрах = 13;
	ИначеЕсли Лет = 0 И Месяцев = 9 Тогда
		КодСтрокСтрах = 14;
	ИначеЕсли Лет = 0 И Месяцев = 10 Тогда
		КодСтрокСтрах = 16;
	ИначеЕсли Лет = 0 И Месяцев = 11 Тогда
		КодСтрокСтрах = 17;
	ИначеЕсли Лет = 1 И Месяцев = 1 Тогда
		КодСтрокСтрах = 21;
	КонецЕсли;
	
	Возврат КодСтрокСтрах;
	
КонецФункции

Функция ПолучитьКМБ()
	
	ОбработкаКМБ = Обработки.уб_ПроверкаКБМиТО.Создать();
	
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("СтраховательПодменаСсылки", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		ОбработкаКМБ.ФизЛицо = НайденнаяСтрока.Значение;
		ОбработкаКМБ.Организация = НайденнаяСтрока.Значение;
	КонецЕсли;
	
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("ЗначениеПараметраТипаСубъекта", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		Если НайденнаяСтрока.Значение = "ФЛ" Тогда 
			ОбработкаКМБ.РежимЗапроса = "Собственник ФизЛицо(без ограничения)";
			ОбработкаКМБ.ЗаполнитьДанныеФизЛица();
		Иначе
			ОбработкаКМБ.РежимЗапроса = "Собственник ЮрЛицо";
			ОбработкаКМБ.ИНН = ОбработкаКМБ.Организация.ИНН;
		КонецЕсли;
	КонецЕсли;
	
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("ТипОграниченияДопуска", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		Если НЕ НайденнаяСтрока.Значение = "Без ограничений" Тогда 
			ОбработкаКМБ.РежимЗапроса = "Собственник ФизЛицо(с ограничением)";
			
			Для Сч = 1 по 20 Цикл 
				НайденнаяСтрока = ДанныеДляЗаполнения.Найти("Водитель"+Сч+"ПодменаСсылки", "Параметр");
				Если Не НайденнаяСтрока = Неопределено Тогда
					Водитель = ОбработкаКМБ.СписокФизЛиц.Добавить();
					Водитель.Проверять = ИСТИНА;
					Водитель.ФизЛицо = НайденнаяСтрока.Значение;
					ОбработкаКМБ.ЗаполнитьДанныеФизЛица(Водитель);
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("ДатаРасчетаПолиса", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		ОбработкаКМБ.Дата = НайденнаяСтрока.Значение;
	КонецЕсли;
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("ОбъектСтрахованияИдентификационныйНомер", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		ОбработкаКМБ.ИдентификационныйНомер = НайденнаяСтрока.Значение;
	КонецЕсли;
	НайденнаяСтрока = ДанныеДляЗаполнения.Найти("ОбъектСтрахованияРегистрационныйЗнак", "Параметр");
	Если НЕ НайденнаяСтрока = Неопределено Тогда 
		ОбработкаКМБ.РегистрационныйЗнак = НайденнаяСтрока.Значение;
	КонецЕсли;
	
	ОбработкаКМБ.ВыполнитьЗапросВебСервиса();
	
	Таблица = ОбработкаКМБ.РезультатЗапроса.Выгрузить();
	
	СтруктураКБМ = Новый Структура;
	
	СтрокаКМБ = Таблица.Найти("Коэффицент КБМ", "Параметр");
	
	Если НЕ СтрокаКМБ = Неопределено Тогда 
		СтруктураКБМ.Вставить("КоэффицентКБМ", СтрокаКМБ.Значение);
	Иначе
		СтруктураКБМ.Вставить("КоэффицентКБМ", 1);
	КонецЕсли;
	
	СтрокаКлассКМБ = Таблица.Найти("Класс КБМ", "Параметр");
	Если НЕ СтрокаКМБ = Неопределено Тогда 
		СтруктураКБМ.Вставить("КлассКБМ", СтрокаКлассКМБ.Значение);
	Иначе
		СтруктураКБМ.Вставить("КлассКБМ", 3);
	КонецЕсли;
	
	Для Сч = 1 по 20 Цикл
		НайденнаяСтрока = ДанныеДляЗаполнения.Найти("Водитель"+Сч+"ПодменаСсылки", "Параметр");
		Если Не НайденнаяСтрока = Неопределено Тогда
			Документ.УстановитьПараметр("Водитель"+Сч+"КБМСтрока", СтруктураКБМ.КлассКБМ);
			Документ.УстановитьПараметр("Водитель"+Сч+"КБМсКоэф", СтруктураКБМ.КлассКБМ);
			Документ.УстановитьПараметр("Водитель"+Сч+"КБМРСАСтрока", СтруктураКБМ.КлассКБМ);
		КонецЕсли;
	КонецЦикла;
			
	Возврат СтруктураКБМ;
	
КонецФункции

