
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент, СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры

//Процедура ДвиженияПоРегистрам2(Отказ, Заголовок)
//	
//	Движения.уб_ДвиженияБСО.Очистить();
//	Движения.уб_ОстаткиБСО.Очистить();
//	
//	ГраницаДокумента = Новый Граница(МоментВремени().Дата,ВидГраницы.Исключая);
//	
//	пПлж = Перечисления.уб_ПоложенияБСО;
//	пСст = Перечисления.уб_СостоянияБСО;
//	Если ТипСписанияПоУмолчанию = "Испорчен" Тогда
//		СостояниеПоУмолчанию = пСст.Испорчен;	
//	ИначеЕсли ТипСписанияПоУмолчанию = "Украден" Тогда
//		СостояниеПоУмолчанию = пСст.Украден;	
//	ИначеЕсли ТипСписанияПоУмолчанию = "Уничтожен" Тогда
//		СостояниеПоУмолчанию = пСст.Уничтожен;	
//	ИначеЕсли ТипСписанияПоУмолчанию = "Оформлен, отдан Клиенту" Тогда
//		СостояниеПоУмолчанию = пСст.Оформлен;	
//	ИначеЕсли ТипСписанияПоУмолчанию = "Оформлен, отдан Банку" Тогда
//		СостояниеПоУмолчанию = пСст.Оформлен;	
//	Иначе //Если ТипСписанияПоУмолчанию = "Утрачен" Тогда
//		СостояниеПоУмолчанию = пСст.Утрачен;	
//	КонецЕсли;

//	
//	Для Каждого СтрокаТЧ Из БСО Цикл
//		
//		тсСК = СтрокаТЧ.СК;
//		тсВидБСО = СтрокаТЧ.ВидБСО;
//		тсНомерБСО = СтрокаТЧ.НомерБСО;
//		тсТипУчетаБСО = Неопределено;
//		//Признак того, что данное движение должно быть записано КАК ЕСТЬ (только для информации с соответствующими флажками)
//		ИнфоЗапись = НЕ Ссылка.Проведен;
//		
//		ВидДвижения = Неопределено;	
//		ЗаписьРег = Неопределено;
//		
//		// Определяем вид движения БСО
//		
//		ВидДвижения = Неопределено;	
//		ЗаписьРег = Неопределено;
//		СООхвост = " Списание невозможно! (строка № " + Строка(СтрокаТЧ.НомерСтроки) + ")";
//		
//		Если "" <> СокрЛП(тсНомерБСО) Тогда
//			//Проверяем существование записи в регистре Движений БСО
//			
//			//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО", тсСК, тсВидБСО, тсНомерБСО);
//			//Если НЕ ИнфоЗапись Тогда
//			//	СтруктураОтбора.Вставить("Подтверждено",Истина);
//			//	//СтруктураОтбора.Вставить("ДокПроведен",Истина);
//			//КонецЕсли;			
//			//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(ГраницаДокумента, СтруктураОтбора);
//			
//			Запрос = Новый Запрос;
//			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//			|	*
//			|ИЗ
//			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
//			|			&Период,
//			|			ВидБСО = &ВидБСО
//			|				И НомерБСО = &НомерБСО
//			//|				И СК = &СК
//			|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
//			|
//			|УПОРЯДОЧИТЬ ПО
//			|	Период УБЫВ";
//			Запрос.УстановитьПараметр("ВидБСО", тсВидБСО);
//			Запрос.УстановитьПараметр("НомерБСО", тсНомерБСО);
//			//Запрос.УстановитьПараметр("СК", тсСК);
//			Запрос.УстановитьПараметр("Период", ГраницаДокумента);
//			
//			//Если НЕ ИнфоЗапись Тогда
//			//	//СтруктураОтбора.Вставить("Подтверждено",Истина);
//			//	////СтруктураОтбора.Вставить("ДокПроведен",Истина);
//			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Подтверждено");
//			//КонецЕсли;
//			
//			тзРег = Запрос.Выполнить().Выгрузить();
//			
//			Если тзРег.Количество() > 0 Тогда
//				//Если тзРег.Количество() > 1 Тогда
//				//	тзРег.Сортировать("Период УБЫВ")
//				//КонецЕсли;
//				ЗаписьРег = тзРег[0];
//				ВидДвижения = "номер";	
//			Иначе
//				
//				Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(тсВидБСО,тсТипУчетаБСО) Тогда
//					ВидДвижения = "количество";	
//				ИначеЕсли  уб_СЛ.ОпределитьВедетсяНомернойУчет(тсВидБСО,тсТипУчетаБСО) Тогда
//					ВидДвижения = "номер";	
//				Иначе
//					ВидДвижения = Неопределено;	
//				КонецЕсли;
//			КонецЕсли;
//		Иначе	
//			Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(тсВидБСО,тсТипУчетаБСО) Тогда
//				ВидДвижения = "количество";	
//			ИначеЕсли  уб_СЛ.ОпределитьВедетсяНомернойУчет(тсВидБСО,тсТипУчетаБСО) Тогда
//				СОО = "Не указан номер БСО для [" + Строка(тсВидБСО) + "] СК: '" + Строка(тсСК) + "', строка "+Строка(СтрокаТЧ.НомерСтроки)+" " 
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			Иначе
//				ВидДвижения = Неопределено;	
//			КонецЕсли;
//		КонецЕсли;
//		
//		ЕстьИнфоОБСО = ЗаписьРег <> Неопределено;
//		КонтролироватьОстатки = ПараметрыСеанса.уб_Константы.уб_КонтролироватьНаличиеБСО;			
//		
//		Если ВидДвижения = "номер" Тогда
//			// ДВИЖЕНИЯ ДЛЯ БСО НОМЕРНОГО УЧЕТА
//			
//			// Проверки =============================================================
//			СОО = "БСО № '" + Строка(тсНомерБСО) + "' ["+Строка(тсВидБСО)+"], СК: '" + Строка(тсСК) + "'";
//			
//			// Контроль на наличие БСО в системе
//			Если НЕ ИнфоЗапись И КонтролироватьОстатки И НЕ ЕстьИнфоОБСО Тогда
//				СОО = СОО + " не поступало!" + СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли;
//			
//			//Контроль на наличие по ПоложениюБСО
//			Если НЕ ИнфоЗапись И КонтролироватьОстатки И ЕстьИнфоОБСО Тогда
//				Если Перечисления.уб_ПоложенияБСО.ПереданВСК = ЗаписьРег.ПоложениеБСО
//					ИЛИ Перечисления.уб_ПоложенияБСО.Списан = ЗаписьРег.ПоложениеБСО Тогда
//						СОО = СОО + " имеет состояние: '" + Строка(ЗаписьРег.СостояниеБСО) + "', положение: '" + Строка(ЗаписьРег.ПоложениеБСО) + "'."
//						+ СООхвост;
//						ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//					Возврат;
//				КонецЕсли;
//			КонецЕсли;
//		
//			Движение = Движения.уб_ДвиженияБСО.Добавить();
//			Движение.Период 				= Дата;
//			
//			Движение.СК 					= тсСК;
//			Движение.ВидБСО					= тсВидБСО;
//			Движение.НомерБСО 				= тсНомерБСО;
//			
//			Если ЕстьИнфоОБСО Тогда
//				Движение.Поставщик			= ЗаписьРег.Поставщик;
//				Движение.ОрганизацияАгент	= ЗаписьРег.ОрганизацияАгент;
//				Движение.АгентОтправитель	= ЗаписьРег.Агент;
//				
//				//Движение.Блокировка			= ЗаписьРег.Блокировка;
//				Движение.НомерПолиса		= ЗаписьРег.НомерПолиса;
//				Движение.ГодПолиса			= ЗаписьРег.ГодПолиса;
//				Движение.СтраховойПолис		= ЗаписьРег.СтраховойПолис;
//				Движение.Заявка             = ЗаписьРег.Заявка;
//			Иначе	
//				Движение.ОрганизацияАгент	= СтрокаТЧ.ОрганизацияАгент;
//				Движение.Поставщик			= СтрокаТЧ.Поставщик;
//				//Движение.АгентОтправитель			= ;
//			КонецЕсли;
//			
//			//По идее, после списания БСО не должно числиться ни на ком
//			//Движение.Агент			= ;
//			
//			Если СтрокаТЧ.ТипСписания = "Испорчен" Тогда
//				Движение.СостояниеБСО	= пСст.Испорчен;
//				Движение.ПоложениеБСО	= пПлж.Списан;
//			ИначеЕсли СтрокаТЧ.ТипСписания = "Украден" Тогда
//				Движение.СостояниеБСО	= пСст.Украден;
//				Движение.ПоложениеБСО	= пПлж.Списан;
//			ИначеЕсли СтрокаТЧ.ТипСписания = "Уничтожен" Тогда
//				Движение.СостояниеБСО	= пСст.Уничтожен;
//				Движение.ПоложениеБСО	= пПлж.Списан;
//			ИначеЕсли СтрокаТЧ.ТипСписания = "Утрачен" Тогда
//				Движение.СостояниеБСО	= пСст.Утрачен;
//				Движение.ПоложениеБСО	= пПлж.Списан;
//			ИначеЕсли СтрокаТЧ.ТипСписания = "Оформлен, отдан Клиенту" Тогда
//				Движение.СостояниеБСО	= пСст.Оформлен;
//				Движение.ПоложениеБСО	= пПлж.ОтданКлиенту;
//			ИначеЕсли СтрокаТЧ.ТипСписания = "Оформлен, отдан Банку" Тогда
//				Движение.СостояниеБСО	= пСст.Оформлен;
//				Движение.ПоложениеБСО	= пПлж.ОтданБанку;
//			Иначе
//				Движение.СостояниеБСО	= СостояниеПоУмолчанию;
//				Движение.ПоложениеБСО	= пПлж.Списан;
//			КонецЕсли;
//			
//			Движение.КодОперации	= Перечисления.уб_КодыОперацийБСО.СписаниеБСО;
//			//Движение.Комментарий	= СтрокаТЧ.Комментарий;
//			
//			
//			Движение.Подтверждено   = СтрокаТЧ.Подтверждено;
//			//Движение.ДокПроведен 	= Проведен;
//			Движение.Активность 	= Проведен;
//			
//			Движение.НаОснованииБумажногоДокумента = Ссылка.НаОсновеБумажногоДокумента;					
//			
//		ИначеЕсли ВидДвижения = "количество" Тогда
//			// ДВИЖЕНИЯ ДЛЯ БСО КОЛИЧЕСТВЕННОГО УЧЕТА
//			
//			Если ИнфоЗапись Тогда
//				Продолжить;	
//			КонецЕсли;
//			
//			Если СтрокаТЧ.Количество = 0 Тогда
//				СОО = Строка(тсВидБСО) + ": не указано количество для БСО с количественным типом учета. Укажите количество!" 
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли; 
//			
//			Если ЗначениеНеЗаполнено(СтрокаТЧ.Поставщик) Тогда
//				СОО = Строка(тсВидБСО) + ": не указан Поставщик для БСО с количественным типом учета. Укажите Поставщика!"
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли; 
//			
//			Если ЗначениеНеЗаполнено(СтрокаТЧ.ОрганизацияАгент) Тогда
//				СОО = Строка(тсВидБСО) + ": не указана Организация-Агент для БСО с количественным типом учета. Укажите Организацию-Агента!"
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли; 
//			
//			Если ЗначениеНеЗаполнено(СтрокаТЧ.Агент) Тогда
//				СОО = Строка(тсВидБСО) + ": не указан Агент для БСО с количественным типом учета. Укажите Агента!"
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли; 
//			
//			// проверим остатки
//			
//			СтруктураОтбора = Новый Структура("Период, Поставщик, ОрганизацияАгент, СК, ВидБСО, Агент"
//											,ГраницаДокумента
//											,СтрокаТЧ.Поставщик
//											,СтрокаТЧ.ОрганизацияАгент
//											,тсСК
//											,тсВидБСО
//											,СтрокаТЧ.Агент
//											);
//			тзРег = уб_СЛ.ПолучитьОстаткиБСО(СтруктураОтбора);
//			
//			
//			КолВНаличие = 0;
//			ЗаписьРег = Неопределено;
//			Если тзРег.Количество() > 0 Тогда
//				ЗаписьРег = тзРег[0];
//				КолВНаличие = ЗаписьРег.Количество;
//			КонецЕсли;
//			Если КонтролироватьОстатки И СтрокаТЧ.Количество > КолВНаличие Тогда
//				СОО = Строка(тсВидБСО) + ": требуется передать " + Строка(СтрокаТЧ.Количество) + "шт, имеется в наличие "+Строка(КолВНаличие)+"шт."
//				+ СООхвост;
//				ОбщегоНазначения.ОшибкаПриПроведении(СОО, Отказ, Заголовок);
//				Возврат;
//			КонецЕсли; 
//			
//			Движение = Движения.уб_ОстаткиБСО.Добавить();
//			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
//			Движение.Период 		= Дата;
//			// измерения
//			Если ЗаписьРег <> Неопределено Тогда
//				Движение.Поставщик			= ЗаписьРег.Поставщик;
//				Движение.ОрганизацияАгент	= ЗаписьРег.ОрганизацияАгент;
//			Иначе	
//				Движение.Поставщик			= СтрокаТЧ.Поставщик;
//				Движение.ОрганизацияАгент	= СтрокаТЧ.ОрганизацияАгент;
//			КонецЕсли;
//			
//			Движение.ВидБСО			= тсВидБСО;
//			Движение.СК 			= тсСК;
//			Движение.Агент			= СтрокаТЧ.Агент;
//			
//			// ресурсы
//			Движение.Количество		= СтрокаТЧ.Количество;
//			// реквизиты
//			Движение.КодОперации	= Перечисления.уб_КодыОперацийБСО.СписаниеБСО;
//			Движение.СостояниеБСО	= ?(ЗначениеНеЗаполнено(СтрокаТЧ.ТипСписания), ТипСписанияПоУмолчанию, СтрокаТЧ.ТипСписания); 
//			
//		Иначе 
//			//	УЧЕТ БСО НЕ ВЕДЕТСЯ
//			Продолжить;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Движения.уб_ДвиженияБСО.Записать();
//	Движения.уб_ОстаткиБСО.Записать();
//	
//КонецПроцедуры

//Функция ПолучитьСтруктуруПараметровДвиженийБСО()
//	
//	//
//	Возврат СтруктураПараметров;
//	
//КонецФункции

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)

	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	СтруктураПараметров.Вставить("АгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", ЛОЖЬ);
	СтруктураПараметров.Вставить("Агент", Неопределено);//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
	//СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.СписаниеБСО);
	СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Перечисления.уб_СостоянияБСО.Испорчен);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", "ТипСписания");
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Истина);
	СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", ВидДвиженияНакопления.Расход);
	//СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Поставщик", Неопределено);
	//СтруктураПараметров.Вставить("ОрганизацияАгент", Неопределено);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
	
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Ответственный,ТипСписанияПоУмолчанию");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
		//уб_temp.ДвиженияПоРегистрам3(ЭтотОбъект, Отказ, ПараметрыДвижений());
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		#Если Клиент Тогда
		ОчиститьСообщения();
		#КонецЕсли
	КонецЕсли;
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Ответственный");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);	
	Если Проведен Тогда
		ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	КонецЕсли;	
	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
		//уб_temp.ДвиженияПоРегистрам3(ЭтотОбъект, Отказ, ПараметрыДвижений());
	КонецЕсли;	

КонецПроцедуры

Функция ПараметрыДвижений()

	Параметры = Новый Структура;
	Параметры.Вставить("СооХвост", 	"Списание невозможно!");
	Параметры.Вставить("Заголовок", "Проведение документа """ + СокрЛП(Ссылка) + """: ");
	Параметры.Вставить("ИмяТЧ",		"БСО");
	Возврат Параметры;

КонецФункции // ПараметрыДвижений()

