&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ДокументДата>=Дата(2025,1,1) Тогда
		Элементы.ВидБСО.ОграничениеТипа = Новый ОписаниеТипов("ПеречисленияСсылка.уб_ВидыСтраховыхПродуктов");
	КонецЕсли;	
	
	СтруктураПараметров = уб_ФормыВызовСервера.ПолучитьСтруктуруДанныхФормы(Параметры);
	//ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураПараметров);
	Для каждого Параметр из СтруктураПараметров Цикл
		Попытка
			Этаформа[Параметр.Ключ] = Параметр.Значение;
		Исключение
		КонецПопытки;	
	КонецЦикла;
	ИндексТипаПродукта = -1;
	НеобходимоВыбратьКошелек = ЛОЖЬ;
	НеобходимоВыбратьКошелек = ЛОЖЬ;
	
	ПодразделениеПользователя = уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо, ДокументДата);
	ЭтоОтделБСО =  ПодразделениеПользователя = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	
	ИнициализироватьСписки();	
	
	Предпросмотр = Истина;
	Запрещено = ТолькоПросмотр;
	Если ДокументСамовыезд = Ложь и  ДокументКурьер = ПараметрыСеанса.уб_ТекущееФизЛицо Тогда
		ТолькоПросмотр = Истина;	
		Элементы.Состояние.ТолькоПросмотр =Истина;
		Элементы.мСписокФайловРазмещен.ТолькоПросмотр =Истина;
		//Элементы.кпФайлы.Доступность = Ложь;
		//ементыФормы.кпФайлы.Кнопки.ВАрхив.Доступность = Ложь;
		Элементы.Печать.Доступность = Ложь;
		
	КонецЕсли;
	
	//Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ЗапретитьПравкуДатыОформления, Ложь) Тогда
	//	Элементы.ДатаОформления.ТолькоПросмотр = Истина;
	//КонецЕсли;	
	
	//Массив = Новый Массив;
	//Массив.Добавить(Тип("СправочникСсылка.уб_ВидыБСО"));
	//ОграничениеТипа = Новый ОписаниеТипов(Массив);
	//Элементы.ВидБСО.ОграничениеТипа = ОграничениеТипа;
	Если ВидБСО = Неопределено 
		ИЛИ ВидБСО = Справочники.уб_СтраховыеПродукты.ПустаяСсылка()
		ИЛИ ВидБСО = Справочники.уб_ВидыБСО.ПустаяСсылка()
		Тогда
		ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка();
	КонецЕсли;
	
	//ТЗДоговоров.Колонки.Добавить("ОрганизацияАгент");
	//ТЗДоговоров.Колонки.Добавить("Поставщик");
	//ТЗДоговоров.Колонки.Добавить("ПоставщикСтрока");
	//ТЗДоговоров.Колонки.Добавить("НаименованиеДоговора");
	//ТЗДоговоров.Колонки.Добавить("ДатаЗаключенияДоговора");
	//Кнопка = Элементы.ОсновныеДействияФормы.Кнопки;	
	//уб_temp.ДобавитьКнопкиПанелиДействий(Кнопка, "Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаТЧ");	
	
	
	Если РассрочкаПлатежа = 0 Тогда
		РассрочкаПлатежа = 1;
		Взнос1Сумма = СуммаВзноса;
	КонецЕсли;	
	Если ДатаОформления = Дата(1,1,1) Тогда
		ДатаОформления = ДокументДата;
	КонецЕсли;	
	
	ТаблицаРасрочки();
	
	_СК = СК;
	ПриИзмененииСК();
	//ПриИзмененииВидаБСО();
	
	фФраншиза = Франшиза <> 0;
	
	Элементы.ВсеФайлы.Пометка = Ложь;
	
	ОбновитьФайлы();
	
	ОператорПриИзмененииНаСервере();
	
	Попытка
		Если  ТекущаяДата()>(КонецМесяца(ДокументУтвержденоДата)+5*3600*24) Тогда
			Элементы.ВыполненоРасчетов.ТолькоПросмотр = Истина;
			Элементы.ВыполненоДоделок.ТолькоПросмотр = Истина;
			Элементы.ОператорДоделал.ТолькоПросмотр = Истина;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	
	Элементы.Техосмотр_Наименование.СписокВыбора.Добавить("ООО «ТехКонтроль»");
	Элементы.Техосмотр_Наименование.СписокВыбора.Добавить("ООО «Диджитал Диагностикс»");
	
	
	Если ДатаДвиженияБСО = Дата(1,1,1) Тогда  
		
		ДатаДвиженияБСО = ДокументДата;
	КонецЕсли;
	
	
	
	Элементы.ПринятыДеньги.Доступность = уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПринятыДеньгиВЗаявке, Ложь);
	Элементы.Кошелек.Доступность = Элементы.ПринятыДеньги.Доступность;
	//!!!
	ПодобратьВидОплаты(ЭтаФорма,ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииВидаБСО();
	ПринятыДеньгиПриИзменении(Неопределено);
	СуммаВзносаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Если ЭтоНоваяСтрока Тогда
	//	ОповеститьОВыборе(Новый Структура("ЭтоЗакрытиеБезСохранения,ЭтоНоваяСтрока,УидСтроки",Истина,ЭтоНоваяСтрока,УидСтроки));
	//КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокФайлов" и Параметр = ДокументСсылка Тогда
		ОбновитьФайлы();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбъектСтрахования = ВыбранноеЗначение.Объект;
		МаркаТС  = ВыбранноеЗначение.МаркаТС;
		МодельТС = ВыбранноеЗначение.МодельТС;
		vin = ВыбранноеЗначение.ИдентификационныйНомер;
		
		НадписьОбъект()
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура РасчетСкидки()
	
	ФактСуммаВзноса = СуммаВзноса;//?(ОфициальнаяСкидка="Да",СуммаВзноса/(1-ПредоставленнаяСкидкаПроцент/100),СуммаВзноса);
	_ПредоставленнаяСкидка = ПредоставленнаяСкидкаПроцент * ФактСуммаВзноса / 100;
	уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПредоставленнаяСкидка", ПредоставленнаяСкидкаПроцент * ФактСуммаВзноса / 100);
	
КонецПроцедуры


#Область СобытияЭлементовФормы 

&НаКлиенте
Процедура СКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СКПриИзменении(Элемент)
	Если ПриИзмененииСК() Тогда
		ПриИзмененииВидаБСО();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция  ПриИзмененииСК()
	ОбновилсяВидБСО = ЛОжь;
	
	эфВидБСО = Элементы.ВидБСО;
	Если СК.Пустая() Тогда
		эфВидБСО.ТолькоПросмотр		= Истина;
		эфВидБСО.КнопкаСпискаВыбора = Ложь;
	Иначе
		//Если СтарыйКод Тогда
		//	СВ = уб_СЛ.ПолучитьСписокВидовБСО(СК,,,, Истина);
		//	Если СВ.Количество() > 0 Тогда
		//		эфВидБСО.СписокВыбора 		= СВ;
		//	Иначе
		//		эфВидБСО.КнопкаСпискаВыбора = Ложь;
		//	КонецЕсли;
		//КонецЕсли;
		эфВидБСО.КнопкаСпискаВыбора = Истина;
		эфВидБСО.ТолькоПросмотр		= Ложь;
	КонецЕсли;
	Если СК <> _СК Тогда
		ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка();//Справочники.уб_ВидыБСО.ПустаяСсылка();
		ОбновилсяВидБСО = Истина;
		//ПриИзмененииВидаБСО();
	ИначеЕсли ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО")
		и ЗначениеЗаполнено(ВидБСО)
		и ДокументДата>=Дата(2024,6,1) Тогда
		Попытка
			_ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов[Строка(ВидБСО)];
			ВидБСО = _ВидБСО;
			ОбновилсяВидБСО = Истина;
		Исключение
		КонецПопытки;	
		
	КонецЕсли;
	_СК = СК;
	
	Элементы.Поставщик.СписокВыбора.ЗагрузитьЗначения(уб_КЭШируемые.СписокПоставщиков(СК));
	
	Если Элементы.Поставщик.СписокВыбора.НайтиПоЗначению(Поставщик) = Неопределено Тогда
		Поставщик = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	ВсегоПоставщиков = Элементы.Поставщик.СписокВыбора.Количество();
	Если ВсегоПоставщиков=1 Тогда
		
		Если Поставщик.Пустая() Тогда
			Поставщик = Элементы.Поставщик.СписокВыбора[0].Значение;
		Иначе	
			
		КонецЕсли;
	ИначеЕсли ВсегоПоставщиков = 0  Тогда
		Поставщик = СК;
	КонецЕсли;
	//Скрыли поставщика
	Если  ЗначениеЗаполнено(Поставщик) = ЛОЖЬ Тогда
		Поставщик = СК;
	КонецЕсли;	
	ОбновилсяВидБСО = ПоставщикПриИзмененииНаСервере(Элементы.Поставщик) или ОбновилсяВидБСО ;
	
	Элементы.Поставщик.ЦветТекста = ?(Поставщик = СК, Новый Цвет(0,128,0), Новый Цвет(0,0,255)); 
	
	Возврат ОбновилсяВидБСО;
	
КонецФункции

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	Если ПоставщикПриИзмененииНаСервере(Элемент) = Истина Тогда
		ПриИзмененииВидаБСО();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПоставщикПриИзмененииНаСервере(Элемент)
	ОбновилсяВидБСО = ЛОЖЬ;
	УстановитьПривилегированныйРежим(Истина);
			Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СК",СК);
		Запрос.УстановитьПараметр("Поставщик",Поставщик);
		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	влож.ВидСП,
		               |	влож.ВидСПСтрока,
		               |	влож.ОрганизацияАгент
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		КонтрагентыВидыСП.ВидСП КАК ВидСП,
		               |		ПРЕДСТАВЛЕНИЕ(КонтрагентыВидыСП.ВидСП) КАК ВидСПСтрока,
		               |		КонтрагентыВидыСП.Организация КАК ОрганизацияАгент
		               |	ИЗ
		               |		Справочник.Контрагенты.ВидыСП КАК КонтрагентыВидыСП
		               |	ГДЕ
		               |		КонтрагентыВидыСП.Ссылка = &Поставщик) КАК влож";
		Запрос.УстановитьПараметр("ДатаПроверки",Дата(2023,3,1));//ТекущаяДата()-90*3600*24);
		
		СписокВидовБСО    = Новый Массив;
		СписокОрганизаций = Новый Массив;
		ВидыСП = Запрос.Выполнить().Выгрузить();
		ВидыСП.Сортировать("ВидСПСтрока");
		Для каждого Выборка из ВидыСП Цикл
			Если ЗначениеЗаполнено(Выборка.ОрганизацияАгент) Тогда
				Если СписокОрганизаций.Найти(Выборка.ОрганизацияАгент)= Неопределено Тогда
					СписокОрганизаций.Добавить(Выборка.ОрганизацияАгент);
				КонецЕсли;	
			КонецЕсли;
			//ОрганизацияАгент = Выборка.ОрганизацияАгент;
			Если ЗначениеЗаполнено(Выборка.ВидСП) Тогда
				Если СписокВидовБСО.Найти(Выборка.ВидСП)= Неопределено Тогда
					СписокВидовБСО.Добавить(Выборка.ВидСП);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
		
		Если СписокВидовБСО.Количество() = 0 Тогда
			Для каждого Значение из Метаданные.Перечисления.уб_ВидыСтраховыхПродуктов.ЗначенияПеречисления Цикл
				НовоеЗначение = Перечисления.уб_ВидыСтраховыхПродуктов[Значение.Имя];
				Если СписокВидовБСО.Найти(НовоеЗначение) = Неопределено Тогда
					СписокВидовБСО.Добавить(НовоеЗначение);
				КонецЕсли;	
			КонецЦикла;				
		КонецЕсли;
		
		//Если СписокВидовБСО.Количество() = 0 Тогда
		//	Предупреждение("Не обнаружено поступления бланков или денег для выбранного поставщика в последние 3 месяца",5);
		//Иначе
		Если СписокВидовБСО.Количество() = 1 Тогда
			ВидБСО = СписокВидовБСО[0];
			ОбновилсяВидБСО = Истина;
			
		КонецЕсли;	
		Элементы.ВидБСО.СписокВыбора.ЗагрузитьЗначения(СписокВидовБСО);
		Если СписокОрганизаций.Количество()>0 Тогда
			Элементы.ОрганизацияАгент.СписокВыбора.ЗагрузитьЗначения(СписокОрганизаций);
		КонецЕсли;	
		Если СписокОрганизаций.Количество()=1 Тогда
			Если ЗначениеЗаполнено(ОрганизацияАгент) = ЛОЖЬ Тогда
				ОрганизацияАгент = СписокОрганизаций[0];
			КонецЕсли;
			Элементы.ОрганизацияАгент.ТолькоПросмотр = Истина;
		Иначе
			Элементы.ОрганизацияАгент.ТолькоПросмотр = ЛОЖЬ;
		КонецЕсли;	
		//Если ЗначениеЗаполнено(ВидБСО) Тогда
		//	Если СписокВидовБСО.Найти(ВидБСО) = Неопределено Тогда
		//		//Предупреждение("Данный вид БСО не приходил от этого поставщика и не было приемок денег в последние 3 месяца",5);
		//		Элементы.ВидБСО.Картинка = БиблиотекаКартинок.уб_ОплатаВопрос;
		//	Иначе
		//		Элементы.ВидБСО.Картинка = Новый Картинка;
		//	КонецЕсли;	
		//Иначе
		//	Элементы.Поставщик.Картинка = Новый Картинка;
		//КонецЕсли;	
		
		
	Элементы.Поставщик.ЦветТекста = ?(Поставщик = СК, Новый Цвет(0,128,0), Новый Цвет(0,0,255)); 
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОбновилсяВидБСО;
КонецФункции

//&НаКлиенте
//Процедура СуммаВзносаПриИзмененииНаСервере(Элемент)
//	
//	Если СуммаВзноса > СтраховаяПремия Тогда
//		СуммаВзноса = СтраховаяПремия;
//		Сообщить("Сумма взноса не может быть больше страховой премии!");
//	ИначеЕсли СуммаВзноса < СтраховаяПремия Тогда
//		РассрочкаПлатежа = 2
//	Иначе
//		РассрочкаПлатежа = 1
//	КонецЕсли;
//	
//	НастройкиПолей(Истина);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПринятыДеньгиПриИзменении(Элемент)
	
	Если НЕ Элемент = Неопределено Тогда
		ЕстьМарка =  уб_ВызовСервера.ТребуетсяЗаполнениеМаркиМодели(ВидБСО,ДокументДата);
		Если ЗначениеЗаполнено(ДатаНачала) = ЛОЖЬ или ЗначениеЗаполнено(ДатаОкончания) = ЛОЖЬ Тогда
			ПоказатьПредупреждение(,"Даты полиса!");
			ЭтаФорма.ТекущийЭлемент = Элементы.ДатаНачала;
			ПринятыДеньгиАвтор = Ложь;	
		ИначеЕсли ПустаяСтрока(НомерБСО) Тогда
			ПоказатьПредупреждение(,"Номер БСО!");
			ЭтаФорма.ТекущийЭлемент = Элементы.НомерБСО;
			ПринятыДеньгиАвтор = Ложь;	
		ИначеЕсли ЕстьМарка = Истина и ПустаяСтрока(vin) Тогда
			ПоказатьПредупреждение(,"vin!");
			ЭтаФорма.ТекущийЭлемент = Элементы.Vin;
			ПринятыДеньгиАвтор = Ложь;		
		ИначеЕсли ЕстьМарка = Истина и ЗначениеЗаполнено(ОбъектСтрахования) = ЛОЖЬ Тогда
			ПоказатьПредупреждение(,"Объект не найден!");
			ЭтаФорма.ТекущийЭлемент = Элементы.ОткрытьОбъектСтрахования;
			ПринятыДеньгиАвтор = Ложь;		
		Иначе
			Проверено = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Проверено = Истина Тогда
		ПринятыДеньгиАвтор = уб_ВызовСервера.ТекущийПользователь();
		Элементы.ПринятыДеньги.Подсказка = ""+ПринятыДеньгиАвтор;
	Иначе
		Если НЕ Элемент = Неопределено Тогда
			ПринятыДеньги = ЛОЖЬ;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//уб_СС.ВыборСотрудника(Элемент, СтандартнаяОбработка);
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОператорПриИзменении(Элемент)
	ОператорПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОператорПриИзмененииНаСервере()
	Элементы.Оператор.ТолькоПросмотр = Оператор.Пустая() = Ложь  И НЕ (Оператор = ПараметрыСеанса.уб_ТекущееФизЛицо ИЛИ уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.УправлениеПечатью, Ложь));
	
	
	Элементы.Состояние.ТолькоПросмотр = Элементы.Оператор.ТолькоПросмотр и ЭтоОтделБСО = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидБСОПриИзменении(Элемент)
	ПриИзмененииВидаБСО();
	//заполнять только при ручном изменении вида БСО
	ЗаполнитьМаркуИМодельЕслиЗаполненыВОбъекте();
КонецПроцедуры

&НаКлиенте
Процедура ВидБСООчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		СтандартнаяОбработка = Ложь;
		ВидБСО = ПредопределенноеЗначение("Справочник.уб_ВидыБСО.ПустаяСсылка");
		ВидБСОПриИзменении(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаБСО()
		
	Если ВидБСО <> Неопределено Тогда
		ЭтоВидБСО = ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО");
		Если ЭтоВидБСО Тогда
			//ОстатокБСО = уб_temp.ПолучитьОстаткиБСО(СК, ВидБСО);
			//Элементы.ОстатокБСО.Значение = ?(ОстатокБСО <> 0, ""+//"Остаток: " +
			//ОстатокБСО + " шт.", "");
			ТекВидБСО = Нрег(Строка(ВидБСО));
			ЭтоОСАГО = Найти(ТекВидБСО, "осаго") <> 0 и Найти(ТекВидБСО, "карта суперосаго") = 0 и Найти(ТекВидБСО, "е-осаго") = 0;
			ЭтоКАСКО = Найти(ТекВидБСО, "каско") <> 0;
			ПриВыбореВидаБСО = ВидБСО.ПриВыбореВидаБСО;
			
			Если Не ПустаяСтрока(ПриВыбореВидаБСО) Тогда
				
				Страхователь = ДокументСтрахователь;
				ЭтоЮрлицо = ТипЗнч(Страхователь)= Тип("СправочникСсылка.Контрагенты") ИЛИ Найти(Страхователь,"ООО")>0 ИЛИ Найти(Страхователь,"Общество")>0;
				Попытка
					Отказ = Ложь;
					
					Выполнить(ПриВыбореВидаБСО);
					
					Если Отказ = Истина Тогда
						Возврат;
					КонецЕсли;	
					
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;	
			ЭтоЕОсаго = ТекВидБСО="е-осаго"; 
		Иначе
			//Элементы.ОстатокБСО.Значение = "";
			ЭтоОСАГО  = ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО") или ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО");
			ЭтоКАСКО  = ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО"); 
			ЭтоЕОсаго = ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО"); 
		КонецЕсли;	
		ЭтоБесполисные = ТекВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.Бесполисные");
		
		ЭтоДК = Найти(ТекВидБСО,"дк")>0 или Найти(ТекВидБСО,"техосмотр")>0 или Найти(ТекВидБСО,"приглашение на то")>0;
		
		//ПараметрыВидаБСО.Вставить("ЭтоЕОсаго",ЭтоЕОсаго);
		//ПараметрыВидаБСО.Вставить("ЭтоОСАГО",ЭтоОСАГО);
		//ПараметрыВидаБСО.Вставить("ЭтоКАСКО",ЭтоКАСКО);
		
		Если ЭтоОСАГО или ЭтоЕОсаго или ЭтоБесполисные Тогда
			ЛимитОтветственности = 400000;//ПараметрыСеанса.уб_Константы.уб_СуммаОсаго;

		ИначеЕсли найти(ТекВидБСО,"дк")=1 Тогда	
			ЛимитОтветственности = 10000;
		Иначе
			Элементы.СтраховаяПремия.КнопкаСпискаВыбора = Ложь;
			Если ЭтоКаско Тогда
				ЛимитОтветственностиПриИзменении(Неопределено,ЭтоКаско);
			КонецЕсли;	
		КонецЕсли;
		
		//Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.Страницы.СтраницаСвязанныхБланков;
		
		Если ЭтоЕОсаго = Истина Тогда
			//
			Элементы.КВБрокераПлан.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
		
		//Для курьеров
		//Элементы.Страницы.ТекущаяСтраница = Элементы.Файлы;
		
		СвязанныеБСО.Очистить();
	Иначе
		ЭтоЕОсаго = Ложь;
		ЭтоОСАГО  = Ложь;
		ЭтоКАСКО  = Ложь;
	КонецЕсли;	
	ПолучитьИндексПродуктаИОбновитьНадписьОшибкиВидаБСО();
	
	
		//Если ЗначениеЗаполнено(ОрганизацияАгент)= Ложь Тогда
		ЗаполнитьОргАгента();
		//КонецЕсли;	
	
	
//	Элементы.ДобавитьОбразец.Доступность = ЗначениеЗаполнено(ВидБСО) И ЭтоВидБСО И Не ПустаяСтрока(ВидБСО.ИмяФайлаОбразца);
	
	//Если ЭтоКаско или ЭтоОсаго или ЭтоДК Тогда
	Если уб_ВызовСервера.ТребуетсяЗаполнениеМаркиМодели(ВидБСО,ДокументДата) Тогда
		
		Элементы.ОткрытьОбъектСтрахования.Видимость = Истина;
		НадписьОбъект();
	Иначе
		Элементы.ОткрытьОбъектСтрахования.Видимость = Ложь;
	КонецЕсли;
	Элементы.Техосмотр.Видимость = ЭтоДК = Истина;
	Элементы.фФраншиза.Видимость = ЭтоДК = Ложь;
	Элементы.Франшиза.Видимость = ЭтоДК = Ложь;
//	Элементы.БезубыточныйПереход.Видимость = ЭтоДК = Ложь;
	//Элементы.нОфициальнаяСкидка.Видимость = ЭтоДК = Ложь;
	//Элементы.ОфициальнаяСкидка.Видимость = ЭтоДК = Ложь;
	Элементы.ПредоставленнаяСкидкаПроцент.Видимость = ЭтоДК = Ложь;
//	Элементы.НадписьПредоставленнаяСкидкаПроцент.Видимость = ЭтоДК = Ложь;
	Элементы.ПредоставленнаяСкидка.Видимость = ЭтоДК = Ложь;
	//Элементы.ПанельБсо.Видимость = ЭтоДК = Ложь;
	//Элементы.нДопНомерБСО.Видимость = ЭтоДК = Ложь;
	//Элементы.нОфициальнаяСкидка.Видимость = ЭтоДК = Ложь;
НастройкиПолей();	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияАгентПриИзменении(Элемент)
	СтрокаТЗ = ТЗДоговоров.Найти(ОрганизацияАгент);
	//ЗаполнитьИнфоПоставщик(СтрокаТЗ);
КонецПроцедуры


&НаКлиенте
Процедура ЛимитОтветственностиПриИзменении(Элемент,ЭтоКаско=Неопределено)
	//Устарело?
	//Если ЭтоКаско=Неопределено Тогда
	//	Если ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
	//		//ОстатокБСО = уб_temp.ПолучитьОстаткиБСО(СК, ВидБСО);
	//		//Элементы.ОстатокБСО.Значение = ?(ОстатокБСО <> 0, "Остаток: " + ОстатокБСО + " шт.", "");
	//		ТекВидБСО = Нрег(Строка(ВидБСО));
	//		ЭтоОСАГО = Найти(ТекВидБСО, "осаго") <> 0;
	//		ЭтоКАСКО = Найти(ТекВидБСО, "каско") <> 0;
	//	Иначе
	//		//Элементы.ОстатокБСО.Значение = "";
	//		ЭтоОСАГО = ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО") или ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО");
	//		ЭтоКАСКО = ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО") или ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО"); 
	//	КонецЕсли;
	//КонецЕсли;
	//
	////
	//Если ЭтоКАСКО и НЕ СК.Пустая() Тогда
	//	ТаблицаЛимитов = уб_СтраховойБрокер.ПолучитьЛимитыНаСтрахование(СК,ЛимитОтветственности);
	//	СтрокаЛимитов = "";
	//	тСумм = ТаблицаЛимитов.Скопировать(); 
	//	тСумм.Свернуть("Лимит");
	//	тСумм.Сортировать("Лимит");
	//	Для каждого СтрокаС из тСумм Цикл
	//		МассивСуммы = ТаблицаЛимитов.НайтиСтроки(Новый Структура ("Лимит",СтрокаС.Лимит));
	//		
	//		УсловиеПрименения = "";
	//		
	//		Для каждого СтрокаЛ из МассивСуммы Цикл
	//			//УсловиеПрименения
	//			//ТипЛимита
	//			//Лимит
	//			//Комментарий
	//			УсловиеПрименения = УсловиеПрименения + ?(ПустаяСтрока(СтрокаЛ.УсловиеПрименения),"",СтрокаЛ.УсловиеПрименения+"-")+СтрокаЛ.ТипЛимита+"; ";
	//		КонецЦикла;	
	//		
	//		СтрокаЛимитов = СтрокаЛимитов +СтрокаС.Лимит +" (" +УсловиеПрименения+") "; 
	//		
	//	КонецЦикла;
	//Иначе
	//	СтрокаЛимитов = "Лимиты не установлены";
	//КонецЕсли;
	//Элементы.нИнфоЛимиты.Заголовок = СтрокаЛимитов;
КонецПроцедуры


&НаКлиенте
Процедура СтраховаяПремияПриИзменении(Элемент)
	Если СтраховаяПремия > ЛимитОтветственности Тогда
		СтраховаяПремия = ЛимитОтветственности;
		ПоказатьПредупреждение(,"Премия не может быть больше страховой суммы!");
	КонецЕсли;
	
	Если МинимальнаяСумма > СтраховаяПремия Тогда
		СтраховаяПремия = МинимальнаяСумма;
		ПоказатьПредупреждение(,"Премия не может быть меньше "+МинимальнаяСумма);
	КонецЕсли;
	
	РассрочкаПлатежаПриИзменении(Элемент);
	
	//Если СтраховаяПремия>0 Тогда
	//	КВБрокераПлан = Окр((СтраховаяПремия-МинимальнаяСумма)*100/СтраховаяПремия,4);
	//КонецЕсли;
	НастройкиПолей();

КонецПроцедуры


&НаКлиенте
Процедура РассрочкаПлатежаПриИзменении(Элемент)
	Если РассрочкаПлатежа = 0 Тогда
		РассрочкаПлатежа = 1;
	КонецЕсли;	
	//Элементы.РассрочкаПлатежа.ТриСостояния = Ложь;
	ПолучитьИндексПродуктаИОбновитьНадписьОшибкиВидаБСО();
	Если РассрочкаПлатежа = 1 Тогда
		уб_Клиент._УстановитьЗначение(ЭтаФорма,"СуммаВзноса", СтраховаяПремия);
	КонецЕсли;	
	НастройкиПолей();
	
	Если Не тРасрочки.Количество() = РассрочкаПлатежа 
		ИЛИ Элемент = Элементы.СтраховаяПремия Тогда
		_СуммаВзноса = Окр(СтраховаяПремия/РассрочкаПлатежа,2);
		уб_Клиент._УстановитьЗначение(ЭтаФорма,"СуммаВзноса", _СуммаВзноса);
		Взнос1Сумма = _СуммаВзноса;
		Взнос2Сумма = 0;
		Взнос3Сумма = 0;
		Взнос4Сумма = 0;
		Если РассрочкаПлатежа = 2 Тогда
			Взнос2Сумма = СтраховаяПремия-_СуммаВзноса;
		ИначеЕсли РассрочкаПлатежа>2 Тогда
			Взнос2Сумма = _СуммаВзноса;
		КонецЕсли;	
		Если РассрочкаПлатежа = 3 Тогда
			Взнос3Сумма = СтраховаяПремия-_СуммаВзноса*2;
		ИначеЕсли РассрочкаПлатежа>3 Тогда
			Взнос3Сумма = _СуммаВзноса;
		КонецЕсли;	
		Если РассрочкаПлатежа = 4 Тогда
			Взнос4Сумма = СтраховаяПремия-_СуммаВзноса*3;
			//Иначе
			//	Взнос4Сумма = 0;
		КонецЕсли;	
		Если ДатаОформления = Дата(1,1,1) Тогда
			ДатаОформления = ТекущаяДата();
		КонецЕсли;	  
		Взнос2Дата = Дата(1,1,1);
		Взнос3Дата = Дата(1,1,1);
		Взнос4Дата = Дата(1,1,1);
		Для Счетчик = 2 по РассрочкаПлатежа Цикл
			ЭтаФорма["Взнос"+Счетчик+"Дата"] = ДобавитьМесяц(ДатаОформления,РассрочкаПлатежа-1);
		КонецЦикла;	
		
	КонецЕсли;
	
	ТаблицаРасрочки();

КонецПроцедуры

&НаКлиенте
Процедура фФраншизаПриИзменении(Элемент)
	Элементы.Франшиза.Видимость = фФраншиза;
КонецПроцедуры


&НаКлиенте
Процедура СуммаВзносаПриИзменении(Элемент)
	Если СуммаВзноса > СтраховаяПремия Тогда
		СуммаВзноса = СтраховаяПремия;
		ПоказатьПредупреждение(,"Сумма взноса не может быть больше страховой премии!");
	ИначеЕсли СуммаВзноса < СтраховаяПремия Тогда
		РассрочкаПлатежа = 2
	Иначе
		РассрочкаПлатежа = 1
	КонецЕсли;
	НастройкиПолей(Истина);
	уб_Клиент.ОбновитьВидыОплаты(Элементы.ВидОплаты,СуммаВзноса,ПодразделениеМенеджера,ДокументМенеджер);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленнаяСкидкаПроцентПриИзменении(Элемент)
	РасчетСкидки();
	//ПроверитьВыполнениеУсловийСвязанныхБСО();
	НастройкиПолей(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленнаяСкидкаПриИзменении(Элемент)
	ФактСуммаВзноса = ?(ОфициальнаяСкидка="Да",СуммаВзноса/(1-ПредоставленнаяСкидкаПроцент/100),СуммаВзноса);
	ПредоставленнаяСкидкаПроцент = ?(ФактСуммаВзноса <> 0, ПредоставленнаяСкидка * 100 / ФактСуммаВзноса, 0);
	ПроверитьВыполнениеУсловийСвязанныхБСО();
	НастройкиПолей();

КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если уб_СЕРВЕРные.ПроверкаДат(ДатаНачала,Аддендум) = ЛОЖЬ Тогда
		Если Аддендум = ЛОЖЬ Тогда
			ДатаНачала = ТекущаяДата();
		КонецЕсли;	
		ПоказатьПредупреждение(,"Проверьте дату начала");
	КонецЕсли;	
	ДатаОкончания = Дата(Год(ДатаНачала)+1,Месяц(ДатаНачала),День(ДатаНачала))-1;

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	РазностьДней = (ДатаОкончания-ДатаНачала)/(3600*24);
	Если РазностьДней<0 или ДатаОкончания = Дата(1,1,1) 
		или РазностьДней>365
		или РазностьДней<28
		Тогда
		ДатаОкончания = Дата(Год(ДатаНачала)+1,Месяц(ДатаНачала),День(ДатаНачала))-1;
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура МаркаТСПриИзменении(Элемент)
	Если уб_ВызовСервера.ЗначениеРеквизитаОбъекта(МодельТС,"Владелец") <> МаркаТС Тогда
		МодельТС = ПредопределенноеЗначение("Справочник.уб_МоделиТС.ПустаяСсылка");
	КонецЕсли;
	ОбъектСтрахования = ПредопределенноеЗначение("Справочник.уб_ОбъектыСтрахования.ПустаяСсылка");
	НастройкиПолей();

КонецПроцедуры

&НаКлиенте
Процедура МаркаТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	уб_Клиент.АвтоПодборТекстаСТранслитом(Элемент, Текст, Текст, СтандартнаяОбработка, "уб_МаркиТС");
КонецПроцедуры

&НаКлиенте
Процедура МодельТСПриИзменении(Элемент)
	Если МаркаТС.Пустая() Тогда
		МаркаТС = уб_ВызовСервера.ЗначениеРеквизитаОбъекта(МодельТС,"Владелец");
	КонецЕсли;
	ОбъектСтрахования = ПредопределенноеЗначение("Справочник.уб_ОбъектыСтрахования.ПустаяСсылка");
	НастройкиПолей();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектСтрахования(Команда)
	Если ЗначениеЗаполнено(ОбъектСтрахования) Тогда
		ОткрытьЗначение(ОбъектСтрахования);
	Иначе	
		
		Если ПустаяСтрока(vin) Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.Vin;
			Возврат;
		КонецЕсли;	
		ОбъектСтрахования = уб_ВызовСервера.НайтиОбъектСтрахования(ВидБСО,vin,МаркаТС,МодельТС);
		Если ЗначениеЗаполнено(ОбъектСтрахования) Тогда
			//ОткрытьЗначение(ОбъектСтрахования);
		Иначе	
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("МаркаТС",МаркаТС);
			ПараметрыОткрытия.Вставить("МодельТС",МодельТС);
			ПараметрыОткрытия.Вставить("Vin",Vin);
			ПараметрыОткрытия.Вставить("ТипОбъекта",уб_ВызовСервера.Автомобиль());
			ПараметрыОткрытия.Вставить("РежимВыбора",Истина);
			
			ОткрытьФорму("Справочник.уб_ОбъектыСтрахования.Форма.ФормаСпискаУправляемая",ПараметрыОткрытия,ЭтаФорма);
			
			//ФормаВыбора = Справочники.уб_ОбъектыСтрахования.ПолучитьФормуВыбора();
			//ФормаВыбора.МаркаТС  = МаркаТС;
			//ФормаВыбора.МодельТС = МодельТС;
			//
			//ФормаВыбора.ИдентификационныйНомер = Vin;
			//ФормаВыбора.ТипОбъекта = ;
			//ОбъектСтрахования = ФормаВыбора.ОткрытьМодально();
			//Если ЗначениеЗаполнено(ОбъектСтрахования) Тогда
			//	ДанныеТС = РегистрыСведений.уб_ТранспортныеСредства.Получить(Новый Структура("Объект",ОбъектСтрахования));
			//	МаркаТС  = ДанныеТС.МаркаТС;
			//	МодельТС = ДанныеТС.МодельТС;
			//	Vin = ДанныеТС.ИдентификационныйНомер;
			//КонецЕсли;	
			
		КонецЕсли;
		НадписьОбъект();
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьОбъектСтрахования(Команда)
	ОбъектСтрахования = ПредопределенноеЗначение("Справочник.уб_ОбъектыСтрахования.ПустаяСсылка");
	НадписьОбъект();
	
КонецПроцедуры
&НаКлиенте
Процедура НадписьОбъект()
	Если ЗначениеЗаполнено(ОбъектСтрахования) Тогда
		Элементы.ОткрытьОбъектСтрахования.Заголовок  = "Открыть";	
		Элементы.ОткрытьОбъектСтрахования.ЦветТекста = Новый Цвет(0,150,0);	
	Иначе	
		Элементы.ОткрытьОбъектСтрахования.Заголовок  = "Найти";	
		Элементы.ОткрытьОбъектСтрахования.ЦветТекста = Новый Цвет(255,0,0);	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура VinПриИзменении(Элемент)
	Vin = уб_ВызовСервера.ОбработатьVin(Vin);
	ОчиститьОбъектСтрахования(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	Если Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.Печать") Тогда
		Если (ДатаНачала = Дата(1,1,1)
			или ДатаОкончания = Дата(1,1,1)
			или ДатаОкончания = Дата(1,1,1)
			или ДатаОформления = Дата(1,1,1))
			//и Не (ВидБСО.Тип= Перечисления.уб_ТипыБСО.КвитанцияА7
			//или
			//ВидБСО.Тип= Перечисления.уб_ТипыБСО.Карточка)
			
			Тогда
			ПоказатьПредупреждение(,"Внесите срок страхования, статус не может установлен");		
			Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.ВыпускМаски");
		ИначеЕсли ЗначениеЗаполнено(ОбъектСтрахования) = ЛОЖЬ и ИндексТипаПродукта > 2  Тогда
			ПоказатьПредупреждение(,"Не выбран объект страхования, статус не может установлен");		
			Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.ВыпускМаски");
		КонецЕсли;	
		Если ПустаяСтрока(НомерБСО) Тогда
			ПоказатьПредупреждение(,"Внесите номер полиса");
			ЭтаФорма.ТекущийЭлемент = Элементы.НомерБСО;
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры


#КонецОбласти

#Область СобытияТаблицыРасрочки
&НаКлиенте
Процедура тРасрочкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тРасрочкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тРасрочкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.тРасрочки.ТекущиеДанные;
	Если Тд<> Неопределено Тогда
		СуммаВзноса = ТД.Сумма;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура тРасрочкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЭтаФОрма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияСФайлами

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	уб_Клиент.ДиалогДобавленияФайла(ДокументСсылка,ЭтаФорма.УникальныйИдентификатор,Новый Структура("УидСтроки",УидСтроки));
	//ОбновитьСписокФайлов(ИСТИНА);
	ОбновитьФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ВсеФайлы(Команда)
	Элементы.ВсеФайлы.Пометка = НЕ Элементы.ВсеФайлы.Пометка;
	
	ОбновитьФайлы();
КонецПроцедуры

&НаКлиенте
Процедура мСписокФайловПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.мСписокФайлов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		МиниФото = АдресКартинки(ТекущиеДанные.ПолноеИмя);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура мСписокФайловПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура мСписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьOS(Команда)
	ТекущиеДанные = Элементы.мСписокФайлов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Адрес = АдресКартинки(ТекущиеДанные.ПолноеИмя,Истина,Истина);
		Если Не Адрес = "" Тогда
			
			
			
			#Если Не ВебКлиент Тогда
				ДД = ПолучитьИзВременногоХранилища(Адрес);
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Прав(ТекущиеДанные.ПолноеИмя,4));
				ДД.Записать(ИмяВременногоФайла);
				Попытка
					ЗапуститьПриложение(ИмяВременногоФайла,,Ложь,);
				Исключение
				КонецПопытки;
			#Иначе
				//Сообщить(ТипЗнч(ДД));
			//	ДД.НачатьЗапись(,ТекущиеДанные.Имя);
				НачатьПолучениеФайлаССервера(Адрес,ТекущиеДанные.Имя);
			#КонецЕсли
			
			//КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ОбновитьФайлы()
	ОбновитьОтображениеФайлов();
	уб_ФормыВызовСервера.ГенерацияСпискаФайлов(мСписокФайлов);
	//Если ДокументОбъект.ЭтоНовый() или ДокументОбъект.СписокФайлов.НайтиСтроки(НОвый Структура("УидСтроки",УидСтроки)).Количество() = 0  Тогда
	
	//КонецЕсли;
	ПараметрыОбновления = Новый Структура;
	//ПараметрыОбновления.Вставить("ПоказыватьВсе",Элементы.кпФайлы.Кнопки.ПоказыватьВсе.Пометка);
	ПараметрыОбновления.Вставить("ФильтроватьВиды",МассивВидов());
	//ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Ложь);
	ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Элементы.ВсеФайлы.Пометка);
	ПараметрыОбновления.Вставить("ФильтроватьАрхив",НЕ ПоказыватьАрхивные);
	
	//ПравоВАрхив = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") или ВладелецФормы.СписокОператоров().Найти(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь);
	//Элементы.кпФайлы.Кнопки.ВАрхив.Доступность = ПравоВАрхив;
	
	Элементы.мСписокФайловВидДокумента.СписокВыбора.ЗагрузитьЗначения(уб_ФормыВызовСервера.ВидыДокументовКПолисам().ВыгрузитьЗначения());
	
	уб_ФормыВызовСервера.ОбновитьСписок(мСписокФайлов,ДанныеОбъекта(),Элементы.мСписокФайлов,Неопределено,ПараметрыОбновления,"уб_ЗаявкаНаЗаказВыездногоСпециалиста","СписокФайлов.УидСтроки ="""+УидСтроки+"""");
	
КонецФункции

&НаКлиенте
Процедура мСписокФайловРазмещенПриИзменении(Элемент)
	ТекущиеДанные = Элементы.мСписокФайлов.ТекущиеДанные;
	Если Не ТекущиеДанные =  Неопределено Тогда
		//уб_Клиент.ПриНажатииФлажкаРазмещения(Элементы.мСписокФайлов, Колонка.Имя, ДокументСсылка,Новый Структура("УидСтроки",УидСтроки));
		ТекущаяСтрока = СтруктураФайла();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ТекущиеДанные);
		Если уб_вызовСервера.ИзменениеРазмещенияФайла(ТекущаяСтрока,"Размещен",ДокументСсылка,Новый Структура("УидСтроки",УидСтроки)) = Истина Тогда		
			ОбновитьФайлы();
		КонецЕсли;	
		Если ТекущаяСтрока.Свойство("НеобходимоВыбратьКошелек") и ТекущаяСтрока.НеобходимоВыбратьКошелек = Истина Тогда
			//Код вида документа 74
			НеобходимоВыбратьКошелек = Истина;
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура мСписокФайловВидДокументаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.мСписокФайлов.ТекущиеДанные;
	Если Не ТекущиеДанные =  Неопределено Тогда
		//уб_Клиент.ПриНажатииФлажкаРазмещения(Элементы.мСписокФайлов, Колонка.Имя, ДокументСсылка,Новый Структура("УидСтроки",УидСтроки));
		ТекущаяСтрока = СтруктураФайла();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ТекущиеДанные);
		//Дополнительные данные для переименования
		ТекущаяСтрока.Вставить("Страхователь",ДокументСтрахователь);
		ТекущаяСтрока.Вставить("ДокументСсылка",ДокументСсылка);
		ТекущаяСтрока.Вставить("Номер",ДокументНомер);
		
		Если Уб_ВызовСервера.ИзменениеВидаДокумента (ТекущаяСтрока) Тогда
			ОбновитьФайлы();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция СтруктураФайла()
	 Возврат Новый Структура("Размещен,Опубликован,Имя,ВидДокумента,ВидФайлаB2B,ДатаПубликации,ОбъектСтрахования,СтраховательИной,Архив,СсылкаСправочника,УидСтроки,ПолноеИмя")
КонецФункции	


#КонецОбласти

&НаКлиенте
Процедура НастройкиПолей(Знач РассчитыватьСкидку = Ложь)
	
	Если ДокументДата>=Дата(2026,1,1) 
		и ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Поставщику") 
		и ВидБСО<>ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека")
		и ВидБСО<>ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР") Тогда
		дельта = 3;
	ИначеЕсли ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Терминал")
		или ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПоСсылкеБрокеру") Тогда
		дельта = 3;
	Иначе
		дельта = 0;
	КонецЕсли;	
	ПотеряннаяКомиссия = Окр((дельта)*СуммаВзноса/100,2);
	
	КвитанцияА7 = ПредопределенноеЗначение("Перечисление.уб_ТипыБСО.КвитанцияА7");
	//Прч = Перечисления.уб_ТипыБСО;
	ТипЗнчВидБСОВидБСО = ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО");
	ТипБСОКвитанция = ТипЗнчВидБСОВидБСО И ВидБСО.Тип = КвитанцияА7;
	//Если (РассрочкаПлатежа = 0 Или СуммаВзноса > СтраховаяПремия) И УстановитьЗначение(СуммаВзноса, СтраховаяПремия) Тогда
	РассчитыватьСкидку = Истина;
	//КонецЕсли;
	Если СК.Пустая() И ЗначениеЗаполнено(ВидБСО) Тогда
		Элементы.ВидБСО.ТолькоПросмотр = Ложь;
		Элементы.Колонки.ЦветФона = Новый Цвет(255, 173, 172);
	КонецЕсли;
	Если Количество = 0 Тогда
		Количество = 1;
	КонецЕсли;
	Если ИндексТипаПродукта = -1 Тогда
		ПолучитьИндексПродуктаИОбновитьНадписьОшибкиВидаБСО();
	КонецЕсли;
	МаркаИМодельОбязательна = МаркаИМодельОбязательна(ВидБСО,ДокументДата);
	РасчетчикОбязателен		= ЛОЖЬ;
	
	Если Запрещено Тогда
		// редактировать можно только незаполненные поля расчетчиков
		ЗаполненВидБСО = ЗначениеЗаполнено(ВидБСО) И ТипЗнчВидБСОВидБСО;
		Элементы.СК.ТолькоПросмотр									= Истина;
		Элементы.ВидБСО.ТолькоПросмотр								= Истина;
		Элементы.ОрганизацияАгент.ТолькоПросмотр					= Истина;
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Истина;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Ложь;
		Элементы.Агрегатная.Доступность							= Ложь;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= Истина;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= Ложь;
		Элементы.фФраншиза.Доступность								= Ложь;
		Элементы.Франшиза.Видимость								= Ложь;
		//Элементы.НадписьПредоставленнаяСкидка.Доступность			= Ложь;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= Истина;
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= Ложь;
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				    = Истина;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= Ложь;
		Элементы.РассрочкаПлатежа.Доступность						= Ложь;
		//Элементы.тРасрочки.Доступность						        = Ложь;
		
		Элементы.СуммаВзноса.ТолькоПросмотр						= Истина;
		Элементы.СуммаВзноса.ОтметкаНезаполненного					= Ложь;
		Элементы.МаркаТС.ТолькоПросмотр							= Истина;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Ложь;
		Элементы.МодельТС.ТолькоПросмотр							= Истина;
		Элементы.МодельТС.ОтметкаНезаполненного					= Ложь;
		//Элементы.Количество.ТолькоПросмотр							= Истина;
		//Элементы.Количество.ОтметкаНезаполненного					= Ложь;
		//Элементы.Запасных.Доступность								= Ложь;
		//Элементы.ДопКоличество.ТолькоПросмотр						= Истина;
		//Элементы.ОстатокБСО.Видимость								= ЗаполненВидБСО;
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Не ПустаяСтрока(Расчетчик) Или ИндексТипаПродукта < 2;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Ложь;//ИндексТипаПродукта = 4 И Не ЗначениеЗаполнено(Расчетчик) И РасчетчикОбязателен;
		//Элементы.Расчетчик.ТолькоПросмотр							= Не ПустаяСтрока(Расчетчик) Или ИндексТипаПродукта < 2;
		//Элементы.НадписьДопСоглашение.Доступность					= ПустаяСтрока(ДопСоглашение) И ИндексТипаПродукта > 1;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Не ПустаяСтрока(ДопСоглашение) Или ИндексТипаПродукта < 2;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Не ПустаяСтрока(ДопСоглашение) Или ИндексТипаПродукта < 2;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Не ПустаяСтрока(ДругиеДокументы);
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Не ПустаяСтрока(ДругиеДокументы);
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Истина;
	ИначеЕсли ИндексТипаПродукта = 0 Тогда
		ЗаполненВидБСО = ЗначениеЗаполнено(ВидБСО) И ТипЗнчВидБСОВидБСО;
		//Элементы.НадписьЛимитОтветственности.Доступность       	= Ложь;
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Истина;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Ложь;
		Элементы.Агрегатная.Доступность							= Ложь;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= Истина;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= Ложь;
		Элементы.фФраншиза.Доступность								= Ложь;
		Элементы.Франшиза.Видимость								= Ложь;
		//		Элементы.НадписьПредоставленнаяСкидка.Доступность			= Ложь;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= Истина;
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= Ложь;
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				    = Истина;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= Ложь;
		Элементы.РассрочкаПлатежа.Доступность						= Ложь;
		//Элементы.тРасрочки.Доступность						        = Ложь;
		Элементы.СуммаВзноса.ТолькоПросмотр						= Истина;
		Элементы.СуммаВзноса.ОтметкаНезаполненного					= Ложь;
		Элементы.Vin.ТолькоПросмотр								= Истина;		
		Элементы.МаркаТС.ТолькоПросмотр							= Истина;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Ложь;
		Элементы.МодельТС.ТолькоПросмотр							= Истина;
		Элементы.МодельТС.ОтметкаНезаполненного					= Ложь;
		//Элементы.Количество.ТолькоПросмотр							= Не ЗаполненВидБСО;
		//Элементы.Количество.ОтметкаНезаполненного					= ЗаполненВидБСО И Не ЗначениеЗаполнено(Количество);
		//Элементы.Запасных.Доступность								= ЗаполненВидБСО;
		//Элементы.ДопКоличество.ТолькоПросмотр						= Не ЗаполненВидБСО;
		//Элементы.ОстатокБСО.Видимость								= ЗаполненВидБСО;
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Истина;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Ложь;
		//Элементы.Расчетчик.ТолькоПросмотр							= Истина;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Истина;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Истина;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Не ЗаполненВидБСО;
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Не ЗаполненВидБСО;
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Истина;
	ИначеЕсли ИндексТипаПродукта = 1 Тогда  //карточка
		//Элементы.НадписьЛимитОтветственности.Доступность       	= Ложь;
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Истина;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Ложь;
		Элементы.Агрегатная.Доступность							= Ложь;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= НЕ ЭтоЕОсаго;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= ЭтоЕОсаго;
		Элементы.фФраншиза.Доступность								= Ложь;
		Элементы.Франшиза.Видимость								= Ложь;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= Истина;
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= Ложь;
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				    = Истина;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= Ложь;
		Элементы.РассрочкаПлатежа.Доступность						= ТипБСОКвитанция;
		//Элементы.тРасрочки.Доступность						        = ТипБСОКвитанция;
		Элементы.СуммаВзноса.ТолькоПросмотр						= ТипБСОКвитанция;
		Элементы.СуммаВзноса.ОтметкаНезаполненного					= ТипБСОКвитанция;
		Элементы.Vin.ТолькоПросмотр								= Истина;		
		Элементы.МаркаТС.ТолькоПросмотр							= Истина;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Ложь;
		Элементы.МодельТС.ТолькоПросмотр							= Истина;
		Элементы.МодельТС.ОтметкаНезаполненного					= Ложь;
		//Элементы.Количество.ТолькоПросмотр							= Ложь;
		//Элементы.Количество.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(Количество);
		//Элементы.Запасных.Доступность								= Истина;
//		Элементы.ДопКоличество.ТолькоПросмотр						= Ложь;
		//Элементы.ОстатокБСО.Видимость								= Истина;
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Истина;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Ложь;
		//Элементы.Расчетчик.ТолькоПросмотр							= Истина;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Истина;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Истина;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Ложь;
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Ложь;
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Ложь;
	ИначеЕсли ИндексТипаПродукта = 2 тогда
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Ложь;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(ЛимитОтветственности);
		Элементы.Агрегатная.Доступность							= Ложь;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= Ложь;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= Не ЗначениеЗаполнено(СтраховаяПремия);
		Элементы.фФраншиза.Доступность								= Ложь;
		Элементы.Франшиза.Видимость								= Ложь;
		//Элементы.НадписьПредоставленнаяСкидка.Доступность			= Истина;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= Ложь;
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Ложь;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= Ложь;
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				    = Ложь;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= Истина;
		Элементы.РассрочкаПлатежа.Доступность						= Истина;
		//Элементы.тРасрочки.Доступность						        = Ложь;
		Элементы.СуммаВзноса.ТолькоПросмотр						= Ложь;
		Элементы.СуммаВзноса.ОтметкаНезаполненного					= Истина;
		Элементы.Vin.ТолькоПросмотр								= Истина;		
		Элементы.МаркаТС.ТолькоПросмотр							= Истина;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Ложь;
		Элементы.МодельТС.ТолькоПросмотр							= Истина;
		Элементы.МодельТС.ОтметкаНезаполненного					= Ложь;
		//Элементы.нСКлиента.Видимость								= Истина;
		//Элементы.нПолучитьНаРуки.Видимость							= Истина;
		//Элементы.НадписьКоличество.Доступность						= Истина;
//		Элементы.Количество.ТолькоПросмотр							= Ложь;
		//Элементы.Количество.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(Количество);
		//Элементы.Запасных.Доступность								= Истина;
		//Элементы.ДопКоличество.ТолькоПросмотр						= Ложь;
		//Элементы.ОстатокБСО.Видимость								= Истина;
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Ложь;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Ложь;
		//Элементы.Расчетчик.ТолькоПросмотр							= Ложь;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Ложь;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Ложь;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Ложь;
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Ложь;
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Ложь;
	ИначеЕсли ИндексТипаПродукта = 3  Или ИндексТипаПродукта = 5 Тогда
		//Осаго-ТО
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Ложь;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(ЛимитОтветственности);
		Элементы.Агрегатная.Доступность							= Ложь;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= Ложь;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= Не ЗначениеЗаполнено(СтраховаяПремия);
		Элементы.фФраншиза.Доступность								= Ложь;
		Элементы.Франшиза.Видимость								= Ложь;
		//		Элементы.НадписьПредоставленнаяСкидка.Доступность			= Истина;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= ?(ИндексТипаПродукта = 5,Истина,Ложь);
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Ложь;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Истина;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= Ложь;
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				    = Истина;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= Ложь;
		Элементы.РассрочкаПлатежа.Доступность						= Ложь;
		//Элементы.тРасрочки.Доступность						        = Ложь;
		Элементы.СуммаВзноса.ТолькоПросмотр						= Истина;
		Элементы.СуммаВзноса.ОтметкаНезаполненного					= Ложь;
		Элементы.Vin.ТолькоПросмотр								= ЛОЖЬ;		
		Элементы.МаркаТС.ТолькоПросмотр							= Ложь;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Не ЗначениеЗаполнено(МаркаТС) И МаркаИМодельОбязательна;
		Элементы.МодельТС.ТолькоПросмотр							= Ложь;
		Элементы.МодельТС.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(МодельТС) И МаркаИМодельОбязательна;
		//Элементы.Количество.ТолькоПросмотр							= Ложь;
		//Элементы.Количество.ОтметкаНезаполненного					=  ?(ИндексТипаПродукта = 5,ЛОЖЬ,Не ЗначениеЗаполнено(Количество));
		//Элементы.Запасных.Доступность								=  ?(ИндексТипаПродукта = 5,ЛОЖЬ,Истина);
		//Элементы.ДопКоличество.ТолькоПросмотр						= Ложь;
		//Элементы.ОстатокБСО.Видимость								=  ?(ИндексТипаПродукта = 5,ЛОЖЬ,Истина);
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Ложь;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Ложь;
		//Элементы.Расчетчик.ТолькоПросмотр							= Ложь;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Ложь;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Ложь;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Ложь;
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Ложь;
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Ложь;
	Иначе
		//ИндексТипаПродукта = 4
		//КАСКО
		Элементы.ЛимитОтветственности.ТолькоПросмотр				= Ложь;
		Элементы.ЛимитОтветственности.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(ЛимитОтветственности);
		Элементы.Агрегатная.Доступность							= Истина;
		Элементы.СтраховаяПремия.ТолькоПросмотр					= Ложь;
		Элементы.СтраховаяПремия.ОтметкаНезаполненного				= Не ЗначениеЗаполнено(СтраховаяПремия);
		Элементы.фФраншиза.Доступность								= Истина;
		Элементы.Франшиза.Видимость								= фФраншиза;
		//Элементы.НадписьПредоставленнаяСкидка.Доступность			= Истина;
		Элементы.ПредоставленнаяСкидкаПроцент.ТолькоПросмотр		= Ложь;
		Элементы.ПредоставленнаяСкидка.ТолькоПросмотр				= Ложь;
		//Элементы.БезубыточныйПереход.ТолькоПросмотр				= Ложь;
		//Элементы.БезубыточныйПереход.ОтметкаНезаполненного			= БезубыточныйПереход = "";
		Элементы.ОфициальнаяСкидка.ТолькоПросмотр				= Ложь;
		//Элементы.ОфициальнаяСкидка.ОтметкаНезаполненного			= ОфициальнаяСкидка = "";
		Элементы.РассрочкаПлатежа.Доступность						= Истина;
		//Элементы.тРасрочки.Доступность						        = Истина;
		//Элементы.НадписьСуммаВзноса.Доступность					= РассрочкаПлатежа = 1;
		Элементы.СуммаВзноса.ТолькоПросмотр						= ЛОЖЬ;//РассрочкаПлатежа = 1;
		//Элементы.СуммаВзноса.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(СуммаВзноса) И РассрочкаПлатежа = 1;
		Элементы.МаркаТС.ТолькоПросмотр							= Ложь;
		Элементы.МаркаТС.ОтметкаНезаполненного						= Не ЗначениеЗаполнено(МаркаТС) И МаркаИМодельОбязательна;
		Элементы.Vin.ТолькоПросмотр								= ЛОЖЬ;		
		Элементы.МодельТС.ТолькоПросмотр							= Ложь;
		Элементы.МодельТС.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(МодельТС) И МаркаИМодельОбязательна;
		//Элементы.Количество.ТолькоПросмотр							= Ложь;
		//Элементы.Количество.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(Количество);
		//Элементы.Запасных.Доступность								= Истина;
		//Элементы.ДопКоличество.ТолькоПросмотр						= Ложь;
		//Элементы.ОстатокБСО.Видимость								= Истина;
		//Элементы.СостояниеРасчетчик.ТолькоПросмотр					= Ложь;
		//Элементы.СостояниеРасчетчик.ОтметкаНезаполненного			= Не ЗначениеЗаполнено(Расчетчик) И РасчетчикОбязателен;
		//Элементы.Расчетчик.ТолькоПросмотр							= Ложь;
		//Элементы.СостояниеДопСоглашение.ТолькоПросмотр				= Ложь;
		//Элементы.ДопСоглашение.ТолькоПросмотр						= Ложь;
		//Элементы.СостояниеДругиеДокументы.ТолькоПросмотр			= Ложь;
		//Элементы.ДругиеДокументы.ТолькоПросмотр					= Ложь;
		Элементы.СвязанныеБСО.ТолькоПросмотр						= Ложь;
		
	КонецЕсли;
	Если ИндексТипаПродукта > 0 Тогда
		///!!!!!
		//Если Не Элементы.РассрочкаПлатежа.Доступность Тогда
		//	УстановитьЗначение(РассрочкаПлатежа, 0);
		//	УстановитьЗначение(СуммаВзноса, СтраховаяПремия);
		//ИначеЕсли СуммаВзноса < СтраховаяПремия Тогда
		//	Если РассрочкаПлатежа = 2 Тогда
		//		УстановитьЗначение(СуммаВзноса, СтраховаяПремия);
		//	Иначе
		//		УстановитьЗначение(РассрочкаПлатежа, 1)
		//	КонецЕсли;
		//КонецЕсли;
		//Если Элементы.БезубыточныйПереход.ТолькоПросмотр Тогда
		//	уб_Клиент._УстановитьЗначение(ЭтаФорма,"БезубыточныйПереход", "Нет");
		//КонецЕсли;
		Если Элементы.ОфициальнаяСкидка.ТолькоПросмотр Тогда
			уб_Клиент._УстановитьЗначение(ЭтаФорма,"ОфициальнаяСкидка", "Нет");
		КонецЕсли;
	КонецЕсли;
	Если РассчитыватьСкидку Тогда
		РасчетСкидки();
	КонецЕсли;
	ПолучитьНаРуки = (СуммаВзноса - ?(ОфициальнаяСкидка ="Да",0,ПредоставленнаяСкидка)) * Количество;
	//Элементы.нПолучитьНаРуки.Заголовок = "" + ПолучитьНаРуки + " руб.";
	//Если ПолучитьНаРуки < 0 Тогда
	//	Элементы.нПолучитьНаРуки.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
	//Иначе
	//	Элементы.нПолучитьНаРуки.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	//КонецЕсли;
	
	//Если МаркаИМодельОбязательна = Истина  и ЗначениеЗаполнено(ОбъектСтрахования) = ЛОЖЬ Тогда
	//	
	//КонецЕсли;	
	
	Элементы.ОчиститьОбъектСтрахования.Видимость = ЗначениеЗаполнено(ОбъектСтрахования);
	
КонецПроцедуры



Процедура ЗаполнитьОргАгента()
	
	Если Не ВидБСО.Пустая() И ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДК.Наименование,
		|	ДК.ДатаЗаключенияДоговора,
		|	ДК.Организация,
		|	ДК.Владелец,
		|	ДК.ВидСП
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДК
		|ГДЕ
		|	ДК.РасширениеНазвания <> ""---""
		|	И НЕ ДК.ПометкаУдаления
		|	И (ДК.ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ ДК.ДатаОкончанияДействияДоговора > &Дата)
		|	И ДК.ДатаЗаключенияДоговора < &Дата
		|	И ДК.ВидСП В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПБ.Ссылка.ОрганизацияАгент КАК ОрганизацияАгент,
		|	ПБ.Ссылка.Поставщик КАК Поставщик,
		|	ПРЕДСТАВЛЕНИЕ(ПБ.Ссылка.ОрганизацияАгент) КАК ОрганизацияАгентСтрока,
		|	ПРЕДСТАВЛЕНИЕ(ПБ.Ссылка.Поставщик) КАК ПоставщикСтрока,
		|	ЕСТЬNULL(ВТ_Договоры.Наименование, """") КАК НаименованиеДоговора,
		|	ЕСТЬNULL(ВТ_Договоры.ДатаЗаключенияДоговора, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗаключенияДоговора,
		|	ЕСТЬNULL(ВТ_Договоры.ВидСП, ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка)) КАК ВидСП,
		|	ПБ.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.уб_ПоступлениеБСО.БСО КАК ПБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
		|		ПО ПБ.Ссылка.Поставщик = ВТ_Договоры.Владелец
		|			И ПБ.Ссылка.ОрганизацияАгент = ВТ_Договоры.Организация
		|ГДЕ
		|	ПБ.ВидБСО = &ВидБСО
		|   и ПБ.Ссылка.ОрганизацияАгент.ПометкаУдаления = ЛОЖЬ
		|	И ПБ.Ссылка.Дата >= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ,
		|	ОрганизацияАгент,
		|	Поставщик,
		|	ВидСП УБЫВ");
		Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
		Дата = ?(ЗначениеЗаполнено(ДокументДата), ДокументДата, ТекущаяДата());
		//Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(Дата, -3));
		Запрос.УстановитьПараметр("Дата", Дата(2023,3,1));
		//Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(Дата, -12));
		РезультатЗапроса = Запрос.Выполнить();
		ТЗДоговоров.Очистить();
		Если РезультатЗапроса.Пустой() Тогда
			Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Ложь;
			//ОрганизацияАгент = Неопределено;
			//ЗаполнитьИнфоПоставщик();
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			СЗОргАгентов = Новый СписокЗначений;
			СзПоставщиков = Новый СписокЗначений;
			//Пока Выборка.СледующийПоЗначениюПоля("ОрганизацияАгент") Цикл
			Пока Выборка.Следующий() Цикл
				Если СЗОргАгентов.НайтиПоЗначению(Выборка.ОрганизацияАгент)  = Неопределено Тогда
					СЗОргАгентов.Добавить(Выборка.ОрганизацияАгент, Выборка.ОрганизацияАгентСтрока);				
				КонецЕсли;	
				СтрокаТЗ = ТЗДоговоров.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
				Если СзПоставщиков.НайтиПоЗначению(Выборка.Поставщик)  = Неопределено Тогда
					СзПоставщиков.Добавить(Выборка.Поставщик);
				КонецЕсли;	
			КонецЦикла;
			СЗОргАгентовКоличество = СЗОргАгентов.Количество();
			Если СЗОргАгентовКоличество = 0 Тогда
				ОрганизацияАгент = Неопределено;
				//ЗаполнитьИнфоПоставщик();
				Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;	
			ИначеЕсли СЗОргАгентовКоличество = 1 Тогда
				ОрганизацияАгент = Выборка.ОрганизацияАгент;
				//СтрокаТЗ = ТЗДоговоров.НайтиСтроки(Новый Структура(ОрганизацияАгент, "ОрганизацияАгент");
				Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Ложь;
				//Если СзПоставщиков.Количество() = 1 Тогда
				//	Поставщик = Выборка.Поставщик;
				//КонецЕсли;
			Иначе
				ОрганизацияАгент = СЗОргАгентов[0].Значение;
				//Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;
				//Если Не ОрганизацияАгент.Пустая() Тогда
				//	СтрокаТЗ = ТЗДоговоров.Найти(ОрганизацияАгент, "ОрганизацияАгент");
				//	Если СтрокаТЗ = Неопределено Тогда
				//		//ОрганизацияАгент = Неопределено;
				//		Сообщить(""+ОрганизацияАгент+" не найдена в действующих договорах по "+СК);
				//		ЗаполнитьИнфоПоставщик();
				//	КонецЕсли;
				//КонецЕсли;
				Элементы.ОрганизацияАгент.СписокВыбора = СЗОргАгентов;
				Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;	
			КонецЕсли;
			
				//
				ЕстьВопросы = Ложь;
				Для каждого ТекПоставщик из Элементы.Поставщик.СписокВыбора Цикл
					Если  СзПоставщиков.НайтиПоЗначению(ТекПоставщик.Значение)= Неопределено Тогда
						//ТекПоставщик.Картинка = БиблиотекаКартинок.уб_ОплатаВопрос;
						ЕстьВопросы = Истина;
					Иначе
						//ТекПоставщик.Картинка = Новый Картинка;
					КонецЕсли;	
				КонецЦикла;	
				//Если ЕстьВопросы = Истина Тогда
				//	Элементы.Поставщик.Картинка = БиблиотекаКартинок.уб_ОплатаВопрос;
				//Иначе	
				//	Элементы.Поставщик.Картинка = БиблиотекаКартинок.ВыполненоУспешно32;
				//КонецЕсли;	
				
				Если ЗначениеЗаполнено(Поставщик) Тогда
					
					Если СзПоставщиков.НайтиПоЗначению(Поставщик)= Неопределено ТОгда
						//!!!Сообщить("Для выбранного поставщика не найден действующий договор. Либо бланки давно не поступали. Проверьте внимательно",5);
						
					Иначе	
						//Элементы.Поставщик.Картинка = БиблиотекаКартинок.ВыполненоУспешно32;
					КонецЕсли;	
				КонецЕсли;	
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СК",СК);
		Запрос.УстановитьПараметр("ВидСП",ВидБСО);
		Запрос.Текст = "ВЫБРАТЬ
		|	влож.ОрганизацияАгент,
		|	ПРЕДСТАВЛЕНИЕ(влож.ОрганизацияАгент) КАК ОрганизацияАгентСтрока,
		|	влож.сортировка
		|ИЗ
		|	(ВЫБРАТЬ
		|		КонтрагентыВидыСП.Организация КАК ОрганизацияАгент,
		|		0 КАК сортировка
		|	ИЗ
		|		Справочник.Контрагенты.ВидыСП КАК КонтрагентыВидыСП
		|	ГДЕ
		|		КонтрагентыВидыСП.Ссылка = &СК
		|		И КонтрагентыВидыСП.ВидСП = &ВидСП
		|		И НЕ КонтрагентыВидыСП.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Организации.Ссылка,
		|		1
		|	ИЗ
		|		Справочник.Контрагенты.ВидыСП КАК КонтрагентыВидыСП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО (Организации.ПометкаУдаления = ЛОЖЬ)
		|	ГДЕ
		|		КонтрагентыВидыСП.Ссылка = &СК
		|		И КонтрагентыВидыСП.ВидСП = &ВидСП
		|		И КонтрагентыВидыСП.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Организации.Ссылка,
		|		2
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ВидыСП КАК КонтрагентыВидыСП
		|			ПО (КонтрагентыВидыСП.Ссылка = Контрагенты.Ссылка)
		|				И (КонтрагентыВидыСП.НомерСтроки = 1)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО (Организации.ПометкаУдаления = ЛОЖЬ)
		|	ГДЕ
		|		Контрагенты.Ссылка = &СК
		|		И КонтрагентыВидыСП.Ссылка ЕСТЬ NULL) КАК влож
		|
		|УПОРЯДОЧИТЬ ПО
		|	влож.сортировка,
		|	влож.ОрганизацияАгент.Наименование";
		Выборка = Запрос.Выполнить().Выбрать();
		СЗОргАгентов = Новый СписокЗначений;
		флЕстьСортировка2или3 = Ложь;
		Пока Выборка.Следующий() Цикл
			Если СЗОргАгентов.НайтиПоЗначению(Выборка.ОрганизацияАгент)  = Неопределено Тогда
				СЗОргАгентов.Добавить(Выборка.ОрганизацияАгент, Выборка.ОрганизацияАгентСтрока);				
				Если Выборка.Сортировка >= 2 Тогда 
					флЕстьСортировка2или3 = Истина;
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;	
		
		СЗОргАгентовКоличество = СЗОргАгентов.Количество();
		Если СЗОргАгентовКоличество = 0 Тогда
			ОрганизацияАгент = Неопределено;
			//ЗаполнитьИнфоПоставщик();
			Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;	
		ИначеЕсли СЗОргАгентовКоличество = 1 Тогда
			ОрганизацияАгент = СЗОргАгентов[0].Значение;
			Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Ложь;
			//Если СзПоставщиков.Количество() = 1 Тогда
			//	Поставщик = Выборка.Поставщик;
			//КонецЕсли;
		Иначе
			Если флЕстьСортировка2или3 = ЛОЖЬ Тогда
				ОрганизацияАгент = СЗОргАгентов[0].Значение;
			КонецЕсли;	
			//Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;
			//Если Не ОрганизацияАгент.Пустая() Тогда
			//	СтрокаТЗ = ТЗДоговоров.Найти(ОрганизацияАгент, "ОрганизацияАгент");
			//	Если СтрокаТЗ = Неопределено Тогда
			//		//ОрганизацияАгент = Неопределено;
			//		Сообщить(""+ОрганизацияАгент+" не найдена в действующих договорах по "+СК);
			//		ЗаполнитьИнфоПоставщик();
			//	КонецЕсли;
			//КонецЕсли;
			Элементы.ОрганизацияАгент.СписокВыбора = СЗОргАгентов;
			Элементы.ОрганизацияАгент.КнопкаСпискаВыбора = Истина;	
		КонецЕсли;
		
		
		//
		//Сообщить(1);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьСписки() 
	
	Элементы.СК.СписокВыбора.ЗагрузитьЗначения(уб_СЛ.ПолучитьСписокСК().ВыгрузитьЗначения());
	
	
	Элементы.ОрганизацияАгент.СписокВыбора.ЗагрузитьЗначения(уб_СЛ.ПолучитьСписокОрганизаций().ВыгрузитьЗначения());
	
	СЗ = Элементы.Состояние.СписокВыбора;
	Для каждого Эл из Перечисления.уб_СостояниеОформления Цикл
		
		
		Если Эл = Перечисления.уб_СостояниеОформления.КомплектОформлен 
			Тогда
			//Если ЭтоОтделБСО Тогда
			//Иначе
			Продолжить;
			//КонецЕсли;			
		ИначеЕсли Эл = Перечисления.уб_СостояниеОформления.Отказ Тогда
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоУстанавливатьОтказВСтрокеЗаявки, Ложь) = ЛОЖЬ Тогда
				Продолжить
			КонецЕсли;	
		Иначе
			//Продолжить;
		КонецЕсли;	
		
		СЗ.Добавить(Эл);
		
	КонецЦикла;	
	Если ЗначениеЗаполнено(Состояние) Тогда
		СЗ.Добавить(Перечисления.уб_СостояниеОформления.ПустаяСсылка(),"Убрать статус",,БиблиотекаКартинок.Удалить);
	КонецЕсли;	
	
	
	//СЗ = Новый СписокЗначений;
	//СЗ.Добавить("Да", 	"Да");
	//СЗ.Добавить("Нет",	"Нет");
	//Элементы.БезубыточныйПереход.СписокВыбора = СЗ;
	//Элементы.ОфициальнаяСкидка.СписокВыбора  = СЗ;
	//СЗ2 = Новый СписокЗначений;
	//СЗ2.Добавить(1,"1 взнос");
	//СЗ2.Добавить(2,"2 взноса");
	//СЗ2.Добавить(3,"3 взноса");
	//СЗ2.Добавить(4,"4 взноса");
	//Элементы.РассрочкаПлатежа.СписокВыбора = СЗ2;

	Элементы.Vin.СписокВыбора.Добавить("<ОТСУТСТВУЕТ>");
	
	
	Элементы.Оператор.СписокВыбора.ЗагрузитьЗначения(уб_ВызовСервера.СписокОператоров(Истина));
КонецПроцедуры	


&НаСервере
Функция ДанныеОбъекта()
	Возврат Новый Структура("Дата,Страхователь,Ссылка,ОбъектСтрахования",ДокументДата,ДокументСтрахователь,ДокументСсылка,ОбъектСтрахования);
КонецФункции


&НаКлиенте
Процедура OK(Команда)
	
	НомерБСО = уб_ВызовСервера.ПривестиНомерБСО(""+НомерБСО);
	
	Если ЗначениеЗаполнено(Vin) и ЗначениеЗаполнено(ОбъектСтрахования) = Ложь Тогда
		ОбъектСтрахования = уб_ВызовСервера.НайтиОбъектСтрахования(ВидБСО,vin,МаркаТС,МодельТС);
		Модифицированность = Истина;
	КонецЕсли;	
	
	Записать = Истина;
	//Из таблицы в реквизиты
	Если РассрочкаПлатежа >=1 Тогда
		ДатаОформления = тРасрочки[0].Дата;
		Взнос1Сумма = тРасрочки[0].Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=2 Тогда
		Взнос2Дата = тРасрочки[1].Дата;
		Взнос2Сумма = тРасрочки[1].Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=3 Тогда
		Взнос3Дата = тРасрочки[2].Дата;
		Взнос3Сумма = тРасрочки[2].Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=4 Тогда
		Взнос4Дата = тРасрочки[3].Дата;
		Взнос4Сумма = тРасрочки[3].Сумма;
	КонецЕсли;	
	
	Если Не фФраншиза Тогда
		уб_Клиент._УстановитьЗначение(ЭтаФорма,"Франшиза", 0);
	КонецЕсли;
	
	
	Если НеобходимоВыбратьКошелек Тогда
		СписокКошельков = Новый СписокЗначений;
		СписокКошельков.ЗагрузитьЗначения(Уб_Серверные.КартыСотрудники().Скопировать(Новый Структура("Сотрудник",ДокументМенеджер)).ВыгрузитьКолонку("Карта"));
		
		ВыбранныйКошелек = СписокКошельков.ВыбратьЭлемент("Выберите карту, по которой прошла оплата");
		
		Если Не ВыбранныйКошелек = Неопределено Тогда
			Кошелек = ВыбранныйКошелек.Значение;
			Записать = Истина;
			Модифицированность = Истина;
		КонецЕсли;	
		
		
	КонецЕсли;	
	
	//Если Не Записать И Модифицированность Тогда
	//	Ответ = Вопрос("Записать измененные данные?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	//	Записать = Ответ = КодВозвратаДиалога.Да;
	//КонецЕсли;
	Если Записать Тогда
		Отказ = Не ПроверитьОсновныеРеквизиты();
		Если Не Отказ Тогда
			Если Не уб_СЕРВЕРные.ПроверкаДат(ДатаНачала,Аддендум) Тогда
				Отказ = Истина;
				Стр = Новый СообщениеПользователю;
				Стр.Текст 	= "Проверьте дату начала";
				Стр.ПутьКДанным	= "ДатаНачала";
				Стр.Сообщить();
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ Отказ = Истина Тогда
			
			
			
			ДанныеСтроки = Новый Структура;
			Для каждого Рекв из уб_ВызовСервера.РеквизитыБСОЗаявки() Цикл
				Попытка
					ДанныеСтроки.Вставить(Рекв.Имя,ЭтаФорма[Рекв.Имя]);
				Исключение
				КонецПопытки;	
			КонецЦикла;
			ДанныеСтроки.Вставить("Техосмотр_ДатаВремя",    ЭтаФорма.Техосмотр_ДатаВремя);
			ДанныеСтроки.Вставить("Техосмотр_Наименование", ЭтаФорма.Техосмотр_Наименование);
			ДанныеСтроки.Вставить("Техосмотр_АдресТелефон", ЭтаФорма.Техосмотр_АдресТелефон);
			ДанныеСтроки.Вставить("БезубыточныйПереход",    ?(ЭтаФорма.БезубыточныйПереход = "Да", Истина, Ложь));
			ДанныеСтроки.Вставить("ОфициальнаяСкидка",      ?(ЭтаФорма.ОфициальнаяСкидка = "Да", Истина, Ложь));
			ДанныеСтроки.Вставить("ФормаОплаты",            ФормаОплаты);
			ДанныеСтроки.Вставить("ВидОплаты",              ВидОплаты);
			ДанныеСтроки.Вставить("ИтогСтраховаяПремия",       СуммаВзноса*1);
			ДанныеСтроки.Вставить("ИтогПредоставленнаяСкидка", ПредоставленнаяСкидка*1);
			ДанныеСтроки.Вставить("ЭтоНоваяСтрока", ЭтоНоваяСтрока);
			ОповеститьОВыборе(ДанныеСтроки);
			ЭтоНоваяСтрока = Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры



#Область ВспомогательныеФункции

&НаСервере
Процедура ТаблицаРасрочки()
	
	Пока тРасрочки.Количество() < РассрочкаПлатежа Цикл
		тРасрочки.Добавить();
	КонецЦикла;	
	
	Пока тРасрочки.Количество() > РассрочкаПлатежа Цикл
		тРасрочки.Удалить(тРасрочки.Количество()-1);
	КонецЦикла;
	
	Если РассрочкаПлатежа >=1 Тогда
		тРасрочки[0].Дата = ДатаОформления;
		тРасрочки[0].Сумма = Взнос1Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=2 Тогда
		тРасрочки[1].Дата = Взнос2Дата;
		тРасрочки[1].Сумма = Взнос2Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=3 Тогда
		тРасрочки[2].Дата = Взнос3Дата;
		тРасрочки[2].Сумма = Взнос3Сумма;
	КонецЕсли;	
	
	Если РассрочкаПлатежа >=4 Тогда
		тРасрочки[3].Дата = Взнос4Дата;
		тРасрочки[3].Сумма = Взнос4Сумма;
	КонецЕсли;	
КонецПроцедуры	


Процедура ОбновитьОтображениеФайлов()
	КартинкаЗеленая = БиблиотекаКартинок.уз_Активирован;
	КартинкаКрасная = БиблиотекаКартинок.уз_НеАктивирован;
	// сразу подговим ТЗ как оно будет потом
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Имя", 			Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	ТЗ.Колонки.Добавить("Вид",			Новый ОписаниеТипов("СправочникСсылка.уб_ВидыДокументовКПолисам"));
	ТЗ.Колонки.Добавить("Расширение",   Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	ТЗ.Колонки.Добавить("Картинка",		Новый ОписаниеТипов("Картинка"));
	//признак хранение файлов в регистре
	мХранФайловРег = ЛОЖЬ;
	//
	Если Не ПустаяСтрока(Расчетчик) Тогда
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Имя = Расчетчик;
		СтрокаТЗ.Вид = Справочники.уб_ВидыДокументовКПолисам.РасчетныйЛист;
		мХранФайловРег = ТипЗнч(Расчетчик) = Тип("Строка") ИЛИ мХранФайловРег;
	КонецЕсли;
	Если Не ПустаяСтрока(ДопСоглашение) Тогда
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Имя = ДопСоглашение;
		СтрокаТЗ.Вид = Справочники.уб_ВидыДокументовКПолисам.ДопСоглашение;
		мХранФайловРег = ТипЗнч(Расчетчик) = Тип("Строка") ИЛИ мХранФайловРег;
	КонецЕсли;
	Если Не ПустаяСтрока(ДругиеДокументы) Тогда
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Имя = ДругиеДокументы;
		СтрокаТЗ.Вид = Справочники.уб_ВидыДокументовКПолисам.Прочее;
		мХранФайловРег = ТипЗнч(Расчетчик) = Тип("Строка") ИЛИ мХранФайловРег;
	КонецЕсли;
	Если ТЗ.Количество() > 0 Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Источник.Имя КАК Имя,
		|	Источник.Вид КАК Вид
		|ПОМЕСТИТЬ ВТ_Источник
		|ИЗ
		|	&Источник КАК Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ф.УИД КАК УИД,
		|	Ф.ФайлИмя КАК ФайлИмя,
		|	Ф.ФайлРасширение КАК ФайлРасширение
		|ИЗ
		|	ВТ_Источник КАК ВТ_Источник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК Ф
		|		ПО ВТ_Источник.Имя = Ф.УИД");
		Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА 
			И НЕ мХранФайловРег тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	Источник.Имя КАК Имя,
			|	Источник.Вид КАК Вид
			|ПОМЕСТИТЬ ВТ_Источник
			|ИЗ
			|	&Источник КАК Источник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уб_ФайлыКПолисам.Ссылка КАК УИД,
			|	уб_ФайлыКПолисам.ФайлИмя КАК ФайлИмя,
			|	уб_ФайлыКПолисам.ФайлРасширение КАК ФайлРасширение
			|ИЗ
			|	ВТ_Источник КАК ВТ_Источник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|		ПО ВТ_Источник.Имя = уб_ФайлыКПолисам.Ссылка";	
		КонецЕсли;
		Запрос.УстановитьПараметр("Источник", ТЗ);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЗ = ТЗ.Найти(Выборка.УИД, "Имя");
				СтрокаТЗ.Имя 		= Выборка.ФайлИмя;
				СтрокаТЗ.Расширение = Выборка.ФайлРасширение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	СоответствиеКартинок = Новый Соответствие;
	СоответствиеКартинок.Вставить("xls", 	БиблиотекаКартинок.ПиктограммаФайла_Excel);
	СоответствиеКартинок.Вставить("xlsx", 	БиблиотекаКартинок.ПиктограммаФайла_Excel);
	СоответствиеКартинок.Вставить("xlsm", 	БиблиотекаКартинок.ПиктограммаФайла_Excel);
	СоответствиеКартинок.Вставить("pdf", 	БиблиотекаКартинок.уб_ПиктограммаФайла_PDF);
	СоответствиеКартинок.Вставить("doc", 	БиблиотекаКартинок.ПиктограммаФайла_Word);
	СоответствиеКартинок.Вставить("docx", 	БиблиотекаКартинок.ПиктограммаФайла_Word);
	// расчетчик
	СтрокаТЗ = ТЗ.Найти(Справочники.уб_ВидыДокументовКПолисам.РасчетныйЛист, "Вид");
	Структура = Новый Структура;
	Структура.Вставить("Картинка");
	Структура.Вставить("Значение");
	Если СтрокаТЗ = Неопределено Тогда
		ВидимостьКнопкиСохранения = Ложь;
		Структура.Картинка = КартинкаКрасная;
		Структура.Значение = "";
	Иначе
		ВидимостьКнопкиСохранения = Истина;
		Если ПустаяСтрока(СтрокаТЗ.Расширение) Тогда
			СтрокаТЗ.Расширение = уб_СЛ.ОпределитьРасширениеФайла(СтрокаТЗ.Имя, Ложь);
		КонецЕсли;
		СтрокаТЗ.Картинка = СоответствиеКартинок.Получить(СтрокаТЗ.Расширение);
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Картинка) Тогда
			СтрокаТЗ.Картинка = КартинкаЗеленая;
		КонецЕсли;
		Структура.Картинка = СтрокаТЗ.Картинка;
		Структура.Значение = СтрокаТЗ.Расширение;
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(Элементы.СостояниеРасчетчик, Структура);
	//Элементы.СохранитьРасчетчик.Видимость = ВидимостьКнопкиСохранения;
	// доп соглашение
	СтрокаТЗ = ТЗ.Найти(Справочники.уб_ВидыДокументовКПолисам.ДопСоглашение, "Вид");
	Структура = Новый Структура;
	Структура.Вставить("Картинка");
	Структура.Вставить("Значение");
	Если СтрокаТЗ = Неопределено Тогда
		ВидимостьКнопкиСохранения = Ложь;
		Структура.Картинка = КартинкаКрасная;
		Структура.Значение = "";
	Иначе
		ВидимостьКнопкиСохранения = Истина;
		Если ПустаяСтрока(СтрокаТЗ.Расширение) Тогда
			СтрокаТЗ.Расширение = уб_СЛ.ОпределитьРасширениеФайла(СтрокаТЗ.Имя, Ложь);
		КонецЕсли;
		СтрокаТЗ.Картинка = СоответствиеКартинок.Получить(СтрокаТЗ.Расширение);
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Картинка) Тогда
			СтрокаТЗ.Картинка = КартинкаЗеленая;
		КонецЕсли;
		Структура.Картинка = СтрокаТЗ.Картинка;
		Структура.Значение = СтрокаТЗ.Расширение;
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(Элементы.СостояниеДопСоглашение, Структура);
	//Элементы.СохранитьДопСоглашение.Видимость = ВидимостьКнопкиСохранения;
	// другие документы
	СтрокаТЗ = ТЗ.Найти(Справочники.уб_ВидыДокументовКПолисам.Прочее, "Вид");
	Структура = Новый Структура;
	Структура.Вставить("Картинка");
	Структура.Вставить("Значение");
	Если СтрокаТЗ = Неопределено Тогда
		ВидимостьКнопкиСохранения = Ложь;
		Структура.Картинка = КартинкаКрасная;
		Структура.Значение = "";
	Иначе
		ВидимостьКнопкиСохранения = Истина;
		Если ПустаяСтрока(СтрокаТЗ.Расширение) Тогда
			СтрокаТЗ.Расширение = уб_СЛ.ОпределитьРасширениеФайла(СтрокаТЗ.Имя, Ложь);
		КонецЕсли;
		СтрокаТЗ.Картинка = СоответствиеКартинок.Получить(СтрокаТЗ.Расширение);
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Картинка) Тогда
			СтрокаТЗ.Картинка = КартинкаЗеленая;
		КонецЕсли;
		Структура.Картинка = СтрокаТЗ.Картинка;
		Структура.Значение = СтрокаТЗ.Расширение;
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(Элементы.СостояниеДругиеДокументы, Структура);
	//Элементы.СохранитьДругиеДокументы.Видимость = ВидимостьКнопкиСохранения;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция МассивВидов()
	
	МассивВидов = Новый  Массив;
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.Паспорт);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ПТС);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.СвидетельствоОРегистрации);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ВодительскоеУдостоверение);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.Полис);	
	//МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ЗаявлениеНаСтрахованиеКАСКО);	
	//МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ЗаявлениеНаСтрахованиеОСАГО);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ТалонОсмотр);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ДиагностикаКарты);	
	МассивВидов.Добавить(Справочники.уб_ВидыДокументовКПолисам.ПустаяСсылка());	
	Возврат МассивВидов
КонецФункции

&НаСервереБезКонтекста
Функция МаркаИМодельОбязательна(ВидБСО,ДокументДата)
	
	Возврат //(ВладелецФормы.Тип = Перечисления.уб_ТипВыезда.ПервичныйОсмотр) Или 
	Справочники.уб_МаркиТС.ТребуетсяЗаполнениеМаркиМодели(ВидБСО,ДокументДата);
	
КонецФункции // МаркаИМодельОбязательна()

&наКлиенте
Процедура ПолучитьИндексПродуктаИОбновитьНадписьОшибкиВидаБСО()
	
	ОписаниеОшибки = "";
	ИндексТипаПродукта = ИндексТипаПродуктаПоВидуБСОДляНастройкиПолей(ОписаниеОшибки);
	Уб_Клиент._УстановитьЗначение(ЭтаФорма,"ОшибкаВидаБСО", ОписаниеОшибки);
	//ЭлементыФормы.НадписьОшибкаВидаБСО.Видимость = Не ПустаяСтрока(ОшибкаВидаБСО);
	
КонецПроцедуры

//0 - все поля блокированы (не заполнен вид БСО)
//1 - доступно только количество (карточки или квитанции без рассрочки)
//2 - только основные (сумма, премия) - для всех
//3 - + расчетчик (ОСАГО, ДСАГО)
//4 - все поля доступны (КАСКО) или квитанции с рассрочкой
&НаКлиенте
Функция ИндексТипаПродуктаПоВидуБСОДляНастройкиПолей(ОписаниеОшибки = "")
	
	Если Не ЗначениеЗаполнено(ВидБСО) 
		Или ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_СтраховыеПродукты") Тогда
		Результат = 0;
		Если ЗначениеЗаполнено(ВидБСО) Тогда
			//выбран страховой продукт
			ОписаниеОшибки = "В поле 'ВидБСО' выбран страховой продукт. Требуется очистить значение поля и выбрать нужный вид БСО.";
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ВидБСО) 
		Или ТипЗнч(ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда	
		Если  ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО")
			ИЛИ ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО")
			или ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.КаскоПП")
			Тогда
			Возврат 4;
		ИначеЕсли  ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО")
			ИЛИ ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО")
			ИЛИ ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ДСАГО")
			или ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.Бесполисные")
			Тогда
			Возврат 3;
		Иначе
			Возврат 2;
		КонецЕсли;
	Иначе
		
		Если Строка(ВидБСО) = "Приглашение на ТО" Тогда
			Возврат 5;
		КонецЕсли;
		Результат = РезультатПоВидуБСО(ВидБСО,РассрочкаПлатежа,ОписаниеОшибки);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ТипПродуктаПоВидуБСО()


&НаСервереБезКонтекста
Функция РезультатПоВидуБСО(ВидБСО,РассрочкаПлатежа,ОписаниеОшибки)
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
		|				КОГДА СП.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Карточка)
		|						ИЛИ СП.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.СпецзнакОСАГО)
		|					ТОГДА 1
		|				КОГДА СП.ВидБСО.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7)
		|					ТОГДА ВЫБОР
		|							КОГДА &Рассрочка
		|								ТОГДА 4
		|							ИНАЧЕ 1
		|						КОНЕЦ
		|				КОГДА СП.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
		|					ТОГДА 4
		|				КОГДА СП.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
		|						ИЛИ СП.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДСАГО)
		|					ТОГДА 3
		|				ИНАЧЕ 2
		|			КОНЕЦ), 0) КАК Индекс
		|ИЗ
		|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
		|ГДЕ
		|	НЕ СП.Ссылка.ПометкаУдаления
		|	И СП.ВидБСО = &ВидБСО");
		Запрос.УстановитьПараметр("ВидБСО", 	ВидБСО);
		Запрос.УстановитьПараметр("Рассрочка",  НЕ РассрочкаПлатежа = 1);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Результат = 0
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.Индекс = 0 Тогда
				//возможно нет страховых продуктов по БСО
				//тогда определяем индекс по типу
				Прч = Перечисления.уб_ТипыБСО;
				Тип = ВидБСО.Тип;
				ОписаниеОшибкиНетВПродукте = "Вид БСО '" + ВидБСО + "' не включен ни в один страховой продукт!";
				Если Тип.Пустая() Тогда
					Результат = 0;
					ОписаниеОшибки = "Не заполнен тип бланка БСО '" + ВидБСО + "'! (полис, карточка или проч). 
					|" + ОписаниеОшибкиНетВПродукте + "
					|Обратитесь в отдел БСО для исправления ошибки";
				Иначе
					ОписаниеОшибки = ОписаниеОшибкиНетВПродукте + " Обратитесь в отдел БСО для исправления ошибки.";
					//Если Тип = Прч.Полис Или Тип = Прч.ПолисОсаго Тогда
					//	Результат = 3;
					//Иначе
					Если Тип = Прч.КвитанцияА7 Тогда
						Результат = ?(РассрочкаПлатежа > 1, 4, 1);
					Иначе
						Результат = 1
					КонецЕсли;
				КонецЕсли;
			Иначе
				//Если Найти(ВидБСО,"Техосмотр")>0 Тогда
				//	Результат = 1;
				//Иначе	
				Результат = Выборка.Индекс;
				//КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		Возврат Результат
	КонецФункции	



&НаКлиенте
Процедура ЗаполнитьМаркуИМодельЕслиЗаполненыВОбъекте()
	
	//Получаем марку и модель по владельцу для КАСКО, ОСАГО, ДСАГО
	//Если ЭтоНоваяСтрока И ИндексТипаПродукта > 2 И Не ЗначениеЗаполнено(МаркаТС) И Не ЗначениеЗаполнено(МодельТС) Тогда
	//	БСО = ВладелецФормы.Объект.БСО;
	//	Если БСО.Количество() > 1 Тогда
	//		_МаркаТС 	= Неопределено;
	//		_МодельТС   = Неопределено;
	//		_Vin = Неопределено;
	//		_ОбъектСтрахования = Неопределено;
	//		Для Каждого СтрокаТЧ Из БСО Цикл
	//			Если Не СтрокаТЧ.МаркаТС.Пустая() И Не СтрокаТЧ.МодельТС.Пустая() Тогда
	//				Если _МаркаТС = Неопределено И _МодельТС = Неопределено Тогда
	//					_МаркаТС 	= СтрокаТЧ.МаркаТС;
	//					_МодельТС   = СтрокаТЧ.МодельТС;
	//					_Vin              = СтрокаТЧ.Vin;
	//					_ОбъектСтрахования= СтрокаТЧ.ОбъектСтрахования;
	//				ИначеЕсли СтрокаТЧ.МаркаТС <> _МаркаТС Или СтрокаТЧ.МодельТС <> _МодельТС Тогда
	//					//уже выбраны различные ТС - нечего подставлять
	//					_МаркаТС 	= Неопределено;
	//					_МодельТС   = Неопределено;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если _МаркаТС <> Неопределено И _МодельТС <> Неопределено Тогда
	//			МаркаТС 	= _МаркаТС;
	//			МодельТС 	= _МодельТС;
	//			Vin = _Vin;
	//			ОбъектСтрахования = _ОбъектСтрахования;
	//			Элементы.МаркаТС.ОтметкаНезаполненного 	= Ложь;
	//			Элементы.МодельТС.ОтметкаНезаполненного    = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОсновныеРеквизиты()
	ОчиститьСообщения();
	Стр = Неопределено;
	
	ВладелецФормыДата = ДокументДата;
	Если СК.Пустая() Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнена СК!";
		Стр.ПутьКДанным	= "СК";
		Стр.Сообщить();
	КонецЕсли;
	Если Поставщик.Пустая() Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнен Поставщик!";
		Стр.ПутьКДанным	= "Поставщик";
		Стр.Сообщить();
	КонецЕсли;
	
	Если ФормаОплаты.Пустая() Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнена форма оплаты!";
		Стр.ПутьКДанным	= "ВидОплаты";
		Стр.Сообщить();
	КонецЕсли;

	
	Если ОрганизацияАгент.Пустая() Тогда
		//ОрганизацияАгент = ПоследнийОргАгент();
			Стр 			= Новый СообщениеПользователю;
			Стр.Текст 	= "Не указано юрлицо Страхового агенства";
			Стр.ПутьКДанным	= "ОрганизацияАгент";
			Стр.Сообщить();
		//	Отказ = Истина;
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(ВидБСО) = ЛОЖЬ Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнен вид БСО!";
		Стр.ПутьКДанным	= "ВидБСО";
		Стр.Сообщить();
	Иначе//Значен ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
		ЛимитОтветственностиДоступность = Не Элементы.ЛимитОтветственности.ТолькоПросмотр;
		СтраховаяПремияДоступность 		= Не Элементы.СтраховаяПремия.ТолькоПросмотр;
		Если ВладелецФормыДата = '00010101000000' Или ВладелецФормыДата > '20130710000000' Тогда//10 июля 2013
			Если ТипЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
				ВидБСОТип = уб_вызовСервера.ЗначениеРеквизитаОбъекта(ВидБСО,"Тип");
			Иначе
				Если ВидБСО = ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО") Тогда
					ВидБСОТип = ПредопределенноеЗначение("Перечисление.уб_ТипыБСО.ПолисОсаго")
				Иначе
					ВидБСОТип = ПредопределенноеЗначение("Перечисление.уб_ТипыБСО.Полис")
				КонецЕсли;	
			КонецЕсли;	
			Если (ВидБСОТип = ПредопределенноеЗначение("Перечисление.уб_ТипыБСО.Полис") Или ВидБСОТип = ПредопределенноеЗначение("Перечисление.уб_ТипыБСО.ПолисОсаго")) 
				и Не ИндексТипаПродукта = 5 Тогда
				Если ЛимитОтветственности = 0 И ЛимитОтветственностиДоступность Тогда
					Стр = Новый СообщениеПользователю;
					Стр.Текст 	= "Не заполнен лимит ответственности!";
					Стр.ПутьКДанным	= "ЛимитОтветственности";
					Стр.Сообщить();
				КонецЕсли;
				Если СтраховаяПремия = 0 И СтраховаяПремияДоступность Тогда
					Стр = Новый СообщениеПользователю;
					Стр.Текст 	= "Не заполнена страховая премия!";
					Стр.ПутьКДанным	= "СтраховаяПремия";
					Стр.Сообщить();
				КонецЕсли;
				Если тРасрочки.Итог("Сумма")<>СтраховаяПремия Тогда
					Стр = Новый СообщениеПользователю;
					Стр.Текст	= "Сумма взносов не равна Полной премии!";
					Стр.ПутьКДанным	= "тРасрочки";
					Стр.Сообщить();
				КонецЕсли;	
				
				Если СуммаВзноса = 0  Тогда
					Стр = Новый СообщениеПользователю;
					Стр.Текст	= "Не заполнена сумма взноса!";
					Стр.ПутьКДанным	= "СуммаВзноса";
					Стр.Сообщить();
				Иначе	
					Если тРасрочки.НайтиСтроки(Новый Структура("Сумма",СуммаВзноса)).Количество() = 0  Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст	= "Указанная сумма взноса не найдена в таблице рассрочки!";
						Стр.ПутьКДанным	= "СуммаВзноса";
						Стр.Сообщить();
					КонецЕсли;
				КонецЕсли;
				
				
				
				//Если РассрочкаПлатежа = 1 Тогда
					//Если СуммаВзноса = 0 или Взнос2Сумма = 0 Тогда
					//	Стр = Новый СообщениеПользователю;
					//	Стр.Текст	= "Не заполнена сумма взноса!";
					//	Стр.ПутьКДанным	= "СуммаВзноса; Стр.Сообщить();
					//КонецЕсли;	
				//КонецЕсли;	
				
				ПроверятьНовые = ВладелецФормыДата > '20131001'; //1 октября
				Если ПроверятьНовые Тогда
					Если фФраншиза И Франшиза = 0 Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст 	= "Не указана сумма франшизы!";
						Стр.ПутьКДанным = "Франшиза";
						Стр.Сообщить();
					КонецЕсли;
					Если БезубыточныйПереход = "" Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст 	= "Не указан безубыточный период!";
						Стр.ПутьКДанным = "БезубыточныйПереход";
						Стр.Сообщить();
					КонецЕсли;
					//Если ОфициальнаяСкидка = "" Тогда
					//	Стр = Новый СообщениеПользователю;
					//	Стр.Текст 	= "Не указан тип скидки !";
					//	Стр.ПутьКДанным = "ОфициальнаяСкидка; Стр.Сообщить();
					//КонецЕсли;
					//Если РассрочкаПлатежа = 2 Тогда
					//	Стр = Новый СообщениеПользователю;
					//	Стр.Текст 	= "Не указана рассрочка платежа!";
					//	Стр.ПутьКДанным	= "РассрочкаПлатежа; Стр.Сообщить();
					//КонецЕсли;
					
					//Если (ПустаяСтрока(Расчетчик) И ДокументОбъект.СписокФайлов.НайтиСтроки(НОвый Структура("УидСтроки",УидСтроки)).Количество() = 0) И РасчетчикОбязателен() Тогда
					//	Стр = Новый СообщениеПользователю;
					//	Стр.Текст	= "Не заполнен расчетчик!";
					//	Стр.ПутьКДанным	= "Расчетчик; Стр.Сообщить();
					//КонецЕсли;
					
				КонецЕсли;
				Если МаркаИМодельОбязательна(ВидБСО,ДокументДата) Тогда
					
					Если НЕ уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке,уб_ЗП_ПолныйДоступ") Тогда
						Если МаркаТС.Пустая() Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст	= "Не заполнена марка транспортного средства!";
							Стр.ПутьКДанным	= "МаркаТС";
							Стр.Сообщить();
						КонецЕсли;
						Если МодельТС.Пустая() Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст	= "Не заполнена модель транспортного средства!";
							Стр.ПутьКДанным	= "МодельТС";
							Стр.Сообщить();
						КонецЕсли;
						
						Если ПустаяСтрока(Vin) Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст	= "Не заполнен vin объекта страхования!";
							Стр.ПутьКДанным	= "vin";
							Стр.Сообщить();
						ИначеЕсли НЕ Vin ="<ОТСУТСТВУЕТ>" и СтрДлина(Vin)<>17 Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст	= "Vin объекта страхования не равен 17 символов!";
							Стр.ПутьКДанным	= "vin";
							Стр.Сообщить();
						КонецЕсли;
						Если ОбъектСтрахования.Пустая() Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст	= "Не найден Объект страхования!";
							Стр.ПутьКДанным	= "ОбъектСтрахования";
							Стр.Сообщить();
						КонецЕсли;
					КонецЕсли;
					
					//Если Состояние = Перечисления.уб_СостояниеОформления.КомплектОформлен или Состояние = Перечисления.уб_СостояниеОформления.Печать Тогда	
					//	
					//КонецЕсли;	
					
				КонецЕсли;
			ИначеЕсли ИндексТипаПродукта = 5 Тогда	
				
				Если НЕ уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке,уб_ЗП_ПолныйДоступ") Тогда
					Если МаркаТС.Пустая() Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст	= "Не заполнена марка транспортного средства!";
						Стр.ПутьКДанным	= "МаркаТС";
						Стр.Сообщить();
					КонецЕсли;
					Если МодельТС.Пустая() Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст	= "Не заполнена модель транспортного средства!";
						Стр.ПутьКДанным	= "МодельТС";
						Стр.Сообщить();
					КонецЕсли;
				КонецЕсли;
				Если СтраховаяПремия = 0 И СтраховаяПремияДоступность Тогда
					Стр = Новый СообщениеПользователю;
					Стр.Текст 	= "Не заполнена страховая премия!";
					Стр.ПутьКДанным	= "СтраховаяПремия";
					Стр.Сообщить();
				КонецЕсли;
			КонецЕсли;
			Если НЕ уб_Кэшируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
				Если Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.Печать")  Тогда
					Если ПустаяСтрока(НомерБСО) Тогда
						Стр = Новый СообщениеПользователю;
						Стр.Текст 	= "Не заполнен номер бланка полиса!";
						Стр.ПутьКДанным	= "НомерБСО";
						Стр.Сообщить();
					Иначе	
					КонецЕсли;
				КонецЕсли;	
				
				Если Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.КомплектОформлен") 
					ИЛИ Состояние = ПредопределенноеЗначение("Перечисление.уб_СостояниеОформления.Печать") Тогда	
					Если МаркаИМодельОбязательна(ВидБСО,ДокументДата) Тогда
						Если ПустаяСтрока(Vin) Тогда
							Стр = Новый СообщениеПользователю;
							Стр.Текст 	= "Не заполнен Vin!";
							Стр.ПутьКДанным	= "Vin";
							Стр.Сообщить();
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
	
	//Если Состояние = Перечисления.уб_СостояниеОформления.КомплектОформлен или Состояние = Перечисления.уб_СостояниеОформления.Печать Тогда	
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнена дата начала полиса!";
		Стр.ПутьКДанным	= "ДатаНачала";
		Стр.Сообщить();
	Иначе	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не заполнена дата окончания полиса!";
		Стр.ПутьКДанным	= "ДатаОкончания";
		Стр.Сообщить();
	Иначе	
	КонецЕсли;
	
	
	ПриведеннаяДатаНачала = ДатаНачала-70*3600*24;
	Если ЗначениеЗаполнено(ДатаОформления) Тогда
		Если ДатаОформления>=ПриведеннаяДатаНачала и ДатаОформления<=ДатаОкончания Тогда
		Иначе
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Дата взноса не входит в период действия полиса!";
			Стр.ПутьКДанным	= "тРасрочки";
			Стр.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(Взнос2Дата) Тогда
		Если Взнос2Дата>=ПриведеннаяДатаНачала и Взнос2Дата<=ДатаОкончания Тогда
		Иначе
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Дата второго взноса не входит в период действия полиса!";
			Стр.ПутьКДанным	= "тРасрочки";
			Стр.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Взнос3Дата) Тогда
		Если Взнос3Дата>=ПриведеннаяДатаНачала и Взнос3Дата<=ДатаОкончания Тогда
		Иначе
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Дата третьего взноса не входит в период действия полиса!";
			Стр.ПутьКДанным	= "тРасрочки";
			Стр.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Взнос4Дата) Тогда
		Если Взнос4Дата>=ПриведеннаяДатаНачала и Взнос4Дата<=ДатаОкончания Тогда
		Иначе
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Дата четвертого взноса не входит в период действия полиса!";
			Стр.ПутьКДанным	= "тРасрочки";
			Стр.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	
	//КонецЕсли;
	
	Если КВБрокераПлан = 0 и ДокументДата >Дата(2015,8,25) и МинимальнаяСумма=0 и ИндексТипаПродукта<>1//ДокументОбъект.Банк <> Справочники.Банки.ПустаяСсылка() 
		Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст	= "Не указано КВ брокера";
		Стр.ПутьКДанным	= "КВБрокераПлан";
		Стр.Сообщить();
		//Предупреждение("Не указано КВ брокера");
		//Возврат
	КонецЕсли;	
	
	ЕстьОшибки = НЕ Стр = Неопределено;
	Возврат ЕстьОшибки = Ложь;
	
КонецФункции // ПроверитьОсновныеРеквизиты()



#КонецОбласти

#Область ОплатыДубльСформы

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	Если ВидОплаты ="В страховую -3%(потерянная сумма)" и Элемент<>Неопределено Тогда
		Предупреждение("Вычет 3% из-за налога НДС для юр лиц. Поменяй способ оплаты!");
	КонецЕсли;	
	уб_Клиент.ЗаполнитьФормуОплатыИКошелек(ВидОплаты,ЭтаФорма,ПодразделениеМенеджера,ДокументМенеджер);
	НастройкиПолей();
КонецПроцедуры

&НаСервере
Процедура ПодобратьВидОплаты(Форма,_ЭтотОбъект) Экспорт
	Если ВидОплаты = "" И ЗначениеЗаполнено(_ЭтотОбъект.ФормаОплаты) Тогда
		
		Если _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал Тогда
			ВидОплаты = "На р\с в КПП (0%)";
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Тогда
			ВидОплаты = "Наличными (0%)";
			//ИначеЕсли ФормаОплаты = Перечисления.уб_ФормыОплаты.ВКредит Тогда
			//	ВидОплаты = "В кредит (0%)";	
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.НаКарту Тогда
			Если ЗначениеЗаполнено(_ЭтотОбъект.Кошелек) Тогда
				ВидОплаты = "На карту "+ СокрЛП(_ЭтотОбъект.Кошелек) +"(0%)";		
			Иначе	
				ВидОплаты = "На карту (0%)";		
			КонецЕсли;	
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПоСсылкеБрокеру Тогда
			ВидОплаты = "По ссылке в КПП (3%)";			
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
			ВидОплаты = "В страховую -3%(потерянная сумма)";				
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Терминал Тогда
			ВидОплаты = "Терминал (3%)";	
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПоQR Тогда
			ВидОплаты = "По QR коду (0%)";		
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры





&НаСервереБезКонтекста
Функция АдресКартинки(ПолноеИмя, ПустотуЕслиНЕТ = Ложь,ПростоФайл = ЛОЖЬ)
	Если ПростоФайл = Истина Тогда
		Картинка = Новый ДвоичныеДанные(ПолноеИмя);
	Иначе	
		тзКартинок = уб_СЛ.СконвертироватьОдинФайл(ПолноеИмя);
		Если тзКартинок.Количество()>0 Тогда
			Картинка = тзКартинок[0].Картинка.ПолучитьДвоичныеДанные(ЛОЖЬ);
			
		Иначе
			Если ПустотуЕслиНЕТ = Истина Тогда
				Возврат "";
			Иначе	
				Картинка= Новый Картинка;
				//Картинка = Картинка.ПолучитьДвоичныеДанные(Истина);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(Картинка,Новый УникальныйИдентификатор);
КонецФункции


&НаСервере
Процедура ПроверитьВыполнениеУсловийСвязанныхБСО()
	
	ЕстьСкидка 	= ПредоставленнаяСкидка > 0;
	Личная		= ДокументСсылка.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная;
	ПривязанныеКСтроке = ДокументСсылка.БСО.Выгрузить(Новый Структура("УидРодителя",УидСтроки));
	Для Каждого СтрокаТЗ Из СвязанныеБСО Цикл
		Если Найти(СтрокаТЗ.БСО,"Договор")>0 или Найти(СтрокаТЗ.БСО,"Скидка") Тогда
			//ПоказатьОповещениеПользователя("Пропущен бланк "+СтрокаТЗ.БСО);
			Продолжить;
		КонецЕсли;
		нСтроки = ПривязанныеКСтроке.НайтиСтроки(Новый Структура("ВидБСО",СтрокаТЗ.БСО));
		
		Если нСтроки.Количество()>0 Тогда
			//Восстановление
			СтрокаТЗ.Добавить = Истина;
			СтрокаТЗ.ПлановаяСтоимость = нСтроки[0].ИтогСтраховаяПремия;
		КонецЕсли;
		//	//уже есть привязанное
		
		//	
		//Иначе
		
		
		//Если ЭтоНоваяСтрока ИЛИ Модифицированность = Истина  Тогда
		
		//Проверки
		ДолжноПоСкидке = СтрокаТЗ.УсловиеДобавления = "Всегда" 
		ИЛИ (СтрокаТЗ.УсловиеДобавления = "Наличие скидки" И ЕстьСкидка)
		ИЛИ (СтрокаТЗ.УсловиеДобавления = "Отсутствие скидки" И ЕстьСкидка = Ложь)
		ИЛИ (СтрокаТЗ.Добавить = Истина и СтрокаТЗ.УсловиеДобавления = "Вручную");//Добавлено руками. автоматика не работает
		
		ДолжноПоВидуЗаявки = СтрокаТЗ.УсловиеВидаЗаявокЛичная = "Все" 
		ИЛИ ПустаяСтрока(СтрокаТЗ.УсловиеВидаЗаявокЛичная)
		ИЛИ (СтрокаТЗ.УсловиеВидаЗаявокЛичная = "Личные" и Личная = Истина) 
		ИЛИ (СтрокаТЗ.УсловиеВидаЗаявокЛичная = "Не личные" и Личная = ЛОЖЬ); 
		
		Если (ДолжноПоСкидке И ДолжноПоВидуЗаявки) <> СтрокаТЗ.Добавить Тогда
			СтрокаТЗ.Добавить = (ДолжноПоСкидке И ДолжноПоВидуЗаявки);
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнфоПоставщик(Параметры = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Текст = ""
	Иначе
		Если Параметры.Поставщик = СК Тогда
			ДопТекстПоставщик = ""
		Иначе
			ДопТекстПоставщик = "'" + Параметры.ПоставщикСтрока + "' ";
		КонецЕсли;
		Если ПустаяСтрока(параметры.НаименованиеДоговора) Тогда
			ДопТекстДоговор = "";
		Иначе
			ДопТекстДоговор = Параметры.НаименованиеДоговора + ?(ЗначениеЗаполнено(Параметры.ДатаЗаключенияДоговора), " от " + Формат(Параметры.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy") + " г.", "");
		КонецЕсли;
		Текст = ДопТекстПоставщик + ?(ДопТекстДоговор = "", "", ДопТекстДоговор);
	КонецЕсли;
	Элементы.ИнфоПоставщик.Заголовок = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерБСОПриИзменении(Элемент)
	НомерБСО = уб_ВызовСервера.ПривестиНомерБСО(""+НомерБСО);
КонецПроцедуры


#КонецОбласти
