Функция ПустаяТЗ() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Фильтр");
	ТЗ.Колонки.Добавить("Показатель");
	ТЗ.Колонки.Добавить("Значение");
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("Агент");
	ТЗ.Колонки.Добавить("Личная");
	ТЗ.Колонки.Добавить("ВидСП");
	ТЗ.Колонки.Добавить("Подразделение");
	ТЗ.Колонки.Добавить("НаправлениеПлатежа");
	ТЗ.Колонки.Добавить("Организация");
	//для сортировки и настройки отчета
	ТЗ.Колонки.Добавить("ТипЗначения", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТЗ.Колонки.Добавить("Сортировка");
	ТЗ.Колонки.Добавить("РасчетПо"); // 0 - по сумме, 1 - по средней
	ТЗ.Колонки.Добавить("Динамика"); // Истина - по динамике, Ложь - нет	
	//ТЗ.Индексы.Добавить("Показатель");
	//ТЗ.Индексы.Добавить("Агент");
	//ТЗ.Индексы.Добавить("ВидСП");
	//ТЗ.Индексы.Добавить("Личная");
	//ТЗ.Индексы.Добавить("Организация");
	//ТЗ.Индексы.Добавить("Подразделение");
	//ТЗ.Индексы.Добавить("ФормаОплаты");
 	Возврат ТЗ;	
	
КонецФункции