//Перем СчетчикМесяцев;

Функция ПолучитьТЗ() Экспорт
	
	тз = Отчеты.уб_СтатистикаПоСтраховкам.ПустаяТЗ();
	
	СчетчикМесяцев = 1;
	//получаем количество месяцев установленных периодов
	Пока Истина Цикл
		Если НачалоПериода < ДобавитьМесяц(НачалоМесяца(КонецПериода), - (СчетчикМесяцев - 1)) Тогда
			СчетчикМесяцев = СчетчикМесяцев + 1
		ИначеЕсли НачалоПериода = ДобавитьМесяц(НачалоМесяца(КонецПериода), - (СчетчикМесяцев - 1)) Тогда
			Прервать
		Иначе
			Сообщить("Неверный зарплатный период!");
			Возврат тз;
		КонецЕсли;
	КонецЦикла;
	
	кЛичнаяЗаявка = Перечисления.уб_ВидыЗаявок.Личная;	 
	кРасчетПоАВ = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.ЗарплатныйПериод КАК Период,
	|	СУММА(Т.ЭтоОплата) КАК ВсегоОплат,
	|	СУММА(Т.Новая) КАК НовыхПолисов,
	|	СУММА(Т.ОплатаДоПереданной) КАК ОплатДоПереданной,
	|	СУММА(Т.НоваяОплатаДоПереданной) КАК НовыхПолисовДоПереданной,
	|	СУММА(Т.Первичная) КАК Первичных,
	|	СУММА(Т.Пролонгация) КАК Пролонгаций,
	|	СУММА(Т.Вторичная) КАК Вторичных,
	|	СУММА(Т.Рекомендация) КАК Рекомендаций,
	|	СУММА(Т.СтраховаяСумма) КАК СтраховаяСумма,
	|	СУММА(Т.СтраховаяПремия) КАК СтраховаяПремия,
	|	СУММА(Т.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	СУММА(Т.ОплаченоФакт) КАК ОплаченоФакт,
	|	СУММА(Т.АВилиСкидкаСумма) КАК АВилиСкидкаСумма,
	|	СУММА(Т.КВСумма) КАК КВСумма,
	|	СУММА(Т.КВСуммаДляОтчета) КАК КВСуммаДляОтчета,
	|	СУММА(Т.Прибыль) КАК СКВ,
	|	СРЕДНЕЕ(Т.СтраховаяСумма) КАК СрСтраховаяСумма,
	|	СРЕДНЕЕ(Т.СтраховаяПремия) КАК СрСтраховаяПремия,
	|	СРЕДНЕЕ(Т.НачисленнаяСуммаВзноса) КАК СрНачисленнаяСуммаВзноса,
	|	СРЕДНЕЕ(Т.ОплаченоФакт) КАК СрОплаченоФакт,
	|	СРЕДНЕЕ(Т.АВилиСкидкаСумма) КАК СрАВилиСкидкаСумма,
	|	СРЕДНЕЕ(Т.АВилиСкидкаПроцент) КАК СрАВилиСкидкаПроцент,
	|	СРЕДНЕЕ(Т.КВПроцент) КАК СрКВПроцент,
	|	СРЕДНЕЕ(Т.КВПроцентДляОтчета) КАК СрКВПроцентДляОтчета,
	|	СРЕДНЕЕ(Т.КВСумма) КАК СрКВСумма,
	|	СРЕДНЕЕ(Т.Прибыль) КАК СрПрибыль,
	|	Т.ВидСП,
	|	Т.Личная,
	|	Т.Агент,
	|	Т.Подразделение,
	|	Т.НаправлениеПлатежа,
	|	Т.ОрганизацияАгент КАК Организация,
	|	СУММА(Т.СКВПервогоВзноса) КАК СКВПервогоВзноса,
	|	СУММА(Т.СКВНеПервогоВзноса) КАК СКВНеПервогоВзноса,
	|	СУММА(Т.КоличествоНеПервых) КАК КоличествоНеПервых,
	|	СУММА(Т.ПриведеннаяСтраховаяСумма) КАК ПриведеннаяСтраховаяСумма,
	|	СУММА(Т.ПриведеннаяСуммаНеПервых) КАК ПриведеннаяСуммаНеПервых,
	|	СУММА(Т.СКВПервогоВзносаПриведенное) КАК СКВПервогоВзносаПриведенное,
	|	СУММА(Т.ПриведеннаяСтраховаяПремияПервых) КАК ПриведеннаяСтраховаяПремияПервых,
	|	СУММА(Т.СкидкаНаПремию) КАК СкидкаНаПремию,
	|	СУММА(Т.КВНаПремию) КАК КВНаПремию,
	|	СУММА(Т.НачисленнаяСуммаВзносаПервых) КАК НачисленнаяСуммаВзносаПервых,
	|	СУММА(Т.СкидкаПервых) КАК СкидкаПервых,
	|	СУММА(Т.НачисленнаяСуммаВзносаВторых),
	|	СУММА(Т.СкидкаВторых),
	|	СУММА(Т.КоличествоПролонгаций) КАК КоличествоПролонгаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОП.Дата КАК Дата,
	|		ОП.Агент КАК Агент,
	|		ОП.ВидСП КАК ВидСП,
	|		ОП.СтраховойПолис.СК КАК СК,
	|		ОП.Номер КАК Номер,
	|		ОП.Ссылка КАК Ссылка,
	|		ОП.НомерВзноса КАК НомерВзноса,
	|		ОП.НаправлениеПлатежа КАК НаправлениеПлатежа,
	|		ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
	|		ОП.СтраховойПолис.ВидУчетаСтраховки КАК ВидУчетаСтраховки,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Первичная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Первичная,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Пролонгация
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Пролонгация,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Вторичная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Вторичная,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Рекомендация
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Рекомендация,
	|		ОП.ВидРасчетаСАгентом КАК ВидРасчетаСАгентом,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Новая,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса <> 1
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоНеПервых,
	|		ВЫБОР
	|			КОГДА ОП.Дата <= &КонецПериода
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОплатаДоПереданной,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|					И ОП.Дата <= &КонецПериода
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НоваяОплатаДоПереданной,
	|		1 КАК ЭтоОплата,
	|		ОП.СтраховойПолис.СтраховаяСумма КАК СтраховаяСумма,
	|		ОП.СтраховойПолис.СтраховаяПремия КАК СтраховаяПремия,
	|		ОП.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА ОП.НачисленнаяСуммаВзноса
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачисленнаяСуммаВзносаПервых,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса <> 1
	|				ТОГДА ОП.НачисленнаяСуммаВзноса
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачисленнаяСуммаВзносаВторых,
	|		ОП.ОплаченоФакт КАК ОплаченоФакт,
	|		ОП.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА ОП.АВилиСкидкаПроцент * ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) / 100
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СкидкаНаПремию,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА ОП.АВилиСкидкаСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СкидкаПервых,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса <> 1
	|				ТОГДА ОП.АВилиСкидкаСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СкидкаВторых,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА ОП.КВПроцент * ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) / 100
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КВНаПремию,
	|		ОП.АВилиСкидкаПроцент КАК АВилиСкидкаПроцент,
	|		ОП.КВПроцент КАК КВПроцент,
	|		ОП.КВСумма КАК КВСумма,
	|		ВЫБОР
	|			КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|					КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|				КОНЕЦ - ОП.КВСумма
	|				ТОГДА 0
	|			ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|					КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|				КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|		КОНЕЦ КАК Прибыль,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА ВЫБОР
	|						КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.КВСумма
	|							ТОГДА 0
	|						ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СКВПервогоВзноса,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|					И ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ <> 0
	|				ТОГДА ВЫБОР
	|						КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.КВСумма
	|							ТОГДА 0
	|						ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|					КОНЕЦ * (ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) / ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СКВПервогоВзносаПриведенное,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса <> 1
	|				ТОГДА ВЫБОР
	|						КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.КВСумма
	|							ТОГДА 0
	|						ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|								КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|									ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|								ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|							КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СКВНеПервогоВзноса,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|					И ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) <> 0
	|				ТОГДА ОП.СтраховойПолис.СтраховаяПремия
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриведеннаяСтраховаяПремияПервых,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) <> 0
	|				ТОГДА ОП.СтраховойПолис.СтраховаяСумма * ОП.НачисленнаяСуммаВзноса / ОП.СтраховойПолис.СтраховаяПремия
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриведеннаяСтраховаяСумма,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса <> 1
	|					И ЕСТЬNULL(ОП.СтраховойПолис.СтраховаяПремия, 0) <> 0
	|				ТОГДА ОП.СтраховойПолис.СтраховаяСумма * ОП.НачисленнаяСуммаВзноса / ОП.СтраховойПолис.СтраховаяПремия
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриведеннаяСуммаНеПервых,
	|		НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) КАК ЗарплатныйПериод,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.НомерЗаявки = &ЛичнаяСтраховка  ИЛИ ОП.СтраховойПолис.НомерЗаявки = &Агентская 
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Личная,
	|		ОП.ОрганизацияАгент КАК ОрганизацияАгент,
	|		ОП.КВСуммаДляОтчета КАК КВСуммаДляОтчета,
	|		ОП.КВПроцентДляОтчета КАК КВПроцентДляОтчета,
	|		ОП.Подразделение КАК Подразделение,
	|		ВЫБОР
	|			КОГДА Пролонгации.НовыйПолис ЕСТЬ NULL 
	|					ИЛИ ОП.НомерВзноса <> 1
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК КоличествоПролонгаций
	|	ИЗ
	|		Документ.уб_ОплатаПолисов КАК ОП
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|				уб_ЗаданияНаПролонгацию.СтраховойПолис КАК Значение,
	//|				уб_ЗаданияНаПролонгацию.ТекущийСтатус КАК ТекущийСтатус,
	//|				уб_ЗаданияНаПролонгацию.ДатаЗакрытия КАК ДатаЗакрытия,
	|				уб_ЗаданияНаПролонгацию.НовыйПолис КАК НовыйПолис
	|			ИЗ
	|				РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|					ПО уб_ЗаданияНаПролонгацию.СтраховойПолис = уб_СтраховойПолис.Ссылка
	|						И (уб_ЗаданияНаПролонгацию.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован))
	|						И (уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ)) КАК Пролонгации
	|			ПО (Пролонгации.НовыйПолис = ОП.СтраховойПолис)
	|	ГДЕ
	|		НЕ ОП.ПометкаУдаления
	|		И ОП.ВидРасчетаСАгентом <> &РасчетПоАВ
	|		И 1 = 1) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ЗарплатныйПериод,
	|	Т.ВидСП,
	|	Т.Личная,
	|	Т.Агент,
	|	Т.Подразделение,
	|	Т.НаправлениеПлатежа,
	|	Т.ОрганизацияАгент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";		 	
	//дополнительные периоды для динамики показателей.
	Если Динамика Тогда
		НачалоПериодаМинусГод 	= ДобавитьМесяц(НачалоПериода, 	-12);
		КонецПериодаМинусГод	= ДобавитьМесяц(КонецПериода,	-12);
		НачалоПериодаМинусМесяц = ДобавитьМесяц(НачалоПериода,	-1);
		Если НачалоМесяца(КонецПериодаМинусГод) >= НачалоПериодаМинусМесяц Тогда
			ДопТекст = "ОП.ЗарплатныйПериод >= &НачалоПериода И ОП.ЗарплатныйПериод <= &КонецПериода";
			Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаМинусГод);
		Иначе
			ДопТекст = "((ОП.ЗарплатныйПериод >= &НачалоПериода И ОП.ЗарплатныйПериод <= &КонецПериода) ИЛИ (ОП.ЗарплатныйПериод >= &НачалоПериодаМинусГод И ОП.ЗарплатныйПериод <= &КонецПериодаМинусГод))";
			Запрос.УстановитьПараметр("НачалоПериодаМинусГод", 	НачалоПериодаМинусГод);
			Запрос.УстановитьПараметр("КонецПериодаМинусГод",	КонецПериодаМинусГод);
			Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериодаМинусМесяц);
		КонецЕсли;
	Иначе
		ДопТекст = "ОП.ЗарплатныйПериод >= &НачалоПериода И ОП.ЗарплатныйПериод <= &КонецПериода";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	КонецЕсли;		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", ДопТекст);
	Запрос.УстановитьПараметр("ЛичнаяСтраховка",кЛичнаяЗаявка);
	Запрос.УстановитьПараметр("Агентская",Перечисления.уб_ВидыЗаявок.Агентская);
	
	Запрос.УстановитьПараметр("РасчетПоАВ", 	кРасчетПоАВ);	
	Запрос.УстановитьПараметр("Первичная", 		Перечисления.уб_ВидыУчетаСтраховок.Первичная);
	Запрос.УстановитьПараметр("Пролонгация", 	Перечисления.уб_ВидыУчетаСтраховок.Пролонгация);
	Запрос.УстановитьПараметр("Вторичная", 		Перечисления.уб_ВидыУчетаСтраховок.Вторичная);
	Запрос.УстановитьПараметр("Рекомендация", 	Перечисления.уб_ВидыУчетаСтраховок.Рекомендация);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	ЗаполнитьТЗ(Выборка,ТЗ);	
	МассивТЗАгентов = Неопределено;
	Если ПоЗП Тогда	
		ТЗ1 = Новый ТаблицаЗначений;
		ТЗАгентов = Новый ТаблицаЗначений;
		тзПодразделений = Новый ТаблицаЗначений;
		тзСхемаРасчетаДляАгентов = Новый ТаблицаЗначений; 			
		Обработка = Обработки.уб_РасчетВМ.Создать();
		МассивТЗАгентов = Новый Массив;
		Для Счетчик = 1 По СчетчикМесяцев Цикл
			Обработка.ЗарплатныйПериод = ДобавитьМесяц(НачалоДня(КонецМесяца(НачалоПериода)), Счетчик - 1);
			Обработка.ДатаСреза = Неопределено;
			Обработка.РассчитатьТаблицы(ТЗ1, ТЗАгентов, тзПодразделений, тзСхемаРасчетаДляАгентов);
			МассивТЗАгентов.Добавить(ТЗАгентов);
		КонецЦикла;		
		Для Индекс = 0 По МассивТЗАгентов.Количество() - 1 Цикл
			Период = ДобавитьМесяц(НачалоМесяца(НачалоПериода), Индекс);
			Для Каждого СтрокаТЗАгентов Из МассивТЗАгентов[Индекс] Цикл
				ЗаполнитьПоТЗАгента(ТЗ, СтрокаТЗАгентов, Период);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	Если Динамика Тогда		
		НачалоПер = НачалоМесяца(НачалоПериода);
		_ТЗ = Новый ТаблицаЗначений;
		_ТЗ = ТЗ.СкопироватьКолонки();
		Массив = Новый Массив;		
		Для Каждого СтрокаТЗ из ТЗ Цикл
			Если СтрокаТЗ.Динамика <> Истина Или Массив.Найти(СтрокаТЗ.Показатель + СтрокаТЗ.Агент + СтрокаТЗ.ВидСП + СтрокаТЗ.Личная + СтрокаТЗ.Организация + СтрокаТЗ.Подразделение + СтрокаТЗ.НаправлениеПлатежа) <> Неопределено Тогда 
				Продолжить
			КонецЕсли;			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Показатель");
			ПараметрыОтбора.Вставить("Агент");
			ПараметрыОтбора.Вставить("ВидСП");
			ПараметрыОтбора.Вставить("Личная");
			ПараметрыОтбора.Вставить("Организация");
			ПараметрыОтбора.Вставить("Агент");
			ПараметрыОтбора.Вставить("Подразделение");
			ПараметрыОтбора.Вставить("НаправлениеПлатежа");			
			ПараметрыОтбора.Показатель 			= СтрокаТЗ.Показатель;
			ПараметрыОтбора.Агент				= СтрокаТЗ.Агент;
			ПараметрыОтбора.ВидСП				= СтрокаТЗ.ВидСП;
			ПараметрыОтбора.Личная				= СтрокаТЗ.Личная;
			ПараметрыОтбора.Организация 		= СтрокаТЗ.Организация;
			ПараметрыОтбора.Подразделение 		= СтрокаТЗ.Подразделение;
			ПараметрыОтбора.НаправлениеПлатежа 	= СтрокаТЗ.НаправлениеПлатежа;
			ТЗД = Новый ТаблицаЗначений;
			ТЗД = ТЗ.Скопировать(ПараметрыОтбора);
			ТЗД.Сортировать("Период УБЫВ");				
			//3 типа периодов: 
			//1) конечный (не добавляет данные для сравнения в будущие периоды
			//2) меньше начала периода (только для сравнения)
			//3) общий 1 + 2
			Для Индекс = 0 По ТЗД.Количество() - 1 Цикл
				Если ТЗД[Индекс].Период = НачалоМесяца(КонецПериода) Тогда
					РасчетныйМесяц(_ТЗ, ТЗД, Индекс);
				ИначеЕсли ТЗД[Индекс].Период < НачалоМесяца(НачалоПериода) Тогда
					СравниваемыйМесяц(_ТЗ, ТЗД, Индекс);
				Иначе
					РасчетныйМесяц(_ТЗ, ТЗД, Индекс);
					СравниваемыйМесяц(_ТЗ, ТЗД, Индекс);
				КонецЕсли;
			КонецЦикла;
			Массив.Добавить(СтрокаТЗ.Показатель + СтрокаТЗ.Агент + СтрокаТЗ.ВидСП + СтрокаТЗ.Личная + СтрокаТЗ.Организация + СтрокаТЗ.Подразделение + СтрокаТЗ.НаправлениеПлатежа);
		КонецЦикла;
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(_ТЗ, ТЗ);
	КонецЕсли;		
	Если ЗапроситьДанныеБазы = Истина Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДанныеИзБазы(), ТЗ);
	КонецЕсли;	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДанныеПоПролонгациям(), ТЗ);
	
	
	СписокАгентов = Тз.Скопировать();
	СписокАгентов.Свернуть("Агент");
	//Пустышки для расчетов
	ТекДата  = НачалоПериода;
	Пока ТекДата <= КонецПериода Цикл
		//Сообщить(ТекДата);
		Для каждого СтрокаА из СписокАгентов Цикл
			Агент = СтрокаА.Агент;
			Строка2 = ТЗ.Добавить();
			Строка2.Агент = Агент;
		
		Строка2.Период = ТекДата;
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Количество вторых взносов";
		Строка2.Значение		= 0;
		Строка2.Сортировка 	= "^Количество_Вторых";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
		
		Строка2 = ТЗ.Добавить();
		Строка2.Агент = Агент;
		Строка2.Период = ТекДата;
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Количество пролонгаций по 1С";
		Строка2.Значение		= 0;
		Строка2.Сортировка 	= "#Количество_Пролонгаций";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
		
		Строка2 = ТЗ.Добавить();
		Строка2.Агент = Агент;
		Строка2.Период = ТекДата;
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Количество оплат";
		Строка2.Значение		= 0;
		Строка2.Сортировка 	= "$Количество__Оплат";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
		
		Строка2 = ТЗ.Добавить();
		Строка2.Период = ТекДата;
		Строка2.Агент = Агент;
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Обработано новых заявок";
		Строка2.Значение		= 0;
		Строка2.Сортировка 	= "$ОбработаноНовыхЗаявок";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
        КонецЦикла;
		ТекДата = ДобавитьМесяц(ТекДата,1);
		
	КонецЦикла;

	//Для каждого Строка из ТЗ цикл
	//	Если ТипЗнч(Строка.Значение) <> Тип("Число") Тогда
	//		Сообщить(ТипЗнч(Строка.Значение));
	//	КонецЕсли;	
	//КонецЦикла;	
	//Тз.Индексы.Добавить("Фильтр");
	Возврат ТЗ;
	
КонецФункции

//заполнение плюсом
Процедура РасчетныйМесяц(_ТЗ, ТЗД, Индекс)
	
	//проверка чтобы не добавлялись расчеты прошлого года в таблицу
	Если ТЗД[Индекс].Период >= НачалоПериода Тогда
		Строка_ТЗ = _ТЗ.Добавить();
		ЗаполнитьСвойства(Строка_ТЗ, ТЗД[Индекс]);
		Строка_ТЗ.Показатель = "Разница количества оплат от пред. месяца";
		Строка_ТЗ.Значение 	 = ТЗД[Индекс].Значение;
		Строка_ТЗ.Сортировка = "1000";
		Строка_ТЗ.ТипЗначения = "Количественные";
		Строка_ТЗ.РасчетПо	 = 0;
		Строка_ТЗ.Период	 = ТЗД[Индекс].Период;		
		Строка_ТЗ = _ТЗ.Добавить();
		ЗаполнитьСвойства(Строка_ТЗ, ТЗД[Индекс]);
		Строка_ТЗ.Показатель = "Разница количества оплат от пред. года";
		Строка_ТЗ.Значение 	 = ТЗД[Индекс].Значение;
		Строка_ТЗ.Сортировка = "1100";
		Строка_ТЗ.ТипЗначения = "Количественные";
		Строка_ТЗ.РасчетПо	 = 0;
		Строка_ТЗ.Период	 = ТЗД[Индекс].Период;
	КонецЕсли;
	
КонецПроцедуры


Процедура СравниваемыйМесяц(_ТЗ, ТЗД, Индекс)
	
	//Динамика - месяц
	//проверка чтобы не добавлялись расчеты прошлого года в следующий месяц
	ПериодПлюсМесяц = ДобавитьМесяц(ТЗД[Индекс].Период, 1);
	Если ПериодПлюсМесяц >= НачалоПериода Тогда
		Строка_ТЗ = _ТЗ.Добавить();
		ЗаполнитьСвойства(Строка_ТЗ, ТЗД[Индекс]);
		Строка_ТЗ.Показатель = "Разница количества оплат от пред. месяца";
		Строка_ТЗ.Значение 	 = -ТЗД[Индекс].Значение;
		Строка_ТЗ.Сортировка = "1000";
		Строка_ТЗ.ТипЗначения = "Количественные";
		Строка_ТЗ.РасчетПо	 = 0;
		Строка_ТЗ.Период	 = ПериодПлюсМесяц;
	КонецЕсли;	
	//Динамика - год
	//проверка чтобы расчет не уходил в будущее
	ПериодПлюсГод = ДобавитьМесяц(ТЗД[Индекс].Период, 12);
	Если ПериодПлюсГод <= КонецПериода Тогда
		Строка_ТЗ = _ТЗ.Добавить();
		ЗаполнитьСвойства(Строка_ТЗ, ТЗД[Индекс]);
		Строка_ТЗ.Показатель = "Разница количества оплат от пред. года";
		Строка_ТЗ.Значение = -ТЗД[Индекс].Значение;
		Строка_ТЗ.Сортировка = "1100";
		Строка_ТЗ.ТипЗначения = "Количественные";
		Строка_ТЗ.РасчетПо	 = 0;
		Строка_ТЗ.Период	 = ПериодПлюсГод;
	КонецЕсли;
	
КонецПроцедуры
Процедура ЗаполнитьСвойства(Строка, Выборка)
	
	ЗаполнитьЗначенияСвойств(Строка, Выборка, "Период, Агент, Личная, ВидСП, Подразделение, НаправлениеПлатежа, Организация");	
	
КонецПроцедуры

Процедура ЗаполнитьТЗ(Выборка, ТЗ)
	
	кп = "Количественные";
	сп = "Суммовые";
	пп = "Процентные";	
	Эффективность = ВО  = "ДляЭффективности";
	Пока Выборка.Следующий() Цикл		
		Если НЕ ВидСП.Пустая() Тогда
			Если Выборка.ВидСП<>ВидСП Тогда
				продолжить
			КонецЕсли;	
		КонецЕсли;	
		Если Эффективность Тогда
			Строка = ТЗ.Добавить();		
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Количество оплат";
			Строка.Значение 	= Выборка.ВсегоОплат;
			Строка.Сортировка	= "$Количество__Оплат";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;
			Строка.Динамика		= Истина;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Общая сумма начисленных взносов";
			Строка.Значение		= Выборка.НачисленнаяСуммаВзноса;
			Строка.Сортировка 	= "!СуммаНачисленнаяВзноса";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Скидка*Премия";
			Строка.Значение		= Окр(Выборка.СкидкаНаПремию, 2);
			Строка.Сортировка 	= "___СкидкаНаПремию";
			Строка.ТипЗначения	= Кп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Общая сумма скидки";
			Строка.Значение		= Выборка.АВилиСкидкаСумма;
			Строка.Сортировка 	= "!СкидкаОбщаяСумма";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Сумма взноса первых";
			Строка.Значение		= Окр(Выборка.НачисленнаяСуммаВзносаПервых, 2);
			Строка.Сортировка 	= "_1СуммаНачисленнаяВзноса_Первых";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Сумма взноса вторых";
			Строка.Значение		= Окр(Выборка.НачисленнаяСуммаВзносаВторых, 2);
			Строка.Сортировка 	= "_2СуммаНачисленнаяВзносаВторых";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Скидка первых взносов";
			Строка.Значение		= Окр(Выборка.СкидкаПервых, 2);
			Строка.Сортировка 	= "_1СкидкаПервых";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Скидка остальных взносов";
			Строка.Значение		= Окр(Выборка.СкидкаВторых, 2);
			Строка.Сортировка 	= "_2СкидкаВторых";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Полная страховая премия по первичным заявкам";
			Строка.Значение		= Окр(Выборка.ПриведеннаяСтраховаяПремияПервых, 2);
			Строка.Сортировка 	= "__ПолнаяСтраховаяПервых";
			Строка.ТипЗначения	= Кп;
			Строка.РасчетПо		= 0;
		
		Иначе
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Новых полисов";
			Строка.Значение		= Выборка.НовыхПолисов;
			Строка.Сортировка	= "010";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;
			//Строка.Динамика		= Истина;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Оплат до переданной";
			Строка.Значение		= Выборка.ОплатДоПереданной;
			Строка.Сортировка 	= "020";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Новых полисов до переданной";
			Строка.Значение		= Выборка.НовыхПолисовДоПереданной;
			Строка.Сортировка 	= "030";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Первичных";
			Строка.Значение		= Выборка.Первичных;
			Строка.Сортировка 	= "040";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Пролонгаций";
			Строка.Значение		= Выборка.Пролонгаций;
			Строка.Сортировка 	= "050";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Вторичных";
			Строка.Значение		= Выборка.Вторичных;
			Строка.Сортировка 	= "060";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Рекомендаций";
			Строка.Значение		= Выборка.Рекомендаций;
			Строка.Сортировка 	= "070";
			Строка.ТипЗначения	= кп;
			Строка.РасчетПо		= 0;		
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Страховая сумма";
			Строка.Значение		= Выборка.СтраховаяСумма;
			Строка.Сортировка 	= "080";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Страховая премия";
			Строка.Значение		= Выборка.СтраховаяПремия;
			Строка.Сортировка 	= "090";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Оплачено факт";
			Строка.Значение		= Выборка.ОплаченоФакт;
			Строка.Сортировка 	= "110";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "КВ сумма";
			Строка.Значение		= Выборка.КВСумма;
			Строка.Сортировка 	= "130";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "КВ сумма для отчета";
			Строка.Значение		= Окр(Выборка.КВСуммаДляОтчета, 2);
			Строка.Сортировка 	= "140";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "СКВ оплат";
			Строка.Значение		= Выборка.СКВ;
			Строка.Сортировка 	= "160";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 0;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средняя страховая сумма";
			Строка.Значение		= Выборка.СрСтраховаяСумма;
			Строка.Сортировка 	= "170";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средняя страховая премия";
			Строка.Значение		= Выборка.СрСтраховаяПремия;
			Строка.Сортировка 	= "180";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средняя начисленная сумма взноса";
			Строка.Значение		= Окр(Выборка.СрНачисленнаяСуммаВзноса, 2);
			Строка.Сортировка 	= "190";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Оплачено фактически по средней";
			Строка.Значение		= Окр(Выборка.СрОплаченоФакт, 2);
			Строка.Сортировка 	= "200";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "АВили средняя сумма скидки";
			Строка.Значение		= Окр(Выборка.СрАВилиСкидкаСумма, 2);
			Строка.Сортировка 	= "210";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "АВили средний процент скидки";
			Строка.Значение		= Окр(Выборка.СрАВилиСкидкаПроцент, 2);
			Строка.Сортировка 	= "220";
			Строка.ТипЗначения	= пп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);		
			Строка.Показатель	= "Средний процент КВ";
			Строка.Значение		= Окр(Выборка.СрКВПроцент, 2);
			Строка.Сортировка 	= "230";
			Строка.ТипЗначения	= пп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средний процент КВ для отчета";
			Строка.Значение		= Окр(Выборка.СрКВПроцентДляОтчета, 2);
			Строка.Сортировка 	= "245";
			Строка.ТипЗначения	= пп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средняя сумма КВ";
			Строка.Значение		= Окр(Выборка.СрКВСумма, 2);
			Строка.Сортировка 	= "250";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			Строка = ТЗ.Добавить();
			ЗаполнитьСвойства(Строка, Выборка);
			Строка.Показатель	= "Средняя прибыль";
			Строка.Значение		= Окр(Выборка.СрПрибыль, 2);
			Строка.Сортировка 	= "270";
			Строка.ТипЗначения	= сп;
			Строка.РасчетПо		= 1;
			
			Если Выборка.НачисленнаяСуммаВзноса <> 0 Тогда
				Строка = ТЗ.Добавить();
				ЗаполнитьСвойства(Строка, Выборка);
				Строка.Показатель	= "Средний % скидки (усреднение по суммам)";
				Строка.Значение		= Окр(Выборка.АВилиСкидкаСумма / Выборка.НачисленнаяСуммаВзноса * 100,2);
				Строка.Сортировка 	= "290";
				Строка.ТипЗначения	= пп;
				Строка.РасчетПо		= 1;
				Строка = ТЗ.Добавить();
				ЗаполнитьСвойства(Строка, Выборка);
				Строка.Показатель 	= "Средний % КВ (усреднение по суммам)";
				Строка.Значение		= Окр(Выборка.КВСумма / Выборка.НачисленнаяСуммаВзноса * 100,2);
				Строка.Сортировка 	= "300";
				Строка.ТипЗначения	= пп;
				Строка.РасчетПо		= 1;
				Строка = ТЗ.Добавить();
				ЗаполнитьСвойства(Строка, Выборка);
				Строка.Показатель	= "Процент СКВ к начисленной сумме взноса";
				Строка.Значение		= Окр(Выборка.СКВ / Выборка.НачисленнаяСуммаВзноса * 100, 2);
				Строка.Сортировка 	= "275";
				Строка.ТипЗначения	= пп;
				Строка.РасчетПо		= 1;
			КонецЕсли;
		КонецЕсли;
		///
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "СКВ первого взноса";
		//Строка.Значение		= Окр(Выборка.СКВПервогоВзноса, 2);
		//Строка.Сортировка 	= "160";
		//Строка.ТипЗначения	= сп;
		//Строка.РасчетПо		= 0;
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "СКВ первого взноса приведенное до полной премии";
		//Строка.Значение		= Окр(Выборка.СКВПервогоВзносаПриведенное, 2);
		//Строка.Сортировка 	= "СКВПервогоПриведенное";
		//Строка.ТипЗначения	= сп;
		//Строка.РасчетПо		= 0;
		////
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "СКВ вторых взносов";
		//Строка.Значение		= Окр(Выборка.СКВНеПервогоВзноса, 2);
		//Строка.Сортировка 	= "160";
		//Строка.ТипЗначения	= сп;
		//Строка.РасчетПо		= 0;
		//Берем по пролонгациям
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "Количество вторых взносов";
		//Строка.Значение		= Окр(Выборка.КоличествоНеПервых, 2);
		//Строка.Сортировка 	= "Количество_Вторых";
		//Строка.ТипЗначения	= Кп;
		//Строка.РасчетПо		= 0;
		//
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "Общая приведенная стоимость авто, тыс.";
		//Строка.Значение		= Окр(Выборка.ПриведеннаяСтраховаяСумма/1000, 2);
		//Строка.Сортировка 	= "160";
		//Строка.ТипЗначения	= Кп;
		//Строка.РасчетПо		= 0;
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "Общая приведенная стоимость авто по вторым взносам, тыс.";
		//Строка.Значение		= Окр(Выборка.ПриведеннаяСуммаНеПервых/1000, 2);
		//Строка.Сортировка 	= "160";
		//Строка.ТипЗначения	= Кп;
		//Строка.РасчетПо		= 0;
		
		//Строка = ТЗ.Добавить();
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "КВ*Премия";
		//Строка.Значение		= Окр(Выборка.КВНаПремию, 2);
		//Строка.Сортировка 	= "КВНаПремию";
		//Строка.ТипЗначения	= Кп;
		//Строка.РасчетПо		= 0;
		
		//Строка = ТЗ.Добавить(); //В другом запросе
		//ЗаполнитьСвойства(Строка, Выборка);
		//Строка.Показатель	= "Количество пролонгаций по 1С";
		//Строка.Значение		= Выборка.КоличествоПролонгаций;
		//Строка.Сортировка 	= "Количество_Пролонгаций";
		//Строка.ТипЗначения	= кп;
		//Строка.РасчетПо		= 0;
		
	КонецЦикла;
	
КонецПроцедуры
Процедура ЗаполнитьПоТЗАгента(ТЗ, СтрокаТЗАгентов, Период)
	
	кп = "Количественные";
	сп = "Суммовые";
	пп = "Процентные";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель = "План";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.План;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "500";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "Превышение суперплана";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ПревышениеСуперплана;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "510";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "СКВ для расчета з/п";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.СКВ_ДляПланаПоСКВ_ПоАгенту;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "520";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "ЗП за превышение суперплана";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ЗПотЗаПревышениеСуперПлана;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "530";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "ЗП от СКВ без суперплана";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ЗПотСКВдоСуперПлана;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "540";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "ЗП Итого";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ИтогоЗП;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "550";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "Вознаграждение менеджера";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ВознаграждениеМенеджера;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "560";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "Вознаграждение руководителя";
	СтрокаТЗ.Значение	= СтрокаТЗАгентов.ВознаграждениеРуководителя;
	СтрокаТЗ.РасчетПо	= 0;
	СтрокаТЗ.ТипЗначения = "Суммовые";
	СтрокаТЗ.Сортировка = "570";
	
	СтрокаТЗ = ТЗ.Добавить();
	ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период);
	
	СтрокаТЗ.Показатель	= "Процент начислений по зп от СКВ";
	СтрокаТЗ.Значение	= ?(СтрокаТЗАгентов.СКВ_ДляПланаПоСКВ_ПоАгенту <> 0, Окр(СтрокаТЗАгентов.ИтогоЗП / СтрокаТЗАгентов.СКВ_ДляПланаПоСКВ_ПоАгенту * 100, 2), 0);
	СтрокаТЗ.РасчетПо	= 1;
	СтрокаТЗ.ТипЗначения = пп;
	СтрокаТЗ.Сортировка = "580";	
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваТЗАгента(СтрокаТЗ, СтрокаТЗАгентов, Период)
	
	ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЗАгентов, "Агент, Подразделение");	
	ВидСПОбщий  = "Нераспределяемые";
	ЛичнаяОбщий = "Нераспределяемые";
	
	СтрокаТЗ.ВидСП			= ВидСПОбщий;
	СтрокаТЗ.Личная			= ЛичнаяОбщий;
	СтрокаТЗ.Организация	= СтрокаТЗАгентов.Подразделение.Владелец;
	СтрокаТЗ.Период			= Период;
	
КонецПроцедуры

Функция ДанныеПоПролонгациям()
	тз = Отчеты.уб_СтатистикаПоСтраховкам.ПустаяТЗ();	
	КэшСотрудников = Неопределено;
	ДатаКЭША = Неопределено;
	ЗапросПролонгации = Новый Запрос("ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Статус.Период, МЕСЯЦ) КАК Период,
	|	уб_ЗаданияНаПролонгацию.Ответственный КАК Агент,
	|	СУММА(ВЫБОР
	|			КОГДА уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоПролонгаций,
	|	СУММА(ВЫБОР
	|			КОГДА уб_ЗаданияНаПролонгацию.ТипЗадания = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВторыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ
	|					И уб_ЗаданияНаПролонгацию.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПролонгировано,
	|	СУММА(ВЫБОР
	|			КОГДА уб_ЗаданияНаПролонгацию.ТипЗадания = ИСТИНА
	|					И уб_ЗаданияНаПролонгацию.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПринятоВзносов,
	|	уб_СтраховойПолис.СтраховойПродукт КАК ВидСП
	|ИЗ
	|	РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ПО уб_ЗаданияНаПролонгацию.СтраховойПолис = уб_СтраховойПолис.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_СтатусыПролонгации.СрезПоследних КАК Статус
	|		ПО (Статус.СтраховойПолис = уб_ЗаданияНаПролонгацию.СтраховойПолис)
	|			И (Статус.ТипЗадания = уб_ЗаданияНаПролонгацию.ТипЗадания)
	|ГДЕ
	|	уб_ЗаданияНаПролонгацию.ТекущийСтатус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Пролонгирован), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыПролонгирования.Отказ))
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ЗаданияНаПролонгацию.Ответственный,
	|	уб_СтраховойПолис.СтраховойПродукт.Вид,
	|	НАЧАЛОПЕРИОДА(Статус.Период, МЕСЯЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	Выборка = ЗапросПролонгации.Выполнить().Выбрать();								
	Пока Выборка.Следующий() Цикл
		Период = Выборка.Период;
		Если Период = Null Или НЕ(Период>=НачалоПериода И Период<=КонецПериода) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ВидСП.Пустая() Тогда
			Если Выборка.ВидСП<>ВидСП Тогда
				продолжить
			КонецЕсли;	
		КонецЕсли;	
		Строка = тз.Добавить();	
		Строка.Показатель 			= "Обработано пролонгаций по 1С всего";
		Строка.Значение 			= Выборка.ВсегоПролонгаций;
		Строка.Период 				= Выборка.Период;
		Строка.Агент 				= Выборка.Агент;
		Строка.Личная 				= Ложь;
		Строка.ВидСП 				= Выборка.ВидСП;
		Строка.НаправлениеПлатежа 	= Перечисления.уб_НаправленияПлатежа.ВБрокер;
		Строка.ТипЗначения 			= "Количественные";
		Если КэшСотрудников = Неопределено ИЛИ ДатаКЭША <> Строка.Период Тогда
			КэшСотрудников = уб_КЭШируемые.ПолучитьСписокСотрудниковАктуальныхВМесяце(НачалоМесяца(Строка.Период),Истина);
			ДатаКЭША = Строка.Период;
		КонецЕсли;	
		
		МассивПодразделений = КэшСотрудников.НайтиСтроки(Новый Структура("Агент",Строка.Агент));
		Если МассивПодразделений.Количество()>0 Тогда
			
			СтрокаПодразделения = МассивПодразделений[0];
			
			Строка.Подразделение = СтрокаПодразделения.Подразделение;
			Строка.Организация   = СтрокаПодразделения.Организация
		Иначе
			Строка.Подразделение = "<Неизвестно>";
		КонецЕсли;
		//Если ФизЛицо.Пустая() Тогда
		//	Строка.Агент = Массив[КолонкаФИО];
		//КонецЕсли;	
		
		Строка.РасчетПо = 0;  // 0 - по сумме, 1 - по средней
		Строка.Сортировка = "#ОбработаноПролонгаций1С";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Количественные";
		Строка2.Значение = Выборка.КоличествоВторыхВзносов;
		Строка2.Показатель = "Обработано вторых взносов по 1С всего";
		Строка2.Сортировка = "^ОбработаноВторыхВзносов1С";
		
		//
		Строка2 = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Количество пролонгаций по 1С";
		Строка2.Значение		= Выборка.КоличествоПролонгировано;
		Строка2.Сортировка 	= "#Количество_Пролонгаций";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
		//
		Строка2 = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.Показатель	= "Количество вторых взносов";
		Строка2.Значение		= Окр(Выборка.КоличествоПринятоВзносов, 2);
		Строка2.Сортировка 	= "^Количество_Вторых";
		Строка2.ТипЗначения	= "Количественные";
		Строка2.РасчетПо		= 0;
		
	КонецЦикла;
	Строка2 = ТЗ.Добавить();
	//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
	Строка2.Показатель	= "Количество вторых взносов";
	Строка2.Значение		= 0;
	Строка2.Сортировка 	= "^Количество_Вторых";
	Строка2.ТипЗначения	= "Количественные";
	Строка2.РасчетПо		= 0;
	Строка2 = ТЗ.Добавить();
	//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
	Строка2.Показатель	= "Количество пролонгаций по 1С";
	Строка2.Значение		= 0;
	Строка2.Сортировка 	= "#Количество_Пролонгаций";
	Строка2.ТипЗначения	= "Количественные";
	Строка2.РасчетПо		= 0;
	//тз.выбратьСтроку();
	Возврат тз;
КонецФункции	
Функция ДанныеИзБазы()
	//ИмяФайла = "D:\!1C\избазы.csv";
	//Текст = Новый ТекстовыйДокумент;
	//Текст.Прочитать(ИмяФайла);
	//КолонкаФИО = 3 ;
	//КолонкаКода = 2 ;
	//КолонкаСуммы = 1;
	//КолонкаКоличества = 0;
	//КолонкаДаты = 4;
	
	//Сообщить(Текст.КоличествоСтрок());
	
	Текст = ПолучитьСтатистикуИзБазы(НачалоМесяца(НачалоПериода),КонецМесяца(КонецПериода));
	//Сообщить(Текст.ПолучитьТекст());
	
	тз = Отчеты.уб_СтатистикаПоСтраховкам.ПустаяТЗ();
	//Возврат тз;
	КэшСотрудников = Неопределено;
	ДатаКэша  = Неопределено; 
	
	НачальнаяСтрока = 2;
	
	// 0      1       2      3      4        5    6
	//full;internet;manual;musor;OfficialID;FIO;period
	
	КолонкаФИО    = 5 ;//FIO
	КолонкаКода   = 4;//OfficialID
	//КолонкаСуммы  = 5-1;
	//КолонкаКоличестваПолного = 0;
	КолонкаДаты = 6;
	КолонкаКоличестваНовых     = 0;
	КолонкаКоличестваВручную   = 2;
	КолонкаКоличестваМусор     = 3;
	КолонкаКоличестваИнтернет  = 1;
	
	//КолонкаКоличестваПролонгаций = 4-1;
	кэшОшибок = Новый Массив;
	ВсегоСтрок = Текст.КоличествоСтрок();
	Если ВсегоСтрок>0 и СтрЧислоВхождений (Текст.ПолучитьСтроку(1),";")<КолонкаФИО Тогда
		Сообщить("Неверный формат?"+Символы.ПС+ Текст.ПолучитьТекст());
	КонецЕсли;	
	
	ЗапросПоКодамСРМ = Новый Запрос("ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.КодCRM
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.КодCRM <> """"");
	ВыборкаКодов = ЗапросПоКодамСРМ.Выполнить().Выбрать();								
	Для счетчик = НачальнаяСтрока по Текст.КоличествоСтрок() Цикл
		ТекСтрока = Текст.ПолучитьСтроку(счетчик);
		Массив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ТекСтрока,";");
		Если Массив.Количество()<7 Тогда
			Возврат ТЗ;
		КонецЕсли;	
		//Сообщить(Массив.Количество());
		Если ВыборкаКодов.НайтиСледующий(Новый Структура("КодCRM",СокрЛП(Массив[КолонкаКода])))= Истина Тогда
			ФизЛицо =  ВыборкаКодов.Ссылка;
			
		Иначе	
			ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Массив[КолонкаФИО]);	
			Если ФизЛицо.Пустая() Тогда
				Если РольДоступна("ПолныеПрава") Тогда
					Если Найти("null,Оператор Оператор,Нетленная Анна",Массив[КолонкаФИО]) =0 Тогда
						Сообщение = "Не найден сотрудник для пользователя базы "+Массив[КолонкаФИО]+"/"+Массив[КолонкаКода];
						Если кэшОшибок.Найти(Сообщение) = Неопределено Тогда
							Сообщить(Сообщение+" Заявок: "+Массив[КолонкаКоличестваНОвых]);
							кэшОшибок.Добавить(Сообщение);
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			Иначе	
				//Если ПравоДоступа("Изменение", ФизЛицо.Метаданные()) Тогда
				//	об = ФизЛицо.ПолучитьОбъект();
				//	об.КодCRM = СокрлП(Массив[КолонкаКода]);
				//	об.Записать();
				//КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		ВыборкаКодов.Сбросить();
		//ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Массив[КолонкаФИО]);
		//Если ФизЛицо.Пустая() = ЛОЖЬ И ЗначениеЗаполнено(ФизЛицо.КодCRM) = Ложь ТОГДА
		//	Если ПравоДоступа("Изменение", ФизЛицо.Метаданные()) Тогда
		//		об = ФизЛицо.ПолучитьОбъект();
		//		об.КодCRM = СокрлП(Массив[КолонкаКода]);
		//		об.Записать();
		//	КонецЕсли;
		//ИначеЕсли ФизЛицо.Пустая() Тогда
		//	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("КодCRM",СокрЛП(Массив[КолонкаКода]));
		//	Если ФизЛицо.Пустая() Тогда
		//		Если РольДоступна("ПолныеПрава") Тогда
		//			Если Найти("null,Оператор Оператор,Нетленная Анна",Массив[КолонкаФИО]) =0 Тогда
		//				Сообщение = "Не найден сотрудник для пользователя базы "+Массив[КолонкаФИО]+"/"+Массив[КолонкаКода];
		//				Если кэшОшибок.Найти(Сообщение) = Неопределено Тогда
		//					Сообщить(Сообщение+" Заявок: "+Массив[КолонкаКоличестваПолного]);
		//					кэшОшибок.Добавить(Сообщение);
		//				КонецЕсли;	
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЕсли;	
		//КонецЕсли;	
		Период = НачалоМесяца(ДатаИзСтроки(Массив[КолонкаДаты],2));
		Если НЕ(Период>=НачалоПериода И Период<=КонецПериода) Тогда
			Продолжить;
		КонецЕсли;	
		
		Строка = тз.Добавить();	
		Строка.Период 				= Период;
		Строка.Агент 				= ФизЛицо;
		Строка.Личная 				= Ложь;
		Строка.ВидСП 				= ВидСП;
		Строка.НаправлениеПлатежа 	= Перечисления.уб_НаправленияПлатежа.ВБрокер;
		//Строка.Подразделение =уб_КЭШируемые.Подчиненные();
		Строка.ТипЗначения ="Количественные";
		Если КэшСотрудников = Неопределено ИЛИ ДатаКЭША<>Строка.Период Тогда
			КэшСотрудников = уб_КЭШируемые.ПолучитьСписокСотрудниковАктуальныхВМесяце(НачалоМесяца(Строка.Период),Истина);
			ДатаКЭША = Строка.Период;
		КонецЕсли;	
		
		МассивПодразделений = КэшСотрудников.НайтиСтроки(Новый Структура("Агент",Строка.Агент));
		Если МассивПодразделений.Количество()>0 Тогда
			
			СтрокаПодразделения = МассивПодразделений[0];
			
			Строка.Подразделение = СтрокаПодразделения.Подразделение;
			Строка.Организация   = СтрокаПодразделения.Организация
		Иначе
			Строка.Подразделение = "<Неизвестно>";
		КонецЕсли;
		//Если Найти("223,247,300",СокрлП(Массив[КолонкаКода])) >  0 Тогда
		//	//316?Пеший
		//	Строка.Подразделение = "РОП";
		//Иначе
		Если ФизЛицо.Пустая() Тогда
			Строка.Агент = Массив[КолонкаФИО];
		КонецЕсли;	
		
		Строка.РасчетПо = 0;  // 0 - по сумме, 1 - по средней
		
		//ЗаполнитьЗначенияСвойств(Строка,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка.ТипЗначения = "Количественные";
		Попытка
			Строка.Значение = Число(Массив[КолонкаКоличестваНОвых]);//Теперь они уже включены+Число(Массив[КолонкаКоличестваВручную]);
		Исключение
			Строка.Значение = 0;
		КонецПопытки;		
		Строка.Показатель = "Обработано новых заявок";
		Строка.Сортировка = "$ОбработаноНовыхЗаявок";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения ="Количественные";
		Попытка
			Строка2.Значение = Число(Массив[КолонкаКоличестваМусор]);
		Исключение
			Строка2.Значение = 0;
		КонецПопытки;	
		Строка2.Показатель = "Обработано мусор база";
		Строка2.Сортировка = "@ОбработаноМусорБаза";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения ="Количественные";
		Попытка
			Строка2.Значение = Число(Массив[КолонкаКоличестваИнтернет]);
		Исключение
			Строка2.Значение = 0;
		КонецПопытки;	
		Строка2.Показатель = "Обработано интернет база";
		Строка2.Сортировка = "@ОбработаноИнтернетБаза";
		
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Попытка
		//	Строка2.Значение = Число(Массив[КолонкаКоличестваПролонгаций]);
		//Исключение
		//	Строка2.Значение = 0;
		//КонецПопытки;	
		//Строка2.Показатель = "Обработано пролонгаций база";
		//Строка2.Сортировка = "@ОбработаноПролонгацийБаза";
		
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Попытка
		//	Строка2.Значение = Окр(Число(Массив[КолонкаСуммы])*Строка.Значение/1000,2);//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		//Исключение
		//	Строка2.Значение = 0;
		//КонецПопытки;	
		//Строка2.Показатель = "Стоимость авто по обработанным заявкам, тыс";
		//Строка2.Сортировка = "160";
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		//Строка2.Показатель = "Стоимость авто по обработанным заявкам (ср),тыс";
		//Строка2.Сортировка = "160";
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		//Строка2.Сортировка = "__";
		//Строка2.Показатель = "Эффективность";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "_1";
		Строка2.Показатель = "Средняя скидка первых взносов";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "_2";
		Строка2.Показатель = "Средняя скидка остальных взносов";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "!!";
		Строка2.Показатель = "Средняя эффективная скидка";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "___";
		Строка2.Показатель = "Приведенная скидка по первым";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "___";
		Строка2.Показатель = "СубЭффективность";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "@Конверсия";
		Строка2.Показатель = "Конверсия";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "$$Конверсия первых";
		Строка2.Показатель = "Конверсия новых";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "^^Конверсия вторых";
		Строка2.Показатель = "Конверсия вторых взносов";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "##Конверсия пролонгаций";
		Строка2.Показатель = "Конверсия пролонгаций";
	КонецЦикла;	
	//ЗапросДополнение = Новый Запрос;
	//ЗапросДополнение.Текст = "Выбрать * из &тз КАК Данные";
	////Требуеемые показатели
	//"Показатель"
	//"Значение"
	//"Период"
	//"Агент"
	//"Личная"
	//"ВидСП"
	//"Подразделение"
	//"ФормаОплаты"
	//"Организация"
	////для сортировки и настройки отчета
	//"ТипЗначения"
	//"Сортировка"
	//"РасчетПо" // 0 - по сумме, 1 - по средней
	//"Динамика"
	Возврат ТЗ;
КонецФункции	


Функция ДанныеИзБазы2()
	//ИмяФайла = "D:\!1C\избазы.csv";
	//Текст = Новый ТекстовыйДокумент;
	//Текст.Прочитать(ИмяФайла);
	//КолонкаФИО = 3 ;
	//КолонкаКода = 2 ;
	//КолонкаСуммы = 1;
	//КолонкаКоличества = 0;
	//КолонкаДаты = 4;
	
	//Сообщить(Текст.КоличествоСтрок());
	
	Текст = ПолучитьСтатистикуИзБазы(НачалоМесяца(НачалоПериода),КонецМесяца(КонецПериода));
	//Сообщить(Текст.ПолучитьТекст());
	
	тз = Отчеты.уб_СтатистикаПоСтраховкам.ПустаяТЗ();
	//Возврат тз;
	КэшСотрудников = Неопределено;
	ДатаКэша  = Неопределено; 
	
	НачальнаяСтрока = 2;
	
	
	//full;internet;manual;musor;OfficialID;FIO;period
	
	КолонкаФИО = 7-1 ;
	КолонкаКода = 6-1 ;
	КолонкаСуммы = 5-1;
	КолонкаКоличестваПолного = 0;
	КолонкаДаты = 8-1-2;
	КолонкаКоличестваНОвых = 2-1;
	КолонкаКоличестваВручную = 3-1;
	КолонкаКоличестваПролонгаций = 4-1;
	кэшОшибок = Новый Массив;
	ВсегоСтрок = Текст.КоличествоСтрок();
	Если ВсегоСтрок>0 и СтрЧислоВхождений (Текст.ПолучитьСтроку(1),";")<КолонкаФИО Тогда
		Сообщить("Неверный формат?"+Символы.ПС+ Текст.ПолучитьТекст());
	КонецЕсли;	
	
	ЗапросПоКодамСРМ = Новый Запрос("ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.КодCRM
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.КодCRM <> """"");
	ВыборкаКодов = ЗапросПоКодамСРМ.Выполнить().Выбрать();								
	Для счетчик = НачальнаяСтрока по Текст.КоличествоСтрок() Цикл
		ТекСтрока = Текст.ПолучитьСтроку(счетчик);
		Массив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ТекСтрока,";");
		Если Массив.Количество()<7 Тогда
			Возврат ТЗ;
		КонецЕсли;	
		//Сообщить(Массив.Количество());
		Если ВыборкаКодов.НайтиСледующий(Новый Структура("КодCRM",СокрЛП(Массив[КолонкаКода])))= Истина Тогда
			ФизЛицо =  ВыборкаКодов.Ссылка;
			
		Иначе	
			ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Массив[КолонкаФИО]);	
			Если ФизЛицо.Пустая() Тогда
				Если РольДоступна("ПолныеПрава") Тогда
					Если Найти("null,Оператор Оператор,Нетленная Анна",Массив[КолонкаФИО]) =0 Тогда
						Сообщение = "Не найден сотрудник для пользователя базы "+Массив[КолонкаФИО]+"/"+Массив[КолонкаКода];
						Если кэшОшибок.Найти(Сообщение) = Неопределено Тогда
							Сообщить(Сообщение+" Заявок: "+Массив[КолонкаКоличестваПолного]);
							кэшОшибок.Добавить(Сообщение);
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			Иначе	
				Если ПравоДоступа("Изменение", ФизЛицо.Метаданные()) Тогда
					об = ФизЛицо.ПолучитьОбъект();
					об.КодCRM = СокрлП(Массив[КолонкаКода]);
					об.Записать();
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		ВыборкаКодов.Сбросить();
		//ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Массив[КолонкаФИО]);
		//Если ФизЛицо.Пустая() = ЛОЖЬ И ЗначениеЗаполнено(ФизЛицо.КодCRM) = Ложь ТОГДА
		//	Если ПравоДоступа("Изменение", ФизЛицо.Метаданные()) Тогда
		//		об = ФизЛицо.ПолучитьОбъект();
		//		об.КодCRM = СокрлП(Массив[КолонкаКода]);
		//		об.Записать();
		//	КонецЕсли;
		//ИначеЕсли ФизЛицо.Пустая() Тогда
		//	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("КодCRM",СокрЛП(Массив[КолонкаКода]));
		//	Если ФизЛицо.Пустая() Тогда
		//		Если РольДоступна("ПолныеПрава") Тогда
		//			Если Найти("null,Оператор Оператор,Нетленная Анна",Массив[КолонкаФИО]) =0 Тогда
		//				Сообщение = "Не найден сотрудник для пользователя базы "+Массив[КолонкаФИО]+"/"+Массив[КолонкаКода];
		//				Если кэшОшибок.Найти(Сообщение) = Неопределено Тогда
		//					Сообщить(Сообщение+" Заявок: "+Массив[КолонкаКоличестваПолного]);
		//					кэшОшибок.Добавить(Сообщение);
		//				КонецЕсли;	
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЕсли;	
		//КонецЕсли;	
		Период = НачалоМесяца(ДатаИзСтроки(Массив[КолонкаДаты],2));
		Если НЕ(Период>=НачалоПериода И Период<=КонецПериода) Тогда
			Продолжить;
		КонецЕсли;	
		Строка = тз.Добавить();	
		Строка.Показатель 			= "Обработано заявок всего";
		Строка.Значение 			= Число(Массив[КолонкаКоличестваПолного]);
		Строка.Период 				= Период;
		Строка.Агент 				= ФизЛицо;
		Строка.Личная 				= Ложь;
		Строка.ВидСП 				= Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
		Строка.НаправлениеПлатежа 	= Перечисления.уб_НаправленияПлатежа.ВБрокер;
		//Строка.Подразделение =уб_КЭШируемые.Подчиненные();
		Строка.ТипЗначения ="Количественные";
		Если КэшСотрудников = Неопределено ИЛИ ДатаКЭША<>Строка.Период Тогда
			КэшСотрудников = уб_КЭШируемые.ПолучитьСписокСотрудниковАктуальныхВМесяце(НачалоМесяца(Строка.Период),Истина);
			ДатаКЭША = Строка.Период;
		КонецЕсли;	
		
		МассивПодразделений = КэшСотрудников.НайтиСтроки(Новый Структура("Агент",Строка.Агент));
		Если МассивПодразделений.Количество()>0 Тогда
			
			СтрокаПодразделения = МассивПодразделений[0];
			
			Строка.Подразделение = СтрокаПодразделения.Подразделение;
			Строка.Организация   = СтрокаПодразделения.Организация
		Иначе
			Строка.Подразделение = "<Неизвестно>";
		КонецЕсли;
		//Если Найти("223,247,300",СокрлП(Массив[КолонкаКода])) >  0 Тогда
		//	//316?Пеший
		//	Строка.Подразделение = "РОП";
		//Иначе
		Если ФизЛицо.Пустая() Тогда
			Строка.Агент = Массив[КолонкаФИО];
		КонецЕсли;	
		
		Строка.РасчетПо = 0;  // 0 - по сумме, 1 - по средней
		Строка.Сортировка = "@ОбработаноЗаявок";
		КолонкаКоличестваНОвых = 2-1;
		КолонкаКоличестваВручную = 3-1;
		КолонкаКоличестваПролонгаций = 4-1;
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Попытка
			Строка2.Значение = Число(Массив[КолонкаКоличестваНОвых])+Число(Массив[КолонкаКоличестваВручную]);
		Исключение
			Строка2.Значение = 0;
		КонецПопытки;		
		Строка2.Показатель = "Обработано новых заявок";
		Строка2.Сортировка = "$ОбработаноНовыхЗаявок";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Попытка
			Строка2.Значение = Число(Массив[КолонкаКоличестваПролонгаций]);
		Исключение
			Строка2.Значение = 0;
		КонецПопытки;	
		Строка2.Показатель = "Обработано пролонгаций база";
		Строка2.Сортировка = "@ОбработаноПролонгацийБаза";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Попытка
			Строка2.Значение = Окр(Число(Массив[КолонкаСуммы])*Строка.Значение/1000,2);//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Исключение
			Строка2.Значение = 0;
		КонецПопытки;	
		Строка2.Показатель = "Стоимость авто по обработанным заявкам, тыс";
		Строка2.Сортировка = "160";
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		//Строка2.Показатель = "Стоимость авто по обработанным заявкам (ср),тыс";
		//Строка2.Сортировка = "160";
		//Строка2 = тз.Добавить();	
		//ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		//Строка2.ТипЗначения = "Суммовые";
		//Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		//Строка2.Сортировка = "__";
		//Строка2.Показатель = "Эффективность";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "_1";
		Строка2.Показатель = "Средняя скидка первых взносов";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "_2";
		Строка2.Показатель = "Средняя скидка остальных взносов";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "!!";
		Строка2.Показатель = "Средняя эффективная скидка";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "___";
		Строка2.Показатель = "Приведенная скидка по первым";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "___";
		Строка2.Показатель = "СубЭффективность";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "@Конверсия";
		Строка2.Показатель = "Конверсия";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "$$Конверсия первых";
		Строка2.Показатель = "Конверсия новых";
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "^^Конверсия вторых";
		Строка2.Показатель = "Конверсия вторых взносов";
		
		Строка2 = тз.Добавить();	
		ЗаполнитьЗначенияСвойств(Строка2,Строка,,"ТипЗначения,Значение,Показатель,Сортировка");
		Строка2.ТипЗначения = "Суммовые";
		Строка2.Значение = 0;//Приводим к полной сумме, чтобы корректней усреднять по подразделению
		Строка2.Сортировка = "##Конверсия пролонгаций";
		Строка2.Показатель = "Конверсия пролонгаций";
	КонецЦикла;	
	//ЗапросДополнение = Новый Запрос;
	//ЗапросДополнение.Текст = "Выбрать * из &тз КАК Данные";
	////Требуеемые показатели
	//"Показатель"
	//"Значение"
	//"Период"
	//"Агент"
	//"Личная"
	//"ВидСП"
	//"Подразделение"
	//"ФормаОплаты"
	//"Организация"
	////для сортировки и настройки отчета
	//"ТипЗначения"
	//"Сортировка"
	//"РасчетПо" // 0 - по сумме, 1 - по средней
	//"Динамика"
	Возврат ТЗ;
КонецФункции	
Функция ДатаИзСтроки(дата,Вариант=1)
	Попытка
		Если Вариант=1 Тогда
			Возврат Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(Дата,"-","")," ",""),":",""))
		Иначе
			Возврат Дата( Сред (Дата,7,4)+Сред (Дата,4,2)+Сред (Дата,1,2));
		КонецЕсли;	
	Исключение
		Возврат Дата(1,1,1);
	КонецПопытки;
КонецФункции	
Функция ПолучитьСтатистикуИзБазы(dateStart,dateEnd) Экспорт
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("tmp");
	
	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.ОткрытьФайл(ИмяФайлаОтправки, "UTF-8");
	ОбъектXML.ЗаписатьОбъявлениеXML();
	
	ОбъектXML.ЗаписатьНачалоЭлемента("rq");
	
	//ОбъектXML.ЗаписатьАтрибут("hash", "b22be856-b27a-4ee2-beae-2491403c2a85");//УИД ЖЕЛЕЗА ВРЕМЕННЫЙ!!!
	ОбъектXML.ЗаписатьАтрибут("type","stat");
	ОбъектXML.ЗаписатьАтрибут("dateStart",Строка(dateStart));
	ОбъектXML.ЗаписатьАтрибут("dateEnd",Строка(dateEnd));
	
	ОбъектXML.ЗаписатьАтрибут("hash", уб_КЭШируемые.SID());
	ОбъектXML.ЗаписатьАтрибут("uid", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID"));
	ОбъектXML.ЗаписатьАтрибут("sessid", "");
	ОбъектXML.ЗаписатьАтрибут("comp_name", ИмяКомпьютера());
	Если ЗначениеЗаполнено(ВидСП) Тогда
		
		//Если ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Грузы Тогда	
		//	riskTypes = "21";
		Если ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДМС Тогда	
			riskTypes = "11,12";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДСАГО Тогда	
			riskTypes = "8";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Имущество или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека Тогда	
			riskTypes = "10";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКОПП Тогда		
			riskTypes = "1,2,3";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.НС Тогда	
			riskTypes = "";
		//ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОПО Тогда		
		//	riskTypes = "14";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда		
			riskTypes = "4";
		//ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.СРО Тогда		
		//	riskTypes = "15";
		ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР Тогда
			riskTypes = "";
		//ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ГО Тогда	
		//	riskTypes = "";
		Иначе
			//Сообщить("Не известный вид СП из базы");
			riskTypes = "";//0,1,2,3,4,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29";
		КонецЕсли;
		ОбъектXML.ЗаписатьАтрибут("riskTypes", riskTypes);
	Иначе
		ОбъектXML.ЗаписатьАтрибут("riskTypes", "0,1,2,3,4,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29");
	КонецЕсли;
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьБезОбработки("");
	ОбъектXML.Закрыть();
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
	
	Сервер = "www.sluice";
	Порт = 80 ;
	
	HTTP = Новый HTTPСоединение(Сервер, Порт);
	
	ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("tmp");
	Попытка
		HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, "", ИмяПолученногоФайла, ЗаголовокHTTP);
	Исключение
		УдалитьФайлы(ИмяФайлаОтправки,);
		
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
	КонецПопытки;
	
	Текст = Новый ТекстовыйДокумент; 
	Текст.Прочитать(ИмяПолученногоФайла); 
	
	//Стр = "";
	//
	//Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
	//	Стр = Стр + Текст.ПолучитьСтроку(НомерСтроки) + "
	//	|"; 
	//КонецЦикла; 
	
	УдалитьФайлы(ИмяФайлаОтправки,);
	УдалитьФайлы(ИмяПолученногоФайла,);
	
	Возврат Текст;
	
КонецФункции



