&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СписокЗначимых = Новый Массив;	
	СписокЗначимых = Отчет.СписокЗначимых;
	СписокЗначимых.Добавить("ЗарплатныйПериод");
	СписокЗначимых.Добавить("ВидРасчетаСАгентом");
	СписокЗначимых.Добавить("ИсключитьИзРасчетаЗП");
	СписокЗначимых.Добавить("ВознаграждениеМенеджера");
	СписокЗначимых.Добавить("ОплаченоФакт");
	СписокЗначимых.Добавить("СкидкаВыплаченаяКлиенту");
	СписокЗначимых.Добавить("НачисленнаяСуммаВзноса");
	СписокЗначимых.Добавить("КВСуммаДляАгента");
	СписокЗначимых.Добавить("ПолисАннулирован");
	СписокЗначимых.Добавить("Агент");
	СписокЗначимых.Добавить("Проведен");
	//еще добавленные
	СписокЗначимых.Добавить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику");
	СписокЗначимых.Добавить("ЭтоКрупнаяСделка");
	СписокЗначимых.Добавить("ИсключитьИзРасчетаЗП");
	СписокЗначимых.Добавить("ПометкаУдаления");
	СписокЗначимых.Добавить("Страхователь");
	СписокЗначимых.Добавить("КВПроцентДляАгента");
	СписокЗначимых.Добавить("ПроверенаЗП");
	
	//
	Попытка
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НачПериода",Параметры.НачПериода);
		СтруктураПараметров.Вставить("КонПериода",Параметры.КонПериода);
		СтруктураПараметров.Вставить("Менеджер",Параметры.Менеджер);
		СтруктураПараметров.Вставить("РасчетныйПериод",Параметры.РасчетныйПериод);
		СтруктураПараметров.Вставить("ФильтрПоПериоду",Параметры.ФильтрПоПериоду);
		
		Для каждого Параметр из СтруктураПараметров Цикл
			Попытка
				Отчет[Параметр.Ключ] = Параметр.Значение;
			Исключение
			КонецПопытки;	
		КонецЦикла;
	Исключение
	КонецПопытки;
	Если Параметры.Свойство("Сформровать") Тогда
		СформироватьНаСервере()
	КонецЕсли;	
	
КонецПроцедуры

Процедура ИнициализироватьНастройки(ПараметрыПодчиненных,СписокРазрешенныхМенеджеров)
	Отказ = Ложь;
	НовыйПериод = Неопределено;
	Если ПараметрыСеанса.уб_ЭтоМенеджер Тогда
		Элементы.Менеджер.КнопкаВыбора = Ложь;
		уб_СС.ПодчиненныеРуководителя(, ?(НовыйПериод = Неопределено, Отчет.КонПериода, НовыйПериод), ПараметрыПодчиненных);
		КоличествоВСписке = ПараметрыПодчиненных.ТЗ.Количество();
		СписокРазрешенныхМенеджеров = ПараметрыПодчиненных.СписокСотрудников;
		Если КоличествоВСписке = 0 Тогда
			Отказ = Истина;
			Элементы.Менеджер.СписокВыбора.Очистить();
			Элементы.Менеджер.КнопкаСпискаВыбора	= Ложь;
			Элементы.Менеджер.Доступность 		= Ложь;
		Иначе
			Если КоличествоВСписке > 1 Тогда
				Элементы.Менеджер.Доступность = Истина;
				СЗ = ПараметрыПодчиненных.СписокСотрудников;
				Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
				Элементы.Менеджер.КнопкаСпискаВыбора = Истина;
				Если Элементы.Менеджер.СписокВыбора.НайтиПоЗначению(Отчет.Менеджер) = Неопределено Тогда
					Менеджер = Неопределено
				КонецЕсли;
			Иначе
				Менеджер = ПараметрыПодчиненных.Сотрудник;
				Элементы.Менеджер.СписокВыбора.Очистить();
				Элементы.Менеджер.Доступность			= Ложь;
				Элементы.Менеджер.КнопкаСпискаВыбора	= Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.Менеджер.СписокВыбора = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Отчет.КонПериода);
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура СформироватьНаСервере()
	
	Перем ПараметрыПодчиненных,СписокРазрешенныхМенеджеров;
	
	ИнициализироватьНастройки(ПараметрыПодчиненных,СписокРазрешенныхМенеджеров);
	
	Обработка = РеквизитФормыВЗначение("Отчет");
	ПредставлениеОтбора = "";
	Если Отчет.Менеджер.Пустая() И СписокРазрешенныхМенеджеров = Неопределено Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОПЛАТЫРП.ОбъектИстории КАК ОбъектИстории
		|ПОМЕСТИТЬ ОПЛАТЫРП
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории КАК ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		уб_ИсторияРеквизит.РеквизитОбъекта.Наименование = ""ЗарплатныйПериод""
		|		И уб_ИсторияРеквизит.Период >= &Дата1
		|		И уб_ИсторияРеквизит.Период <= &Дата2
		|		И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(уб_ИсторияРеквизит.ЗначениеРеквизита КАК ДАТА), МЕСЯЦ) = &РасчетныйПериод
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&Дата1, РеквизитОбъекта.Наименование = ""ЗарплатныйПериод"") КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(уб_ИсторияРеквизит.ЗначениеРеквизита КАК ДАТА), МЕСЯЦ) = &РасчетныйПериод) КАК ОПЛАТЫРП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ИсторияРеквизит.ОбъектИстории КАК Оплата,
		|	уб_ИсторияРеквизит.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	уб_ИсторияРеквизит.ЗначениеРеквизита КАК ЗначениеРеквизита,
		|	уб_ИсторияРеквизит.Период КАК Период,
		|	уб_ИсторияРеквизит.РеквизитОбъекта.Синоним КАК РеквизитОбъектаСиноним
		|ПОМЕСТИТЬ ИзмененыеОплаты
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
		|ГДЕ
		|	уб_ИсторияРеквизит.Период > &Дата1
		|	И уб_ИсторияРеквизит.Период <= &Дата2
		|	И уб_ИсторияРеквизит.ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|	И НЕ уб_ИсторияРеквизит.РеквизитОбъекта.Наименование В (&МассивЗапрещенныхРеквизитов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмененыеОплаты.Оплата КАК Оплата,
		|	ИзмененыеОплаты.Оплата.Агент КАК Агент,
		|	НАЧАЛОПЕРИОДА(ИзмененыеОплаты.Оплата.ЗарплатныйПериод, МЕСЯЦ) КАК РасчетныйПериод,
		|	ИзмененыеОплаты.Период КАК ДатаПравки,
		|	ИзмененыеОплаты.ЗначениеРеквизита КАК НовоеЗначение,
		|	ИзмененыеОплаты.НаименованиеРеквизита КАК Наименование,
		|	уб_ИсторияОбъект.НомерВерсии КАК НомерВерсии,
		|	ИзмененыеОплаты.Оплата.ВидСП КАК ВИД,
		|	ИзмененыеОплаты.РеквизитОбъектаСиноним КАК РеквизитОбъектаСиноним
		|ИЗ
		|	ИзмененыеОплаты КАК ИзмененыеОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
		|		ПО ИзмененыеОплаты.Оплата = уб_ИсторияОбъект.ОбъектИстории
		|			И ИзмененыеОплаты.Период = уб_ИсторияОбъект.Период
		|ГДЕ
		|	ИзмененыеОплаты.НаименованиеРеквизита В(&СписокЗначимых)
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Агент,
		|	ИзмененыеОплаты.Оплата.ЗарплатныйПериод,
		|	Оплата,
		|	ДатаПравки,
		|	Наименование" );	
		ПредставлениеОтбора =" "+Формат(Отчет.РасчетныйПериод,"ДФ='MMMM yyyy'");		
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОПЛАТЫМЕНЕДЖЕРА.ОбъектИстории КАК ОбъектИстории
		|ПОМЕСТИТЬ ОплатыМенеджера
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории КАК ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		уб_ИсторияРеквизит.РеквизитОбъекта.Наименование = ""Агент""
		|		И уб_ИсторияРеквизит.ЗначениеРеквизита В(&СписокМенеджеров)
		|		И уб_ИсторияРеквизит.Период >= &Дата1
		|		И уб_ИсторияРеквизит.Период <= &Дата2
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&Дата1, РеквизитОбъекта.Наименование = ""Агент"") КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		уб_ИсторияРеквизит.ЗначениеРеквизита В(&СписокМенеджеров)) КАК ОПЛАТЫМЕНЕДЖЕРА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОПЛАТЫРП.ОбъектИстории КАК ОбъектИстории
		|ПОМЕСТИТЬ ОПЛАТЫРП
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории КАК ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		уб_ИсторияРеквизит.РеквизитОбъекта.Наименование = ""ЗарплатныйПериод""
		|		И уб_ИсторияРеквизит.Период >= &Дата1
		|		И уб_ИсторияРеквизит.Период <= &Дата2
		|		И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(уб_ИсторияРеквизит.ЗначениеРеквизита КАК ДАТА), МЕСЯЦ) = &РасчетныйПериод
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		уб_ИсторияРеквизит.ОбъектИстории
		|	ИЗ
		|		РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&Дата1, РеквизитОбъекта.Наименование = ""ЗарплатныйПериод"") КАК уб_ИсторияРеквизит
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(уб_ИсторияРеквизит.ЗначениеРеквизита КАК ДАТА), МЕСЯЦ) = &РасчетныйПериод) КАК ОПЛАТЫРП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уб_ИсторияРеквизит.ОбъектИстории КАК Оплата,
		|	уб_ИсторияРеквизит.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	уб_ИсторияРеквизит.ЗначениеРеквизита КАК ЗначениеРеквизита,
		|	уб_ИсторияРеквизит.Период КАК Период,
		|	уб_ИсторияРеквизит.РеквизитОбъекта.Синоним КАК РеквизитОбъектаСиноним
		|ПОМЕСТИТЬ ИзмененыеОплаты
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОплатыМенеджера КАК ОплатыМенеджера
		|		ПО уб_ИсторияРеквизит.ОбъектИстории = ОплатыМенеджера.ОбъектИстории
		|ГДЕ
		|	уб_ИсторияРеквизит.Период > &Дата1
		|	И уб_ИсторияРеквизит.Период <= &Дата2
		|	И уб_ИсторияРеквизит.ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
		|	И НЕ уб_ИсторияРеквизит.РеквизитОбъекта.Наименование В (&МассивЗапрещенныхРеквизитов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмененыеОплаты.Оплата КАК Оплата,
		|	ИзмененыеОплаты.Оплата.Агент КАК Агент,
		|	НАЧАЛОПЕРИОДА(ИзмененыеОплаты.Оплата.ЗарплатныйПериод, МЕСЯЦ) КАК РасчетныйПериод,
		|	ИзмененыеОплаты.Период КАК ДатаПравки,
		|	ИзмененыеОплаты.ЗначениеРеквизита КАК НовоеЗначение,
		|	ИзмененыеОплаты.НаименованиеРеквизита КАК Наименование,
		|	уб_ИсторияОбъект.НомерВерсии КАК НомерВерсии,
		|	ИзмененыеОплаты.Оплата.ВидСП КАК ВИД,
		|	ИзмененыеОплаты.РеквизитОбъектаСиноним КАК РеквизитОбъектаСиноним
		|ИЗ
		|	ИзмененыеОплаты КАК ИзмененыеОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
		|		ПО ИзмененыеОплаты.Оплата = уб_ИсторияОбъект.ОбъектИстории
		|			И ИзмененыеОплаты.Период = уб_ИсторияОбъект.Период
		|ГДЕ
		|	ИзмененыеОплаты.НаименованиеРеквизита В(&СписокЗначимых)
		|	И 1 = 1");
		Если Отчет.Менеджер.Пустая() Тогда
			Запрос.УстановитьПараметр("СписокМенеджеров", СписокРазрешенныхМенеджеров);
			ПредставлениеОтбора =" "+Формат(Отчет.РасчетныйПериод,"ДФ='MMMM yyyy'");
		Иначе
			СЗ = Новый СписокЗначений;
			СЗ.Добавить(Отчет.Менеджер);
			Запрос.УстановитьПараметр("СписокМенеджеров", СЗ);
			ПредставлениеОтбора = " "+Формат(Отчет.РасчетныйПериод,"ДФ='MMMM yyyy'") + " для " + СокрЛП(Отчет.Менеджер);
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("РасчетныйПериод",				НачалоМесяца(Отчет.РасчетныйПериод));
	Запрос.УстановитьПараметр("Дата1",							Отчет.НачПериода);	
	Запрос.УстановитьПараметр("Дата2",							Отчет.КонПериода);	
	Запрос.УстановитьПараметр("СписокЗначимых",					Отчет.СписокЗначимых);
	Запрос.УстановитьПараметр("МассивЗапрещенныхРеквизитов",	Документы.уб_ОплатаПолисов.МассивЗапрещенныхРеквизитов());
	Если Отчет.ФильтрПоПериоду Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//*//"," ");
	КонецЕсли;	
	ВысотаФиксации = 4;
	Макет = Обработка.ПолучитьМакет("Макет");
	ОбластьМенеджеры 		= Макет.ПолучитьОбласть("Менеджер");
	ОбластьРасчетныйПериод 	= Макет.ПолучитьОбласть("РасчетныйПериод");
	ОбластьОплата 			= Макет.ПолучитьОбласть("Оплата");
	ОбластьДатаПравки 		= Макет.ПолучитьОбласть("ДатаПравки");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьШапка			= Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	Таб = ЭтаФорма.Результат;
	Таб.Очистить();
	Таб.АвтоМасштаб 			= Истина;
	Таб.ОтображатьГруппировки 	= Истина;
	Таб.ОтображатьСетку 		= Ложь;
	Таб.ТолькоПросмотр 			= Истина;
	Таб.ОтображатьЗаголовки 	= Ложь;
	Таб.НачатьАвтогруппировкуСтрок();
	//
	ОбластьЗаголовок.Параметры.Дата1 = Формат(Отчет.НачПериода,"ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Дата2 = Формат(Отчет.КонПериода,"ДФ=dd.MM.yyyy; ДП=...");
	ОбластьЗаголовок.Параметры.ПредставлениеОтбора=ПредставлениеОтбора;
	Таб.Вывести(ОбластьЗаголовок);
	Таб.Вывести(ОбластьШапка);
	//
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультата.Количество() > 0 Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
		Массив.Добавить(Тип("Число"));
		Массив.Добавить(Тип("Дата"));
		Массив.Добавить(Тип("Булево"));
		Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		Массив.Добавить(Тип("ПеречислениеСсылка.уб_ВидыРасчетовСАгентом")); 	
		//
		ТаблицаРезультата.Колонки.Добавить("СтароеЗначение",	Новый ОписаниеТипов(Массив));
		ТаблицаРезультата.Колонки.Добавить("СИсторией",			Новый ОписаниеТипов("Булево"));
		Рег = РегистрыСведений.уб_ИсторияРеквизит;
		ВсегоСтрокТЗ = ТаблицаРезультата.Количество();
		ТекущийПериод = НачалоМесяца(ТекущаяДата());
		Для СчетчикСтрок = 1 по ВсегоСтрокТЗ Цикл
			СтрокаТЗ = ТаблицаРезультата[ВсегоСтрокТЗ-СчетчикСтрок];
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта,
			|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита
			|ИЗ
			|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
			|			&Дата,
			|			ОбъектИстории = &ОбъектИстории
			|				И РеквизитОбъекта.Наименование = &НаименованиеРеквизита) КАК уб_ИсторияРеквизитСрезПоследних";
			Запрос.УстановитьПараметр("Дата", 					СтрокаТЗ.ДатаПравки - 1);
			Запрос.УстановитьПараметр("ОбъектИстории", 			СтрокаТЗ.Оплата);
			Запрос.УстановитьПараметр("НаименованиеРеквизита", 	СтрокаТЗ.Наименование);			
			Срез = Запрос.Выполнить().Выбрать();			
			//Срез = Рег.СрезПоследних(СтрокаТз.ДатаПравки-1, Новый Структура("ОбъектИстории,НаименованиеРеквизита",СтрокаТз.Оплата,СтрокаТз.Наименование));
			Если Срез.Следующий() Тогда
				СтрокаТЗ.СтароеЗначение = Срез.ЗначениеРеквизита;
				СтрокаТЗ.СИсторией 		= Истина;
			КонецЕсли;	
			Если СтрокаТЗ.СтароеЗначение = СтрокаТЗ.НовоеЗначение Тогда
				ТаблицаРезультата.Удалить(СтрокаТЗ);
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТЗ.СтароеЗначение)И НЕ ЗначениеЗаполнено(СтрокаТЗ.НовоеЗначение) Тогда	
				ТаблицаРезультата.Удалить(СтрокаТЗ);
			КонецЕсли;	
		КонецЦикла;	
		ТаблицаРезультата.Сортировать("Вид,Оплата,ДатаПравки");
		ПредОплата 		= "";
		ПредДатаПравки  = "";
		Для каждого ВыборкаОплаты из ТаблицаРезультата	Цикл
			Оплата = ВыборкаОплаты.Оплата;
			Если НЕ ПредОплата = Оплата Тогда
				ОбластьОплата.Параметры.Заполнить(ВыборкаОплаты);
				МетаданныеРегистратора= Оплата.Метаданные();
				Полис = Оплата.СтраховойПолис;
				Префикс = "";
				Если НЕ ПараметрыДоступа("Чтение",МетаданныеРегистратора,"Номер,Дата,СтраховойПолис").ОграничениеУсловием Тогда
					Префикс = "Оплата (№ "+СокрЛП(Оплата.Номер)+" от "+Формат(Оплата.Дата,"ДФ=dd.MM.yyyy")+") ";	
				Иначе	
					Попытка
						Префикс = "Оплата (№ "+СокрЛП(Оплата.Номер)+" от "+Формат(Оплата.Дата,"ДФ=dd.MM.yyyy")+") ";	
					Исключение
						Префикс = "К этой оплате нет доступа ("+МетаданныеРегистратора.Синоним+") ";
					КонецПопытки;	
				КонецЕсли;
				Суффикс = "";
				Если НЕ ПараметрыДоступа("Чтение",Полис.Метаданные(),"СтраховойПродукт").ОграничениеУсловием Тогда
					Суффикс = "полиса № "+СокрЛП(Полис.Номер)+" от "+Формат(Полис.Дата,"ДФ=dd.MM.yyyy")+" / "+Сокрлп(Полис.СтраховойПродукт);	
				Иначе	
					Попытка
						Суффикс = "полиса № "+СокрЛП(Полис.Номер)+" от "+Формат(Полис.Дата,"ДФ=dd.MM.yyyy")+" / "+Сокрлп(Полис.СтраховойПродукт);	
					Исключение
						Суффикс = ". К полису нет доступа ";
					КонецПопытки;	
				КонецЕсли;	
				ОбластьОплата.Параметры.ОплатаСтрока = Префикс+Суффикс;
				ОбластьОплата.Параметры.Оплата = Оплата;
				Таб.Вывести(ОбластьОплата,0);
				ПредОплата = Оплата;
				ПредДатаПравки = "";
			КонецЕсли;
			ДатаПравки = ВыборкаОплаты.Датаправки;
			Если НЕ ПредДатаПравки = ДатаПравки Тогда
				СписокЗначений = Новый СписокЗначений;
				СписокЗначений.Добавить(Оплата,	"Открыть оплату");
				СписокЗначений.Добавить(Полис,	"Открыть полис");
				СписокЗначений.Добавить(ВыборкаОплаты.ДатаПравки);
				СписокЗначений.Добавить(ВыборкаОплаты.НомерВерсии);
				ОбластьДатаПравки.Параметры.Заполнить(ВыборкаОплаты);
				ОбластьДатаПравки.Параметры.Расшифровка = СписокЗначений;
				Таб.Вывести(ОбластьДатаПравки,1);
				ПредДатаПравки = ДатаПравки;	
			КонецЕсли;	
			ОбластьСтрока.Параметры.Заполнить(ВыборкаОплаты);
			Если ЗначениеЗаполнено(ВыборкаОплаты.РеквизитОбъектаСиноним) Тогда
				ОбластьСтрока.Параметры.Наименование = ВыборкаОплаты.РеквизитОбъектаСиноним;
			КонецЕсли;	
			ОбластьСтрока.Параметры.Расшифровка = СписокЗначений;
			Если ТипЗнч(ВыборкаОплаты.НовоеЗначение)=Тип("Число") ИЛИ ТипЗнч(ВыборкаОплаты.СтароеЗначение)=Тип("Число") Тогда
				Если ТипЗнч(ВыборкаОплаты.СтароеЗначение) =Тип("Неопределено") Тогда
					ОбластьСтрока.Параметры.СтароеЗначение = 0;
				Конецесли;
				Если ТипЗнч(ВыборкаОплаты.НовоеЗначение) =Тип("Неопределено") Тогда
					ОбластьСтрока.Параметры.НовоеЗначение = 0;
				Конецесли;
				ОбластьСтрока.Область("Строка").Формат ="ЧЦ=15; ЧДЦ=2; ЧН=";
			ИначеЕсли ТипЗнч(ВыборкаОплаты.НовоеЗначение)= Тип("Дата") ИЛИ ТипЗнч(ВыборкаОплаты.СтароеЗначение)=Тип("Дата") Тогда
				ОбластьСтрока.Область("Строка").Формат ="ДФ='MMMM yyyy'";	
			Иначе
				ОбластьСтрока.Область("Строка").Формат ="";
			КонецЕсли;	
			Таб.Вывести(ОбластьСтрока,2);
		КонецЦикла;	//Оплаты
		Таб.ЗакончитьАвтогруппировкуСтрок();
	Конецесли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

