
Перем мФорма Экспорт;
Перем мКаталогСмайлов;
Перем мСмайл Экспорт;

Перем мПутьКИсполняемымФайлам;

Перем мИмяФайла;
Перем СписокПользователей Экспорт;
Перем ОтображениеТолькоАктивных Экспорт;

// Процедура производит создание рабочего каталога и копирование в него исплолняемых файлов
//
Процедура ЗарегистрироватьAutoItX() Экспорт
	Попытка
		Если НЕ ПроверитьФайл(КаталогВременныхФайлов() + "\AutoIt") Тогда
			СоздатьКаталог(КаталогВременныхФайлов() + "AutoIt");
			ДвоичныеДанные = ПолучитьМакет("AutoIt");
			ИмяФайла = КаталогВременныхФайлов() + "AutoIt\AutoIt.exe";
			ДвоичныеДанные.Записать(ИмяФайла);
		КонецЕсли;
	Исключение
		Сообщить("Неудачная попытка регистрации AutoItX3.dll:
		|" + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
КонецПроцедуры //ЗарегистрироватьAutoItX()

Функция ПроверитьФайл(ИмяФайла) Экспорт
	КаталогНаДиске = Новый Файл(ИмяФайла);
	Возврат КаталогНаДиске.Существует();
КонецФункции

// Процедура подготавливает скрипт
//
//  Параметры:
//   1. ИмяСкрипта - Строка - имя скрипта
//
Процедура ПодготовитьСкрипт(ИмяСкрипта)
	Макет = ПолучитьМакет("СкриптыAutoIt");
	ТекстСкрипта = Макет.Области[ИмяСкрипта].Текст;
	ИмяФайла = КаталогВременныхФайлов() + "AutoIt\_Script.au3";	
	Файл = Новый ЗаписьТекста(ИмяФайла,КодировкаТекста.Системная);
	Файл.Записать(ТекстСкрипта);
	Файл.Закрыть();
КонецПроцедуры //ПодготовитьСкрипт

// Процедура выводит сообщение в трей
//
//  Параметры:
//   1. ТекстПодсказки - Строка - текст выводимого сообщения
//   2. ТекстЗаголовка - Строка - заголовок выводимого сообщения
//   3. Опция - Число - обозначае тип иконки сообщения (0 - без иконки,1 - информация, 2 - предупреждение, 3 - ошибка)
//   4. ВремяПоказа - Число - время показа выводимого сообщения в мс.
//
Процедура ВывестиПодсказкуВТрей(ТекстПодсказки = "",ТекстЗаголовка = "",Опция = 1,ВремяПоказа = 5000) Экспорт
	ПодготовитьСкрипт("СкриптПодсказкиВТрее");
	СтрокаКоманды = """" + мПутьКИсполняемымФайлам + """ """
	+ мИмяФайла + """ """ + ТекстПодсказки + """"
	+ " """ + ТекстЗаголовка + """"
	+ " " + Опция + " " + СтрЗаменить(Строка(ВремяПоказа),Символы.НПП,"");
	// выполнение скрипта
	ЗапуститьПриложение(СтрокаКоманды);
Конецпроцедуры //ВывестиПодсказкуВТрей()

Процедура ДействияПриОткрытии() Экспорт
	
	ЗаполнитьСписокПользователей(мФорма.Пользователи);
	ОбновитьСписокКаналов();
	УправлениеВидимостьюЭлементовФормы();
	ЗарегистрироватьAutoItX();
	ЗаполнитьНастройкиПользователя();
	
	мФорма.Заголовок = "Чат (пользователь):" + ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПользователя()
	
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		
		Результат = уб_Чат_Общий.ПолучитьНастройкуПользователя(Реквизит.Имя);
		
		Если Результат <> Неопределено Тогда
			ЭтотОбъект[Реквизит.Имя] = Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьНастройкиПользователя()

Процедура чат_СохранитьНастройкиПользователя(ИмяРеквизита) Экспорт
	
	Попытка
	
		Настройка = ПланыВидовХарактеристик.чат_НастройкиПользователей[ИмяРеквизита];
		Набор = РегистрыСведений.уб_Чат_НастройкиПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
		Набор.Отбор.Настройка.Установить(Настройка);
		
		Запись = Набор.Добавить();
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Настройка = Настройка;
		Запись.Значение = ЭтотОбъект[ИмяРеквизита];
		
		Набор.Записать();
		
	Исключение
		// неверное имя реквизита или настройки
	КонецПопытки;
	
	
КонецПроцедуры //чат_СохранитьНастройкиПользователя()

Процедура ЗаполнитьСписокПользователей(ТаблицаПользователей) Экспорт
	
	ТаблицаПользователей.Очистить();
	Соединения = ПолучитьСоединенияИнформационнойБазы();
	Пользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	мФорма.ЭлементыФормы.НадписьУведомления.Значение 		= "нет новых сообщений...";
	мФорма.ЭлементыФормы.НадписьУведомления.ЦветТекстаПоля	= Новый Цвет(137,132,119);
	мФорма.ЭлементыФормы.НадписьСсылка.Заголовок 			= "";
	мФорма.ЭлементыФормы.ПолеКартинкиУведомления.Картинка 	= БиблиотекаКартинок.чат_Уведомления_офф;
	мФорма.ПользовательУведомлений							= Справочники.Пользователи.ПустаяСсылка();
			
	Для Каждого Пользователь Из Пользователи Цикл
		Если Пользователь.ПоказыватьВСпискеВыбора Или Пользователь.АутентификацияОС Тогда
			НСтрока = ТаблицаПользователей.Добавить();
			СпрПользователь = СписокПользователей[Пользователь.Имя];
			Если СпрПользователь = Неопределено  Тогда
				СпрПользователь = Справочники.Пользователи.НайтиПоКоду(Пользователь.Имя);
				Если СпрПользователь.Пустая() Тогда
				Иначе
					СписокПользователей.Вставить(Пользователь.Имя,СпрПользователь.Ссылка);
				КонецЕсли;	
			КонецЕсли;	
			НСтрока.Имя = СпрПользователь;
			НСтрока.Пол = ОпределитьПол(Пользователь.Имя);
			НСтрока.Активен = Ложь;
			Для Каждого Соединение Из Соединения Цикл
				ПользовательСоединения = Соединение.Пользователь;
				Если ПользовательСоединения <> Неопределено И ПользовательСоединения.Имя = Пользователь.Имя Тогда
					НСтрока.Активен = Истина;
				КонецЕсли;
			КонецЦикла;
			
			НСтрока.ЕстьНепрочитанные = ОпределитьНаличиеНепрочитанныхЛичныхСообщений(СпрПользователь);
			Если ОтображениеТолькоАктивных Тогда
				Если НСтрока.ЕстьНепрочитанные ИЛИ НСтрока.Активен Тогда
				Иначе
					ТаблицаПользователей.Удалить(НСтрока);
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			Если НСтрока.ЕстьНепрочитанные Тогда
				ТекстСообщения = ПолучитьТекстПоследнегоЛичногоСообщения(СпрПользователь,ПараметрыСеанса.ТекущийПользователь);
				Если мФорма.ПоказыватьВсплывающиеПодсказки Тогда
					ВывестиПодсказкуВТрей(ТекстСообщения,"Сообщение от " + Пользователь.Имя);
				КонецЕсли;
				
				// информация в панели уведомлений
				мФорма.ЭлементыФормы.НадписьУведомления.Значение 		= "Получено сообщение от пользователя: " + Пользователь.Имя;
				мФорма.ЭлементыФормы.НадписьУведомления.ЦветТекстаПоля	= Новый Цвет(153,51,0);
				мФорма.ЭлементыФормы.НадписьСсылка.Заголовок 			= ТекстСообщения;
				мФорма.ЭлементыФормы.ПолеКартинкиУведомления.Картинка 	= БиблиотекаКартинок.чат_Уведомления_он;
				мФорма.ПользовательУведомлений							= СпрПользователь;
			Иначе
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Отсортируем по алфАвиту
	ТаблицаПользователей.Сортировать("Имя");
	
КонецПроцедуры //ЗаполнитьСписокПользователей()

Функция ПолучитьТекстПоследнегоЛичногоСообщения(Отправитель,Получатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	чат_Сообщения.Сообщение,
	|	чат_Сообщения.Период КАК Дата
	|ИЗ
	|	РегистрСведений.уб_Чат_Сообщения КАК чат_Сообщения
	|ГДЕ
	|	чат_Сообщения.Отправитель = &Отправитель
	|	И чат_Сообщения.Получатель = &Получатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Отправитель",Отправитель);
	Запрос.УстановитьПараметр("Получатель",Получатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сообщение;
	КонецЕсли;
	Возврат "";
	
КонецФункции //ПолучитьТекстПоследнегоЛичногоСообщения()

Процедура ПоказатьЛичнуюПереписку(Пользователь = Неопределено) Экспорт
	
	Форма = ПолучитьФорму("ФормаСообщения",мФорма);
	Форма.Получатели.Добавить(?(Пользователь = Неопределено,мФорма.ЭлементыФормы.Пользователи.ТекущиеДанные.Имя,Пользователь));
	Форма.РежимПереписки = Истина;
	Форма.ОткрытьМодально();
	
КонецПроцедуры //ПоказатьЛичнуюПереписку()

Процедура ЗаполнитьПереписку(Форма) Экспорт
	
	ЗаполнитьСписокСообщений(,ПараметрыСеанса.ТекущийПользователь, Форма.ЭлементыФормы.ПанельКорреспондентов.ТекущаяСтраница.Значение,Форма);	
	
КонецПроцедуры //ЗаполнитьПереписку()

Процедура ОбновитьКаналыПереписки(Форма) Экспорт
	
	Для Каждого Корреспондент Из Форма.Получатели Цикл
		Форма.ЭлементыФормы.ПанельКорреспондентов.Страницы.Добавить(Корреспондент.Значение.Код,Корреспондент.Значение,Корреспондент.Значение,БиблиотекаКартинок.чат_Канал);
	КонецЦикла;
	Форма.ЭлементыФормы.ПанельКорреспондентов.Страницы.Удалить(0);
	
КонецПроцедуры //ОбновитьКаналыПереписки()

Функция ОпределитьНаличиеНепрочитанныхЛичныхСообщений(Отправитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	чат_НепрочитанныеСообщения.ИДСообщения
	|ИЗ
	|	РегистрСведений.уб_Чат_НепрочитанныеСообщения КАК чат_НепрочитанныеСообщения
	|ГДЕ
	|	чат_НепрочитанныеСообщения.Пользователь = &Пользователь
	|	И чат_НепрочитанныеСообщения.Отправитель = &Отправитель";
	Запрос.УстановитьПараметр("Отправитель",Отправитель);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции //ОпределитьНаличиеНепрочитанныхЛичныхСообщений()

Процедура ВыполнитьДействияПоРасписанию() Экспорт
	//Сохраним пользователя
	ТекущиеДанные = мФорма.ЭлементыФормы.Пользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекПользователь ="Не найден пользователь";		
	Иначе
		ТекПользователь = ТекущиеДанные.Имя;
	КонецЕсли;	
	ЗаполнитьСписокПользователей(мФорма.Пользователи);
	ЗаполнитьСписокСообщений(мФорма.ЭлементыФормы.ПанельПереключенияКаналов.ТекущаяСтраница.Заголовок);
	
	//Восстановим активную строку
	СтрокаСПользователем = мФорма.Пользователи.Найти(ТекПользователь,"Имя");
	Если СтрокаСПользователем = Неопределено Тогда
	Иначе
		мФорма.ЭлементыФормы.Пользователи.ТекущаяСтрока = СтрокаСПользователем;
	КонецЕсли;
	
КонецПроцедуры //ВыполнитьДействияПоРасписанию()

Функция ОпределитьПол(Имя)
	
	Попытка
		СпрПользователь = СписокПользователей[Имя];
			Если СпрПользователь = Неопределено  Тогда
				СпрПользователь = Справочники.Пользователи.НайтиПоКоду(Имя);
				Если СпрПользователь.Пустая() Тогда
				Иначе
					СписокПользователей.Вставить(Имя,СпрПользователь.Ссылка);
				КонецЕсли;	
			КонецЕсли;	
		//Если Пользователь <> Неопределено Тогда
		//	Если ЗначениеЗаполнено(Пользователь.ФизЛицо) И ЗначениеЗаполнено(Пользователь.ФизЛицо.Пол) Тогда
				Возврат НРег(Лев(Строка(СпрПользователь.ФизЛицо.Пол),1));
		//	Иначе
		//		Возврат "н";	
		//	КонецЕсли;
		//Иначе
		//	Возврат "н";
		//КонецЕсли;
	Исключение
		Возврат "н";
	КонецПопытки;
	
КонецФункции //ОпределитьПол()

Процедура ОбновитьСписокКаналов() Экспорт
	
	Для Каждого Страница Из мФорма.ЭлементыФормы.ПанельПереключенияКаналов.Страницы Цикл
		мФорма.ЭлементыФормы.ПанельПереключенияКаналов.Страницы.Удалить(Страница);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(чат_Каналы.Иконка) КАК Иконка,
	|	МАКСИМУМ(чат_Каналы.Общий) КАК Общий,
	|	чат_Каналы.ИмяКанала
	|ИЗ
	|	РегистрСведений.уб_Чат_Каналы КАК чат_Каналы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_ДоступККаналам КАК чат_ДоступККаналам
	|		ПО (чат_ДоступККаналам.ИмяКанала = чат_Каналы.ИмяКанала)
	|ГДЕ
	|	(чат_ДоступККаналам.УровеньДоступа >= &УровеньДоступа
	|				И чат_ДоступККаналам.Пользователь = &Пользователь
	|			ИЛИ чат_Каналы.Общий)
	|
	|СГРУППИРОВАТЬ ПО
	|	чат_Каналы.ИмяКанала";
	
	Запрос.УстановитьПараметр("Пользователь"	,ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("УровеньДоступа"	,1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ИмяКанала) Тогда
			Попытка
				Картинка = БиблиотекаКартинок[Выборка.Иконка];
			Исключение
				// нет такой картинки
			КонецПопытки;
			Страница = мФорма.ЭлементыФормы.ПанельПереключенияКаналов.Страницы.Добавить(,Выборка.ИмяКанала,,Картинка);
		КонецЕсли;
	КонецЦикла;
	
	мФорма.ЭлементыФормы.ПанельПереключенияКаналов.Страницы.Удалить(0);
	
КонецПроцедуры //ОбновитьСписокКаналов()

Процедура УправлениеВидимостьюЭлементовФормы()
	
	#Если Клиент Тогда
	ЕстьПравоАдмина = ПользовательАдминистратор();
	мФорма.ЭлементыФормы.ОсновнаяПанель.Страницы.Администрирование.Видимость = ЕстьПравоАдмина; 
	мФорма.ЭлементыФормы.ОсновнаяПанель.ОтображениеЗакладок = ?(ЕстьПравоАдмина,ОтображениеЗакладок.Сверху,ОтображениеЗакладок.НеИспользовать);
	#КонецЕсли
КонецПроцедуры //УправлениеВидимостьюЭлементовФормы()

Процедура ДействияПриСменеСтраницыКаналов() Экспорт
	
	Попытка
		ЗаполнитьСписокСообщений(мФорма.ЭлементыФормы.ПанельПереключенияКаналов.ТекущаяСтраница.Заголовок);
	Исключение
	КонецПопытки;
	
КонецПроцедуры //ДействияПриСменеСтраницыКаналов()

Функция ПользовательАдминистратор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	чат_ДоступККаналам.ИмяКанала
	|ИЗ
	|	РегистрСведений.уб_Чат_ДоступККаналам КАК чат_ДоступККаналам
	|ГДЕ
	|	чат_ДоступККаналам.Пользователь = &Пользователь
	|	И чат_ДоступККаналам.УровеньДоступа = &УровеньДоступа";
	
	Запрос.УстановитьПараметр("Пользователь"	,ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("УровеньДоступа"	,10);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //ПользовательАдминистратор()

Процедура ЗаполнитьСписокСообщений(Канал = "",Получатель = Неопределено, Отправитель = Неопределено,Форма = Неопределено)
	
	Если Форма = Неопределено Тогда
		Форма = мФорма;
	КонецЕсли;
	
	//&&&+
	// оптимизировать этот кусок!!!!
	Если Получатель = Неопределено Тогда
		СписокПолучателей = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить(Получатель);
		СписокПолучателей.Добавить(Отправитель);
	КонецЕсли;
	
	Если Отправитель = Неопределено Тогда
		СписокОтправителей = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		СписокОтправителей = Новый СписокЗначений;
		СписокОтправителей.Добавить(Получатель);
		СписокОтправителей.Добавить(Отправитель);
	КонецЕсли;
	//&&&+
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	чат_Сообщения.Период КАК Дата,
	|	чат_Сообщения.Сообщение,
	|	чат_Сообщения.Отправитель,
	|	чат_Сообщения.ИмяИконки,
	|	чат_НепрочитанныеСообщения.ИДСообщения,
	|	чат_Сообщения.Вложения,
	|	чат_Сообщения.ЕстьВложения
	|ИЗ
	|	РегистрСведений.уб_Чат_Сообщения КАК чат_Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_НепрочитанныеСообщения КАК чат_НепрочитанныеСообщения
	|		ПО чат_Сообщения.ИДСообщения = чат_НепрочитанныеСообщения.ИДСообщения
	|			И (чат_НепрочитанныеСообщения.Пользователь = &Пользователь)
	|ГДЕ
	|	чат_Сообщения.ИмяКанала = &ИмяКанала
	|	И чат_Сообщения.Получатель В(&Получатели)
	|	И ВЫБОР
	|			КОГДА &ЕстьОтборПоОтправителю
	|				ТОГДА чат_Сообщения.Отправитель В (&Отправители)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И чат_Сообщения.Период МЕЖДУ &НачПериода И &КонПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ИмяКанала",Канал);
	Запрос.УстановитьПараметр("Получатели"				,СписокПолучателей);
	Запрос.УстановитьПараметр("Отправители"				,СписокОтправителей);
	Запрос.УстановитьПараметр("ЕстьОтборПоОтправителю"	,ЗначениеЗаполнено(Отправитель));
	Запрос.УстановитьПараметр("НачПериода"				,НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода"				,КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Пользователь"			,ПараметрыСеанса.ТекущийПользователь);
	
	Форма.ЭлементыФормы.ПолеСообщений.Значение.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НСтрока = Форма.ЭлементыФормы.ПолеСообщений.Значение.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока,Выборка);
		Если Выборка.ЕстьВложения Тогда
			НСтрока.ПредставлениеВложений = ПолучитьПредставлениеВложений(ЗначениеИзСтрокиВнутр(Выборка.Вложения.Получить()));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьСписокСообщений()

Функция ПолучитьПредставлениеВложений(ТЗВложений)
	
	СписокВозврата = Новый СписокЗначений;
	
	Для Каждого СтрокаВложения Из ТЗВложений Цикл
		СписокВозврата.Добавить(СтрокаВложения.Ссылка);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции //ПолучитьПредставлениеВложений()

Функция ПолучитьКартинкуИконки(ИмяИконки) Экспорт
	
	Попытка
		Картинка = БиблиотекаКартинок[ИмяИконки];
	Исключение
		// нет такой картинки в библиотеке
		Попытка
			Картинка = Новый Картинка(мКаталогСмайлов + "\" + ИмяИконки + ".gif",Истина);
		Исключение
			// нигде нет такой картинки
			Картинка = БиблиотекаКартинок.чат_КартинкаНеопределено;
		КонецПопытки;
	КонецПопытки;
	
	Возврат Картинка;
	
КонецФункции //ПолучитьКартинкуИконки()

Процедура ОткрытьПрофильПользователя(Пользователь) Экспорт
	
	Форма = ПолучитьФорму("ФормаПользователя");
	Форма.Пользователь = Пользователь;
	Форма.ОткрытьМодально();
	
КонецПроцедуры //ОткрытьПрофильПользователя()

Процедура ЗаполнитьПараметрыПользователя(Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	чат_НастройкиПользователей.Настройка,
	|	чат_НастройкиПользователей.Значение,
	|	чат_НастройкиПользователей.Хранилище
	|ИЗ
	|	РегистрСведений.уб_Чат_НастройкиПользователей КАК чат_НастройкиПользователей
	|ГДЕ
	|	чат_НастройкиПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Форма.Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Настройка = ПланыВидовХарактеристик.чат_НастройкиПользователей.Фотография Тогда
			Попытка
				Форма.ЭлементыФормы.ПолеКартинки.Картинка = Выборка.Хранилище.Получить();
			Исключение
				// не картинка
			КонецПопытки;
		Иначе
			Попытка
				Форма.ЭлементыФормы[СтрЗаменить(Строка(Выборка.Настройка)," ","")].Значение = Выборка.Значение;
			Исключение
				// ошибка
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьПараметрыПользователя()

Процедура СохранитьПараметрыПользователя(Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	чат_НастройкиПользователей.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.чат_НастройкиПользователей КАК чат_НастройкиПользователей
	|ГДЕ
	|	чат_НастройкиПользователей.Предопределенный
	|	И (НЕ чат_НастройкиПользователей.ЭтоГруппа)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Хранилище = Неопределено;
		Если Выборка.Ссылка = ПланыВидовХарактеристик.чат_НастройкиПользователей.Фотография Тогда
			Хранилище = Новый ХранилищеЗначения(Форма.ЭлементыФормы.ПолеКартинки.Картинка);
			Значение = "Картинка";
		ИначеЕсли Выборка.Ссылка = ПланыВидовХарактеристик.чат_НастройкиПользователей.Пол Тогда
			
		Иначе
			Попытка
				Значение = Форма.ЭлементыФормы[СтрЗаменить(Строка(Выборка.Ссылка)," ","")].Значение;
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Набор = РегистрыСведений.уб_Чат_НастройкиПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Форма.Пользователь);
		Набор.Отбор.Настройка.Установить(Выборка.Ссылка);
		
		Запись = Набор.Добавить();
		Запись.Пользователь = Форма.Пользователь;
		Запись.Настройка 	= Выборка.Ссылка;
		Запись.Значение 	= Значение;
		Запись.Хранилище	= Хранилище;
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //СохранитьПараметрыПользователя()

Процедура ОтправитьСообщение(Получатель = Неопределено,Форма = Неопределено) Экспорт
	
	Если Форма = Неопределено Тогда // отправка в канал (не личное)
		Форма = мФорма;
	КонецЕсли;
	
	Текст = Форма.ЭлементыФормы.ПолеСообщения.ПолучитьТекст();
	
	Если Получатель = Неопределено Тогда // отправка в канал (не личное)
		ИмяКанала = Форма.ЭлементыФормы.ПанельПереключенияКаналов.ТекущаяСтраница.Заголовок;
	КонецЕсли;
	
	ИдСообщения = Новый УникальныйИдентификатор();
	мДата = ТекущаяДата();
	
	//вложения
	Значение = ЗначениеВСтрокуВнутр(Форма.ТабличноеПолеВложений);
	Хранилище = Новый ХранилищеЗначения(Значение);
	
	Набор = РегистрыСведений.уб_Чат_Сообщения.СоздатьНаборЗаписей();
	Набор.Отбор.ИмяКанала.Установить(ИмяКанала);
	Набор.Отбор.ИдСообщения.Установить(ИдСообщения);
	Набор.Отбор.Период.Установить(мДата);
	Набор.Отбор.Получатель.Установить(Получатель);
	Набор.Отбор.Отправитель.Установить(ПараметрыСеанса.ТекущийПользователь);
	
	Запись = Набор.Добавить();
	Запись.ИмяКанала 	= ИмяКанала;
	Запись.ИдСообщения 	= ИдСообщения;
	Запись.Период 		= мДата;
	Запись.Отправитель 	= ПараметрыСеанса.ТекущийПользователь;
	Запись.Сообщение 	= Текст;
	Запись.Вложения		= Хранилище;
	Запись.ИмяИконки	= мСмайл;
	Запись.Получатель	= Получатель;
	Запись.ЕстьВложения = Форма.ТабличноеПолеВложений.Количество() <> 0;
	
	Набор.Записать();
	
	// пометка о прочтении для пользователей
	
	Если Получатель = Неопределено Тогда // отправка в канал (не личное)
		Для Каждого Пользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
			ПользовательИБ = Справочники.Пользователи.НайтиПоКоду(Пользователь.Имя);
			Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
			Набор.Отбор.ИДСообщения.Установить(ИдСообщения);
			Набор.Отбор.Пользователь.Установить(ПользовательИБ);
			Набор.Отбор.Период.Установить(КонецДня(ТекущаяДата()));
			Запись = Набор.Добавить();
			Запись.ИДСообщения = ИДСообщения;
			Запись.Пользователь = ПользовательИБ;
			Запись.Период = КонецДня(ТекущаяДата());
			Набор.Записать();
		КонецЦикла;
		ЗаполнитьСписокСообщений(Форма.ЭлементыФормы.ПанельПереключенияКаналов.ТекущаяСтраница.Заголовок);
		Форма.ЭлементыФормы.ПолеСообщения.УстановитьТекст("");
		Форма.ТабличноеПолеВложений.Очистить();
	Иначе
		// уведомление о личном сообщении
		Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
		Набор.Отбор.ИДСообщения.Установить(ИдСообщения);
		Набор.Отбор.Пользователь.Установить(Получатель);
		Набор.Отбор.Отправитель.Установить(ПараметрыСеанса.ТекущийПользователь);
		Набор.Отбор.Период.Установить(КонецДня(ТекущаяДата()));
		
		Запись = Набор.Добавить();
		Запись.ИДСообщения 	= ИДСообщения;
		Запись.Пользователь = Получатель;
		Запись.Отправитель 	= ПараметрыСеанса.ТекущийПользователь;
		Запись.Период 		= КонецДня(ТекущаяДата());
		
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры //ОтправитьСообщение()

Процедура ОтправитьЛичноеСообщение() Экспорт
	
	СписокПолучателей = Новый СписокЗначений;
	Для Каждого Строка Из мФорма.ЭлементыФормы.Пользователи.ВыделенныеСтроки Цикл
		СписокПолучателей.Добавить(Строка.Имя);	
	КонецЦикла;
	Форма = ПолучитьФорму("ФормаСообщения",мФорма);
	Форма.Получатели = СписокПолучателей;
	Форма.ОткрытьМодально();
	
КонецПроцедуры //ОтправитьЛичноеСообщение()

Процедура ОтправитьСообщенияПолучателям(ФормаСообщения) Экспорт
	
	Для Каждого Получатель Из ФормаСообщения.Получатели Цикл
		ОтправитьСообщение(Получатель.Значение,ФормаСообщения);	
	КонецЦикла;
	ФормаСообщения.ЭлементыФормы.ПолеСообщения.УстановитьТекст("");
	ФормаСообщения.ТабличноеПолеВложений.Очистить();
	мСмайл = Неопределено;
	ОбновитьПредставлениеСмайла(ФормаСообщения)
	
КонецПроцедуры //ОтправитьСообщенияПолучателям()

Процедура ЗаполнитьПанельИконок(Форма) Экспорт
	#Если Клиент Тогда
	ВсеКартинки = Метаданные.ОбщиеКартинки;
	мРазмерСмайлов = 34;
	ВозможноеКоличествоПоГоризонтали = Цел(Форма.ЭлементыФормы.ПанельИконок.Ширина / мРазмерСмайлов);
	СЧ = 0;
	ТекущийВерх = 0;
	Для Каждого Картинка Из ВсеКартинки Цикл
		Если Форма.Режим = "Смайлы" И Найти("0123456789",Сред(Картинка.Имя,5,1)) = 0 Тогда 
			Продолжить;
		КонецЕсли;
		Если СЧ = ВозможноеКоличествоПоГоризонтали Тогда
			СЧ = 0;
			ТекущийВерх = ТекущийВерх + мРазмерСмайлов;
		КонецЕсли;
		Кнопка = Форма.ЭлементыФормы.Добавить(Тип("Кнопка"),Картинка.Имя,,Форма.ЭлементыФормы.ПанельИконок);
		Кнопка.Высота 			= мРазмерСмайлов;
		Кнопка.Ширина 			= мРазмерСмайлов;
		Кнопка.Лево 			= СЧ * мРазмерСмайлов;
		Кнопка.Верх 			= ТекущийВерх;
		Картинка = БиблиотекаКартинок[Картинка.Имя];
		Кнопка.Картинка 		= Картинка;
		Кнопка.Рамка 			= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
		Кнопка.ЦветФонаКнопки 	= ЦветаСтиля.ЦветФонаФормы;
		
		Действие = Новый Действие("ОбработкаНажатияКнопки");
		Кнопка.УстановитьДействие("Нажатие",Действие);
		
		СЧ = СЧ + 1;
	КонецЦикла;
	#КонецЕсли 
КонецПроцедуры //ЗаполнитьПанельИконок()


Процедура ЗаписатьДанныеКанала(Форма) Экспорт
	
	Набор = РегистрыСведений.уб_Чат_Каналы.СоздатьНаборЗаписей();
	Набор.Отбор.ИмяКанала.Установить(Форма.ИмяКанала);
	
	Запись = Набор.Добавить();
	Запись.ИмяКанала 	= Форма.ИмяКанала;
	Запись.Иконка 		= Форма.ИконкаКанала;
	Запись.Общий		= Форма.Общий;
	
	Набор.Записать();
	
КонецПроцедуры //ЗаписатьДанныеКанала()

Процедура ПометитьСообщениеКакПрочтенное(Форма) Экспорт
	
	Если Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
	Набор.Отбор.ИДСообщения.Установить(Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные.ИДСообщения);
	Набор.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	Набор.Отбор.Период.Установить(КонецДня(ТекущаяДата()));
	Если Форма.Заголовок = "Сообщение" Тогда
		Набор.Отбор.Отправитель.Установить(Форма.ЭлементыФормы.ПанельКорреспондентов.ТекущаяСтраница.Значение);	
	КонецЕсли;
	Набор.Записать();
	Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные.ИДСообщения = Неопределено;
	
	// одновременно удалим сообщения старше одного дня
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	чат_НепрочитанныеСообщения.ИДСообщения,
	|	чат_НепрочитанныеСообщения.Пользователь,
	|	чат_НепрочитанныеСообщения.Период
	|ИЗ
	|	РегистрСведений.уб_Чат_НепрочитанныеСообщения КАК чат_НепрочитанныеСообщения
	|ГДЕ
	|	чат_НепрочитанныеСообщения.Период < &Период";
	Запрос.УстановитьПараметр("Период",НачалоДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
		Набор.Отбор.ИДСообщения.Установить(Выборка.ИДСообщения);
		Набор.Отбор.Пользователь.Установить(Выборка.Пользователь);
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры //ПометитьСообщениеКакПрочтенное()

Процедура ДобавитьВложенияПодбором(ИмяГруппыМетаданных,ФормаРодитель) Экспорт
	
		СписокМетаданных = Новый СписокЗначений;
		Если ИмяГруппыМетаданных = "Документы" Тогда
			Картинка = БиблиотекаКартинок.ДокументОбъект;
			Заголовок = "Выберите вид документов";
		ИначеЕсли ИмяГруппыМетаданных = "Справочники" Тогда
			Картинка = БиблиотекаКартинок.СправочникОбъект;
			Заголовок = "Выберите вид справочников";
		КонецЕсли;
		
		Для каждого Элемент ИЗ Метаданные[ИмяГруппыМетаданных] Цикл
			
			СписокМетаданных.Добавить(Элемент.Имя, Элемент.Синоним,, Картинка);			
			
		КонецЦикла;
		
		ВыбранныйТип = СписокМетаданных.ВыбратьЭлемент(Заголовок);
		
		Если ВыбранныйТип <> Неопределено Тогда
			Форма = Неопределено;
			СтрокаКоманды = "Форма = " + ИмяГруппыМетаданных + "." + ВыбранныйТип.Значение + ".ПолучитьФормуВыбора(,мФорма)";
			Выполнить(СтрокаКоманды);
			
			Результат = Форма.ОткрытьМодально();
			Если Результат <> Неопределено Тогда
				
				НСтрока = ФормаРодитель.ТабличноеПолеВложений.Добавить();
				НСтрока.Ссылка 		= Результат;
				НСтрока.ТипСсылки 	= ИмяГруппыМетаданных + "." + ВыбранныйТип;
				
			КонецЕсли;
		КонецЕсли;
	
КонецПроцедуры //ДобавитьВложенияПодбором()

Процедура ОткрытьСписокВложений(Форма) Экспорт
	
	Если Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные.ПредставлениеВложений) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	Объект = Форма.ЭлементыФормы.ПолеСообщений.ТекущиеДанные.ПредставлениеВложений.ВыбратьЭлемент();
	Если Объект <> Неопределено Тогда
		ФормаОбъекта = Объект.Значение.ПолучитьФорму();
		ФормаОбъекта.Открыть();
	КонецЕсли;
	
КонецПроцедуры //ОткрытьСписокВложений()

Процедура ОбновитьПредставлениеСмайла(Форма) Экспорт
	
	Попытка
		Форма.ЭлементыФормы.КоманднаяПанельПоляСообщения.Кнопки.Смайлы.Картинка = БиблиотекаКартинок[мСмайл];
	Исключение
		         // ошибка
	КонецПопытки;
	
КонецПроцедуры //ОбновитьПредставлениеСмайла()

мПутьКИсполняемымФайлам = КаталогВременныхФайлов() + "AutoIt\AutoIt.exe";
мИмяФайла 				= КаталогВременныхФайлов() + "AutoIt\_Script.au3";	

СписокПользователей  = Новый Соответствие;
ОтображениеТолькоАктивных = Ложь;