
Функция ДайТзОплатПоУИДСтроки(УИДСтроки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	К.ОплатаПолиса,
	|	К.ОплатаПолиса.ОплаченоФакт КАК КОплате,
	|	К.ОплатаПолиса.ФормаОплаты КАК ФормаОплаты,
	|	К.ОплатаПолиса.НомерКвитанции КАК НомерКвитанции,
	|	К.ОплатаПолиса.Номер КАК НомерОплаты,
	|	К.ОплатаПолиса.Дата КАК ДатаОплаты,
	|	К.ОплатаПолиса.ОтчетПоставщику КАК ОтчетПоставщику,
	|	К.ОплатаПолиса.ИсключитьИзРасчетаЗП КАК ИсключитьИзРасчетаЗП,
	|	К.ОплатаПолиса.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
	|	К.ОплатаПолиса.ДатаПроведенияБСО КАК ДатаПроведенияБСО
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|ГДЕ
	|	К.УИДСтрокиТЧ = &УИДСтрокиТЧ";
	Запрос.УстановитьПараметр("УИДСтрокиТЧ", УИДСтроки);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


//Получает первую оплату с совпадающей квитанцией (либо первую, если такой нет) из квитовки оплат, если она есть
Функция ПолучитьОплатуПолисаДляОтчетаАгента(УИДСтроки, НомерКвитанции, тзОплат = Неопределено) Экспорт
	
	Если тзОплат = Неопределено Тогда
		тзОплат = ДайТзОплатПоУИДСтроки(УИДСтроки);
	КонецЕсли;
	ВсегоОплат = тзОплат.Количество();
	Если ВсегоОплат > 0 Тогда
		//Берем либо единственную привязанную оплату, либо, если их несколько, ту, в которой номер квитанции совпадает
		ОплатаПолисаДляОтчетаАгента = тзОплат[0].ОплатаПолиса;
		Если ВсегоОплат > 1 Тогда 
			Для Каждого Оплата из тзОплат Цикл
				Если СокрЛП(Оплата.НомерКвитанции) = СокрЛП(НомерКвитанции) Тогда
					ОплатаПолисаДляОтчетаАгента = Оплата.ОплатаПолиса;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОплатаПолисаДляОтчетаАгента = Документы.уб_ОплатаПолисов.ПустаяСсылка(); 	
	КонецЕсли;
	Возврат ОплатаПолисаДляОтчетаАгента;
	
КонецФункции

Функция ФормаОплатыКартинка(ФормаОплаты) Экспорт

	Пер = Перечисления.уб_ФормыОплаты;
	Если ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Тогда
		Иконка = БиблиотекаКартинок.уб_Оплата
	ИначеЕсли ФормаОплаты = Пер.Безнал Тогда
		Иконка = БиблиотекаКартинок.уб_НаправлениеПлатежаЛевоЗел
	Иначе
		//поставщику
		Иконка = БиблиотекаКартинок.уб_НаправлениеПлатежаПравоРозовый
	КонецЕсли;
	Возврат Иконка;

КонецФункции // ФормаОплатыКартинка()

Процедура ДвижениеСтатусовЗаявок(Ссылка, ЭтоЗагрузка = ЛОЖЬ) Экспорт
	
	Параметры = уб_УСЗ.СтруктураПараметровДляТребуетсяВозвратБСО(ТипЗнч(Ссылка));
	ТЗТребуетсяВозвратБСО = уб_УСЗ.ТребуетсяВозвратБСОПоСсылке(Ссылка,, Параметры);
	ТЗТребуетсяВозвратБСО.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОП.Заявка,
	               |	ПОП.СК,
	               |	ПОП.ВидБСО,
	               |	ПОП.НомерБСО,
	               |	ПОП.Заявка.Номер,
	               |	ПОП.Ссылка.Проведен КАК Проведен,
	               |	ЛОЖЬ КАК Принудительно
	               |ПОМЕСТИТЬ ВТЗаявок
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат.Полисы КАК ПОП
	               |ГДЕ
	               |	ПОП.Ссылка = &Ссылка
	               |	И ПОП.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	П.Заявка,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	П.Заявка.Номер,
	               |	П.Проведен,
	               |	ИСТИНА
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат КАК П
	               |ГДЕ
	               |	П.Ссылка = &Ссылка
	               |	И П.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СЗ.Статус КАК Статус,
	               |	ВТЗаявок.Заявка КАК Заявка,
	               |	ВТЗаявок.СК,
	               |	ВТЗаявок.ВидБСО,
	               |	ВТЗаявок.НомерБСО,
	               |	ВТЗаявок.ЗаявкаНомер КАК ЗаявкаНомер,
	               |	ВТЗаявок.Проведен КАК Проведен,
	               |	ВТЗаявок.Принудительно КАК Принудительно, ВТЗаявок.Заявка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику) КАК Поставщику
	               |ИЗ
	               |	ВТЗаявок КАК ВТЗаявок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	               |		ПО ВТЗаявок.Заявка = СЗ.Заявка
	               |ГДЕ
	               |	(ВТЗаявок.Проведен
	               |			ИЛИ НЕ ВТЗаявок.Проведен)
	               |	И ВЫБОР
	               |			КОГДА ВТЗаявок.Заявка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
	               |					И НЕ СЗ.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	               |				ТОГДА ИСТИНА
	               |			КОГДА СЗ.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира)
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |ИТОГИ
	               |	МИНИМУМ(Статус),
	               |	МИНИМУМ(ЗаявкаНомер),
	               |	МИНИМУМ(Проведен),
	               |	МАКСИМУМ(Принудительно)
	               |ПО
	               |	Заявка";
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ПОП.Заявка,
	//|	ПОП.СК,
	//|	ПОП.ВидБСО,
	//|	ПОП.НомерБСО,
	//|	ПОП.Заявка.Номер,
	//|	ПОП.Ссылка.Проведен КАК Провуеден,
	//|	ЛОЖЬ КАК Принудительно
	//|ПОМЕСТИТЬ ВТЗаявок
	//|ИЗ
	//|	Документ.уб_ПриемкаОплат.Полисы КАК ПОП
	//|ГДЕ
	//|	ПОП.Ссылка = &Ссылка
	//|	И ПОП.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	П.Заявка,
	//|	NULL,
	//|	NULL,
	//|	NULL,
	//|	П.Заявка.Номер,
	//|	П.Проведен,
	//|	ИСТИНА
	//|ИЗ
	//|	Документ.уб_ПриемкаОплат КАК П
	//|ГДЕ
	//|	П.Ссылка = &Ссылка
	//|	И П.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СЗ.Статус КАК Статус,
	//|	ВТЗаявок.Заявка КАК Заявка,
	//|	ВТЗаявок.СК,
	//|	ВТЗаявок.ВидБСО,
	//|	ВТЗаявок.НомерБСО,
	//|	ВТЗаявок.ЗаявкаНомер КАК ЗаявкаНомер,
	//|	ВТЗаявок.Проведен КАК Проведен,
	//|	ВТЗаявок.Принудительно КАК Принудительно
	//|ИЗ
	//|	ВТЗаявок КАК ВТЗаявок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	//|		ПО ВТЗаявок.Заявка = СЗ.Заявка
	//|ГДЕ
	//|	(ВТЗаявок.Проведен
	//|				И СЗ.Статус.Порядок < 13
	//|			ИЛИ НЕ ВТЗаявок.Проведен
	//|				И СЗ.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектИДеньгиУКассира))
	//|ИТОГИ
	//|	МИНИМУМ(Статус),
	//|	МИНИМУМ(ЗаявкаНомер),
	//|	МИНИМУМ(Проведен),
	//|	МАКСИМУМ(Принудительно)
	//|ПО
	//|	Заявка");
	//TODO!!! В запросе получать, также данные по квитанциям
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	СписокОбработанныхЗаявок = Новый СписокЗначений;
	Роль = уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проведен Тогда
			ЕстьДанныеТЗ = Ложь;
			//TODO убрать ПолучитьТаблицуБСОПоЗаявке, добавить соединение в запрос
			//Если текущая заявка в приемке совпадает с заявкой в регистре Движений БСО,
			//то двигать статус, количественные не расматривать
			//
			//требуется получить только по данной заявке, но со всеми положениями,
			//но также сразу нужно определить флаг требуется ли возврат БСО, чтобы не повторять в будущем этот запрос
			//ТаблицаБСО = уб_УСЗ.ПолучитьТаблицуБСОПоЗаявке(Выборка.Заявка, Ложь, Истина);
			//ТребуетсяВозвратБСО = Ложь;
			УстСтатус = "";
			Если Выборка.Принудительно Тогда
				УстСтатус = "УстановитьСтатус_КомплектИДеньгиУКассира";
			Иначе
				ДетальныеЗаписи = Выборка.Выбрать();
				Пока ДетальныеЗаписи.Следующий() И УстСтатус = "" Цикл
					Если  ДетальныеЗаписи.Поставщику = истина тогда
						УстСтатус = "УстановитьСтатус_ДеньгиВКомпании";
					Иначе	
						Для Каждого СтрокаТЗ Из Параметры.ТаблицаБСО Цикл
							Если СтрокаТЗ.ВидБСО = ДетальныеЗаписи.ВидБСО
								И СтрокаТЗ.НомерБСО = ДетальныеЗаписи.НомерБСО 
								Тогда
								//есть данные в таблице БСО
								//Если ЭтоЗагрузка = Истина и  Тогда
								//	УстСтатус = "УстановитьСтатус_СтраховкаСостоялась"
								//Иначе
								УстСтатус = "УстановитьСтатус_КомплектИДеньгиУКассира";
								//КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			//УстСтатус = "УстановитьСтатус_СтраховкаСостоялась"
		КонецЕсли;
		Если УстСтатус <> "" Тогда
			СтрокаТЗ = ТЗТребуетсяВозвратБСО.Найти(Выборка.Заявка, "Заявка");
			Если СтрокаТЗ = Неопределено Тогда
				//может происходить если нет ТЧ в приемке, но заполнен реквизит Заявка шапки приемки (только оплата выезда клиентом)
				//TODO добавить эту заявку в уб_УСЗ.ТребуетсяВозвратБСОПоСсылке (потребуется добавить частное объединение в запрос)
				ТребуетсяВозвратБСО = Неопределено
			Иначе
				ТребуетсяВозвратБСО = СтрокаТЗ.ТребуетсяВозвратБСО;
				СтрокаТЗ.Обработано = Истина;
			КонецЕсли;
			Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
				Выборка.Заявка, 
				Выборка.Статус,
				УстСтатус,
				,
				Роль,
				, //ТекстКоманды
				ТребуетсяВозвратБСО
				)
				Тогда
				СписокОбработанныхЗаявок.Добавить(Выборка.ЗаявкаНомер)
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//проверяем оставшиеся заявки
	МассивСтрокТЗ = ТЗТребуетсяВозвратБСО.НайтиСтроки(Новый Структура("Обработано", Ложь));
	Для Каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
		Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
			СтрокаТЗ.Заявка,
			,
			"ПроверитьБСО",
			,
			Роль,
			,
			СтрокаТЗ.ТребуетсяВозвратБСО
			) 
			Тогда
			СписокОбработанныхЗаявок.Добавить(СтрокаТЗ.Заявка);
		КонецЕсли;
	КонецЦикла;
	#Если Клиент Тогда
		Если СписокОбработанныхЗаявок.Количество() > 0 Тогда
			Оповестить("уб_СтатусыЗаявокОбновитьСписки", СписокОбработанныхЗаявок, "Документ.уб_ПриемкаОплат")
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

//#Область  ПрограммныйИнтерфейс
Функция ПолучитьПустуюСтруктуруСтроки() Экспорт
	
	Структура = Новый Структура("СтраховойПолис,СтраховойПродукт,Агент,НомерЗаявки,ДатаОформления,ДатаНачала,
	|ДатаОкончания,Страхователь,Курьер,ДатаОплаты,НачисленнаяСуммаВзносаВВалюте,НачисленнаяСуммаВзноса,
	|СкидкаВыплаченаяКлиенту,Поставщик,ОрганизацияАгент,СК,ВидБСО,НомерБСО,	НомерПолиса,НомерКвитанции,ДопНомерКвитанции,
	|Сумма,УИДСтроки,УИДСтрокиЗаявки,ПоставщикКвитанции,ОрганизацияАгентКвитанции,ОплатаПолисаДляОтчетаАгента,Валюта,Курс,ФормаОплаты,НомерВзноса,
	|Заявка,РазрешитьБезОтчета,Аддендум,ПредоставленнаяСкидка");
	Структура.СтраховойПолис = Документы.уб_СтраховойПолис.ПустаяСсылка();
	
	Возврат Структура;
	
КонецФункции	

Функция ПриемкаПолучитьСоздатьОбъект(ОбъектПриемки,СсылкаПриемка,ФормаОплаты,Автор,Взаиморасчет = Неопределено)  Экспорт
	Если ОбъектПриемки = Неопределено Тогда
		Если ЗначениеЗаполнено(СсылкаПриемка) Тогда
			ОбъектПриемки = СсылкаПриемка.ПолучитьОбъект();
			Если ОбъектПриемки.Проведен Тогда
				ОбъектПриемки.ДополнительныеСвойства.Вставить("НеДвигатьСтатусы",Истина);
				ОбъектПриемки.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ОбъектПриемки.ДополнительныеСвойства.Удалить("НеДвигатьСтатусы");
			КонецЕсли	
		Иначе
			ОбъектПриемки = Документы.уб_ПриемкаОплат.СоздатьДокумент();
			ОбъектПриемки.Дата = ТекущаяДата();
			ОбъектПриемки.Автор = Автор;
			ОбъектПриемки.ДатаИзменения = ОбъектПриемки.Дата;
			ОбъектПриемки.Модификатор = ПараметрыСеанса.ТекущийПользователь;
			ОбъектПриемки.ПринятоОТ = Справочники.ФизическиеЛица.НайтиПоНаименованию("_Дежурный Выходные Дни");
			ОбъектПриемки.Валюта  = Константы.ВалютаРегламентированногоУчета.Получить();
			ОбъектПриемки.Курс = 1;
			ОбъектПриемки.Подразделение  = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("ОП");
			ОбъектПриемки.ОтчетКассира = ОтчетКассираСегодня(ФормаОплаты,Автор);
			ОбъектПриемки.УстановитьНовыйНомер("");
			
			
			СтрокаПлатежа = ОбъектПриемки.Платежи.Добавить();
			СтрокаПлатежа.ФормаОплаты = ФормаОплаты;
			СтрокаПлатежа.Валюта  = Константы.ВалютаРегламентированногоУчета.Получить();
			СтрокаПлатежа.Курс = 1;
			СтрокаПлатежа.Кратность  =1;
			СтрокаПлатежа.УидСтроки = Новый УникальныйИдентификатор();
			ОбъектПриемки.ОбменДанными.Загрузка = Истина;
			Если Не Взаиморасчет = Неопределено Тогда
				ОбъектПриемки.Комментарий = Взаиморасчет;
			КонецЕсли;	
			ОбъектПриемки.Записать();
			ОбъектПриемки.ОбменДанными.Загрузка = Ложь;
			
			СсылкаПриемка = ОбъектПриемки.Ссылка;
			//ОбъектПриемки.Категория = Справочники.уб_КатегорииДенежныхСредств.
		КонецЕсли;	
	КонецЕсли;	
	Возврат ОбъектПриемки
КонецФункции	


Функция ДобавитьСтрокуВПриемку(СтрокаЗагрузки,ОбъектПриемки,Параметры,Записывать = Ложь,ДанныеПриемки = Неопределено)  Экспорт
	
	Если Параметры.Свойство("ВидБСО") Тогда
		ВидБСО = Параметры.ВидБСО;
	Иначе
		ВидБСО =  СтрокаЗагрузки.ВидБСО;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ВидБСО) Тогда
		Если типЗнч(ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") 
			или типЗнч(ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") 
			
			Тогда
		Иначе	
			Сообщить("В "+СтрокаЗагрузки.Заявка+" "+ВидБСО+" имеет не верный тип"); 
			Возврат ЛОЖЬ;
		КонецЕсли;	
	Иначе
		Сообщить("Вид БСО "+СтрокаЗагрузки.Заявка+" не заполнен Вид БСО/СП "); 
		Возврат ЛОЖЬ;
	КонецЕсли;	
	
	Если ДанныеПриемки = Неопределено Тогда
		СтрокаПолиса = ОбъектПриемки.Полисы.Добавить();
		СтрокаПолиса.УидСтроки = Новый УникальныйИдентификатор;
	Иначе
		нСтроки = ОбъектПриемки.Полисы.НайтиСтроки(Новый Структура("УИДСтроки",ДанныеПриемки.УИДСтроки));
		Если нСтроки.Количество() = 0 Тогда
			СтрокаПолиса = ОбъектПриемки.Полисы.Добавить();
			СтрокаПолиса.УидСтроки = ДанныеПриемки.УИДСтроки;
		Иначе
			СтрокаПолиса = нСтроки[0];
		КонецЕсли;	
	КонецЕсли;	
	Если Параметры.Свойство("Поставщик") Тогда
		СтрокаПолиса.Поставщик        = Параметры.Поставщик;
	Иначе
		СтрокаПолиса.Поставщик        = СтрокаЗагрузки.Поставщик;
	КонецЕсли;	
	СтрокаПолиса.ОрганизацияАгент = СтрокаЗагрузки.ОрганизацияАгент;
	СтрокаПолиса.СК               = СтрокаЗагрузки.СК;
	
	СтрокаПолиса.ВидБСО = ВидБСО;
	
	СтрокаПолиса.НомерБСО = СтрокаЗагрузки.НомерПолиса;
	СтрокаПолиса.НомерПолиса = СтрокаЗагрузки.НомерПолиса;
	
	Попытка
		Если СтрокаЗагрузки.ФормаОплаты = перечисления.уб_ФормыОплаты.Поставщику Тогда
			Скидка = 0;
		Иначе	
			Скидка = СтрокаЗагрузки.ПредоставленнаяСкидка;
		КонецЕсли;	
	Исключение
		Скидка = 0;
	КонецПопытки;	
	
	СтрокаПолиса.Сумма = СтрокаЗагрузки.СтраховаяПремия-Скидка;
	
	СтрокаПолиса.Заявка = СтрокаЗагрузки.Заявка;
	Попытка
		СтрокаПолиса.УИДСтрокиЗаявки = СтрокаЗагрузки.УидСтроки;
	Исключение
		СтрокаПолиса.УИДСтрокиЗаявки = СтрокаЗагрузки.УИДСтрокиЗаявки;
	КонецПопытки;	
	
	
	//ДанныеЗаявки  = НайтиЗаявку(СтрокаЗагрузки.НомерПолиса,СтрокаЗагрузки.СтраховаяКомпания);    
	//
	//Если ДанныеЗаявки.Свойство("Заявка") Тогда
	//	СтрокаПолиса.Заявка = ДанныеЗаявки.Заявка;
	//	СтрокаПолиса.УИДСтрокиЗаявки = ДанныеЗаявки.УидСтроки;
	//		
	//КонецЕсли;	
	
	РС = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат;
	ВыборкаРС = РС.Выбрать(Новый Структура("УИДСтрокиТЧ", СтрокаПолиса.УидСтроки)); 
	Если ВыборкаРС.Следующий() Тогда
		МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
	Иначе
		МЗ = РС.СоздатьМенеджерЗаписи();	
		МЗ.УИДСтрокиТЧ		= СтрокаПолиса.УидСтроки;				
		МЗ.ПриемОплаты		= ОбъектПриемки.Ссылка;
		МЗ.ДатаЗаписи		= ТекущаяДата();
	КонецЕсли;			
	МЗ.НомерЗаявки		= СтрокаЗагрузки.Заявка.НомерЗаявки;
	МЗ.СтраховойПродукт	= СтрокаЗагрузки.СтраховойПродукт;
	МЗ.ДатаОформления	= СтрокаЗагрузки.ДатаОформления; 
	МЗ.ДатаНачала		= СтрокаЗагрузки.ДатаНачала;
	МЗ.ДатаОкончания	= СтрокаЗагрузки.ДатаОкончания;
	МЗ.Страхователь		= СтрокаЗагрузки.Страхователь;
	МЗ.ДатаОплаты		= СтрокаЗагрузки.ДатаОплаты;
	МЗ.Агент			= СтрокаЗагрузки.Менеджер;
	МЗ.Курьер			= СтрокаЗагрузки.Заявка.Курьер;
	МЗ.НачисленнаяСуммаВзносаВВалюте	= СтрокаЗагрузки.СтраховаяПремия;
	МЗ.НачисленнаяСуммаВзноса			= СтрокаЗагрузки.СтраховаяПремия;
	МЗ.ФормаОплаты = СтрокаЗагрузки.ФормаОплаты;
	Попытка
		МЗ.НомерВзноса		= СтрокаЗагрузки.НомерВзноса;
	Исключение	
	КонецПопытки;
	
	Попытка
		МЗ.Аддендум		= СтрокаЗагрузки.Аддендум;
	Исключение	
	КонецПопытки;

	
	МЗ.СкидкаВыплаченаяКлиенту 			= 0;
	Попытка
		МЗ.Записать();
	Исключение
		Сообщить("Ошибка при записи временных данных к приемке оплат для УИД строки '" + МЗ.УИДСтрокиТЧ + "'. Описание ошибки: 
		|	" + ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
	КонецПопытки;

	
	
	
	СтрокиПлатежа = ОбъектПриемки.Платежи.НайтиСтроки(Новый Структура("ФормаОплаты",СтрокаЗагрузки.ФормаОплаты));
	Если СтрокиПлатежа.Количество() = 0 тогда
		СтрокаПлатежа = ОбъектПриемки.Платежи.Добавить();
		СтрокаПлатежа.ФормаОплаты = СтрокаЗагрузки.ФормаОплаты;
		СтрокаПлатежа.Валюта  = Константы.ВалютаРегламентированногоУчета.Получить();
	    СтрокаПлатежа.Курс = 1;
		СтрокаПлатежа.Кратность  =1;
		СтрокаПлатежа.УидСтроки = Новый УникальныйИдентификатор();
	Иначе
		СтрокаПлатежа = СтрокиПлатежа[0];
	КонецЕсли;	
	
	СтрокаПлатежа.Сумма = СтрокаПлатежа.Сумма+СтрокаПолиса.Сумма;
	СтрокаПлатежа.СуммаВВалюте = СтрокаПлатежа.СуммаВВалюте+СтрокаПолиса.Сумма;
	Если Записывать = Истина Тогда
		Попытка
			ОбъектПриемки.Записать();	
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	Попытка
		СтрокаЗагрузки.Приемка = ОбъектПриемки.Ссылка;
	Исключение
	КонецПопытки;	
	Возврат Новый Структура("Приемка,УИДСтроки,ВидБСО,Заявка,Поставщик,ОрганизацияАгент,СК,ФормаОплаты,НомерКвитанции",ОбъектПриемки.Ссылка,СтрокаПолиса.УИДСтроки,СтрокаПолиса.ВидБСО,СтрокаПолиса.Заявка,СтрокаПолиса.Поставщик,СтрокаПолиса.ОрганизацияАгент,СтрокаПолиса.СК,СтрокаЗагрузки.ФормаОплаты,СтрокаПолиса.НомерКвитанции);
	
КонецФункции	


Функция НайтиПроверитьПриемку(СтрокаЗагрузки,ЗаписыватьВСтроку = ИСТИНА) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ПриемкаОплатПолисы.Ссылка,
	               |	уб_ПриемкаОплатПолисы.СК,
	               |	уб_ПриемкаОплатПолисы.НомерБСО,
	               |	уб_ПриемкаОплатПолисы.ВидБСО,
	               |	уб_ПриемкаОплатПолисы.Сумма,
	               |	уб_ПриемкаОплатПолисы.УИДСтроки,
	               |	уб_ПриемкаОплатПолисы.Заявка,
	               |	уб_ПриемкаОплатПолисы.Поставщик,
	               |	уб_ПриемкаОплатПолисы.ОрганизацияАгент,
	               |	уб_ПриемкаОплатПолисы.НомерКвитанции,
	               |	уб_ПриемкаОплатПолисы.НомерПолиса
	               |ПОМЕСТИТЬ Приемки
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	               |ГДЕ
	               |	уб_ПриемкаОплатПолисы.СК = &СК
	               |	И (уб_ПриемкаОплатПолисы.НомерПолиса = &НомерПолиса
	               |			ИЛИ уб_ПриемкаОплатПолисы.НомерБСО ПОДОБНО &НомерПолиса3
				   |			ИЛИ уб_ПриемкаОплатПолисы.НомерБСО ПОДОБНО &НомерПолиса32)
	               |	И уб_ПриемкаОплатПолисы.Ссылка.Дата >= &Дата0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Приемки.Ссылка,
	               |	Приемки.СК,
	               |	Приемки.НомерБСО,
	               |	Приемки.ВидБСО,
	               |	Приемки.Сумма,
	               |	Приемки.УИДСтроки,
	               |	Приемки.Заявка,
	               |	уб_ПриемкаОплатПлатежи.ФормаОплаты,
	               |	Приемки.Поставщик,
	               |	Приемки.ОрганизацияАгент,
	               |	Приемки.НомерКвитанции,
	               |	Приемки.НомерПолиса
	               |ИЗ
	               |	Приемки КАК Приемки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
	               |		ПО Приемки.Ссылка = уб_ПриемкаОплатПлатежи.Ссылка
	               |			И (уб_ПриемкаОплатПлатежи.НомерСтроки = 1)";
	//за 30 дней до даты оплаты (возможно дата оформления)
	//пытаемся отловить 2 взносы при совпадающей сумме, но при ошибочных датах возможны дубли
	Запрос.УстановитьПараметр("Дата0",СтрокаЗагрузки.ДатаОплаты-30*24*3600);
	Запрос.УстановитьПараметр("СК",СтрокаЗагрузки.СК);
	Запрос.УстановитьПараметр("НомерПолиса",СтрокаЗагрузки.НомерПолиса);
	//Номер3 = "%"+Сред(СтрокаЗагрузки.НомерПолиса,4)+"%";
	Номер3 = Обработки.ЗагрузкаПолисовИзB2B.Номер3(СтрокаЗагрузки.НомерПолиса);
	Если СтрДлина(Номер3)<8 Тогда
		//скорее всего левый номер, исключим ложное срабатываение
		Номер3 = "09876543210";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("НомерПолиса3",Номер3);
	Запрос.УстановитьПараметр("НомерПолиса32",СтрЗаменить(Номер3,"-",""));
	
	СтрокаПолиса= Запрос.Выполнить().Выбрать();
	Пока СтрокаПолиса.Следующий() Цикл
		//Если СтрокаПолиса.Сумма = СтрокаЗагрузки.СтраховаяПремия Тогда
		
		Если ЗаписыватьВСтроку = ИСТИНА Тогда
			СтрокаЗагрузки.Приемка = СтрокаПолиса.Ссылка;
			СтрокаЗагрузки.СуммаВПриемке = СтрокаПолиса.Сумма;
		КонецЕсли;
		Возврат Новый Структура("Приемка,УИДСтроки,ВидБСО,Заявка,ФормаОплаты,Поставщик,ОрганизацияАгент,СК,НомерКвитанции,НомерПолиса",СтрокаПолиса.Ссылка,СтрокаПолиса.УИДСтроки,СтрокаПолиса.ВидБСО,СтрокаПолиса.Заявка,СтрокаПОлиса.ФормаОплаты,СтрокаПОлиса.Поставщик,СтрокаПОлиса.ОрганизацияАгент,СтрокаПОлиса.СК,СтрокаПолиса.НомерКвитанции,СтрокаПолиса.НомерПолиса);
		//Иначе
		//	_Сообщить("Обнаружена приемка с другой суммой для "+ СтрокаПолиса.Ссылка+ " для "+СтрокаПолиса.НомерБСО);
		//КонецЕсли;
	КонецЦикла;	
	
	Возврат Новый Структура();
	
КонецФункции	


Функция СоздатьПриемкуКЗаявке(Заявка,КэшПриемок,Взаиморасчет = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.*,  ПринятыДеньгиАвтор как АвторПриемки,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка КАК Заявка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СуммаВзноса КАК СтраховаяПремия,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СтраховаяПремия КАК СтраховаяПремияПолная,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.НомерБСО КАК НомерПолиса,
	               |	Выбор Когда уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления = Датавремя(1,1,1) Тогда уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Дата иначе уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДатаОформления Конец  КАК ДатаОплаты,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Курьер КАК Курьер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Менеджер КАК Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Менеджер КАК Агент,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Страхователь КАК Страхователь,
	               |	ВЫБОР
	               |		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ФормаОплатыСтрока = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)
	               |			ТОГДА уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.ФормаОплаты
	               |		ИНАЧЕ уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ФормаОплатыСтрока
	               |	КОНЕЦ КАК ФормаОплаты,
	               |	НЕОПРЕДЕЛЕНО КАК СтраховойПродукт
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ПринятыДеньги";
	Запрос.УстановитьПараметр("Ссылка",Заявка);
	Данные = Запрос.Выполнить().Выгрузить();
	Сообщить("------------------------------------");
	Сообщить("Обрабатывается "+Заявка);
	Для каждого Выборка из Данные Цикл
		Если ПустаяСтрока(Выборка.НомерБСО) Тогда
			Продолжить;
		КонецЕсли;	
		//
		Если КэшПриемок.Получить(Выборка.НомерБСО) = Неопределено Тогда
			
			Если ТипЗНЧ(Выборка.ВидБСО) = ТИП("СправочникСсылка.уб_ВидыБСО") Тогда
				СписокСтрахПр = уб_СЛ.ПолучитьСписокСтрахПродуктов(Выборка.СК, Выборка.ДатаОплаты, Выборка.ВидБСО);
				Если СписокСтрахПр.Количество() = 1 Тогда
					Выборка.СтраховойПродукт = СписокСтрахПр[0].Значение;
				КонецЕсли;	
			ИначеЕсли ТипЗНЧ(Выборка.ВидБСО) = ТИП("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
				Выборка.СтраховойПродукт = Выборка.ВидБСО;
			КонецЕсли;
			
			ДанныеПриемки = Документы.уб_ПриемкаОплат.НайтиПроверитьПриемку(Выборка,ЛОЖЬ);
			Если ДанныеПриемки.Свойство("Приемка") = ЛОЖЬ Тогда
				//ОбъектПриемки = КэшПриемок.Получить(Выборка.ФормаОплаты); 
				//Если НЕ ОбъектПриемки = ЛОЖЬ Тогда
					
					ОбъектПриемки = ПриемкаСегодня(Выборка.ФормаОплаты,Выборка.АвторПриемки,Взаиморасчет);
					
					//КэшПриемок.Вставить(Выборка.ФормаОплаты,ОбъектПриемки);
					
					ДанныеПриемки = Неопределено;
					ДанныеПриемки = Документы.уб_ПриемкаОплат.ДобавитьСтрокуВПриемку(Выборка,ОбъектПриемки,Новый Структура,Истина,ДанныеПриемки);
					
					Если ДанныеПриемки = ЛОЖЬ Тогда
						Сообщить("Ошибка добавления в приемку "+ ОбъектПриемки+" ("+Выборка.НомерБСО+")");

						Продолжить;
					КонецЕсли;	
					Сообщить("Добавлена строка в приемку "+ ОбъектПриемки+" ("+Выборка.НомерБСО+")");
				//	
				//	КэшПриемок.Вставить(Выборка.НомерБСО,ДанныеПриемки);
				//КонецЕсли;	
			Иначе
				//КэшПриемок.Вставить(Выборка.НомерБСО,ДанныеПриемки);
			КонецЕсли;
			КэшПриемок.Вставить(Выборка.Заявка,Выборка.Заявка);
		КонецЕсли;	
	КонецЦикла;	
	Для каждого Приемка из КэшПриемок Цикл
		ТекЗначение  = Приемка.Значение;
		Если ТипЗНЧ(ТекЗначение) = Тип("ДокументОбъект.уб_ПриемкаОплат") Тогда
			Если Не ТекЗначение.Проведен Тогда
				ТекЗначение = ТекЗначение.Ссылка.ПолучитьОбъект();
				ТекЗначение.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("Провели "+ТекЗначение);
			КонецЕсли;	
		ИначеЕсли ТипЗНЧ(ТекЗначение) = Тип("Структура") Тогда
			Если ТекЗначение.Свойство("Приемка") и  ТекЗначение.Приемка.Проведен = ЛОЖЬ Тогда
				ПриемкаОбъект = ТекЗначение.Приемка.ПолучитьОбъект();
				Попытка
					ПриемкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Сообщить("Провели "+ПриемкаОбъект);

				Исключение
				КонецПопытки;	
			КонецЕсли;	
		ИначеЕсли ТипЗНЧ(ТекЗначение) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
			  уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(ТекЗначение,Перечисления.уб_ТипыОчереди.СозданиеПриемок);
			  Сообщить(" "+ТекЗначение+" обработана");
		КонецЕсли;	
	КонецЦикла;	
	Возврат ОбъектПриемки;
КонецФункции	


Функция ПриемкаСегодня(ФормаОплаты,Автор,Взаиморасчет = Неопределено) Экспорт
	ОбъектПриемки = Неопределено;
	Запрос = Новый запрос;
	Если Взаиморасчет = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ПриемкаОплатПлатежи.Ссылка,
		|	уб_ПриемкаОплатПлатежи.ФормаОплаты
		|ИЗ
		|	Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
		|ГДЕ
		|	уб_ПриемкаОплатПлатежи.ФормаОплаты = &ФормаОплаты
		|	И НАЧАЛОПЕРИОДА(уб_ПриемкаОплатПлатежи.Ссылка.Дата, ДЕНЬ) = &Дата
		|	И уб_ПриемкаОплатПлатежи.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И уб_ПриемкаОплатПлатежи.Ссылка.ОтчетКассира.Подтверждено = ЛОЖЬ
		|	И уб_ПриемкаОплатПлатежи.Ссылка.ПринятоОТ = &ПринятоОТ
		|	И уб_ПриемкаОплатПлатежи.Ссылка.Автор = &Автор";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ПриемкаОплатПлатежи.Ссылка КАК Ссылка,
		               |	уб_ПриемкаОплатПлатежи.ФормаОплаты КАК ФормаОплаты
		               |ИЗ
		               |	Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
		               |ГДЕ
		               |	уб_ПриемкаОплатПлатежи.ФормаОплаты = &ФормаОплаты
		               |	И НАЧАЛОПЕРИОДА(уб_ПриемкаОплатПлатежи.Ссылка.Дата, ДЕНЬ) = &Дата
		               |	И уб_ПриемкаОплатПлатежи.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И уб_ПриемкаОплатПлатежи.Ссылка.ОтчетКассира.Подтверждено = ЛОЖЬ
		               |	И уб_ПриемкаОплатПлатежи.Ссылка.ПринятоОТ = &ПринятоОТ
		               |	И уб_ПриемкаОплатПлатежи.Ссылка.Автор = &Автор
		               |	И уб_ПриемкаОплатПлатежи.Ссылка.Комментарий ПОДОБНО &Комментарий";
		Запрос.УстановитьПараметр("Комментарий",Строка(Взаиморасчет));
	КонецЕсли;
	ПринятоОТ = Справочники.ФизическиеЛица.НайтиПоНаименованию("_Дежурный Выходные Дни"); 
	Запрос.УстановитьПараметр("ПринятоОТ",ПринятоОТ);
	Запрос.УстановитьПараметр("ФормаОплаты",ФормаОплаты);
	Запрос.УстановитьПараметр("Автор",Автор);
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Приемка = Выборка.Ссылка;
	Иначе
		Приемка = Документы.уб_ПриемкаОплат.ПустаяСсылка();
	КонецЕсли;	
	
	ОбъектПриемка = ПриемкаПолучитьСоздатьОбъект(ОбъектПриемки,Приемка,ФормаОплаты,Автор,Взаиморасчет);	
	
	Возврат ОбъектПриемка;
	
КонецФункции


Функция ОтчетКассираСегодня(ФормаОплаты,Автор,БезПроверки = Ложь,СтрокаКомментария = "") Экспорт
	
	Если СтрокаКомментария = "" Тогда
		СтрокаКомментария = "Робот "+ФормаОплаты;
	КонецЕсли;	
	
	Если БезПроверки = ЛОЖЬ Тогда
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ОтчетКассира.Ссылка
		|ИЗ
		|	Документ.уб_ОтчетКассира КАК уб_ОтчетКассира
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(уб_ОтчетКассира.Дата, ДЕНЬ) = &Дата
		|	И уб_ОтчетКассира.ПометкаУдаления = ЛОЖЬ
		|	И уб_ОтчетКассира.Подтверждено = ЛОЖЬ
		|	И ПОДСТРОКА(уб_ОтчетКассира.Комментарий, 1, 100) = &СтрокаКомментария
		|	И уб_ОтчетКассира.Автор = &Автор"; 
		Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()));
		
		Запрос.УстановитьПараметр("СтрокаКомментария",СтрокаКомментария);
		Запрос.УстановитьПараметр("Автор",Автор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОтчетКассира = Выборка.Ссылка;
			Возврат ОтчетКассира
		КонецЕсли;
	КонецЕсли;
	
	ОтчетКассира = Документы.уб_ОтчетКассира.СоздатьДокумент();
	ОтчетКассира.НачОтчетПериод = НачалоДня(ТекущаяДата());  
	ОтчетКассира.Дата = ОтчетКассира.НачОтчетПериод;
	ОтчетКассира.КонОтчетПериод = КонецДня(ОтчетКассира.НачОтчетПериод);
	ОтчетКассира.Ответственный =  ПараметрыСеанса.ТекущийПользователь;
	ОтчетКассира.ОтветственныйФинансы = ПараметрыСеанса.ТекущийПользователь;
	ОтчетКассира.Комментарий = СтрокаКомментария;
	ОтчетКассира.Автор = Автор;
	ОтчетКассира.УстановитьНовыйНомер();
	ОтчетКассира.ОбменДанными.Загрузка = Истина;
	ОтчетКассира.Записать();
	ОтчетКассира = ОтчетКассира.Ссылка;
	
	Возврат ОтчетКассира;
КонецФункции	


Процедура СоздатьПолисыКПриемке(Приемка,флОбновлятьПолиса = ЛОЖЬ,ИгнорироватьОтчетКассира = Ложь) Экспорт
	ОтчетКассира = Приемка.ОтчетКассира;
	Если ИгнорироватьОтчетКассира = ЛОЖЬ тогда
		Если ОтчетКассира.Подтверждено = ЛОЖЬ Тогда
			Возврат
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ПриемкаОплат.Ссылка,
	               |	уб_ПриемкаОплат.Ссылка КАК Приемка,
	               |	уб_ПриемкаОплат.НомерСтроки,
	               |	уб_ПриемкаОплат.Поставщик,
	               |	уб_ПриемкаОплат.ОрганизацияАгент,
	               |	уб_ПриемкаОплат.СК,
	               |	уб_ПриемкаОплат.ВидБСО,
	               |	уб_ПриемкаОплат.НомерБСО,
	               |	уб_ПриемкаОплат.НомерПолиса,
	               |	уб_ПриемкаОплат.НомерКвитанции,
	               |	уб_ПриемкаОплат.ПоставщикКвитанции,
	               |	уб_ПриемкаОплат.ОрганизацияАгентКвитанции,
	               |	уб_ПриемкаОплат.Сумма,
	               |	уб_ПриемкаОплат.УИДСтроки,
	               |	уб_ПриемкаОплат.ОплатаПолисаДляОтчетаАгента,
	               |	уб_ПриемкаОплат.Заявка,
	               |	уб_ПриемкаОплат.ЭтоСвободныйНомер,
	               |	уб_ПриемкаОплат.Разница,
	               |	уб_ПриемкаОплат.УИДСтрокиЗаявки,
	               |	уб_ПриемкаОплат.Категория,
	               |	уб_ПриемкаОплат.ДопНомерБСО,
	               |	уб_ПриемкаОплат.ДопНомерКвитанции,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерЗаявки,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СтраховойПродукт,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Страхователь,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОкончания,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаНачала,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОформления,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОплаты,
	               |	ЕСТЬNULL(уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзноса, 0) КАК НачисленнаяСуммаВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Агент,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Курьер,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СкидкаВыплаченаяКлиенту,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Аддендум,
	               |	ЕСТЬNULL(уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзноса, уб_ПриемкаОплат.Сумма) - уб_ПриемкаОплат.Сумма КАК ПредоставленнаяСкидка,
	               |	ЕСТЬNULL(уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты, Платежи.ФормаОплаты) КАК ФормаОплаты,
	               |	уб_КвитовкаОплат.ОплатаПолиса
	               |ИЗ
	               |	Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК Платежи
	               |		ПО (Платежи.Ссылка = уб_ПриемкаОплат.Ссылка)
	               |			И (Платежи.НомерСтроки = 1)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ВременныеДанныеПолисаКПриемкеОплат КАК уб_ВременныеДанныеПолисаКПриемкеОплат
	               |		ПО уб_ПриемкаОплат.УИДСтроки = уб_ВременныеДанныеПолисаКПриемкеОплат.УИДСтрокиТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
	               |		ПО уб_ПриемкаОплат.УИДСтроки = уб_КвитовкаОплат.УИДСтрокиТЧ
	               |ГДЕ
	               |	уб_ПриемкаОплат.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка",Приемка);
				   
	//флОбновлятьПолиса = ЛОЖЬ;				
	ПриемкиНеБыло = ЛОЖЬ;
	Комментарий = "Создано автоматически к отчету кассира "+ОтчетКассира.Номер;
	
	ЕстьОшибка = Ложь;
	Сообщить("-------------------------------------");
	Сообщить("Обрабатывается " +Приемка);
	Данные = Запрос.Выполнить().Выгрузить();
	Для каждого ДанныеПриемки из Данные Цикл
		Если флОбновлятьПолиса = Ложь Тогда
			Если ЗначениеЗаполнено(ДанныеПриемки.ОплатаПолиса) Тогда
				Продолжить
			КонецЕсли;	
		КонецЕсли;	
		СтрокаЗагрузки = Обработки.ЗагрузкаПолисовИзB2B.НайтиЗаявку(ДанныеПриемки.НомерБСО,ДанныеПриемки.СК,"",ДанныеПриемки.УИДСтрокиЗаявки);
		Если СтрокаЗагрузки.Количество() =0 Тогда
			Сообщить("Не найдена заявка "+ДанныеПриемки.НомерБСО+" "+ДанныеПриемки.УИДСтрокиЗаявки);
			Если ЗначениеЗаполнено(ДанныеПриемки.ОплатаПолисаДляОтчетаАгента) = ЛОЖЬ Тогда
				ЕстьОшибка = Истина;
			КонецЕсли;	
			Продолжить;
		КонецЕсли;	
		
		СтрокаЗагрузки.Вставить("УидСтроки",ДанныеПриемки.УидСтроки);
		
		Если ЗначениеЗаполнено(ДанныеПриемки.Заявка)
			 и ЗначениеЗаполнено(СтрокаЗагрузки.Заявка)
			 и НЕ ДанныеПриемки.Заявка = СтрокаЗагрузки.Заявка Тогда
			 Сообщить("Отличаются указанная ("+ДанныеПриемки.Заявка.Номер+") и найденная по параметрам заявка ("+СтрокаЗагрузки.Заявка.Номер+"), создание по " +ДанныеПриемки.НомерБСО+" не выполнено");
			 Продолжить;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СтрокаЗагрузки.ОбъектСтрахования) = Ложь Тогда
			СтрокаЗагрузки.ОбъектСтрахования = Обработки.ЗагрузкаПолисовИзB2B.НайтиПростойОбъектСтрахования(Строка(СтрокаЗагрузки.ВидБСО),Строка(СтрокаЗагрузки.ВидБСО));
		КонецЕсли;	
		
		
		СтрокаЗагрузки.Вставить("СуммаВПриемке",ДанныеПриемки.Сумма);
		Если ДанныеПриемки.НачисленнаяСуммаВзноса>0 Тогда
			//кассир мог внести другую сумму
			СтрокаЗагрузки.Вставить("СтраховаяПремия",ДанныеПриемки.НачисленнаяСуммаВзноса);
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДанныеПриемки.ДатаОплаты) Тогда
			СтрокаЗагрузки.Вставить("ДатаОплаты",ДанныеПриемки.ДатаОплаты);
		Иначе
			СтрокаЗагрузки.Вставить("ДатаОплаты",СтрокаЗагрузки.ДатаОформления);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаЗагрузки.ДатаОплаты) = ЛОЖЬ
			и ЗначениеЗаполнено(СтрокаЗагрузки.ДатаНачала) = ЛОЖЬ			
			Тогда
			Сообщить("Некорректные даты в заявке и приемке, создание по " +ДанныеПриемки.НомерБСО+" не выполнено");
			продолжить			
		КонецЕсли;
		
		//Дозаполним значения из заявки
		Если ЗначениеЗаполнено(ДанныеПриемки.ДатаОформления) = Ложь Тогда
			Для каждого ТекЭлемент из Новый Структура("УИДСтроки,Поставщик,ОрганизацияАгент,СК,ВидБСО,НомерБСО,Сумма,Заявка") Цикл
				Попытка
					ДанныеПриемки[ТекЭлемент.Ключ] = СтрокаЗагрузки[ТекЭлемент.Ключ];
				Исключение
					Сообщить("Отсутствует поле "+ТекЭлемент.Ключ);
				КонецПопытки;	
			КонецЦикла;
			//ЗаполнитьЗначенияСвойств(ДанныеПриемки,СтрокаЗагрузки,,);
		КонецЕсли;
			
		Если ТипЗнч(СтрокаЗагрузки.ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") 
			И ЗначениеЗаполнено(СтрокаЗагрузки.ВидБСО) Тогда	
			СтрокаЗагрузки.Вставить("ВидСП",СтрокаЗагрузки.ВидБСО);
			СтрокаЗагрузки.Вставить("СтраховойПродукт",СтрокаЗагрузки.ВидБСО);
		ИначеЕсли ЗначениеЗаполнено(ДанныеПриемки.СтраховойПродукт) Тогда
			СтрокаЗагрузки.Вставить("СтраховойПродукт",ДанныеПриемки.СтраховойПродукт);
			СтрокаЗагрузки.Вставить("ВидСП",СтрокаЗагрузки.СтраховойПродукт.Вид);
		Иначе
			СписокСтрахПр = уб_СЛ.ПолучитьСписокСтрахПродуктов(ДанныеПриемки.СК, СтрокаЗагрузки.ДатаОплаты, ДанныеПриемки.ВидБСО);
			Если СписокСтрахПр.Количество() = 1 Тогда
				СтрокаЗагрузки.Вставить("СтраховойПродукт",СписокСтрахПр[0].Значение);
				СтрокаЗагрузки.Вставить("ВидСП",СтрокаЗагрузки.СтраховойПродукт.Вид);
			Иначе
				СтрокаЗагрузки.Вставить("СтраховойПродукт",Справочники.уб_СтраховыеПродукты.НайтиПоНаименованию(""+ДанныеПриемки.ВидБСО, ,,ДанныеПриемки.СК));
				СтрокаЗагрузки.Вставить("ВидСП",СтрокаЗагрузки.СтраховойПродукт.Вид);
			КонецЕсли;	
		КонецЕсли;	
		
		
		
		СтрокаЗагрузки.Вставить("ПроцентКВ", СтрокаЗагрузки.КВ);
		
		Если СтрокаЗагрузки.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО
			или СтрокаЗагрузки.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО
			Тогда
			СтрокаЗагрузки.Вставить("ПроцентКВДляОтчета", 10);	
		Иначе	
			СтрокаЗагрузки.Вставить("ПроцентКВДляОтчета", СтрокаЗагрузки.КВ);
		КонецЕсли;	
		СтрокаЗагрузки.Вставить("СуммаКВ",  СтрокаЗагрузки.СтраховаяПремия*СтрокаЗагрузки.ПроцентКВ/100);
		СтрокаЗагрузки.Вставить("СуммаКВДляОтчета",  СтрокаЗагрузки.СтраховаяПремия*СтрокаЗагрузки.ПроцентКВДляОтчета/100);
			
		
		Если ЗначениеЗаполнено(ДанныеПриемки.НомерПолиса) Тогда
			СтрокаЗагрузки.Вставить("НомерПолиса",ДанныеПриемки.НомерПолиса);
		Иначе
			СтрокаЗагрузки.Вставить("НомерПолиса",ДанныеПриемки.НомерБСО);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПриемки.ФормаОплаты) = ЛОЖЬ Тогда
			Попытка
				ДанныеПриемки.Вставить("ФормаОплаты",СтрокаЗагрузки.ФормаОплаты);
			Исключение
			КонецПопытки;	
		Иначе
			//приемка точнее
			СтрокаЗагрузки.Вставить("ФормаОплаты",ДанныеПриемки.ФормаОплаты);
		КонецЕсли;
		
		Если ДанныеПриемки.ПредоставленнаяСкидка<>0 Тогда
			СтрокаЗагрузки.Вставить("ПредоставленнаяСкидка",ДанныеПриемки.ПредоставленнаяСкидка);
		КонецЕсли;	

		
		
		
		СтрокаЗагрузки.Вставить("Полис",Документы.уб_СтраховойПолис.ПустаяСсылка());
		СтрокаЗагрузки.Вставить("Оплата",Документы.уб_ОплатаПолисов);
		СтрокаЗагрузки.Вставить("Приемка",ДанныеПриемки.Ссылка);
		
		Попытка
			Сообщить("Пытаемся создать полис "+СтрокаЗагрузки.НомерПолиса);
			Обработки.ЗагрузкаПолисовИзB2B.НайтиСоздатьПолис(СтрокаЗагрузки,ДанныеПриемки,флОбновлятьПолиса,Комментарий);
			Сообщить("Пытаемся создать оплату к полису "+СтрокаЗагрузки.НомерПолиса);
			Создана=Обработки.ЗагрузкаПолисовИзB2B.НайтиСоздатьОплатуПолиса(СтрокаЗагрузки,ДанныеПриемки,ПриемкиНеБыло,флОбновлятьПолиса);
			
		Исключение
			ЕстьОшибка = Истина;
			Сообщить("При создание полиса или оплаты к приемке "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
	Если ЕстьОшибка = ЛОЖЬ Тогда
		Попытка
			ОбъектПриемки = ДанныеПриемки.Ссылка.ПолучитьОбъект();	
			ОбъектПриемки.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
		уб_МодульРегламентныхЗаданий.ЗакрытьОчередь(Приемка,Перечисления.уб_ТипыОчереди.СозданиеПолисов);		
	КонецЕсли;	
	
КонецПроцедуры	
//#КонецОбласти

Функция ВознаграждениеКурьераКлиентом(_Заявка = Неопределено,Ссылка)  Экспорт
	
	Если _Заявка = Неопределено Тогда
		_Заявка = уб_temp.ДокументОснованиеПоТипуРекурсивно(Ссылка, Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста"))
	КонецЕсли;
	Результат = 0;
	Если _Заявка <> Неопределено Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	З.ВознаграждениеКурьера
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
		|ГДЕ
		|	З.Ссылка = &Ссылка
		|	И З.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Клиент)");
		Запрос.УстановитьПараметр("Ссылка", _Заявка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = Выборка.ВознаграждениеКурьера;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ВознаграждениеКурьераКлиентом()


Функция ПолучитьФормуВыбораСтрокПоСпискуЗаявок(Объект,Заявки,ФормаВладелец) Экспорт
	_Заявка = Неопределено;
	Форма = ПолучитьФорму("ФормаВыбораСтрокОснования",,ФормаВладелец);
	//ТипЗнч = ТипЗнч(Основание);
	ТЗИсточник = Новый ТаблицаЗначений;
	//Если ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Или ТипЗнч = Тип("Структура") И Основание.Свойство("Заявка") Тогда // иногда при заполненном фильтре в форме списка приемок создается на основании структуры с одним ключем основания-ссылки-приемки
	//	Если ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
	//		Параметры = Новый Структура;
	//		Массив = Новый Массив;
	//		Массив.Добавить(Основание);
	//		Параметры.Вставить("Документ", 		Массив);
	//		Параметры.Вставить("ТолькоВыдача",  Ложь);
	//		Параметры.Вставить("Заявка");
	//		ОснованиеСозданНаОсновании = Основание.СозданНаОсновании;
	//		Если ТипЗнч(ОснованиеСозданНаОсновании) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
	//			Параметры.Заявка = ОснованиеСозданНаОсновании;
	//		КонецЕсли;				
	//	Иначе
	//		Параметры = Основание;
	//	КонецЕсли;
	//	Форма.Заявка = Параметры.Заявка;
	
		Если Объект.ЭтоНовый() Тогда
			Объект.УстановитьСсылкуНового(Документы.уб_ПриемкаОплат.ПолучитьСсылку(Новый УникальныйИдентификатор));
		КонецЕсли;	
		//Объект.ВознаграждениеКурьераКлиентом = 0;ВознаграждениеКурьераКлиентом(Форма.Заявка,Объект.Ссылка);
		//_Заявка = Форма.Заявка;
		ТолькоВыдача = Неопределено;
		//Параметры.Свойство("ТолькоВыдача", ТолькоВыдача);
		//Допускаем, что тип элемента всегда ПеремещениеБСО
		ВсегоВМассиве = Заявки.Количество();
		ТЗИсточник = Новый ТаблицаЗначений;
		ТЗГотова = Ложь;		
		Для Счетчик = 0 по ВсегоВМассиве - 1 Цикл
			ТекДокумент = Заявки[Счетчик];
			Если ТолькоВыдача  = Истина Тогда
				Если НЕ ТекДокумент.Направление = 1 Тогда
					//Это не выдача
					//Старый код НЕ ДокументЯвляетсяВыдачей(ТекДокумент,СписокСотрудниковБСО) Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Если НЕ ТЗГотова Тогда
				ТЗИсточник = ТекДокумент.БСО.Выгрузить();
				ТЗИсточник.Индексы.Добавить("НомерБСО,ВидБСО");
				ТЗИсточник.Колонки.Добавить("Заявка");
				ТЗИсточник.ЗаполнитьЗначения(ТекДокумент,"Заявка");
				ТЗГотова = Истина;
			Иначе
				ТЗИсточник0 = ТекДокумент.БСО.Выгрузить();
				ТЗИсточник0.Колонки.Добавить("Заявка");
				ТЗИсточник0.ЗаполнитьЗначения(ТекДокумент,"Заявка");
				Для каждого СтрокаЗаявки из ТЗИсточник0 Цикл
					НоваяСтрока = ТЗИсточник.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаЗаявки);
				КонецЦикла;	
			КонецЕсли;	
				//ТЗИсточник.Колонки.Добавить("ДопНомерБСО",Новый ОписаниеТипов("Строка"));
				//Если Объект.Платежи.Количество()= 0 Тогда
				//	Объект.ЗаполнитьШапкуПоОснованию(ТекДокумент);
				//КонецЕсли;	
				
				Объект.ВознаграждениеКурьераКлиентом = Объект.ВознаграждениеКурьераКлиентом+ВознаграждениеКурьераКлиентом(Форма.Заявка,Объект.Ссылка);
				//Запрос = Новый Запрос;
				//Для каждого СтрокаБсо из  ТЗИсточник Цикл
				//	Запрос.текст = "ВЫБРАТЬ
				//	               |	уб_ДвиженияБСОСрезПоследних.Период,
				//	               |	уб_ДвиженияБСОСрезПоследних.Регистратор,
				//	               |	уб_ДвиженияБСОСрезПоследних.НомерСтроки,
				//	               |	уб_ДвиженияБСОСрезПоследних.Активность,
				//	               |	уб_ДвиженияБСОСрезПоследних.ВидБСО,
				//	               |	уб_ДвиженияБСОСрезПоследних.НомерБСО,
				//	               |	уб_ДвиженияБСОСрезПоследних.СК,
				//	               |	уб_ДвиженияБСОСрезПоследних.АгентОтправитель,
				//	               |	уб_ДвиженияБСОСрезПоследних.Агент,
				//	               |	уб_ДвиженияБСОСрезПоследних.ПоложениеБСО,
				//	               |	уб_ДвиженияБСОСрезПоследних.СостояниеБСО,
				//	               |	уб_ДвиженияБСОСрезПоследних.НомерПолиса,
				//	               |	уб_ДвиженияБСОСрезПоследних.ГодПолиса,
				//	               |	уб_ДвиженияБСОСрезПоследних.СтраховойПолис,
				//	               |	уб_ДвиженияБСОСрезПоследних.НаОснованииБумажногоДокумента,
				//	               |	уб_ДвиженияБСОСрезПоследних.ДатаВозврата,
				//	               |	уб_ДвиженияБСОСрезПоследних.Заявка,
				//	               |	уб_ДвиженияБСОСрезПоследних.Подтверждено,
				//	               |	уб_ДвиженияБСОСрезПоследних.Поставщик,
				//	               |	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент,
				//	               |	уб_ДвиженияБСОСрезПоследних.СтраховаяПремия,
				//	               |	уб_ДвиженияБСОСрезПоследних.Актуальная,
				//	               |	уб_ДвиженияБСОСрезПоследних.ДопНомерБСО,
				//	               |	уб_ДвиженияБСОСрезПоследних.КодОперации,
				//	               |	уб_ДвиженияБСОСрезПоследних.Комментарий
				//	               |ИЗ
				//	               |	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&Дата) КАК уб_ДвиженияБСОСрезПоследних
				//	               |ГДЕ
				//	               |	уб_ДвиженияБСОСрезПоследних.ВидБСО = &ВидБСО
				//	               |	И уб_ДвиженияБСОСрезПоследних.НомерБСО = &НомерБСО";
				//				   Запрос.УстановитьПараметр("Дата",ТекДокумент.Дата+1);
				//				   Запрос.УстановитьПараметр("ВидБСО",СтрокаБСО.ВидБСО);
				//				   Запрос.УстановитьПараметр("НомерБСО",СтрокаБСО.НомерБСО);
				//				   выборкаДопБСо= Запрос.Выполнить().Выбрать();
				//				   Если ВыборкаДопБСО.Следующий() Тогда
				//					   СтрокаБСО.ДопНомерБСО = ВыборкаДопБСО.ДопНомерБСО;
				//				   КонецЕсли;  
				//					   
				//КонецЦикла;	
			//	Продолжить;
			//Конецесли;	
			Для каждого ТекСтрока из ТекДокумент.БСО Цикл
				Если ТЗИсточник.НайтиСтроки (Новый Структура("ВидБСО,НомерБСО", ТекСтрока.ВидБСО, ТекСтрока.НомерБСО)).Количество() = 0 Тогда
					НоваяСтрока = ТЗИсточник.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	//ИначеЕсли Основание = "ПроверкаМодифицированности" Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ПересчитатьСуммыИУстановитьФлажки();
	//	УстановитьФлагКвитовки();
	//	Возврат;
	//Иначе
	//	ТЗИсточник = Новый ТаблицаЗначений;
	//КонецЕсли;
	Если ТЗИсточник.Количество() > 0 Тогда
		Форма.НачальнаяТаблица = ТЗИсточник.Скопировать();
		ТЗПриемник = Объект.Полисы.Выгрузить();
		//УдалитьСуществующиеБСО(ТЗИсточник, ТЗПриемник);
		СтандартнаяОбработка = Ложь;
		
		Форма.ТаблицаБСО = ТЗИсточник;
		Форма.ЭлементыФормы.ТаблицаБСО.СоздатьКолонки();
		Форма.ПодключитьОбработчикОжидания ("АктивизироватьФорму", 0.1, Истина);  
		//Форма.Открыть();
	КонецЕсли;
	
	Возврат Форма

КонецФункции	
	

Функция ЗаявкиБезПриемок(_ПринятоОт,КакТз = ЛОЖЬ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Кошелек
	               |ПОМЕСТИТЬ Заявки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Кошелек.Сотрудник = &Сотрудник
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Кошелек
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаОплатыСтрока = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
	               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Кошелек.Сотрудник = &Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |    Ложь как Выбран,
	               |	Заявки.Ссылка.Номер КАК Номер,
				   |	Заявки.Кошелек,
	               |	Заявки.Ссылка,
	               |	ПРЕДСТАВЛЕНИЕ(Заявки.Ссылка.Страхователь) КАК Страхователь,
				   |    Заявки.Ссылка.ИтогСуммаВзноса-Заявки.Ссылка.ИтогПредоставленнаяСкидка как кОплате,
	               |	Заявки.Ссылка.ИтогСуммаВзноса КАК ИтогСуммаВзноса,
	               |	Заявки.Ссылка.ИтогПредоставленнаяСкидка КАК ИтогПредоставленнаяСкидка,
	               |	уб_ИсторияСтатусовЗаявокСрезПоследних.Статус
	               
	               |ИЗ
	               |	Заявки КАК Заявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Полисы КАК Полисы
	               |		ПО (Полисы.Заявка = Заявки.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО Заявки.Ссылка = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка
	               |ГДЕ
	               |	Полисы.Ссылка ЕСТЬ NULL
	               |	И НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Заявки.Ссылка.Номер";
	Запрос.УстановитьПараметр("Сотрудник",_ПринятоОт);
	Если КакТз = Истина Тогда
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		СписокЗначений = Новый СписокЗначений;
		Выборка= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокЗначений.Добавить(Выборка.Ссылка,""+Выборка.номер +" от "+Выборка.Страхователь+" ("+Формат(Выборка.ИтогСуммаВзноса-Выборка.ИтогПредоставленнаяСкидка,"ЧДЦ=2; ЧГ=")+")");
		КонецЦикла;	
		Возврат СписокЗначений;
	КонецЕсли;
КонецФункции	
