
Перем СистемаТЧПлатежи;
Перем Отладка;
Перем МассивОтчетовКассираДляЗаписи Экспорт;

Процедура СоздатьПолисИОплату(
	Структ, 
	ВладелецФормы 			= Неопределено, 
	оСП						= Неопределено, 
	оО						= Неопределено,
	ПараметрыОППересчетСумм = Неопределено
	) Экспорт
	
	ЧастныеПараметрыОППересчетаСумм = ПараметрыОППересчетСумм <> Неопределено;
	ТекущаяДата = ТекущаяДата();
	_Интерактивно = НЕ ВладелецФормы = Неопределено;
	//+++Взаиморасчеты
	УИДГруппыСтроки = уб_Взаиморасчеты.ПолучитьУИДГруппыПоКлючуОперации(Структ.УИДСтроки);
	Если _Интерактивно И УИДГруппыСтроки = Ложь И ПараметрыСеанса.уб_Константы.ВестиВзаиморасчетыПоОперациям = Истина Тогда
		#Если Клиент Тогда
			Предупреждение("Не найдена запись по взаиморасчетам данной строки. Проведите документ повторно");
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	//+++Взаиморасчеты
	//Сначала ищем полис.
	оСП = Неопределено;
	Если НЕ ПустаяСтрока(Структ.УИДСтрокиЗаявки) Тогда
		СтрокаЗаявки = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПолучитьСтрокуПоУИД(Структ.УИДСтрокиЗаявки);
		Структ.Вставить("СтрокаЗаявки",СтрокаЗаявки);
	//ИначеЕсли Структ.СтраховойПродукт.Наименование = "ТО" Тогда	
	//	Структ.Вставить("НачисленнаяСуммаВзноса",0);
	//	Структ.Вставить("НачисленнаяСуммаВзносаВВалюте",0);
	//	Структ.Вставить("ДобавитьДопы",Истина);
	Иначе
		СтрокаЗаявки = Неопределено;
	КонецЕсли;
	
			
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СК", Структ.СК);
	Если Не ЗначениеЗаполнено(Структ.ОплатаПолисаДляОтчетаАгента) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Д.СтраховойПолис,
		|	Д.НомерПолиса,
		|	Д.НомерБСО,
		|	ВЫБОР
		|		КОГДА Д.Регистратор.СтраховаяПремия - Д.Регистратор.СуммаПремийПоОплатам >= 20
		|				И Д.Регистратор.СтраховаяПремия - Д.Регистратор.СуммаПремийПоОплатам <= -20
		|			ТОГДА 100
		|		ИНАЧЕ 1
		|	КОНЕЦ * ВЫБОР
		|		КОГДА Д.НомерПолиса = &НомерПолиса
		|			ТОГДА 100
		|		ИНАЧЕ 1
		|	КОНЕЦ 
		|* ВЫБОР
		|		КОГДА Д.НомерПолиса подобно &НомерБСО2
		|			ТОГДА 50
		|		ИНАЧЕ 1
		|	КОНЕЦ
		|* ВЫБОР
		|		КОГДА Д.Регистратор.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	Д.Регистратор.СтраховаяПремия - Д.Регистратор.СуммаПремийПоОплатам КАК НеОплаченнаяПремия,
		|	Д.Регистратор
		|ИЗ
		|	РегистрСведений.уб_ДвиженияБСО КАК Д
		|ГДЕ
		//|	Д.ВидБСО = &ВидБСО
				|	Д.СК = &СК
		|	И Д.НомерБСО подобно &НомерБСО2
		|	И Д.Регистратор ССЫЛКА Документ.уб_СтраховойПолис
		|   и НЕ Д.Регистратор.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
		Запрос.УстановитьПараметр("СК", 			Структ.СК);
		//Запрос.УстановитьПараметр("ВидБСО", 		Структ.ВидБСО); //могут внести другой ВИД бСО
		Запрос.УстановитьПараметр("НомерБСО", 		Структ.НомерБСО);
		//Запрос.УстановитьПараметр("НомерБСО2", 		"%"+Сред(СокрЛП(Структ.НомерБСО),4));
		
		//Запрос.УстановитьПараметр("НомерБСО2", 		"%"+Прав(СокрЛП(Структ.НомерБСО),СтрДлина(СокрЛП(Структ.НомерБСО)-4))+"%");
		Запрос.УстановитьПараметр("НомерБСО2", 		"%"+СокрЛП(Структ.НомерБСО)+"%");
		Запрос.УстановитьПараметр("НомерПолиса", 	СокрЛП(Структ.НомерПолиса));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если _Интерактивно и уб_temp.ЧислоПоМодулю(Выборка.НеОплаченнаяПремия) < 20 Тогда
				Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ЗапретПравкиДатыЗаявки, Ложь) Тогда
					Сообщить("Уже внесен полис "+Выборка.Регистратор);
					Возврат;
				КонецЕсли;	
				СЗ = Новый СписокЗначений;
				СЗ.Добавить(Документы.уб_СтраховойПолис.ПустаяСсылка(),	"Создать новый полис");
				СЗ.Добавить(Выборка.Регистратор,	Строка(Выборка.Регистратор) + " остаток: " + Выборка.НеОплаченнаяПремия);
				Пока Выборка.Следующий() Цикл
					СЗ.Добавить(Выборка.Регистратор,Строка(Выборка.Регистратор) + " остаток: " + Выборка.НеОплаченнаяПремия);
				КонецЦикла;
				ВыбранныйПолис = СЗ.ВыбратьЭлемент("Список оплаченных полисов");
				Если ВыбранныйПолис <> Неопределено Тогда
					Если Не ВыбранныйПолис.Значение.Пустая() Тогда
						сСП = ВыбранныйПолис.Значение;
						оСП = сСП.ПолучитьОбъект();
					КонецЕсли;
				Иначе
					//при закрытии окна прерываем создание
					Возврат
				КонецЕсли;
			Иначе
				сСП = Выборка.СтраховойПолис;
				оСП = сСП.ПолучитьОбъект();
			КонецЕсли;
		КонецЕсли;
	Иначе	
		сСП = Структ.ОплатаПолисаДляОтчетаАгента.СтраховойПолис;
		Если сСП.Пустая() Тогда
			оСП = Неопределено;
		Иначе
			оСП = сСП.ПолучитьОбъект();
		КонецЕсли;	
	КонецЕсли;		
	Если оСП <> Неопределено Тогда
		Если _Интерактивно Тогда
			Фрм_СП = оСП.ПолучитьФорму(,ВладелецФормы);
			Фрм_СП.Открыть(); //TODO вынести начальное заполнение из ПриОткрытии
		КонецЕсли;
		//+++Взаиморасчеты
		Если ПараметрыСеанса.уб_Константы.ВестиВзаиморасчетыПоОперациям = Истина Тогда
			УИДГруппыПолиса = уб_Взаиморасчеты.ПолучитьУИДГруппыПоДокументу(сСП);
			Если НЕ УИДГруппыПолиса = УИДГруппыСтроки Тогда
				уб_Взаиморасчеты.СлияниеГрупп(УИДГруппыПолиса,УИДГруппыСтроки);
			КонецЕсли;	
		КонецЕсли;	
		//---Взаиморасчеты
		ТребуетсяАктивизировать = Ложь;//Это старый полис
	Иначе
		//Полис отсутствует
		оСП = Документы.уб_СтраховойПолис.СоздатьДокумент();
		ТребуетсяАктивизировать = Истина;//Это новый полис
		Если _Интерактивно Тогда
			Фрм_СП = оСП.ПолучитьФорму(,ВладелецФормы);		
		КонецЕсли;	
		уб_СтраховойБрокер.ЗаполнитьШапкуДокументаСтрБрокер(оСП, ПараметрыСеанса.ТекущийПользователь, ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета);
		оСП.ДатаМониторинга  	= Структ.ДатаОформления;
		оСП.ДатаДвиженияБСО 	= ТекущаяДата;//Полис ставим позже оплаты, т.к. он меняет агента и состояние
		оСП.ВидУчетаСтраховки 	= Перечисления.уб_ВидыУчетаСтраховок.Первичная;
		оСП.СостояниеПолиса 	= Перечисления.уб_СостоянияПолиса.Действует;
		оСП.ЗаполнитьДокументПоСтруктуре(Структ);//////-----Заполняется в Полисе-------///////
		оСП.ДополнительныеСвойства.Вставить("НеДвигатьСтатусы",Истина);
		оСП.Записать();
		//РегистрыСведений.уб_ПредоставленныеДокументыСП.ЗаполнитьПредоставленныеДокументыПоЗаявке(оСП.Ссылка, Структ.Заявка);
		Если _Интерактивно Тогда
			Фрм_СП.Открыть(); //TODO вынести начальное заполнение из ПриОткрытии
			Фрм_СП.ТекущийЭлемент = Фрм_СП.ЭлементыФормы.ДатаОформления;
		КонецЕсли;			
		сСП = оСП.Ссылка;
		//+++ Взаиморасчеты
		Если УИДГруппыСтроки = Ложь Тогда
			//Нет ни документа, ни строки
			//считаем, что это создание новой приемки до ее проведени, например загрузка ВЗР с сайта
			//генерируем новый
			УИДГруппыСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		УИДГруппыПолиса = УИДГруппыСтроки;		
		//Отключено потому что не вопремя создается для взр
		Если _Интерактивно Тогда
			уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("СозданиеСтраховогоПолиса",
			,//Автоматическое определение вида
			сСП, //Документ Записи
			сСП,//Отбор
			0,//Сумма
			Новый Структура("Дата,Агент,Страхователь,Поставщик,ОрганизацияАгент",Структ.ДатаОформления,Структ.Агент,Структ.Страхователь,Структ.Поставщик,Структ.ОрганизацияАгент),
			УИДГруппыПолиса);
		КонецЕсли;
		//--- Взаиморасчеты		
	КонецЕсли;
	//Привяжем файлы приемки оплат к текущему полису	
	//чкн
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда	
		ЗапросФайлов = Новый Запрос;
		ЗапросФайлов.Текст = "ВЫБРАТЬ
		                     |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Расчетчик,
		                     |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДопСоглашение,
		                     |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ДругиеДокументы
		                     |ИЗ
		                     |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
		                     |ГДЕ
		                     |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка";
		ЗапросФайлов.УстановитьПараметр("Ссылка", Структ.Заявка);
		Выборка = ЗапросФайлов.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			ДанныеДляСправочника = Структ.ДопДанные;
			// расчетчик
			Если НЕ ТипЗнч(Выборка.Расчетчик) = Тип("Строка") И ЗначениеЗаполнено(Выборка.Расчетчик) Тогда 
				обФайл = Выборка.Расчетчик.ПолучитьОбъект();
				обФайл.Страхователь = Структ.Страхователь;
				обФайл.ОбъектСтрахования = ДанныеДляСправочника.ОбъектСтрахования;
				Если обФайл.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					обФайл.Опубликован = ИСТИНА;
				КонецЕсли;
				Попытка
					обФайл.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				НоваяСтрока = оСП.СписокФайлов.Добавить();
				НоваяСтрока.ДатаПубликации = ТекущаяДата();
				НоваяСтрока.Размещен = ИСТИНА;
				НоваяСтрока.СсылкаСправочника = Выборка.Расчетчик;
				Если НоваяСтрока.СсылкаСправочника.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					НоваяСтрока.Опубликован = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
			// ДопСоглашение
			Если НЕ ТипЗнч(Выборка.ДопСоглашение) = Тип("Строка") И ЗначениеЗаполнено(Выборка.ДопСоглашение) Тогда 
				обФайл = Выборка.ДопСоглашение.ПолучитьОбъект();
				обФайл.Страхователь = Структ.Страхователь;
				обФайл.ОбъектСтрахования = ДанныеДляСправочника.ОбъектСтрахования;
				Если обФайл.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					обФайл.Опубликован = ИСТИНА;
				КонецЕсли;
				Попытка
					обФайл.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				НоваяСтрока = оСП.СписокФайлов.Добавить();
				НоваяСтрока.ДатаПубликации = ТекущаяДата();
				НоваяСтрока.Размещен = ИСТИНА;
				НоваяСтрока.СсылкаСправочника = Выборка.ДопСоглашение;
				Если НоваяСтрока.СсылкаСправочника.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					НоваяСтрока.Опубликован = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
			// ДругиеДокументы
			Если НЕ ТипЗнч(Выборка.ДругиеДокументы) = Тип("Строка") И ЗначениеЗаполнено(Выборка.ДругиеДокументы) Тогда 
				обФайл = Выборка.ДругиеДокументы.ПолучитьОбъект();
				обФайл.Страхователь = Структ.Страхователь;
				обФайл.ОбъектСтрахования = ДанныеДляСправочника.ОбъектСтрахования;
				Если обФайл.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					обФайл.Опубликован = ИСТИНА;
				КонецЕсли;
				Попытка
					обФайл.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				НоваяСтрока = оСП.СписокФайлов.Добавить();
				НоваяСтрока.ДатаПубликации = ТекущаяДата();
				НоваяСтрока.Размещен = ИСТИНА;
				НоваяСтрока.СсылкаСправочника = Выборка.ДругиеДокументы;
				Если НоваяСтрока.СсылкаСправочника.ВидФайлаB2B <> Перечисления.уб_ВидыФайловB2B.ДСП Тогда 
					НоваяСтрока.Опубликован = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Попытка
			оСП.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

	Иначе
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	уб_ФайлыКПолисам.СтраховойПолис,
		|	уб_ФайлыКПолисам.СК,
		|	уб_ФайлыКПолисам.ВидБСО,
		|	уб_ФайлыКПолисам.НомерБСО,
		|	уб_ФайлыКПолисам.УИД
		|ИЗ
		|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		|ГДЕ
		|	уб_ФайлыКПолисам.СтраховойПолис = &УИДСтроки");
		Запрос.УстановитьПараметр("УИДСтроки", Структ.УИДСтроки);
		Результат	= Запрос.Выполнить().Выбрать();
		Запись		= РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
		Пока Результат.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Запись, Результат);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.СтраховойПолис = сСП;
				//Запись.УИДСтроки = "";
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	//чкн
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	О.Ссылка
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК О
	|ГДЕ
	|	НЕ О.ПометкаУдаления
	|   И О.СтраховойПолис = &СтраховойПолис
	|	И О.НомерКвитанции = &НомерКвитанции
	//|	И О.СК = &СК
	//|	И О.СтраховойПродукт = &СтраховойПродукт
	|	И О.Дата МЕЖДУ &ДатаН И &ДатаО";
	Запрос.УстановитьПараметр("НомерКвитанции",		Структ.НомерКвитанции);
	//	Запрос.УстановитьПараметр("СтраховойПродукт",	Структ.СтраховойПродукт);
	//	Запрос.УстановитьПараметр("СК",					Структ.СК);
	Запрос.УстановитьПараметр("СтраховойПолис",		сСП);
	Запрос.УстановитьПараметр("ДатаН",				ДобавитьМесяц(Структ.ДатаОплаты, -1));
	Запрос.УстановитьПараметр("ДатаО",				ДобавитьМесяц(Структ.ДатаОплаты, 1));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		сО = Выборка.Ссылка;
		СоздатьКвитовку(Выборка.Ссылка, Структ.УИДСтроки);
		оО = Выборка.Ссылка.ПолучитьОбъект();
		Если _Интерактивно Тогда
			ФрмОП = Выборка.Ссылка.ПолучитьФорму(,Фрм_СП.ЭлементыФормы.ОплатыСписок);
			ФрмОП.лРазблокировать = Истина;
			ФрмОП.лРазрешеноРедактирование = Истина;		
			ФрмОП.Открыть();
		КонецЕсли;	
	Иначе		
		оО = Документы.уб_ОплатаПолисов.СоздатьДокумент();
		оО.СтраховойПолис = сСП;
		Если оСП.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная 
			или оСП.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Агентская 
			Тогда
			оО.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
			оО.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;
		Иначе
			оО.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме;
		Конецесли;
		оО.Дата	= Структ.ДатаОплаты;
		АгентПоследнегоДвижения = Неопределено;
		ДатаПоследнегоДвижения = уб_temp.ПолучитьДатуПоследнегоДвижения(уб_Кэшируемые.ВидБСОТипаКвА7ДляСК(Структ.СК).ВидБСО, Структ.НомерКвитанции,АгентПоследнегоДвижения);
		Если НЕ ДатаПоследнегоДвижения = Неопределено И ДатаПоследнегоДвижения >= ТекущаяДата Тогда
			оО.ДатаПроведенияБСО = ДатаПоследнегоДвижения + 1;
		Иначе
			оО.ДатаПроведенияБСО = ТекущаяДата+1;
		КонецЕсли;
		Если НЕ ДатаПоследнегоДвижения = Неопределено И Структ.Курьер = АгентПоследнегоДвижения Тогда
			оо.СписатьСКурьера = Истина;
		КонецЕсли;
		оО.СК				= Структ.СК;
		оО.Валюта			= Структ.Валюта;
		оО.СтраховойПродукт	= Структ.СтраховойПродукт;
		оО.ВидСП			= Структ.СтраховойПродукт;//.Вид;
		оО.ФормаОплаты		= Структ.ФормаОплаты;
		
		//ППС 29-07-2014
		СписокРисков = Новый СписокЗначений;
		СписокРисков = уб_Temp.ПолучитьРискиПоСтраховомуПродукту(Структ.СтраховойПродукт);
		Если СписокРисков.Количество() = 1 Тогда
			оО.Риск = СписокРисков[0].Значение;
		КонецЕсли;
		//ППС 29-07-2014
		
		СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
		Если СистемаНаправлениеПлатежа Тогда
			Если ФормаОплаты() = Перечисления.уб_ФормыОплаты.Поставщику Тогда
				НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.Поставщику;
			Иначе
				НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.ВБрокер;
			КонецЕсли;
			оО.НаправлениеПлатежа = НаправлениеПлатежа;
		КонецЕсли;
		оО.Агент							= Структ.Агент;
		оО.Курьер							= Структ.Курьер;
		оО.НачисленнаяСуммаВзносаВВалюте	= Структ.НачисленнаяСуммаВзносаВВалюте;
		оО.НачисленнаяСуммаВзноса			= Структ.НачисленнаяСуммаВзноса;
		оО.ОплаченоФакт						= Структ.Сумма;
		оО.ЕстьКвитанция 					= ЗначениеЗаполнено(Структ.НомерКвитанции);
		оО.НомерКвитанции 					= Структ.НомерКвитанции;
		оО.ДопНомерКвитанции 				= Структ.ДопНомерКвитанции;
		оО.ОрганизацияАгент 				= ?(ЗначениеЗаполнено(Структ.ОрганизацияАгентКвитанции),Структ.ОрганизацияАгентКвитанции,Структ.ОрганизацияАгент);
		оО.Поставщик 						= ?(ЗначениеЗаполнено(Структ.ПоставщикКвитанции),Структ.ПоставщикКвитанции,Структ.Поставщик);
		оО.СкидкаВыплаченаяКлиенту			= Структ.СкидкаВыплаченаяКлиенту;
		оО.ПлатежныйДокумент_Дата           = ДатаОбосновывающегоДокумента;
		оО.ПлатежныйДокумент_Номер          = НомерОбосновывающегоДокумента;
		оО.ДатаМониторинга                  = оСП.ДатаМониторинга;
		оО.ОкруглятьКВДо2Знаков				= Истина;
		оО.РежимОкругления                  = Перечисления.уб_РежимОкругления.Окр15как20;
		оО.РазрядностьОкругления            = 2;
		оО.Подразделение = уб_СС.ПолучитьПодразделениеАгента(Структ.Агент, Структ.ДатаОплаты, Ложь, Истина);
		оО.Курс = Структ.Курс;
		оО.НомерВзноса = Структ.НомерВзноса;
		//Предварительный расчет АВ/Скидки
		оО.АВилиСкидкаСумма = оО.НачисленнаяСуммаВзноса - оО.ОплаченоФакт;
		оО.АВилиСкидкаПроцент = Окр(?(оО.НачисленнаяСуммаВзноса = 0, 0, (оО.АВилиСкидкаСумма / оО.НачисленнаяСуммаВзноса)) * 100,2);
		Если оО.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
			//Изначально задаем КВ агента как сумме НЕХВАТАЮЩИХ денег, в дальнейшем оно не должно синхронизироваться
			оО.КВПроцентДляАгента  = оО.АВилиСкидкаПроцент;
			оО.КВСуммаДляАгента    = оО.АВилиСкидкаСумма;
		КонецЕсли;	
		Если НЕ СтрокаЗаявки = Неопределено Тогда
			Если СтрокаЗаявки.Свойство("КВБрокераПлан") = Истина и СтрокаЗаявки.КВБрокераПлан>0 Тогда
				оО.КВПроцент          = СтрокаЗаявки.КВБрокераПлан;
				оО.КВПроцентДляОтчета = СтрокаЗаявки.КВБрокераПлан;
				Если НЕ оО.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
					оО.КВПроцентДляАгента = СтрокаЗаявки.КВБрокераПлан;
				Иначе
					ПлановыйПроцентАгента = ?(СтрокаЗаявки.КВБрокераПлан>=6,СтрокаЗаявки.КВБрокераПлан-6,0);
					оО.КВПроцентДляАгента = ПлановыйПроцентАгента;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		//+++Допы из заявки
		МассивДопСтрок = Новый Массив;
		Попытка
			
			Если Не СтрокаЗаявки =Неопределено Тогда
				ЗапросДопы = Новый Запрос;
				ЗапросДопы.Текст = "ВЫБРАТЬ
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО,
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.СК,
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогСтраховаяПремия,
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки,
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ОрганизацияАгент,
								   |    уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Менеджер, уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Дата как Дата,
				                  // |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.СхемаОплаты, ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка)) КАК СхемаОплаты,
								   //|	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.СхемаОплатыРОП, ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка)) КАК СхемаОплатыРОП,
				                   //|	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ВидБСО.ПлановаяСтоимость, 0) КАК ПлановаяСтоимость,
				                   |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение, """") КАК Подразделение,
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Куратор как Куратор
				                   |ИЗ
				                   |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
				                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
				                   |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка.Менеджер = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
				                   |ГДЕ
				                   |	уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = &Ссылка
				                   |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидРодителя = &УидРодителя
				                   |	И уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.ИтогСтраховаяПремия > 0";
				;
				ЗапросДопы.УстановитьПараметр("УидРодителя",Структ.УИДСтрокиЗаявки);
				Если ЗначениеЗаполнено(СтрокаЗаявки.Ссылка) Тогда
					ЗапросДопы.УстановитьПараметр("Ссылка",СтрокаЗаявки.Ссылка);	
				Иначе
					ЗапросДопы.УстановитьПараметр("Ссылка",Структ.Заявка);	
				КонецЕсли;
				
				
				ВыборДоп = ЗапросДопы.Выполнить().Выбрать();
				Пока ВыборДоп.Следующий() Цикл
					Услуга = оО.УслугиПоДокументу.Добавить();
					Услуга.Вид           = ВыборДоп.ВидБСО; 
					Услуга.Сумма         = ВыборДоп.ИтогСтраховаяПремия;
					ДанныеПоБланку = уб_РасчетыСМенеджерами.ПолучитьСхемуИАлгоритмРасчета(ВыборДоп.ВидБСО,ВыборДоп.Менеджер,ВыборДоп.Дата);
					Если не ДанныеПоБланку = Неопределено Тогда
						Услуга.Себестоимость  = ДанныеПоБланку.МинимальнаяСумма;
						Услуга.СхемаОплаты    = ДанныеПоБланку.Схема;
						Услуга.СхемаОплатыРОП = ДанныеПоБланку.СхемаРОП;
					Иначе	
						Услуга.Себестоимость = 0;
					Конецесли;	
					//Услуга.Себестоимость = ВыборДоп.ПлановаяСтоимость;//?(ВыборДоп.ПлановаяСтоимость>0 и Найти(ВыборДоп.Подразделение,"М-ОП")=1,200,ВыборДоп.ПлановаяСтоимость);;
					//Услуга.СхемаОплаты   = ВыборДоп.СхемаОплаты;
					//Услуга.СхемаОплатыРОП   = ВыборДоп.СхемаОплатыРОП;
					Услуга.УидСтроки     = ВыборДоп.УидСтроки;
					Услуга.ВМ            = 0;//Расчитается при пересчете сумм, ниже
					Если не ПустаяСтрока(ВыборДоп.УидСтроки) Тогда
						оО.ОплаченоФакт = оО.ОплаченоФакт+Услуга.Сумма;
						МассивДопСтрок.Добавить(ВыборДоп.УидСтроки);
					КонецЕсли;	
					Если оО.Куратор<>ВыборДоп.Куратор Тогда
						оО.Куратор = ВыборДоп.Куратор;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли Структ.Свойство("ДобавитьДопы") Тогда	
				Услуга = оО.УслугиПоДокументу.Добавить();
				Услуга.Вид           = Структ.ВидБСО; 
				Услуга.Сумма         = Структ.Сумма;
				//Услуга.Себестоимость = Структ.ВидБСО.ПлановаяСтоимость;
				//Услуга.СхемаОплаты   = Структ.ВидБСО.СхемаОплаты;
				//Услуга.СхемаОплатыРОП   = Структ.ВидБСО.СхемаОплатыРОП;
				ДанныеПоБланку = уб_РасчетыСМенеджерами.ПолучитьСхемуИАлгоритмРасчета(Услуга.Вид,Структ.Агент,Структ.ДатаОплаты);
				Если не ДанныеПоБланку = Неопределено Тогда
					Услуга.Себестоимость  = ДанныеПоБланку.МинимальнаяСумма;
					Услуга.СхемаОплаты    = ДанныеПоБланку.Схема;
					Услуга.СхемаОплатыРОП = ДанныеПоБланку.СхемаРОП;
				Иначе	
					Услуга.Себестоимость = 0;
				Конецесли;	
				Услуга.УидСтроки     = Новый УникальныйИдентификатор;
				Услуга.ВМ            = 0;//Расчитается при пересчете сумм, ниже
			КонецЕсли;
		Исключение
			Сообщить("Ошибка при добавлении дополнительных услуг из заявки "+ОписаниеОшибки());
		КонецПопытки;
		
		//---Допы из заявки
		
		//производить пересчет только на клиенте, если параметры пересчета не были переданы
		Если ПараметрыОППересчетСумм = Неопределено Тогда
			#Если Клиент Тогда
				ПараметрыОППересчетСумм = уб_РасчетыСМенеджерами.СтруктураПараметровОППересчетСуммПоУмолчанию();
			#КонецЕсли
		КонецЕсли;
		Если ПараметрыОППересчетСумм <> Неопределено Тогда
			уб_РасчетыСМенеджерами.ОП_ПересчетСумм(оО,,, ПараметрыОППересчетСумм);
		КонецЕсли;
		//+++ Взиморасчеты
		оО.ИДГруппыВзаиморасчетов  = УИДГруппыПолиса;
		//+++ Взиморасчеты
		Попытка
			оО.Записать()
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи оплаты в СоздатьПолисИОплату /ПриемкаОплаты  ",, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);			
		КонецПопытки;
		//Страховой полис
		//Фрм_СП.ОсновныеДействияФормыкнЗаписать(Неопределено);		
		//Открываем оплату
		сО = оО.Ссылка;
		//ДобавляемОплату = Истина; //Хз зачем-то снимаем запрещено
		//TODO!!!!ЭлементыФормы.Полисы.ТекущаяСтрока.ОплатаПолисаДляОтчетаАгента = оО.Ссылка;
		СоздатьКвитовку(оО.Ссылка, Структ.УИДСтроки);
		
		//Квитовки к оплате допуслуг
		Для Каждого СтрокаДопУИД Из МассивДопСтрок Цикл
			УИДСтроки = НайтиУидПоДопу(СтрокаДопУИД);
			Если Не УИДСтроки = "" Тогда
				//
				СоздатьКвитовку(оО.Ссылка, УИДСтроки);
			КонецЕсли;	
		КонецЦикла;
		
		Если _Интерактивно Тогда
			ФрмОП = оО.ПолучитьФорму(,Фрм_СП.ЭлементыФормы.ОплатыСписок);
			ФрмОП.лДокумент_Владелец 		= оСП.Ссылка;
			ФрмОП.лФорма_Владелец 			= Фрм_СП;
			ФрмОП.лРазблокировать 			= Истина;
			//не устанавливать Истина! При загрузке ВЗР пересчет сумм запускается дважды,
			//один раз из модуля вручную и устанавливает корректные данные с частными параметрами,
			//потом запускается форма и с разрешенным редактированием запускает перерасчет с неверными параметрами перерасчета
			//TODo сделать так чтобы флаг взводился после попытки пересчета
			//ФрмОП.лРазрешеноРедактирование 	= Истина;
			ФрмОП.лРазрешеноРедактирование 	= Не ЧастныеПараметрыОППересчетаСумм;
			ФрмОП.УстановитьЗначениеЗППериода();		
			Фрм_СП.УстановитьОтборОплат();
			ФрмОП.Открыть();
		КонецЕсли;	
		Если оСП.Проведен Тогда
			//Отключаем оповещение при записи, оповещение будет при проведении //TODO может быть поменять?
			оСП._НеОповещатьОЗаписи_ = Истина;
		КонецЕсли;
	КонецЕсли;
	УдалитьВременныеДанныеПолисаКПриемкеОплат(Структ.УИДСтроки);
	Если _Интерактивно Тогда
		Если Не ЗначениеЗаполнено(Структ.ОплатаПолисаДляОтчетаАгента) Тогда
			ОплатаПолисаДляОтчетаАгента = Документы.уб_ПриемкаОплат.ПолучитьОплатуПолисаДляОтчетаАгента(Структ.УИДСтроки, Структ.НомерКвитанции);
		Иначе
			ОплатаПолисаДляОтчетаАгента = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОплатаПолисаДляОтчетаАгента)	И сО <> ОплатаПолисаДляОтчетаАгента Тогда
			ФрмОП = ОплатаПолисаДляОтчетаАгента.ПолучитьФорму(,Фрм_СП.ЭлементыФормы.ОплатыСписок);
			ФрмОП.Открыть();
		ИначеЕсли ТребуетсяАктивизировать и Фрм_СП.Открыта() Тогда
			//Активизируем страховой полис
			Фрм_СП.Активизировать()
		КонецЕсли;
	КонецЕсли;
	Структ.ОплатаПолисаДляОтчетаАгента = ОплатаПолисаДляОтчетаАгента;
	
КонецПроцедуры

Функция НайтиУидПоДопу(СтрокаДопУИД)
	Для Каждого СтрокаПолиса Из Полисы Цикл
		Если СтрокаПолиса.УИДСтрокиЗаявки = СтрокаДопУИД Тогда
			Возврат СтрокаПолиса.УИДСтроки
		КонецЕсли;	
	КонецЦикла;
	Возврат  "";
КонецФункции

////////////////////////////////////////////////////////////////////////////
//              ПРОВЕДЕНИЕ ДОКУМЕНТА

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("ПринятоОТ");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	Движения.уб_ДвиженияБСО.Очистить();
	Движения.уб_ОстаткиБСО.Очистить();
	//ИнфоЗапись = Не Проведен;
	ВидГраницыДок = ВидГраницы.Исключая;
	ГраницаДокумента = Новый Граница(МоментВремени().Дата,ВидГраницыДок);
	//НужноОбновитьСтатусы = Ложь;
	//+++Взаиморасчеты
	ВидОперации = ?(ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику, Справочники.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаПоставщиком, Справочники.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером); 
	ЗапросВзаиморасчеты = Неопределено;
	
	ОбнулитьСтраховуюПремию = Истина;
	Если Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя Тогда
		_Подтверждено = Истина;
		Если ОтчетКассира.Подтверждено Тогда
			
			_Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
		Иначе
			ОбнулитьСтраховуюПремию = Ложь;
			_Агент = Автор.ФизЛицо;
			Если ЗначениеЗаполнено(_Агент)= Ложь Тогда
				_Агент = Подразделение.МОЛпоБСО;
			КонецЕсли;	
			Если ЗначениеЗаполнено(_Агент)= Ложь Тогда
				_Подтверждено = Ложь;
				_Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
			КонецЕсли;	
		КонецЕсли;
		
		
	Иначе	
		_Подтверждено = Истина;
		_Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	КонецЕсли;	
	//---Взаиморасчеты-	
	Для Каждого СтрокаТЧ Из Полисы Цикл
		//Подготовка данных по полису
		ЗаписьРег = уб_СС.ПоследняяЗаписьРегистраДвижений(ГраницаДокумента, СтрокаТЧ.СК, СтрокаТЧ.ВидБСО, СокрЛП(СтрокаТЧ.НомерБСО));
		ТипУчета = Неопределено;
		АгентКол = ПринятоОТ;
		Если ЗаписьРег  = Неопределено Тогда
			ЗаписьРег = Новый Структура("ВидБСО,СК,НомерБСО,ДопНомерБСО,Подтверждено,Поставщик,ОрганизацияАгент,ГодПолиса,ДатаВозврата,СтраховойПолис,СтраховаяПремия",
			СтрокаТЧ.ВидБСО,СтрокаТЧ.СК,СтрокаТЧ.НомерБСО,СтрокаТЧ.ДопНомерБСО,Ложь,СтрокаТЧ.Поставщик,СтрокаТЧ.ОрганизацияАгент,"",Документы.уб_СтраховойПолис.ПустаяСсылка(),0);
			Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО,ТипУчета) Тогда
				
				
				ЗапросОст = Новый Запрос;
				ЗапросОст.Текст = "ВЫБРАТЬ
				                  |	ЕСТЬNULL(СУММА(ВЫБОР
				                  |				КОГДА уб_ОстаткиБСО.ВидДвижения = ЗНАЧЕНИЕ(ВидДВиженияНакопления.Приход)
				                  |					ТОГДА уб_ОстаткиБСО.Количество
				                  |				ИНАЧЕ -уб_ОстаткиБСО.Количество
				                  |			КОНЕЦ), 0) КАК Количество,
				                  |	уб_ОстаткиБСО.Агент КАК Агент
				                  |ИЗ
				                  |	РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
				                  |ГДЕ
				                  |	уб_ОстаткиБСО.Заявка = &Заявка
				                  |	И уб_ОстаткиБСО.ВидБСО = &ВидБСО
				                  |	И уб_ОстаткиБСО.Период < &ДатаДок
				                  |
				                  |СГРУППИРОВАТЬ ПО
				                  |	уб_ОстаткиБСО.Агент";
				ЗапросОст.УстановитьПараметр("Заявка",СтрокаТЧ.Заявка);
				ЗапросОст.УстановитьПараметр("ВидБСО",СтрокаТЧ.ВидБСО);
				ЗапросОст.УстановитьПараметр("ДатаДок",Дата);
				РезОстатки = ЗапросОст.Выполнить().Выгрузить();
				Если  РезОстатки.Итог("Количество")>0 Тогда
					ВидДвижения = "номер,количество";//Количество в плюсе, иначе мы точно не можем потом найти такой полис(например он печатный)
					Для каждого ВыборкаОст из РезОстатки Цикл
						Если ВыборкаОст.Количество>0 Тогда
							АгентКол = ВыборкаОст.Агент;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				Иначе
					ВидДвижения = "номер";	
				КонецЕсли;
			ИначеЕсли уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО,ТипУчета) Тогда
				ВидДвижения = "номер";	
			Иначе
				ВидДвижения = Неопределено;	
			КонецЕсли;
		Иначе
			ВидДвижения = "номер";	
			//ЗаписьРег.Подтверждено = _Подтверждено;
		КонецЕсли;	
		
		//ЗаписьРег.Подтверждено = _Подтверждено;
		
		тДвижений = Новый ТаблицаЗначений;
		тДвижений.Колонки.Добавить("ВидДвижения");
		тДвижений.Колонки.Добавить("ЗаписьРег");
		Если НЕ ВидДвижения = Неопределено Тогда 
			Движение = тДвижений.Добавить();
			Движение.ВидДвижения = ВидДвижения;
			Движение.ЗаписьРег = ЗаписьРег;
		Конецесли;		
		//Подготовка данных по квитанции
		Если ПустаяСтрока(СтрокаТЧ.НомерКвитанции)=Ложь и Не СтрокаТЧ.НомерКвитанции = "б/н" Тогда
			//ВидБСОТипаКвА7 = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СтрокаТЧ.СК);
			СтруктураВидБСО = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СтрокаТЧ.СК);
			ВидБСОТипаКвА7 = СтруктураВидБСО.ВидБСО;
			ЗаписьРегА7 = уб_СС.ПоследняяЗаписьРегистраДвижений(ГраницаДокумента, СтрокаТЧ.СК, ВидБСОТипаКвА7, СокрЛП(СтрокаТЧ.НомерКвитанции));
			Если ЗаписьРегА7  = Неопределено Тогда
				ЗаписьРегА7 = Новый Структура("ВидБСО,СК,НомерБСО,ДопНомерБСО,Подтверждено,Поставщик,ОрганизацияАгент,ГодПолиса,ДатаВозврата,СтраховойПолис,СтраховаяПремия",
				ВидБСОТипаКвА7,СтрокаТЧ.СК,СтрокаТЧ.НомерКвитанции,СтрокаТЧ.ДопНомерКвитанции,Ложь,СтрокаТЧ.ПоставщикКвитанции,СтрокаТЧ.ОрганизацияАгентКвитанции,"",Документы.уб_СтраховойПолис.ПустаяСсылка(),0);
			КонецЕсли;	
			Движение = тДвижений.Добавить();
			Движение.ВидДвижения = "номер";
			Движение.ЗаписьРег = ЗаписьРегА7;
		КонецЕсли;		
		//Запись движений по строке
		Для каждого ДвижениеВыборка из тДвижений Цикл
			Данные = ДвижениеВыборка.ЗаписьРег;
			Если Найти(ДвижениеВыборка.ВидДвижения,"номер")>0 Тогда
				ДвижениеД = Движения.уб_ДвиженияБСО.Добавить();
				ДвижениеД.Период 	= Дата;
				ДвижениеД.СК 		= Данные.СК;
				ДвижениеД.ВидБСО 	= Данные.ВидБСО;
				ДвижениеД.НомерБСО 	= Данные.НомерБСО;
				ДвижениеД.ДопНомерБСО 	= Данные.ДопНомерБСО;
				ДвижениеД.Поставщик 		= СтрокаТЧ.Поставщик;
				ДвижениеД.ОрганизацияАгент 		= СтрокаТЧ.ОрганизацияАгент;
				//ДвижениеД.Поставщик 		= Данные.Поставщик;
				//ДвижениеД.ОрганизацияАгент 	= Данные.ОрганизацияАгент;
				ДвижениеД.Подтверждено 		= _Подтверждено;//Данные.Подтверждено;
				ДвижениеД.ГодПолиса 		= Данные.ГодПолиса;
				ДвижениеД.СтраховойПолис 	= Данные.СтраховойПолис;
				ДвижениеД.ДатаВозврата 		= Данные.ДатаВозврата;
				ДвижениеД.Активность 		= Проведен;
				ДвижениеД.АгентОтправитель 	= ПринятоОТ;
				ДвижениеД.Агент 			= _Агент;
				ДвижениеД.ПоложениеБСО 		= Перечисления.уб_ПоложенияБСО.ВозвращенСТочки;			
				ДвижениеД.СостояниеБСО 		= Перечисления.уб_СостоянияБСО.Оформлен;
				ДвижениеД.НомерПолиса 		= СтрокаТЧ.НомерПолиса;
				ДвижениеД.НаОснованииБумажногоДокумента = Ложь;
				ДвижениеД.Комментарий 		= Комментарий;
				ДвижениеД.КодОперации 		= Перечисления.уб_КодыОперацийБСО.ПриемОплаты;
				ДвижениеД.Заявка            = СтрокаТЧ.Заявка;
				Если ОбнулитьСтраховуюПремию = Ложь Тогда
					Попытка
						ДвижениеД.СтраховаяПремия = Данные.СтраховаяПремия;
					Исключение
					КонецПопытки;	
				КонецЕсли;	
			КонецЕсли;			
			Если Найти(ДвижениеВыборка.ВидДвижения,"количество")>0 Тогда
				Движение					= Движения.уб_ОстаткиБСО.Добавить();
				Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
				Движение.Период				= Дата;
				// измерения
				Движение.Поставщик			= Данные.Поставщик;
				Движение.ОрганизацияАгент 	= Данные.ОрганизацияАгент;
				Движение.СК					= Данные.СК;
				Движение.ВидБСО				= Данные.ВидБСО;
				Движение.Агент				= АгентКол;	
				// ресурсы
				Движение.Количество			= 1;
				// реквизиты
				Движение.КодОперации		= Перечисления.уб_КодыОперацийБСО.ОформлениеБСО;
				Движение.Заявка             = СтрокаТЧ.Заявка;
			КонецЕсли; 
		КонецЦикла;//тДвижений		
		//Продолжить;
		//+++Взаиморасчеты по Группе полисов
		СтруктураПараметров = Новый Структура("Дата,Агент,Страхователь,Поставщик,ОрганизацияАгент",Дата,Справочники.ФизическиеЛица.ПустойАгент,Справочники.ФизическиеЛица.ПустаяСсылка(),Строкатч.Поставщик,СтрокаТЧ.ОрганизацияАгент,Дата);
		уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета(
			СтрокаТЧ.УИДСтроки,
			ВидОперации,
			Ссылка,
			Ссылка,
			СтрокаТЧ.Сумма,
			СтруктураПараметров,
			,
			ЗапросВзаиморасчеты
		);
		//уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("КВСумма",
		//Справочники.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера,Ссылка,Ссылка,КВСумма,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	КонецЦикла;
	#Если Клиент Тогда
		Оповестить("ПриемкаОплатЗаписьНомераПолиса", Полисы.ВыгрузитьКолонку("НомерПолиса"));
	#КонецЕсли
	//чкн
	Отказ = ЛОЖЬ;
	ТЗОшибок = Новый ТаблицаЗначений;
	ТЗОшибок.Колонки.Добавить("Ошибка");
	ТЗОшибок.Колонки.Добавить("Строка");
	ТЗОшибок.Колонки.Добавить("Элемент");
	ПроверкаУникальностиЗаписейРегистра(Движения.уб_ДвиженияБСО, Отказ, ТЗОшибок);
	Если ТЗОшибок.Количество() <> 0 Тогда
		//Форма = ЭтотОбъект.ПолучитьФорму();
		Форма = Ссылка.ПолучитьФорму();
		Если Форма.Открыта() Тогда
			ОткрытьСообщениеОбОшибках(ТзОшибок, Форма);
		Иначе
			Для Каждого Строка Из ТЗОшибок Цикл
				Сообщить(Строка.Ошибка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если НЕ Отказ тогда
		Движения.уб_ДвиженияБСО.Записать();
		Движения.уб_ОстаткиБСО.Записать();
	КонецЕсли;
	//чкн
	Возврат;
	//+++Взаиморасчеты
	СтруктураПараметров = Новый Структура("Дата,Агент,Страхователь,Поставщик,ОрганизацияАгент",Дата,ПринятоОт);
	уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета("СуммовыеОтклоненияВПриемке",
	,
	Ссылка,
	Строка(Ссылка.УникальныйИдентификатор()),
	Сумма-СуммаПоСтрокам,
	СтруктураПараметров,
	Строка(Ссылка.УникальныйИдентификатор()),
	ЗапросВзаиморасчеты);
	//++заиморасчеты
	//ВсегоСтрок = ?(ЗаписьРег  = Неопределено,0,1);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	*
	//|ИЗ
	//|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	//|			&Период,
	//|			ВидБСО = &ВидБСО
	//|				И НомерБСО = &НомерБСО
	////|				И СК = &СК
	//|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период УБЫВ";
	//Запрос.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
	//Запрос.УстановитьПараметр("НомерБСО", СтрокаТЧ.НомерБСО);
	////Запрос.УстановитьПараметр("СК", СтрокаТЧ.СК);
	//Запрос.УстановитьПараметр("Период", ГраницаДокумента);
	//
	////Если НЕ ИнфоЗапись Тогда
	////	//СтруктураОтбора.Вставить("Подтверждено",Истина);
	////	////СтруктураОтбора.Вставить("ДокПроведен",Истина);
	////	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Подтверждено");
	////КонецЕсли;
	//
	//тзРег = Запрос.Выполнить().Выгрузить();
	
	//ВидДвижения = Неопределено;
	//ВсегоСтрок = тзРег.Количество();
	//ТипУчета = Неопределено;
	//Если  ВсегоСтрок > 0 Тогда
	//	//Если ВсегоСтрок > 1 Тогда
	//	//	//на данный момент в системе получения последних по периоду данных, получение данных из страхового полиса не является верным
	//	//	//(возможно несколько различных полисов с одинаковыми номерами)
	//	//	//Для каждого ЗаписьВсп из тзРег Цикл
	//	//	//	//При передаче между организациями значение из Страхового полиса принимаем как "наиболее верное"
	//	//	//	Если ЗаписьВсп.Регистратор = ЗаписьВсп.СтраховойПолис Тогда
	//	//	//		ЗаписьРег = ЗаписьВсп;
	//	//	//		Прервать;
	//	//	//	КонецЕсли;	
	//	//	//КонецЦикла;	
	//	//	тзРег.Сортировать("Период УБЫВ"); //если предыдущий не страховой полис, то "самое последнее наиболее верное"
	//	//КонецЕсли;	
	//	//ЗаписьРег = тзРег[0];
	//	//ВидДвижения = "номер";	
	//Иначе
	//	Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО,ТипУчета) Тогда
	//		ВидДвижения = "количество";	
	//	ИначеЕсли уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО,ТипУчета) Тогда
	//		ВидДвижения = "номер";	
	//	Иначе
	//		ВидДвижения = Неопределено;	
	//	КонецЕсли;
	//КонецЕсли;
	//Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО,ТипУчета) Тогда
	//	ДвижениеД = Движения.уб_ДвиженияБСО.Добавить();
	//	ДвижениеД.Период 	= Дата;
	//	ДвижениеД.СК 		= СтрокаТЧ.СК;
	//	ДвижениеД.ВидБСО 	= СтрокаТЧ.ВидБСО;
	//	ДвижениеД.НомерБСО 	= СтрокаТЧ.НомерБСО;
	//	Если ВсегоСтрок > 0 Тогда
	//		ДвижениеД.Поставщик 		= ЗаписьРег.Поставщик;
	//		ДвижениеД.ОрганизацияАгент 	= ЗаписьРег.ОрганизацияАгент;
	//		ДвижениеД.Подтверждено 		= Истина;
	//		//ДвижениеД.Блокировка 		= ЗаписьРег.Блокировка;
	//		ДвижениеД.ГодПолиса 		= ЗаписьРег.ГодПолиса;
	//		ДвижениеД.СтраховойПолис 	= ЗаписьРег.СтраховойПолис;
	//		ДвижениеД.ДатаВозврата 		= ЗаписьРег.ДатаВозврата;
	//	Иначе
	//		ДвижениеД.Поставщик 		= СтрокаТЧ.Поставщик;
	//		ДвижениеД.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгент;
	//		ДвижениеД.Подтверждено 		= Ложь;
	//		//ДвижениеД.Блокировка 		= Ложь;
	//		ДвижениеД.ГодПолиса 		= "";
	//		ДвижениеД.СтраховойПолис 	= Документы.уб_СтраховойПолис.ПустаяСсылка();
	//		ДвижениеД.ДатаВозврата 		= Неопределено;
	//	КонецЕсли; 
	//	//ДвижениеД.ДокПроведен 		= Проведен;
	//	ДвижениеД.Активность 		= Проведен;
	//	ДвижениеД.АгентОтправитель 	= ПринятоОТ;
	//	ДвижениеД.Агент 			= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	//	ДвижениеД.ПоложениеБСО 		= Перечисления.уб_ПоложенияБСО.ВозвращенСТочки;			
	//	ДвижениеД.СостояниеБСО 		= Перечисления.уб_СостоянияБСО.Оформлен;
	//	ДвижениеД.НомерПолиса 		= СтрокаТЧ.НомерПолиса;
	//	ДвижениеД.НаОснованииБумажногоДокумента = Ложь;
	//	ДвижениеД.Комментарий 		= Комментарий;
	//	ДвижениеД.КодОперации 		= Перечисления.уб_КодыОперацийБСО.ПриемОплаты;
	//	ДвижениеД.Заявка = СтрокаТЧ.Заявка;
	//Иначе
	//Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда 	
	//	Если ВидДвижения = "количество" Тогда
	//		Движение					= Движения.уб_ОстаткиБСО.Добавить();
	//		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
	//		Движение.Период				= Дата;
	//		// измерения
	//		Движение.Поставщик			= СтрокаТЧ.Поставщик;
	//		Движение.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгент;
	//		Движение.СК					= СтрокаТЧ.СК;
	//		Движение.ВидБСО				= СтрокаТЧ.ВидБСО;
	//		Движение.Агент				= ПринятоОТ;	
	//		// ресурсы
	//		Движение.Количество			= 1;
	//		// реквизиты
	//		Движение.КодОперации		= Перечисления.уб_КодыОперацийБСО.ОформлениеБСО;
	//		Движение.Заявка = СтрокаТЧ.Заявка;
	//	КонецЕсли; 
	//	ДвижениеД = Движения.уб_ДвиженияБСО.Добавить();
	//	ДвижениеД.Период 			= Дата;
	//	ДвижениеД.СК 				= СтрокаТЧ.СК;
	//	ДвижениеД.ВидБСО 			= СтрокаТЧ.ВидБСО;
	//	ДвижениеД.НомерБСО 			= СтрокаТЧ.НомерБСО;
	//	ДвижениеД.Поставщик 		= СтрокаТЧ.Поставщик;
	//	ДвижениеД.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгент;
	//	ДвижениеД.Подтверждено 		= Истина;
	//	//ДвижениеД.ДокПроведен 		= Проведен;
	//	ДвижениеД.Активность 		= Проведен;
	//	ДвижениеД.АгентОтправитель 	= ПринятоОТ;
	//	ДвижениеД.Агент 			= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	//	ДвижениеД.ПоложениеБСО 		= Перечисления.уб_ПоложенияБСО.ВозвращенСТочки;
	//	ДвижениеД.СостояниеБСО 		= Перечисления.уб_СостоянияБСО.Оформлен;
	//	//ДвижениеД.Блокировка 		= Ложь;
	//	ДвижениеД.НомерПолиса 		= СтрокаТЧ.НомерПолиса;
	//	ДвижениеД.ГодПолиса 		= "";
	//	ДвижениеД.СтраховойПолис 	= Документы.уб_СтраховойПолис.ПустаяСсылка();
	//	ДвижениеД.НаОснованииБумажногоДокумента = Ложь;
	//	ДвижениеД.ДатаВозврата 		= Неопределено;
	//	ДвижениеД.Комментарий 		= Комментарий;
	//	ДвижениеД.КодОперации 		= Перечисления.уб_КодыОперацийБСО.ПриемОплаты;
	//	ДвижениеД.Заявка 			= СтрокаТЧ.Заявка;
	//КонецЕсли; 
	//Если Не ПустаяСтрока(СтрокаТЧ.НомерКвитанции) Тогда
	//	//ВидБСОТипаКвА7 = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СтрокаТЧ.СК);
	//	СтруктураВидБСО = уб_КЭШируемые.ВидБСОТипаКвА7дляСК(СтрокаТЧ.СК);
	//	ВидБСОТипаКвА7 = СтруктураВидБСО.ВидБСО;
	//	
	//	//СтруктураОтбора = Новый Структура("СК, ВидБСО, НомерБСО", СтрокаТЧ.СК, ВидБСОТипаКвА7, СтрокаТЧ.НомерКвитанции);
	//	//Если НЕ ИнфоЗапись Тогда
	//	//	СтруктураОтбора.Вставить("Подтверждено",	Истина);
	//	//	//СтруктураОтбора.Вставить("ДокПроведен",		Истина);
	//	//КонецЕсли;
	//	//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(ГраницаДокумента, СтруктураОтбора);
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	*
	//	|ИЗ
	//	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	//	|			&Период,
	//	|			ВидБСО = &ВидБСО
	//	|				И НомерБСО = &НомерБСО
	//	//|				И СК = &СК
	//	|				И 1 = 1) КАК уб_ДвиженияБСОСрезПоследних
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период УБЫВ";
	//	Запрос.УстановитьПараметр("ВидБСО", ВидБСОТипаКвА7);
	//	Запрос.УстановитьПараметр("НомерБСО", СтрокаТЧ.НомерКвитанции);
	//	//Запрос.УстановитьПараметр("СК", СтрокаТЧ.СК);
	//	Запрос.УстановитьПараметр("Период", ГраницаДокумента);
	//	
	//	//Если НЕ ИнфоЗапись Тогда
	//	//	//СтруктураОтбора.Вставить("Подтверждено",Истина);
	//	//	////СтруктураОтбора.Вставить("ДокПроведен",Истина);
	//	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Подтверждено");
	//	//КонецЕсли;
	//	
	//	тзРег = Запрос.Выполнить().Выгрузить();
	//	
	//	
	//	ВсегоСтрок = тзРег.Количество();
	//	Если ВсегоСтрок > 0 Тогда
	//		ЗаписьРег = тзРег[0];
	//		//Если ВсегоСтрок > 1 Тогда
	//		//	//Для каждого ЗаписьВсп из тзРег Цикл
	//		//	//	//При передаче между организациями значение из Страхового полиса принимаем как "наиболее верное"
	//		//	//	Если ЗаписьВсп.Регистратор = ЗаписьВсп.СтраховойПолис Тогда
	//		//	//		ЗаписьРег = ЗаписьВсп;
	//		//	//		Прервать;
	//		//	//	КонецЕсли;	
	//		//	//КонецЦикла;	
	//		//	тзРег.СОртировать("Период УБЫВ"); //если предыдущий не страховой полис, то "самое последнее наиболее верное"
	//		//	ЗаписьРег = тзРег[0];
	//		//КонецЕсли;	
	//	КонецЕсли;		
	//	ДвижениеД = Движения.уб_ДвиженияБСО.Добавить();
	//	ДвижениеД.Период 		= Дата;
	//	ДвижениеД.СК 			= СтрокаТЧ.СК;
	//	ДвижениеД.ВидБСО 		= ВидБСОТипаКвА7;			
	//	//ДвижениеД.ДокПроведен 	= Проведен;
	//	ДвижениеД.Активность 	= Проведен;
	//	Если ВсегоСтрок > 0 Тогда
	//		ДвижениеД.НомерБСО 			= ЗаписьРег.НомерБСО;
	//		ДвижениеД.Поставщик 		= ЗаписьРег.Поставщик;
	//		ДвижениеД.ОрганизацияАгент 	= ЗаписьРег.ОрганизацияАгент;
	//		ДвижениеД.Подтверждено 		= Истина;				
	//		//ДвижениеД.Блокировка 		= ЗаписьРег.Блокировка;
	//		Если ПустаяСтрока(ЗаписьРег.НомерПолиса) Тогда
	//			ДвижениеД.НомерПолиса 	= СтрокаТЧ.НомерПолиса;
	//		Иначе	
	//			ДвижениеД.НомерПолиса 	= ЗаписьРег.НомерПолиса;
	//		КонецЕсли;
	//		ДвижениеД.ГодПолиса 		= ЗаписьРег.ГодПолиса;
	//		ДвижениеД.СтраховойПолис 	= ЗаписьРег.СтраховойПолис;
	//		ДвижениеД.ДатаВозврата 		= ЗаписьРег.ДатаВозврата;
	//	Иначе
	//		ДвижениеД.НомерБСО 			= СтрокаТЧ.НомерКвитанции;
	//		ДвижениеД.Поставщик 		= СтрокаТЧ.ПоставщикКвитанции;
	//		ДвижениеД.ОрганизацияАгент 	= СтрокаТЧ.ОрганизацияАгентКвитанции;
	//		ДвижениеД.Подтверждено 		= Ложь;				
	//		//ДвижениеД.Блокировка 		= Ложь;
	//		ДвижениеД.НомерПолиса 		= СтрокаТЧ.НомерПолиса;
	//		ДвижениеД.ГодПолиса 		= "";
	//		ДвижениеД.СтраховойПолис 	= Документы.уб_СтраховойПолис.ПустаяСсылка();
	//		ДвижениеД.ДатаВозврата 		= Неопределено;
	//	КонецЕсли; 			
	//	ДвижениеД.АгентОтправитель 	= ПринятоОТ;
	//	ДвижениеД.Агент 			= ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
	//	ДвижениеД.ПоложениеБСО 		= Перечисления.уб_ПоложенияБСО.ВозвращенСТочки;
	//	ДвижениеД.СостояниеБСО 		= Перечисления.уб_СостоянияБСО.Оформлен;
	//	ДвижениеД.НаОснованииБумажногоДокумента = Ложь;
	//	ДвижениеД.Комментарий 		= Комментарий;
	//	ДвижениеД.КодОперации 		= Перечисления.уб_КодыОперацийБСО.ПриемОплаты;
	//	ДвижениеД.Заявка            = СтрокаТЧ.Заявка;
	//КонецЕсли;
	//приемка в основном вводится не используя систему статусов заявок
	//поэтому автоматически изменим статус текущей заявки на актуальный,
	//если прошлый статус - "СтраховкаСостоялась" и есть номер БСО строки в таблице движений по заявке
	//TODO объединить запросы
	//Если ЗначениеЗаполнено(СтрокаТЧ.Заявка) Тогда
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	уб_ИсторияСтатусовЗаявок.Статус
	//	|ИЗ
	//	|	РегистрСведений.уб_ИсторияСтатусовЗаявок КАК уб_ИсторияСтатусовЗаявок
	//	|ГДЕ
	//	|	уб_ИсторияСтатусовЗаявок.Заявка = &Заявка
	//	|	И уб_ИсторияСтатусовЗаявок.Период <= &Период
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	уб_ИсторияСтатусовЗаявок.Период УБЫВ");
	//	Запрос.УстановитьПараметр("Период", Дата);
	//	Запрос.УстановитьПараметр("Заявка", СтрокаТЧ.Заявка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Если Выборка.Статус = Перечисления.уб_СтатусыЗаявок.СтраховкаСостоялась Тогда
	//			ТаблицаБСО = уб_УСЗ.ПолучитьТаблицуБСОПоЗаявке(СтрокаТЧ.Заявка);
	//			Если ТаблицаБСО.Найти(СтрокаТЧ.НомерБСО, "НомерБСО") <> Неопределено Тогда
	//				Если уб_УСЗ.УстановитьСтатусЗаявки(СтрокаТЧ.Заявка, Перечисления.уб_СтатусыЗаявок.КомплектИДеньгиУКассира, "автоматически при проведении приемки",, Дата) Тогда
	//					НужноОбновитьСтатусы = Истина
	//				КонецЕсли;
	//			КонецЕсли;
	//		Иначе
	//			//другой статус
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//КонецЦикла;	
	//Если Сумма<>СуммаПоСтрокам Тогда
	//	Запись = РегистрыСведений.уб_ВзаиморасчетыПоДоговору.СоздатьМенеджерЗаписи();
	//	//Измерения
	//	Запись.ИДГруппы    = Строка(Ссылка.УникальныйИдентификатор());
	//	Запись.Операция    = Справочники.уб_ВидыРасчетныхОпераций.СуммовыеОтклоненияВПриемке;
	//	Запись.ИДОперации  = Запись.ИДГруппы;
	//	//Ресурсы
	//	Запись.Сумма     = Сумма-СуммаПоСтрокам;
	//	Запись.Документ  = Ссылка;
	//	//Запись.Страхователь = СтрокаТЧ.Страхователь //TODO 
	//	Запись.Поставщик = Справочники.Контрагенты.ПустаяСсылка();
	//	//Запись.Агент     = СтрокаТЧ.агент
	//	Запись.ДатаОперации = Дата; //TODO
	//	Запись.ОрганизацияАгент = Справочники.Организации.ПустаяСсылка();
	//	Запись.Записать();
	//Конецесли;
	//Если НужноОбновитьСтатусы Тогда
	//	Оповестить("уб_СтатусыЗаявок", "ОбновитьСписки")
	//КонецЕсли;
	
КонецПроцедуры	

Функция ПроверитьЗаполнениеСтрокиТЧ(СтрокаТЧ, Префикс = "", Суффикс = "", Заголовок = Неопределено, Молча = Ложь) Экспорт 
	
	Если СтрокаТЧ.СК.Пустая() Тогда
		Если Не Молча Тогда
			#Если Клиент Тогда
				Предупреждение(Префикс + "Не заполнено поле ""СК""!" + Суффикс, 5, Заголовок);
			#КонецЕсли
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли; 
	Если СтрокаТЧ.ВидБСО.Пустая() и СтрокаТЧ.СК<>Справочники.Контрагенты.ПустаяСК Тогда
		Если Не Молча Тогда
			#Если Клиент Тогда
				Предупреждение(Префикс + "Не заполнено поле ""ВидБСО""!" + Суффикс, 5, Заголовок);
			#КонецЕсли
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли; 
	Если ПустаяСтрока(СтрокаТЧ.НомерБСО) Тогда
		Если Не Молча Тогда
			//#Если Клиент Тогда
				Сообщить(Префикс + "Необходимо указать или номер БСО" + Символы.ВК + Символы.ПС 
				+ " (любая оплата или квитанция относится к какому-либо полису!)!" + Суффикс,);
			//#КонецЕсли
		КонецЕсли;
		Возврат Истина; //Будем пропускать при проведении
	КонецЕсли;
	Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) И (Не ПустаяСтрока(СтрокаТЧ.НомерБСО) Или Не ПустаяСтрока(СтрокаТЧ.НомерКвитанции))  Тогда
		Если СтрокаТЧ.Поставщик.Пустая() Тогда
			Если Не Молча Тогда
				#Если Клиент Тогда
					Предупреждение(Префикс + "Не заполнено поле ""Поставщик"" для БСО количественного учета" + Суффикс, 5,Заголовок);
				#КонецЕсли
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
		Если СтрокаТЧ.ОрганизацияАгент.Пустая() Тогда
			Если Не Молча Тогда
				#Если Клиент Тогда
					Предупреждение(Префикс + "Не заполнено поле ""Организация-Агент"" для БСО количественного учета" + Суффикс, 5,Заголовок);
				#КонецЕсли
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)
	
	Для Каждого СтрокаТЧ Из Полисы Цикл
		Префикс = "В строке номер """ + СокрЛП(СтрокаТЧ.НомерСтроки) + """: ";
		Отказ = Не ПроверитьЗаполнениеСтрокиТЧ(СтрокаТЧ, Префикс, ,Заголовок);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	МассивОтчетов = Новый Массив;
	Структура = Новый Структура;
	Структура.Вставить("ПредСумма",						0);
	Структура.Вставить("ПредПроведен",					Ложь);
	Структура.Вставить("ПредИтогСуммаПлатежи",			0);
	Структура.Вставить("ПредОтчетКассира",				Документы.уб_ОтчетКассира.ПустаяСсылка());
	Структура.Вставить("ПредОтчетКассираПодтверждено",	Ложь);
	Структура.Вставить("Сумма", 						Сумма);
	
	Структура.Вставить("ИтогСуммаПлатежи",  			ИтогСуммаПлатежи);
	Структура.Вставить("ОтчетКассира",					ОтчетКассира);
	Структура.Вставить("ОтчетКассираПодтверждено",		Ложь);
	Структура.Вставить("ОтчетКассираПроведен",		Ложь);
	Структура.Вставить("СегодняВыходной",		Ложь);



	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	П.Сумма КАК ПредСумма,
	|	П.Проведен КАК ПредПроведен,
	|	П.ИтогСуммаПлатежи КАК ПредИтогСуммаПлатежи,
	|	П.ОтчетКассира КАК ПредОтчетКассира,
	|	П.ОтчетКассира.Подтверждено КАК ПредОтчетКассираПодтверждено,
	|	ВЫБОР
	|		КОГДА РегламентированныйПроизводственныйКалендарь.Пятидневка = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СегодняВыходной,
	|	IsNull(ОК.Ссылка.Проведен,ЛОЖЬ) как ОтчетКассираПроведен,
	|	IsNull(ОК.Ссылка.Подтверждено,ЛОЖЬ) как ОтчетКассираПодтверждено
	|ИЗ
	|	Документ.уб_ПриемкаОплат КАК П
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ПО (&ТекущаяДата = РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уб_Отчеткассира.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.уб_ОтчетКассира КАК уб_Отчеткассира
	|		ГДЕ
	|			уб_Отчеткассира.Ссылка = &ОтчетКассира) КАК ОК
	|		ПО (ИСТИНА)
	|ГДЕ
	|	П.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ОтчетКассира", ОтчетКассира);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Если выборка.СегодняВыходной = Истина и ЗначениеЗаполнено(ОтчетКассира) Тогда
			Структура.ОтчетКассираПодтверждено = 
			Структура.ПредОтчетКассираПодтверждено = Истина;
		КонецЕсли;	
	КонецЕсли;

	Запрещено = Не Отладка И (ЗначениеЗаполнено(ОтчетКассира) И Структура.ОтчетКассираПодтверждено);
	ТекстМодификации = "";
	Если Запрещено И (Модифицированность_(ТекстМодификации) Или Не уб_СС.СоответствиеРежимаЗаписиСостояниюСсылки(Ссылка, РежимЗаписи)) Тогда
		#Если Клиент Тогда
			Предупреждение(ТекстМодификации+ "Для изменения требуется снять подтверждение отчета кассира."+ТекстМодификации, 10, "Внимание!!!");
		#КонецЕсли
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	СсылкаПометкаУдаления = Ссылка.ПометкаУдаления;
	бУстановкаПометкиУдаления = Не СсылкаПометкаУдаления И ПометкаУдаления;
	бСнятиеПометкиУдаления = СсылкаПометкаУдаления И Не ПометкаУдаления;
	//ТОДО проверить	
	Если бУстановкаПометкиУдаления Тогда
		УИДыСтрокТЧ = Полисы.ВыгрузитьКолонку("УИДСтроки");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("УИДыСтрокТЧ", УИДыСтрокТЧ);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	К.ОплатаПолиса
		|ИЗ
		|	РегистрСведений.уб_КвитовкаОплат КАК К
		|ГДЕ
		|	К.УИДСтрокиТЧ В(&УИДыСтрокТЧ)";
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда
			#Если Клиент Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("В документе есть привязки к оплатам." + Символы.ВК + Символы.ПС 
				+ "При пометке на удаление все они будут сброшены." 
				+ Символы.ВК + Символы.ПС + Символы.ВК + Символы.ПС + "Продолжить?" + Символы.ВК + Символы.ПС, Режим, 0, КодВозвратаДиалога.Нет, "Внимание!");
				Если Ответ = КодВозвратаДиалога.Нет Или Не УдалитьВсеКвитовкиПриемки() Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли;				
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;	
	ПересчитатьСуммыИУстановитьФлажки();
	УстановитьФлагКвитовки();
	Для Каждого СтрокаТЧ Из Платежи Цикл
		УстановитьЗначение(СтрокаТЧ.ОбоснованиеРазницы, СокрЛП(СтрокаТЧ.ОбоснованиеРазницы));
	КонецЦикла;
	// перезаписываем отчет кассира
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		_Проведен = Истина;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		_Проведен = Ложь;
	Иначе
		_Проведен = Неопределено
	КонецЕсли;
	Структура.Вставить("Проведен", ?(_Проведен = Неопределено, Проведен, _Проведен));

	Если Не Структура.ПредОтчетКассира.Пустая() 
		И Не Структура.ПредОтчетКассираПодтверждено
		Тогда
		МассивОтчетов.Добавить(Структура.ПредОтчетКассира)
	КонецЕсли;
	Если Не Структура.ОтчетКассира.Пустая() 
		И МассивОтчетов.Найти(Структура.ОтчетКассира) = Неопределено
		И Не Структура.ОтчетКассира.Подтверждено
		Тогда
		МассивОтчетов.Добавить(Структура.ОтчетКассира);
	КонецЕсли;
	Если МассивОтчетов.Количество() > 0 
		И (Структура.ПредСумма <> Структура.Сумма
		Или Структура.ПредПроведен <> Структура.Проведен
		Или Структура.ПредИтогСуммаПлатежи <> Структура.ИтогСуммаПлатежи)
		Тогда
		МассивОтчетовКассираДляЗаписи = МассивОтчетов
	Иначе
		МассивОтчетовКассираДляЗаписи = Неопределено;
	КонецЕсли;	
	
	пОрг = Справочники.Организации.ПустаяСсылка();
	Для каждого ДанныеПриемки из полисы Цикл
		//Если Строкап.ОрганизацияАгент = пОрг и Строкап.ВидБСО.Наименование ="Техосмотр" Тогда
		//	Строкап.ОрганизацияАгент = ПараметрыСеанса.уб_ОсновнаяОрганизация;//Справочники.Организации.НайтиПоНаименованию();
		//КонецЕсли;	
		Если ЗначениеЗаполнено(ДанныеПриемки.Заявка) и ЗначениеЗаполнено(ДанныеПриемки.УИДСтрокиЗаявки) Тогда
			СтрокаЗагрузки = Обработки.ЗагрузкаПолисовИзB2B.НайтиЗаявку(ДанныеПриемки.НомерБСО,ДанныеПриемки.СК,"",ДанныеПриемки.УИДСтрокиЗаявки);
			Если СтрокаЗагрузки.Свойство("СтрокаЗагрузки") и НЕ СтрокаЗагрузки.Заявка = ДанныеПриемки.Заявка Тогда
				//Данной строки нет в заявке, обрываем связь
				ДанныеПриемки.УИДСтрокиЗаявки = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Функция ПлатежиСтрокаТЧНераспределено(СоздаватьСтроку = Истина) Экспорт

	Итог = 0;
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Если Не СтрокаТЧ.ОтсутствуетВОплатах Тогда
			Итог = Итог + СтрокаТЧ.Сумма;
		КонецЕсли;
	КонецЦикла;
	Для Индекс = -(Платежи.Количество() - 1) По 0 Цикл
		СтрокаТЧ = Платежи[-Индекс];
		Если СтрокаТЧ.ОбоснованиеРазницы = "<нераспределено>" И Не СтрокаТЧ.ОтсутствуетВОплатах Тогда
			Результат = СтрокаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	РазницаВТЧ = Полисы.Итог("Сумма") - Итог;
	Если РазницаВТЧ <> 0 Тогда
		Если Результат = Неопределено Тогда
			Если СоздаватьСтроку Тогда
				_ФормаОплаты = ФормаОплаты(Истина);
				Результат = Платежи.Добавить();
				Результат.Сумма					= РазницаВТЧ;
				Результат.ОбоснованиеРазницы 	= "<нераспределено>";
				Результат.ФормаОплаты = _ФормаОплаты;
				ЗаполнитьСтрокуТЧПлатежиПоУмолчанию(Результат);
			КонецЕсли;
		Иначе
			Результат.Сумма = Результат.Сумма + РазницаВТЧ;
		КонецЕсли;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбоснованиеРазницы", 	"<нераспределено>");
	ПараметрыОтбора.Вставить("Сумма",				0);
	МассивСтрок = Платежи.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		Если Результат <> Неопределено И СтрокаТЧ.НомерСтроки = Результат.НомерСтроки Тогда
			Результат = Неопределено;
		КонецЕсли;
		Платежи.Удалить(СтрокаТЧ);
	КонецЦикла;
	Если Результат <> Неопределено Тогда
		ЗаполнитьКомментарийНераспределеннойСтроки(Результат);
	КонецЕсли;
	Возврат Результат;

КонецФункции // СтруктураНераспределеннойСтроки()

Процедура ЗаполнитьКомментарийНераспределеннойСтроки(СтрокаТЧ, ПроверятьНаНераспределенную = Ложь) Экспорт

	Отказ = Ложь;
	Если ПроверятьНаНераспределенную Тогда
		Если СтрокаТЧ.ОбоснованиеРазницы <> "<нераспределено>" Тогда
			Отказ = Истина
		КонецЕсли;
	КонецЕсли;
	Если Не Отказ Тогда
		Если СтрокаТЧ.Сумма >= 0 Тогда
			Текст = "Требуется увеличить сумму по платежам, или уменьшить сумму по полисам";
		Иначе
			Текст = "Требуется увеличить сумму по полисам, или уменьшить сумму по платежам";
		КонецЕсли;
		УстановитьЗначение(СтрокаТЧ.Комментарий, Текст);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСтрокуТЧПлатежиПоУмолчанию(СтрокаТЧ) Экспорт

	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = Платежи.Добавить();
	КонецЕсли;
	Если СтрокаТЧ.ФормаОплаты.Пустая() Тогда
		СтрокаТЧ.ФормаОплаты = ФормаОплаты();
	КонецЕсли;
	Если ПустаяСтрока(СтрокаТЧ.УИДСтроки) Тогда
		СтрокаТЧ.УИДСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если СтрокаТЧ.Валюта.Пустая() Тогда
		СтрокаТЧ.Валюта = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
	КонецЕсли;
	Если СтрокаТЧ.Курс = 0 Тогда
		СтрокаТЧ.Курс = 1
	КонецЕсли;
	Если СтрокаТЧ.Кратность = 0 Тогда
		СтрокаТЧ.Кратность = 1
	КонецЕсли;
	Если СтрокаТЧ.СуммаВВалюте <> СтрокаТЧ.Сумма И СтрокаТЧ.Курс = 1 И СтрокаТЧ.Кратность = 1 Тогда
		СтрокаТЧ.СуммаВВалюте = СтрокаТЧ.Сумма
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Перем ЗаявкаНомер;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	Если _Отвязка_Оплаты_ Тогда
		_Отвязка_Оплаты_ = Ложь;
	Иначе
		СтруктураОбязательныхПолей = Новый Структура("ПринятоОТ");
		ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
		ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	КонецЕсли;
	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		//ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	//Движение статусов заявок
	Если Не Отказ Тогда		
		Если ДополнительныеСвойства.Свойство("НеДвигатьСтатусы") Тогда
		Иначе
			Документы.уб_ПриемкаОплат.ДвижениеСтатусовЗаявок(Ссылка,Строка(ПринятоОТ)="_дежурный Выходные Дни");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Отказ = НЕ УдалитьВсеКвитовкиПриемки();
	
КонецПроцедуры

Функция УдалитьВременныеДанныеПолисаКПриемкеОплат(УИДСтроки) Экспорт 
	
	ВыборкаРС = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.Выбрать(Новый Структура("УИДСтрокиТЧ", УИДСтроки)); 
	ЕстьДанные = Ложь;
	Пока ВыборкаРС.Следующий() Цикл
		МЗ = ВыборкаРС.ПолучитьМенеджерЗаписи();	
		Попытка
			МЗ.Удалить();
			#Если Клиент Тогда
				Если ПараметрыСеанса.уб_РежимОтладки > 8 Тогда
					Сообщить("Удалены временные данные к приемке оплат для УИД строки '" + УИДСтроки + "'");
				КонецЕсли;
			#КонецЕсли
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось удалить временные данные к приемке оплат для УИД строки '" + УИДСтроки + "'",, Истина);
			Возврат Ложь;
		КонецПопытки;	
		ЕстьДанные =Истина;
	КонецЦикла;
	Если ЕстьДанные Тогда
		ДозаполнитьРегистрУТехосмотра();
	КонецЕсли;	
	Возврат Истина;
	
КонецФункции

Функция ДозаполнитьРегистрУТехосмотра()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.УИДСтрокиТЧ,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаЗаписи,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ПриемОплаты КАК ПриемОплаты,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерЗаявки,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СтраховойПродукт,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Страхователь,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОкончания,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаНачала,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОформления,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОплаты,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзносаВВалюте,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Агент,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Курьер,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СкидкаВыплаченаяКлиенту,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты,
	               |	МАКСИМУМ(уб_ПриемкаОплатПлатежи.ФормаОплаты) КАК ФормаОплаты1,
	               |	МИНИМУМ(уб_ПриемкаОплатПлатежи.ФормаОплаты) КАК ФормаОплаты2,
	               |	уб_ПриемкаОплатПолисы.УИДСтроки КАК УИДСтроки
	               |ИЗ
	               |	РегистрСведений.уб_ВременныеДанныеПолисаКПриемкеОплат КАК уб_ВременныеДанныеПолисаКПриемкеОплат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
	               |		ПО уб_ВременныеДанныеПолисаКПриемкеОплат.ПриемОплаты = уб_ПриемкаОплатПлатежи.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	               |		ПО уб_ВременныеДанныеПолисаКПриемкеОплат.ПриемОплаты = уб_ПриемкаОплатПолисы.Ссылка
	               |			И (уб_ПриемкаОплатПолисы.ВидБСО.Наименование = ""Техосмотр"")
	               |			И уб_ВременныеДанныеПолисаКПриемкеОплат.УИДСтрокиТЧ <> уб_ПриемкаОплатПолисы.УИДСтроки
	               |ГДЕ
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты <> ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)
	               |	И уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаЗаписи >= ДАТАВРЕМЯ(2017, 7, 1)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.УИДСтрокиТЧ,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаЗаписи,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ПриемОплаты,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерЗаявки,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СтраховойПродукт,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Страхователь,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОкончания,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаНачала,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОформления,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ДатаОплаты,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НачисленнаяСуммаВзносаВВалюте,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Агент,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.Курьер,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.НомерВзноса,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.СкидкаВыплаченаяКлиенту,
	               |	уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты,
	               |	уб_ПриемкаОплатПолисы.УИДСтроки
	               |ИТОГИ
	               |	МАКСИМУМ(УИДСтроки)
	               |ПО
	               |	ПриемОплаты";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл			   
		Выборка2 = Выборка.Выбрать();
		Пока Выборка2.Следующий() Цикл
			Мз = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.СоздатьМенеджерЗаписи();
			Мз.УИДСтрокиТЧ = Выборка.УИДСтроки;
			Мз.Прочитать();
			Если Мз.Выбран() Тогда
				продолжить
			Иначе
				ЗаполнитьЗначенияСвойств(мз,Выборка2);
				Мз.УИДСтрокиТЧ = Выборка.УИДСтроки;
				Мз.Записать();
			Конецесли;	
		КонецЦикла;	
	КонецЦикла;	
КонецФункции	

Процедура ПересчитатьСуммыИУстановитьФлажки(ЕстьИзменения = Ложь) Экспорт
	
	Если СистемаТЧПлатежи Тогда
		_Разница = СуммаНераспределенныхСтрок();
		ЕстьИзменения = УстЗнач(Разница, _Разница, Истина) Или ЕстьИзменения;
		СуммаПоСтрокам_	= Полисы.Итог("Сумма");
		ЕстьИзменения = УстЗнач(СуммаПоСтрокам, СуммаПоСтрокам_, Истина) Или ЕстьИзменения;
		ЕстьИзменения = УстЗнач(ИтогСуммаПлатежи, Платежи.Итог("Сумма"), Истина) Или ЕстьИзменения;
		СтрокаТЧ = Платежи.Найти("<нераспределено>", "ОбоснованиеРазницы");
		СуммыНеРавны_ = СтрокаТЧ <> Неопределено;
		ЕстьИзменения = УстЗнач(СуммыНеРавны, СуммыНеРавны_, Истина) Или ЕстьИзменения;
		НетПривязкиКОплате_ = НЕ ВсеОплатыПривязаны();
		ЕстьИзменения = УстЗнач(НетПривязкиКОплате, НетПривязкиКОплате_, Истина) Или ЕстьИзменения;
		ЕстьИзменения = УстЗнач(ВознаграждениеКурьераКлиентом, РассчитатьВознаграждениеКурьераПоПриемке(), Истина) Или ЕстьИзменения;
	Иначе
		СуммаПоСтрокам_ = Полисы.Итог("Сумма");
		СуммыНеРавны_ = Сумма <> (СуммаПоСтрокам_ + Разница);
		НетПривязкиКОплате_ = НЕ ВсеОплатыПривязаны();
		Если Курс <> 1 Тогда
			Если Валюта.Код = "810" Тогда
				ЕстьИзменения = Истина;
				Курс = 1;
			КонецЕсли;	
		КонецЕсли;	
		ЕстьИзменения = УстЗнач(Сумма, Окр(СуммаВВалюте * Курс, 2), Истина) Или ЕстьИзменения;
		Если Разница = 0 Тогда
			ЕстьИзменения = УстЗнач(ОбоснованиеРазницы, "", Истина) Или ЕстьИзменения;
		КонецЕсли;
		ЕстьИзменения = УстЗнач(СуммаПоСтрокам, СуммаПоСтрокам_, Истина) Или ЕстьИзменения;
		ЕстьИзменения = УстЗнач(СуммыНеРавны, СуммыНеРавны_, Истина) Или ЕстьИзменения;
		ЕстьИзменения = УстЗнач(НетПривязкиКОплате, НетПривязкиКОплате_, Истина) Или ЕстьИзменения;
		ЕстьИзменения = УстЗнач(ИтогСуммаПлатежи, Платежи.Итог("Сумма"), Истина) Или ЕстьИзменения;
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьВознаграждениеКурьераПоПриемке()

	Результат = 0;
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Если СтрокаТЧ.ОбоснованиеРазницы = "Оплата выезда клиентом" Тогда
			Результат = Результат + СтрокаТЧ.Сумма;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции // РассчитатьВознаграждениеКурьераПоПриемке()

Функция УстановитьФлагКвитовки() Экспорт
	
	тзНесквитованныхПриемокДляЗаписи = Новый ТаблицаЗначений;	
	тзНесквитованныхПриемокДляЗаписи.Колонки.Добавить("ПриемОплаты");
	НетКвитовкиПоСуммамОплат_ = Ложь;		
	Для Каждого Стр Из Полисы Цикл
		тзНесквПриемок = Новый ТаблицаЗначений;
		Если Не уб_СС.КвитовкаПоСуммам(Стр.УИДСтроки, тзНесквПриемок,,, ЭтотОбъект) Тогда
			НетКвитовкиПоСуммамОплат_ = Истина;
		КонецЕсли;
		Для Каждого СтрТЗ Из тзНесквПриемок Цикл
			новСтр = тзНесквитованныхПриемокДляЗаписи.Добавить();
			новСтр.ПриемОплаты = СтрТЗ.ПриемОплаты;
		КонецЦикла;
	КонецЦикла;
	тзНесквитованныхПриемокДляЗаписи.Свернуть("ПриемОплаты");
	УстЗнач(НетКвитовкиПоСуммамОплат, НетКвитовкиПоСуммамОплат_, Истина);
	Возврат тзНесквитованныхПриемокДляЗаписи;
	
КонецФункции

Функция ВсеОплатыПривязаны() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	К.УИДСтрокиТЧ
	|ИЗ
	|	РегистрСведений.уб_КвитовкаОплат КАК К
	|ГДЕ
	|	К.ПриемОплаты = &ПриемОплаты";
	Запрос.УстановитьПараметр("ПриемОплаты", Ссылка);
	тзУИДов = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из Полисы Цикл
		Если тзУИДов.Найти(Стр.УИДСтроки) = Неопределено Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция УдалитьВсеКвитовкиПриемки() Экспорт
	
	НачатьТранзакцию();
	Если уб_СС.УдалитьКвитовки(Неопределено, Неопределено, Ссылка, ЭтотОбъект) Тогда
		ЗафиксироватьТранзакцию();	
		Возврат Истина;	
	Иначе
		ОтменитьТранзакцию();	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Для Каждого Стр ИЗ Полисы Цикл
		Стр.УИДСтроки = Новый УникальныйИдентификатор();	
		Стр.УИДСтрокиЗаявки = "";
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Стр.УИДСтроки = Новый УникальныйИдентификатор();
	КонецЦикла;
	Дата = ОбъектКопирования.Дата;
	ОтчетКассира 				= Документы.уб_ОтчетКассира.ПустаяСсылка();
	НетПривязкиКОплате  		= Ложь;
	НетКвитовкиПоСуммамОплат    = Ложь;	
	
КонецПроцедуры

////////////////////////

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	_Заявка = Неопределено;
	Форма = ПолучитьФорму("ФормаВыбораСтрокОснования");
	ТипЗнч = ТипЗнч(Основание);
	Если ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Или ТипЗнч = Тип("Структура") И Основание.Свойство("Заявка") Тогда // иногда при заполненном фильтре в форме списка приемок создается на основании структуры с одним ключем основания-ссылки-приемки
		Если ТипЗнч = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
			Параметры = Новый Структура;
			Массив = Новый Массив;
			Массив.Добавить(Основание);
			Параметры.Вставить("Документ", 		Массив);
			Параметры.Вставить("ТолькоВыдача",  Ложь);
			Параметры.Вставить("Заявка");
			ОснованиеСозданНаОсновании = Основание.СозданНаОсновании;
			Если ТипЗнч(ОснованиеСозданНаОсновании) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
				Параметры.Заявка = ОснованиеСозданНаОсновании;
			КонецЕсли;				
		Иначе
			Параметры = Основание;
		КонецЕсли;
		Форма.Заявка = Параметры.Заявка;
		ВознаграждениеКурьераКлиентом = Документы.уб_ПриемкаОплат.ВознаграждениеКурьераКлиентом(Форма.Заявка,Ссылка);
		_Заявка = Форма.Заявка;
		Документ = Параметры.Документ;//МассивДокументов
		ТолькоВыдача = Неопределено;
		Параметры.Свойство("ТолькоВыдача", ТолькоВыдача);
		//Допускаем, что тип элемента всегда ПеремещениеБСО
		ВсегоВМассиве = Документ.Количество();
		ТЗИсточник = Новый ТаблицаЗначений;
		ТЗГотова = Ложь;		
		Для Счетчик = 0 по ВсегоВМассиве - 1 Цикл
			ТекДокумент = Документ[Счетчик];
			Если ТолькоВыдача  = Истина Тогда
				Если НЕ ТекДокумент.Направление = 1 Тогда
					//Это не выдача
					//Старый код НЕ ДокументЯвляетсяВыдачей(ТекДокумент,СписокСотрудниковБСО) Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Если НЕ ТЗГотова Тогда
				ТЗИсточник = ТекДокумент.БСО.Выгрузить();
				ТЗИсточник.Колонки.Добавить("ДопНомерБСО",Новый ОписаниеТипов("Строка"));
				Если Платежи.Количество()= 0 Тогда
					ЗаполнитьШапкуПоОснованию(ТекДокумент);
				КонецЕсли;	
				ТЗИсточник.Индексы.Добавить("НомерБСО,ВидБСО");
				ТЗГотова = Истина;
				Запрос = Новый Запрос;
				Для каждого СтрокаБсо из  ТЗИсточник Цикл
					Запрос.текст = "ВЫБРАТЬ
					               |	уб_ДвиженияБСОСрезПоследних.Период,
					               |	уб_ДвиженияБСОСрезПоследних.Регистратор,
					               |	уб_ДвиженияБСОСрезПоследних.НомерСтроки,
					               |	уб_ДвиженияБСОСрезПоследних.Активность,
					               |	уб_ДвиженияБСОСрезПоследних.ВидБСО,
					               |	уб_ДвиженияБСОСрезПоследних.НомерБСО,
					               |	уб_ДвиженияБСОСрезПоследних.СК,
					               |	уб_ДвиженияБСОСрезПоследних.АгентОтправитель,
					               |	уб_ДвиженияБСОСрезПоследних.Агент,
					               |	уб_ДвиженияБСОСрезПоследних.ПоложениеБСО,
					               |	уб_ДвиженияБСОСрезПоследних.СостояниеБСО,
					               |	уб_ДвиженияБСОСрезПоследних.НомерПолиса,
					               |	уб_ДвиженияБСОСрезПоследних.ГодПолиса,
					               |	уб_ДвиженияБСОСрезПоследних.СтраховойПолис,
					               |	уб_ДвиженияБСОСрезПоследних.НаОснованииБумажногоДокумента,
					               |	уб_ДвиженияБСОСрезПоследних.ДатаВозврата,
					               |	уб_ДвиженияБСОСрезПоследних.Заявка,
					               |	уб_ДвиженияБСОСрезПоследних.Подтверждено,
					               |	уб_ДвиженияБСОСрезПоследних.Поставщик,
					               |	уб_ДвиженияБСОСрезПоследних.ОрганизацияАгент,
					               |	уб_ДвиженияБСОСрезПоследних.СтраховаяПремия,
					               |	уб_ДвиженияБСОСрезПоследних.Актуальная,
					               |	уб_ДвиженияБСОСрезПоследних.ДопНомерБСО,
					               |	уб_ДвиженияБСОСрезПоследних.КодОперации,
					               |	уб_ДвиженияБСОСрезПоследних.Комментарий
					               |ИЗ
					               |	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&Дата) КАК уб_ДвиженияБСОСрезПоследних
					               |ГДЕ
					               |	уб_ДвиженияБСОСрезПоследних.ВидБСО = &ВидБСО
					               |	И уб_ДвиженияБСОСрезПоследних.НомерБСО = &НомерБСО";
								   Запрос.УстановитьПараметр("Дата",ТекДокумент.Дата+1);
								   Запрос.УстановитьПараметр("ВидБСО",СтрокаБСО.ВидБСО);
								   Запрос.УстановитьПараметр("НомерБСО",СтрокаБСО.НомерБСО);
								   выборкаДопБСо= Запрос.Выполнить().Выбрать();
								   Если ВыборкаДопБСО.Следующий() Тогда
									   СтрокаБСО.ДопНомерБСО = ВыборкаДопБСО.ДопНомерБСО;
								   КонецЕсли;  
									   
				КонецЦикла;	
				Продолжить;
			Конецесли;	
			Для каждого ТекСтрока из ТекДокумент.БСО Цикл
				Если ТЗИсточник.НайтиСтроки (Новый Структура("ВидБСО,НомерБСО", ТекСтрока.ВидБСО, ТекСтрока.НомерБСО)).Количество() = 0 Тогда
					НоваяСтрока = ТЗИсточник.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	ИначеЕсли Основание = "ПроверкаМодифицированности" Тогда
		СтандартнаяОбработка = Ложь;
		ПересчитатьСуммыИУстановитьФлажки();
		УстановитьФлагКвитовки();
		Возврат;
	Иначе
		ТЗИсточник = Новый ТаблицаЗначений;
	КонецЕсли;
	Если ТЗИсточник.Количество() > 0 Тогда
		Форма.НачальнаяТаблица = ТЗИсточник.Скопировать();
		ТЗПриемник = Полисы.Выгрузить();
		УдалитьСуществующиеБСО(ТЗИсточник, ТЗПриемник);
		СтандартнаяОбработка = Ложь;
		Если ЭтоНовый() Тогда
			УстановитьСсылкуНового(Документы.уб_ПриемкаОплат.ПолучитьСсылку(Новый УникальныйИдентификатор));
		КонецЕсли;	
		Форма.ТаблицаБСО = ТЗИсточник;
		Форма.ЭлементыФормы.ТаблицаБСО.СоздатьКолонки();
		Форма.ПодключитьОбработчикОжидания ("АктивизироватьФорму", 0.1, Истина);  
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры


Процедура УдалитьСуществующиеБСО(ТЗИсточник,ТЗПриемник)
	
	ВсегоСтрок = ТЗИсточник.Количество();
	Для Ит = 1 по ВсегоСтрок Цикл
		ТекСтрока = ТЗИсточник[ВсегоСтрок - Ит];
		Тип = Неопределено;
		Если уб_СЛ.ОпределитьЭтоПолис(ТекСтрока.ВидБСО, Тип) Тогда 
			Если ТЗПриемник.НайтиСтроки (Новый Структура("СК,ВидБСО,НомерБСО", ТекСтрока.СК, ТекСтрока.ВидБСО, ТекСтрока.НомерБСО)).Количество()>0 Тогда
				ТЗИсточник.Удалить(ТекСтрока);
			Конецесли;	
		ИначеЕсли уб_СЛ.ОпределитьЭтоКвитанцияА7(ТекСтрока.ВидБСО,Тип) Тогда	
			Если ТЗПриемник.НайтиСтроки (Новый Структура("НомерКвитанции",ТекСтрока.НомерБСО)).Количество()>0 Тогда
				ТЗИсточник.Удалить(ТекСтрока);
			Конецесли;	
		Иначе
			ТЗИсточник.Удалить(ТекСтрока);
		Конецесли;			
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьШапкуПоОснованию(Основание);
	
	СозданНаОсновании = Основание.Ссылка;	
	_Заявка = уб_УСЗ.ПолучитьИзначальныйДокумент(Основание);
	Если ТипЗНЧ(_Заявка) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		_Заявка = уб_УСЗ.ПолучитьРеквизитыЗаявки(_Заявка);
		Если _Заявка.Самовыезд  Тогда
			ПринятоОТ = _Заявка.Менеджер;		
		Иначе	
			ПринятоОТ = _Заявка.Курьер;		
		КонецЕсли;	
	Иначе	
		ПринятоОТ = Основание.АгентКуда;
	КонецЕсли;
	
КонецПроцедуры

Функция Модифицированность_(ТекстМодификации = "") Экспорт
	
	Если Не Модифицированность() Тогда
		Возврат Ложь
	КонецЕсли;	
	Результат = Ложь;
	//Ключевые параметры: 
	Если СистемаТЧПлатежи Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.СуммаПоСтрокам,
		|	ЕСТЬNULL(ПП.ФормаОплаты, ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.ПустаяСсылка)) КАК ФормаОплаты,
		|	ЕСТЬNULL(ПП.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ПП.УИДСтроки, """") КАК УИДСтроки
		|ИЗ
		|	Документ.уб_ПриемкаОплат КАК П
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК ПП
		|		ПО (ПП.Ссылка = П.Ссылка)
		|ГДЕ
		|	П.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = Платежи.Найти(Выборка.УИДСтроки, "УИДСтроки");
				Если СтрокаТЧ = Неопределено Тогда
					ТекстМодификации = "Изменены строки ТЧ Платежи. ";
					Результат = Истина;
					Прервать;
				ИначеЕсли СтрокаТЧ.Сумма <> Выборка.Сумма Тогда
					ТекстМодификации 	= "Изменена сумма. ";
					Результат 			= Истина;
					Прервать;
				ИначеЕсли СтрокаТЧ.ФормаОплаты <> Выборка.ФормаОплаты
					И (ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Или Выборка.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса)
					Тогда
					ТекстМодификации 	= "Изменена формы оплаты. ";
					Результат 			= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не Результат И Выборка.СуммаПоСтрокам <> СуммаПоСтрокам Тогда
				ТекстМодификации	= "Изменена сумма. ";
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уб_ПриемкаОплат.Сумма,
		|	уб_ПриемкаОплат.СуммаВВалюте,
		|	уб_ПриемкаОплат.СуммаПоСтрокам,
		|	уб_ПриемкаОплат.ФормаОплаты
		|ИЗ
		|	Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
		|ГДЕ
		|	уб_ПриемкаОплат.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.Сумма <> Сумма Или Выборка.СуммаВВалюте <> СуммаВВалюте Или Выборка.СуммаПоСтрокам <> СуммаПоСтрокам Тогда
				ТекстМодификации 	= "Изменена сумма. ";
				Результат 			= Истина;
			ИначеЕсли ФормаОплаты <> Выборка.ФормаОплаты 
				И (ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Или Выборка.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса)	Тогда 
				//ФормаОплаты - изменение связано с кассой
				ТекстМодификации 	= "Изменена формы оплаты. ";
				Результат 			= Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции	

Функция СобратьДанныеПоСтроке(ТекСтрока) Экспорт
	
	Структ = Документы.уб_ПриемкаОплат.ПолучитьПустуюСтруктуруСтроки();
	Если ТекСтрока <> Неопределено Тогда
		//Из строки
		ЗаполнитьЗначенияСвойств(Структ,ТекСтрока);
		//Из объекта
		Структ.Валюта      = Валюта;
		Структ.Курс        = Курс;
		Структ.ФормаОплаты = ?(СистемаТЧПлатежи, ФормаОплаты(), ФормаОплаты);
		//на примере приемки 18173:
		//ОплатаПолисаДляОтчетаАгента - пустая, временных данных нет, однако у БСО ВВВ0629405198 фактически есть и полис и оплата
		//следовательно использовать значение реквизита ОплатаПолисаДляОтчетаАгента нельзя, воспользуемся
		//получением данных из регистра сведений уб_КвитовкаОплат, а не из реквизита ТЧ
		//TODO дальше проверить работоспособность регистра уб_ВременныеДанныеПолисаКПриемкеОплат
		ОплатаПолисаДляОтчетаАгента = Документы.уб_ПриемкаОплат.ПолучитьОплатуПолисаДляОтчетаАгента(ТекСтрока.УИДСтроки, ТекСтрока.НомерКвитанции);
		Если ОплатаПолисаДляОтчетаАгента.Пустая() Тогда
			//Из временных данных
			ВыборкаРС = РегистрыСведений.уб_ВременныеДанныеПолисаКПриемкеОплат.Выбрать(Новый Структура("УИДСтрокиТЧ", ТекСтрока.УИДСтроки)); 
			Если ВыборкаРС.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(Структ, ВыборкаРС);
			Иначе
				//нет ни оплаты полиса, ни временных данных. Данных для создания страхового полиса и оплаты нет.
				//Структ = Неопределено;
			КонецЕсли;
		Иначе	
			//Из оплаты и полиса
			ЗаполнитьЗначенияСвойств(Структ, ПолучитьДанныеОплатыИПолиса(ОплатаПолисаДляОтчетаАгента));
		КонецЕсли;
		//
		//Если НЕ ТекСтрока.Заявка.Пустая() И НЕ Структ = Неопределено Тогда  //не используются заявки на печать
		//	//
		//	
		//	ДанныеИзЗаявкиНаПечать = Документы.уб_ЗаявкаНаПечать.ДанныеПечатиПоВыезду (ТекСтрока.Заявка,Истина);
		//	Структ.Вставить("ДопДанные",ДанныеИзЗаявкиНаПечать);
		//	//Сообщить(Данные.Страхователь);
		//	
		//КонецЕсли;	
		
	КонецЕсли;
	Попытка
		Если ЗначениеЗаполнено(Структ.ВидБСО)  Тогда
			Если НЕ ТипЗнч(Структ.ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
				Структ.Вставить("РазрешитьБезОтчета",Структ.ВидБСО.НеКонтролироватьОтчетомКассира);
			Иначе
				Структ.Вставить("РазрешитьБезОтчета",Истина);
				Структ.Вставить("СтраховойПродукт",Структ.ВидБСО);
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	Возврат Структ;
	
КонецФункции // ПолучитьСтрукт()


//Функция СобратьДанныеПоЗаявкеНаПечать(СсылкаЗаявка)
//	Запрос = Новый Запрос("");
//	
//КонецФункции	

// если форма оплаты одна для всей ТЧ Платежи, вернет ее, иначе пустую ссылку перечисления
Функция ФормаОплаты(ЗаполнитьПоУмолчаниюЕслиПустая = Истина) Экспорт

	Если СистемаТЧПлатежи Тогда
		_ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка();
		
		ФормаОплатыПоУмолчанию = Перечисления.уб_ФормыОплаты.Касса;
		
		Для Каждого СтрокаТЧ Из Платежи Цикл
			Если СтрокаТЧ.НомерСтроки = 1 И Не СтрокаТЧ.ФормаОплаты.Пустая() Тогда
				ФормаОплатыПоУмолчанию = СтрокаТЧ.ФормаОплаты;
			КонецЕсли;
			Если _ФормаОплаты.Пустая() Тогда
				_ФормаОплаты = СтрокаТЧ.ФормаОплаты
			ИначеЕсли СтрокаТЧ.ФормаОплаты <> _ФормаОплаты Тогда
				_ФормаОплаты = Перечисления.уб_ФормыОплаты.ПустаяСсылка();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗаполнитьПоУмолчаниюЕслиПустая И _ФормаОплаты.Пустая() Тогда
			_ФормаОплаты = ФормаОплатыПоУмолчанию;
		КонецЕсли;
	Иначе
		_ФормаОплаты = ФормаОплаты;
	КонецЕсли;
	Возврат _ФормаОплаты;

КонецФункции // ФормаОплаты()

Функция СоздатьКвитовку(ОплатаСсылка, УИДСтрокиТЧ) Экспорт
	
	НачатьТранзакцию();
	Результат =  уб_СС.ДобавитьКвитовкуОплат(УИДСтрокиТЧ, ?(ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка), ОплатаСсылка, ЭтотОбъект);	
	Если Результат Тогда
		ЗафиксироватьТранзакцию();
		УстановитьФлагКвитовки();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;	
	Возврат Результат
	
КонецФункции	

//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
Функция ПолучитьДанныеОплатыИПолиса(Оплата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Оплата",Оплата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Оплата.Ссылка,
	|	Оплата.СтраховойПолис КАК СтраховойПолис,
	|	Оплата.СтраховойПолис.СтраховойПродукт КАК СтраховойПродукт,
	|	Оплата.СтраховойПолис.Агент КАК Агент,
	|	Оплата.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
	|	Оплата.СтраховойПолис.Дата КАК ДатаОформления,
	|	Оплата.СтраховойПолис.ДатаВыдачи КАК ДатаВыдачи,
	|	Оплата.СтраховойПолис.ДатаНачала КАК ДатаНачала,
	|	Оплата.СтраховойПолис.ДатаОкончания КАК ДатаОкончания,
	|	Оплата.СтраховойПолис.Страхователь КАК Страхователь,
	|	Оплата.СтраховойПолис.Курьер КАК Курьер,
	|	Оплата.СтраховойПолис.Аддендум КАК Аддендум,
	|	Оплата.Дата КАК ДатаОплаты,
	|	Оплата.НачисленнаяСуммаВзносаВВалюте,
	|	Оплата.НачисленнаяСуммаВзноса,
	|	Оплата.СкидкаВыплаченаяКлиенту,
	|	Оплата.НомерВзноса
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка = &Оплата";
	Выборка =  Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Новый Структура("СтраховойПолис,СтраховойПродукт,Агент,НомерЗаявки,ДатаОформления,ДатаНачала,
		|ДатаОкончания,Страхователь,Курьер,ДатаОплаты,НачисленнаяСуммаВзносаВВалюте,НачисленнаяСуммаВзноса,
		|СкидкаВыплаченаяКлиенту,НомерВзноса,Аддендум",
		Документы.уб_СтраховойПолис.ПустаяСсылка(),
		Справочники.уб_СтраховыеПродукты.ПустаяСсылка(),
		Справочники.ФизическиеЛица.ПустаяСсылка(),
		0,
		Дата(1,1,1),
		Дата(1,1,1),
		Дата(1,1,1),
		Справочники.ФизическиеЛица.ПустаяСсылка(),
		Справочники.ФизическиеЛица.ПустаяСсылка(),
		Дата(1,1,1),
		0,
		0,
		0,
		1,ЛОЖЬ);
	КонецЕсли;
	
КонецФункции

Функция УстЗнач(ПолеДанных, НовоеЗначение, ИгнорироватьПроведение = Ложь) Экспорт
	
	Если (НЕ Проведен ИЛИ ИгнорироватьПроведение) Тогда
		Возврат УстановитьЗначение(ПолеДанных, НовоеЗначение); 
	КонецЕсли;
	
КонецФункции

// возвращает заявки, указанные в ТЧ Полисы (либо все, либо с оплатой за выезд клиентом)
Функция ПолисыМассивЗаявок(ТолькоСОплатойЗаВыездКлиентом = Ложь, КакСЗ = Ложь) Экспорт

	МассивЗаявок = Новый Массив;
	Для Каждого СтрокаТЧ Из Полисы Цикл
		Если Не СтрокаТЧ.Заявка.Пустая() И МассивЗаявок.Найти(СтрокаТЧ.Заявка) = Неопределено Тогда
			МассивЗаявок.Добавить(СтрокаТЧ.Заявка);
		КонецЕсли;
	КонецЦикла;
	Если ТолькоСОплатойЗаВыездКлиентом Тогда
		Если МассивЗаявок.Количество() > 0 Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	З.Ссылка
			|ИЗ
			|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
			|ГДЕ
			|	З.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Клиент)
			|	И З.Ссылка В (&МассивЗаявок)");
			Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				МассивЗаявок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если КакСЗ Тогда
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(МассивЗаявок);
		Результат = СЗ;
	Иначе
		Результат = МассивЗаявок;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолисыМассивЗаявок()

Функция СуммаНераспределенныхСтрок() Экспорт

	Итог = 0;
	Для Каждого СтрокаТЧ Из Платежи Цикл
		Если СтрокаТЧ.ОбоснованиеРазницы = "<нераспределено>" Тогда
			Итог = Итог + СтрокаТЧ.Сумма;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции // СуммаНераспределенныхСтрок()

Функция ПолучитьСтрокуВыездаПоВидуБСО(_ВидБСО,_Заявка,_сумма,СуммаСкидки =0) Экспорт
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаВыезд.УидСтроки,
	               |	ЗаявкаНаВыезд.ИтогПредоставленнаяСкидка
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК ЗаявкаНаВыезд
	               |ГДЕ
	               |	ЗаявкаНаВыезд.ВидБСО = &ВидБСО
	               |	И ЗаявкаНаВыезд.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ВидБСО",_ВидБСО);  
	Запрос.УстановитьПараметр("Ссылка",_Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			Если Выборка.СуммаВзноса = _сумма Тогда
				СуммаСкидки = Выборка.ИтогПредоставленнаяСкидка;
				Возврат Выборка.УидСтроки;
			КонецЕсли;	
		Исключение
			Возврат "";
		КонецПопытки;
	КонецЦикла;
	
	Выборка.Сбросить();
	Если  Выборка.Следующий() Тогда
		Возврат Выборка.УидСтроки;
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции




СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
Отладка = Ложь;
