
//Функция изменение таска
//	Параметры:
Функция UpdateTask(argument)
	Попытка
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяНачало,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяОкончания,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд,
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор,
		|	ВЫБОР
		|		КОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд = ЛОЖЬ
		|				И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование ПОДОБНО ""%Пустой%""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пустой
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		|ГДЕ
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер");
		Запрос.УстановитьПараметр("Номер", argument.task.taskId);
		
		ЗаявкаВС = Запрос.Выполнить().Выбрать();
		Если ЗаявкаВС.Следующий() Тогда
			ТекущийМенеджер = Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId);
			ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", ТекущийМенеджер);
			ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
			Попытка
				пол = ПользователиИнформационнойБазы.НайтиПоИмени(Сокрлп(ТекПользователь.Код));
				ПараметрыСеанса.уб_ЭтоМенеджер = пол.Роли.Содержит(Метаданные.Роли.уб_МенеджерНаТочке) и пол.Роли.Содержит(Метаданные.Роли.ПолныеПрава) = Ложь;
			Исключение
			КонецПопытки;	
			//ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",ЗаявкаВС.Блокиратор);
			IDКурьера = argument.task.workerId;
			//ЗаявкаВС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НайтиПоНомеру(argument.task.taskId).ПолучитьОбъект();
			СсылкаКурьер = Справочники.ФизическиеЛица.НайтиПоКоду(IDКурьера);
			
			//+проверка занятости
			ЗапросЗанятости = Новый Запрос;
			ЗапросЗанятости.Текст = "ВЫБРАТЬ
			|	уб_ЗанятостьВС.Агент,
			|	уб_ЗанятостьВС.ДатаНачала,
			|	уб_ЗанятостьВС.ДатаОкончания
			|ИЗ
			|	РегистрСведений.уб_ЗанятостьВС КАК уб_ЗанятостьВС
			|ГДЕ
			|	уб_ЗанятостьВС.Агент = &Агент
			|	И НЕ(уб_ЗанятостьВС.ДатаНачала <= &ДатаНачала
			|					И уб_ЗанятостьВС.ДатаОкончания <= &ДатаНачала
			|				ИЛИ уб_ЗанятостьВС.ДатаНачала >= &ДатаОкончания
			|					И уб_ЗанятостьВС.ДатаОкончания >= &ДатаОкончания)";
			ЗапросЗанятости.УстановитьПараметр("Агент", СсылкаКурьер);
			ЗапросЗанятости.УстановитьПараметр("ДатаНачала", ЗаявкаВС.ВремяНачало);
			ЗапросЗанятости.УстановитьПараметр("ДатаОкончания", ЗаявкаВС.ВремяОкончания);
			Если IDКурьера = "000000000"  
				ИЛИ Не ЗапросЗанятости.Выполнить().Пустой() Тогда
				//Записываем для корректного обновления графика
				Объект = ЗаявкаВС.Ссылка.ПолучитьОбъект();
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.ДатаИзменения		= Истина;
				Объект.Модификатор          = ПараметрыСеанса.ТекущийПользователь;
				Попытка
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS 000000000", "Сообщить", Истина);
					Объект.Записать();
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS UpdateTask(): " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
				КонецПопытки;
				Возврат Неопределено;
			КонецЕсли;
			//-проверка занятости	
			НовыйКурьер = ?(IDКурьера = "000000000", Справочники.ФизическиеЛица.ПустаяСсылка(), СсылкаКурьер);
			Если Дата(argument.task.beginTime)	  <> ЗаявкаВС.ВремяНачало
				ИЛИ Дата(argument.task.beginTime) <> ЗаявкаВС.Дата
				ИЛИ Дата(argument.task.meetTime)  <> ЗаявкаВС.meetTime
				ИЛИ Дата(argument.task.endTime)	  <> ЗаявкаВС.ВремяОкончания
				//ИЛИ ?(IDКурьера = "000009119",Справочники.ФизическиеЛица.ПустаяСсылка(),СсылкаКурьер) <> ЗаявкаВС.Курьер
				//ИЛИ ?(IDКурьера = "000009119",ИСТИНА,ЛОЖЬ)<>ЗаявкаВС.Самовыезд Тогда
				ИЛИ  НовыйКурьер<> ЗаявкаВС.Курьер
				ИЛИ ?(IDКурьера = "000000000", ИСТИНА, ЛОЖЬ) <> ЗаявкаВС.Самовыезд Тогда
				//Что-то поменялось
				БылПустой = ЗаявкаВС.Пустой;
				ЭтоПустой = (IDКурьера="000081966" или IDКурьера="000081967" или IDКурьера="000081969" или IDКурьера="000081970"); //или IDКурьера="000081966" //или IDКурьера="000081966"
				ЗаявкаВС = ЗаявкаВС.Ссылка.ПолучитьОбъект();
				ЗаявкаВС.ВремяНачало	= argument.task.beginTime;
				ЗаявкаВС.Дата			= argument.task.meetTime;
				//ЗаявкаВС.ВремяВстречи	= argument.task.meetTime;
				ЗаявкаВС.ВремяОкончания	= argument.task.endTime;
				//ЗаявкаВС.Курьер = ?(IDКурьера = "000009119",Справочники.ФизическиеЛица.ПустаяСсылка(), СсылкаКурьер);
				//ЗаявкаВС.Самовыезд = ?(IDКурьера = "000009119",ИСТИНА,ЛОЖЬ);
				
				ЗаявкаВС.Курьер    = НовыйКурьер;
				ЗаявкаВС.Самовыезд = ?(IDКурьера = "000000000", ИСТИНА, ЛОЖЬ);
				//Если ЗаявкаВС.Курьер <> Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка() Тогда//?Какое-то странное условие?
				//Если Не (ЗаявкаВС.Самовыезд И ЗаявкаВС.Курьер = Справочники.ФизическиеЛица.ПустаяСсылка()) Тогда
				
				Если Не ЗаявкаВС.Самовыезд Тогда
					
					//Новый вариант МОТИВАЦИЯ+
					Попытка
						ЗаявкаВС.ПоказателиРасчетаЗП = уб_РасчетыСМенеджерами.ПоказателиРасчетаЗП(ЗаявкаВС.Дата);
						ЗаявкаВС.РасчетВознагражденияКурьера();
	 				Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При расчете вознаграждения курьера. "+ОписаниеОшибки(), "Сообщить", Истина);
					КонецПопытки;
					//МОТИВАЦИЯ -
					
					ЗаявкаВС.ОбменДанными.Загрузка = Истина;
					ЗаявкаВС.Модификатор   = ПараметрыСеанса.ТекущийПользователь;
					ЗаявкаВС.ДатаИзменения = ТекущаяДата();
					Попытка
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS модификатор", "Сообщить", Истина);
						ЗаявкаВС.Записать();
						//Очередь статуса
						УстановитьПривилегированныйРежим(Истина);
						Если ЗаявкаВс.Самовыезд = Ложь и БылПустой и ЭтоПустой = Ложь Тогда
							ТекСтатус = уб_УСЗ.ВернутьСтатусЗаявки(ЗаявкаВс.Ссылка, ТекущаяДата());
							Если// ТекСтатус = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати
								//или
								ТекСтатус = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера Тогда
								МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
								МенеджерЗаписи.Объект = ЗаявкаВС.Ссылка;
								МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДвижениеСтатусов;
								МенеджерЗаписи.Параметр   = "УстановитьСтатус_БСОНаРукахУКурьера";
								МенеджерЗаписи.Записать();
							ИначеЕсли ТекСтатус = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати Тогда
								МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(ЗаявкаВС.Ссылка,Истина);
								ВсегоПеремещений = МассивПеремещений.Количество();
								Для Счетчик = 1 по ВсегоПеремещений Цикл
									СсылкаПеремещения = МассивПеремещений[Счетчик - 1];
									Если Не СсылкаПеремещения.Проведен Тогда
										Об = СсылкаПеремещения.ПолучитьОбъект();
										Попытка
											Об.Записать(РежимЗаписиДокумента.Проведение);
											уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Проведено перемещение: " + СсылкаПеремещения);
										Исключение
											уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка проведения перемещения " + уб_УСЗ.РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
											ФлЕстьОшибки = Истина;
											Прервать;
										КонецПопытки;	
									КонецЕсли;	
								КонецЦикла;

							КонецЕсли;
						КонецЕсли;
						УстановитьПривилегированныйРежим(Ложь);
						//Конец очереди
						НастройкиДокумента = Справочники.уб_СписокОбъектовИстории.НайтиПоКоду("уб_ЗаявкаНаЗаказВыездногоСпециалиста");		
						Если ЗначениеЗаполнено(НастройкиДокумента) Тогда
							уб_ИсторияИзмененияОбъектов.ЗаписатьНовуюВерсиюИсторииОбъекта(ЗаявкаВС.Ссылка, "Автоматическая регистрация изменений", НастройкиДокумента.ФиксироватьАвтоматически,,Ложь);
						КонецЕсли;
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS UpdateTask()3: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS UpdateTask()2: " + ОписаниеОшибки(),, Истина);
	КонецПопытки
КонецФункции

//Функция изменение статуса таска
//	Параметры:
Функция UpdateTaskStatus(argument)
	
	Попытка
		ЗаявкаВС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НайтиПоНомеру(argument.comm.datainc.setStatus.taskId).ПолучитьОбъект();
		СтарыйСтатус = ЗаявкаВС.Статус;
		actionId = argument.comm.datainc.setStatus.actionId;
		Если actionId = -1 Тогда
			НовыйСтатус = Перечисления.уб_СтатусЗаявки.Неопределено;
		Иначе
			НовыйСтатус = Перечисления.уб_СтатусЗаявки[actionId];
		КонецЕсли;
		Если Не ЗаявкаВС.Статус = НовыйСтатус Тогда
			ЗаявкаВС.Статус = НовыйСтатус;
			ЗаявкаВС.ОбменДанными.Загрузка = Истина;
			ЗаявкаВС.Модификатор   = ПараметрыСеанса.ТекущийПользователь;
			ЗаявкаВС.ДатаИзменения = ТекущаяДата();
			Попытка
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS статус", "Сообщить", Истина);
				ЗаявкаВС.Записать();
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS UpdateTaskStatus(): " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
			КонецПопытки;
			ИДСообщения = Новый УникальныйИдентификатор();
			ТекущийМенеджер = Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId);
			Если ТекущийМенеджер.Пустая() Тогда
				Возврат Ложь ;
			Иначе	
			
			АвторЗапроса = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", ТекущийМенеджер);
			НовоеСообщение = РегистрыСведений.уб_Чат_Сообщения.СоздатьМенеджерЗаписи();
			НовоеСообщение.Период = ТекущаяДата();
			НовоеСообщение.Отправитель = АвторЗапроса;
			//Если Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", ЗаявкаВС.Менеджер) = АвторЗапроса Тогда
			//	Получатель = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду("000008514"));
			//Иначе
				Получатель = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", ЗаявкаВС.Менеджер);
			//КонецЕсли;
			Если СтарыйСтатус = Перечисления.уб_СтатусЗаявки.Неопределено Тогда
				Если НовыйСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаИзменение Тогда
					Заголовок = "Заявка №" + ЗаявкаВС.Номер + " Запрос на изменение";
				ИначеЕсли НовыйСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление Тогда
					Заголовок = "Заявка №" + ЗаявкаВС.Номер + " Запрос на удаление";
				ИначеЕсли НовыйСтатус = Перечисления.уб_СтатусЗаявки.ЗаявкаУдалена Тогда
					Заголовок = "Заявка №" + ЗаявкаВС.Номер + " удалена";
				КонецЕсли;
			ИначеЕсли СтарыйСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаИзменение Тогда
				Если НовыйСтатус = Перечисления.уб_СтатусЗаявки.Неопределено Тогда
					Если argument.comm.datainc.setStatus.allow Тогда
						Заголовок = "Заявка №" + ЗаявкаВС.Номер + " запрос на изменение подтвежден";
					Иначе
						Заголовок = "Заявка №" + ЗаявкаВС.Номер + " запрос на изменение отклонен";
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтарыйСтатус = Перечисления.уб_СтатусЗаявки.ЗапросНаУдаление Тогда
				Если НовыйСтатус = Перечисления.уб_СтатусЗаявки.Неопределено Тогда
					Если argument.comm.datainc.setStatus.allow Тогда
						Заголовок = "Заявка №" + ЗаявкаВС.Номер + " запрос удаление подтвержден";
					Иначе
						Заголовок = "Заявка №" + ЗаявкаВС.Номер + " запрос удаление отклонен";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НовоеСообщение.Получатель = Получатель;
			НовоеСообщение.ИДСообщения = ИДСообщения;
			НовоеСообщение.Заголовок = ?(ЗначениеНеЗаполнено(Заголовок), "Заявка №" + ЗаявкаВС.Номер + " Установлен статус: " + НовыйСтатус, Заголовок);
			НовоеСообщение.Сообщение = "Заявка № " + ЗаявкаВС.Номер + " от " + Формат(ЗаявкаВС.Дата, "ДЛФ=ДД") + " курьер: " + ЗаявкаВС.Курьер + Символы.ПС + argument.comm.datainc.setStatus.text;
			НовоеСообщение.ДатаОбновления = ТекущаяДата();
			НовоеСообщение.Записать();
			
			НовоеСообщение = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьМенеджерЗаписи();
			НовоеСообщение.Период = ТекущаяДата();
			НовоеСообщение.Отправитель = АвторЗапроса;
			НовоеСообщение.Пользователь = Получатель;
			НовоеСообщение.ИДСообщения = ИДСообщения;
			НовоеСообщение.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
		
	КонецПопытки
КонецФункции

Функция UpdateMsgStatus(argument)
	Попытка
		Если argument.comm.datainc.msgStatus.isRead Тогда
			Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
			Набор.Отбор.ИДСообщения.Установить(argument.comm.datainc.msgStatus.msgId);
			Набор.Записать();
		КонецЕсли;
		
		Если argument.comm.datainc.msgStatus.delete Тогда
			Набор = РегистрыСведений.уб_Чат_НепрочитанныеСообщения.СоздатьНаборЗаписей();
			Набор.Отбор.ИДСообщения.Установить(argument.comm.datainc.msgStatus.msgId);
			Набор.Записать();
			
			Набор = РегистрыСведений.уб_Чат_Сообщения.СоздатьНаборЗаписей();
			Набор.Отбор.ИДСообщения.Установить(argument.comm.datainc.msgStatus.msgId);
			Набор.Прочитать();
			Если Набор.Количество() <> 0 Тогда
				Набор[0].НеОтображатьНаWeb = Истина;
				Набор.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
		
	КонецПопытки;
КонецФункции

//Функция изменение таска
//	Параметры:
//
// Запрос: {"commId":"12", "taskId":"2", "sessionId":"123", "setBlock":"false", "isGraphicChange":"true"}
//
// Ответ: 
//
//<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
//	<soap:Header/>	<soap:Body>
//		<m:GetDataResponse xmlns:m="http://www.sample-package.org">
//			<m:return xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:
//				type="m:beginData" error="0" msg="">
//				<m:activeTask taskId="2"/>
//			</m:return>
//		</m:GetDataResponse></soap:Body>
//</soap:Envelope>
Функция BlockTask(argument)
	
	Попытка
		activeTask = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskBlock"));
		
		taskId	   = argument.comm.datainc.activeTask.taskId;
		//без блокировок+
		activeTask.taskId = taskId;
		Возврат activeTask;
		//без блокировок-
		
		ТекущийМенеджер = Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId);
		Если ТекущийМенеджер.Пустая() Тогда
			Возврат activeTask;
			//Возврат Ложь;
		КонецЕсли;
		Блокировка = argument.comm.datainc.activeTask.setBlock;
		Если Блокировка Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор,
			|	ЕстьNull(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор.Код, """") КАК КодБлокиратора,
			|	ЕстьNull(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор.Наименование, """") КАК ИмяБлокиратора,
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер Как Номер 
			|ИЗ
			|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
			|ГДЕ
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &taskId");
			Запрос.УстановитьПараметр("taskId", taskId);
			ВыборкаТек = Запрос.Выполнить().Выбрать();
			Если ВыборкаТек.Следующий() Тогда
				Если НЕ ВыборкаТек.Блокиратор.Пустая() Тогда
					
					taskBlock = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "task-block"));
					activeTask.taskBlock = taskBlock;
					taskBlock.session_id = ВыборкаТек.КодБлокиратора;

					//taskBlock.computer_name = "TAU";
					ИмяБазы = уб_temp.ПолучитьИмяБазыДанных(Истина);
					Разделитель = Найти(ИмяБазы,"/");
					ИмяСервера = Лев(ИмяБазы,Разделитель-1);
					Если Найти(ИмяСервера,"/") = 0 Тогда
						taskBlock.computer_name = ИмяСервера;
					Иначе
						taskBlock.computer_name = ИмяБазы;//файловая база
					КонецЕсли;

					taskBlock.blocked_till = ТекущаяДата()+60*20;
					taskBlock.message = "Задача заблокирована менеджером: " + ВыборкаТек.Блокиратор;
					managerType = ФабрикаXDTO.Тип("http://www.sample-package.org", "managerType");
					managerType.id = ВыборкаТек.КодБлокиратора;
					managerType.name = ВыборкаТек.ИмяБлокиратора;
					taskBlock.manager = managerType;
				Иначе
					ОбъектДокумента = ВыборкаТек.Ссылка.ПолучитьОбъект();
					ОбъектДокумента.Блокиратор = ТекущийМенеджер;
					ОбъектДокумента.ОбменДанными.Загрузка = Истина;
					Попытка
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS Блокиратор", "Сообщить", Истина);
						ОбъектДокумента.Записать();
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS BlockTask() (1): " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
					КонецПопытки;
					activeTask.taskId = ВыборкаТек.Номер;
				КонецЕсли;
			КонецЕсли;
		Иначе
			//Снимаем у всех, связанных с блокиратором
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор
			|ИЗ
			|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
			|ГДЕ
			|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор = &Блокиратор");
			Запрос.УстановитьПараметр("Блокиратор", ТекущийМенеджер);
			ВыборкаБлок = Запрос.Выполнить().Выбрать();
			ПустаяСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();
			Пока ВыборкаБлок.Следующий() Цикл
				Заявка = ВыборкаБлок.Ссылка.ПолучитьОбъект();
				Заявка.Блокиратор = ПустаяСсылка;
				Заявка.ОбменДанными.Загрузка = Истина;
				Попытка
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS блокиратор 2 "+ТекущийМенеджер, "Сообщить", Истина);
					Заявка.Записать();
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS блокиратор "+ЗначениеВСтрокуВнутр(argument), "Сообщить", Истина);
				Исключение
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("WEBSVS BlockTask() (2): " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		Возврат activeTask;
	Исключение
		Возврат activeTask;
	КонецПопытки
	
КонецФункции

Функция GetBeginUpdateData(argument, Режим)
	
	RPstartDate = Дата(argument.comm.datainc.requestedPeriod.startDate);
	RPdayAdd	= argument.comm.datainc.requestedPeriod.dayAdd;
	
	Если Режим = 1 Тогда//update
		CPstartDate		= Дата(argument.comm.datainc.currentPeriod.startDate);
		CPendDate		= Дата(argument.comm.datainc.currentPeriod.endDate);
		CPlastTimeUpdate= Дата(argument.comm.datainc.currentPeriod.lastTimeUpdate);
	КонецЕсли;
	
	ТаблицаДней = Новый ТаблицаЗначений();
	ТаблицаДней.Колонки.Добавить("date");
	Если Режим = 1 Тогда
		ТаблицаДней.Колонки.Добавить("lastTimeUpdate");
	КонецЕсли;
	Для i = 0 По RPdayAdd Цикл
		НоваяСтр = ТаблицаДней.Добавить();
		НоваяСтр.date = RPstartDate + 60*60*24*i;
		Если Режим = 1 Тогда
			СчДата = НачалоДня(CPstartDate);
			Пока СчДата <= НачалоДня(CPendDate) Цикл
				Если НоваяСтр.date = СчДата Тогда 
					НоваяСтр.lastTimeUpdate = CPlastTimeUpdate;
				КонецЕсли;
				СчДата = СчДата + 60*60*24;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	period = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "period"));
	Если Режим = 0 Тогда
		period.startDate = RPstartDate;
		period.endDate = RPstartDate + 60*60*24*RPdayAdd;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаДней Цикл
		
		Дата = Строка.date;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Сотрудники.Агент,
		|	Сотрудники.Агент.Код КАК АгентКод,
		|	Сотрудники.Агент.Наименование КАК АгентНаименование,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	Сотрудники.Выбытие
		|ПОМЕСТИТЬ уб_ДвижениеФизлицПоПодразделениям
		|ИЗ
		|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаДвиженияФизЛиц, ) КАК Сотрудники
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент),
		|	""000000000"",
		|	""-- Не выбран курьер--"",
		|	""СВС"",
		|	ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Заявки.Ссылка, ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)) КАК Ссылка,
		|	ЕСТЬNULL(Сотрудники.АгентКод, """") КАК workerId,
		|	ЕСТЬNULL(Сотрудники.АгентНаименование, """") КАК name,
		|	ЕСТЬNULL(Заявки.Номер, 0) КАК taskId,
		|	ВЫБОР
		|		КОГДА Заявки.Статус.Порядок = 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК deleted,
		|	ЕСТЬNULL(Заявки.ВремяНачало, """") КАК timeBegin,
		|	ЕСТЬNULL(Заявки.Дата, """") КАК timeMeet,
		|	ЕСТЬNULL(Заявки.ВремяОкончания, """") КАК timeEnd,
		|	ЕСТЬNULL(Заявки.ВремяВстречиКлиент, """") КАК ВремяВстречиКлиент,
		|	ЕСТЬNULL(Заявки.ВремяОкончанияКлиент, """") КАК ВремяОкончанияКлиент,
		|	ИСТИНА КАК isAvailable,
		|	ЕСТЬNULL(Заявки.Утверждено, ЛОЖЬ) КАК isConfirmed,
		|	ЛОЖЬ КАК isOnDuty,
		|	ЛОЖЬ КАК isAdministrative,
		|	2 КАК isPerformed,
		|	ЕСТЬNULL(Заявки.Менеджер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК manager,
		|	ЕСТЬNULL(Заявки.Автор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК autor,
		|	Сотрудники.Выбытие КАК workerDeleted,
		|	ЕСТЬNULL(Заявки.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусЗаявки.Неопределено)) КАК Статус,
		|	ЕСТЬNULL(Заявки.Комментарий, """") КАК Комментарий,
		|	ЕСТЬNULL(Заявки.Самовыезд, ЛОЖЬ) КАК Самовыезд,
		|	ЕСТЬNULL(Заявки.Автор.ФизЛицо.Код, """") КАК КодАвтора,
		|	ЕСТЬNULL(Заявки.Автор.ФизЛицо.Наименование, """") КАК НаименованиеАвтора,
		|	ЕСТЬNULL(Заявки.Менеджер.Код, """") КАК КодМенеджера,
		|	ЕСТЬNULL(Заявки.Менеджер.Наименование, """") КАК НаименованиеМенеджера,
		|	Заявки.БСО.(
		|		Ссылка,
		|		СК,
		|		ВидБСО,
		|		Оператор,
		|		Состояние,
		|		НомерБСО
		|	) КАК БСО, ЕСТЬNULL(Заявки.ПроцентГотовности, 0) КАК ПроцентГотовности, ЕСТЬNULL(Заявки.Состояния,"""") как Состояния,
		|   ЕСТЬNULL(Заявки.Оператор, """") КАК Оператор,
		|	ВЫБОР
		|		КОГДА Заявки.ПриоритетЗадачи = ЗНАЧЕНИЕ(Перечисление.уб_ПриоритетЗадачи.ПустаяСсылка)
		|			ТОГДА 2
		|		ИНАЧЕ ЕСТЬNULL(Заявки.ПриоритетЗадачи.Порядок, 2)
		|	КОНЕЦ КАК ИндексПриоритета,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Заявки.ПриоритетЗадачи), """") КАК ПриоритетЗадачи,
		|	ЕСТЬNULL(Заявки.МестоВстречи, """") КАК МестоВстречи,
		|	ЕСТЬNULL(Заявки.СтанцияМетро, """") КАК СтанцияМетро,
		|	ВЫБОР
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Арбатско-Покровская""
		|			ТОГДА ""8492FF""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Бутовская""
		|			ТОГДА ""B2D4FF""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Замоскворецкая""
		|			ТОГДА ""42C442""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Калининская""
		|			ТОГДА ""FFFA72""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Калужско-Рижская""
		|			ТОГДА ""FF9B59""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Каховская""
		|			ТОГДА ""609199""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Кольцевая""
		|			ТОГДА ""995F38""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Люблинско-Дмитровская""
		|			ТОГДА ""8BB743""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Серпуховско-Тимирязевская""
		|			ТОГДА ""C0C0C0""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Сокольническая""
		|			ТОГДА ""FF706D""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Таганско-Краснопресненская""
		|			ТОГДА ""974A99""
		|		КОГДА Заявки.СтанцияМетро.Линия = ""Филевская""
		|			ТОГДА ""AFFCFF""
		|		ИНАЧЕ ""fff""
		|	КОНЕЦ КАК background,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(Заявки.Страхователь КАК СТРОКА), """") КАК Страхователь,
		|	ВЫБОР
		|		КОГДА Заявки.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(Заявки.Тип.Порядок, 0)
		|	КОНЕЦ КАК ИндексТипа,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Заявки.Тип), """") КАК Тип,
		|	ВЫБОР
		|		КОГДА Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусЗаявки.ПустаяСсылка)
		|			ТОГДА -1
		|		ИНАЧЕ ЕСТЬNULL(Заявки.Статус.Порядок, -1)
		|	КОНЕЦ КАК ИндексСтатуса,
		|	ВЫБОР
		|		КОГДА Заявки.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок
		|				ИЛИ Заявки.НомерЗаявки = НЕОПРЕДЕЛЕНО
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(Заявки.НомерЗаявки, 0)
		|	КОНЕЦ КАК НомерЗаявки,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус, """")) КАК СостояниеСтрока,
		|	ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.ТребуетсяВозвратБСО, ЛОЖЬ) КАК ТребуетсяВозвратБСО,
		|	ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус.Порядок, -1) КАК ИндексСостояния,
		|	ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ПустаяСсылка)) КАК Состояние
		|ИЗ
		|	уб_ДвижениеФизлицПоПодразделениям КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
		|		ПО (&УсловиеСвязиПоКурьеру)
		|			И (Заявки.Дата МЕЖДУ &НачалоДня И &КонецДня)
		|			И (&УсловияДатаИзменения)
		|			И (Заявки.Проведен = ИСТИНА)
		|			И (&УсловиеКонтроля)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
		|		ПО (Заявки.Ссылка = уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка)
		|ГДЕ 
		|	1 = 1
		//|	и  ЕСТЬNULL(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус, 0) в (0,ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаВпечати))
		|
		|УПОРЯДОЧИТЬ ПО
		|	name,
		|	timeBegin,
		|	timeEnd");
		
		Если Режим = 1 Тогда
			Запрос.УстановитьПараметр("ДатаДвиженияФизЛиц", '00010101');
			ТекстУсловияДатаИзменения = "Заявки.ДатаИзменения >= &ДатаИзменения";
			ДатаИзменения_ = Строка.lastTimeUpdate;
			Запрос.УстановитьПараметр("ДатаИзменения", ДатаИзменения_);
		Иначе
			Запрос.УстановитьПараметр("ДатаДвиженияФизЛиц", КонецДня(Дата));
			ТекстУсловияДатаИзменения = "Истина";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияДатаИзменения", ТекстУсловияДатаИзменения);
		
		
		Если ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтроля", 
			" Выбор Когда Заявки.ТребуетсяУтверждениеАндеррайтера = ИСТИНА и (Заявки.УтвердилАндеррайтер = Значение(Справочник.ФизическиеЛица.ПустаяСсылка) или Заявки.РезультатПроверки = Значение(Перечисление.уб_РезультатПроверкиЗаявки.Отклонено) 
			| или Заявки.РезультатПроверки = Значение(Перечисление.уб_РезультатПроверкиЗаявки.ПринятоСДоработкой)
			|) Тогда Ложь Иначе Истина Конец ");
			//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтроля", " Выбор Когда Заявки.Утверждено = Ложь и (Заявки.ТребуетсяУтверждениеАндеррайтера = ИСТИНА и Заявки.УтвердилАндеррайтер = Значение(Справочник.ФизическиеЛица.ПустаяСсылка) Тогда Ложь Иначе Истина Конец ");
		Иначе	
			Запрос.УстановитьПараметр("УсловиеКонтроля",Истина);
		КонецЕсли;	
			
		
		РежимПросмотраГрафикаЗаявок = уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.РежимПросмотраГрафикаЗаявок, 0);
		//Если Не ЗначениеЗаполнено(РежимПросмотраГрафикаЗаявок) Тогда
		//	Если Режим = 1 Тогда
		//		ТекстУсловияПоПодразделению = "Сотрудники.Подразделение = &Подразделение И (Сотрудники.Выбытие = ЛОЖЬ ИЛИ НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка.Ссылка ЕСТЬ NULL)";
		//	Иначе
		//		ТекстУсловияПоПодразделению = "Сотрудники.Подразделение = &Подразделение И (Сотрудники.Выбытие = ЛОЖЬ ИЛИ НЕ Заявки.Ссылка ЕСТЬ NULL)";
		//	КонецЕсли;
		//	
		//	//ТекстУсловиеСвязиПоКурьеру = "Сотрудники.Агент = Заявки.Курьер
		//	//|				ИЛИ Сотрудники.Агент = Значение(Справочник.ФизическиеЛица.ПустойАгент)
		//	//|					И Заявки.Самовыезд";
		//	ТекстУсловиеСвязиПоКурьеру = "Сотрудники.Агент = Заявки.Курьер
		//	|				ИЛИ Сотрудники.Агент = Значение(Справочник.ФизическиеЛица.ПустойАгент)
		//	|					И Заявки.Самовыезд";

		//ИначеЕсли РежимПросмотраГрафикаЗаявок = 1 Тогда
		//	Если Режим = 1 Тогда
		//		ТекстУсловияПоПодразделению = "Сотрудники.Подразделение <> &Подразделение И НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка.Ссылка ЕСТЬ NULL";
		//	Иначе
		//		ТекстУсловияПоПодразделению = "Сотрудники.Подразделение <> &Подразделение И НЕ Заявки.Ссылка ЕСТЬ NULL";
		//	КонецЕсли;
		//	
		//	//ТекстУсловиеСвязиПоКурьеру = "Сотрудники.Агент = Заявки.Курьер";
		//	ТекстУсловиеСвязиПоКурьеру = "Сотрудники.Агент = Заявки.Курьер
		//	|				ИЛИ Сотрудники.Агент = Значение(Справочник.ФизическиеЛица.ПустойАгент)
		//	|					И Заявки.Самовыезд";
		//Иначе
			Если Режим = 1 Тогда
				ТекстУсловияПоПодразделению = "Сотрудники.Подразделение В(&Подразделение) Или НЕ уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка ЕСТЬ NULL";
			Иначе
				ТекстУсловияПоПодразделению = "Сотрудники.Подразделение В(&Подразделение) Или НЕ Заявки.Ссылка ЕСТЬ NULL";
			КонецЕсли;
			
			//ТекстУсловиеСвязиПоКурьеру = "Сотрудники.Агент = Заявки.Курьер
			//|				ИЛИ Сотрудники.Агент = Значение(Справочник.ФизическиеЛица.ПустойАгент)
			//|					И Заявки.Самовыезд И Сотрудники.Подразделение В(&Подразделение)";
			
			ТекстУсловиеСвязиПоКурьеру = "Заявки.Самовыезд = ложь и ((Сотрудники.Агент = Заявки.Курьер И Сотрудники.Подразделение В(&Подразделение))
			|				ИЛИ Сотрудники.Агент = Значение(Справочник.ФизическиеЛица.ПустойАгент))";
	//	КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", ТекстУсловияПоПодразделению);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСвязиПоКурьеру", ТекстУсловиеСвязиПоКурьеру);
		
		Запрос.УстановитьПараметр("Подразделение", УБ_УСЗ.ПолучитьПодразделенияВС());
		
		Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
		Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
		
		Если Режим = 1 Тогда
			ДатаИзменения_ = Строка.lastTimeUpdate;
			Запрос.УстановитьПараметр("ДатаИзменения", ДатаИзменения_);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		period.lastTimeUpdate = ТекущаяДата();
		//Открываем day
		day = ПолучитьЭлементDay(Дата);
		
		ЗапросЗанятостьВС = Новый Запрос(
		"ВЫБРАТЬ
		|   ЕСТЬNULL(уб_ЗанятостьВС.Агент.Код, """") КАК КодАгента,
		|	ЕСТЬNULL(уб_ЗанятостьВС.ТипЗанятости.Наименование, """") КАК name,
		|	ВЫБОР
		|		КОГДА уб_ЗанятостьВС.ДатаНачала < &НачалоДня
		|			ТОГДА &НачалоДня
		|		ИНАЧЕ уб_ЗанятостьВС.ДатаНачала
		|	КОНЕЦ КАК timeBegin,
		|	ВЫБОР
		|		КОГДА уб_ЗанятостьВС.ДатаОкончания > &КонецДня
		|			ТОГДА &КонецДня
		|		ИНАЧЕ уб_ЗанятостьВС.ДатаОкончания
		|	КОНЕЦ КАК timeEnd,
		|	ЕСТЬNULL(уб_ЗанятостьВС.Агент.Код, """") КАК workerId,
		|	ЕСТЬNULL(уб_ЗанятостьВС.ТипЗанятости.ЦветВыделения, """") КАК color,
		|	уб_ЗанятостьВС.УдалитьНаWebГрафике КАК deleted,
		|	уб_ЗанятостьВС.УИД КАК id,
		|	уб_ЗанятостьВС.Комментарий КАК comment,
		|	ЕСТЬNULL(уб_ЗанятостьВС.ТипЗанятости.Код, """") КАК type
		|ИЗ
		|	РегистрСведений.уб_ЗанятостьВС КАК уб_ЗанятостьВС
		|ГДЕ
		|(уб_ЗанятостьВС.ДатаНачала <= &НачалоДня
		|				И уб_ЗанятостьВС.ДатаОкончания >= &НачалоДня
		|			ИЛИ уб_ЗанятостьВС.ДатаНачала >= &НачалоДня
		|				И уб_ЗанятостьВС.ДатаОкончания <= &КонецДня
		|			ИЛИ уб_ЗанятостьВС.ДатаНачала <= &КонецДня
		|				И уб_ЗанятостьВС.ДатаОкончания >= &КонецДня)
		|	И &ТекстУсловияДляДатыИзменения");
		
		ЗапросЗанятостьВС.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
		ЗапросЗанятостьВС.УстановитьПараметр("КонецДня", КонецДня(Дата));
		
		//Если Режим = 1 Тогда
		//	ЗапросЗанятостьВС.УстановитьПараметр("ДатаИзменения", ДатаИзменения_);
		//	ТекстУсловияДляДатыИзменения = "уб_ЗанятостьВС.ДатаИзменения >= &ДатаИзменения";
		//Иначе
			ТекстУсловияДляДатыИзменения = "Истина";
		//КонецЕсли;
		ЗапросЗанятостьВС.Текст = СтрЗаменить(ЗапросЗанятостьВС.Текст,"&ТекстУсловияДляДатыИзменения",ТекстУсловияДляДатыИзменения);
		
		ВыборкаЗанятостьВС = ЗапросЗанятостьВС.Выполнить().Выгрузить();
		ПредWorkerId = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если ПредWorkerId <> Выборка.workerId Тогда
				worker = ПолучитьЭлементWorker(Выборка.workerId, Выборка.name, Выборка.workerDeleted);
				
				ЕстьЗанятость = Истина;
				Для Каждого Строка Из ВыборкаЗанятостьВС.НайтиСтроки(Новый Структура("КодАгента",Выборка.workerId)) Цикл
					Если Строка.deleted = Истина Тогда
						ЕстьЗанятость = Ложь;
						Продолжить;
					КонецЕсли;	
					
					employment = ПолучитьЭлементEmployment(Строка);
					worker.employment.Добавить(employment);
				КонецЦикла;
				Если ЕстьЗанятость = Истина Тогда
					day.worker.Добавить(worker);
					ПредWorkerId = Выборка.workerId;
				Иначе
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Если Не Выборка.taskId = 0
				и (Выборка.timeMeet<Дата(2018,11,22) или (Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.ЗаявкаВПечати
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.НазначениеКурьера
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.БСОНаРукахУКурьера
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.ДеньгиВКомпании
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.ЗаявкаОтработана
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.СтраховкаСостоялась
				или 
				Выборка.Состояние = Перечисления.уб_СтатусыЗаявок.КомплектИДеньгиУКассира
				))
				
				Тогда
				
				Если ПараметрыСеанса.уб_ЭтоМенеджер = Истина Тогда
					Если argument.comm.datainc.sessionId =  Выборка.КодМенеджера или argument.comm.datainc.sessionId =  Выборка.workerId
						или argument.comm.datainc.sessionId =  Выборка.КодАвтора
						Тогда
						worker.task.Добавить(ПолучитьЭлементTask(Выборка));
					Иначе
					КонецЕсли;	
				Иначе		
					worker.task.Добавить(ПолучитьЭлементTask(Выборка));
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		period.day.Добавить(Day);
		
	КонецЦикла;
	Возврат period;
	
КонецФункции

Функция GetBeginData(argument)
	
	Возврат GetBeginUpdateData(argument, 0);
	
КонецФункции

//Функция обновления таска
//
//	requestedPeriod	- Период за который запрашиваются данные
//			startDate		- Начальная дата на графике на момент запроса
//			dayAdd			- Количесво дополнительных дней, вперед от начальной даты, которые будет отображаться
//
//	currentPeriod	- Отображаемый период на графике
//			startDate		- Начальная дата на графике на момент запроса
//			endDate			- Конечная дата на графике на момент запроса
//			lastTimeUpdate  - Время актуальности данных в интерфейсе
//
//	cachedDay		- Набором этих элементов на сервер передается список кешированных дней, 
//					попадающих в диапазон requestedPeriod и не попадающих в диапазон currentPeriod
//			date			- Дата кешированного дня
//			lastTimeUpdate  - Время актуальности данных представленных за этот день
Функция GetUpdateData(argument)
	
	Возврат GetBeginUpdateData(argument, 1);
	
КонецФункции

//id запросов:
//	01 - получение начальных данных GetBeginData
//	02 - обновление данных GetUpdateData
//	описать полностью
Функция GetData(argument)
	
	beginData = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "beginData"));
	beginData.error = "000";
	beginData.msg = "";
	
	//beginData.error = "вапвапра орпроп";
	//Возврат "434534534";
	
	Попытка//?нужна ли попытка? всегда есть sessionId?
		КодФизЛица = argument.comm.datainc.sessionId;
	Исключение
		КодФизЛица = Неопределено;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(КодФизЛица) Тогда
		//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("SVS."+КодФизЛица,,Истина, УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при удалении заявки", ,,);
		ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду(КодФизЛица));
		Если ЗначениеЗаполнено(ТекПользователь) Тогда
			ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
			Попытка
				пол = ПользователиИнформационнойБазы.НайтиПоИмени(Сокрлп(ТекПользователь.Код));
				ПараметрыСеанса.уб_ЭтоМенеджер = пол.Роли.Содержит(Метаданные.Роли.уб_МенеджерНаТочке) и пол.Роли.Содержит(Метаданные.Роли.ПолныеПрава) = Ложь;
			Исключение
			КонецПопытки;	
		КонецЕсли;
	Иначе
		Возврат beginData;	
	КонецЕсли;
	
	Если argument.comm.id = "01" Тогда
		beginData.period		= GetBeginData(argument);
		GetMessage(beginData, Дата('00010101'), argument.comm.datainc.sessionId);
		GetActiveTask(beginData, argument);
	ИначеЕсли argument.comm.id = "02" Тогда
		beginData.period = GetUpdateData(argument);
		GetMessage(beginData, Дата(argument.comm.datainc.currentPeriod.lastTimeUpdate), argument.comm.datainc.sessionId);
		GetActiveTask(beginData, argument);
	ИначеЕсли argument.comm.id = "13" Тогда
		//ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId));
		UpdateTask(argument.comm.datainc);
	ИначеЕсли argument.comm.id = "12" Тогда
		//ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId));
		beginData.activeTask = BlockTask(argument);
	ИначеЕсли argument.comm.id = "20" Тогда
		//ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId));
		UpdateTaskStatus(argument);
	ИначеЕсли argument.comm.id = "30" Тогда
		UpdateMsgStatus(argument);
	ИначеЕсли argument.comm.id = "40" Тогда
		//SetWorkerStatus(argument);
	КонецЕсли;
	
	Возврат beginData;
КонецФункции

Функция Authorization(argument)
	Попытка
		
	Исключение
		
	КонецПопытки
КонецФункции

Функция CreateNewTask(argument)
	Попытка
		
	Исключение
		
	КонецПопытки
КонецФункции

//Описание:
//	date		- день (date)
//	dow			- Дата прописью (string)
//	isHoliday	- Признак выходной (boolean)
//	worker		- Выездной специалист (элемент worker)
Функция ПолучитьЭлементDay(Дата)
	day = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "day"));
	day.date		= Дата;
	day.dow			= ПолучитьИмяДняНедели(Дата);
	day.isHoliday	= РегистрыСведений.РегламентированныйПроизводственныйКалендарь.Получить(Новый Структура("ДатаКалендаря, Год", Дата, Год(Дата))).ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
	
	Возврат day;
КонецФункции

//Описание:
//	workerId			- id сотрудника
//	deleted				- Признак удален (boolean)
//	name				- ФИО сотрудника (string)
//	isOnDuty			- Признак дежурный (boolean)
//	isAdministrative	- Признак административный (boolean)
//	task				- Таск (элемент task)
Функция ПолучитьЭлементWorker(id, name, deleted)
	
	worker = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "worker"));
	worker.workerId	= id;
	worker.name = name;
	worker.deleted = deleted;
	
	Возврат worker;
	
КонецФункции

//Описание:
//	taskId			- id таска
//	deleted			- Признак удален (boolean)
//	workerID		- id сотрудника (string)
//	timeBegin		- Время начала
//	timeMeet		- Время встречи
//	timeEnd			- Время окончания
//  isAvailable		- Признак задача доступности работника
//  isConfirmed		- Признак задача подтверждена
//  isOnDuty		- Признак задача дежурства
//  isAdministrative- Признак задача административная
//	isPerformed		- Признак страховка состоялась
Функция ПолучитьЭлементTask(Выборка)
	
	task = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "task"));
	task.taskId = Выборка.taskId;
	task.deleted = Выборка.deleted;
	//task.workerID = ?(Выборка.Ссылка.Самовыезд, "000009119",Выборка.workerId);
	task.workerID = ?(Выборка.Самовыезд, "000000000",Выборка.workerId);
	task.timeBegin = Выборка.timeBegin;
	task.timeMeet = Выборка.timeMeet;
	task.timeEnd = Выборка.timeEnd;
	task.isAvailable = Выборка.isAvailable;
	task.isConfirmed = Выборка.isConfirmed;
	task.isOnDuty = Выборка.isOnDuty;
	task.isAdministrative = Выборка.isAdministrative;
	task.isPerformed = Выборка.isPerformed;
	
	//task.new = ?(argument.comm.id = "01"?, 1, 0);
	
	autor = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "managerType"));
	autor.id = Выборка.КодАвтора;
	autor.name = Выборка.НаименованиеАвтора;
	task.autor = autor;
	
	manager = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "managerType"));
	manager.id = Выборка.КодМенеджера;
	manager.name = Выборка.НаименованиеМенеджера;
	task.manager = manager;
	
	priority = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "priority"));
	priority.id 	= Выборка.ИндексПриоритета;
	priority.name 	= Выборка.ПриоритетЗадачи;
	task.priority 	= priority;
	
	detail = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "detail"));
	Вилка  = "";
	
	//Если НЕ ПараметрыСеанса.уб_ЭтоМенеджер Тогда
		detail.requestNum 	= Выборка.НомерЗаявки;
	
		Попытка
			Если Выборка.ВремяВстречиКлиент <>Дата(1,1,1) и Выборка.ВремяВстречиКлиент<>"" Тогда
				Вилка = " "+ Формат(Выборка.ВремяВстречиКлиент,"ДФ=HH:mm")+" - "+?(Выборка.ВремяОкончанияКлиент <>Дата(1,1,1) и Выборка.ВремяОкончанияКлиент<>"",Формат(Выборка.ВремяОкончанияКлиент,"ДФ=HH:mm"),"");
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		
		detail.metro 	= ?(ЗначениеЗаполнено(Выборка.СтанцияМетро),""+Выборка.СтанцияМетро,"")+Вилка;
		detail.placeMeet 	= "";//!Выборка.МестоВстречи;
		detail.mkad 		= Ложь;
		detail.isPrint 		= Ложь;
		detail.isCredit 	= Ложь;
		detail.contactName 	= Строка(Выборка.Страхователь);
		СтрокаВБСО = "";
		СобК = ПараметрыСеанса.уб_Константы.уб_СобственныйКонтрагент;
		Попытка
			Для каждого СтрокаБ из Выборка.БСО.Выгрузить() Цикл
				Если СтрокаБ.СК = СобК Тогда
					Продолжить;
				КонецЕсли;	
				СтрокаВБСО = СтрокаВБСО+""+СтрокаБ.СК+": "+СтрокаБ.ВидБСО+"; ";
			КонецЦикла;
			Если ПустаяСтрока(СтрокаВБСО) = Ложь Тогда
				СтрокаВБСО = "<BR><b>"+СтрокаВБСО+"</b>";
			КонецЕсли;	
		Исключение	
			СтрокаВБСО = ОписаниеОшибки();
		КонецПопытки;	
		detail.comment 		= Строка(Выборка.Комментарий)+СтрокаВБСО;
	//Иначе
	//	detail.requestNum = 0;
	//КонецЕсли;
	//detail.gg = "";
	//detail.background   = "ff0000";
	//detail.color        = "fff";
	task.detail 		= detail;
	
	taskType = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskType"));
	taskType.id = Выборка.ИндексТипа;
	taskType.name = Выборка.Тип;
	
	detail.taskType = taskType;
	
	
	//taskSubType. = ;
	//detail.taskSubType = ;
	
	//task_block = 
	
	task_action = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "task_action"));
	task_action.actionId = Выборка.ИндексСтатуса;
	task_action.actionTime = ТекущаяДата();
	task_action.comment = "коммент";
	//task_action.manager = ;
	task.task_action = task_action;
	task_state = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskstate"));
	task_state.id = Выборка.ИндексСостояния;
	task_state.descr = Выборка.СостояниеСтрока;
	//цвета полосок
	Прч = Перечисления.уб_СтатусыЗаявок;
	Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
		ИмяПеречисления = уб_temp.ИмяПеречисления(Выборка.Состояние);
		Если ИмяПеречисления <> Неопределено И ИмяПеречисления <> "Неопределено" Тогда
			Если ИмяПеречисления = "ЗаявкаВПечати" Тогда
				СтрокаТЗЦветов	= Новый Структура("Web","A0FFFF");
			ИначеЕсли Выборка.Состояние = Прч.ФормированиеКомплектаБСО
				 или Выборка.Состояние = Прч.НазначениеКурьера 
				 или Выборка.Состояние = Прч.БСОНаРукахУКурьера 
				 Тогда
				 //Попытка
				 //	Если Найти(Выборка.Состояния,"Возврат на доработку")>0 Тогда 
				 //   	 СтрокаТЗЦветов	= Новый Структура("Web","FF7832");
				 //	ИначеЕсли Выборка.Оператор = "" и Выборка.ПроцентГотовности <100 Тогда 
				 //   	 СтрокаТЗЦветов	= Новый Структура("Web","C8C8FF");
				 //	ИначеЕсли Выборка.ПроцентГотовности <50 Тогда
				 //   	 СтрокаТЗЦветов	= Новый Структура("Web","32C8FF");
				 //	ИначеЕсли Выборка.ПроцентГотовности <100 Тогда
				 //   	 СтрокаТЗЦветов	= Новый Структура("Web","FFFF3C");
				 //	Иначе
				 //   	 СтрокаТЗЦветов	= Новый Структура("Web","C8C8C8");
				 //	Конецесли;	
				 //Исключение
					 ТЗЦветов = уб_КЭШируемые.ЦветаСправочникаЦветов(ИмяПеречисления, Ложь);
				 	 СтрокаТЗЦветов = ТЗЦветов[0];
				 //КонецПопытки;
				 
			 Иначе
				 ТЗЦветов = уб_КЭШируемые.ЦветаСправочникаЦветов(ИмяПеречисления, Ложь);
				 Попытка
				 	СтрокаТЗЦветов = ТЗЦветов[0];
				Исключение
					СтрокаТЗЦветов = Неопределено;
				КонецПопытки;	
			КонецЕсли;
		//ИначеЕсли Выборка.Состояние = Прч.ЗаявкаВПечати Тогда
		//	 СтрокаТЗЦветов	= Новый Структура("Web","88FFFF");
			//ЦветФона = Новый Цвет(160,255,255);	
		Иначе
			СтрокаТЗЦветов = Неопределено
		КонецЕсли;
	Иначе
		СтрокаТЗЦветов = Неопределено
	КонецЕсли;
	Если СтрокаТЗЦветов <> Неопределено Тогда
		task_state.color = СтрокаТЗЦветов.Web
	Иначе
	    task_state.color = "";
	КонецЕсли;
	//Если Выборка.ИндексСостояния = 0 Тогда
		//	task_state.color = "AA0000";
		//ИначеЕсли Выборка.ИндексСостояния = 1 Тогда
		//	task_state.color = "00AA00";
		//ИначеЕсли Выборка.ИндексСостояния = 2 Тогда
		//	task_state.color = "0000AA";
		//ИначеЕсли Выборка.ИндексСостояния = 3 Тогда
		//	task_state.color = "880088";
		//ИначеЕсли Выборка.ИндексСостояния = 4 Тогда
		//	task_state.color = "444444";
		//ИначеЕсли Выборка.ИндексСостояния = 5 Тогда
		//	task_state.color = "666666";
	//Иначе
	//	task_state.color = "";
	//КонецЕсли;
	task.background   = Выборка.background;//"FF9ED9";
	task.color        = "000";
	
	task.state = task_state;
	Возврат task;
	
КонецФункции

Функция ПолучитьЭлементEmployment(Занятость)
	
	employment = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "employment"));
	employment.id = Занятость.id;
	employment.timeBegin = Занятость.timeBegin;
	employment.timeEnd = Занятость.timeEnd;
	employment.deleted = Занятость.deleted;
	employment.comment = Занятость.comment;
	Если не ПустаяСтрока(Занятость.name) Тогда
		employment.name = Занятость.name;
		employment.type = Занятость.type;
		employment.color = "rgb(" + Занятость.color + ")";
	Иначе
		employment.name = "Не заполнена занятость";
		employment.type = "нет";
		employment.color = "rgb(255,100,100)";
	КонецЕсли;
	
	Возврат employment;
	
КонецФункции

//Описание:
//	taskId			- id таска
//	deleted			- Признак удален (boolean)
//	workerID		- id сотрудника (string)
//	timeBegin		- Время начала
//	timeMeet		- Время встречи
//	timeEnd			- Время окончания
//  isAvailable		- Признак задача доступности работника
//  isConfirmed		- Признак задача подтверждена
//  isOnDuty		- Признак задача дежурства
//  isAdministrative- Признак задача ажминистративная
//	isPerformed		- Признак страховка состоялась
Функция GetMessage(beginData, lastTimeUpdate, АвторЗ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_Чат_Сообщения.ИДСообщения КАК id,
	|	уб_Чат_Сообщения.Период КАК date,
	|	уб_Чат_Сообщения.Отправитель,
	|	уб_Чат_Сообщения.Получатель,
	|	уб_Чат_Сообщения.Заголовок КАК title,
	|	уб_Чат_Сообщения.Сообщение КАК text,
	|	уб_Чат_Сообщения.НеОтображатьНаWeb КАК deleted,
	|	ВЫБОР
	|		КОГДА уб_Чат_НепрочитанныеСообщения.ИДСообщения ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК isRead
	|ИЗ
	|	РегистрСведений.уб_Чат_Сообщения КАК уб_Чат_Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_НепрочитанныеСообщения КАК уб_Чат_НепрочитанныеСообщения
	|		ПО уб_Чат_Сообщения.ИДСообщения = уб_Чат_НепрочитанныеСообщения.ИДСообщения
	|ГДЕ
	|	(НЕ уб_Чат_Сообщения.НеОтображатьНаWeb)
	|	И уб_Чат_Сообщения.Период >= &lastTimeUpdate
	|	И уб_Чат_Сообщения.Получатель = &Получатель");
	Запрос.УстановитьПараметр("lastTimeUpdate", lastTimeUpdate);
	АвторЗапроса = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо", Справочники.ФизическиеЛица.НайтиПоКоду(АвторЗ));
	Запрос.УстановитьПараметр("Получатель", АвторЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	messageList = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "messageList"));
	
	Пока Выборка.Следующий() Цикл
		message = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "message"));
		message.id = Выборка.id;
		message.date = Выборка.date;
		message.isRead = Выборка.isRead;
		message.deleted = Выборка.deleted;
		message.title = Выборка.title;
		message.text = Выборка.text;
		
		messageList.message.Добавить(message);
	КонецЦикла;
	
	beginData.messageList = messageList;
	
КонецФункции

Функция GetActiveTask(beginData, argument)
	
	ТекущийМенеджер = Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId);
	Если ТекущийМенеджер.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|ГДЕ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор = &Блокиратор");
	Запрос.УстановитьПараметр("Блокиратор", ТекущийМенеджер);
	//Если НЕ ЗначениеНеЗаполнено(argument.comm.datainc.sessionId) Тогда
	Выборка = Запрос.Выполнить().Выбрать();
	//КонецЕсли;
	
	
	Если Выборка.Следующий() Тогда
		activeTask = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskBlock"));
		activeTask.taskId = Выборка.Номер;
		
		beginData.activeTask = activeTask;
	Иначе
		
	КонецЕсли;
КонецФункции

Функция FindRequest(СтруктураЗапроса)
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Заявки.Ссылка,
	               |	Заявки.Номер КАК taskId,
	               |	Заявки.Дата КАК date,
	               |	Заявки.ВремяНачало КАК beginTime,
	               |	Заявки.Дата КАК meetTime,
	               |	Заявки.ВремяОкончания КАК endTime,
	               |	ЕСТЬNULL(Заявки.ВремяВстречиКлиент, """") КАК ВремяВстречиКлиент,
	               |	ЕСТЬNULL(Заявки.ВремяОкончанияКлиент, """") КАК ВремяОкончанияКлиент,
	               |	ЕСТЬNULL(Заявки.Менеджер.Код, """") КАК workerId,
	               |	ВЫБОР
	               |		КОГДА Заявки.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок
	               |			ТОГДА -1
	               |		ИНАЧЕ Заявки.НомерЗаявки
	               |	КОНЕЦ КАК requestNum,
	               |	Заявки.МестоВстречи КАК placeMeet,
	               |	ЕСТЬNULL(Заявки.СтанцияМетро, """") КАК СтанцияМетро,
	               |	ВЫРАЗИТЬ(Заявки.Страхователь КАК СТРОКА) КАК contactName,
	               |	ВЫРАЗИТЬ(Заявки.Комментарий КАК СТРОКА) КАК comment,
	               |	Заявки.БСО.(
	               |		Ссылка,
	               |		СК,
	               |		ВидБСО,
	               |		Оператор,
	               |		Состояние,
	               |		НомерБСО
	               |	) КАК БСО,
	               |	ЕСТЬNULL(Заявки.ПроцентГотовности, 0) КАК ПроцентГотовности,
	               |	ЕСТЬNULL(Заявки.Состояния, """") КАК Состояния,
	               |	ЕСТЬNULL(Заявки.Оператор, """") КАК Оператор
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
	               |ГДЕ
	               |	1 = 1
	               |	И НЕ Заявки.Самовыезд";
	Условия = СтруктураЗапроса.ПолучитьСписок("items");
	ДопУсловие="";
	Для каждого Условие из Условия Цикл
		Если ЗначениеЗаполнено (Условие.Value) Тогда
		Иначе
			Продолжить;
		КонецЕсли;
		Если Условие.Key = "taskId" Тогда
			Попытка
				Запрос.УстановитьПараметр("Номер",Число(Условие.Value));
				ДопУсловие = ДопУсловие+" И Заявки.Номер = &Номер";
			Исключение
			КонецПопытки;
		ИначеЕсли Условие.Key = "requestNum" Тогда
			
			Попытка
				Запрос.УстановитьПараметр("НомерЗаявки",Число(Условие.Value));
				ДопУсловие = ДопУсловие+" И Заявки.НомерЗаявки = &НомерЗаявки";
			Исключение
			КонецПопытки;
		ИначеЕсли Условие.Key = "contactName" Тогда	
			ДопУсловие = ДопУсловие+" И Выразить(Заявки.Страхователь КАК СТРОКА) ПОДОБНО (&ИмяСтрахователя)";
			Запрос.УстановитьПараметр("ИмяСтрахователя","%"+СокрЛП(Условие.Value)+"%");
		ИначеЕсли Условие.Key = "placeMeet" Тогда	
			ДопУсловие = ДопУсловие+" И Выразить(Заявки.МестоВстречи КАК СТРОКА) ПОДОБНО (&МестоВстречи)";
			Запрос.УстановитьПараметр("МестоВстречи","%"+СокрЛП(Условие.Value)+"%");
		ИначеЕсли Условие.Key = "comment" Тогда	
			ДопУсловие = ДопУсловие+" И Выразить(Заявки.Комментарий КАК СТРОКА) ПОДОБНО (&Комментарий)";
			Запрос.УстановитьПараметр("Комментарий","%"+СокрЛП(Условие.Value)+"%");
		ИначеЕсли Условие.Key = "startDate" Тогда		
			Попытка 
				Value2 = Условие.Value;
				Если Найти(Value2,"-")= 5 Тогда
					Год	  = ЧИсло(Лев(Value2,4));
					Месяц = ЧИсло(Сред(Value2,6,2));
					День  = ЧИсло(Сред(Value2,9,2));
					Дата1 = Дата (Год, Месяц,День);
				Иначе
					Дата1 = Дата(Value2);
				КонецЕсли;
				Запрос.УстановитьПараметр("НачДата",НачалоДня(Дата1));
				ДопУсловие = ДопУсловие+" И Заявки.Дата >= &НачДата";
			Исключение
			КонецПопытки;
		ИначеЕсли Условие.Key = "endDate" Тогда		
			Попытка 
				Value2 = Условие.Value;
				Если Найти(Value2,"-")= 5 Тогда
					Год   = ЧИсло(Лев(Value2,4));
					Месяц = ЧИсло(Сред(Value2,6,2));
					День  = ЧИсло(Сред(Value2,9,2));
					Дата2 = Дата (Год, Месяц,День);
				Иначе
					Дата2 = Дата(Value2);
				КонецЕсли;
				Запрос.УстановитьПараметр("КонДата",КонецДня(Дата2));
				ДопУсловие = ДопУсловие+" И Заявки.Дата <= &КонДата";
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &НачДата 
	//И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &КонДата;
	Запрос.Текст = ТекстЗапроса + ДопУсловие;
	//Запрос.УстановитьПараметр("НомерЗаявки",250605);
	//Запрос.УстановитьПараметр("НачДата",Период.startDate);
	//Запрос.УстановитьПараметр("КонДата",Период.endDate);
	Выборка = Запрос.Выполнить().Выбрать();
	result = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "findResult"));
	task_ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "tasks"));
	task_.error="";
	Всего = Выборка.Количество();
	Если Всего > 0 Тогда
		Если Всего > 10 Тогда
			task_.error = "Количество заявок в результате поиска превысило 10("+Всего+")! ";
		Иначе	
			Пока Выборка.Следующий() Цикл
				taskDetail = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskDetail"));
				
				taskDetail.taskId      = Выборка.taskId;
				//	taskDetail.date        = Выборка.date     ;
				//	taskDetail.beginTime   = Выборка.beginTime;
				taskDetail.meetTime    = Выборка.meetTime;
				//	taskDetail.endTime     = Выборка.endTime  ;
				//	taskDetail.workerId    = Выборка.workerId ;
				taskDetail.requestNum  = Выборка.requestNum;
				taskDetail.placeMeet   = Выборка.placeMeet;
				taskDetail.contactName = СокрЛП(Выборка.contactName);
				taskDetail.comment     = СокрЛП(Выборка.comment) ;
				task_.task.Добавить(taskDetail);
			КонецЦикла;
		Конецесли;
	Иначе
		task_.error ="Ничего не найдено!";
	Конецесли;
	result.result = task_;
	Возврат result;
	
КонецФункции

Функция GetAction(session_id, task_id) Экспорт
	
	СтрокаРеквизитов = уб_УСЗ.ПолучитьРеквизитыЗаявки(Число(task_id),Истина);
	
	
	ТекСтатус = СтрокаРеквизитов.Статус;//уб_УСЗ.ВернутьСтатусЗаявки (СтрокаРеквизитов.Ссылка,ТекущаяДата(),ВыборкаСтатуса);
	
	МассивРолей = ПолучитьРоли_УСЗ(session_id,СтрокаРеквизитов.Курьер);
	Интерактивные = Ложь;
	ВыводитьСообщения = Ложь;
	СписокВозможныхДействий = уб_УСЗ.ВернутьСписокДействийДляСтатуса(ТекСтатус,СтрокаРеквизитов,ВыводитьСообщения,МассивРолей,Интерактивные);
	
	actions = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "actions"));
	
	Для каждого Значение из СписокВозможныхДействий Цикл
		action = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "action"));
		action.name=Значение.Значение;
		action.descr = Значение.Представление;
		actions.actions.Добавить(action);
	КонецЦикла;
	
	Возврат actions;
	
КонецФункции

Функция SetState(session_id, task_id, state_name)
	
	СтрокаРеквизитов = уб_УСЗ.ПолучитьРеквизитыЗаявки(Число(task_id),Истина);	
	ТекСтатус = СтрокаРеквизитов.Статус;//уб_УСЗ.ВернутьСтатусЗаявки (СтрокаРеквизитов.Ссылка,ТекущаяДата(),ВыборкаСтатуса);
	МассивРолей = ПолучитьРоли_УСЗ(session_id,СтрокаРеквизитов.Курьер);
	Попытка
		Результат = уб_УСЗ.ВыполнитьДействиеПоЗаявке(СтрокаРеквизитов.Ссылка,ТекСтатус,state_name,СтрокаРеквизитов,МассивРолей);
		//СообщениеНеИсполнения = "Действие: "+state_name+" не выполнено!";
		//не является ошибкой. Если не меняется статус, то возвращает ложь
		СообщениеНеИсполнения = "Статусы не изменены";
	Исключение
		Результат = Ложь;
		СообщениеНеИсполнения = "Действие: "+state_name+" не выполнено из-за ошибки! "+ОписаниеОшибки();
	КонецПопытки;
	response = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "response"));
	response.id = ?(Результат = Истина,0,1);
	response.descr = ?(Результат = Истина, "ok", СообщениеНеИсполнения);
	Возврат response;
КонецФункции

Функция ПолучитьРоли_УСЗ(session_id,Курьер)
	
	МассивРолей = Новый Массив;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Пользователи.Ссылка,
	|	Пользователи.ФизЛицо.Ссылка Как Физлицо,
	|	Пользователи.Код
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	Пользователи.ФизЛицо,
	|	Пользователи.Ссылка");
	Запрос.УстановитьПараметр("Код",session_id);
	ВыборкаП = Запрос.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени (СокрЛП(ВыборкаП.Код));
		Если Пользователь <> Неопределено Тогда
			Роли = Пользователь.Роли;
			РольСтаршегоМенеджера = Метаданные.Роли.Найти("уб_СтаршийМенеджерНаТочке");
			Если Роли.Содержит(Метаданные.Роли.уб_МенеджерНаТочке) 
				Или (РольСтаршегоМенеджера <> Неопределено И Роли.Содержит(РольСтаршегоМенеджера))
				Тогда
				МассивРолей.Добавить("Менеджер");
				Параметры = Неопределено;
				уб_СС.ПодчиненныеРуководителя(ВыборкаП.ФизЛицо,, Параметры);
				Если Параметры.ЭтоРуководитель Тогда
					МассивРолей.Добавить("СтаршийМенеджер")
				КонецЕсли;
			КонецЕсли;
			//Если Роли.Содержит(Метаданные.Роли.уб_МенеджерНаТочке) Тогда;
			//	МассивРолей.Добавить("Менеджер");
			//КонецЕсли;
			//Если Роли.Содержит(Метаданные.Роли.уб_СтаршийМенеджерНаТочке) Тогда;
			//	МассивРолей.Добавить("Менеджер");//добавляем базовую роль
			//	МассивРолей.Добавить("СтаршийМенеджер");
			//КонецЕсли;
			Если ВыборкаП.ФизЛицо = уб_УСЗ.ПолучитьРуководителяСВС(Курьер) Тогда
				МассивРолей.Добавить("РСВС");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат МассивРолей;
	
КонецФункции	

Функция ПолучитьИмяДняНедели(Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		НомерДняДенели = ДеньНедели(ТекущаяДата());
	Иначе
		НомерДняДенели = ДеньНедели(Дата);
    КонецЕсли;
	
	Если НомерДняДенели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняДенели = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДняДенели = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДняДенели = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДняДенели = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДняДенели = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";
	КонецЕсли;
	
КонецФункции

Функция Zapros(text, parametr)
	Запрос = Новый Запрос;
	Запрос.Текст  = text;
	Попытка
	Структура = ЗначениеизСтрокиВнутр(parametr);
	Для каждого Элемент из Структура Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);
	КонецЦикла;	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ЗначениеВСтрокуВнутр(ТЗ);	
Исключение
	Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

//Функция ПреобразоватьДату(Value)
//	Если Найти(Value,"-")= 5 Тогда
//		Год = ЧИсло(Лев(Value,4));
//		Месяц = ЧИсло(Сред(Value,6,2));
//		День  = ЧИсло(Сред(Value,9,2));
//		Возврат Дата (Год, Месяц,День);
//	Иначе
//		Возврат Дата(Value);
//	КонецЕсли;
//КонецФункции
//Функция удаления таска
//	Параметры:
//Функция DeleteTask(argument)
//	Попытка
//		ЗаявкаВС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НайтиПоНомеру(argument.task.taskId).ПолучитьОбъект();
//		ЗаявкаВС.ПометкаУдаления = Истина;
//		Если ЗаявкаВС <> Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка() Тогда
//			ЗаявкаВС.Записать();
//		КонецЕсли;
//	Исключение
//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки(),,Истина, УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при удалении заявки", ,,);
//	КонецПопытки
//КонецФункции

//Функция BlockTask(argument)
//	Попытка
//		activeTask = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "taskBlock"));
//		
//		
//		Установка = argument.comm.datainc.activeTask.setBlock;
//		ЗаявкаВС = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НайтиПоНомеру(argument.comm.datainc.activeTask.taskId);
//		ТекущийМенеджер = Справочники.ФизическиеЛица.НайтиПоКоду(argument.comm.datainc.sessionId);
//		
//		Запрос = Новый Запрос("ВЫБРАТЬ
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор
//							  |ИЗ
//							  |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
//							  |ГДЕ
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор = &Блокиратор
//							  |	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Ссылка
//							  |;
//							  |
//							  |////////////////////////////////////////////////////////////////////////////////
//							  |ВЫБРАТЬ
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор,
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор.Код КАК КодБлокиратора,
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Блокиратор.Наименование КАК ИмяБлокиратора,
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер Как Номер 
//							  |ИЗ
//							  |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
//							  |ГДЕ
//							  |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = &Ссылка");
//		Запрос.УстановитьПараметр("Блокиратор", ТекущийМенеджер);
//		Запрос.УстановитьПараметр("Ссылка", ЗаявкаВС);
//		Пакеты = Запрос.ВыполнитьПакет();
//		Выборка = Пакеты[0].Выбрать();
//		Пока Выборка.Следующий() Цикл
//			Попытка
//				Заявка = Выборка.Ссылка.ПолучитьОбъект();
//				Заявка.Блокиратор = Неопределено;
//				Заявка.ОбменДанными.Загрузка = Истина;
//				Заявка.ЗАписать();
//			Исключение
//			
//			КонецПопытки;
//		КонецЦикла;
//		
//		ВыборкаТек = Пакеты[1].Выбрать();
//		Если ВыборкаТек.Следующий() Тогда
//			
//			Если НЕ ВыборкаТек.Блокиратор.Пустая() Тогда
//				Если argument.comm.datainc.activeTask.setBlock Тогда
//					taskBlock = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "task-block"));
//					activeTask.taskBlock = taskBlock;
//					taskBlock.session_id = ВыборкаТек.КодБлокиратора;
//					taskBlock.computer_name = "OMEGA";
//					taskBlock.blocked_till = ТекущаяДата()+60*20;
//					taskBlock.message = "Задача заблокирована менеджером: " + ВыборкаТек.Блокиратор;
//					managerType = ФабрикаXDTO.Тип("http://www.sample-package.org", "managerType");
//					managerType.id = ВыборкаТек.КодБлокиратора;
//					managerType.name = ВыборкаТек.ИмяБлокиратора;
//					taskBlock.manager = managerType;
//				Иначе//Если ВыборкаТек.Блокиратор = ТекущийМенеджер Тогда
//				//	//Не надо блокировать мы на нем
//				//Иначе
//					//По пустому полю
//					ОбъектДокумента = ЗаявкаВС.ПолучитьОбъект();
//					Если НЕ ОбъектДокумента.Блокиратор = Неопределено Тогда
//						ОбъектДокумента.Блокиратор = Справочники.ФизическиеЛица.ПустаяСсылка();
//						ОбъектДокумента.ОбменДанными.Загрузка = Истина;
//						ОбъектДокумента.Записать();
//					КонецЕсли;
//					//activeTask.taskId = ЗаявкаВС.Номер;
//				КонецЕсли;
//			Иначе
//				//Пустая
//				Если argument.comm.datainc.activeTask.setBlock Тогда
//					ОбъектДокумента = ЗаявкаВС.ПолучитьОбъект();
//					ОбъектДокумента.Блокиратор = ТекущийМенеджер;
//					ОбъектДокумента.ОбменДанными.Загрузка = Истина;
//					ОбъектДокумента.Записать();
//					activeTask.taskId = ВыборкаТек.Номер;
//					//activeTask.taskId = ОбъектДокумента.Номер;
//				КонецЕсли;
//			КонецЕсли;
//		Иначе
//			//
//			а=1+1;
//		КонецЕсли;
//		//Если блокиратор не заполнен
//		//Если НЕ ЗаявкаВС.Блокиратор.Пустая() Тогда
//		//	Если argument.comm.datainc.activeTask.setBlock Тогда
//		//		taskBlock = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package.org", "task-block"));
//		//		activeTask.taskBlock = taskBlock;
//		//		taskBlock.session_id = ЗаявкаВС.Блокиратор.Код;
//		//		taskBlock.computer_name = "OMEGA";
//		//		taskBlock.blocked_till = ТекущаяДата()+60*20;
//		//		taskBlock.message = "Задача заблокирована менеджером: " + ЗаявкаВС.Блокиратор;
//		//		managerType = ФабрикаXDTO.Тип("http://www.sample-package.org", "managerType");
//		//		managerType.id = ЗаявкаВС.Блокиратор.Код;
//		//		managerType.name = ЗаявкаВС.Блокиратор.Наименование;
//		//		taskBlock.manager = managerType;
//		//	Иначе
//		//		//Проверка на текущего
//		//		ОбъектДокумента = ЗаявкаВС.ПолучитьОбъект();
//		//		Если НЕ ОбъектДокумента.Блокиратор = Неопределено Тогда
//		//			ОбъектДокумента.Блокиратор = Неопределено;
//		//			ОбъектДокумента.ОбменДанными.Загрузка = Истина;
//		//			ОбъектДокумента.Записать();
//		//		КонецЕсли;
//		//		activeTask.taskId = ЗаявкаВС.Номер;
//		//	КонецЕсли;
//		//Иначе
//		//	Если argument.comm.datainc.activeTask.setBlock Тогда
//		//		ОбъектДокумента = ЗаявкаВС.ПолучитьОбъект();
//		//		Если НЕ ОбъектДокумента.Блокиратор = ТекущийМенеджер Тогда
//		//			ОбъектДокумента.Блокиратор = ТекущийМенеджер;
//		//			ОбъектДокумента.ОбменДанными.Загрузка = Истина;
//		//			ОбъектДокумента.Записать();
//		//		КонецЕсли;
//		//		activeTask.taskId = ЗаявкаВС.Номер;
//		//	КонецЕсли;
//		//КонецЕсли;

//		
//	Возврат activeTask;
//	
//	Исключение
//		Возврат activeTask;
//	КонецПопытки
//КонецФункции
