
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	#Если Клиент Тогда
	Если ДатаОтчета = Дата(1, 1, 1) Тогда
		Предупреждение("Необходимо установить дату отчета");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Предупреждение("Необходимо выбрать Подразделение");
		Возврат;
	КонецЕсли;
	#КонецЕсли 
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДСП.НомерБСО,
	|	ДСП.ВидБСО,
	|	ДСП.СК,
	|	Д.Регистратор КАК СтрПолис,
	|	ДСП.ПоложениеБСО,
	|	ДСП.СостояниеБСО,
	|	Д.Регистратор.Дата КАК Дата,
	|	Д.Регистратор.Номер КАК Номер,
	|	Д.Регистратор.ДатаМониторинга КАК ДатаМониторинга,
	|	Д.Регистратор.СК,
	|	Д.Регистратор.Страхователь КАК Страхователь,
	|	Д.Регистратор.Подразделение КАК Подразделение,
	|	Д.Регистратор.СтраховойПродукт КАК СтраховойПродукт,
	|	Д.Регистратор.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&ДатаКон,
	|			Подтверждено
	//|				И ДокПроведен
	|			) КАК ДСП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвиженияБСО КАК Д
	|		ПО ДСП.СК = Д.СК
	|			И ДСП.ВидБСО = Д.ВидБСО
	|			И ДСП.НомерБСО = Д.НомерБСО
	|			И (Д.КодОперации = ЗНАЧЕНИЕ(Перечисление.уб_КодыОперацийБСО.ОформлениеБСО))
	|ГДЕ
	|	ДСП.СостояниеБСО = ЗНАЧЕНИЕ(Перечисление.уб_СОстоянияБСО.Оформлен)
	|	И ДСП.ПоложениеБСО = ЗНАЧЕНИЕ(Перечисление.уб_ПоложенияБСО.ПереданНаТочку)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДСП.Период";
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтчета));
	РезЗапроса 	= Запрос.Выполнить();
	РезТаблица = РезЗапроса.Выгрузить();
	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтКон 	= Формат(ДатаОтчета,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечПодр		= Подразделение;
	ДокументРезультат.Вывести(Обл);
	Ном = 0;
	Выборка	= РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		Ном = Ном + 1;
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном				= Ном;
		Обл.Параметры.ДатаВыдачи		= Выборка.Дата;
		Обл.Параметры.Номер				= Выборка.Номер;
		Обл.Параметры.НомерБСО			= Выборка.НомерБСО;
		Обл.Параметры.ВидБСО			= Выборка.ВидБСО;
		Обл.Параметры.ДатаМониторинга	= Выборка.ДатаМониторинга;
		Обл.Параметры.СК	            = Выборка.СК;
		Обл.Параметры.Страхователь		= Выборка.Страхователь;
		Обл.Параметры.Подр				= Выборка.Подразделение;
		Обл.Параметры.СтрПродукт		= Выборка.СтраховойПродукт;
		Обл.Параметры.Ответственный		= Выборка.Ответственный;
		Если Не ЗначениеЗаполнено(Выборка.СтрПолис) Тогда
			// ищем, каким документом было сделано оформление
			Обл.Параметры.ЗначРасшифровки	= Выборка.НомерБСО;
		Иначе
			Обл.Параметры.ЗначРасшифровки	= Выборка.СтрПолис;
		КонецЕсли;
		ДокументРезультат.Вывести(Обл);
	КонецЦикла;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 6;
	ДокументРезультат.ФиксацияСлева		= 0;
	ДокументРезультат.Показать("Оформленные, но не сданные Страховые полисы");

КонецПроцедуры
