Перем ТекСостояниеБСО;
Перем ТекВладелецБСО;
Перем ТекПодразделение;
Перем СписокСостоянийБСО;
//Перем ВводНаОсновании Экспорт;
Перем мРежимЗаписи Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПЕЧАТИ ДОКУМЕНТА

Функция ПреобразоватьВЧисло(Стр)
	
	Если Стр = "" Тогда
		Возврат 0;
	Иначе
		Возврат Число(Стр);
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьПодписиДляСтороны(оАгент,НаДату,ППФИО,ППДляШапки,ППДляПодписи) 
	//Если подразделение - головной офис, то печатаем - от ООО ... в лице агента/сотрудника
	//	Иначе Если Агент - сотрудник, то "Субагент ООО КупиПолис ФИО"
	//	А Если Агент - Контрагент, то "Субагент ФИО "		
	
	Если ЗначениеНеЗаполнено(оАгент) Тогда
		ППФИО = "";
		ППДляШапки = "Субагент " + ППФИО;
		ППДляПодписи = "Субагент:";
		Возврат;	
	КонецЕсли;	
	
	Если ТипЗнч(оАгент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если оАгент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			// Контрагент - ЮрЛицо
			ППОрганизация = оАгент.НаименованиеПолное;
			Если ЗначениеНеЗаполнено(оАгент.ОсновноеКонтактноеЛицо) Тогда
				ППФИО = "";
				ППДляШапки = ППОрганизация;
			Иначе	
				ППФИО = оАгент.ОсновноеКонтактноеЛицо.Наименование;
				ППДляШапки = ППОрганизация + (?(ППОрганизация = "","",", ")) + ППФИО;
			КонецЕсли;
			ППДляПодписи = ППОрганизация + (?(ППОрганизация = "","",": "));
		Иначе
			//Контрагент - Физлицо
			ППФИО = оАгент.Наименование;
			ППДляШапки = "Субагент " + ППФИО;
			ППДляПодписи = "Субагент: ";
		КонецЕсли;
		
		
	ИначеЕсли ТипЗнч(оАгент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		ППФИО = уб_СС.ПрочитатьФИОФизЛица(оАгент);
		
		оПодразделение = уб_СС.ПолучитьПодразделениеАгента(оАгент, НаДату, Истина);
		
		Если оПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			ППОрганизация = оПодразделение.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов;
			ППДляШапки = ППОрганизация + (?(ППОрганизация = "","",", "))+ ППФИО;
			ППДляПодписи = ППОрганизация + (?(ППОрганизация = "","",": "));
		Иначе
			ППДляШапки = "Субагент " + ППФИО;
			ППДляПодписи = "Субагент: ";
		КонецЕсли;
				
	ИначеЕсли ТипЗнч(оАгент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		оПодразделение = оАгент;
		ППОрганизация = оПодразделение.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов;
		ПППодразделение = оПодразделение.Наименование;
		
		ППДляШапки = ППОрганизация + ", подразделение """ + ПППодразделение + """";
		ППДляПодписи = "От " + ПППодразделение + " " + ППОрганизация;
		
		Если оПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			ППФИО = уб_СС.ПрочитатьФИОФизЛица(оПодразделение.МОЛпоБСО);
		Иначе
			ППФИО = "/___________________________/";
		КонецЕсли;
				
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция МожноПроводитьДокумент() Экспорт

	Возврат Истина;
	
	//Реанимироать про подключении прав
	
	//Если УчетБСОПоВсемПодразделениям Тогда
	//	Возврат Истина;
	//Иначе
	//	Если ПодразделениеКуда = уб_СтраховойБрокер.ПолучитьТочкуПродаж(ОсновноеПодразделение) Тогда
	//		Возврат Истина;
	//	Иначе
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("СозданНаОсновании");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
	//	ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	мРежимЗаписи = РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	 или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
	Тогда
		Если НЕ МожноПроводитьДокумент() Тогда
			Отказ = Истина;
			тОперация = ?(РежимЗаписи = РежимЗаписиДокумента.Проведение, "проведение", "отмену проведения");
			Сообщить("Нет прав на "+тОперация+" документа");
		КонецЕсли;
	КонецЕсли;
    Заголовок = "Запись документа """ + СокрЛП(Ссылка) + """: ";
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Клиент Тогда
		Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
			ОчиститьСообщения()
		КонецЕсли;
	#КонецЕсли
	
	Заголовок = "Запись документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("СозданНаОсновании");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Не Проведен Тогда
		
	КонецЕсли;	

	Если Не Отказ И Не Проведен Тогда
		//ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
	Если Отказ и мРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Отказ = Ложь;
		Возврат;
	КонецЕсли;	
	
	// Вариант, если не хотим, что бы в регистре были помеченные на удаление
	//Если Не Отказ И Не Проведен И НЕ Ссылка.ПометкаУдаления Тогда
	//	ДвиженияПоРегистрам(Отказ, Заголовок);
	//ИначеЕсли Не Проведен И Ссылка.ПометкаУдаления Тогда	
	//	Движения.уб_ДвиженияБСО.Очистить();
	//	Движения.уб_ДвиженияБСО.Записать();
	//КонецЕсли;	

КонецПроцедуры

Процедура ПриИзмененииКонтрагентаУведомляемого() Экспорт
	
	ОрганизацияАгент = СозданНаОсновании.ОрганизацияАгент;

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Должность,
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Наименование,
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Фамилия,
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Имя,
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо.Отчество
	|ИЗ
	|	РегистрСведений.уб_ПараметрыДоговоровИОтчетов.СрезПоследних(
	|			&ДатаСреза,
	|			ОрганизацияАгент = &ОрганизацияАгент
	|				И Поставщик = &Поставщик) КАК уб_ПараметрыДоговоровИОтчетовСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза",Дата);
	Запрос.УстановитьПараметр("ОрганизацияАгент",ОрганизацияАгент);
	Запрос.УстановитьПараметр("Поставщик", КонтрагентУведомляемый);

	Выборка = Запрос.Выполнить().Выбрать();
	ДолжностьУведомляемого = "";
	ФИОУведомляемого	   = "";
	Если Выборка.Следующий() Тогда
		
		ФИО = СокрЛП(Выборка.КонтактноеЛицоФамилия + " " +  Выборка.КонтактноеЛицоИмя + " " + Выборка.КонтактноеЛицоОтчество);
		Если ПустаяСтрока(ФИО) Тогда
			ФИОУведомляемого = Выборка.КонтактноеЛицоНаименование;
		Иначе
			ФИОУведомляемого = ФИО;
		КонецЕсли;
		ДолжностьУведомляемого = Выборка.КонтактноеЛицоДолжность;
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаполнитьНаОснованииПолиса() Экспорт
	
//
Если ТипЗнч(СозданНаОсновании)= Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_СтраховойПолисБСО.НомерБСО
	                      |ИЗ
	                      |	Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	                      |ГДЕ
	                      |	уб_СтраховойПолисБСО.Ссылка = &Ссылка
	                      |	И уб_СтраховойПолисБСО.ВидБСО.Тип В(&Тип)");
						  Запрос.УстановитьПараметр("Ссылка",СозданНаОсновании);
						  ТипыБСО = Новый Массив;
						  ТипыБСО.Добавить(Перечисления.уб_ТипыБСО.Полис);
						  ТипыБСО.Добавить(Перечисления.уб_ТипыБСО.ПолисОсаго);
						  
						  Запрос.УстановитьПараметр("Тип",ТипыБСО);
	МассивПолисов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерБСО");					  
	
	Если МассивПолисов.Количество()>0 Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ДвиженияБСОСрезПоследних.Поставщик
		               |ИЗ
		               |	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
		               |			,
		               |			НомерБСО = &НомерБСО
		               |				И СК = &СК) КАК уб_ДвиженияБСОСрезПоследних";
		Запрос.УстановитьПараметр("НомерБСО", МассивПолисов[0]);
		Запрос.УстановитьПараметр("СК", СозданНаОсновании.СК);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КонтрагентУведомляемый = Выборка.Поставщик; 
		КонецЕсли;	
	Иначе
		КонтрагентУведомляемый = СозданНаОсновании.СК; 
	КонецЕсли;	
	
						  
	
	ПриИзмененииКонтрагентаУведомляемого();
		
КонецЕсли;	
КонецПроцедуры	
	
Процедура ОбработкаЗаполнения(Основание)
	
	//ВводНаОсновании = Истина;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		//
		ЗапросПроверка = Новый Запрос("ВЫБРАТЬ
		|	уб_УведомлениеОДосрочномПрекращенииДействияДоговора.Ссылка
		|ИЗ
		|	Документ.уб_УведомлениеОДосрочномПрекращенииДействияДоговора КАК уб_УведомлениеОДосрочномПрекращенииДействияДоговора
		|ГДЕ
		|	уб_УведомлениеОДосрочномПрекращенииДействияДоговора.СозданНаОсновании = &СозданНаОсновании");
		ЗапросПроверка.УстановитьПараметр("СозданНаОсновании", Основание);
		Результат = ЗапросПроверка.Выполнить();
		Если Результат.Пустой() Тогда
			
			//   уб_temp.ДайРодительскийДокумент(Основание);
			// Заполнение шапки
			СозданНаОсновании = Основание;
			Менеджер =ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
			ЗаполнитьНаОснованииПолиса();
		Иначе
			#Если Клиент Тогда
			Предупреждение ("Уже есть созданное уведомление. Откройте по ссылке на закладке ""Оплаты"".");
			#КонецЕсли
			СозданНаОсновании = Документы.уб_УведомлениеПоставщикаОбУтратеБСО.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

