
Функция Лимиты(ФизическоеЛицо = Неопределено, Параметры  = Неопределено ) Экспорт
	Если Параметры = Неопределено Тогда
		Параметры = ЛимитыПараметры();
	КонецЕсли;	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	уб_ЛимитыНаРуках.Объект,
	               |	уб_ЛимитыНаРуках.ВидСП,
	               |	уб_ЛимитыНаРуках.Количество,
	               |	уб_ЛимитыНаРуках.Сумма,
	               |	уб_ЛимитыНаРуках.Дней
	               |ПОМЕСТИТЬ Лимиты
	               |ИЗ
	               |	РегистрСведений.уб_ЛимитыНаРуках КАК уб_ЛимитыНаРуках
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФизлицаВидыСП.Ссылка,
	               |	ФизлицаВидыСП.Подразделение,
	               |	ФизлицаВидыСП.ВидСП,
	               |	Лимиты.Объект,
	               |	ЕСТЬNULL(Лимиты.Количество, ЕСТЬNULL(ЛимитыПодразделения.Количество, 0)) КАК КоличествоФакт,
	               |	ЕСТЬNULL(Лимиты.Сумма, ЕСТЬNULL(ЛимитыПодразделения.Сумма, 0)) КАК СуммаФакт,
	               |	ЕСТЬNULL(Лимиты.Дней, ЕСТЬNULL(ЛимитыПодразделения.Дней, 0)) КАК ДнейФакт,
	               |	Лимиты.Количество,
	               |	Лимиты.Сумма,
	               |	Лимиты.Дней,
	               |	ЛимитыПодразделения.Количество КАК КоличествоПодразделение,
	               |	ЛимитыПодразделения.Сумма КАК СуммаПодразделение,
	               |	ЛимитыПодразделения.Дней КАК ДнейПодразделение
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ФизическиеЛица.Ссылка КАК Ссылка,
	               |		уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение КАК Подразделение,
	               |		ВидыСП.Ссылка КАК ВидСП
	               |	ИЗ
	               |		Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |			ПО (уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент = ФизическиеЛица.Ссылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.уб_ВидыСтраховыхПродуктов КАК ВидыСП
	               |			ПО (ИСТИНА)
	               |	ГДЕ
	               |		1 = 1) КАК ФизлицаВидыСП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Лимиты КАК Лимиты
	               |		ПО ФизлицаВидыСП.ВидСП = Лимиты.ВидСП
	               |			И ФизлицаВидыСП.Ссылка = Лимиты.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Лимиты КАК ЛимитыПодразделения
	               |		ПО ФизлицаВидыСП.ВидСП = ЛимитыПодразделения.ВидСП
	               |			И ФизлицаВидыСП.Подразделение = ЛимитыПодразделения.Объект";
	ЭтоФизлицо	    = НЕ ФизическоеЛицо = Неопределено;
	Если ЭтоФизлицо Тогда
		Запрос.УстановитьПараметр("Ссылка",ФизическоеЛицо);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"1 = 1","ФизическиеЛица.Ссылка = &Ссылка");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ЭтоФизлицо Тогда
		Соответствие = Новый Соответствие;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Параметры.БезНулевых = Истина Тогда
				Если Выборка.КоличествоФакт=0 и Выборка.СуммаФакт=0 и Выборка.ДнейФакт=0 Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			
			Соответствие.Вставить(Выборка.ВидСП,Новый Структура("Количество,Сумма,Дней",Выборка.КоличествоФакт,Выборка.СуммаФакт,Выборка.ДнейФакт));
		КонецЦикла; 
		Возврат Соответствие;
		
	КонецЕсли;	
	Возврат Ложь;
КонецФункции	

Функция ЛимитыПараметры() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("БезНулевых",Ложь);
	Возврат  Параметры
КонецФункции	