//
Функция ТекущийГрафикСотрудника(Сотрудник,ДопУсловие,ТекДата) Экспорт
	
	Ответ = Новый Структура("ВремяНачала,ДатаНачала,ДатаОкончания,Вид",Дата(1,1,1),Дата(1,1,1),Дата(1,1,1),Справочники.уб_ТипЗанятостиВС.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ЗанятостьВС.Агент,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ уб_ЗанятостьВС.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ уб_ЗанятостьВС.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	уб_ЗанятостьВС.ТипЗанятости,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ уб_ЗанятостьВС.ВремяНачала
	               |	КОНЕЦ КАК ВремяНачала,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ уб_ЗанятостьВС.ВремяОкончания
	               |	КОНЕЦ КАК ВремяОкончания,
	               |	уб_ЗанятостьВС.ТипЗанятости.Наименование КАК Наименование,
	               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие
	               |ИЗ
	               |	РегистрСведений.уб_ЗанятостьВС КАК уб_ЗанятостьВС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Дата, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |		ПО уб_ЗанятостьВС.Агент = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	               |ГДЕ
	               |	уб_ЗанятостьВС.Агент = &Агент
	               |	И уб_ЗанятостьВС.ДатаНачала <= &Дата
	               |	И уб_ЗанятостьВС.ДатаОкончания >= &Дата"+ДопУсловие+"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("Агент",	Сотрудник);
	
	Запрос.УстановитьПараметр("Дата",	ТекДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НачалоДня(Выборка.ДатаНачала) = НачалоДня(Выборка.ДатаОкончания) и не Выборка.Наименование = "Отпуск" Тогда
			
			//Корректировка
			Ответ.ВремяНачала = Выборка.ВремяНачала;
			Ответ.Вид = Выборка.ТипЗанятости;
		Иначе
			Ответ.ДатаНачала = Выборка.ДатаНачала;
			Ответ.ДатаОкончания = Выборка.ДатаОкончания;
			Если Ответ.ВремяНачала = Дата(1,1,1) Тогда 
				Ответ.ВремяНачала = Выборка.ВремяНачала;
			КонецЕсли;	
			Ответ.Вид = Выборка.ТипЗанятости;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ответ;
	
	
		
	
	
КонецФункции	

Функция ДанныеЖурнала(Знач ТекДата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	журналСобытий.Ссылка,
	                |	журналСобытий.ВерсияДанных,
	                |	журналСобытий.ПометкаУдаления,
	                |	журналСобытий.Предопределенный,
	                |	журналСобытий.Событие,
	                |	журналСобытий.Дата,
	                |	журналСобытий.Пользователь,
	                |	журналСобытий.Информация,
	                |	журналСобытий.Объект
	                |ПОМЕСТИТЬ Журналы
	                |ИЗ
	                |	Справочник.журналСобытий КАК журналСобытий
	                |ГДЕ
	                |	журналСобытий.Дата >= &Дата1
	                |	И журналСобытий.Дата <= &Дата2
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 20000
	                |	журналы.Пользователь.ФизЛицо,
	                |	журналы.Пользователь,
	                |	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение
	                |ПОМЕСТИТЬ ФИО
	                |ИЗ
	                |	Журналы КАК журналы
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	                |		ПО журналы.Пользователь.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	                |		ПО журналы.Пользователь.ФизЛицо = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Фамилия
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
					|  Журналы.Пользователь,
					|  НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ) КАК День,
					|  //Журналы.Событие,
					|  МИНИМУМ(Журналы.Дата) КАК Вход
					|ПОМЕСТИТЬ ВХОД
					|ИЗ
					|  Журналы КАК Журналы
					|ГДЕ
					|	Час(Журналы.Дата)>4 или
					|	Журналы.Событие = ЗНАЧЕНИЕ(Справочник.ВидСобытия.Вход)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Журналы.Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ)//,
	               // |	Журналы.Событие
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Журналы.Пользователь КАК Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ) КАК День,
	                |	МАКСИМУМ(Журналы.Дата) КАК Выход
	                |ПОМЕСТИТЬ ПоследняяАктивность
	                |ИЗ
	                |	Журналы КАК Журналы
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Журналы.Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ФИО.ПользовательФизЛицо,
	                |	ФИО.Пользователь,
	                |	ФИО.Фамилия,
	                |	ФИО.Выбытие,
	                |	ФИО.Подразделение,
	                |	ПерваяАктивность.Вход,
	                |	ПоследняяАктивность.Выход,
	                |	РАЗНОСТЬДАТ(ПерваяАктивность.Вход, ПоследняяАктивность.Выход, ЧАС) КАК ЧасовРаботы
	                |ИЗ
	                |	ФИО КАК ФИО
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВХОД КАК ПерваяАктивность
	                |		ПО ФИО.Пользователь = ПерваяАктивность.Пользователь
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяАктивность КАК ПоследняяАктивность
	                |		ПО ФИО.Пользователь = ПоследняяАктивность.Пользователь";
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекДата));
	Возврат Запрос.выполнить().Выгрузить();
КонецФункции	

Функция ВидДня(Знач Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	               |	РегламентированныйПроизводственныйКалендарь.Год,
	               |	РегламентированныйПроизводственныйКалендарь.Пятидневка,
	               |	РегламентированныйПроизводственныйКалендарь.Шестидневка,
	               |	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
	               |	РегламентированныйПроизводственныйКалендарь.ВидДня
	               |ИЗ
	               |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	               |ГДЕ
	               |	РегламентированныйПроизводственныйКалендарь.Год = &ГОД
	               |	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &Дата";
	Запрос.УстановитьПараметр("Год",Год(Дата));
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидДня
	Иначе
		Возврат Перечисления.ВидыДнейПроизводственногоКалендаря.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции	

Функция УсловиеДляДняНедели(Знач ТекДата) Экспорт
	ТекДень = ДеньНедели(ТекДата);
	ДопУсловие = "";
	Если ТекДень = 1 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Понедельник = Истина";
	ИначеЕсли ТекДень = 2 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Вторник = Истина";
	ИначеЕсли ТекДень = 3 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Среда = Истина";
	ИначеЕсли ТекДень = 4 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Четверг = Истина";
	ИначеЕсли ТекДень = 5 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Пятница = Истина";
	ИначеЕсли ТекДень = 6 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Суббота = Истина";
	ИначеЕсли ТекДень = 7 Тогда
		 ДопУсловие = " И уб_ЗанятостьВС.Воскресенье = Истина";
	 КонецЕсли; 
	 Возврат ДопУсловие;
КонецФункции