Перем ПараметрыОбмена Экспорт;
Перем ПроизводственныйКалендарь Экспорт;

Процедура ВыполнитьОбработку() Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	Если Час(ТекущаяДата())<23 и КонецДня(ПараметрыОбмена.Дата1)= КонецДня(ТекущаяДата()) Тогда
		Сообщить("За сегодня штрафы начисляются после 23");
		Возврат;
	КонецЕсли;	
	
	
	НачислитьШтрафы(ПараметрыОбмена.Дата1);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуПериода(Дата1,Дата2) Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(дата1) = Ложь Тогда
		Сообщить("Не задана дата начала");
		возврат;
	конецесли;	
	
	Если ЗначениеЗаполнено(дата2) = Ложь Тогда
		Сообщить("Не задана дата окончания");
		Возврат;
	конецесли;	
	ТекДата = КонецДня(Дата1);
	КонецОбработки = КонецДня(Дата2);
	КонецЭтогоДня = КонецДня(ТекущаяДата());
	ВремяОбработки = Час(ТекущаяДата());
	Пока ТекДата<=КонецОбработки Цикл
		
		ПараметрыОбмена.Дата1 = ТекДата;
		
		//Если ВремяОбработки<23 и ТекДата >= КонецЭтогоДня Тогда
		//	Сообщить("За сегодня штрафы начисляются после 23");
		//	Возврат;
		//КонецЕсли;	
		
		НачислитьШтрафы(ПараметрыОбмена.Дата1);
		ТекДата = КонецДня(ТекДата+1);
	КонецЦикла;
	
КонецПроцедуры





Процедура ИнициализироватьПараметры() Экспорт 
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("Дата1",КонецДня(ТекущаяДата()));
	ПараметрыОбмена.Вставить("Период",ТекущаяДата());

	//ПараметрыОбмена.Вставить("Дата2",ТекущаяДата());
КонецПроцедуры	


Функция НачислитьШтрафы(ЗарплатныйПериод) Экспорт
	
	Если ЗарплатныйПериод<Дата(2019,3,1) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыОбмена = Неопределено Тогда
		//
		ИнициализироватьПараметры();
	КонецЕсли;	
	
	ОбновитьПроизводственныйКалендарь (ЗарплатныйПериод);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник,
	               |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра,
	               |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра КАК Штраф,
	               |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Период, уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Период) КАК ДатаВПриема,
	               |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ИСТИНА) КАК ВыбылНачало,
	               |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Выбытие, ИСТИНА) КАК ВыбылКонец,
	               |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Подразделение, уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение) КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(
	               |			&Дата,
	               |			ТипПараметра = ""Начислять штраф за опаздание""
	               |				ИЛИ ТипПараметра = ""Начислять штраф за опаздание в план"") КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Дата, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |		ПО уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних2
	               |		ПО уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Агент
	               |ГДЕ
	               |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0";
				   //|	И Isnul(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,Истина) = Ложь
				   //|	И Isnul(уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Выбытие,Истина) = Ложь";
	Запрос.УстановитьПараметр("Дата",ЗарплатныйПериод);
	
	
	ГрафикСотрудников = Обработки.ГрафикСотрудников;
	
	//ВидДня        = ГрафикСотрудников.ВидДня(ЗарплатныйПериод);
	//ДанныеЖурнала = ГрафикСотрудников.ДанныеЖурнала(ЗарплатныйПериод);
	
	сШтрафО  = СПравочники.уб_ШтрафныеСанкции.НайтиПоКоду(5);
	Если сШтрафО.Пустая() Тогда
		сШтрафО  = СПравочники.уб_ШтрафныеСанкции.НайтиПоКоду("За опоздание на работу");
	КонецЕсли;	
	Если сШтрафО.Пустая() Тогда
		Сообщить("Не найден штраф за опазадание, сообщите разработчикам, автоматческое начисление невозможно");
		Возврат Ложь;
	КонецЕсли;
	сШтрафПлан = Справочники.уб_ШтрафныеСанкции.ШтрафнойПлан;
	
	//ЭтоПраздник = ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
	Учтенные = Новый Массив;
	
	ДопУсловие = "";//Обработки.ГрафикСотрудников.УсловиеДляДняНедели(ТекДата);
	
	//Выгрузить().ВыгрузитьКолонку("Сотрудник");
	//Для каждого Сотрудник из МассивСотрудников Цикл
	
	
	ВсегоДней = День(КонецМесяца(ЗарплатныйПериод));
	ТекДень   = День(ТекущаяДата());
	Если НачалоМесяца(ЗарплатныйПериод) = НачалоМесяца(ТекущаяДата()) Тогда
		ТекДень = День(ТекущаяДата());
	ИначеЕсли НачалоМесяца(ЗарплатныйПериод)<НачалоМесяца(ТекущаяДата()) Тогда
		ТекДень = ВсегоДней;
	Иначе	
		ТекДень = 0;
	КонецЕсли;	
	
	
	Год       = Год(ЗарплатныйПериод);
	Месяц     = Месяц(ЗарплатныйПериод);
	МаксДата = НачалоДня(НачалоДня(ТекущаяДата())-1);
	ДанныеЖурнала = ДанныеЖурнала(ЗарплатныйПериод);
	
	ВыборкаСотрудников = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСотрудников.Следующий() Цикл
		Если ВыборкаСотрудников.ВыбылНачало = Истина и 
			ВыборкаСотрудников.ВыбылКонец = Истина  Тогда
			Продолжить;
		КонецЕсли;	
		
		
		Сотрудник = ВыборкаСотрудников.Сотрудник;
		
		Если Не Учтенные.Найти(Сотрудник) = Неопределено Тогда
			//Уже обработанный сотрудник, такого не должно быть
			Продолжить;
		КонецЕсли;
		
		ГрафикСотрудника = ТекущийГрафикСотрудника(Сотрудник,ДопУсловие,ЗарплатныйПериод);
		
		Учтенные.Добавить(Сотрудник);
		
		СтруктураСотрудник = Новый Структура("Сотрудник,День1,День2,День3,День4,День5,День6,День7,День8,День9,День10,
		|День11,День12,День13,День14,День15,День16,День17,День18,День19,День20,
		|День21,День22,День23,День24,День25,День26,День27,День28,День29,День30,День31,
		|Факт1,Факт2,Факт3,Факт4,Факт5,Факт6,Факт7,Факт8,Факт9,Факт10,
		|Факт11,Факт12,Факт13,Факт14,Факт15,Факт16,Факт17,Факт18,Факт19,Факт20,
		|Факт21,Факт22,Факт23,Факт24,Факт25,Факт26,Факт27,Факт28,Факт29,Факт30,Факт31",Сотрудник);
		ЗаполнитьинформациюПосотруднику(СтруктураСотрудник,ГрафикСотрудника,ДанныеЖурнала,ВсегоДней,Год,Месяц,ТекДень);
		
		
		
		
		СчетчикДо20 = 0;
		СчетчикДо10 = 0;
		ДатаВПриема = ВыборкаСотрудников.ДатаВПриема;
		Для Счетчик = 1 по ВсегоДней Цикл
			ТекДата = Дата(Год,Месяц,Счетчик);
			Если ТекДата<ДатаВПриема Тогда
				//еще не приняли
				
				Комментарий = "Перерасчет";
				СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафО,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				ПериодСуществующейЗаписи = Неопределено;
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Удалить();
					//Запись.Записать();
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	
				СтруктураШтрафа.Вставить("Штраф",сШтрафПлан);
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Удалить();
					//Запись.Записать();
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	
				Продолжить;
			КонецЕсли;	
			
			//Если ТекДата>=МаксДата Тогда
			Если ТекДата>=ТекущаяДата() Тогда
				СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафО,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				ПериодСуществующейЗаписи = Неопределено;
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Удалить();
					//Запись.Записать();
					//ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	
				СтруктураШтрафа.Вставить("Штраф",сШтрафПлан);
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Удалить();
					//Запись.Записать();
					//ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	

				Продолжить;
			КонецЕсли;	
			
			
			ДатаПлан = СтруктураСотрудник["День"+Счетчик];
			Если Не ТипЗНЧ(ДатаПлан) = Тип("Дата") Тогда
				ДатаПлан = Дата(1,1,1);
			КонецЕсли;	
			
			ТекШтраф = 0;
			ТекШтраФПлан = 0;
			Если ДатаПлан<>Дата(1,1,1) Тогда
				ДатаФакт = СтруктураСотрудник["Факт"+Счетчик];
				Если ДатаФакт = Неопределено или ДатаФакт = Дата(1,1,1) Тогда
					Опаздание = 4*60;
				Иначе	
					Опаздание = Цел((ДатаФакт - ДатаПлан)/60);
					Если Опаздание<0 Тогда
						Опаздание = 0;
					Иначе
						Опаздание = Мин(4*60,Опаздание);
					КонецЕсли;	
				КонецЕсли;	
				
				Если Опаздание = 0 Тогда
				Иначе	
					
					
					Если Найти(ВыборкаСотрудников.Подразделение, "ОП-")>0 Тогда
						
						//1. Первые 3 опоздания до 20 мин за календарный месяц - бесплатно, 
						//   свыше 20 минут 2000 рублей в план каждые 15 мин
						//2. Последующие 3 опоздания свыше 10 мин за календарный месяц - 2000 руб в план /15 мин
						//3. Начиная с 7-ого опоздания свыше 10 мин идет штраф 300 рублей в зарплату каждые 15 минут
						//4. Графики выставляются Руководителем отдела максимум за сутки. 
						//Снять полученные менеджером штрафы он не может
						Если СчетчикДо20<4 Тогда
							СчетчикДо20 = СчетчикДо20+1;
							Если Опаздание<=20 Тогда
							Иначе	
								ТекШтраФПлан = 2000*Цел((Опаздание-20)/15);
							КонецЕсли;	
						Иначе
							Если СчетчикДо10<4 Тогда
								СчетчикДо10 = СчетчикДо10+1;
								Если Опаздание<=10 Тогда
								Иначе	
									ТекШтраФПлан = 2000*Цел((Опаздание-10)/15);
								КонецЕсли;
							Иначе
								Если Опаздание<=10 Тогда
								Иначе	
									ТекШтраф = 300*Цел((Опаздание-10)/15);
								КонецЕсли;
								
							КонецЕсли;	
						КонецЕсли;	
						//	
					Иначе	
						//
						Если ВыборкаСотрудников.ТипПараметра = "Начислять штраф за опаздание" Тогда
							ТекШтраф = ВыборкаСотрудников.Штраф;
						Иначе
							ТекШтраФПлан = ВыборкаСотрудников.Штраф;
						КонецЕсли;	
						//ТекШтраф = ВыборкаСотрудников.Штраф;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
			Если ТекШтраф>0.1 Тогда
				Сообщить(""+Сотрудник+" "+Формат(ТекДата,"ДФ=dd.MM.yyyy") +" Рубли: "+ТекШтраф+" Опаздание: "+Опаздание);
				Комментарий = "Вход "+?(ДатаФакт = Дата(1,1,1),"отсутствует","в "+Формат(ДатаФакт,"ДФ=HH:mm:ss"))+" вместо "+Формат(ДатаПлан,"ДФ=HH:mm");
			    СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафО,ТекШтраФ,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				ПериодСуществующейЗаписи = Неопределено;
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Ложь Тогда
					//	//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					//	//НачатьТранзакцию();
					Запись.Записать(Истина);
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//	//ОтменитьТранзакцию();
				КонецЕсли;	
			Иначе
				Комментарий = "Перерасчет";
				СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафО,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				ПериодСуществующейЗаписи = Неопределено;
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Записать();
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	

			КонецЕсли;	
			Если ТекШтраФПлан>0.1 Тогда
				Сообщить(""+Сотрудник+" "+Формат(ТекДата,"ДФ=dd.MM.yyyy") +" План: "+ТекШтраФПлан+" Опаздание: "+Опаздание);
				Комментарий = "Вход "+?(ДатаФакт = Дата(1,1,1),"отсутствует","в "+Формат(ДатаФакт,"ДФ=HH:mm:ss"))+" вместо "+Формат(ДатаПлан,"ДФ=HH:mm");
			    СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафПлан,ТекШтраФПлан,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Ложь Тогда
					//	//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					//	//НачатьТранзакцию();
					Запись.Записать(Истина);
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//	//ОтменитьТранзакцию();
				КонецЕсли;	
			Иначе
				СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,сШтрафПлан,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
				ПериодСуществующейЗаписи = Неопределено;
				Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
					//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
					Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
					Запись.Период = ПериодСуществующейЗаписи;
					
					//НачатьТранзакцию();
					Запись.Записать();
					ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
					//ОтменитьТранзакцию();
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;	
			
		//Если ЭтоПраздник Тогда
		//	Ответ = Новый Структура("ВремяНачала,ДатаНачала,ДатаОкончания,Вид",Дата(1,1,1),Дата(1,1,1),Дата(1,1,1),Справочники.уб_ТипЗанятостиВС.ПустаяСсылка());
		//Иначе	
		//	Ответ = ГрафикСотрудников.ТекущийГрафикСотрудника(Сотрудник,ДопУсловие,ТекДата);
		//КонецЕсли;
		//
		//ФактическийПриход = Дата(1,1,1);
		//Если Ответ.ВремяНачала = ФактическийПриход Тогда
		//	//выходной или праздник
		//	Комментарий = "Праздник";
		//	СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
		//		Сотрудник,ТекШтраф,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
		//	ПериодСуществующейЗаписи = Неопределено;
		//	Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
		//		//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
		//		Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
		//		ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
		//		Запись.Период = ПериодСуществующейЗаписи;
		//	
		//		//НачатьТранзакцию();
		//		Запись.Записать();
		//		ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
		//		//ОтменитьТранзакцию();
		//	КонецЕсли;	
		//	Продолжить;
		//КонецЕсли;	
		//	
		//нСтроки = ДанныеЖурнала.НайтиСтроки(НОвый Структура("ПользовательФизЛицо",Сотрудник));
		//
		//	
		//Для каждого СтрокаЖ из нСтроки Цикл
		//	ФактическийПриход = СтрокаЖ.Вход-(НачалоДня(ТекДата)-Дата(1,1,1));
		//	Прервать;
		//КонецЦикла;	
		//Сообщить(Сотрудник);
		////Сообщить(Ответ.ДатаНачала);
		//Сообщить(Ответ.ВремяНачала);
		//Сообщить(ФактическийПриход);
		СекундПросрочки = 60;
		
		//Если (ФактическийПриход-Ответ.ВремяНачала)>СекундПросрочки или ФактическийПриход = Дата(1,1,1) Тогда
		//	ШтрафСотруднику = ВыборкаСотрудников.Штраф;
		//Иначе
			ШтрафСотруднику = 0;
		//КонецЕсли;
		
		Если ШтрафСотруднику >0 Тогда
			////Сообщить("Штраф: "+ШтрафСотруднику);
			//Комментарий = "Вход "+?(ФактическийПриход = Дата(1,1,1),"отсутствует","в "+Формат(ФактическийПриход,"ДФ=HH:mm:ss"))+" вместо "+Формат(Ответ.ВремяНачала,"ДФ=HH:mm");
			//СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",Сотрудник,ТекШтраф,ШтрафСотруднику,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
			//Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Ложь Тогда
			//	//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
			//	Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
			//	ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
			//	//НачатьТранзакцию();
			//	Запись.Записать(Истина);
			//	ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
			//	//ОтменитьТранзакцию();
			//КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции
Функция ЕстьШтраф(Структура,Период = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ШтрафыСрезПоследних.Период,
	               |	уб_ШтрафыСрезПоследних.Физлицо,
	               |	уб_ШтрафыСрезПоследних.Штраф,
	               |	уб_ШтрафыСрезПоследних.ДатаШтрафа
	               |ИЗ
	               |	РегистрСведений.уб_Штрафы КАК уб_ШтрафыСрезПоследних
	               |ГДЕ
	               |	уб_ШтрафыСрезПоследних.ДатаШтрафа = &ДатаШтрафа
	               |	И уб_ШтрафыСрезПоследних.Физлицо = &Физлицо
	               |	И уб_ШтрафыСрезПоследних.Штраф = &Штраф";
	Запрос.УстановитьПараметр("ДатаШтрафа", Структура.ДатаШтрафа);
	Запрос.УстановитьПараметр("Штраф",      Структура.Штраф);
	Запрос.УстановитьПараметр("Физлицо",    Структура.Физлицо);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		Период = Выборка.Период;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	


Функция НачислитьШтрафыСтрая(ТекДата) Экспорт
	
	Если ТекДата<Дата(2017,9,28) 
		или ТекДата>Дата(2019,3,1) 
		Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник,
	|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра,
	|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра как Штраф
	|ИЗ
	|	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&Дата, ТипПараметра = ""Начислять штраф за опаздание"" или ТипПараметра = ""Начислять штраф за опаздание в план"") КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
	|ГДЕ
	|	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0";
	Запрос.УстановитьПараметр("Дата",ТекДата);
	
	
	ГрафикСотрудников = Обработки.ГрафикСотрудников;
	
	ВидДня        = ГрафикСотрудников.ВидДня(ТекДата);
	ДанныеЖурнала = ГрафикСотрудников.ДанныеЖурнала(ТекДата);
	
	сШтрафО  = СПравочники.уб_ШтрафныеСанкции.НайтиПоКоду(5);
	Если сШтрафО.Пустая() Тогда
		сШтрафО  = СПравочники.уб_ШтрафныеСанкции.НайтиПоКоду("За опоздание на работу");
	КонецЕсли;	
	Если сШтрафО.Пустая() Тогда
		Сообщить("Не найден штраф за опазадание, сообщите разработчикам, автоматческое начисление невозможно");
		Возврат Ложь;
	КонецЕсли;
	сШтрафПлан = Справочники.уб_ШтрафныеСанкции.ШтрафнойПлан;
	
	ЭтоПраздник = ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
	Учтенные = Новый Массив;
	
	ДопУсловие = Обработки.ГрафикСотрудников.УсловиеДляДняНедели(ТекДата);
	
	//Выгрузить().ВыгрузитьКолонку("Сотрудник");
	//Для каждого Сотрудник из МассивСотрудников Цикл
	ВыборкаСотрудников = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСотрудников.Следующий() Цикл
		
		Сотрудник = ВыборкаСотрудников.Сотрудник;
		
		Если Не Учтенные.Найти(Сотрудник) = Неопределено Тогда
			//Уже обработанный сотрудник, такого не должно быть
			Продолжить;
		КонецЕсли;
		Если ВыборкаСотрудников.ТипПараметра = "Начислять штраф за опаздание" Тогда
			ТекШтраф = сШтрафО;
		Иначе
			ТекШтраф = сШтрафПлан;
		КонецЕсли;	
		
		Учтенные.Добавить(Сотрудник);
		
		Если ЭтоПраздник Тогда
			Ответ = Новый Структура("ВремяНачала,ДатаНачала,ДатаОкончания,Вид",Дата(1,1,1),Дата(1,1,1),Дата(1,1,1),Справочники.уб_ТипЗанятостиВС.ПустаяСсылка());
		Иначе	
			Ответ = ГрафикСотрудников.ТекущийГрафикСотрудника(Сотрудник,ДопУсловие,ТекДата);
		КонецЕсли;
		
		ФактическийПриход = Дата(1,1,1);
		Если Ответ.ВремяНачала = ФактическийПриход Тогда
			//выходной или праздник
			Комментарий = "Праздник";
			СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",
				Сотрудник,ТекШтраф,0,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
			ПериодСуществующейЗаписи = Неопределено;
			Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Истина Тогда
				//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
				Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
				Запись.Период = ПериодСуществующейЗаписи;
			
				//НачатьТранзакцию();
				Запись.Записать();
				ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
				//ОтменитьТранзакцию();
			КонецЕсли;	
			Продолжить;
		КонецЕсли;	
			
		нСтроки = ДанныеЖурнала.НайтиСтроки(НОвый Структура("ПользовательФизЛицо",Сотрудник));
		
			
		Для каждого СтрокаЖ из нСтроки Цикл
			ФактическийПриход = СтрокаЖ.Вход-(НачалоДня(ТекДата)-Дата(1,1,1));
			Прервать;
		КонецЦикла;	
		//Сообщить(Сотрудник);
		////Сообщить(Ответ.ДатаНачала);
		//Сообщить(Ответ.ВремяНачала);
		//Сообщить(ФактическийПриход);
		СекундПросрочки = 60;
		
		Если (ФактическийПриход-Ответ.ВремяНачала)>СекундПросрочки или ФактическийПриход = Дата(1,1,1) Тогда
			ШтрафСотруднику = ВыборкаСотрудников.Штраф;
		Иначе
			ШтрафСотруднику = 0;
		КонецЕсли;
		
		Если ШтрафСотруднику >0 Тогда
			//Сообщить("Штраф: "+ШтрафСотруднику);
			Комментарий = "Вход "+?(ФактическийПриход = Дата(1,1,1),"отсутствует","в "+Формат(ФактическийПриход,"ДФ=HH:mm:ss"))+" вместо "+Формат(Ответ.ВремяНачала,"ДФ=HH:mm");
			СтруктураШтрафа = Новый Структура("Физлицо,Штраф,СуммаШтрафа,ОтветственныйЗаНачисление, Автор,ДатаШтрафа, Комментарий,Период,Модификатор",Сотрудник,ТекШтраф,ШтрафСотруднику,Справочники.ФизическиеЛица.ПустаяСсылка(),Справочники.Пользователи.Robot,КонецДня(ТекДата),Комментарий,ПараметрыОбмена.Период,Справочники.Пользователи.Robot);
			Если ЕстьШтраф(СтруктураШтрафа,ПериодСуществующейЗаписи) = Ложь Тогда
				//Сообщить("Начислен "+Сотрудник+" "+ШтрафСотруднику);
				Запись = Регистрысведений.уб_Штрафы.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,СтруктураШтрафа);
				//НачатьТранзакцию();
				Запись.Записать(Истина);
				ПараметрыОбмена.Период = ПараметрыОбмена.Период+1;
				//ОтменитьТранзакцию();
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ДанныеЖурнала(Знач ДатаИзПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	журналСобытий.Ссылка,
	                |	журналСобытий.ВерсияДанных,
	                |	журналСобытий.ПометкаУдаления,
	                |	журналСобытий.Предопределенный,
	                |	журналСобытий.Событие,
	                |	журналСобытий.Дата,
	                |	журналСобытий.Пользователь,
	                |	журналСобытий.Информация,
	                |	журналСобытий.Объект
	                |ПОМЕСТИТЬ Журналы
	                |ИЗ
	                |	Справочник.журналСобытий КАК журналСобытий
	                |ГДЕ
	                |	журналСобытий.Дата >= &Дата1
	                |	И журналСобытий.Дата <= &Дата2
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 20000
	                |	журналы.Пользователь.ФизЛицо,
	                |	журналы.Пользователь,
	                |	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение
	                |ПОМЕСТИТЬ ФИО
	                |ИЗ
	                |	Журналы КАК журналы
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	                |		ПО журналы.Пользователь.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	                |		ПО журналы.Пользователь.ФизЛицо = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Фамилия
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|  Журналы.Пользователь,
					|  НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ) КАК День,
					|  //Журналы.Событие,
					|  МИНИМУМ(Журналы.Дата) КАК Вход
					|ПОМЕСТИТЬ ВХОД
					|ИЗ
					|  Журналы КАК Журналы
					|ГДЕ
					|	Час(Журналы.Дата)>4 или
					|	Журналы.Событие = ЗНАЧЕНИЕ(Справочник.ВидСобытия.Вход)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Журналы.Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ)//,
	               // |	Журналы.Событие
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Журналы.Пользователь КАК Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ) КАК День,
	                |	МАКСИМУМ(Журналы.Дата) КАК Выход
	                |ПОМЕСТИТЬ ПоследняяАктивность
	                |ИЗ
	                |	Журналы КАК Журналы
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Журналы.Пользователь,
	                |	НАЧАЛОПЕРИОДА(Журналы.Дата, ДЕНЬ)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ФИО.ПользовательФизЛицо,
	                |	ФИО.Пользователь,
	                |	ФИО.Фамилия,
	                |	ФИО.Выбытие,
	                |	ФИО.Подразделение,
	                |	ПерваяАктивность.День,
	                |	ПерваяАктивность.Вход,
	                |	ПоследняяАктивность.Выход,
	                |	РАЗНОСТЬДАТ(ПерваяАктивность.Вход, ПоследняяАктивность.Выход, ЧАС) КАК ЧасовРаботы
	                |ИЗ
	                |	ФИО КАК ФИО
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВХОД КАК ПерваяАктивность
	                |		ПО ФИО.Пользователь = ПерваяАктивность.Пользователь
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяАктивность КАК ПоследняяАктивность
	                |		ПО (ПерваяАктивность.Пользователь = ПоследняяАктивность.Пользователь)
	                |			И (ПерваяАктивность.День = ПоследняяАктивность.День)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ФИО.Пользователь.Наименование,
	                |	ПерваяАктивность.День";
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(ДатаИзПериода));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ДатаИзПериода));
	Возврат Запрос.выполнить().Выгрузить();
КонецФункции	

Функция ТекущийГрафикСотрудника(Сотрудник,ДопУсловие,ДатаИзМесяца) Экспорт
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
|	РегламентированныйПроизводственныйКалендарь.ВидДня
|ПОМЕСТИТЬ Даты
|ИЗ
|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
|ГДЕ
|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
|;

|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЗанятостьШирокийДиапазон.Агент,
|	Даты.ДатаКалендаря,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
|		ИНАЧЕ ЕСТЬNULL(Занятость.ДатаНачала, ЕСТЬNULL(ЗанятостьШирокийДиапазон.ДатаНачала, Даты.ДатаКалендаря))
|	КОНЕЦ КАК ДатаНачала,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
|		ИНАЧЕ ЕСТЬNULL(Занятость.ДатаОкончания, ЕСТЬNULL(ЗанятостьШирокийДиапазон.ДатаОкончания, КОНЕЦПЕРИОДА(Даты.ДатаКалендаря, ДЕНЬ)))
|	КОНЕЦ КАК ДатаОкончания,
|	ЕСТЬNULL(Занятость.ТипЗанятости, ЕСТЬNULL(ЗанятостьШирокийДиапазон.ТипЗанятости, &Работа)) КАК ТипЗанятости,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
|		ИНАЧЕ ЕСТЬNULL(Занятость.ВремяНачала, ЕСТЬNULL(ЗанятостьШирокийДиапазон.ВремяНачала, Выбор когда Даты.ДатаКалендаря>ДатаВремя(2019,12,15)и Даты.ВидДня = Значение(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий) Тогда ДатаВремя(1,1,1, 9,0,0) Иначе ДатаВремя(1,1,1) Конец))
|	КОНЕЦ КАК ВремяНачала,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
|		ИНАЧЕ ЕСТЬNULL(Занятость.ВремяОкончания, ЕСТЬNULL(ЗанятостьШирокийДиапазон.ВремяОкончания, Выбор когда Даты.ДатаКалендаря>ДатаВремя(2019,12,15)и Даты.ВидДня = Значение(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий) Тогда ДатаВремя(1,1,1, 18,0,0)  Иначе ДатаВремя(1,1,1) Конец))
|	КОНЕЦ КАК ВремяОкончания,
|	ЕСТЬNULL(ЗанятостьШирокийДиапазон.ТипЗанятости.Наименование,""Работа"") КАК Наименование,
|	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,
|	Даты.ВидДня
|ИЗ
|	Даты КАК Даты
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&Дата, Агент = &Агент) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
|		ПО (ИСТИНА)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗанятостьВС КАК ЗанятостьШирокийДиапазон
|		ПО (ЗанятостьШирокийДиапазон.ДатаНачала <= Даты.ДатаКалендаря)
|			И (ЗанятостьШирокийДиапазон.ДатаОкончания >= Даты.ДатаКалендаря)
|			И (ЗанятостьШирокийДиапазон.Агент = &Агент)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗанятостьВС КАК Занятость
|		ПО (Занятость.ДатаНачала = Даты.ДатаКалендаря)
|			И (Занятость.ДатаОкончания = Даты.ДатаКалендаря)
|			И (Занятость.Агент = &Агент)

|УПОРЯДОЧИТЬ ПО
|	Даты.ДатаКалендаря,
|	ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("Агент",	Сотрудник);
	
	Запрос.УстановитьПараметр("Работа",	Справочники.уб_ТипЗанятостиВС.НайтиПоКоду(4));
	
	Запрос.УстановитьПараметр("Дата",	ДатаИзМесяца);
	
	Ответ = Запрос.Выполнить().Выгрузить();;
	//Пока Выборка.Следующий() Цикл
		//Если НачалоДня(Выборка.ДатаНачала) = НачалоДня(Выборка.ДатаОкончания) и не Выборка.Наименование = "Отпуск" Тогда
		//	
		//	//Корректировка
		//	Ответ.ВремяНачала = Выборка.ВремяНачала;
		//	Ответ.Вид = Выборка.ТипЗанятости;
		//Иначе
		//	Ответ.ДатаНачала = Выборка.ДатаНачала;
		//	Ответ.ДатаОкончания = Выборка.ДатаОкончания;
		//	Если Ответ.ВремяНачала = Дата(1,1,1) Тогда 
		//		Ответ.ВремяНачала = Выборка.ВремяНачала;
		//	КонецЕсли;	
		//	Ответ.Вид = Выборка.ТипЗанятости;
		//	Прервать;
		//КонецЕсли;
	//КонецЦикла;	
	
	Возврат Ответ;
	
	
		
	
	
КонецФункции

Процедура ЗаполнитьинформациюПосотруднику(Сотрудник,ГрафикСотрудника,ДанныеЖурнала,ВсегоДней,ГОд,Месяц,ТекДень) Экспорт
	
	Для счетчик = 1 по ВсегоДней Цикл
		День = Дата(Год,Месяц,Счетчик);
		//ВидДня = Обработки.ГрафикСотрудников.ВидДня(День);
		//ЭтоПраздник = ЭлементыФормы.Сотрудники.Колонки["День"+Счетчик].ПодсказкаВШапке ="Выходной";
		СтруктураИзПроизводственногоКалендаря = ПроизводственныйКалендарь.Получить(Счетчик);
		ВидДня = СтруктураИзПроизводственногоКалендаря.ВидДня;
		
		ЭтоПраздник = ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник
		или ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье 
		или ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота; 
		
		
		нСтроки = ГрафикСотрудника.НайтиСтроки(НОвый Структура("ДатаКалендаря",День));
		Если нСтроки.Количество()=0 Тогда
			Если Не ЭтоПраздник Тогда
				Сотрудник["День"+Счетчик] = Дата(1,1,1,0,0,0);
			КонецЕсли;	
		Иначе	
			Для каждого СтрокаЗ из нСтроки Цикл
				Если Не ЭтоПраздник Тогда
					Сотрудник["День"+Счетчик] = СтрокаЗ.ВремяНачала;
				КонецЕсли;	
				Прервать;
			КонецЦикла;	
		КонецЕсли;
		Если Счетчик <= ТекДень Тогда
			нСтроки = ДанныеЖурнала.НайтиСтроки(НОвый Структура("ПользовательФизЛицо,День",Сотрудник.Сотрудник,День));
			
			ФактическийПриход = Дата(1,1,1);
			ПоследняяАктивность = Дата(1,1,1);
			Для каждого СтрокаЖ из нСтроки Цикл
				ФактическийПриход = СтрокаЖ.Вход-(День-Дата(1,1,1));
				ПоследняяАктивность = СтрокаЖ.Выход;
			КонецЦикла;	
			
			Сотрудник["Факт"+Счетчик] = ФактическийПриход;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

//Процедура обновляет сооттветствие структур дня и дат месяца по производсвенному календарю
Процедура ОбновитьПроизводственныйКалендарь (ЗарплатныйПериод) Экспорт
	
	ПроизводственныйКалендарь = Новый Соответствие;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
	|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
	|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.Год = &Год
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &ДатаНачала
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ДатаОкончания");
	Запрос.УстановитьПараметр("Год",Год(ЗарплатныйПериод));
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(ЗарплатныйПериод));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(ЗарплатныйПериод));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДня = Новый Структура;
		СтруктураДня.Вставить("ДатаКалендаря",	Выборка.ДатаКалендаря);
		СтруктураДня.Вставить("Пятидневка",		Выборка.Пятидневка);
		СтруктураДня.Вставить("Шестидневка",	Выборка.Шестидневка);
		СтруктураДня.Вставить("КалендарныеДни",	Выборка.КалендарныеДни);
		СтруктураДня.Вставить("ВидДня",			Выборка.ВидДня);
		//Добавляются два варианта получения данных о календаре
		ПроизводственныйКалендарь.Вставить(Выборка.ДатаКалендаря,СтруктураДня);
		ПроизводственныйКалендарь.Вставить(День(Выборка.ДатаКалендаря),СтруктураДня);
	КонецЦикла;	
	
КонецПроцедуры	