////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры


Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени().Дата,ВидГраницы.Исключая));
	//СтруктураПараметров.Вставить("АгентВТЧДокумента", Ложь);
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Ложь);
	//СтруктураПараметров.Вставить("Агент", Агент);
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);
//	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.ЗаявлениеАгентаОбУтратеБСО);
	СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Перечисления.уб_СостоянияБСО.Утрачен);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", НеКонтролироватьНаличиеБСОПриПроведении);
	СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", "ТипУтраты");
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Ложь);
	//СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", Неопределено);
	//СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Поставщик", Неопределено);
	//СтруктураПараметров.Вставить("ОрганизацияАгент", Неопределено);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		#Если Клиент Тогда
		ОчиститьСообщения();
		#Конецесли
	КонецЕсли;
	
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Проведен Тогда
		ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	КонецЕсли;	

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//КоличествоСтрокТЧ = БСО.Количество();
	времКоличествоСтрокТЧ = уб_temp.ПолучитьКоличествоБСОвТЧ(БСО);
	Если НЕ времКоличествоСтрокТЧ = КоличествоСтрокТЧ Тогда
		КоличествоСтрокТЧ = времКоличествоСтрокТЧ;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Тип = ТипЗнч(Основание);
	Если Тип = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		//
		Агент = Основание.АгентКуда;
		ТипУтратыПоУмолчанию = "Утрачен";
		СозданНаОсновании = Основание.Ссылка;
		Для каждого Строка из Основание.БСО Цикл
			НоваяСтрока = БСО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.ТипУтраты = "Утрачен"; 
			НоваяСтрока.ДатаУтратыПорчи = ТекущаяДата();
			//НоваяСтрока.ВидУтратыБСО =Перечисления.уб_ВидУтратыБСО  ;
		КонецЦикла;	
	Иначе
		//
	КонецЕсли;	
КонецПроцедуры
