#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗакрытьФорму") Тогда
		Отказ = Истина;
	КонецЕсли;	
	
	ИнициализироватьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполненПоискСтрахователя = ЛОЖЬ;
	Если ЗначениеЗаполнено(Объект.Страхователь) Тогда
		Наименование = Наименование(Объект.Страхователь);
		//НаименованиеПриИзменении(Элементы.Наименование);
		НастройкиНаименования();
	КонецЕсли;	
	
	ПриИзмененииМенеджер();
	
	СтраховательПриИзменении(Элементы.Страхователь, "При открытии");
	
	ВидОплатыПриИзменении(Неопределено);
	
	ВидимостьСтатусаЗаявки();
	
	ВидимостьКнопкиВыбораАдреса();
	
	Элементы.Дата.УстановитьГраницыВыделения(7, 8);
	
	ПроверкаСрочности();
	
	//УстановитьДоступностьПодСтатусов();
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьИтоги(Ложь);
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
	    Отказ = Истина;
	Иначе
		СинхронизироватьДатыВстречи();
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.Дата > Дата(2017,11,1) Тогда
		Ответ = уб_СЕРВЕРные.СинхронизацияФайловЗаявки(Новый Структура("Номер,Ссылка,Страхователь,Менеджер",Объект.Номер,Объект.Ссылка,Объект.Страхователь,Объект.Менеджер));
		Если не Ответ = Истина и уб_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") тогда
			Сообщить(Ответ);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ЗаявкаНаЗаказВыездногоСпециалиста",Объект.Ссылка,ЭтаФорма);
	//Если СтатусЗаявки.Пустая() Тогда
		уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка, ТекущаяДата());
	//КонецЕсли;	
КонецПроцедуры


#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура НомерЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Изменилось = ЛОЖЬ;
	уб_Клиент.НачалоВыбораНомераЗаявки(ЭтаФорма, Элемент, СтандартнаяОбработка,Изменилось);	
	Если Изменилось = Истина Тогда
		
		//КонтрольДатыВыездаЛички(Объект.ДатаСоздания);
		Комиссия=0;
		СКВ = РасчетСКВПоЗаявке(Комиссия);
		РасчетВознагражденийУдержаний();
		ИзменитьДоступность();
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореНомераЗаявки(ВыбранноеЗначение,ДопПараметр)Экспорт
	Если не ВыбранноеЗначение = Неопределено Тогда
		Объект.НомерЗаявки = ВыбранноеЗначение.Значение;
		Элементы.НомерЗаявки.РедактированиеТекста = ТипЗнч(Объект.НомерЗаявки) = Тип("Число");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	ПриИзмененииМенеджер();
КонецПроцедуры

&НаКлиенте
Процедура МенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "Курьер" Тогда
		ПараметрыСотрудника = ПолучитьИзВременногоХранилища(АдресПараметровВызова);
		Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава,уб_СотрудникОтделаБСО") = Истина 
			или ПараметрыСотрудника.СтруктураПоДокументу.РукИлиЗам = Истина 
			или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.УправлениеПечатью"), Ложь)
			Тогда
			//уб_СС.ВыборКурьера(Элемент, СтандартнаяОбработка);
			ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Курьеры"));
			ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),ЭтаФорма);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
			//СписокВыбора = Новый СписокЗначений;
			//СписокВыбора.Добавить(Справочники.ФизическиеЛица.ПустойАгент);
			//СписокВыбора.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("000051735"));
			//СписокВыбора.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("000067841"));
			//Элемент.СписокВыбора = СписокВыбора;
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "Оператор" Тогда
		//уб_СС.ВыборСотрудника(Элемент, СтандартнаяОбработка);
		ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),ЭтаФорма);
	Иначе	
		//уб_СС.ВыборАгента(Элемент, СтандартнаяОбработка);
		//уб_СС.ВыборСотрудника(Элемент, СтандартнаяОбработка);
		ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура МенеджерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	//!!! TODO
	//СтандартнаяОбработка = Ложь;
	//уб_СС.ОкончаниеВводаТекстаСотрудника(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Объект.Дата, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ПриИзмененииТипа();
	ВидимостьСтатусаЗаявки();
КонецПроцедуры


&НаКлиенте
Процедура ТипВыездаПриИзменении(Элемент)
	ПриИзмененииТипа();
КонецПроцедуры

&НаКлиенте
Процедура ТипНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Объект.ЦельВыезда = ВыбранноеЗначение;
		ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПриИзмененииДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДата()
	
	Если Объект.Утверждено и Элементы.РезультатПроверки.ТолькоПросмотр = Истина Тогда
		ДатаМакс = Объект.УтвержденоДата+24*3600*7;
		Если Объект.Дата>ДатаМакс Тогда
			Объект.Дата = ДатаМакс;
			ПоказатьПредупреждение(,"Вам запрещено ставить дату позднее 7 дней после утверждения");
		КонецЕсли;	
	КонецЕсли;	
	
	СинхронизироватьДатыВстречи(1);
	ПоказателиРасчетаЗП = уб_РасчетыСМенеджерами.ПоказателиРасчетаЗП(Объект.Дата);
	ПроверкаСрочности(Истина);
	Если ПроверкаЗаявокОтделомКонтроля = Истина и Объект.Дата>Дата(2018,6,1) Тогда
		Объект.ТребуетсяУтверждениеАндеррайтера = Истина;
	КонецЕсли;	 
КонецПроцедуры


&НаКлиенте
Процедура СамовыездПриИзменении(Элемент)
	ПриИзмененииСамовыезд();
	ИзменитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	Если НЕ Объект.Адрес = "ОФис" Тогда
		Объект.ЗаблокироватьАвторасчет = ЛОЖЬ;
		ПроверкаСрочности();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипСтрахователяПриИзменении(Элемент)
	Если ТипСтрахователя ="ФИО" Тогда
		Если не ТипЗнч(Объект.Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Объект.Страхователь = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			ВыполненПоискСтрахователя = Ложь;
			НастройкиНаименования();
		КонецЕсли;	
	Иначе
		Если не ТипЗнч(Объект.Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Страхователь = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			ВыполненПоискСтрахователя = Ложь;
			НастройкиНаименования();
		КонецЕсли;	
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент =  Элементы.Наименование;
	
КонецПроцедуры


#Область НовыйСтрахователь

&НаКлиенте
Процедура СоздатьНовогоНажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.Страхователь) Тогда
		//сначала надо очистить выбранного
		//иначе насоздают несколько
	Иначе	
		
		Наименование = СокрЛП(Наименование);
		ЭтоФизЛицо = ТипЗнч(Объект.Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") или Объект.Страхователь = Неопределено;
		Если ЭтоФизЛицо Тогда
			Если СтрЧислоВхождений(Наименование," ")<2 Тогда
				ПоказатьПредупреждение(,"Не корректное ФИО");
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		ПараметрыСоздания = Новый Структура("ЭтоФизЛицо,Наименование",ЭтоФизЛицо,Наименование);
		
		Если ЭтоФизЛицо Тогда
			
			ПоказатьВводДаты(Новый ОписаниеОповещения("ПриВводеДатыРождения",ЭтаФорма,ПараметрыСоздания),Дата(1,1,1),"Введите дату рождения",ЧастиДаты.Дата);
			
			//Если ВвестиДату(ДатаРождения,"Введите дату рождения") Тогда
			//	
			//КонецЕсли;	
			//Закрыть(Страхователь);
		Иначе	
			ПоказатьВводСтроки(Новый ОписаниеОповещения("ПриВводеИНН",ЭтаФорма,ПараметрыСоздания),"","Введите ИНН",,ЛОЖЬ);
			//ИНН = "";
			//Если ВвестиСтроку(ИНН,"Введите ИНН") Тогда
			//	
			//КонецЕсли;	
			
			//Закрыть(Страхователь);
		КонецЕсли;
	КонецЕсли;
	//НастройкиНаименования();

КонецПроцедуры

&НаКлиенте
Процедура ПриВводеДатыРождения(ВыбраннаяДата,ПараметрыСоздания) Экспорт
	Если Не ВыбраннаяДата = Неопределено Тогда
		ДатаРождения = ВыбраннаяДата;
		Возраст = цел((ТекущаяДата()-ДатаРождения)/365);
		Если ДатаРождения = Дата(2020,1,1) или ГОД(ДатаРождения) = ГОД(ТекущаяДата())  Тогда
			ДатаРождения = Дата(1,1,1)
		ИначеЕсли Возраст<18 и возраст>99 Тогда
			ДатаРождения = Дата(1,1,1)
		КонецЕсли;	
		Если ДатаРождения = Дата(1,1,1) Тогда
			ПоказатьВводДаты(Новый ОписаниеОповещения("ПриВводеДатыРождения",ЭтаФорма,ПараметрыСоздания),Дата(1,1,1),"Введите дату рождения",ЧастиДаты.Дата);
		КонецЕсли;	
		ПараметрыСоздания.Вставить("ДатаРождения",ВыбраннаяДата);
		Объект.Страхователь = СоздатьСтрахователяНаСервере(ПараметрыСоздания);
		Наименование = Строка(Объект.Страхователь);
		НастройкиНаименования();
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПриВводеИНН(ВыбраннаяСтрока,ПараметрыСоздания) Экспорт
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ИНН = ВыбраннаяСтрока;
	
	Если Уб_ВызовСервера.ПроверитьИНН(ИНН) = ЛОЖЬ Тогда
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ПриВводеИНН",ЭтаФорма,ПараметрыСоздания),ИНН,"Введите ИНН",,ЛОЖЬ);
		Возврат;
	КонецЕсли;	

	Если Не ВыбраннаяСтрока = Неопределено и не ПустаяСтрока(ВыбраннаяСтрока) Тогда
		ПараметрыСоздания.Вставить("ИНН",ВыбраннаяСтрока);
		Объект.Страхователь = СоздатьСтрахователяНаСервере(ПараметрыСоздания);
		Наименование = Строка(Объект.Страхователь);
		НастройкиНаименования();
	КонецЕсли;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СоздатьСтрахователяНаСервере(ПараметрыСоздания)
	Если ПараметрыСоздания.Свойство("ЭтоФизЛицо")и ПараметрыСоздания.ЭтоФизЛицо = Истина Тогда
		_Страхователь = НайтиСтраховователя(ПараметрыСоздания.Наименование,ПараметрыСоздания.ДатаРождения,"ФИО");
		Если ЗначениеЗаполнено(_Страхователь) Тогда
			Страхователь  = _Страхователь;
		Иначе
			ОбСтрахователь = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ОбСтрахователь.УстановитьНовыйКод("");
			ОбСтрахователь.Автор        = ПараметрыСеанса.ТекущийПользователь;
			ОбСтрахователь.Модификатор  = ПараметрыСеанса.ТекущийПользователь;
			ОбСтрахователь.ДатаСоздания = ТекущаяДата();
			ОбСтрахователь.ДатаИзменения = ТекущаяДата();
			ОбСтрахователь.Наименование = ПараметрыСоздания.Наименование;
			ОбСтрахователь.Пол = ?(Найти(ПараметрыСоздания.Наименование,"вна")>0, Перечисления.ПолФизическихЛиц.Женский, Перечисления.ПолФизическихЛиц.Мужской);
			Если ЗначениеЗаполнено(ПараметрыСоздания.ДатаРождения) Тогда
				Попытка
					ОбСтрахователь.ДатаРождения = ПараметрыСоздания.ДатаРождения;
				Исключение
				КонецПопытки;	
			КонецЕсли;
			ОбСтрахователь.ОбменДанными.Загрузка = Истина;
			ОбСтрахователь.Записать();
			
			Страхователь = ОбСтрахователь.Ссылка; 
		КонецЕсли;
	Иначе	
		_Страхователь = НайтиСтраховователя(ПараметрыСоздания.Наименование,ПараметрыСоздания.ИНН,"Организация");
		
		Если ЗначениеЗаполнено(_Страхователь) Тогда
			Страхователь  = _Страхователь;
		Иначе
			ОбСтрахователь = Справочники.Контрагенты.СоздатьЭлемент();
			ОбСтрахователь.УстановитьНовыйКод("");
			ОбСтрахователь.Автор        = ПараметрыСеанса.ТекущийПользователь;
			ОбСтрахователь.Модификатор  = ПараметрыСеанса.ТекущийПользователь;
			ОбСтрахователь.ДатаСоздания = ТекущаяДата();
			ОбСтрахователь.ДатаИзменения = ТекущаяДата();
			ОбСтрахователь.Наименование = ПараметрыСоздания.Наименование;
			ОбСтрахователь.НаименованиеПолное = ПараметрыСоздания.Наименование;
			ОбСтрахователь.НаименованиеКраткое = ПараметрыСоздания.Наименование;
			ОбСтрахователь.ЮрФизЛицо = перечисления.ЮрФизЛицо.ЮрЛицо;
			ОбСтрахователь.ИНН = ПараметрыСоздания.ИНН;
			//ОбСтрахователь.КПП = КПП;
			ОбСтрахователь.ОбменДанными.Загрузка = Истина;
			ОбСтрахователь.Записать();
			
			Страхователь = ОбСтрахователь.Ссылка; 
		КонецЕсли;
	КонецЕсли;
	Возврат Страхователь;
КонецФункции	

&НаСервереБезКонтекста
Функция НайтиСтраховователя(Наименование,ИНН,ТипСтрахователя)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование",Наименование);
	
	Если ТипСтрахователя="ФИО" Тогда
		Запрос.УстановитьПараметр("ДатаРождения",ИНН);
		Запрос.Текст = "ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование,
		|	ФизическиеЛица.Код КАК Код
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование ПОДОБНО &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическиеЛица.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА ФизическиеЛица.ДатаРождения = &ДатаРождения
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	Код";
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(ИНН) и ЗначениеЗаполнено(Выборка.Ссылка.ДатаРождения) Тогда
				Если Выборка.Ссылка.ДатаРождения = ИНН Тогда
					Возврат Выборка.Ссылка;
				Иначе
				КонецЕсли;	
			Иначе	
				Возврат Выборка.Ссылка;
			КонецЕсли;	
				
		КонецЦикла;
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Запрос.УстановитьПараметр("ИНН",ИНН);
		Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.Наименование,
		|	Контрагенты.Код КАК Код
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагенты.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА Контрагенты.ИНН = &ИНН
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	Код";
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка;
		КонецЦикла;
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ВыполненПоискСтрахователя = ЗначениеЗаполнено(Объект.Страхователь);
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоЦифры =  ОбщегоНазначения.ТолькоЦифрыВСтроке(Наименование);
	ЭтоФизЛицо = ТипЗНЧ(Объект.Страхователь) = Тип("СправочникСсылка.ФизическиеЛица")  ИЛИ Объект.Страхователь = Неопределено;
	
	Если (НАЙТИ(ВРЕГ(Наименование),"ООО")>0 ИЛИ ЛЕВ(ВРЕГ(Наименование),2) = "АО") И ЭтоФизЛицо
		
		Тогда
		ЭтоФизЛицо = Ложь;
		Объект.Страхователь = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		//ФизЛицоПриИзменении(Элемент);
		Модифицированность = Истина;
	КонецЕсли;
	Если ЭтоФизЛицо = Ложь Тогда//в том числе при открытии старого контрагента
		ТипСтрахователя = "Организация";
	КонецЕсли;	
	
	Если ЭтоФизЛицо Тогда
		ТипСтрахователя = "ФИО";
		НовоеНаименование = НовоеНаименование(Наименование);
		Если НовоеНаименование<>Наименование Тогда
			Наименование = НовоеНаименование;
			Модифицированность = Истина;
		КонецЕсли;			
		Если ЗначениеЗаполнено(Объект.Страхователь) = ЛОЖЬ Тогда
			Страхователи = уб_ВызовСервера.СтрахователиПоНаименованию(Наименование);
			Если Страхователи.Количество()>0 Тогда
				//ТипСтрахователя = "Организация";
				//Страхователь = Страхователи[0];
				Если Страхователи.Количество() = 1 Тогда
					Объект.Страхователь = Страхователи[0];
					Наименование = Строка(Объект.Страхователь);
					ВыполненПоискСтрахователя = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ЭтоФизЛицо = Ложь Тогда	
		Если ЗначениеЗаполнено(Объект.Страхователь) = ЛОЖЬ Тогда
			Страхователи = уб_ВызовСервера.СтрахователиПоНаименованию(Наименование);
			Если Страхователи.Количество()>0 Тогда
				//ТипСтрахователя = "Организация";
				Объект.Страхователь = Страхователи[0];
				Если Страхователи.Количество() = 1 Тогда
					Наименование = Строка(Объект.Страхователь);
					ВыполненПоискСтрахователя = Истина;
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;
	Если Модифицированность = Истина Тогда
		ВыполненПоискСтрахователя = Ложь;
		//Изменили, надо очистить
		Если ТипСтрахователя = "ФИО" Тогда
			Объект.Страхователь = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Иначе
			Объект.Страхователь = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;	
	
	НастройкиНаименования();
	
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		Попытка
			Наименование        = Строка(ВыбранноеЗначение.Страхователь);
			Объект.Страхователь = ВыбранноеЗначение.Страхователь;
			ВыполненПоискСтрахователя = Истина;
			НастройкиНаименования();
			Модифицированность = Истина;
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Страхователь) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Объект.Страхователь);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СтраховательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("Строка") Тогда
		Если ТипЗнч(Объект.Страхователь) <> Тип("Строка") Тогда
			ВыбранноеЗначение = ""
		Иначе
			СтандартнаяОбработка = Ложь
		КонецЕсли;
	ИначеЕсли ВыбранноеЗначение = Тип("СправочникСсылка.ФизическиеЛица") 
		ИЛИ ВыбранноеЗначение = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		СтандартнаяОбработка = Ложь;
		//уб_СС.НачалоВыбораСтрахователяФизЛица(ЭтаФорма, Элемент);
		//уб_СС.ВыборСтрахователя(Элемент, СтандартнаяОбработка, "не Контрагенты");
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма);
	ИначеЕсли ВыбранноеЗначение = Тип("СправочникСсылка.Контрагенты") Тогда
		СтандартнаяОбработка = Ложь;
		//уб_СС.НачалоВыбораКонтрагента(ЭтаФорма, Элемент)
		//уб_СС.ВыборСтрахователя(Элемент, СтандартнаяОбработка, "не ФизическиеЛица");
		//ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты..Сотрудники"));
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,ЭтаФорма);
	Иначе
		Наименование = Строка(ВыбранноеЗначение);
		ВыполненПоискСтрахователя = Истина;
	КонецЕсли;
	уб_СтраховойБрокер.ВыполнитьОтложенноеДействие(ЭтаФорма, "НастройкиНаименования", 0.2);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	ВидимостьСуммыПоКарте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаявкиПриИзменении(Элемент)
	
	Элементы.Источник.Видимость = Не (Объект.НомерЗаявки = ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Личная") 
	ИЛИ Объект.НомерЗаявки = ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Агентская")) 
	И не (Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Пролонгация") ИЛИ Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.ОчереднойВзнос"));
	
	ПриИзмененииСвязанномСВознаграждением(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	Если ТипЗнч(Объект.НомерДоговора) = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
		
		
		ДанныеСтарогоПолиса = ДанныеСтарогоПолиса(Объект.НомерДоговора);
		Если НЕ ДанныеСтарогоПолиса = Неопределено Тогда
			Если уб_Клиент._УстановитьЗначение(Объект,"СК", ДанныеСтарогоПолиса.СК) Тогда
				СКПриИзменении(Элемент);
			КонецЕсли;	
			Заполнить = Ложь;
			
			Если Объект.Страхователь = Неопределено Тогда
				Заполнить = Истина;
			Иначе
				Заполнить = Истина;
				
			КонецЕсли;
			Если Заполнить Тогда
				Если НЕ Объект.Страхователь =  ДанныеСтарогоПолиса.Страхователь Тогда
					Если ЗначениеЗаполнено(Объект.Страхователь) Тогда
						ТекстВопроса = "Заменить текущего страхователя '" + СокрЛП(Объект.Страхователь) + "' данными из страхового полиса - '" + ДанныеСтарогоПолиса.СтраховательСтрока + "'?";
						
						//Ответ = ?(ТекстВопроса = Неопределено, КодВозвратаДиалога.Да, Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет));
						ПоказатьВопрос(Новый ОписаниеОповещения("ПоказатьВопросЗавершение",ЭтаФорма,ДанныеСтарогоПолиса),ТекстВопроса,РежимДиалогавопрос.ДаНет,,КодВозвратаДиалога.Да);
					Иначе
						Объект.Страхователь =  ДанныеСтарогоПолиса.Страхователь
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Ответ,ДанныеСтарогоПолиса) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если уб_Клиент._УстановитьЗначение(Объект,"Страхователь", ДанныеСтарогоПолиса.Страхователь) Тогда
			СтраховательПриИзменении(Элементы.Страхователь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры					

&НаКлиенте
Процедура СКПриИзменении(Элемент)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный") И Объект.ЦельВыезда = "Административный" Тогда
		//для уже зачищенных контактов не нужно ничего делать
		Если Не Объект.Утверждено И ПустаяСтрока(Объект.ПредставлениеСтроки) Тогда
			Если ЗначениеЗаполнено(Объект.СК) И Не ЗначениеЗаполнено(Объект.МестоВстречи) Тогда
				//получаем фактический адрес СК
				_МестоВстречи = уб_ФормыВызовСервера.ДайКонтактнуюИнформациюФизлица(Объект.СК,ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресКонтрагентаФактический"));
			Иначе	
				_МестоВстречи	= Объект.МестоВстречи;
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.СК) И Не ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
				//получаем основное контактное лицо
				_КонтактноеЛицо  	= Неопределено;
				_Контакты 			= ПолучитьТелефонКонтактногоЛица(Объект.СК,_КонтактноеЛицо);
				
			Иначе
				_КонтактноеЛицо	= Объект.КонтактноеЛицо;
				_Контакты = Объект.Контакты;
			КонецЕсли;
			уб_Клиент._УстановитьЗначение(Объект,"Контакты", 		_Контакты);
			уб_Клиент._УстановитьЗначение(Объект,"КонтактноеЛицо",	_КонтактноеЛицо);
			уб_Клиент._УстановитьЗначение(Объект,"МестоВстречи",	_МестоВстречи);
		КонецЕсли;
	ИначеЕсли Объект.КонтактноеЛицо = Неопределено Или (ТипЗнч(Объект.КонтактноеЛицо) = Тип("СправочникСсылка.КонтактныеЛица") И ЗначениеЗаполнено(Объект.КонтактноеЛицо)= ЛОЖЬ) Тогда
		_Модифицированность = Модифицированность;
		Объект.КонтактноеЛицо = "";
		Если Не _Модифицированность Тогда
			Модифицированность = Ложь
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Форма.ФормаДобавленияНомераТелефонаУправляемая",Новый Структура("Рассылка",ПустаяСтрока(Объект.Контакты)),Элементы.Контакты);
	//Форма = ПолучитьФорму("ФормаДобавленияНомераТелефона", Элемент);
	//Параметры = Новый Структура;
	//Параметры.Вставить("Рассылка", ПустаяСтрока(Контакты));
	//Форма.ПараметрыФормы = Параметры;
	//Форма.Открыть();
	//Форма.Открыть();
	//Форма.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура КонтактыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Найти(Объект.Контакты,ВыбранноеЗначение) = 0 Тогда
		Объект.Контакты = ?(ПустаяСтрока(Объект.Контакты), "", Объект.Контакты + ";") + ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КонтактыОчистка(Элемент, СтандартнаяОбработка)
	МассивПодстрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Объект.Контакты, ";");
	МассивПодстрокКоличество = МассивПодстрок.Количество();
	Если МассивПодстрокКоличество > 1 Тогда
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(МассивПодстрок);
		ОчиститьВсе = СЗ.Добавить("ОчиститьВсе", "Очистить все");
		СЗ.Сдвинуть(ОчиститьВсе, - МассивПодстрокКоличество);
		СЗ.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПриОчисткеКонтактаЗавершение",ЭтаФорма,Новый Структура("СЗ",СЗ)),"Укажите номер телефона для удаления");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОчисткеКонтактаЗавершение(СтрокаСЗ,ДопПараметры) Экспорт
	
	Если СтрокаСЗ = Неопределено Тогда
		
	Иначе
		СЗ = ДопПараметры.СЗ;
		СЗКоличество 	= СЗ.Количество();
		ИндексСтрокиСЗ 	= СЗ.Индекс(СтрокаСЗ);
		ВыбранноеЗначение = СтрокаСЗ.Значение;
		Если ВыбранноеЗначение = "ОчиститьВсе" Тогда
			Объект.Контакты = "";
			Модифицированность = Истина;
		Иначе
			СтандартнаяОбработка = Ложь;
			Инд = Найти(Объект.Контакты, ВыбранноеЗначение);
			ДлинаСтроки = СтрДлина(ВыбранноеЗначение);
			Если Инд <> 0 Тогда
				Если ИндексСтрокиСЗ > 1 Тогда
					Инд = Инд - 1;
					//ДлинаСтроки = ДлинаСтроки + 1;
				КонецЕсли;
				ДлинаСтроки = ДлинаСтроки + 1;
				До 			= Лев(Объект.Контакты, Инд - 1);
				После   	= Сред(Объект.Контакты, Инд + ДлинаСтроки);
				Объект.Контакты    = До + После;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	ЗаполнитьФормуОплатыИКошелек(ЭтаФорма,Объект);
	ТекПроцент = ПосчитатьПроцент(Объект.ВидОплаты, Истина);
	//Если Не ТекПроцент  = Объект.СуммаПоКарте Тогда
		Объект.СуммаПоКарте = ТекПроцент;
		Комиссия = 0;
		СКВ = РасчетСКВПоЗаявке(Комиссия);
		//ДополнительныеСвойства.Вставить("СКВ",СКВ);
		//_СКВ = ?(ДополнительныеСвойства.Свойство("СКВ"),ДополнительныеСвойства.СКВ,0);
		//ЭлементыФОрмы.нСКВ.Заголовок = ""+Формат(_СКВ,"ЧДЦ=0; ЧН=");
		//ЭлементыФОрмы.нСКВ.ЦветТекста = ?(_СКВ<3400,Новый Цвет(255,0,0),Новый Цвет(0,128,0));
	//КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВознаграждениеОтКлиентаПриИзменении(Элемент)
	ПриИзмененииСвязанномСВознаграждением(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПроверкиПриИзменении(Элемент)
	ТребуетсяЗапись = Ложь;
	ИзменилсяРезультат = Ложь;
	Если ЗначениеЗаполнено(Объект.РезультатПроверки) Тогда
		//УстановитьЗначение(ТребуетсяУтверждениеАндеррайтера,Ложь);
		//
		уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПровереноАндеррайтером",Истина);
		
		Если уб_ВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Ссылка,"РезультатПроверки")<>Объект.РезультатПроверки Тогда
			ТребуетсяЗапись = Истина;
			ИзменилсяРезультат = Истина;
		КонецЕсли;			
	Иначе	
		//УстановитьЗначение(ТребуетсяУтверждениеАндеррайтера,Истина);
		ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПровереноАндеррайтером",Ложь);
		ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(Объект,"УтвердилАндеррайтер",ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка")) или ТребуетсяЗапись;		 
	КонецЕсли;	
	
	Элементы.СтаршийОператор.Доступность = Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПринятоВРаботу") 
	                                       ИЛИ  Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПринятоСДоработкой");
										   
	Элементы.БСОДеревоТекущийОператор.Доступность = Элементы.СтаршийОператор.Доступность;
	_Причина = "";
	Если Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПринятоВРаботу") Тогда
//		Элементы.РезультатПроверки.ЦветФона = Новый Цвет(150,255,150);
		_Причина = "Заявка "+Объект.Номер+" принята в работу.";
		_ЦветФона = "rgb(150,255,150)";
		
		Если ПроверкаЗаявокОтделомКонтроля = Истина и Объект.Дата>Дата(2018,6,1) Тогда
			ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПровереноРукСВС",Истина) или ТребуетсяЗапись;
			ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(Объект,"Утверждено",Истина) или ТребуетсяЗапись;
			Если Объект.УтвержденоДата = Дата(1,1,1) Тогда
				Объект.УтвержденоДата = ТекущаяДата();	
				//КонтрольДатыВыездаЛички(УтвержденоДата,Ложь);
				ПроверкаСрочности(Ложь);
			КонецЕсли;
		КонецЕсли;	
	Иначе
		
		Если ПроверкаЗаявокОтделомКонтроля = Истина  и Объект.Дата>Дата(2018,6,1) Тогда
			ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПровереноРукСВС",Ложь) ИЛИ ТребуетсяЗапись;
			ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(Объект,"Утверждено",Ложь) ИЛИ ТребуетсяЗапись;
		КонецЕсли;
		
		Если Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПринятоСДоработкой") Тогда 
			
			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(200,200,0);
			Если ТребуетсяЗапись Тогда
				Если ВвестиСтроку(_Причина,"Внесите причину для доработки") Тогда
					Объект.КомментарийСлужебный=Объект.КомментарийСлужебный+Символы.ПС+"Результат проверки: "+_Причина;
				КонецЕсли;	
				_Причина ="Заявка "+Объект.Номер+" принята в работу, но нуждается в доработке: "+?(_Причина="","свяжитесь с отделом ОСД",_Причина);
				_ЦветФона = "rgb(200,200,0)";
			КонецЕсли;	
		ИначеЕсли Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.Отклонено") Тогда 
			
//			Элементы.РезультатПроверки.ЦветФона = Новый Цвет(255,100,100);
			Если ТребуетсяЗапись Тогда
				Если ВвестиСтроку(_Причина,"Внесите причину отклонения") Тогда
					Объект.КомментарийСлужебный=Объект.КомментарийСлужебный+Символы.ПС+"Результат проверки: "+_Причина;
				КонецЕсли;	
				_Причина ="Заявка "+Объект.Номер+" отклонена: "+?(_Причина=""," без указания причины, свяжитесь с отделом ОСД",_Причина);
				_ЦветФона = "rgb(255,100,100)";
			КонецЕсли;	
		Иначе	
			
			//Элементы.РезультатПроверки.ЦветФона = Новый Цвет;
			Если ТребуетсяЗапись Тогда
				_Причина = "Заявка "+Объект.Номер+" снята с проверки";
				_ЦветФона = "rgb(150,150,255)";
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если ИзменилсяРезультат = Истина Тогда
		ОтправитьУведомление(_Причина,_ЦветФона,Новый Структура("Номер,Страхователь,Менеджер",Объект.Номер,Объект.Страхователь,Объект.Менеджер));
	КонецЕсли;	
		
	Если ТребуетсяЗапись = Истина Тогда
		ПровереноАндеррайтеромПриИзменении(Элемент,Истина);
		//Записать();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПровереноАндеррайтеромПриИзменении(Элемент,ТребуетсяЗапись = Ложь)
	//Пока делаем допущение:
	//если поле доступно, то проверки на права здесь не надо выполнять
	
	Если ЭтаФорма.ПровереноАндеррайтером = Истина Тогда 
		Если ЗначениеЗаполнено(Объект.УтвердилАндеррайтер) = ЛОЖЬ Тогда
			ПолныеПраваДляПоля = Элементы.УтвердилАндеррайтер.СписокВыбора.НайтиПоЗначению(Уб_ВызовСервера.ТекущееФизЛицо())<>Неопределено;//; 
			Если ПолныеПраваДляПоля Тогда
				уб_Клиент._УстановитьЗначение(Объект,"УтвердилАндеррайтер", уб_вызовсервера.ТекущееФизлицо());
			Иначе
				ЭтаФорма.ПровереноАндеррайтером = Ложь;
				Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПустаяСсылка");
			КонецЕсли;	
			
			ТребуетсяЗапись = Истина;			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Объект.РезультатПроверки) = ЛОЖЬ Тогда
			Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПринятоВРаботу");
			ТребуетсяЗапись = Истина;
		КонецЕсли;	
		
		Если ТребуетсяЗапись = Истина Тогда
			//СохранитьИОтправить(Элемент);
			Записать();
		КонецЕсли;	
		
	Иначе
		Если ЗначениеЗаполнено(Объект.РезультатПроверки) = Истина Тогда
			Объект.РезультатПроверки = ПредопределенноеЗначение("Перечисление.уб_РезультатПроверкиЗаявки.ПустаяСсылка");
			ТребуетсяЗапись = Истина;
			Если ПроверкаЗаявокОтделомКонтроля = Истина и Объект.Дата>=Дата(2018,6,1) Тогда
				ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(ЭтаФорма,"ПровереноРукСВС",Ложь) ИЛИ ТребуетсяЗапись;
				ТребуетсяЗапись = уб_Клиент._УстановитьЗначение(Объект,"Утверждено",Ложь) ИЛИ ТребуетсяЗапись;
			КонецЕсли;
		КонецЕсли;	
		Если ТребуетсяЗапись Тогда
			Записать();//Сразу поскольку далее заблокируется кнопка записать
		КонецЕсли;	
	КонецЕсли;	
	
	
		
	ИзменитьДоступность();

КонецПроцедуры


&НаКлиенте
Процедура УтвердилАндеррайтерОчистка(Элемент, СтандартнаяОбработка)
	//СписокКнопок = Новый СписокЗначений;
	//СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да, Отменить!");
	//СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Оставить как есть...");
	//Если //ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина и 
	//	Вопрос("Отменить утверждение ОСД",СписокКнопок) = КодВозвратаДиалога.Да Тогда
		Объект.УтвердилАндеррайтер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		ПровереноАндеррайтером = Ложь;
		ПровереноАндеррайтеромПриИзменении(Элемент);
	//ИначеЕсли Вопрос("Отменить утверждение андеррайтера",СписокКнопок) = КодВозвратаДиалога.Да  Тогда
	//	//УтвердилАндеррайтер = Справочники.ФизическиеЛица.ПустаяСсылка();
	//	//ИзменитьДоступность();
	//	
	//КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СтаршийОператорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СтаршийОператор) Тогда
		мСтрок = Новый Массив;
		Для каждого Строка из Объект.БСО Цикл
			Если ЗначениеЗаполнено(Строка.Оператор) = ЛОЖЬ Тогда
				мСтрок.Добавить(строка);
			КонецЕсли;	
		КонецЦикла;	
		Если мСтрок.Количество() >0 Тогда
			//Ответ = Вопрос("Проставить выбранного оператора в незаполненых строках("+мСтрок.Количество()+")?",РежимДиалогаВопрос.ДаНет);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроставитьОператораЗавершение",ЭтаФорма,Новый Структура("Строки",мСтрок)),"Проставить выбранного оператора в незаполненых строках("+мСтрок.Количество()+")?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		Если Объект.СрокОформления = Дата(1,1,1) Тогда
			Объект.СрокОформления = ПолучитьСрокОформления(Новый Структура("Оператор,Ссылка",Объект.СтаршийОператор,Объект.Ссылка));
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроставитьОператораЗавершение(Ответ,ДопПараметры) Экспорт
	Если Ответ= КодВозвратаДиалога.Да Тогда
		Для каждого Строка из ДопПараметры.Строки Цикл
			Строка.Оператор = Объект.СтаршийОператор;
			Для каждого СтрокаД из БСОДерево.ПолучитьЭлементы() цикл
				Если Строка.УидСтроки = СтрокаД.УидСтроки Тогда
					СтрокаД.Оператор = Объект.СтаршийОператор;
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры	


&НаКлиенте
Процедура КурьерПриИзменении(Элемент)
	Если ЭтоМенеджер() = Истина Тогда
		тДата = ТекущаяДата();
		нДня = НачалоДня(тДата);
		
		Если ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ И нДня = НачалоДня(Объект.ВремяНачало) Тогда
			Объект.ВремяНачало = нДня+Цел((тДата-нДня)/600)*600+900;	
			Объект.ВремяНачало = ПодобратьДатуНачала(Новый Структура("ВремяНачало,Курьер",Объект.ВремяНачало,Объект.Курьер));
			Объект.ВремяОкончания 	= Объект.ВремяНачало + 30 * 60;
		КонецЕсли;
		
	КонецЕсли;
	
	ПриИзмененииСвязанномСВознаграждением(Элемент);
	
	ПараметрыСВС = уб_РасчетыСМенеджерами.ПараметрыСВС(Объект.Курьер,КонецДня(Объект.Дата));
	
	уб_Клиент._УстановитьЗначение(Объект,"СВС",ПараметрыСВС.СВС);

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоПриИзменении(Элемент)
	Если Объект.ВремяНачало >= Объект.ВремяОкончания Тогда
		ПоказатьОповещениеПользователя("Время начала встречи д.б. меньше времени окончания встречи!");
		Объект.ВремяНачало = Макс(Объект.ВремяОкончания - 3600, НачалоДня(Объект.Дата));
	КонецЕсли;
	СинхронизироватьДатыВстречи(2);

КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	Если Объект.ВремяНачало >= Объект.ВремяОкончания Тогда
		ПоказатьОповещениеПользователя("Время окончания встречи д.б. больше времени начала встречи!");
		Объект.ВремяОкончания = Мин(Объект.ВремяНачало + 3600, НачалоДня(Объект.Дата) + 86400 - 60); //начало следующего дня минус минута
	КонецЕсли;
	СинхронизироватьДатыВстречи(2);

КонецПроцедуры




&НаКлиенте
Процедура ПриИзмененииСвязанномСВознаграждением(Элемент)//из элементов управления
	//Вызывается при изменении 
	//Курьер,ИсточникФинансирования,ВознаграждениеКурьера,НомерЗаявки
	//СВС+
	//ОбновитьПараметры(ЭтотОбъект);
	//СВС-
	Если Объект.ВознаграждениеОтКлиента = 0 Тогда
		_ИсточникФинансирования = ПредопределенноеЗначение("Перечисление.уб_ИсточникиФинансирования.Менеджер");
	Иначе
		_ИсточникФинансирования = ПредопределенноеЗначение("Перечисление.уб_ИсточникиФинансирования.Клиент");
	КонецЕсли;	
	
	уб_Клиент._УстановитьЗначение(Объект,"ИсточникФинансирования",_ИсточникФинансирования);
	
	//Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
	//	Элементы.ВознаграждениеОтКлиента.Видимость = Истина;
	//Иначе
	//	Элементы.ВознаграждениеОтКлиента.Видимость = Ложь;
	//	ВознаграждениеОтКлиента = 0;
	//КонецЕсли;	
	//Элементы.ВознаграждениеОтКлиента.ТолькоПросмотр = Срочная;
	//Если Срочная И ВознаграждениеОтКлиента<>0 Тогда
	//	ВознаграждениеОтКлиента = 0;
	//КонецЕсли;	
	Комиссия = 0;
	СКВ = РасчетСКВПоЗаявке(Комиссия);
	РасчетВознагражденийУдержаний();
	
КонецПроцедуры


&НаКлиенте
Процедура ЭлементыФормыЗапретОчистки(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


#КонецОбласти

#Область СобытияТабличнойЧасти
&НаКлиенте
Процедура БСОДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	
	СтандартнаяОбработка = Ложь;
	БСОРедактирование(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьБСО(Команда)
	СтандартнаяОбработка = Ложь;
	БСОРедактирование(Элементы.БСОДерево);
КонецПроцедуры


&НаКлиенте
Процедура БСОДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ (ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ И НЕ Записать()) Тогда
		Отказ = Истина;
		Строка = Объект.БСО.Добавить();
		Строка.УидСтроки = Новый УникальныйИдентификатор();
		Если Копирование = Истина Тогда
			
			//Выборочно копируются данные
			ТекущиеДанные = Элемент.ТекущиеДанные;
			Родитель = ТекущиеДанные.ПолучитьРодителя();
			Если ЗначениеЗаполнено(Родитель) Тогда
				//Это подчиненный копирование недопустимо
				  Возврат;
			КонецЕсли;	
			Строка.ВидБСО = ТекущиеДанные.ВидБСО;
			Строка.СК     = ТекущиеДанные.СК;
			//АУДИТ+
				Объект.КомментарийСлужебный = Объект.КомментарийСлужебный+Символы.ПС+"+="+Строка.ВидБСО+"/"+уб_ВызовСервера.ТекущийПользователь()+"; ";					
			//АУДИТ-
			
			
			//++
			нСтроки= Объект.БСО.НайтиСтроки(Новый Структура("УидСтроки",ТекущиеДанные.УидСтроки));
			
			Если нСтроки.Количество()>0 Тогда
				ФактСтрока = нСтроки[0];
			Иначе
				Возврат;
			КонецЕсли;	
			
			Строка.Поставщик                    = ФактСтрока.Поставщик;
			Строка.ОрганизацияАгент             = ФактСтрока.ОрганизацияАгент;
			Строка.МаркаТС                      = ФактСтрока.МаркаТС;
			Строка.МодельТС                     = ФактСтрока.МодельТС;
			Строка.ПредоставленнаяСкидкаПроцент = ФактСтрока.ПредоставленнаяСкидкаПроцент;
			Строка.КВБрокераПлан                = ФактСтрока.КВБрокераПлан;
			Строка.Количество                   = ФактСтрока.Количество;
			Попытка
				Строка.ОбъектСтрахования            = ФактСтрока.ОбъектСтрахования;
			Исключение
			КонецПопытки;	
			
			нСтроки = Объект.БСО.НайтиСтроки(Новый Структура("УидРодителя",ТекущиеДанные.УидСтроки));
			
			Для каждого нСтрока из нСтроки Цикл
				подчСтрока = Объект.БСО.Добавить();
				подчСтрока.УидРодителя = Строка.УидСтроки;
				подчСтрока.ВидБСО 						= нСтрока.ВидБСО;
				подчСтрока.СК     						= нСтрока.СК;
				подчСтрока.Поставщик                    = нСтрока.Поставщик;
				подчСтрока.ОрганизацияАгент             = нСтрока.ОрганизацияАгент;
				подчСтрока.МаркаТС                      = нСтрока.МаркаТС;
				подчСтрока.МодельТС                     = нСтрока.МодельТС;
				подчСтрока.ПредоставленнаяСкидкаПроцент = нСтрока.ПредоставленнаяСкидкаПроцент;
				подчСтрока.КВБрокераПлан                = нСтрока.КВБрокераПлан;
				подчСтрока.СуммаВзноса                  = нСтрока.СуммаВзноса;
				подчСтрока.СтраховаяПремия              = нСтрока.СтраховаяПремия;
				подчСтрока.ИтогСтраховаяПремия          = нСтрока.ИтогСтраховаяПремия;
				подчСтрока.ИтогСуммаВзноса              = нСтрока.ИтогСуммаВзноса;
				подчСтрока.Количество                   = нСтрока.Количество;
				подчСтрока.УидСтроки = Новый УникальныйИдентификатор();
			КонецЦикла;
			                                               
			//Строка.
			//Строка.
			//Строка.
			//Строка.
			//Строка.
			//--
		Иначе
			Строка.Количество = 1;
		КонецЕсли;
		Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыЭлементДерева") Тогда
			//При копировании правой кнопкой или F9
			ТекущаяСтрока = БСОДерево.ПолучитьЭлементы().Добавить();
			Если Копирование = Истина Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Строка);
			Иначе
				//Это дерево там не все данные
				//ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Строка,"МаркаТС,МодельТС,Vin,ОбъектСтрахования");
			КонецЕсли;	
			Элементы.БСОДерево.ТекущаяСтрока = ТекущаяСтрока;
			//Элементы.БСО.ТекущаяСтрока = Строка;
		Иначе
			//Элементы.БСО.ТекущаяСтрока = Строка;	
			Если Элемент.Имя = "БСОДерево"  Тогда
				ТекущаяСтрока = БСОДерево.ПолучитьЭлементы().Добавить();
				Если Копирование = Истина Тогда
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Строка);
				Иначе
					//Это дерево там не все данные
					ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Строка,"УидСтроки");
					//ЗаполнитьЗначенияСвойств(ТекущаяСтрока,Строка,"МаркаТС,МодельТС,Vin,ОбъектСтрахования");
				КонецЕсли;	
				Элементы.БСОДерево.ТекущаяСтрока = ТекущаяСтрока;
			КонецЕсли;
						
		КонецЕсли;
		
		
		//ДополнительныеСвойства.Вставить("НеОповещатьСтатусы",Ложь);
		
		БСОРедактирование(Элемент, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБСО(Команда)
	Отказ = Ложь;
	Копирование = Ложь;
	Родитель = БСОДерево.ПолучитьЭлементы();
	Группа   = Неопределено;
	Параметр = Неопределено;
	БСОДеревоПередНачаломДобавления(Элементы.БСОДерево, Отказ, Копирование, Родитель, Группа, Параметр)
КонецПроцедуры

&НаКлиенте
Процедура БСОРедактирование(
	Элемент = Неопределено, 
	НоваяСтрока = Неопределено, 
	ОтменаРедактирования = Ложь, 
	Отказ = Ложь, 
	НоваяФормаБСО = Истина
	)
	
	Записать();
	
	ПроверитьСвязанныеБСО = Ложь;
	РасширениеКартинки = "jpeg";
	
	НоваяСтрока = ?(НоваяСтрока = Неопределено, Ложь, НоваяСтрока);
	Если НоваяСтрока = Истина Тогда
		Для каждого ТекПустаяСтрока из БсоДерево.ПолучитьЭлементы() Цикл
			Если ПустаяСтрока(ТекПустаяСтрока.УидСтроки)
				или (ЗначениеЗаполнено(ТекПустаяСтрока.ВидБСО) = ЛОЖЬ и ТекПустаяСтрока.ИтогСтраховаяПремия = 0 )
				Тогда
				ТекСтрока = ТекПустаяСтрока;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если Не ТекСтрока = Неопределено Тогда
			Если  ПустаяСтрока(ТекСтрока.УидСтроки) Тогда
				ТекСтрока.УидСтроки = Новый УникальныйИдентификатор();
			КонецЕсли;	
			Если Объект.БСО.НайтиСтроки(Новый Структура("УидСтроки",ТекСтрока.УидСтроки)).Количество() = 0 Тогда 
				НоваяСтрокаБСО = Объект.БСО.Добавить();
				НоваяСтрокаБСО.УидСтроки = ТекСтрока.УидСтроки;
			КонецЕсли;
		КонецЕсли;	
	Иначе	
		ТекСтрока = Элемент.ТекущиеДанные;//Элементы.БСО.ТекущаяСтрока;
		Если ТипЗнч(ТекСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
			Если НЕ ТекСтрока.ПолучитьРодителя()=Неопределено Тогда
				Если НЕ ТипЗнч(ТекСтрока.ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
					//!!!
					//Если ТекСтрока.ВидБСО.Тип<>Перечисления.уб_ТипыБСО.Полис
					//	или ТекСтрока.ВидБСО.Тип<>Перечисления.уб_ТипыБСО.ПолисОсаго Тогда
					//	//Редактируется через родителя
					//	ТекСтрока = ТекСтрока.Родитель;
					//Конецесли;	
				Конецесли;	
			КонецЕсли;
			ТекСтрока = Объект.БСО.НайтиСтроки(Новый Структура("УидСтроки",ТекСтрока.УидСтроки)); 
			Если ТекСтрока.Количество() = 0 Тогда
				ТекСтрока = Неопределено;
			Иначе
				ТекСтрока = ТекСтрока[0];
			КонецЕсли;
			
			Если ТекСтрока = Неопределено Тогда
				Попытка
					ТекСтрока = Объект.БСО[Элемент.ТекущаяСтрока.НомерСтроки-1];
				Исключение
					Отказ = Истина;
					Возврат
				КонецПопытки;	
			КонецЕсли;
			
		Иначе
			//Табличная часть	
		КонецЕсли;	
	КонецЕсли;	
	Если ТекСтрока <> Неопределено Тогда
		Если Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный") 
			И НоваяФормаБСО
			Тогда
			СтандартнаяФорма = Ложь;
			ИмяФормыТЧ = "ФормаТЧОтделаБСОУправляемая";
		Иначе
			СтандартнаяФорма = Истина;
			ИмяФормыТЧ = "ФормаТЧУправляемая";
		КонецЕсли;
		
		//Форма.ДокументОбъект = ЭтотОбъект;
		
		//Если СтандартнаяФорма = Ложь Тогда
		//	Если ТолькоПросмотр Тогда
		//		Форма.Элементы.Расчетчик.ИзменяетДанные      = Ложь;
		//		Форма.Элементы.ДопСоглашение.ИзменяетДанные  = Ложь;
		//		Форма.Элементы.ДругиеДокументы.ИзменяетДанные = Ложь;
		//	Иначе
		//		Форма.Элементы.Расчетчик.ИзменяетДанные      = Истина;
		//		Форма.Элементы.ДопСоглашение.ИзменяетДанные  = Истина;
		//		Форма.Элементы.ДругиеДокументы.ИзменяетДанные = Истина;	
		//	КонецЕсли;
		//КонецЕсли;
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ТолькоПросмотр", 	ТолькоПросмотр Или Элементы.БСОДерево.ТолькоПросмотр);//Элементы.БСО.ТолькоПросмотр;
		
		ТекстрокаБСО = Объект.БСо.НайтиСтроки(Новый Структура("УидСтроки",Текстрока.УидСтроки));
		Если ТекстрокаБСО.Количество()>0 Тогда
			ТекстрокаБСО = ТекстрокаБСО[0];
			Для каждого РеквизитТЧ из уб_ВызовСервера.РеквизитыБСОЗаявки() Цикл
				Попытка
					ПараметрыФормы.Вставить(РеквизитТЧ.Имя, Текстрока[РеквизитТЧ.Имя]);
				Исключение
				КонецПопытки;	
			КонецЦикла;	
			Если ЗначениеЗаполнено(ПараметрыФормы.ФормаОплатыСтрока) = Ложь Тогда
				ПараметрыФормы.Вставить("ФормаОплатыСтрока",Объект.ФормаОплаты);
			КонецЕсли;	
		КонецЕсли;
		
		//ЗаполнитьЗначенияСвойств(Форма, ТекСтрока);
		Если СтандартнаяФорма Тогда
			ПараметрыФормы.Вставить("Техосмотр_ДатаВремя",Объект.Техосмотр_ДатаВремя);
			ПараметрыФормы.Вставить("Техосмотр_Наименование",Объект.Техосмотр_Наименование);
			ПараметрыФормы.Вставить("Техосмотр_АдресТелефон",Объект.Техосмотр_АдресТелефон);
			ПараметрыФормы.Вставить("ДокументДата",Объект.Дата);
			ПараметрыФормы.Вставить("ДокументНомер",Объект.Номер);
			ПараметрыФормы.Вставить("ДокументСамовыезд",Объект.Самовыезд);
			ПараметрыФормы.Вставить("ДокументКурьер",Объект.Курьер);
			ПараметрыФормы.Вставить("ДокументУтвержденоДата",Объект.УтвержденоДата);
			ПараметрыФормы.Вставить("ДокументСтрахователь",Объект.Страхователь);
			ПараметрыФормы.Вставить("ДокументСсылка",Объект.Ссылка);
			ПараметрыФормы.Вставить("ДокументМенеджер",Объект.Менеджер);
		КонецЕсли;	
		Если НоваяСтрока Тогда
			ПараметрыФормы.Вставить("Модифицированность", Истина);
			Если СтандартнаяФорма Тогда
				//Форма.Элементы.РассрочкаПлатежа.ТриСостояния = Истина;
				ПараметрыФормы.Вставить("РассрочкаПлатежа",1);
				ПараметрыФормы.Вставить("БезубыточныйПереход","Нет");
				ПараметрыФормы.Вставить("ОфициальнаяСкидка","Нет");

				ПараметрыФормы.Вставить("фФраншиза", 		Истина);
				ПараметрыФормы.Вставить("ЭтоНоваяСтрока",   Истина);
			Иначе
				//Форма.Валюта 	= Константы.ВалютаРегламентированногоУчета.Получить();
				ПараметрыФормы.Вставить("Форма.Курс",1);
				ПараметрыФормы.Вставить("Форма.Кратность",1);
			КонецЕсли;
		Иначе
			Если СтандартнаяФорма Тогда
				ПараметрыФормы.Вставить("ЭтоНоваяСтрока",Ложь);
				ПараметрыФормы.Вставить("БезубыточныйПереход",?(ТекСтрока.БезубыточныйПереход, "Да", "Нет"));
				ПараметрыФормы.Вставить("ОфициальнаяСкидка",?(ТекСтрока.ОфициальнаяСкидка, "Да", "Нет"));		
				//Форма.Элементы.РассрочкаПлатежа.ТриСостояния = Ложь;
				//ПараметрыФормы.Вставить("РассрочкаПлатежа",ТекСтрока.РассрочкаПлатежа);	
				//ПараметрыФормы.Вставить("ОбъектСтрахования",ТекСтрока.ОбъектСтрахования);
				//
				//ПараметрыФормы.Вставить("ДатаОформления",ТекСтрока.ДатаОформления);
				//ПараметрыФормы.Вставить("ДатаНачала",ТекСтрока.ДатаНачала);
				//ПараметрыФормы.Вставить("ДатаОкончания",ТекСтрока.ДатаОкончания);
				//ПараметрыФормы.Вставить("Vin",ТекСтрока.Vin);
				ПараметрыФормы.Вставить("ФормаОплаты",ТекСтрока.ФормаОплатыСтрока);
			КонецЕсли;
		КонецЕсли;
		//Если СтандартнаяФорма Тогда
		//	Форма.ДобавитьОбразец = СписокСтрокПечатьОбразцовВидовБСО.НайтиПоЗначению(ТекСтрока) <> Неопределено;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ  Тогда
			//ДополнительныеСвойства.Вставить("НеОповещатьСтатусы",Истина);
			//Требуется ссылка для файлов и прочего
			Если Не Записать() Тогда
			   Возврат;	
		   КонецЕсли;
		  // ДополнительныеСвойства.Вставить("НеОповещатьСтатусы",Ложь);
		КонецЕсли;
		Если ПустаяСтрока(ТекСтрока.УидСтроки) Тогда
			ТекСтрока.УидСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
		    Форма = ПолучитьФорму("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Форма."+ИмяФормыТЧ,ПараметрыФормы,Элементы.БСОДерево);
			//Форма.УИДСтроки = ТекСтрока.УидСтроки;
			//Попытка
			//	Форма.НомерСтроки = ТекСтрока.НомерСтроки;
			//Исключение
			//КонецПопытки;	
			//Форма.ВладелецФормы = ЭтаФорма;
			//Форма.ЗакрыватьПриЗакрытииВладельца = Истина;
			Форма.Открыть();//Модально();
			//ОбработкаЗакрытияСтрокиТЧ(Форма);
		КонецЕсли;
	

	
КонецПроцедуры	


&НаКлиенте
Процедура БСОДеревоПослеУдаления(Элемент)

	ОбновитьИтоги();
	//ОбновитьРекомендованнуюСумму();
	РасчетВознагражденийУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура БСОДеревоПередУдалением(Элемент, Отказ)
	тд = Элементы.БСОДерево.ТекущиеДанные;	
	Если тд = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ВсегоВложенных = тд.ПолучитьЭлементы().Количество();
	//Ответ = Вопрос("Удалить бланк "+тд.ВидБСО +?(ВсегоВложенных>0," и "+ВсегоВложенных+" связанных бсо",""), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Подтверждение удаления");
	//Если Не Ответ = КодВозвратаДиалога.Да Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//Если ВсегоВложенных> 0 Тогда
	//	Для каждого СтрокаД Из тд.ПолучитьЭлементы()  Цикл
	//		Удалено = УдалитьСтрокуБСОПоДереву(СтрокаД);			
	//		Если Удалено = Ложь Тогда
	//			Отказ = Истина;
	//		КонецЕсли;	
	//	КонецЦикла;
	//КонецЕсли;
	
	
	
	Если НЕ Отказ = Истина  Тогда
		Удалено = УдалитьСтрокуБСОПоДереву(тд);
		Если Удалено = Ложь Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Функция УдалитьСтрокуБСОПоДереву(тд)
	УидСтроки = тд.УидСтроки;
	Если не ПустаяСтрока(УидСтроки) Тогда
		нСтрока  = Объект.БСО.НайтиСтроки(Новый Структура("УидСтроки",УидСтроки));
	Иначе
		нСтрока  = Объект.БСО.НайтиСтроки(Новый Структура("НомерСтроки",ТД.НомерСтроки));
	КонецЕсли;
	Если нСтрока.Количество()>0 Тогда
		нСтрока = нСтрока[0]
	Иначе
		нСтрока = Неопределено;
	КонецЕсли;	
	
	Если Не нСтрока  = Неопределено Тогда
		КопияСтроки = Новый Структура;
		Для каждого Рекв из уб_ВызовСервера.РеквизитыБСОЗаявки() Цикл
			КопияСтроки.Вставить(Рекв.Имя,нСтрока[Рекв.Имя]);
		КонецЦикла;
		СтрокаКУдалению = "-"+нСтрока.ВидБСО+"/"+Уб_ВызовСервера.ТекущийПользователь()+"; ";
		Объект.БСО.Удалить(нСтрока);
		Отказ = Ложь;
		Для каждого СтрокаБСО из Объект.БСО Цикл 
			
			//Попытка
			//	ПриВыбореВидаБСО = ?(ЗначениеЗаполнено(СтрокаБСО.ВидБСО),СтрокаБСО.ВидБСО.ПриВыбореВидаБСО,"");
			//Исключение
				ПриВыбореВидаБСО = "";
			//КонецПопытки;
			
			Если Не ПустаяСтрока(ПриВыбореВидаБСО) Тогда
				
				СК            = СтрокаБСО.СК;
				ВидБСО        = СтрокаБСО.ВидБСО;
				ВладелецФормы = ЭтаФорма;
				Поставщик     = СтрокаБСО.Поставщик;
				ЭтоЮрлицо     = ТипЗнч(Объект.Страхователь)= Тип("СправочникСсылка.Контрагенты") ИЛИ Найти(Объект.Страхователь,"ООО")>0 ИЛИ Найти(Объект.Страхователь,"Общество")>0;
				Попытка
					Выполнить(ПриВыбореВидаБСО);
					Если Отказ = Истина Тогда
						Прервать;
					КонецЕсли;	
					
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
		КонецЦикла;	
		Если Отказ = Ложь Тогда
			КомментарийСлужебный = СтрокаКУдалению+КомментарийСлужебный+Символы.ПС;
			Модифицированность   = Истина;
			Возврат Истина;
		Иначе
			ВосстановленнаяСтрока = Объект.БСО.Добавить();
			ЗаполнитьЗначенияСвойств(ВосстановленнаяСтрока,КопияСтроки);
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция ОбновитьОбъектИзСсылки()
	ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЭтаФорма.ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецФункции	

&НаКлиенте
Процедура БСОДеревоОбработкаВыбора(Элемент, СтруктураСтроки, СтандартнаяОбработка)
	Если СтруктураСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;	
	Если СтруктураСтроки.Свойство("ЭтоЗакрытиеБезСохранения") и СтруктураСтроки.ЭтоНоваяСтрока = Истина Тогда
		//Удаляем, это заготовки строк
		СтрокиБСО = Объект.БСо.НайтиСтроки(Новый Структура("УидСтроки",СтруктураСтроки.УидСтроки));	
		Если СтрокиБСО.Количество()>0	 Тогда
			Объект.БСо.Удалить(Объект.БСо.Индекс(СтрокиБСО[0]));
		КонецЕсли;	
		
		СтрокиДерева = БсоДерево.ПолучитьЭлементы() ;
		Для каждого ТекСтрока из СтрокиДерева Цикл
			Если ТекСтрока.УидСтроки = СтруктураСтроки.УидСтроки  Тогда
				СтрокиДерева.Удалить(СтрокиДерева.Индекс(ТекСтрока));
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Возврат
	КонецЕсли;	
	//ОбновитьОбъектИзСсылки();
	//ЭтаФорма.ОбновитьОтображениеДанных();
	Если Объект.БСо.Количество() = 0 Тогда
		СтрокаБСО = Объект.БСо.Добавить();
		СтрокаБСО.УидСтроки = СтруктураСтроки.УидСтроки;
	КонецЕсли;	
	СтрокиБСО = Объект.БСо.НайтиСтроки(Новый Структура("УидСтроки",СтруктураСтроки.УидСтроки));
	Если СтрокиБСО.Количество() = 0 Тогда
		Сообщить("Не найдена строка по УИД!!!");
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокиБСО[0],СтруктураСтроки); 
		СтрокиБСО[0].ФормаОплатыСтрока = СтруктураСтроки.ФормаОплаты;
		Модифицированность = Истина;
		Объект.Техосмотр_АдресТелефон = СтруктураСтроки.Техосмотр_АдресТелефон;
		Объект.Техосмотр_ДатаВремя    = СтруктураСтроки.Техосмотр_ДатаВремя;
		Объект.Техосмотр_Наименование = СтруктураСтроки.Техосмотр_Наименование;
		ФлНайден = Ложь;
		Для каждого СтрокаДерева из БСоДерево.ПолучитьЭлементы() Цикл
			Если СтрокаДерева.УидСтроки = СтруктураСтроки.УидСтроки Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки); 
				СтрокаДерева.ФормаОплатыСтрока = СтруктураСтроки.ФормаОплаты;
				ФлНайден = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если ФлНайден = Ложь Тогда
			СтрокаДерева = БСоДерево.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураСтроки); 
		КонецЕсли;	
		
		ОбновитьИтоги(ЛОЖЬ);
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти


#Область КомандыФормы
&НаКлиенте
Процедура ПоискКлиентаВБазе(Команда)
	Если ПустаяСтрока(Наименование) Тогда
		ПоказатьПредупреждение (,"Внесите ФИО или Название/ИНН организации для юрлица");
		Возврат 
	КонецЕсли;	
	ТипСтрахователь = ТипЗнч(Объект.Страхователь);
	
	АдресВХранилище = АдресСпискаСтрахователей(Наименование,ТипСтрахователь);
	
	
	Если НЕ АдресВХранилище = "" Тогда
		ОткрытьФорму("ОбщаяФорма.уб_ФормаПросмотраТЗУправляемая",Новый Структура("АдресТаблицыЗначений",АдресВХранилище),Элементы.Наименование);
	КонецЕсли;	
	ВыполненПоискСтрахователя = Истина;
	НастройкиНаименования();
	//Фрм = ПолучитьОбщуюФорму("уб_ФормаПросмотраТЗ",ЭтаФорма);
	//Фрм.ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	//Фрм.ТолькоПросмотр 	= Истина;
	//Результат = Фрм.ОткрытьМодально();
	//
	//ВыполненПоискСтрахователя = Истина;
	//НастройкиНаименования();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВЧат(Команда)
	//Если Номер = 0 Тогда
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ Тогда
		Записать();
	КонецЕсли;	
	НовыйКанал = "З-"+Формат(Объект.Номер,"ЧГ=");
	
	ПараметрыЧата = Новый Структура;
	ПараметрыЧата.Вставить("Период",ТекущаяДата());
	ПараметрыЧата.Вставить("ИмяКанала",НовыйКанал);
	ПараметрыЧата.Вставить("Отправитель", уб_вызовСервера.ТекущийПользователь());
	
	Если ПараметрыЧата.Отправитель = Объект.Менеджер Тогда
		Если ЗначениеЗаполнено(Объект.Оператор) Тогда
			ПараметрыЧата.Вставить("Получатель", Уб_ВызовСервера.ПользовательПоФизлицу(Объект.СтаршийОператор));	
			//Иначе
			//	ПараметрыЧата.Получатель =  Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Менеджер);	
		КонецЕсли;
		
	Иначе
		ПараметрыЧата.Вставить("Получатель",  Уб_ВызовСервера.ПользовательПоФизлицу(Объект.Менеджер));
	КонецЕсли;
	ПараметрыЧата.Вставить("ИДСообщения",Новый УникальныйИдентификатор);
	ПараметрыЧата.Вставить("Заголовок", "Заявка "+Формат(Объект.Номер,"ЧГ=")+", страхователь: "+Объект.Страхователь);
	
	Форма = ПолучитьФорму("РегистрСведений.уб_Чат_Сообщения.Форма.ФормаЗаписиУправляемая",ПараметрыЧата,Элементы.Сообщения);
	
	Форма.ТекущийЭлемент = Форма.Элементы.Сообщение;
	
	Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура СтраховательПриИзменении(Элемент,ПриОткрытии = ЛОЖЬ)
	
	//НеСтрока =  Не ТипЗнч(Страхователь) = Тип("Строка");
	//Элемент.КнопкаВыбора = НеСтрока;
	//Если НеСтрока Тогда //Старые значения не ограничиваем
	//	ДопустимыеТипы = Новый Массив;
	//	ДопустимыеТипы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	//	ДопустимыеТипы.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	//	ОписаниеТипов  = Новый ОписаниеТипов(ДопустимыеТипы);
	//	Элементы.Страхователь.ОграничениеТипа = ОписаниеТипов;
	//КонецЕсли;
	//Если ПриОткрытии = ЛОЖЬ Тогда
	//	ЗаполнитьСписокВыбораМестоВстречи();
	//КонецЕсли;
	Наименование= Наименование(Объект.Страхователь);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьВРеализацию(Команда)
	
	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если Объект.Проведен и Команда<>Неопределено Тогда
		//ОсталосьДоВыезда = Дата-ТекущаяДата();
		ОсталосьДоВыезда = Объект.ВремяВстречиКлиент-ТекущаяДата();
		
		Если ОсталосьДоВыезда <3600  и Объект.ТипВыезда = 0 Тогда
			ПоказатьПредупреждение(,"До выезда менее часа или просрочен. Запрещено");
			Возврат;
		КонецЕсли;	
		СтатусЗаявки = уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка, ТекущаяДата());
		Если СтатусЗаявки = ПредопределенноеЗначение("Перечисление.уб_СтатусыЗаявок.СогласованиеСКлиентом") Тогда
			Если Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный")
				или Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.ПервичныйОсмотр") Тогда
				Действие = "УстановитьСтатус_НазначениеКурьера";
				СтрокаРеквизитов = Неопределено;
			Иначе	
				Действие = "УстановитьСтатус_ФормированиеКомплектаБСО";
				СтрокаРеквизитов = Неопределено;
			КонецЕсли;	
			
			уб_УСЗ.ВыполнитьДействиеПоЗаявке(Объект.Ссылка, СтатусЗаявки, Действие, СтрокаРеквизитов,,,,);
		КонецЕсли;	
	КонецЕсли;	
	ВидимостьСтатусаЗаявки();
	Закрыть("СохранитьИОтправить");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПечати(Команда)
	
	ПараметрыПечати = Неопределено;
	Уб_Клиент.ПечатьПоКнопке(ЭтаФорма,Команда,ПараметрыПечати);
	
КонецПроцедуры	



#КонецОбласти

#Область ВспомогательныеФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ Тогда
		//!!!
		ЗаполнениеНовогоДокумента();
		//
		ПараметрСтатуса = Неопределено;
		СтатусЗаявки = Перечисления.уб_СтатусЗаявки.ПустаяСсылка();
	Иначе
		Если Объект.Источник = Неопределено Тогда
			Объект.Источник = Справочники.ФизическиеЛица.ПустаяСсылка();	
		КонецЕсли;	
		ПараметрСтатуса = ЧастнаяСтруктураСтатусаДокумента();
		СтатусЗаявки = уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(Объект.Страхователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ТипСтрахователя = "ФИО";
	КонецЕсли;	
	
	ПроверкаЗаявокОтделомКонтроля = ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля;
	
	уб_temp.УстановитьСтатусДокумента(ЭтаФорма, Истина, ПараметрСтатуса);
	
	Элементы.РезультатПроверки.СписокВыбора.Очистить();
	Элементы.РезультатПроверки.СписокВыбора.Добавить(Перечисления.уб_РезультатПроверкиЗаявки.ПринятоВРаботу);
	Элементы.РезультатПроверки.СписокВыбора.Добавить(Перечисления.уб_РезультатПроверкиЗаявки.Отклонено);
	
	ПрименитьКанал();
	
	ОбновитьИтоги(,Истина);
	
	ПостроитьДеревоБСО();
	//Элементы.РасчетыПоЗаявке.ТолькоПросмотр	;
	
	
	СписокОператоров = уб_ВызовСервера.СписокОператоров(Ложь);
	
	Элементы.СтаршийОператор.СписокВыбора.ЗагрузитьЗначения(СписокОператоров);
	Элементы.БСОДеревоТекущийОператор.СписокВыбора.ЗагрузитьЗначения(СписокОператоров);
	
	ЭтоОператор = НЕ СписокОператоров.Найти(ПараметрыСеанса.уб_ТекущееФизЛицо) = Неопределено;
	ЭтоОператорИлиУправлениеПечатью = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") ИЛИ ЭтоОператор ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.УправлениеПечатью"), Ложь);
	ПодразделениеПользователя = уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо, Объект.Дата);
	ПодразделениеМенеджера    = уб_СС.ПолучитьПодразделениеАгента(Объект.Менеджер, Объект.Дата);
	
	ЭтоОтделБСО =  ПодразделениеПользователя = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО ИЛИ уб_КЭШируемые.ДоступностьРоли("уб_СотрудникОтделаБСО");
	//ВыбраннаяСтрока.Оператор <> ПараметрыСеанса.уб_ТекущееФизЛицо И уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.УправлениеПечатью"), Ложь)
	
	
	
	ПодобратьВидОплаты(ЭтаФорма,Объект);
	ОбновитьВидыОплаты(Элементы.ВидОплаты);
	
	
	ПриИзмененииТипа("Не обновлять вознаграждение курьера и удержание менеджера");//ВЫЗЫВАЕТ ИзменитьДоступность(Истина)!;
	
	ПриИзмененииСамовыезд(Истина);
	
	Данныеформы = РеквизитФормыВЗначение("Объект");
	ПараметрыСотрудникаИДокумента = ПолучитьИзВременногоХранилища(АдресПараметровВызова);
	Данныеформы.РасчетВознагражденияКурьера(ПараметрыСотрудникаИДокумента);
	
	
	//	ТекущийЭлемент = Элементы.БСО;
	//БСОПриАктивизацииСтроки(Неопределено);
	
	//Устарело?
	//УстановитьПровереноРуководителем();
	
	
	//пока не удалены типы отдела БСО из перечисления - список выбора и нет редактирования текста
	СЗ = Элементы.Тип.СписокВыбора;
	Прч = Перечисления.уб_ТипВыезда;
	СЗ.Добавить(Прч.Страховка, 			"Страховка");
	СЗ.Добавить(Прч.Пролонгация,		"Пролонгация");
	СЗ.Добавить(Прч.ПервичныйОсмотр,	"Осмотр");
	СЗ.Добавить("Административный",		"Административный");
	
	СЗ.Добавить(Прч.Аддендум,			"Аддендум");
	//СЗ.Добавить("Аддендум ОСАГО",		"Аддендум ОСАГО");
	//СЗ.Добавить("Административный",		"Административный");
	//СЗ.Добавить("Добор документов",		"Добор документов");
	//СЗ.Добавить("Доплата по ошибке",	"Доплата по ошибке");
	//СЗ.Добавить("Доп. соглашение",		"Доп. соглашение");
	СЗ.Добавить(Прч.ОчереднойВзнос,		"Очередной взнос");
	//
	//СЗ.Добавить(Прч.Переосмотр,			"Переосмотр");
	//
	//СЗ.Добавить(Прч.Перепись,			"Перепись");
	//СЗ.Добавить("Перепись ОСАГО",		"Перепись ОСАГО");
	
	
	СЗ  = Элементы.Источник.СписокВыбора;
	СЗ.ЗагрузитьЗначения(уб_ВызовСервера.ИсточникиЗаявок());
	
	уб_temp.УстановитьСтатусДокумента(ЭтаФорма, Истина, ПараметрСтатуса);
	//уб_СС.ЗаполнитьИнфСтроку(ЭтаФорма);
	//Кнопка = ЭтаФорма.Элементы.ДействияФормы.Кнопки;	
	//уб_temp.ДобавитьКнопкиПанелиДействий(Кнопка, ИмяФормы);
	//КлючСохраненияПоложенияОкна = ИмяФормы;		
	
	уб_ФормыВызовСервера.УстановитьКнопкиПечати(ЭтаФорма,,Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_СостояниеОформления.Ссылка
	|ИЗ
	|	Перечисление.НеобходимостьОсмотра КАК уб_СостояниеОформления";
	Элементы.НеобходимостьОсмотра.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));	
	
	
	//СЗ = Элементы.НомерДоговора.СписокВыбора;
	//СЗ.Добавить("Строка");
	//СЗ.Добавить("Страховой полис");
	
	ВидимостьСуммыПоКарте();
	
	
	Элементы.СК.СписокВыбора.ЗагрузитьЗначения(уб_СЛ.ПолучитьСписокСК(ПараметрыСеанса.уб_Количество_ТОП_дляСписков).ВыгрузитьЗначения());
	
	
	ЗаполнитьСпискиГородов();
	
	Элементы.СтанцияМетро.СписокВыбора.ЗагрузитьЗначения(уб_КЭШируемые.СписокСтанцийМетро());
	Элементы.СтанцияМетро.ВысотаСпискаВыбора = 15;
	
	
	//СЗ = Элементы.ИсточникФинансирования.СписокВыбора;
	//СЗ.Добавить(Перечисления.уб_ИсточникиФинансирования.Менеджер);
	//СЗ.Добавить(Перечисления.уб_ИсточникиФинансирования.Клиент);
	
	Если Объект.ВознаграждениеОтКлиента = 0 Тогда
		_ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер;
	Иначе
		_ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент;
	КонецЕсли;	
	
	Уб_ВызовСервера._УстановитьЗначение(Объект,"ИсточникФинансирования",_ИсточникФинансирования);
	
	
	//СтраницаПредоставленныхДокументов(Истина);
	//Если уб_КЭШируемые.ДоступностьРоли("уб_СотрудникОтделаБСО") или Не Элементы.Контакты.ТолькоПросмотр или ТолькоПросмотр = Ложь 
	//	Тогда
	//	уб_temp.УстановитьКнопкиПечати(ЭтаФорма,, Ложь);
	//	
	//КонецЕсли;
	
	//доступность поля Контакты не зависит от изменения типов выезда
	Если ПустаяСтрока(Объект.Контакты) И Не ПустаяСтрока(Объект.ПредставлениеСтроки) Тогда
		Элементы.Контакты.ОтметкаНезаполненного 	= Ложь;
	КонецЕсли;
	СЗ = Элементы.Адрес.СписокВыбора;
	СЗ.Добавить("Офис");
	
	//Элементы.ПровереноРуководителем.СписокВыбора.Добавить(Ложь, 	"Не проверено руководителем");
	//Элементы.ПровереноРуководителем.СписокВыбора.Добавить(Истина,	"Проверено руководителем");
	
	//Элементы.ПровереноАндеррайтером.СписокВыбора.Добавить(Ложь, 	"Не проверено ОСД");
	//Элементы.ПровереноАндеррайтером.СписокВыбора.Добавить(Истина,	"Проверено ОСД");
	
	
	//СЗ = Элементы.Утверждено.СписокВыбора;
	//СЗ.Добавить(Ложь,	?(ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина,"Не требуется","Не утверждено"));
	//СЗ.Добавить(Истина,	"Утверждено");
	
	
	Элементы.СтаршийОператор.Доступность          = Объект.РезультатПроверки = Перечисления.уб_РезультатПроверкиЗаявки.ПринятоВРаботу 
	                                                ИЛИ  Объект.РезультатПроверки = Перечисления.уб_РезультатПроверкиЗаявки.ПринятоСДоработкой;
	Элементы.БСОДеревоТекущийОператор.Доступность = Элементы.СтаршийОператор.Доступность;
	//Элементы.Номер.Доступность                    = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииТипа(РасчетВК = Истина, ПриОткрытии = Ложь)
	
	Административный = Объект.Тип = Перечисления.уб_ТипВыезда.Административный;
	//Структура = Новый Структура;
	//Структура.Вставить("Имя",			"ИзменитьПолно");
	//Структура.Вставить("ТипКнопки",		ТипКнопкиКоманднойПанели.Действие);
	//Структура.Вставить("Действие",		Новый Действие("КоманднаяПанель1Изменить"));
	//Структура.Вставить("Картинка",		БиблиотекаКартинок.уб_ПризнакИзменения);
	//Структура.Вставить("Текст",			"Изменить в полной форме");
	//Структура.Вставить("Пояснение", 	"Изменить в полной форме");
	//Структура.Вставить("Подсказка",		"Изменить в полной форме");
	//Структура.Вставить("Доступность",	Истина);
	//Структура.Вставить("Отображение",   ОтображениеКнопкиКоманднойПанели.Картинка);
	//уб_temp.ДобавитьИлиУдалитьКнопкуПанели(Элементы.КоманднаяПанель1.Кнопки, Структура, Не Объект.Административный);
	Если Административный И Объект.ЦельВыезда = "Административный" Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.КонтактныеЛица"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	Иначе
		ОписаниеТипов = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100);
	КонецЕсли;
	//УстановитьВознаграждениеКурьераПоУмолчанию();
	Элементы.КонтактноеЛицо.ОграничениеТипа = ОписаниеТипов;
	Элементы.ПанельИнфоОВстрече.Доступность = НЕ Объект.Тип.Пустая();
	
	Прч = Перечисления.уб_ТипВыезда;
	ПодсказкаНеДоступно = "Недоступно для типа выезда";
	
	//Проверено руководителем
	//Элементы.ПровереноРуководителем.Видимость					= НЕ Элементы.ПровереноАндеррайтером.Видимость и Не Объект.Административный;
	
	//Номер договора, Номер заявки
	Элементы.ГруппаПродления.Доступность                           = (Объект.Тип = Прч.Пролонгация или Объект.Тип = Прч.Аддендум или Объект.Тип = Прч.ОчереднойВзнос	или Объект.Тип = Прч.Административный	);
	Элементы.СК.Доступность = Элементы.ГруппаПродления.Доступность;
	//Номер договора
	//Если Элементы.НомерДоговора.ТолькоПросмотр Тогда
	//	Элементы.НомерДоговора.Подсказка							= ПодсказкаНеДоступно;
	//	Элементы.НомерДоговора.ОтметкаНезаполненного       		= Ложь;
	//Иначе
	//	Элементы.НомерДоговора.Подсказка							= "Номер полиса";
	//	Элементы.НомерДоговора.ОтметкаНезаполненного       		= Не ЗначениеЗаполнено(Объект.НомерДоговора);
	//КонецЕсли;	
	//Исключение по номеру заявки
	Если НЕ Административный Тогда
		Элементы.НомерЗаявки.Видимость								= Истина;
	КонецЕсли;
	//ЦельВыезда по умолчанию не доступна
	//Элементы.ЦельВыезда.КнопкаСпискаВыбора						= Ложь;
	//Элементы.ЦельВыезда.ТолькоПросмотр							= Истина;
	//Элементы.ЦельВыезда.Подсказка								= ПодсказкаНеДоступно;
	//Элементы.ЦельВыезда.ОтметкаНезаполненного					= Ложь;
	
	// Страховая компания в шапке по умолчанию доступна
	Элементы.СК.ТолькоПросмотр									= Ложь;
	Элементы.СК.Подсказка										= "Страховая компания";
	Элементы.СК.ОтметкаНезаполненного							= Не ЗначениеЗаполнено(Объект.СК);
	
	//По умолчанию страхователь используется как Страхователь
	//Элементы.Страхователь.Заголовок						= "Страхователь:";
	//Элементы.Страхователь.Подсказка							= "Фамилия, имя и отчество застрахованного лица";
	
	//Признак кредитной
	
	Если Объект.Тип = Прч.Страховка Тогда
		//СТРАХОВКА
		Элементы.СК.ТолькоПросмотр									= Истина;
		Элементы.СК.Подсказка										= ПодсказкаНеДоступно;
		Элементы.СК.ОтметкаНезаполненного							= Ложь;
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//		Элементы.Утверждено.Видимость								= Истина;
	ИначеЕсли Объект.Тип = Прч.Пролонгация Тогда
		Если ПриОткрытии = Истина Тогда
			Если ТипЗнч(Объект.НомерДоговора) = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
				ТипПолисаПроодления = "Ссылка в базе";
			Иначе
				ТипПолисаПроодления = "Номер";
			КонецЕсли;	
		Иначе	
			ТипПолисаПроодления ="Ссылка в базе";
			Объект.НомерДоговора = Документы.уб_СтраховойПолис.ПустаяСсылка();
			//Элементы.НомерДоговора.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уб_СтраховойПолис");
		КонецЕсли;	
		//ПРОЛОНГАЦИЯ
		
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
	ИначеЕсли Объект.Тип = Прч.ОчереднойВзнос Тогда
		//ОЧЕРЕДНОЙ ВЗНОС
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
	ИначеЕсли Объект.Тип = Прч.Перепись Тогда
		//ПЕРЕПИСЬ
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
	ИначеЕсли Объект.Тип = Прч.Переосмотр Тогда
		//ПЕРЕОСМОТР
		//Элементы.ПолучитьДанныеЗаявкиИзБазы.Видимость				= Истина;
		//Элементы.ЦельВыезда.КнопкаСпискаВыбора						= Истина;
		//Элементы.ЦельВыезда.ТолькоПросмотр							= Ложь;
		//Элементы.ЦельВыезда.Подсказка								= ПодсказкаНеДоступно;
		//Элементы.ЦельВыезда.ОтметкаНезаполненного					= Не ЗначениеЗаполнено(Объект.ЦельВыезда);
		//Элементы.ЦельВыезда.КнопкаСпискаВыбора						= Истина;
		///Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
		//Элементы.ЦельВыезда.СписокВыбора = Новый СписокЗначений;
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("После ремонта");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Повторный предстраховой осмотр");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Грязный автомобиль");
	ИначеЕсли Объект.Тип = Прч.Административный Тогда
		//АДМИНИСТРАТИВНЫЙ
		//Элементы.ПризнакСтраховкиКредитная.Доступность	= Ложь;
		Если Объект.ЦельВыезда = "Административный" Тогда
			Элементы.НомерЗаявки.Видимость					= Ложь;
			Элементы.Страхователь.Подсказка				= "Фамилия, имя и отчество контактного лица";
			//Если УстановитьЗначение(ПризнакСтраховкиКредитная, Ложь) Тогда
			//	ПризнакСтраховкиКредитнаяПриИзменении(Неопределено);
			//КонецЕсли;
		Иначе                                                   
			Элементы.НомерЗаявки.Видимость					= Истина;
		КонецЕсли;
		//Элементы.ЦельВыезда.КнопкаСпискаВыбора						= Истина;
		//Элементы.ЦельВыезда.ТолькоПросмотр							= Ложь;
		//Элементы.ЦельВыезда.Подсказка								= "Цель выезда";
		//Элементы.ЦельВыезда.СписокВыбора = Новый СписокЗначений;
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Административный");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Добор документов");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Доп. соглашение");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Перепись ОСАГО");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Доплата по ошибке");
		//Элементы.ЦельВыезда.СписокВыбора.Добавить("Аддендум ОСАГО");
		//для некоторых целей не требуется БСО
		МассивЦелейБезБСО = Новый Массив;
		МассивЦелейБезБСО.Добавить("Административный");
		МассивЦелейБезБСО.Добавить("Доп. соглашение");
		МассивЦелейБезБСО.Добавить("Добор документов");
		
		Если Не Объект.НетБСО И МассивЦелейБезБСО.Найти(Объект.ЦельВыезда) <> Неопределено И Объект.БСО.Количество() = 0 Тогда
			Объект.НетБСО = Истина;
			ЕстьБСО = ЛОЖЬ;
			ОбновитьИтоги();
			Сообщить("Установлен флаг ""Не требуются БСО"". По данной цели выезда БСО не требуется");
		КонецЕсли;
		
		//Элементы.Утверждено.Видимость								= Ложь;
		
	ИначеЕсли Объект.Тип = Прч.Аддендум Тогда
		//АДДЕНДУМ
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
	ИначеЕсли Объект.Тип = Прч.ПервичныйОсмотр Тогда
		//ПЕРВИЧНЫЙ ОСМОТР
		//Элементы.ПолучитьДанныеЗаявкиИзБазы.Видимость				= Истина;
		Элементы.СК.ТолькоПросмотр									= Истина;
		Элементы.СК.Подсказка										= ПодсказкаНеДоступно;
		Элементы.СК.ОтметкаНезаполненного							= Ложь;
		//Элементы.ВознаграждениеКурьера.ОтметкаНезаполненного		= ВознаграждениеКурьера = 0;
		//Элементы.Утверждено.Видимость								= Истина;
	Иначе
		Элементы.НомерЗаявки.Видимость								= Ложь;
		//Элементы.ПризнакСтраховкиКредитная.Доступность				= Ложь;
	КонецЕсли;
	//для всех типов заявки
	Если Объект.Тип.Пустая() Тогда
		Элементы.ПанельИнфоОВстрече.Доступность 	= Ложь;
		//Элементы.ГруппаМенеджер.Доступность		= Ложь;
		//Элементы.ПанельИнфоОСтраховке.Доступность	= Ложь;
	Иначе
		Элементы.ПанельИнфоОВстрече.Доступность 	= Истина;
		//Элементы.ГруппаМенеджер.Доступность		= Истина;
		//Элементы.ПанельИнфоОСтраховке.Доступность	= Истина;
	КонецЕсли;
	//Элементы.ПанельИнфоОСтраховке.Страницы.Документы.Видимость = Ложь;
	//Элементы.ПанельИнфоОСтраховке.Страницы.ВК.Видимость = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.КураторВыездных"), Ложь);
	//Элементы.ПанельИнфоОСтраховке.Страницы.БалансРасчетов.Видимость = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава");
	//ПанельВстреча 	= Элементы.ПанельИнфоОВстрече;
	//ПанельСтраховка = Элементы.ПанельИнфоОСтраховке;
	//Переосмотр		= Тип = Перечисления.уб_ТипВыезда.Переосмотр;
	//Если Тип = Перечисления.уб_ТипВыезда.Административный Тогда
	//	//Элементы.ПанельИнфоОСтраховке.Свертка = РежимСверткиЭлементаУправления.Верх;
	//	Административный = Истина;
	//	//Элементы.ВремяВстречи.Лево = Элементы.СК.Лево + Элементы.ПанельИнфоОВстрече.Лево;
	//	//ставим вознаграждение курьера = 0
	//	Элементы.Курьер.АвтоОтметкаНезаполненного 	= Истина;
	//	Элементы.НомерЗаявки.Видимость 			= Ложь;
	//ИначеЕсли Тип = Перечисления.уб_ТипВыезда.Переосмотр Тогда
	//	//Элементы.ПанельИнфоОСтраховке.Свертка = РежимСверткиЭлементаУправления.Верх;
	//	Административный = Ложь;
	//	//Элементы.ВремяВстречи.Лево 			= Элементы.НомерДоговораПереосмотр.Лево + Элементы.ПанельИнфоОВстрече.Лево;
	//	Элементы.НомерЗаявки.Видимость 		= Истина;
	//Иначе
	//	//Элементы.ПанельИнфоОСтраховке.Свертка = РежимСверткиЭлементаУправления.Нет;
	//	Административный = Ложь;
	//	//Элементы.ВремяВстречи.Лево = Элементы.Страхователь.Лево + Элементы.ПанельИнфоОВстрече.Лево;
	//	//ставим вознаграждение курьера = минимальной сумме, если оно меньше этой суммы
	//	Элементы.Курьер.АвтоОтметкаНезаполненного 	= Ложь;
	//	Элементы.НомерЗаявки.Видимость 			= Истина;
	//КонецЕсли;	
	Прч = Перечисления.уб_ТипВыезда;
	//ТипВыездаОтделаБСО = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТипВыездаОтделаБСО(Тип); 
	//Если ТипВыездаОтделаБСО Тогда
	//	Элементы.Тип.ЦветФона 		= Новый Цвет(200, 225, 200);
	//	Элементы.Тип.Подсказка			= "Тип выезда отдела БСО";
	//Иначе
	//	Элементы.Тип.ЦветФона 		= Новый Цвет;
	//	Элементы.Тип.Подсказка			= "Тип выезда";
	//КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДФ.Агент КАК Агент
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК ДФ
	|ГДЕ
	|	ДФ.Подразделение В
	|			(ВЫБРАТЬ
	|				ПодразделенияОрганизаций.Ссылка
	|			ИЗ
	|				Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|			ГДЕ
	|				ПодразделенияОрганизаций.ТипПодразделения В (ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВСВнешняя), ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.СлужбаВС))
	|				И ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ)
	|	И ДФ.Выбытие = ЛОЖЬ
	|	И ДФ.Агент <> &НеопределенАгент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДФ.Агент.Наименование";			
	//Запрос.УстановитьПараметр("Подразделение", 		?(Тип = Перечисления.уб_ТипВыезда.Административный, ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО, ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС));
	//Запрос.УстановитьПараметр("Подразделение", 		ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС);
	Запрос.УстановитьПараметр("НеопределенАгент",   ПараметрыСеанса.уб_Константы.НеопределенАгент);
	МассивКурьеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Агент");
	МассивКурьеров.Вставить(0,Справочники.ФизическиеЛица.ПустойАгент);
	Элементы.Курьер.СписокВыбора.ЗагрузитьЗначения(МассивКурьеров);
	//Элементы.Курьер.СписокВыбора.Очистить();
	////чкн
	//Элементы.Курьер.СписокВыбора.Добавить();
	////чкн
	//Пока Выборка.Следующий() Цикл
	//	Элементы.Курьер.СписокВыбора.Добавить(Выборка.Агент);
	//КонецЦикла;
	//Если РасчетВК = Истина Тогда
	//	РасчетВознагражденийУдержаний();
	//КонецЕсли;
	ИзменитьДоступность(ПриОткрытии);
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступность(ПриОткрытии = Ложь)
	// право РСВС есть, но никто им не пользуется, но настроить нужно, вдруг у Гусака появится помощник, не полные же права ему давать
	//
	// вопросы:
	// 1) на менеджеров с правом редактирования заявки после утверждения (Ведущие менеджеры) распространяется блокировка 
	//	испытательным сроком И процентом КАСКО. Т.е. блокировка Гусаком для них не проблема, а вот процент КАСКО требуется подтверждать
	//	и форма блокируется после проверки руководителем. И, кстати, все их заявки "проверяет" Гусак (полные права позволяют), 
	//	заявок, где это	делала бы Юнона, я не нашел
	// 3) менеджеры с правом редактирования заявки после утверждения могут править заявки подчиненных преемников, даже утвержденные
	//	должно ли это права распространятся вообще на заявки других менеджеров?
	// 4) право РСВС не только право, но И блокировка (не может править курьеров И самовыезд в заявках, не проверенных руководителем)
	// 5) изменил курьера в заявке - поставил Никишину (ЦФО1). Никишина не видит эту заявку в форме списка (там в структуре фильтров проверяется только менеджер в списке)
	//	хотя по правам формы документа, к заявке должен быть доступ как у курьера, так И у руководителя курьера, так И преемника курьера, так И у руководителя
	//	преемника курьера итп. Должен ли быть доступ у курьера-Никишиной в моем случае? Должен ли быть доступ у Зайцевой, руководителя Никишиной
	//	не сооветствие прав формы списка И формы документа
	// 6) в форме списка отбор устанавливается если ПараметрыСеанса.уб_ЭтоМенеджер, в форме документа если не ПолныеПрава ИЛИ роль доп. куратора выездных
	
	Перем ВыборкаРезультат;
	
	КартинкаЗеленая = БиблиотекаКартинок.уз_Активирован;
	КартинкаКрасная = БиблиотекаКартинок.уз_НеАктивирован;
	КартинкаМакет   = БиблиотекаКартинок.уб_Макет;
	
	
	//Параметры = 
	Если ЭтоАдресВременногоХранилища(АдресПараметровВызова) Тогда
		ПараметрыСотрудникаИДокумента = ПолучитьИзВременногоХранилища(АдресПараметровВызова);
	Иначе
		ЭтоПолныеПраваЗаявки = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.КураторВыездных"), Ложь);
		
		ПараметрыСотрудникаИДокумента = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		ПараметрыСотрудникаИДокумента.ВключаяВыбывших		= Истина;
		ПараметрыСотрудникаИДокумента.ТолькоТочкиПродаж		= Истина;
		ПараметрыСотрудникаИДокумента.СотрудникиПоДокументу = СписокСотрудниковДляДокумента();
		уб_СС.ПодчиненныеРуководителя(ПараметрыСеанса.уб_ТекущееФизЛицо,, ПараметрыСотрудникаИДокумента);
		
		ПараметрыСотрудникаИДокумента.Вставить("ЭтоПолныеПраваЗаявки",ЭтоПолныеПраваЗаявки);
		ПараметрыСотрудникаИДокумента.Вставить("ЕстьПриемкиПоЗаявке",Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЕстьПриемкиПоЗаявке(Объект.Ссылка));
		
		СписокОператоров = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокОператоров(Ложь);
		ЭтоОператор = НЕ СписокОператоров.Найти(ПараметрыСеанса.уб_ТекущееФизЛицо) = Неопределено;
		ЭтоОператорИлиУправлениеПечатью = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") ИЛИ ЭтоОператор ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.УправлениеПечатью"), Ложь);
		
		ПараметрыСотрудникаИДокумента.Вставить("ЭтоОператор",ЭтоОператор);
		ПараметрыСотрудникаИДокумента.Вставить("ЭтоОператорИлиУправлениеПечатью",ЭтоОператорИлиУправлениеПечатью);
		ПараметрыСотрудникаИДокумента.Вставить("ПодразделениеПользователя",уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо, Объект.Дата));
		ПараметрыСотрудникаИДокумента.Вставить("ПодразделениеМенеджера",   уб_СС.ПолучитьПодразделениеАгента(Объект.Менеджер, Объект.Дата));
		ПараметрыСотрудникаИДокумента.Вставить("КартинкаКрасная",КартинкаКрасная);
		ПараметрыСотрудникаИДокумента.Вставить("КартинкаЗеленая",КартинкаЗеленая);
		ПараметрыСотрудникаИДокумента.Вставить("КартинкаМакет",КартинкаМакет);
		
		
		
		
		АдресПараметровВызова = ПоместитьВоВременноеХранилище(ПараметрыСотрудникаИДокумента,Новый УникальныйИдентификатор);
	КонецЕсли;
	ПодразделениеЗаявки = ПараметрыСотрудникаИДокумента.ПодразделениеСотрудника;
	
	
	ЭтоПолныеПрава = РольДоступна("уб_ЗП_ПолныйДоступ");
	Элементы.Менеджер.КнопкаВыпадающегоСписка = Истина;
	Если ЭтоПолныеПрава Тогда
		Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.Дата).ВыгрузитьЗначения());
	Иначе
		Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(ПараметрыСотрудникаИДокумента.СписокСотрудников.ВыгрузитьЗначения());
	КонецЕсли;	
	
	//ЭТО КОСТЫЛЬ, но пока так
	ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.Вставить("РукИлиЗам",
	ПараметрыСотрудникаИДокумента.РуководительСотрудника = ПараметрыСеанса.уб_ТекущееФизЛицо ИЛИ ПараметрыСотрудникаИДокумента.ЗаместительРуководителяСотрудника = ПараметрыСеанса.уб_ТекущееФизЛицо); 
	
	Если ПриОткрытии Тогда
		//Все БСО считаются изменными
		МассивИзмененныхВидовБСО = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.БСО Цикл
			МассивИзмененныхВидовБСО.Добавить(СтрокаТЧ.ВидБСО);
		КонецЦикла;
		
		//Если ПараметрыСотрудникаИДокумента.ИспытательныйСрок И ЭтоНовый() И НЕ Тип = Перечисления.уб_ТипВыезда.Административный  Тогда
		//	//Сразу устанавливается, подумать возможно должно в общем режиме
		//	ТребуетсяПроверкаРуководителем 	= Истина;
		//КонецЕсли;
		
	Иначе
		//Если ДополнительныеСвойства.Свойство("МассивИзмененныхВидовБСО") И ТипЗнч(ДополнительныеСвойства.МассивИзмененныхВидовБСО) = Тип ("Массив") Тогда
		//	МассивИзмененныхВидовБСО = ДополнительныеСвойства.МассивИзмененныхВидовБСО;
		//	ДополнительныеСвойства.Вставить("МассивИзмененныхВидовБСО",Новый Массив);
		//Иначе	
		МассивИзмененныхВидовБСО = Новый Массив;
		//КонецЕсли;	
		
	КонецЕсли;	
	
	// для полных прав все разрешено (кроме поля Утверждено, если заявка не проверена руководителем)
	СтруктураДоступности = Новый Структура;
	// доступно для РСВС ИЛИ руководителю ИЛИ заместителю
	// (не совсем понятно, почему роль РСВС может править менеджера, если заявка не проверена руководителем)
	//СтруктураДоступности.Вставить("Менеджер", Не Элементы.Менеджер.ТолькоПросмотр);
	// доступно только если проверено руководителем! Для РСВС И полных прав всегда, для остальных если самовыезд И менеджер - текущее физлицо
	// также доступно по полномочию ПравоУтвержденияЗаявки
	//СтруктураДоступности.Вставить("Утверждено",	Не Элементы.Утверждено.ТолькоПросмотр);
	// доступно в двух случаях (реквизиты Курьер И Самовыезд
	//	1) если РСВС доступно если проверено руководителем
	//	2) для остальных (не РСВС!) доступно если заявка не утверждена
	//СтруктураДоступности.Вставить("Курьер",		Не Элементы.Курьер.ТолькоПросмотр);
	//СтруктураДоступности.Вставить("Самовыезд",	Элементы.Самовыезд.Доступность);
	// ТолькоПросмотр - несколько вариаций (в порядке очередности проверки (верхние главнее)):
	// 1) полные права - форма разблокирована всегда
	// 2) приняты деньги - форма заблокирована (проверяется только при открытии документа, поэтому не здесь)
	// 3) РСВС - форма разблокирована
	// 4) если утверждена из прочих пользователей могут править только руководители подразделений (не заместители!) 
	//	или пользователи с правом ПравоРедактироватьЗаявкиПослеУтверждения (на тек. момент Ведущие менеджеры)
	//	или пользователи с правом ПравоИзмененятьЗаявкуПослеПриемки
	// 5) не утвержденную НЕ может править пользователь, который не является менеджером заявки (пример: преемник не может править заявку подчиненного преемника)
	// 6) также менеджерам с испытательным сроком ИЛИ рядовым менеджерам по заявке с превышенным процентом скидки КАСКО нельзя изменять проверенную руководителем заявку
	//СтруктураДоступности.Вставить("ТолькоПросмотр", ПараметрыСотрудникаИДокумента.ЕстьПриемкиПоЗаявке);
	СтруктураДоступности.Вставить("ТолькоПросмотр", ЛОЖЬ);
	// доступно для руководителей ИЛИ заместителей ИЛИ РСВС, ИЛИ если пользователь - менеджер заявки ИЛИ агент связанного пролонгированного полиса
	//СтруктураДоступности.Вставить("Контакты", Элементы.Контакты.ТолькоПросмотр);
	// Вспомогательные расчетные поля
	СтруктураПровереноРуководителем = НастройкиПоляПровереноРуководителем(МассивИзмененныхВидовБСО,ПараметрыСотрудникаИДокумента);
	
	////////////------------------УБРАТЬ ЭТОТ ЗАПРОС - ИДЕТ ДУБЛЕМ----------------//////////////
	//СтруктураДоступности.Вставить("ТребуетсяПроверкаРуководителем", Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТребуетсяПроверка(ЭтотОбъект, ВыборкаРезультат));
	// полные права, роль куратора, руководители И заместители всегда считаются "менеджерами" по заявке
	
	СтруктураДоступности.Вставить("НеМенеджер", Ложь);
	Если Не ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки
		И ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.РукИлиЗам
		Тогда
		//Рядовой менеджер
		НеМенеджер = ПараметрыСеанса.уб_ТекущееФизЛицо <> Объект.Менеджер;
		Если НеМенеджер
			И Объект.Тип = Перечисления.уб_ТипВыезда.Пролонгация
			И ЗначениеЗаполнено(Объект.НомерДоговора)
			И ТипЗнч(Объект.НомерДоговора) = Тип("ДокументСсылка.уб_СтраховойПолис")
			И Объект.НомерДоговора.Агент = ПараметрыСеанса.уб_ТекущееФизЛицо Тогда
			НеМенеджер = Ложь;
		КонецЕсли;
		СтруктураДоступности.НеМенеджер = НеМенеджер;
	КонецЕсли;
	
	Элементы.ГруппаЗанятость.Видимость = ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки; 
	
	Если Объект.Проведен Тогда
		Элементы.ОтправитьВРеализацию.Доступность = СтатусЗаявки = Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом;
		Элементы.Записать.Доступность = Истина;		
	Иначе
		Элементы.ОтправитьВРеализацию.Доступность = Истина;
		Элементы.Записать.Доступность = Истина;
	КонецЕсли;	
	
	
	// полные права, РСВС, руководители И заместители не могут иметь испытательного срока, даже если галочка стоит
	//СтруктураДоступности.Вставить("ИспытательныйСрок", 
	//	ПараметрыСотрудникаИДокумента.ИспытательныйСрок
	//	И Не уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")
	
	//	И Не ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.РукИлиЗам);	
	СтруктураДоступности.Вставить("Менеджер",//Право менять менеджера 
	ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки
	Или ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.РукИлиЗам
	ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ИзменениеАгентаВПолисахИОплатах",ЛОЖЬ)
	);
	
	//	
	СтруктураДоступности.Вставить("Утверждено",//Право утверждать 
	(Объект.ТребуетсяУтверждениеАндеррайтера = ЛОЖЬ ИЛИ ЗначениеЗаполнено(Объект.УтвердилАндеррайтер) = Истина) 
	И (Объект.ТребуетсяПроверкаРуководителем = ЛОЖЬ ИЛИ ЗначениеЗаполнено(Объект.УтвердилРуководитель) = Истина)
	//И (Дата<Дата(2018,6,1) ИЛИ ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = ЛОЖЬ)
	И (ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки
	//Или (ПараметрыСеанса.уб_ТекущееФизЛицо = Менеджер И Самовыезд)
	Или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПравоУтвержденияЗаявки"), Ложь)
	)
	);
	
	
	Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ЗапретПравкиДатыЗаявки"), Ложь) Тогда
		//Если Автор<>ПараметрыСеанса.ТекущийПользователь Тогда
		ЗапретитьПравкуДат();
		//КонецЕсли;	
	ИначеЕсли Объект.Утверждено И НЕ СтруктураДоступности.Утверждено Тогда
		ЗапретитьПравкуДат();		
	Иначе	
		ЗапретитьПравкуДат(ЛОЖЬ);		
	КонецЕсли;	
	
	СтруктураДоступности.Вставить("Курьер", //Право менять курьера
	ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки
	ИЛИ (Не Объект.Утверждено)
	//ИЛИ (Не ТребуетсяПроверкаРуководителем)
	);
	ЭтоКурьер = (Объект.Самовыезд = Ложь И ПараметрыСеанса.уб_ТекущееФизЛицо = Объект.Курьер И НЕ уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")  И НЕ ПараметрыСеанса.уб_ТекущееФизЛицо = Объект.Менеджер);
	СтруктураДоступности.Вставить("Самовыезд", НЕ ПараметрыСотрудникаИДокумента.ЭтоОператор = Истина И (СтруктураДоступности.Курьер 
	или СтатусЗаявки=Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом));
	СтруктураДоступности.Вставить("Контакты", 
	уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")//ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки
	ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.КураторВыездных"), Ложь)
	Или 
	ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.РукИлиЗам
	Или ПараметрыСеанса.уб_ТекущееФизЛицо = Объект.Менеджер
	или ЭтоКурьер = Истина
	или ПараметрыСотрудникаИДокумента.ЭтоОператорИлиУправлениеПечатью = Истина
	)
	;
	//Элементы.НеВерный.Доступность = ЭтоКурьер=Истина ИЛИ (уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.КураторВыездных"), Ложь));
	//Элементы.ЕОСАГО.Доступность   = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава,уб_СотрудникОтделаБСО");  
	
	Если ЭтоКурьер Тогда
		//Элементы.СтатусЗаявки.ТолькоПросмотр = Истина;
	КонецЕсли;	
	// расчет ТолькоПросмотр формы
	
	Если ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки Тогда
		СтруктураДоступности.ТолькоПросмотр = ЛОЖЬ;
	Иначе
		СтруктураДоступности.ТолькоПросмотр =
		(ПараметрыСотрудникаИДокумента.ЕстьПриемкиПоЗаявке 
		И НЕ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПравоИзмененятьЗаявкуПослеПриемки"), Ложь))
		
		ИЛИ (
		уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПравоРедактироватьЗаявкиПослеУтверждения"), Ложь) = Ложь
		И ЭтоКурьер = Ложь
		и
		(Объект.Утверждено
		ИЛИ (Объект.ТребуетсяПроверкаРуководителем И ЗначениеЗаполнено(Объект.УтвердилРуководитель) И ПараметрыСотрудникаИДокумента.СтруктураПоДокументу.РукИлиЗам = Ложь)
		ИЛИ (Объект.ТребуетсяУтверждениеАндеррайтера И ЗначениеЗаполнено(Объект.УтвердилАндеррайтер)))
		)
		и СтатусЗаявки<>Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом
	КонецЕсли;	
	
	_ТолькоПросмотр = СтруктураДоступности.ТолькоПросмотр;
	
	_ПравкаДанныхОВыезде = НЕ (ПараметрыСотрудникаИДокумента.ЕстьПриемкиПоЗаявке И НЕ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПравоИзмененятьЗаявкуПослеПриемки"), Ложь));
	
	Если _ПравкаДанныхОВыезде  И ЭтоКурьер = ЛОЖЬ Тогда
		
		Если СтруктураДоступности.ТолькоПросмотр Тогда
			//	Элементы.АдресС.Видимость = НЕ _ПравкаДанныхОВыезде ИЛИ Объект.Самовыезд;
			Элементы.Адрес.ТолькоПросмотр                    = _ПравкаДанныхОВыезде = ЛОЖЬ;// И не Объект.Самовыезд;	
			Элементы.БСОДерево.ТолькоПросмотр                = Истина;
			Элементы.Страхователь.ТолькоПросмотр             = Истина;
			Элементы.Тип.ТолькоПросмотр                      = Истина;
			Элементы.ВидОплаты.ТолькоПросмотр                = Истина;
			Элементы.СтаршийОператор.ТолькоПросмотр          = Истина;
			Элементы.БСОДеревоТекущийОператор.ТолькоПросмотр = Истина;
		Иначе
			//	Элементы.АдресС.Видимость = Объект.Самовыезд;
			Элементы.Адрес.Видимость  =  НЕ Объект.Самовыезд;	
		КонецЕсли;	
		Элементы.Город.Доступность = Истина;
		Элементы.СтанцияМетро.Доступность = Истина;
		
		
	ИначеЕсли _ТолькоПросмотр Тогда
		ТолькоПросмотр = Истина;
		//Элементы.АдресС.Видимость = _ТолькоПросмотр ИЛИ Объект.Самовыезд;
		Элементы.Адрес.ТолькоПросмотр  = (_ТолькоПросмотр);// И не Объект.Самовыезд;
	Иначе
		//	Элементы.АдресС.Видимость = Объект.Самовыезд;
		Элементы.Адрес.Видимость  =  НЕ Объект.Самовыезд;	
	КонецЕсли;	
	
	
	
	//Элементы.Утверждено.ТолькоПросмотр = Не СтруктураДоступности.Утверждено;
	//Элементы.Утверждено.Картинка		= ?(Объект.Утверждено, БиблиотекаКартинок.уб_ОплатаОК, КартинкаКрасная);
	Элементы.Менеджер.ТолькоПросмотр	= Не СтруктураДоступности.Менеджер;
	Элементы.Курьер.ТолькоПросмотр		= Не СтруктураДоступности.Курьер;
	
	Элементы.ВознаграждениеОтКлиента.ТолькоПросмотр = Не СтруктураДоступности.Курьер;
	//Элементы.ВознаграждениеОтМенеджера.ТолькоПросмотр = Не СтруктураДоступности.Курьер;
	
	
	//Элементы._Самовыезд1.Доступность  = СтруктураДоступности.Самовыезд  ИЛИ _ПравкаДанныхОВыезде;
	//Элементы._Самовыезд.Доступность   = СтруктураДоступности.Самовыезд ИЛИ _ПравкаДанныхОВыезде;
	Элементы.ТипВыезда.Доступность	   = СтруктураДоступности.Самовыезд ИЛИ _ПравкаДанныхОВыезде;
	//Элементы.ТипВыезда1.Доступность   = СтруктураДоступности.Самовыезд ИЛИ _ПравкаДанныхОВыезде;
	
	//Элементы.Офис.Доступность		 = СтруктураДоступности.Самовыезд ИЛИ _ПравкаДанныхОВыезде;
	//Элементы.Офис.Видимость		 = Ложь;
	
	Элементы.Контакты.ТолькоПросмотр	= Не СтруктураДоступности.Контакты;
	Элементы.Контакты.РежимПароля		= Не СтруктураДоступности.Контакты ИЛИ ПараметрыСотрудникаИДокумента.ЭтоОператор;
	Элементы.ПанельИнфоОВстрече.Доступность	= СтруктураДоступности.Контакты ИЛИ _ПравкаДанныхОВыезде;
	Элементы.ГруппаМенеджер.Доступность	= СтруктураДоступности.Контакты;
	//Элементы.УтвердилАндеррайтер.КнопкаОчистки = ЛОЖЬ;//ЗначениеЗаполнено(УтвердилАндеррайтер);
	Элементы.УтвердилАндеррайтер.ТолькоПросмотр = НЕ ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки;
	//Элементы.ОтменитьАндеррайтинг.Доступность = ЛОЖЬ;//ЗначениеЗаполнено(УтвердилАндеррайтер);
	
	Если Не ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки И не ПараметрыСотрудникаИДокумента.РуководительСотрудника = ПараметрыСеанса.уб_ТекущееФизЛицо
		И уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПравоРедактироватьЗаявкиПослеУтверждения"), Ложь) = Ложь Тогда
		//рядовой менеджер
		Элементы.БСОДерево.ТолькоПросмотр = СтатусЗаявки<>Перечисления.уб_СтатусыЗаявок.СогласованиеСКлиентом
		
		И (Объект.Утверждено = Истина
		ИЛИ (Объект.ТребуетсяПроверкаРуководителем И ЗначениеЗаполнено(Объект.УтвердилРуководитель))
		ИЛИ (Объект.ТребуетсяУтверждениеАндеррайтера И ЗначениеЗаполнено(Объект.УтвердилАндеррайтер))
		);
	КонецЕсли;
	
	Если ЭтоКурьер = Истина Тогда
		Элементы.Тип.ТолькоПросмотр           = Истина;
		Элементы.НомерЗаявки.ТолькоПросмотр   = Истина;
		Элементы.Источник.ТолькоПросмотр      = Истина;
		
		Элементы.ГруппаМенеджер.Доступность    = Ложь;
		Элементы.ПанельОтМенеджера.Доступность = Ложь;
		Элементы.ГруппаМенеджер.Доступность    = Ложь;
		Элементы.ПанельПодвал.Доступность      = Ложь;
		
		Элементы.БСОДерево.ТолькоПросмотр     = Истина;
		Элементы.СтанцияМетро.ТолькоПросмотр  = Истина;
		//Элементы.За10КмОтМКАД.Доступность   = Ложь;
		Элементы.МестоВстречи.ТолькоПросмотр  = Истина;		
		Элементы.Адрес.ТолькоПросмотр         = Истина;
		Элементы.Адрес.Видимость              = Ложь;
		//Элементы.ПризнакСтраховкиКредитная.Доступность = Ложь;
		//Элементы.АдресС.Видимость = Истина;
		
		
	КонецЕсли;	
	
	//ПОДУМАТЬ
	ПравкаВК = уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ");
	Элементы.ЗаблокироватьАвторасчет.Доступность = ПравкаВК;//ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки;
	Элементы.Мотивация.ТолькоПросмотр            = НЕ ПравкаВК;//Не ПараметрыСотрудникаИДокумента.ЭтоПолныеПраваЗаявки;
	Элементы.Источник.Видимость = НЕ (Объект.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная ИЛИ Объект.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Агентская) И не (Объект.Тип = Перечисления.уб_ТипВыезда.Пролонгация ИЛИ Объект.Тип = Перечисления.уб_ТипВыезда.ОчереднойВзнос);
	
	//TODO почему именно здесь?
	АдресОтметкаНезаполненного();
	
	//Элементы.ОплачиваемыйОсмотр.Доступность = уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") ИЛИ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.КураторВыездных"), Ложь);
	
	
КонецПроцедуры	

&НаСервере
Функция НастройкиПоляПровереноРуководителем(МассивИзмененныхВидовБСО,ПараметрыСотрудника)
	
	//МенеджерИспытательныйСрок = Менеджер.ИспытательныйСрок;//TODO обращение через точку
	СтруктураРезультатаПроверки = СтруктураНеобходимостиУтверждений(ПараметрыСотрудника,МассивИзмененныхВидовБСО);
	
	//эуРуководителем = Элементы.ПровереноРуководителем;
	//эуАндеррайтером  = Элементы.ПровереноАндеррайтером;
	//эуАндеррайтером.ТолькоПросмотр = Истина;
	эуРезультатПроверки = Элементы.РезультатПроверки;
	эуРезультатПроверки.ТолькоПросмотр = Истина;
	
	Элементы.УтвердилАндеррайтер.СписокВыбора.ЗагрузитьЗначения(СтруктураРезультатаПроверки.СписокАндеррайтеров.ВыгрузитьЗначения());
	Если Объект.ТребуетсяУтверждениеАндеррайтера = Истина 
		и (СтруктураРезультатаПроверки.ТребуетсяПроверкаАндеррайтером = ЛОЖЬ 
		и СтруктураРезультатаПроверки.ТребуетсяПроверкаСлужбыКонтроля = ЛОЖЬ) Тогда
		уб_ВызовСервера._УстановитьЗначение(Объект,"ТребуетсяУтверждениеАндеррайтера", ЛОЖЬ);//Сброс необходимости андеррайтинга
	КонецЕсли;	
	Элементы.УтвердилАндеррайтер.Заголовок = ?(СтруктураРезультатаПроверки.ТребуетсяПроверкаСлужбыКонтроля = Истина,"Контролёр","Андерайтер");
	Элементы.УтвержденоДата.Заголовок = ?(СтруктураРезультатаПроверки.ТребуетсяПроверкаСлужбыКонтроля = Истина,"Дата","Дата утверждения:");
	ПолныеПраваДляПоля = ЛОЖЬ;
	
	Если Не Объект.Утверждено //При утверждении остальные проверки уже не нужны, но этот эу надо скрыть
		и СтруктураРезультатаПроверки.ТребуетсяПроверкаАндеррайтером = Истина 
		и ЗначениеЗаполнено(Объект.УтвердилАндеррайтер)= ЛОЖЬ Тогда //Еще не проверено
		уб_ВызовСервера._УстановитьЗначение(Объект,"ТребуетсяУтверждениеАндеррайтера", Истина);
		//эуРуководителем.Видимость = Ложь;
		//эуАндеррайтером.Видимость  = Истина;
		//эу = эуАндеррайтером; 
		Картинка =  ПараметрыСотрудника.КартинкаКрасная;
		ЕстьЗапрет			= Истина;
		ТекстНеПроверено	= "Не проверено андеррайтером ";//+СокрЛП(Элементы.УтвердилАндеррайтер.СписокВыбора);
		ТекстПроверено		= "Проверено андеррайтером";
		ПодсказкаДоступного = "Доступно только для андеррайтера И руководителя отдела БСО";
		ПодсказкаНЕДоступного = "Перед утверждением заявка должна быть проверена андеррайтером ИЛИ руководителя отдела БСО";
		
		эуУтвердилАндеррайтер = Элементы.УтвердилАндеррайтер;
		//СтрокаВыделения = "<"+СокрЛП(СтруктураРезультатаПроверки.СписокАндеррайтеров) + ">";
		//нс = 0; нк =0; кс = 0; кк = 0;
		//эуУтвердилАндеррайтер.ПолучитьГраницыВыделения(нс,нк,кс,кк);
		//Попытка
		//	эуУтвердилАндеррайтер.УстановитьГраницыВыделения(нс,нк);//Выделяется, то что уже там есть
		//Исключение
		//КонецПопытки;	
		//эуУтвердилАндеррайтер.ВыделенныйТекст  = СтрокаВыделения;
		ПолныеПраваДляПоля = эуУтвердилАндеррайтер.СписокВыбора.НайтиПоЗначению(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено//; 
		ИЛИ ПараметрыСотрудника.ЭтоПолныеПраваДляЗаявки;  
	ИначеЕсли Не Объект.Утверждено 
		и СтруктураРезультатаПроверки.ТребуетсяПроверкаСлужбыКонтроля = Истина
		и ЗначениеЗаполнено(Объект.УтвердилАндеррайтер)= ЛОЖЬ Тогда
		
		уб_ВызовСервера._УстановитьЗначение(Объект,"ТребуетсяУтверждениеАндеррайтера", ИСТИНА);
		
		//эуРуководителем.Видимость = Ложь;
		//эуАндеррайтером.Видимость  = Истина;
		//эуАндеррайтером.ТолькоПросмотр = Истина;
		
		
		//эу = эуАндеррайтером; 
		Картинка =  ПараметрыСотрудника.КартинкаКрасная;
		ЕстьЗапрет			= Истина;
		ТекстНеПроверено	= "Не проверено контролёром ОСД";//+СокрЛП(Элементы.УтвердилАндеррайтер.СписокВыбора);
		ТекстПроверено		= "Проверено контролёром ОСД";
		ПодсказкаДоступного = "Доступно только для контролера отдела соппровождения договоров";
		ПодсказкаНЕДоступного = "Перед утверждением заявка должна быть проверена отделом сопровождения договоров";
		
		эуУтвердилАндеррайтер = Элементы.УтвердилАндеррайтер;
		
		СтрокаВыделения = "<"+СокрЛП(СтруктураРезультатаПроверки.СписокКонтролеров) + ">";
		//_нс = 0; _нк =0; _кс = 0; _кк = 0;
		//эуУтвердилАндеррайтер.ПолучитьГраницыВыделения(_нс,_нк,_кс,_кк);
		//Попытка
		//	эуУтвердилАндеррайтер.УстановитьГраницыВыделения(_нс,_нк);//Выделяется, то что уже там есть
		//Исключение
		//КонецПопытки;	
		эуУтвердилАндеррайтер.СписокВыбора.ЗагрузитьЗначения(СтруктураРезультатаПроверки.СписокКонтролеров.ВыгрузитьЗначения());
		
		//эуУтвердилАндеррайтер.ВыделенныйТекст  = СтрокаВыделения;
		ПолныеПраваДляПоля = эуУтвердилАндеррайтер.СписокВыбора.НайтиПоЗначению(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено;//; 
		эуРезультатПроверки.ТолькоПросмотр =  Не ПолныеПраваДляПоля;
		Если ПолныеПраваДляПоля Тогда
			Элементы.ОтправитьВРеализацию.Доступность  = Истина;
		Иначе
			Элементы.ОтправитьВРеализацию.Доступность = Ложь;
		КонецЕсли;	
		//ИЛИ ДополнительныеСвойства.ЭтоПолныеПрава;  
		
	Иначе	
		
		////Убрано, т.к. возникала ситуация когда проверка требуется,
		////но нельзя утвердить потому что скрыто. возможно в другом месте при записи не смотрит на утверждение Рук. СВС
		////УстановитьЗначение(ТребуетсяУтверждениеАндеррайтера, СтруктураРезультатаПроверки.ТребуетсяПроверкаАндеррайтером);//Возможен сброс
		//эуАндеррайтером.Видимость  = Ложь; 
		////эуРуководителем.Видимость = Истина;
		////эу  = эуРуководителем;
		//
		//Уб_ВызовСервера._УстановитьЗначение(Объект,"ТребуетсяПроверкаРуководителем", СтруктураРезультатаПроверки.ТребуетсяПроверкаРуководителем);//Возможен сброс
		//
		//
		//
		//
		////Если СтруктураРезультатаПроверки.СброситьПроверкуРуководителя Тогда
		////	УстановитьЗначение(ТребуетсяПроверкаРуководителем, Истина);
		////ИначеЕсли Не СтруктураРезультатаПроверки.ТребуетсяПроверкаРуководителем 
		////	И ТребуетсяПроверкаРуководителем 
		////	И МенеджерИспытательныйСрок = ПараметрыСеанса.уб_ТекущееФизЛицо.ИспытательныйСрок Тогда  //TODO почему текфизлицо а не менеджер, зачем вообще эта проверка
		////	// все корректно, можно принудительно снять проверку руководителем
		////	//
		////	// И Менеджер.ИспытательныйСрок = ПараметрыСеанса.уб_ТекущееФизЛицо.ИспытательныйСрок
		////	// чтобы на одинаковых полномочиях менять флаг проверки
		////	УстановитьЗначение(ТребуетсяПроверкаРуководителем, Ложь);
		////КонецЕсли;
		//
		//Картинка = ?(ЗначениеЗаполнено(Объект.УтвердилРуководитель),БиблиотекаКартинок.уб_ОплатаОК, ПараметрыСотрудника.КартинкаКрасная);
		//
		//УстановитьПровереноРуководителем();//изменить реквизит
		//
		//ЕстьЗапрет = Ложь;
		//Если Объект.ТребуетсяПроверкаРуководителем Тогда
		//	Если ЗначениеЗаполнено(Объект.УтвердилРуководитель)  Тогда
		//		//Проверено
		//		ТекстПроверено		= "Проверено руководителем";
		//		ТекстНеПроверено 	= "Отменить проверку";
		//	ИначеЕсли Объект.Утверждено Тогда	
		//		ТекстПроверено		= "Утверждено без проверки";
		//		ТекстНеПроверено 	= "Утверждено без проверки";
		//	Иначе
		//		Если СтруктураРезультатаПроверки.ПроцентКАСКОПревышен Тогда
		//			ТекстНеПроверено	= "Не проверено (скидка)";
		//			ТекстПроверено		= "Проверено руководителем";
		//		ИначеЕсли СтруктураРезультатаПроверки.ИспытательныйСрок Тогда
		//			ТекстНеПроверено 	= "Не проверено (испыт. срок)";
		//			ТекстПроверено		= "Проверено руководителем";
		//		ИначеЕсли СтруктураРезультатаПроверки.ТребуетсяПроверкаЛичнойЗаявки Тогда
		//			ТекстНеПроверено 	= "Не проверено (личная)";
		//			ТекстПроверено		= "Проверено руководителем";
		//		Иначе	
		//			//Что=то не известное
		//			ТекстНеПроверено 	= "Не проверено руководителем";
		//			ТекстПроверено		= "Проверено руководителем";
		//		КонецЕсли;	
		//
		//		ЕстьЗапрет			= Истина;
		//	КонецЕсли;	
		//Иначе
		//	ТекстНеПроверено 	= "Проверка не требуется";
		//	ТекстПроверено		= "Проверка не требуется";
		//	эу.ЦветТекстаПоля	= ЦветаСтиля.ТекстВторостепеннойНадписи;
		//	эу.КнопкаСпискаВыбора = Ложь;
		//	эу.ТолькоПросмотр		= Истина;
		//	эу.Подсказка			= "Проверка руководителем не требуется";	
		//КонецЕсли;	
		//	
		////Если СтруктураРезультатаПроверки.ПроцентКАСКОПревышен Тогда
		////	ТекстНеПроверено	= "Не проверено (скидка)";
		////	ТекстПроверено		= "Проверено руководителем";
		////	ЕстьЗапрет			= Истина;
		////ИначеЕсли МенеджерИспытательныйСрок Или ТребуетсяПроверкаРуководителем Тогда
		////	ТекстНеПроверено 	= "Не проверено руководителем";
		////	ТекстПроверено		= "Проверено руководителем";
		////	ЕстьЗапрет			= Истина;
		////Иначе
		////	ТекстНеПроверено 	= "Проверка не требуется";
		////	ТекстПроверено		= "Проверка не требуется";
		////	эу.ЦветТекстаПоля	= ЦветаСтиля.ТекстВторостепеннойНадписи;
		////	эу.КнопкаСпискаВыбора = Ложь;
		////	эу.ТолькоПросмотр		= Истина;
		////	эу.Подсказка			= "Проверка руководителем не требуется";
		////КонецЕсли;
		//ПодсказкаДоступного = "Доступно только для руководителя/заместителя при не утвержденной заявке";
		//ПодсказкаНеДоступного = "Перед утверждением заявка должна быть проверена руководителем/заместителем";
		//
		//ЕстьЗапрет = ЕстьЗапрет И Не Объект.Утверждено;//Утверждение снимает запрет
		//
		////Если ЕстьЗапрет Тогда
		//	// TODO закэшировать параметры подчиненных
		//	ПолныеПраваДляПоля = ПараметрыСотрудника.ЭтоПолныеПраваЗаявки 
		//		ИЛИ ПараметрыСотрудника.ЗаместительРуководителяСотрудника = ПараметрыСеанса.уб_ТекущееФизЛицо
		//		ИЛИ ПараметрыСотрудника.РуководительСотрудника = ПараметрыСеанса.уб_ТекущееФизЛицо
		//	//Старое ИЛИ  ПараметрыСотрудника.СтруктураПоДокументу.РукИлиЗам = Истина;
		////КонецЕсли;
	КонецЕсли;
	
	Если СтруктураРезультатаПроверки.ТребуетсяПроверкаСлужбыКонтроля = Истина Тогда
		эуУтвердилАндеррайтер = Элементы.УтвердилАндеррайтер;
		эуУтвердилАндеррайтер.СписокВыбора.ЗагрузитьЗначения(СтруктураРезультатаПроверки.СписокКонтролеров.ВыгрузитьЗначения());
		ПолныеПраваДляПоляАндер = эуУтвердилАндеррайтер.СписокВыбора.НайтиПоЗначению(ПараметрыСеанса.уб_ТекущееФизЛицо)<>Неопределено;//; 
		эуРезультатПроверки.ТолькоПросмотр =  Не ПолныеПраваДляПоляАндер;
	КонецЕсли;	
	
	
	//РезультатПроверкиПриИзменении(Неопределено);
	
	//эу.Картинка = Картинка;
	//Если ЕстьЗапрет Тогда
	//	эу.ЦветТекстаПоля		= Новый Цвет;
	//	
	//	эу.КнопкаСпискаВыбора = ПолныеПраваДляПоля;
	//	эу.ТолькоПросмотр 	= Не ПолныеПраваДляПоля;
	//	Если эу.ТолькоПросмотр Тогда
	//		эу.Подсказка =  ПодсказкаДоступного;
	//	Иначе
	//		эу.Подсказка = ПодсказкаНеДоступного;
	//	КонецЕсли;
	//Иначе
	//	//Все проверено, но остается право снять проверку
	//КонецЕсли;
	//эу.Формат = "БЛ='" + ТекстНеПроверено + "'; БИ='" + ТекстПроверено + "'";
	Возврат СтруктураРезультатаПроверки;
	
КонецФункции

Функция СтруктураНеобходимостиУтверждений(ПараметрыСотрудника,МассивИзмененныхВидовБСО = Неопределено, НаДату = Неопределено) Экспорт  //Старое имя СтруктураДоступностиПровереноРуководителем
	ПроцентПроверкиКАСКО = 7;
	//Производится проверка:
	// - на вхождение БСО в Страховые продукты КАСКО
	// - на превышение процента КАСКО
	// - необходимость проверки руководителем сотрудников с испытательным сроком
	// - необходимость проверки руководителем сотрудников личных заявок
	//данные собираются, но НИКАКИХ действия с данными и элементами формы не производится
	Если НаДату = Неопределено Тогда
		НаДату = Объект.Дата;
	КонецЕсли;
	Результат = Новый Структура;
	//	Результат.Вставить("ИспытательныйСрок", 			 ПараметрыСеанса.уб_ТекущееФизЛицо.ИспытательныйСрок);//TODO Через точку
	Результат.Вставить("ИспытательныйСрок", 			 ПараметрыСотрудника.ИспытательныйСрок);
	Результат.Вставить("ПроцентКАСКОПревышен",  		 Ложь);
	Результат.Вставить("ЕстьЛимитыСтрахования",  		 Ложь);
	
	Результат.Вставить("ТребуетсяПроверкаСлужбыКонтроля", Ложь);
	Результат.Вставить("ТребуетсяПроверкаРуководителем",  Ложь);
	Результат.Вставить("ТребуетсяПроверкаАндеррайтером",  Ложь);
	Результат.Вставить("ТребуетсяПроверкаЛичнойЗаявки",   Ложь);
	
	Результат.Вставить("СписокАндеррайтеров", Новый СписокЗначений);
	Результат.Вставить("СписокКонтролеров",	  Новый СписокЗначений);
	
	Результат.Вставить("СброситьПроверкуРуководителя",	 Ложь);
	
	Результат.ТребуетсяПроверкаЛичнойЗаявки  = Объект.НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная И ПараметрыСотрудника.ТребуетсяПроверкаЛичныхЗаявок = Истина;
	
	//Если ПараметрыСеанса.уб_Константы.ПроверкаЗаявокОтделомКонтроля = Истина Тогда
	
	Результат.Вставить("ТребуетсяПроверкаСлужбыКонтроля", Объект.Дата>Дата(2018,6,1) И ПараметрыСотрудника.БезОтделаКонтроля = Ложь И НЕ Объект.Тип = Перечисления.уб_ТипВыезда.Административный);
	
	
	СписокКонтролеров  = Новый СписокЗначений;
	СписокКонтролеров.ЗагрузитьЗначения(Уб_Кэшируемые.СписокКонтролеров(Истина));
	Результат.Вставить("СписокКонтролеров",СписокКонтролеров);
	
	Возврат Результат;
	//КонецЕсли;	
	
	
	Если МассивИзмененныхВидовБСО = Неопределено Тогда
		МассивИзмененныхВидовБСО = Новый Массив;
	КонецЕсли;
	
	МассивВидовСПревышением = Новый Массив;
	//Если Не НетБСО Тогда
	//	Для Каждого СтрокаТЧ Из БСО Цикл
	//		Если СтрокаТЧ.ПредоставленнаяСкидкаПроцент > ПроцентПроверкиКАСКО 
	//			И МассивВидовСПревышением.Найти(СтрокаТЧ.ВидБСО) = Неопределено
	//			Тогда
	//			МассивВидовСПревышением.Добавить(СтрокаТЧ.ВидБСО)
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	Тч_БСО = Объект.БСО.Выгрузить(,"ВидБСО,ЛимитОтветственности,ПредоставленнаяСкидкаПроцент");
	Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	&ВидБСО как ВидБСО,
	//|	20000 КАК ЛимитОтветственности,
	//|	5 КАК ПредоставленнаяСкидкаПроцент
	//|ПОМЕСТИТЬ ТЧ_БСО
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидБСО1,
	//|	900000,
	//|	7"
	"ВЫБРАТЬ
	|	ТЧ_БСО.ВидБСО,
	|	ТЧ_БСО.ЛимитОтветственности,
	|	ТЧ_БСО.ПредоставленнаяСкидкаПроцент
	|ПОМЕСТИТЬ ТЧ_БСО
	|ИЗ
	|	&ТЧ_БСО КАК ТЧ_БСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВБ.ВидБСО В (&МассивИзмененныхВидовБСО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СброситьПроверкуРуководителя,
	|	ВБ.ВидБСО,
	|	ТЧ_БСО.ЛимитОтветственности,
	|	ВБ.Ссылка.Владелец КАК СК,
	|	ТЧ_БСО.ПредоставленнаяСкидкаПроцент
	|ПОМЕСТИТЬ ВТ_ВидыБСО
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК ВБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_БСО КАК ТЧ_БСО
	|		ПО (ВБ.ВидБСО = ТЧ_БСО.ВидБСО
	|				ИЛИ ВБ.Ссылка = ТЧ_БСО.ВидБСО)
	|ГДЕ
	|	(ВБ.Ссылка.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ВБ.Ссылка.ДатаОкончанияДействия > &НаДату)
	|	И НЕ ВБ.Ссылка.ПометкаУдаления
	|	И ВБ.Ссылка.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВБ.ВидБСО,
	|	ТЧ_БСО.ЛимитОтветственности,
	|	ВБ.Ссылка.Владелец,
	|	ТЧ_БСО.ПредоставленнаяСкидкаПроцент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лимиты.СК,
	|	Лимиты.СК.Андеррайтер как Андеррайтер,
	|	Лимиты.УсловиеПрименения,
	|	Лимиты.ТипЛимита,
	|	Лимиты.Лимит,
	|	Лимиты.Комментарий
	|ИЗ
	|	ВТ_ВидыБСО КАК ВТ_ВидыБСО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Период КАК Период,
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.СК КАК СК,
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.УсловиеПрименения КАК УсловиеПрименения,
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.ТипЛимита КАК ТипЛимита,
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Лимит КАК Лимит,
	|			уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Комментарий КАК Комментарий
	|		ИЗ
	|			РегистрСведений.уб_ЛимитыРазрешенийНаСтрахование.СрезПоследних(, ) КАК уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних) КАК Лимиты
	|		ПО ВТ_ВидыБСО.СК = Лимиты.СК
	|			И ВТ_ВидыБСО.ЛимитОтветственности >= Лимиты.Лимит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Вложенный.СброситьПроверкуРуководителя) КАК СброситьПроверкуРуководителя
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВТ_ВидыБСО.СброситьПроверкуРуководителя) КАК СброситьПроверкуРуководителя
	|	ИЗ
	|		ВТ_ВидыБСО КАК ВТ_ВидыБСО
	|	ГДЕ
	|		ВТ_ВидыБСО.ПредоставленнаяСкидкаПроцент >= &ЛимитСкидкиБезУтверждения
	|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		МАКСИМУМ(ВЫБОР
	//|				КОГДА СП.Ссылка В (&МассивИзмененныхВидовБСО)
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ЛОЖЬ
	//|			КОНЕЦ)
	//|	ИЗ
	//|		Справочник.уб_СтраховыеПродукты КАК СП
	//|	ГДЕ
	//|		СП.Ссылка В(&МассивВидовСПревышением)
	//|		И (СП.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ СП.ДатаОкончанияДействия > &НаДату)
	//|		И НЕ СП.ПометкаУдаления
	//|	
	//|	ИМЕЮЩИЕ
	//|		ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	//|					КОГДА СП.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ЛОЖЬ
	//|				КОНЕЦ), ЛОЖЬ) = ИСТИНА
	|) КАК Вложенный
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(Вложенный.СброситьПроверкуРуководителя) ЕСТЬ NULL ");
	//Запрос.УстановитьПараметр("МассивВидовСПревышением", 			МассивВидовСПревышением);
	Запрос.УстановитьПараметр("МассивИзмененныхВидовБСО", 	МассивИзмененныхВидовБСО);
	Запрос.УстановитьПараметр("ЛимитСкидкиБезУтверждения", 	ПроцентПроверкиКАСКО);//Только для КАСКО
	
	Запрос.УстановитьПараметр("НаДату",						НаДату);
	Запрос.УстановитьПараметр("ТЧ_БСО",ТЧ_БСО );
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатПоПроцентам = МассивРезультатов[3];//
	Если Не РезультатПоПроцентам.Пустой() Тогда
		Результат.ПроцентКАСКОПревышен = Истина и ПараметрыСотрудника.ТребуетсяПроверкаСкидок = Истина;    //ПараметрыСотрудника.ТребуетсяПроверкаСкидок;
		Выборка = РезультатПоПроцентам.Выбрать();
		Выборка.Следующий();
		Результат.СброситьПроверкуРуководителя = Выборка.СброситьПроверкуРуководителя и ПараметрыСотрудника.ТребуетсяПроверкаСкидок;
		
	КонецЕсли;
	
	РезультатПоЛимитамНаСтрахование = МассивРезультатов[2];//
	Если Не РезультатПоЛимитамНаСтрахование.Пустой() и Объект.Тип = Перечисления.уб_ТипВыезда.Страховка Тогда
		//
		Результат.ЕстьЛимитыСтрахования = Истина;
		Выборка = РезультатПоЛимитамНаСтрахование.Выбрать();
		Пока Выборка.следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Андеррайтер) 
				и Результат.СписокАндеррайтеров.НайтиПоЗначению(Выборка.Андеррайтер)= Неопределено Тогда
				Результат.СписокАндеррайтеров.Добавить(Выборка.Андеррайтер);
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		
	КонецЕсли;
	
	//Три причины необходимости проверки руководителем
	Результат.ТребуетсяПроверкаРуководителем = (Результат.ПроцентКАСКОПревышен 
	ИЛИ (Результат.ИспытательныйСрок) 
	ИЛИ Результат.ТребуетсяПроверкаЛичнойЗаявки)
	И НЕ Объект.Тип = Перечисления.уб_ТипВыезда.Административный;
	
	
	Результат.ТребуетсяПроверкаАндеррайтером  = Результат.ЕстьЛимитыСтрахования и ПараметрыСотрудника.НеНуженАндеррайтингЗаявок = Ложь;
	
	
	Возврат Результат;
	
КонецФункции // СтруктураНеобходимостиУтверждений()


&НаСервере
Процедура ЗаполнениеНовогоДокумента()
	
	
	
	
	//уб_СтраховойБрокер.ЗаполнитьШапкуДокументаСтрБрокер(ЭтотОбъект, ПараметрыСеанса.ТекущийПользователь, мВалютаРегламентированногоУчета);
	//чкн
	//Курьер = Справочники.ФизическиеЛица.ПустойАгент;
	//чкн
	тДата = ТекущаяДата();
	Объект.Дата = тДата;
	нДня = НачалоДня(тДата);
	
	пФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	Объект.Менеджер			    = ПараметрыСеанса.уб_ТекущееФизЛицо;
	Объект.УтвердилРуководитель = пФизлицо;
	Объект.УтвердилАндеррайтер  = пФизлицо;
	Объект.УтвержденоДата       = Дата(1,1,1);
	Объект.Утверждено           = Ложь;
	Объект.ТребуетсяПроверкаРуководителем   = ЛОЖЬ;
	Объект.ТребуетсяУтверждениеАндеррайтера = ЛОЖЬ;
	Объект.ФормаОплаты  = Перечисления.уб_ФормыОплаты.ПустаяСсылка();
	Объект.Кошелек      = Справочники.Кошельки.ПустаяСсылка();    
	Объект.ВидОплаты    = "";
	Объект.ВознаграждениеОтКлиента = 0;
	Объект.ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер;
	
	Объект.Срочная              = Ложь;
	Объект.НетДокументов        = Истина;
	Объект.РезультатПроверки    = Перечисления.уб_РезультатПроверкиЗаявки.ПустаяСсылка();
	
	//НеобходимостьОсмотра = перечисления.НеобходимостьОсмотра.БезОсмотра;
	Объект.ДатаСоздания         = ТекущаяДата();
	Объект.Комментарий          = "";
	
	Если Объект.БСО.Количество()>0  Тогда
		//Это копирование
		Если Параметры.Свойство("НеЗаменятьУИДСтрок") = Ложь Тогда
			//Подмена уид, чтобы они были уникальны во всей системе
			СоотЗамены = Новый Соответствие;
			Для каждого СтрокаБ Из Объект.БСО Цикл
				СтарыйУИД = СтрокаБ.УидСтроки;
				СтрокаБ.УидСтроки = Новый УникальныйИдентификатор;
				Если Не ПустаяСтрока(СтарыйУИД) Тогда
					СоотЗамены.Вставить(СтарыйУИД,СтрокаБ.УидСтроки);
				КонецЕсли;
			КонецЦикла;
			//Производим отдельной выборкой, т.к. возможна некорректная работа вложенного поиска по БСО
			Для каждого элСоот Из СоотЗамены Цикл
				мСтрок = Объект.БСО.НайтиСтроки(Новый Структура("УидРодителя",элСоот.Ключ));
				Для каждого СтрокаПБ Из мСтрок Цикл
					СтрокаПБ.УидРодителя = элСоот.Значение;//.УидСтроки;
				КонецЦикла;
				//мСтрок = СписокФайлов.НайтиСтроки(Новый Структура("УидСтроки",элСоот.Ключ));
				//Для каждого СтрокаПБ Из мСтрок Цикл
				//	СтрокаПБ.УидСтроки = элСоот.Значение;//.УидСтроки;
				//КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		//Зачистка неактульаных данных при копировании
		Для каждого СтрокаБ Из Объект.БСО Цикл
			
			Если НЕ ТипЗнч(СтрокаБ.ВидБСО)  = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов") Тогда
				СтрокаБСО = Строка(СтрокаБ.ВидБСО);
				Если Найти("ЕКАСКО,Е-КАСКО,ЕКаско,е-каско",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО	
				ИначеЕсли Найти("КАСКО,Каско,каско",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
				ИначеЕсли Найти("ЕОСАГО,Е-ОСАГО,ЕОсаго,е-осаго",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО	
				ИначеЕсли Найти("ОСАГО,Осаго,Осаго,Осаго-ТТТ,ОСАГО-ТТТ",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО;	
				ИначеЕсли Найти("ВРЗ,Взр,взр",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР;		
				ИначеЕсли Найти("ИМУЩЕСТВО,Имущество,имущество",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.Имущество;			
				ИначеЕсли Найти("ИПОТЕКА,Ипотека,ипотека",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека;				
				ИначеЕсли Найти("НС,Клещ,Нс,КЛЕЩ",СтрокаБСО)>0 Тогда
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.НС;					
				Иначе	
					СтрокаБ.ВидБСО = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка();	
				КонецЕсли;	
			КонецЕсли;	
			СтрокаБ.Оператор          = пФизлицо;
			СтрокаБ.Состояние         = Перечисления.уб_СостояниеОформления.ПустаяСсылка();
			СтрокаБ.НомерБСО          = "";
			СтрокаБ.ДопНомерБСО       = "";
			СтрокаБ.ВыполненоРасчетов = 0;
			СтрокаБ.ВыполненоДоделок  = 0;
			СтрокаБ.ОператорДоделал   = пФизлицо;
			//
			СтрокаБ.ПринятыДеньгиАвтор = Справочники.Пользователи.ПустаяСсылка();
			СтрокаБ.ПринятыДеньги      = ЛОЖЬ;    
			СтрокаБ.Кошелек            = Справочники.Кошельки.ПустаяСсылка();    
			СтрокаБ.ФормаОплатыСтрока  = Неопределено; 
			//
			
			СтрокаБ.ДатаДвиженияБСО    = Дата(1,1,1);
			СтрокаБ.ДатаОформления     = Дата(1,1,1);
			СтрокаБ.Взнос2Дата         = Дата(1,1,1);
			СтрокаБ.Взнос3Дата         = Дата(1,1,1);
			СтрокаБ.Взнос4Дата         = Дата(1,1,1);  
			СтрокаБ.ДатаНачала         = Дата(1,1,1);   
			СтрокаБ.ДатаОкончания      = Дата(1,1,1);   
			
			СтрокаБ.ОфициальнаяСкидка  = Ложь;
			СтрокаБ.СтраховаяПремия              = 0;
			СтрокаБ.ПредоставленнаяСкидка        = 0;
			СтрокаБ.ПредоставленнаяСкидкаПроцент = 0;
			СтрокаБ.ЛимитОтветственности      = 0;  
			СтрокаБ.ИтогСтраховаяПремия       = 0;
			СтрокаБ.ИтогПредоставленнаяСкидка = 0;
			СтрокаБ.СуммаВзноса       = 0;
			СтрокаБ.ИтогСуммаВзноса   = 0;   
			СтрокаБ.Стоимость         = 0;
			СтрокаБ.Взнос2Сумма       = 0;
			СтрокаБ.Взнос1Сумма       = 0;
			СтрокаБ.Взнос3Сумма       = 0;  
			СтрокаБ.Взнос4Сумма       = 0;   
			СтрокаБ.Аддендум          = ЛОЖЬ;
			СтрокаБ.Франшиза          = 0;
			СтрокаБ.ОбъектСтрахования = Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
			
		КонецЦикла;
	КонецЕсли;
	Объект.СписокФайлов.Очистить();
	Объект.РасчетыПоЗаявке.Очистить();
	
	Если ПроверкаЗаявокОтделомКонтроля = Истина И Объект.Дата>Дата(2018,6,1) Тогда
		Объект.ТребуетсяУтверждениеАндеррайтера = Истина;
	КонецЕсли;	
	Объект.ФайловМенеджер            = 0;
	Объект.ФайловКурьер              = 0;
	Объект.ИндексРекомендации        = 0;
	Объект.ИндексЦепочкиРекомендаций = 0;
	Если Параметры.Свойство("СкопированС") = ЛОжь Тогда
		Объект.СтанцияМетро = Справочники.уб_СтанцииМетро.НайтиПоНаименованию("Дмитровская");
		Объект.Адрес     = "";
		//Объект.НеобходимостьОсмотра = Перечисления.НеобходимостьОсмотра.БезОсмотра;
		Объект.ТипВыезда = 1;
		Объект.Самовыезд = Истина;
	Иначе
		//Объект.ТипВыезда = 1;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.СозданНаОсновании) Тогда//не создан на основании
		Объект.Город     =  "Москва";
		Если Не ЗначениеЗаполнено(Объект.Менеджер) Тогда
			Объект.Менеджер			  = ПараметрыСеанса.уб_ТекущееФизЛицо;
		КонецЕсли;
		Объект.ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Менеджер;
		Объект.ПриоритетЗадачи 		  = Перечисления.уб_ПриоритетЗадачи.Важно;
		//Курьер = Неопределено;
		
		Если Не ЗначениеЗаполнено(Объект.ВремяНачало) ИЛИ нДня = НачалоДня(Объект.ВремяНачало) Тогда
			//создание из формы списка, не из графика
			//Дата = ДатаСоздания+3600*1.5;
			//Округляем до 10 минут и прибавляем полтора часа
			Объект.ВремяНачало      = нДня+Цел((тДата-нДня)/600)*600+1.5*3600;
			Объект.ВремяНачало      = ПодобратьДатуНачала(Новый Структура("ВремяНачало,Курьер",Объект.ВремяНачало,Объект.Курьер));
			//ВремяНачало 	        = КонецЧаса(ТекущаяДата()) + 1 + 30 * 60;
			Объект.Дата			    = Объект.ВремяНачало;
			Объект.ВремяОкончания 	= Объект.ВремяНачало + 30 * 60;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ВремяВстречиКлиент   = Дата(Год(нДня),Месяц(нДня),День(нДня),8,0,0);
	Объект.ВремяОкончанияКлиент = Дата(Год(нДня),Месяц(нДня),День(нДня),18,0,0);
	
	//Если Не ЗначениеЗаполнено(НомерЗаявки) Тогда
	//	НомерЗаявки = 0;
	//КонецЕсли;
	
	//УстановитьСсылкуНового(Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПолучитьСсылку());
	//ДополнительныеСвойства.Вставить("ЕстьПриемкиПоЗаявке",ЛОЖЬ);
	
	//СВС+
	//ОбновитьПараметры(ЭтотОбъект);
	//СВС-
	Объект.НомерДоговора   = Документы.уб_СтраховойПолис.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.Страхователь) = ЛОЖЬ Тогда
		Объект.Страхователь = пФизЛицо;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПостроитьДеревоБСО()
	БСОДерево.ПолучитьЭлементы().Очистить();
	Если Объект.БСО.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для каждого СтрокаБСО Из Объект.БСО Цикл
		СтрокиДерева =  БСОДерево.ПолучитьЭлементы();
		Если ПустаяСтрока(СтрокаБСО.УидРодителя)= Ложь Тогда
			Для каждого СтрокаРодитель из СтрокиДерева Цикл
				Если СтрокаРодитель.УидСтроки = СтрокаБСО.УидРодителя Тогда
					СтрокиДерева = СтрокаРодитель.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		Конецесли;	
		СтрокаДерева = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева,СтрокаБСО);
	КонецЦикла;
	//Для каждого СтрокаДерева Из БСОДерево.Строки  Цикл
	//	Элементы.БСОДерево.Развернуть(СтрокаДерева,Истина);
	//КонецЦикла;
	Возврат Истина;
КонецФункции


&НаСервере
Процедура ОбновитьИтоги(Предупреждать = Истина,ПриОткрытии = ЛОЖЬ);
	
	ФС = "ЧДЦ = 2; ЧН = 0";
	//Если Элементы.ПанельИнфоОСтраховке.Страницы.Основная.Доступность Тогда
	
	Для каждого ТекСтрока из Объект.БСО Цикл
		Если ТекСтрока.Количество = 0 Тогда
			ТекСтрока.Количество = 1;
		КонецЕсли;	
		
		Если ТекСтрока.СуммаВзноса = 0 И ТекСтрока.ПредоставленнаяСкидка>0 Тогда
			ТекСтрока.СуммаВзноса = ТекСтрока.СтраховаяПремия;
		КонецЕсли;
		
		Если ТекСтрока.ПредоставленнаяСкидка = 0 И ТекСтрока.ПредоставленнаяСкидка>0 Тогда
			ТекСтрока.ПредоставленнаяСкидка     = ТекСтрока.СуммаВзноса * ТекСтрока.Количество*ТекСтрока.ПредоставленнаяСкидкаПроцент/100;
			ТекСтрока.ИтогПредоставленнаяСкидка = ТекСтрока.ПредоставленнаяСкидка * ТекСтрока.Количество;
		КонецЕсли;
		
		_ИтогПредоставленнаяСкидка		= ТекСтрока.ПредоставленнаяСкидка * ТекСтрока.Количество;
		_ИтогСуммаВзноса				= ТекСтрока.СуммаВзноса * ТекСтрока.Количество;		
		_ИтогСтраховаяПремия	        = ТекСтрока.СтраховаяПремия * ТекСтрока.Количество;
		Уб_ВызовСервера._УстановитьЗначение(ТекСтрока,"ПредоставленнаяСкидка",_ИтогПредоставленнаяСкидка);
		Уб_ВызовСервера._УстановитьЗначение(ТекСтрока,"ИтогСуммаВзноса",_ИтогСуммаВзноса);
		Уб_ВызовСервера._УстановитьЗначение(ТекСтрока,"ИтогСтраховаяПремия",_ИтогСтраховаяПремия);
	КонецЦикла;	
	
	ИтогВзнос 		= Объект.БСО.Итог("ИтогСуммаВзноса");
	ИтогСкидка   	= Итог("ИтогПредоставленнаяСкидка");
	ИтогСРазницей	= ИтогВзнос - ИтогСкидка;
	//Иначе
	//	ИтогВзнос 		= 0;
	//	ИтогСкидка   	= 0;
	//	ИтогСРазницей	= 0;
	//КонецЕсли;
	
	ИтогоСуммаВзноса           = Формат(ИтогВзнос, 	ФС);
	ИтогоПредоставленнаяСкидка = Формат(ИтогСкидка, 	ФС);
	ИтогоСуммаСУчетомРазницы   = Формат(ИтогСРазницей,	ФС);	
	Если ПоКарте=345 Тогда
		мСуммаПоКартеВведенаВручную = Истина;
		ИтогСРазницей = Объект.БСО.Итог("ИтогСуммаВзноса") - Итог("ИтогПредоставленнаяСкидка");
		//TODO подумать над более точным моментом пересчета, как информировать, что сумма поменялась
		//_СуммаПоКарте = Окр(ИтогСРазницей * мПроцентЗаЭквайринг / 100, 2);
		//НадписьПроцентРасчетПоКарте = Строка(мПроцентЗаЭквайринг) + " %";
		//Если мСуммаПоКартеВведенаВручную Тогда
		//	ЦветСуммаПоКарте = ЦветаСтиля.ТекстПредупреждающейНадписи;
		//	Если _СуммаПоКарте > СуммаПоКарте Тогда
		//		Если Предупреждать Тогда
		//			Предупреждение("Увеличена сумма по карте до минимального значения " + _СуммаПоКарте + " руб. (" + мПроцентЗаЭквайринг + " %)");
		//		КонецЕсли;
		//		СуммаПоКарте = _СуммаПоКарте;
		ЦветСуммаПоКарте = ЦветаСтиля.ТекстИнформационнойНадписи;
		//	КонецЕсли;
		//	// иначе не меняем вручную введенную сумму
		Если ИтогСРазницей = 0 Тогда
			НадписьПроцентРасчетПоКарте = "Высокий процент!";
		Иначе
			НадписьПроцентРасчетПоКарте = Формат(Объект.СуммаПоКарте / ИтогСРазницей * 100, ФС) + " %";
		КонецЕсли;
		//Иначе
		//	УстановитьЗначение(СуммаПоКарте, _СуммаПоКарте);
		//	ЦветСуммаПоКарте = ЦветаСтиля.ТекстИнформационнойНадписи;
		//КонецЕсли;
		//Если СуммаПоКарте = 0 Тогда
		//	ПоКарте = Ложь;
		//КонецЕсли;
		//Элементы.НадписьПроцентРасчетПоКарте.Видимость 	= Истина;
		//Элементы.НадписьПроцентРасчетПоКарте.ЦветТекста    = ЦветСуммаПоКарте;
		//Элементы.НадписьПроцентРасчетПоКарте.Заголовок		= НадписьПроцентРасчетПоКарте;
	Иначе
		//УстановитьЗначение(СуммаПоКарте, 0);
		//Элементы.НадписьПроцентРасчетПоКарте.Видимость = Ложь;
	КонецЕсли;
	Если ПриОткрытии = ЛОЖЬ Тогда
		ПосчитатьПолиса();
	КонецЕсли;	
	//Элементы.СуммаПоКарте.ТолькоПросмотр = Не ПоКарте;
	//Элементы.ПоКарте.Заголовок = ?(ПоКарте, "Расчет по карте:", "Расчет по карте");
	
	//+++Расчеты
	Если Не ТолькоПросмотр Тогда
		Данныеформы = РеквизитФормыВЗначение("Объект");
		Данныеформы.ЗарегистрироватьРасчеты();
		ЭтаФорма.ЗначениеВРеквизитФормы(Данныеформы,"Объект");
	КонецЕсли;
	//Элементы.РасчетыПоЗаявке.ОбновитьСтроки();
	//---Расчеты
КонецПроцедуры	

&НаСервере
Процедура ПрименитьКанал()
	ИмяКанала = "З-"+Формат(Объект.Номер,"ЧГ=");
	ЭтаФорма.Сообщения.Параметры.УстановитьЗначениеПараметра("ИмяКанала",ИмяКанала);
КонецПроцедуры	

&НаСервере
Функция Итог(ИмяКолонки)         
	Если ИмяКолонки  = "ИтогПредоставленнаяСкидка" Тогда
	Иначе
		Возврат Объект.БСО.Итог(ИмяКолонки);
	КонецЕсли;	
	СуммаИтога = 0;
	Для каждого СтрокаБСО  Из Объект.БСО Цикл
		Если СтрокаБСО.ОфициальнаяСкидка = Ложь Тогда
			СуммаИтога = СуммаИтога + СтрокаБСО.ИтогПредоставленнаяСкидка;
		КонецЕсли;
	КонецЦикла;
	Возврат СуммаИтога;
КонецФункции

#Область Оплаты
&НаСервере
Процедура ПодобратьВидОплаты(Форма,_ЭтотОбъект) Экспорт
	Если Объект.ВидОплаты = "" И ЗначениеЗаполнено(_ЭтотОбъект.ФормаОплаты) Тогда
		
		Если _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал Тогда
			Объект.ВидОплаты = "На р\с в КПП (0%)";
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса Тогда
			Объект.ВидОплаты = "Наличными (0%)";
			//ИначеЕсли ФормаОплаты = Перечисления.уб_ФормыОплаты.ВКредит Тогда
			//	ВидОплаты = "В кредит (0%)";	
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.НаКарту Тогда
			Если ЗначениеЗаполнено(_ЭтотОбъект.Кошелек) Тогда
				Объект.ВидОплаты = "На карту "+ СокрЛП(_ЭтотОбъект.Кошелек) +"(0%)";		
			Иначе	
				Объект.ВидОплаты = "На карту (0%)";		
			КонецЕсли;	
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПоСсылкеБрокеру Тогда
			Объект.ВидОплаты = "По ссылке в КПП (3%)";			
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
			Объект.ВидОплаты = "В страховую -3%(потерянная сумма)";				
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Терминал Тогда
			Объект.ВидОплаты = "Терминал (3%)";
		ИначеЕсли _ЭтотОбъект.ФормаОплаты = Перечисления.уб_ФормыОплаты.ПоQR Тогда
			Объект.ВидОплаты = "По QR коду (0%)";		
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ОбновитьВидыОплаты(Элемент) Экспорт
	//уб_temp.ЗаполнитьФормыОплаты(Элементы.ВидОплаты.СписокВыбора); требует проверки
	ЭлВидОплаты = Элемент.СписокВыбора;
	ЭлВидОплаты.Очистить();
	ДобавитьВидОплаты("Наличными (0%)",ЭлВидОплаты);
	ДобавитьВидОплаты("На р\с в КПП (0%)",ЭлВидОплаты);
	ДобавитьВидОплаты("В страховую -3%(потерянная сумма)",ЭлВидОплаты);// (0 руб.) - было Безналично Поставщику
	//ДобавитьВидОплаты("СБП  (2.4%)",ЭлВидОплаты);// (*** руб.) - Новое
	//ДобавитьВидОплаты("Терминал (3%)",ЭлВидОплаты);// (*** руб.)
	ДобавитьВидОплаты("По QR коду (0%)",ЭлВидОплаты);// (*** руб.)

	//ДобавитьВидОплаты("В кредит (0%)",ЭлВидОплаты);// (0 руб.)
	//ДобавитьВидОплаты("На карту (0%)",ЭлВидОплаты);// (*** руб.) - было На карту сотрудника
	Для каждого СтрокаКарты из ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,Объект.Менеджер) Цикл
		
		ДобавитьВидОплаты("На карту "+СокрЛП(СтрокаКарты.Представление)+"(0%)",ЭлВидОплаты);
	КонецЦикла;	
	//ДобавитьВидОплаты("По ссылке в КПП (3%)",ЭлВидОплаты);// (*** руб.) - было По ссылке в Kupipolis
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,Менеджер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Вложенный.Карта КАК Карта,
	|	ПРЕДСТАВЛЕНИЕ(Вложенный.Карта) КАК Представление,
	|	Вложенный.Сортировка КАК Сортировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПодразделенияОрганизацийКарточкиСотрудников.Карта КАК Карта,
	|		ВЫБОР
	|			КОГДА ПодразделенияОрганизацийКарточкиСотрудников.Карта.Сотрудник = &Менеджер
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Сортировка
	|	ИЗ
	|		Справочник.ПодразделенияОрганизаций.КарточкиСотрудников КАК ПодразделенияОрганизацийКарточкиСотрудников
	|	ГДЕ
	|		ПодразделенияОрганизацийКарточкиСотрудников.Ссылка = &Подразделение
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.ПометкаУдаления = ЛОЖЬ
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.Актуальность = ИСТИНА
	|		И ПодразделенияОрганизацийКарточкиСотрудников.Карта.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
	|		И НЕ ПодразделенияОрганизацийКарточкиСотрудников.Карта.Сотрудник В
	|					(ВЫБРАТЬ
	|						уб_ДвижениеФизлицПоПодразделениям.Агент
	|					ИЗ
	|						регистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениям
	|					ГДЕ
	|						уб_ДвижениеФизлицПоПодразделениям.Выбытие = ИСТИНА)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Ссылка,
	|		0
	|	ИЗ
	|		Справочник.Кошельки.Сотрудники КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.Сотрудник = &Менеджер
	|		И Сотрудники.Ссылка.ПометкаУдаления = ЛОЖЬ
	|		И Сотрудники.Ссылка.Актуальность = ИСТИНА
	|		И Сотрудники.Ссылка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.Сортировка";
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеМенеджера);
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Выборка =  Запрос.Выполнить().Выбрать();
	МассивКарт = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивКарт.Добавить(Новый Структура("Карта,Представление",Выборка.Карта,Выборка.Представление));
	КонецЦикла;
	Возврат МассивКарт;
КонецФункции	

&НаСервере
Процедура ДобавитьВидОплаты(СтрокаВидОплаты,ЭлВидОплаты)
	ЭлВидОплаты.Добавить(СтрокаВидОплаты,ПосчитатьПроцент(СтрокаВидОплаты));
КонецПроцедуры	

&НаСервере
Функция ПосчитатьПроцент(Представление2, КакЧисло = Ложь)

	
	ВремВремия = 0;
	Для каждого СтрокаБСО из Объект.БСО Цикл
		Процент = 0;
		Представление = Строка(СтрокаБСО.ФормаОплатыСтрока);
		
		Если Представление = "СБП  (2.4%)" Тогда
			Процент = 2.4;
		ИначеЕсли Представление = "Терминал (3%)" Тогда
			Процент = 3.0;
		ИначеЕсли Представление = "На карту (0%)" Тогда
			Процент = 0.0;	
		ИначеЕсли Представление = "По ссылке в КПП (3%)" Тогда
			Процент = 3.0;	
		КонецЕсли;	
		ВремВремия = ВремВремия+Окр(СтрокаБСО.ИтогСтраховаяПремия* Процент/100,2);
	КонецЦикла;
	
	//ВремВремия = Окр(ИтогСтраховаяПремия* Процент/100,2);
	Если КакЧисло Тогда
		Возврат ВремВремия
	Иначе
		Возврат ""+Представление2+"     ("+Формат(ВремВремия,"ЧН=")+" руб.)";  
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьФормуОплатыИКошелек(Форма,_ЭтотОбъект) Экспорт
	
	_ЭтотОбъект.Кошелек = ПредопределенноеЗначение("Справочник.Кошельки.ПустаяСсылка");
	Если Объект.ВидОплаты = "На р\с в КПП (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Безнал");
	ИначеЕсли Объект.ВидОплаты = "Наличными (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Касса");
	ИначеЕсли Объект.ВидОплаты = "В кредит (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ВКредит");	
	ИначеЕсли Объект.ВидОплаты = "На карту (0%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");		
	ИначеЕсли Объект.ВидОплаты = "СБП  (2.4%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");			
	ИначеЕсли Объект.ВидОплаты = "По ссылке в КПП (3%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПоСсылкеБрокеру");			
	ИначеЕсли Объект.ВидОплаты = "В страховую -3%(потерянная сумма)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Поставщику");				
	ИначеЕсли Объект.ВидОплаты = "Терминал (3%)" Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Терминал");
	ИначеЕсли  Объект.ВидОплаты = "По QR коду (0%)" Тогда	
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПоQR");
	ИначеЕсли Найти(Объект.ВидОплаты,"На карту")=1	Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.НаКарту");		
		Для каждого СтрокаКарты из ПолучитьДействующиеКартыПодразделения(ПодразделениеМенеджера,Объект.Менеджер) Цикл
			Если Найти(Объект.ВидОплаты,""+СтрокаКарты.Карта)>0 Тогда
				_ЭтотОбъект.Кошелек = СтрокаКарты.Карта;
				прервать;
			КонецЕсли;		
		КонецЦикла;
	ИначеЕсли ПустаяСтрока(Объект.ВидОплаты) Тогда
		_ЭтотОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

Процедура ВидимостьСуммыПоКарте()
	
	//УстановитьЗначение(ПоКарте,СуммаПоКарте <> 0);	
	
	Элементы.СуммаПоКарте.Видимость =  Истина;//ФормаОплаты = Перечисления.уб_ФормыОплаты.Терминал ИЛИ СуммаПоКарте <> 0;
	Элементы.СуммаПоКарте.ТолькоПросмотр = НЕ (Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Терминал") ИЛИ Объект.СуммаПоКарте <> 0);
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Функция РасчетСКВПоЗаявке(Комиссия) Экспорт
	Если Объект.Дата<Дата(2016,2,11) Тогда
		Возврат 999999;//Заоблачное значение
	КонецЕсли;	
	_СКВ = 0;
	Для Каждого СтрокаБСО Из Объект.БСО Цикл
		Если ТипЗнч(СтрокаБСО.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
			Если Найти("Техосмотр",Строка(СтрокаБСО.ВидБСО))>0 Тогда
				//Если СтрокаБСО.ВидБСО.Тип = Перечисления.уб_ТипыБСО.ПолисОсаго Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		ТекФормаОплаты = СтрокаБСо.ФормаОплатыСтрока;//?(СтрокаБСо.ФормаОплатыСтрока.Пустая(),ФормаОплаты,СтрокаБСо.ФормаОплатыСтрока );
		Если Объект.Дата>=Дата(2026,1,1) 
			и ТекФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.Поставщику") 
			и СтрокаБСО.ВидБСО<>ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.Ипотека")
			и СтрокаБСО.ВидБСО<>ПредопределенноеЗначение("Перечисление.уб_ВидыСтраховыхПродуктов.ВЗР") Тогда
			дельта = 3;
			
		Иначе
			дельта = 0;
		КонецЕсли;	
		Комиссия = Комиссия+Окр((дельта)*СтрокаБСО.ИтогСтраховаяПремия/100,2);
		СуммаСтроки = Окр((СтрокаБСО.КВБрокераПлан-дельта)*СтрокаБСО.ИтогСтраховаяПремия/100,2)-СтрокаБСО.ИтогПредоставленнаяСкидка;

		
		
		_СКВ = _СКВ+ СуммаСтроки;
	КонецЦикла;	
	//Если ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
	_СКВ = _СКВ+ Объект.ВознаграждениеЧастьКлиента+Объект.ВознаграждениеОтМенеджера-Объект.СуммаПоКарте;
	//КонецЕсли;	
	//Если СКВ >= 1000 И СКВ <= 3350 И  НомерЗаявки <> Перечисления.уб_ВидыЗаявок.Личная Тогда
	//	#Если Клиент тогда
	//	Предупреждение("По данной заявке оплата выезда производится за счет брокера без доплаты за класность выездного специалиста ["+СКВ+"]",10);
	//	#КонецЕсли
	//Иначе
	//	//возврат 999999
	//КонецЕсли;
	
	Возврат _СКВ;
КонецФункции


&НаКлиенте
Функция ПроверкаСрочности(ПересчитатьВознаграждение = Ложь)
	
	ПараметрыСотрудника = ПолучитьИзВременногоХранилища(АдресПараметровВызова);
	
	Если //НЕ ПараметрыСотрудника.ПодразделениеСотрудника = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети или 
		Не ПараметрыСотрудника.НеПроверятьСрочность = Истина
		Тогда
		ЕстьИзменения = Ложь;
		текДата = ТекущаяДата();
		Если Объект.Дата>Дата(2016,7,7) Тогда
			//Если Дата<КонецДня(ДатаСоздания) 
			СнятьСрочность = Ложь;
			Если ПараметрыСотрудника.НеОплачиваютВыезд = Истина Тогда
				Если Объект.Срочная = Истина Тогда
					ПоказатьПредупреждение(,"Подразделение не оплачивает выезд",3);
					Срочная = Ложь;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Объект.Куратор) Тогда
				Если Срочная = Истина Тогда
					ПоказатьПредупреждение(,"Куратор "+Объект.Куратор,3);
					Объект.Срочная = Ложь;
					ЕстьИзменения = Истина 
				КонецЕсли;
			ИначеЕсли текДата>Дата(2018,6,25) Тогда
				Если 
					БудетСрочная()
					//УтвержденоДата<>Дата(1,1,1) 
					//И (Дата<КонецДня(УтвержденоДата) 
					//ИЛИ ( УтвержденоДата>(НачалоДня(УтвержденоДата)+16*3600+45*60)
					//И Дата <(КонецДня(УтвержденоДата)+16*3600+45*60+1)	
					//)
					//)  
					Тогда 	
					Если Объект.Срочная = Истина //или Срочность = Истина  
						Тогда
						ЕстьИзменения = Истина;
					Иначе
						Объект.Срочная = Истина;
						
						Если Объект.УтвержденоДата>(НачалоДня(Объект.УтвержденоДата)+16*3600+45*60) И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+16*3600+45*60+1) Тогда
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+17*3600+1,"ДФ='HH:mm dd MMMM'"));
						Иначе
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+9*3600+1,"ДФ='HH:mm dd MMMM'"));
						КонецЕсли;
						
						ЕстьИзменения = Истина;
						//
					КонецЕсли;
				Иначе
					СнятьСрочность = Истина;	
				КонецЕсли;	
				
			ИначеЕсли текДата>Дата(2017,4,20) Тогда
				Если 
					Объект.УтвержденоДата<>Дата(1,1,1) 
					И (Объект.Дата<КонецДня(Объект.УтвержденоДата) 
					ИЛИ ( Час(Объект.УтвержденоДата)>=17
					И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+17*3600+1)
					)
					)  
					Тогда 	
					Если Объект.Срочная = Истина Тогда
					Иначе
						Объект.Срочная = Истина;
						
						Если Час(Объект.УтвержденоДата)>=17 И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+17*3600+1) Тогда
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+17*3600+1,"ДФ='HH:mm dd MMMM'"));
						Иначе
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+9*3600+1,"ДФ='HH:mm dd MMMM'"));
						КонецЕсли;
						
						ЕстьИзменения = Истина;
					КонецЕсли;
				Иначе
					СнятьСрочность = Истина;
				КонецЕсли;
				
			ИначеЕсли текДата>Дата(2016,12,11) Тогда
				Если
					Объект.УтвержденоДата<>Дата(1,1,1) 
					И (Объект.Дата<КонецДня(Объект.УтвержденоДата) 
					ИЛИ ( Час(Объект.УтвержденоДата)>=16 
					И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+16*3600+1)
					)
					)  
					Тогда 	
					Если Объект.Срочная = Истина Тогда
					Иначе
						Объект.Срочная = Истина;
						//Предупреждение("Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(ДатаСоздания)+9*3600+1,"ДФ='HH:mm dd MMMM'"));	
						Если Час(Объект.УтвержденоДата)>=16 И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+16*3600+1) Тогда
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+16*3600+1,"ДФ='HH:mm dd MMMM'"));
						Иначе
							ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+9*3600+1,"ДФ='HH:mm dd MMMM'"));
						КонецЕсли;
						
						ЕстьИзменения = Истина;
					КонецЕсли;
				Иначе
					СнятьСрочность = Истина;	
				КонецЕсли;
			ИначеЕсли текДата<Дата(2016,12,11) Тогда
				Если Объект.УтвержденоДата<>Дата(1,1,1)и Объект.Дата<КонецДня(Объект.УтвержденоДата) Тогда 
					//И НЕ НомерЗаявки = Перечисления.уб_ВидыЗаявок.Личная 
					Если Срочная = Истина Тогда
					Иначе
						Срочная = Истина;
						//Предупреждение("Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(ДатаСоздания)+9*3600+1,"ДФ='HH:mm dd MMMM'"));	
						ПоказатьПредупреждение(,"Автоматически установлена срочная заявка. Либо выезд с "+Формат(КонецДня(Объект.УтвержденоДата)+9*3600+1,"ДФ='HH:mm dd MMMM'"));	
						ЕстьИзменения = Истина;
					КонецЕсли;
				Иначе
					СнятьСрочность = Истина;	
				КонецЕсли;
				//Убрано 2016-08-15
				//ИначеЕсли (ДатаСоздания> НачалоДня(ТекущаяДата())+17*3600) и Дата <=КонецДня(ДатаСоздания)+24*3600 Тогда
				//	Если Срочная = Истина Тогда
				//	Иначе
				//		Предупреждение("Заявка подана после 17:00. Установлена срочная, либо выезд с "+Формат(КонецДня(ДатаСоздания)+33*3600+1,"ДФ='HH:mm dd MMMM'"));	
				//		Срочная = Истина;
				//		ЕстьИзменения = Истина;
				//	КонецЕсли;	
			Иначе
				СнятьСрочность = Истина;
			КонецЕсли;
			
			Если СнятьСрочность = Истина и Объект.Срочная = Истина Тогда
				Объект.Срочная = Ложь;
				ПоказатьПредупреждение(,"Снята срочность"+?(Объект.Утверждено,"",". При утверждении будет проверена срочность. Возможно изменение стоимости выезда."));	
				ЕстьИзменения = Истина;
				Объект.ВознаграждениеОтКлиента  = 0;
				Объект.ОплатитьВКассуЗаВыездКурьера = 0;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		//ПоказатьПредупреждение(,"В подразделение не проверяется срочность",3);
	КонецЕсли;
	Если ПересчитатьВознаграждение = Истина ИЛИ ЕстьИзменения = Истина Тогда
		Если Объект.Срочная и ЕстьИзменения = Истина Тогда
			Объект.ВознаграждениеОтКлиента = Объект.ОплатитьВКассуЗаВыездКурьера;
		КонецЕсли;	
		ПриИзмененииСвязанномСВознаграждением(Неопределено);
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция БудетСрочная()
	
	Если Объект.УтвержденоДата=Дата(1,1,1) Тогда
		ДатаПроверки = ?(Объект.УтвержденоДата=Дата(1,1,1),ТекущаяДата(),Объект.УтвержденоДата);
		
		Если ДатаПроверки<>Дата(1,1,1) 
			И (Объект.Дата<КонецДня(ДатаПроверки) 
			ИЛИ ( ДатаПроверки>(НачалоДня(ДатаПроверки)+16*3600+45*60)
			И Объект.Дата <(КонецДня(ДатаПроверки)+16*3600+45*60+1)	
			)
			) Тогда
			//
			//Предупреждение("Срочная");
			//Элементы.нСрочная.Видимость = Истина;
		Иначе
			//Элементы.нСрочная.Видимость = Ложь;
		КонецЕсли;
	Иначе
		//Элементы.нСрочная.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.УтвержденоДата<>Дата(1,1,1) 
		И (Объект.Дата<КонецДня(Объект.УтвержденоДата) 
		ИЛИ ( Объект.УтвержденоДата>(НачалоДня(Объект.УтвержденоДата)+16*3600+45*60)
		И Объект.Дата <(КонецДня(Объект.УтвержденоДата)+16*3600+45*60+1)	
		)
		)  	Тогда
		//Элементы.нСрочная.Видимость = Истина;
		Возврат Истина
	Иначе 
		Возврат ЛОЖЬ
	КонецЕсли;					
КонецФункции	


Процедура ПосчитатьПолиса() Экспорт
	//ДополнительныеСвойства.Вставить("Каско",0);
	//ДополнительныеСвойства.Вставить("Осаго",0);
	//ДополнительныеСвойства.Вставить("НС",0);
	//ДополнительныеСвойства.Вставить("Прочие",0);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БСО.НомерСтроки,
	|	БСО.ВидБСО,
	|	БСО.Количество
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЗБСО КАК БСО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТЧ.ВидБСО,
	|	ЕСТЬNULL(С.Наименование, ""Вид СП"") КАК Наименование,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ТЧ.ВидБСО) = ТИП(Перечисление.уб_ВидыСтраховыхПродуктов)
	|				ТОГДА ВТ_ТЧ.ВидБСО
	|			ИНАЧЕ ЕСТЬNULL(СП.Ссылка.Вид, ""Прочее"")
	|		КОНЕЦ) КАК Вид,
	|	МАКСИМУМ(ВТ_ТЧ.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Виды
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_СтраховыеПродукты.ВидыБСО КАК СП
	|		ПО ВТ_ТЧ.ВидБСО = СП.ВидБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК С
	|		ПО ВТ_ТЧ.ВидБСО = С.Ссылка
	|ГДЕ
	|	СП.Ссылка есть null ИЛИ НЕ СП.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧ.НомерСтроки,
	|	ВТ_ТЧ.ВидБСО,
	|	ЕСТЬNULL(С.Наименование, ""Вид СП"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	99,
	|	ЗНАЧЕНИЕ(Справочник.уб_ВидыБСО.ПустаяСсылка),
	|	""Квитанция"",
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(уб_СтраховойПолис.СтраховойПродукт) = ТИП(Справочник.уб_СтраховыеПродукты)
	|			ТОГДА уб_СтраховойПолис.СтраховойПродукт.Вид
	|		ИНАЧЕ уб_СтраховойПолис.СтраховойПродукт
	|	КОНЕЦ,
	|	1
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО КАК С
	|		ПО ВТ_ТЧ.ВидБСО = С.Ссылка
	|			И (С.Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7))
	|			И (&Тип = ЗНАЧЕНИЕ(Перечисление.уб_ТипВыезда.ОчереднойВзнос))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ПО (уб_СтраховойПолис.Ссылка = &Полис)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КАСКО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						ИЛИ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ОСАГО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ДМС)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ДМС,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Наименование = ""Техосмотр""
	|						ИЛИ ВТ_Виды.Наименование = ""Техосмотр (отдельно)""
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ДК,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК НС,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""ЕОСАГО%""
	|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""Е-ОСАГО%""
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ЕОСАГО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""ЕКАСКО%""
	|						ИЛИ ВТ_Виды.Наименование ПОДОБНО ""Е-КАСКО%""
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ЕКАСКО,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.НС)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО)
	|						И НЕ ВТ_Виды.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО)
	|					ТОГДА ВТ_Виды.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК Прочие
	|ИЗ
	|	ВТ_Виды КАК ВТ_Виды");
	ТЗБСО = Объект.БСО.Выгрузить();
	//ТЗБСО.Колонки.Добавить("Тип");
	//Для Каждого СтрокаТЗ Из ТЗБСО Цикл
	//	Если ТипЗнч(СтрокаТЗ.ВидБСО) = Тип("СправочникСсылка.уб_ВидыБСО") Тогда
	//		СтрокаТЗ.Тип = СтрокаТЗ.ВидБСО.Тип
	//	КонецЕсли;
	//	КонецЦикла;
	Запрос.УстановитьПараметр("ТЗБСО", ТЗБСО);
	Запрос.УстановитьПараметр("Тип", Объект.Тип);
	Запрос.УстановитьПараметр("Полис", Объект.НомерДоговора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//ДополнительныеСвойства.Вставить("Каско",  Выборка.Каско);
		//ДополнительныеСвойства.Вставить("Осаго",  Выборка.Осаго);
		//ДополнительныеСвойства.Вставить("НС",     Выборка.НС);
		//ДополнительныеСвойства.Вставить("Прочие", Выборка.Прочие);
		//ДополнительныеСвойства.Вставить("ДМС", Выборка.ДМС);
		//ДополнительныеСвойства.Вставить("ДК", Выборка.ДК);
		//ДополнительныеСвойства.Вставить("ЕОСАГО", Выборка.ЕОСАГО);
		//ДополнительныеСвойства.Вставить("ЕКАСКО", Выборка.ЕКАСКО);
		уб_ВызовСервера._УстановитьЗначение(Объект,"Каско",Выборка.Каско);
		уб_ВызовСервера._УстановитьЗначение(Объект,"Осаго",Выборка.Осаго);  
		уб_ВызовСервера._УстановитьЗначение(Объект,"НС",   Выборка.НС);
		уб_ВызовСервера._УстановитьЗначение(Объект,"ДМС",  Выборка.ДМС);
		уб_ВызовСервера._УстановитьЗначение(Объект,"ДК",   Выборка.ДК);
	Иначе
		уб_ВызовСервера._УстановитьЗначение(Объект,"Каско",0);
		уб_ВызовСервера._УстановитьЗначение(Объект,"Осаго",0);  
		уб_ВызовСервера._УстановитьЗначение(Объект,"НС",   0);
		уб_ВызовСервера._УстановитьЗначение(Объект,"ДМС",  0);
		уб_ВызовСервера._УстановитьЗначение(Объект,"ДК",   0);
		//ДополнительныеСвойства.Вставить("Каско",  0);
		//ДополнительныеСвойства.Вставить("Осаго",  0);
		//ДополнительныеСвойства.Вставить("НС",     0);
		//ДополнительныеСвойства.Вставить("Прочие", 0);
		//ДополнительныеСвойства.Вставить("ДМС", 0);
		//ДополнительныеСвойства.Вставить("ДК", 0);
		//ДополнительныеСвойства.Вставить("ЕОСАГО", 0);
		//ДополнительныеСвойства.Вставить("ЕКАСКО", 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНаименования()
	ЕстьСтрахователь = ЗначениеЗаполнено(Объект.Страхователь);
	Если ТипЗнч(Объект.Страхователь) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТипСтрахователя = "Организация";
	Иначе
		ТипСтрахователя = "ФИО";
	КонецЕсли;	
	//Элементы.Наименование.Картинка = ?(ЕстьСтрахователь,БиблиотекаКартинок.уб_ОплатаОК,БиблиотекаКартинок.уб_ОплатаВопрос);
	Элементы.Наименование.КнопкаОткрытия = ЕстьСтрахователь;
	Элементы.Наименование.КнопкаВыбора = ЕстьСтрахователь; 
	Элементы.Наименование.КнопкаОчистки = ЕстьСтрахователь; 
	Элементы.СоздатьСтрахователя.Доступность = НЕ ЕстьСтрахователь;
//	Элементы.СоздатьСтрахователя.Доступность = ВыполненПоискСтрахователя;
	Элементы.СоздатьСтрахователя.Видимость   = ВыполненПоискСтрахователя и ЕстьСтрахователь = ЛОЖЬ;
	Если ВыполненПоискСтрахователя Тогда
		Элементы.СоздатьСтрахователя.ЦветТекста = Новый Цвет(0,0,255);
	Иначе
		Элементы.СоздатьСтрахователя.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;	
КонецПроцедуры	


#Область ВОЗНАГРАЖДЕНИЯ

&НаСервере
Процедура РасчетВознагражденийУдержаний(Предупреждать = Ложь)
	
	Если ТолькоПросмотр Тогда
		//СКВ = РасчетСКВПоЗаявке();
		//ДополнительныеСвойства.Вставить("СКВ",СКВ);
		//Возврат;
	Иначе
		Данныеформы = РеквизитФормыВЗначение("Объект");
		
		ПараметрыСотрудникаИДокумента = ПолучитьИзВременногоХранилища(АдресПараметровВызова);
		
		Данныеформы.РасчетВознагражденияКурьера(ПараметрыСотрудникаИДокумента);
		ЭтаФорма.ЗначениеВРеквизитФормы(Данныеформы,"Объект");		
	КонецЕсли;	
	
	
	//_СКВ = ?(ДополнительныеСвойства.Свойство("СКВ"),ДополнительныеСвойства.СКВ,0);
	//ЭлементыФОрмы.нСКВ.Заголовок = ""+Формат(_СКВ,"ЧДЦ=0; ЧН=");
	//ЭлементыФОрмы.нСКВ.ЦветТекста = ?(_СКВ<3400,Новый Цвет(255,0,0),Новый Цвет(0,128,0));
	
	Элементы.ВознаграждениеОтКлиента.ЦветФона= ?(Объект.ВознаграждениеОтКлиента>0,Новый Цвет(255,128,128),Новый Цвет);
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли; 
	_Административный = Объект.Тип = ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный");
	Если Объект.Самовыезд 
		Или Объект.ИсточникФинансирования = ПредопределенноеЗначение("Перечисление.уб_ИсточникиФинансирования.Курьер") 
		Или _Административный Тогда
		//Никто ни за что не платит
		Если Объект.Самовыезд И ЗначениеЗаполнено(Объект.Курьер) Тогда
			Объект.Курьер = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;	
		//	Элементы.ИсточникФинансирования.Видимость				= Не Объект.Самовыезд И НЕ _Административный;
		//ИначеЕсли Объект.ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Брокер 
		//	ИЛИ Объект.ИсточникФинансирования = Перечисления.уб_ИсточникиФинансирования.Клиент Тогда
		//	//Курьер получает
		//	Элементы.ИсточникФинансирования.Видимость				= Истина;
		//	
		//Иначе 
		//	//Менеджер
		//	Элементы.ИсточникФинансирования.Видимость				= Истина;
		
	КонецЕсли;
	
	Попытка
		Элементы.ВознагражениеКурьера.Заголовок =?(Объект.ЗаблокироватьАвторасчет = Истина,"Вознаграждение курьера(БЛОК.)","Вознаграждение курьера");
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти


//Вспомогательные
&НаСервере
Функция СписокСотрудниковДляДокумента()
	МассивИменПолей = уб_temp.МассивИменПроверяемыхПолей(Объект.Ссылка);//Непрозрачно
	СЗ = Новый СписокЗначений;
	Для Каждого ЭлементМассива Из МассивИменПолей Цикл
		СЗ.Добавить(Объект[ЭлементМассива])
	КонецЦикла;	
	Возврат СЗ;
КонецФункции // СписокСотрудниковДляДокумента()

&НаСервереБезКонтекста
Функция СписокНеТребуемыхДляЗаполненияПолей(Тип,ДатаСоздания)
	
	Список = Новый Массив;
	Прч = Перечисления.уб_ТипВыезда;
	Список.Добавить("СК");

	Если Тип = Прч.Страховка Тогда
		Список.Добавить("ЦельВыезда");
		Список.Добавить("СК");
		Список.Добавить("НомерДоговора");
		Список.Добавить("ЦельВыезда");
	ИначеЕсли Тип = Прч.Пролонгация Тогда
		Список.Добавить("ЦельВыезда");
	ИначеЕсли Тип = Прч.ОчереднойВзнос Тогда
		Список.Добавить("ЦельВыезда");
	ИначеЕсли Тип = Прч.Перепись Тогда
		Список.Добавить("ЦельВыезда");
	ИначеЕсли Тип = Прч.Переосмотр Тогда
		
	ИначеЕсли Тип = Прч.Административный Тогда
		//Если Объект.ЦельВыезда = "Административный" Тогда
		Список.Добавить("НомерЗаявки");
		//Список.Добавить("Банк");
		Список.Добавить("НомерДоговора");
		//КонецЕсли;
		
		Список.Добавить("ВознаграждениеКурьера");
	ИначеЕсли Тип = Прч.Аддендум Тогда
		
		Список.Добавить("ЦельВыезда");
	ИначеЕсли Тип = Прч.ПервичныйОсмотр Тогда
		
		Список.Добавить("СК");
		Список.Добавить("НомерДоговора");
		Список.Добавить("ЦельВыезда");
	КонецЕсли;
	ДатаАктуальна = ЗначениеЗаполнено(ДатаСоздания) И ДатаСоздания >= '20131001';
	Если Не ДатаАктуальна Тогда
		МассивНовыхПолей = Новый Массив;
		МассивНовыхПолей.Добавить("СК");
		МассивНовыхПолей.Добавить("СтанцияМетро");
		МассивНовыхПолей.Добавить("Город");
		МассивНовыхПолей.Добавить("ЦельВыезда");
		МассивНовыхПолей.Добавить("НомерДоговора");
		МассивНовыхПолей.Добавить("КонтактноеЛицо");
		Для Каждого ЭлементМассива Из МассивНовыхПолей Цикл
			Если Список.НайтиПоЗначению(ЭлементМассива) = Неопределено Тогда
				Список.Добавить(ЭлементМассива)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Список;		
	
КонецФункции

Функция ЧастнаяСтруктураСтатусаДокумента()
	
	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 	"Приняты деньги!");
	Структура.Вставить("ЦветТекста",	ЦветаСтиля.ЦветТекстаПроведен);
	Структура.Вставить("ЦветФона",		ЦветаСтиля.ЦветФонаПроведен);
	Подсказка = "По заявке приняты деньги, изменять заявку нельзя!";
	Структура.Вставить("Подсказка",		Подсказка);
	Структура.Вставить("Пояснение",		Подсказка);
	Возврат Структура;
	
КонецФункции // ЧастнаяСтруктураСтатусаДокумента()

Процедура ЗапретитьПравкуДат(Установить = Истина)
	Элементы.Дата.ТолькоПросмотр            = Установить;
	//Элементы.ВремяНачало1.ТолькоПросмотр    = Установить;
	//Элементы.ВремяОкончания1.ТолькоПросмотр = Установить;
	Элементы.ВремяНачало.ТолькоПросмотр     = Установить;
	Элементы.ВремяОкончания.ТолькоПросмотр  = Установить;
КонецПроцедуры	

Процедура АдресОтметкаНезаполненного()
	
	Элементы.Адрес.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.МестоВстречи) И Не ЗначениеЗаполнено(Объект.Адрес);
	
КонецПроцедуры

//&НаСервере
//Процедура УстановитьПровереноРуководителем()
//	уб_вызовСервера._УстановитьЗначение (Объект,"ПровереноРуководителем", Объект.ТребуетсяПроверкаРуководителем и ЗначениеЗаполнено(Объект.УтвердилРуководитель));
//КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииМенеджер()
	
	ТелефонМенеджера = СтрЗаменить(уб_ФормыВызовСервера.ДайКонтактнуюИнформациюФизлица(Объект.Менеджер, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный"))," ","");
	//ТелефонМенеджера2 = СтрЗаменить(уб_ФормыВызовСервера.ДайКонтактнуюИнформациюФизлица(Объект.Менеджер, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаМобильный"))," ","");
	EmalМенеджера = СтрЗаменить(уб_ФормыВызовСервера.ДайКонтактнуюИнформациюФизлица(Объект.Менеджер, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыФизЛица"))," ","");
	//Если ТелефонМенеджера2 = ТелефонМенеджера Тогда
		ТелефонМенеджера2 ="";
	//КонецЕсли;	
	Если ПустаяСтрока(ТелефонМенеджера) и ПустаяСТрока(ТелефонМенеджера2) Тогда
		ТелефонМенеджера 	= "Тел.: Нет данных";
	Иначе
		ТелефонМенеджера 	= ТелефонМенеджера;//+?(ПустаяСтрока(ТелефонМенеджера),"","  ")+ТелефонМенеджера2;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСамовыезд(Предупреждать = Ложь)
	
	Если Объект.ТипВыезда = 1 Тогда
		//Самовыезд
		_Самовыезд = Истина;
		уб_ВызовСервера._УстановитьЗначение(Объект,"Адрес","Офис");
		Объект.СтанцияМетро = Справочники.уб_СтанцииМетро.НайтиПоНаименованию("Дмитровская");
	ИначеЕсли Объект.ТипВыезда = 0 Тогда
		//Курьер
		_Самовыезд = Ложь;
		Если Объект.СтанцияМетро = Справочники.уб_СтанцииМетро.НайтиПоНаименованию("Дмитровская") Тогда
			Объект.СтанцияМетро = Справочники.уб_СтанцииМетро.ПустаяСсылка();
		КонецЕсли;	
	ИначеЕсли Объект.ТипВыезда = 2 Тогда
		//Офис
		_Самовыезд = Истина;
		//Если ПустаяСтрока(Адрес) Тогда
		уб_ВызовСервера._УстановитьЗначение(Объект,"Адрес","Офис");
		Объект.СтанцияМетро = Справочники.уб_СтанцииМетро.НайтиПоНаименованию("Дмитровская");
		//КонецЕсли;
	Иначе
		_Самовыезд = Объект.Самовыезд;
	КонецЕсли;
	
	уб_ВызовСервера._УстановитьЗначение(Объект,"Самовыезд",_Самовыезд);
	
	//КонтрольДатыВыездаЛички(ДатаСоздания);
	
	
	Элементы.Курьер.Видимость 	  = Не Объект.Самовыезд;
	//Элементы.нКурьер.Видимость    = Не Объект.Самовыезд;
	Элементы.ГруппаЗанятость.Видимость = Не Объект.Самовыезд;
	//Элементы.тКурьера.Видимость   = Не Объект.Самовыезд;
	//Элементы._Самовыезд.Заголовок = ?(Объект.СамоВыезд, "Курьер", "Курьер:");
	Если Не Объект.Самовыезд и ЗначениеЗаполнено(Объект.Курьер) = Ложь Тогда
		Объект.Курьер = Справочники.ФизическиеЛица.ПустойАгент;
	КонецЕсли;	
	
	//
	Если Объект.Срочная и Объект.Самовыезд = Истина Тогда
		Объект.ВознаграждениеОтКлиента = Объект.ОплатитьВКассуЗаВыездКурьера;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Функция УстановитьДоступностьПодСтатусов()
	
	//тд = Элементы.БСОДерево.ТекущиеДанные;
	//Если тд = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;	
	//Состояние  = тд.Состояние;
	
	
	//Кнопки = Элементы.КонтекстноеМеню.Кнопки;
	//
	//п = Перечисления.уб_СостояниеОформления;
	//Кнопки.Заведение.Доступность                   = Состояние<>п.НаОформлении и ЭтоОператорИлиУправлениеПечатью = Истина;
	//Кнопки.ПрисвоениеНомера.Доступность            = Состояние<>п.ПолисЗаведен и ЭтоОператорИлиУправлениеПечатью = Истина; 
	//Кнопки.УстановитьСтатусВыпускМаски.Доступность = Состояние<>п.ВыпускМаски и (ЭтоОператорИлиУправлениеПечатью = Истина или ЭтоОтделБСО = Истина);
	//Кнопки.УстановитьСтатусПечать.Доступность      = Состояние<>п.Печать и ЭтоОператорИлиУправлениеПечатью = Истина;
	//Кнопки.КомплектОформлен.Доступность            = Состояние<>п.КомплектОформлен и ЭтоОтделБСО = Истина;
	//Кнопки.ОчиститьНомерБСО.Доступность = ЭтоОтделБСО = Истина или уб_КЭШируемые.ДоступностьРоли("ПолныеПрава");
	
КонецФункции	

#Область СтатусыЗаявки
&НаКлиенте
Процедура ВидимостьСтатусаЗаявки()
	
	Если Объект.Тип <> ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный") И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.СтатусЗаявки.Видимость		= Истина;
	Иначе
		Элементы.СтатусЗаявки.Видимость		= Истина;
	КонецЕсли;
	Элементы.СтатусЗаявки.ТолькоПросмотр = Объект.ПометкаУдаления;// или ЭтоКурьер = Истина;
	
КонецПроцедуры

//СТАТУСЫ

&НаКлиенте
Процедура СтатусЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если Не Объект.ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
			Записать();
		КонецЕсли;	
		СтрокаРеквизитов 	= уб_УСЗ.ПолучитьРеквизитыЗаявки(Объект.Ссылка);
		//список действий основывается на ссылке, а не на объекте
		Если ЭтоКурьер = Истина Тогда
			МассивРолей = Новый Массив;
			МассивРолей.Добавить("Курьер");
			//СписокДействий.Добавить("УстановитьСтатус_БСОНаРукахУКурьера", "Заявка у курьера");
		Иначе	
			МассивРолей			= уб_УСЗ.ПолучитьРольПользователяДляЗаявок(, Истина);
		КонецЕсли;	
		
		//ПолныйСписокДействий 		= уб_УСЗ.ВернутьСписокДействийДляСтатуса(СтатусЗаявки, СтрокаРеквизитов,, МассивРолей);
		ПолныйСписокДействий = Новый СписокЗначений;
		МассивСтруктур = уб_УСЗ.ВернутьСписокДействийДляСтатуса(СтатусЗаявки,СтрокаРеквизитов, ,МассивРолей,,Истина);
		Для каждого Элемент из МассивСтруктур Цикл
			ПолныйСписокДействий.Добавить(Элемент.Значение,Элемент.Представление,,Элемент.Картинка);
		КонецЦикла;
		
		//Роль				= уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
		
		СписокВыбора = Элементы.СтатусЗаявки.СписокВыбора;
		СписокДействий	= Новый СписокЗначений;
		Для Каждого ЭлементСпискаДействий Из ПолныйСписокДействий Цикл
			Для каждого Роль из МассивРолей Цикл
				Если уб_УСЗ.ДействиеДоступноДляРоли(ЭлементСпискаДействий.Значение, Роль) и СписокДействий.НайтиПоЗначению(ЭлементСпискаДействий.Значение)=Неопределено Тогда
					СтрокаСЗ = СписокДействий.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСЗ, ЭлементСпискаДействий);
					////Дублируем
					//СтрокаСЗ = СписокВыбора.Добавить();
					//ЗаполнитьЗначенияСвойств(СтрокаСЗ, ЭлементСпискаДействий);
					
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если СписокДействий.Количество()>0 Тогда
			ОписаниеОповещения = Новый ОписаниеОПовещения("ПриВыбореСтатуса",ЭтаФорма,Новый Структура());
			ЭтаФорма.ПоказатьВыборИзСписка(ОписаниеОповещения,СписокДействий,Элементы.СтатусЗаявки);
			
		КонецЕсли;	
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореСтатуса(ВыбранноеЗначение,ДопПараметр)  Экспорт
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка2 = Ложь;
		СтатусОбработкаВыбора(Элементы.СтатусЗаявки, ВыбранноеЗначение, СтандартнаяОбработка2);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗаявкиПриИзменении(Элемент)
	Оповестить("уб_СтатусыЗаявок","ОбновитьСписки");
	//Перечитать();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//СтрокаСЗ = Элементы.СтатусЗаявки.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	//Если СтрокаСЗ = Неопределено Тогда
	//	ТекстКоманды = "";
	//	Статус = "";
	//Иначе
		ТекстКоманды = ВыбранноеЗначение.Представление;
		Действие     = ВыбранноеЗначение.Значение;
	//КонецЕсли;
	Если ТекстКоманды = "Формирование комплекта БСО"
		 или Действие = "УстановитьСтатус_ФормированиеКомплектаБСО" Тогда
		//ОсталосьДоВыезда = Дата-ТекущаяДата();
		ОсталосьДоВыезда = Объект.ВремяВстречиКлиент-ТекущаяДата();
		
		Если ОсталосьДоВыезда <3600 и Объект.ТипВыезда = 0 Тогда
			ПоказатьПредупреждение(,"До выезда менее часа или просрочен. Запрещено");
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Если уб_УСЗ.ДействиеКлиентское(Действие) Тогда
		//Если уб_УСЗ_Клиент.ВыполнитьДействиеПоЗаявке(Объект.Ссылка, СтатусЗаявки, Действие,,, ТекстКоманды,, ЭтаФорма.Объект) Тогда
		Если уб_УСЗ_Клиент.ВыполнитьДействиеПоЗаявке(Объект.Ссылка, СтатусЗаявки, Действие,,, ТекстКоманды,,) Тогда
			СтатусЗаявки = уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка, ТекущаяДата());
		КонецЕсли;	
	Иначе	
		//Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(Объект.Ссылка, СтатусЗаявки, Действие,,, ТекстКоманды,, ЭтаФорма.Объект) Тогда
		Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(Объект.Ссылка, СтатусЗаявки, Действие,,, ТекстКоманды,, ) Тогда
			Если Действие = "УстановитьСтатус_ЗапросНаУдаление" Тогда
				
				//ДополнительныеСвойства.Вставить("ЕстьПриемкиПоЗаявке",Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ЕстьПриемкиПоЗаявке(Объект.Ссылка));
				///уб_temp.УстановитьСтатусДокумента(ЭтаФорма,, ?(ДополнительныеСвойства.ЕстьПриемкиПоЗаявке = ЛОЖЬ, Неопределено, ЧастнаяСтруктураСтатусаДокумента()));
				//уб_СС.ЗаполнитьИнфСтроку(ЭтаФорма);	
			КонецЕсли;
			СтатусЗаявки = уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка, ТекущаяДата());
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	ВыбранноеЗначение = уб_УСЗ.ВернутьСтатусЗаявки(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВидимостьКнопкиВыбораАдреса()
	
	Элементы.Адрес.КнопкаВыбора = ЛОЖЬ;//Не ПустаяСтрока(Объект.Город);
	Элементы.Адрес.КнопкаВыпадающегоСписка = Истина;//Офис
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьДатыВстречи(ТипОбработки = 0)
	
	нДня = НачалоДня(Объект.Дата);
	Если Не нДня = НачалоДня(Объект.ВремяОкончания) Тогда
		Объект.ВремяОкончания = Дата(Год(Объект.Дата),Месяц(Объект.Дата),День(Объект.Дата),Час(Объект.ВремяОкончания),Минута(Объект.ВремяОкончания),0);
	КонецЕсли;	
	
	Если Не нДня = НачалоДня(Объект.ВремяНачало) Тогда
		Объект.ВремяНачало = Дата(Год(Объект.Дата),Месяц(Объект.Дата),День(Объект.Дата),Час(Объект.ВремяНачало),Минута(Объект.ВремяНачало),0);
	КонецЕсли;	
	
	Если Не нДня = НачалоДня(Объект.ВремяВстречиКлиент) Тогда
		Объект.ВремяВстречиКлиент = Дата(Год(Объект.Дата),Месяц(Объект.Дата),День(Объект.Дата),Час(Объект.ВремяВстречиКлиент),Минута(Объект.ВремяВстречиКлиент),0);
	КонецЕсли;	
	
	Если Не нДня = НачалоДня(Объект.ВремяОкончанияКлиент) Тогда
		Объект.ВремяОкончанияКлиент = Дата(Год(Объект.Дата),Месяц(Объект.Дата),День(Объект.Дата),Час(Объект.ВремяОкончанияКлиент),Минута(Объект.ВремяОкончанияКлиент),0);
	КонецЕсли;	
	Если Объект.Дата <> Объект.ВремяНачало Тогда
		Объект.Дата  = Объект.ВремяНачало;
	КонецЕсли;	
	//		ВремяОкончания = Дата
	//	КонецЕсли;
	//Если ТипОбработки = 1 Тогда
	//	УстановитьЗначение(ВремяНачало,	Мин(ВернутьДатуИзВремениДокумента(Дата, ВремяНачало), Дата));
	//	УстановитьЗначение(ВремяОкончания, ВернутьДатуИзВремениДокумента(Дата, ВремяОкончания));
	//	Если Дата > ВремяОкончания Тогда
	//		ВремяОкончания = Дата
	//	КонецЕсли;
	//Иначе
	//	УстановитьЗначение(ВремяНачало,	ВернутьДатуИзВремениДокумента(Дата, ВремяНачало));
	//	УстановитьЗначение(ВремяОкончания, ВернутьДатуИзВремениДокумента(Дата, ВремяОкончания));
	//	Если ТипОбработки = 2 Тогда
	//		//считаем что время начало всегда < время окончания
	//		Если Дата < ВремяНачало Тогда
	//			Дата = ВремяНачало
	//		ИначеЕсли Дата > ВремяОкончания Тогда
	//			Дата = ВремяОкончания
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиГородов()
	Элементы.Город.КнопкаВыпадающегоСписка = Истина;
	Элементы.Город.КнопкаВыбора            = Ложь;
	Элементы.Город.ВысотаСпискаВыбора      = 15;
	
	СписокВыбора 	= Элементы.Город.СписокВыбора;
	СписокВыбора.ЗагрузитьЗначения(уб_КЭШируемые.СписокГородов());
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресСпискаСтрахователей(Наименование,ТипСтрахователь)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Агент",ПараметрыСеанса.уб_ТекущееФизЛицо);
	Запрос.УстановитьПараметр("Наименование","%"+Наименование+"%");
	Запрос.УстановитьПараметр("КлючПоиска",уб_ВызовСервера.КлючПоискаНаименования(Наименование));
	Если ТипСтрахователь = Тип("СправочникСсылка.Контрагенты") Тогда
		_Наименование = ""+Наименование;
		_Наименование = СтрЗаменить(_Наименование,"ООО","");
		_Наименование = СтрЗаменить(_Наименование,"""","");
		_Наименование = СтрЗаменить(_Наименование,"«"," ");
		_Наименование = СтрЗаменить(_Наименование,"»"," ");
		_Наименование = СтрЗаменить(_Наименование,"АНОВО","");
		_Наименование = СтрЗаменить(_Наименование,"АНО","");
		_Наименование = СтрЗаменить(_Наименование,"ЗАО","");
		_Наименование = СтрЗаменить(_Наименование,"ПАО","");
		_Наименование = СтрЗаменить(_Наименование,"АО","");		
		 _Наименование = СтрЗаменить(_Наименование,"ФГБНУ","");
		 _Наименование = СтрЗаменить(_Наименование,"ФГУП","");
		 _Наименование = СтрЗаменить(_Наименование,"УФК","");
		// _Наименование = СтрЗаменить(_Наименование,"УФК","");
		_Наименование = СтрЗаменить(_Наименование,"ГУП","");
		_Наименование = СтрЗаменить(_Наименование,"ТСЖ","");
		_Наименование = СтрЗаменить(_Наименование,"ТСН","");
		_Наименование = СтрЗаменить(_Наименование,"ТД ","");
		_Наименование = СтрЗаменить(_Наименование,"СК ","");
		_Наименование = СтрЗаменить(_Наименование,"НПО ","");
		_Наименование = СтрЗаменить(_Наименование,"  "," ");
		_Наименование = СтрЗаменить(_Наименование,"  "," ");
		Запрос.УстановитьПараметр("Наименование","%"+СокрЛП(_Наименование)+"%");
		Запрос.УстановитьПараметр("Мусор",уб_ВызовСервера.КонтрагентыГруппаМусор());
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Контрагенты.Ссылка КАК Ссылка,
		               |	Контрагенты.Наименование КАК Наименование,
		               |	Контрагенты.ИНН КАК ИНН,
		               |	Контрагенты.Комментарий КАК Комментарий
		               |ПОМЕСТИТЬ Контрагенты
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	(Контрагенты.Наименование ПОДОБНО &Наименование или Контрагенты.ИНН ПОДОБНО &Наименование)
		               |	И Контрагенты.ЭтоГруппа = ЛОЖЬ
		               |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ Контрагенты.Ссылка В ИЕРАРХИИ (&Мусор)
					   |	И НЕ ИНН = """"
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолис.Ссылка) КАК Полисов,
		               |	СУММА(ВЫБОР
		               |			КОГДА уб_СтраховойПолис.Агент = &Агент
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ЗастрахованоВами,
		               |	уб_СтраховойПолис.Страхователь КАК Страхователь
		               |ПОМЕСТИТЬ Статистика
		               |ИЗ
		               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		               |ГДЕ
		               |	уб_СтраховойПолис.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью)
		               |	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка)
		               |	И уб_СтраховойПолис.Страхователь В
		               |			(ВЫБРАТЬ
		               |				Контрагенты.Ссылка
		               |			ИЗ
		               |				Контрагенты)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уб_СтраховойПолис.Страхователь
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Страхователь,
		               |	Контрагенты.ИНН КАК ИНН,
		               //|	ПОДСТРОКА(Контрагенты.Комментарий, 1, 10) КАК Комментарий,
		               |	ЕСТЬNULL(Статистика.Полисов, 0) КАК Полисов,
		               |	ЕСТЬNULL(Статистика.ЗастрахованоВами, 0) КАК Ваших
		               |ИЗ
		               |	Контрагенты КАК Контрагенты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Статистика КАК Статистика
		               |		ПО Контрагенты.Ссылка = Статистика.Страхователь
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Контрагенты.Наименование,
		               |	Статистика.ЗастрахованоВами";

	Иначе
		
		Запрос.УстановитьПараметр("ФизлицаГруппаМусор",уб_ВызовСервера.ФизлицаГруппаМусор());
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.ДатаРождения
		|ПОМЕСТИТЬ ФизическиеЛица
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	(ФизическиеЛица.Наименование ПОДОБНО &Наименование или ФизическиеЛица.КлючПоиска = &КлючПоиска)
		|	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
		|	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ
		|   И НЕ ФизическиеЛица.Ссылка в Иерархии(&ФизлицаГруппаМусор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолис.Ссылка) КАК Полисов,
		|	СУММА(ВЫБОР
		|			КОГДА уб_СтраховойПолис.Агент = &Агент
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЗастрахованоВами,
		|	уб_СтраховойПолис.Страхователь
		|ПОМЕСТИТЬ Статистика
		|ИЗ
		|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|ГДЕ
		|	уб_СтраховойПолис.ПометкаУдаления = ЛОЖЬ
		|	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью)
		|	И НЕ уб_СтраховойПолис.СостояниеПолиса = ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка)
		|	И уб_СтраховойПолис.Страхователь В
		|			(ВЫБРАТЬ
		|				ФизическиеЛица.Ссылка
		|			ИЗ
		|				ФизическиеЛица)
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_СтраховойПолис.Страхователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка как Страхователь,
		//|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.ДатаРождения,
		|	ISNULL(Статистика.Полисов,0) Как Полисов,
		|	ISNULL(Статистика.ЗастрахованоВами,0) КАК Ваших
		|ИЗ
		|	ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОе СОЕДИНЕНИЕ Статистика КАК Статистика
		|		ПО ФизическиеЛица.Ссылка = Статистика.Страхователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	ЗастрахованоВами";
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Если Данные.Количество() = 0 Тогда
		Возврат "";
	Иначе	
		Возврат ПоместитьВоВременноеХранилище(Данные,Новый УникальныйИдентификатор);
	КонецЕсли;	
	
	
КонецФункции	

&НаСервереБезКонтекста
Функция НовоеНаименование(Наименование)
	Возврат Справочники.ФизическиеЛица.НовоеНаименование(Наименование);
КонецФункции	

&НаСервереБезКонтекста
Функция ДанныеСтарогоПолиса(НомерДоговора)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_СтраховойПолис.СК,
	|	уб_СтраховойПолис.Страхователь,
	|	ПРЕДСТАВЛЕНИЕ(уб_СтраховойПолис.Страхователь) КАК СтраховательСтрока
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|ГДЕ
	|	уб_СтраховойПолис.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", НомерДоговора);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("СК,Страхователь,СтраховательСтрока",Выборка.СК,Выборка.Страхователь,Выборка.СтраховательСтрока);
	Иначе
		Возврат Неопределено
	КонецЕсли;	
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьТелефонКонтактногоЛица(СК, КонтактноеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.ОсновноеКонтактноеЛицо
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",СК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КонтактноеЛицо = Выборка.ОсновноеКонтактноеЛицо;
	Иначе	
		КонтактноеЛицо = ПредопределенноеЗначение("Справочник.КонтактныеЛица.ПустаяСсылка");
	КонецЕсли;	
	
	
	Результат = "";
	Если ТипЗнч(КонтактноеЛицо) = Тип("СправочникСсылка.КонтактныеЛица") И Не КонтактноеЛицо.Пустая() Тогда
		Телефон = уб_temp.ДайКонтактнуюИнформациюФизлица(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаРабочий);
		Если ПустаяСтрока(Телефон) Тогда
			Телефон = уб_temp.ДайКонтактнуюИнформациюФизлица(КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаМобильный)
		КонецЕсли;
		Если Не ПустаяСтрока(Телефон) Тогда
			Результат = "Тел. " + Телефон
		КонецЕсли;
	КонецЕсли;	
	Возврат Результат
	
КонецФункции // ПолучитьТелефонКонтактногоЛица()


&НаСервереБезКонтекста
Процедура ОтправитьУведомление(_Причина,_ЦветФона="rgb(255,255,255)",Данные)
	МассивПолучателей = Новый Массив;
	ЭлПочта           = уб_temp.КонтактнаяИнформация(Данные.Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
	Если Не ПустаяСтрока(ЭлПочта) Тогда
		//Сообщить(ЭлПочта);
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			МассивПолучателей.Добавить(ЭлПочта);
		Иначе
			МассивПолучателей.Добавить(ПараметрыСеанса.уб_Константы.АдресДоставкиЛога);
		КонецЕсли;	
		
	КонецЕсли;
	
	//Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
	//	СтруктураРуководителей = уб_temp.РуководительПодразделенияПоАгенту(Менеджер);
	//	Если Не СтруктураРуководителей.Руководитель.Пустая() Тогда
	//		ЭлПочта = уб_temp.КонтактнаяИнформация(СтруктураРуководителей.Руководитель, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
	//		Если Не ПустаяСтрока(ЭлПочта) Тогда
	//			МассивПолучателей.Добавить(ЭлПочта)
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если Не СтруктураРуководителей.Заместитель.Пустая() Тогда
	//		ЭлПочта = уб_temp.КонтактнаяИнформация(СтруктураРуководителей.Заместитель, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Истина);
	//		Если Не ПустаяСтрока(ЭлПочта) Тогда
	//			МассивПолучателей.Добавить(ЭлПочта)
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	
	Если МассивПолучателей.Количество() > 0 Тогда
		ТекстHTML = "<body>Отправитель: <b>"
		+ ПараметрыСеанса.ТекущийПользователь+"</b><br>ЗАЯВКА на выезд: <b>"+Данные.Номер+"</b>"+"<br><br>"
		+"Страхователь: <b>"           + Данные.Страхователь+"</b><br>"
		+"<div style='    background: "+ _цветфона+";   color: #fff;  font-size: 16px; padding:15px; font-weight: 600; border-radius: 8px;'>"
		+ СтрЗаменить(_Причина,Данные.Номер,"")+"</div><br><br>---  Отвечать на адрес 1c@kupipolis.ru не следует, это никто не прочитает</body>";
		
		Параметры     = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		ОбратныйАдрес = уб_temp.КонтактнаяИнформация(ПараметрыСеанса.уб_ТекущееФизЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
		//Сообщить(ОбратныйАдрес);
		Если Не ПустаяСтрока(ОбратныйАдрес) Тогда
			Параметры.ОбратныйАдрес = ОбратныйАдрес;
		КонецЕсли;
		Параметры.Получатели					= МассивПолучателей;
		Параметры.Тема							= _Причина;// +" - сообщение от "+РегистрСведенийМенеджерЗаписи.Отправитель;
		Параметры.ТекстHTML						= ТекстHTML;
		Параметры.ПисатьВЖурналТемуПриОшибке    = Ложь;
		Параметры.ТипСообщенияПриИсключении		= "Предупреждение";
		
		Отправлено = уб_ОбменДанными.SendMail(Параметры);
		
		МЗ = РегистрыСведений.уб_Чат_Сообщения.СоздатьМенеджерЗаписи(); 
		МЗ.Период      = ТекущаяДата();
		Мз.ИмяКанала   = "З-" + Формат(Данные.Номер,"ЧГ=");
		Мз.Отправитель = ПараметрыСеанса.ТекущийПользователь;
		//Если ПараметрыСеанса.уб_ТекущееФизЛицо = Менеджер Тогда
		//	Если ЗначениеЗаполнено(Оператор) Тогда
		//		МЗ.Получатель =  Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Оператор);	
		//	Иначе
		//		МЗ.Получатель =  Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Менеджер);	
		//	КонецЕсли;
		//	
		//Иначе
			МЗ.Получатель  = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",Данные.Менеджер);
		//КонецЕсли;
		Если ЗначениеЗаполнено(МЗ.Получатель) = Ложь Тогда
			//Предупреждение ("Получатель не определен, выберите вручную!");
			возврат
		КонецЕсли;
		МЗ.ИДСообщения = Новый УникальныйИдентификатор;
		Мз.Заголовок   = "Заявка "+Формат(Данные.Номер,"ЧГ=")+", страхователь: "+Данные.Страхователь;
		Мз.Сообщение   = ""+_Причина;
		Попытка
			Мз.Записать();
		Исключение
		КонецПопытки;	

	Иначе
		Сообщить("Электронный адрес получателя не обнаружен, поэтому дополнительно email-сообщение не отправлено");	
	КонецЕсли;	

КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСрокОформления(Парам) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.СрокОформления) КАК СрокОформления
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|ГДЕ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СтаршийОператор = &СтаршийОператор
	|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Утверждено = ИСТИНА
	|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("СтаршийОператор",Парам.Оператор);
	Запрос.УстановитьПараметр("Ссылка",Парам.Ссылка);
	
	МинутНаОформление = 45;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СрокОформления = Дата(1,1,1) или Выборка.СрокОформления = NULL или Выборка.СрокОформления<ТекущаяДата() Тогда
			Возврат ТекущаяДата()+МинутНаОформление*60;
		Иначе	
			
			Возврат Выборка.СрокОформления+МинутНаОформление*60;
		КонецЕсли;	
	Иначе
		Возврат ТекущаяДата()+МинутНаОформление*60;
	КонецЕсли; 
КонецФункции	

&НаСервереБезКонтекста
Функция ЭтоМенеджер()
	Возврат ПараметрыСеанса.уб_ЭтоМенеджер
КонецФункции

&НаСервереБезКонтекста
Функция ПодобратьДатуНачала(Парам)
	
	флНайденаДата = Ложь;
	
	Запрос = Новый Запрос;
	
	ВремяНачало = Парам.ВремяНачало;
	Запрос.УстановитьПараметр("Курьер",Парам.Курьер);
	Пока флНайденаДата = Ложь Цикл
		Запрос.УстановитьПараметр("Дата",ВремяНачало);
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		               |ГДЕ
		               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата = &Дата
		               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер = &Курьер
		               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд = ЛОЖЬ";	
		Выборка = Запрос.Выполнить().Выбрать();		   
		Если Выборка.Следующий() Тогда
			ВремяНачало = ВремяНачало+600;//шаг по 10 минут
		Иначе
			флНайденаДата	= Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ВремяНачало;
КонецФункции

&НаКлиенте
Процедура ТелефонКурьера(Команда)
	ТелефонМенеджера= уб_temp.ДайКонтактнуюИнформациюФизлица(Объект.Курьер, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный"));
	ЭтаФорма.ТекущийЭлемент = Элементы.Курьер;
	Сообщить("Телефон выездного специалиста"+Символы.ПС+ТелефонМенеджера);

КонецПроцедуры




#Область ПроверкаЗаполнения
&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	ОчиститьСообщения();
	
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Тип) Тогда
		Стр = Новый СообщениеПользователю;
		Стр.Текст 	= "Не указан тип выезда!";
		Стр.ПутьКДанным = "Объект.Тип";
		Стр.Сообщить();
		ЕстьОшибки = Истина;
		//дальше продолжать смысла нет, необходимо вначале указать тип		
	Иначе	
		СписокНеТребуемыхПолей = СписокНеТребуемыхДляЗаполненияПолей(Объект.Тип,Объект.ДатаСоздания);
		Если Объект.Менеджер.Пустая() И СписокНеТребуемыхПолей.Найти("Менеджер") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Не указан менеджер!";
			Стр.ПутьКДанным = "Объект.Менеджер";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		КоличествоЧасов = 72;//ПараметрыСеанса.уб_Константы.ИнтервалЧасовЗачистки;
		ДатаСравнения	= ТекущаяДата() - 60 * 60 * КоличествоЧасов;
		//т.е. 
		Если Объект.Дата >= ДатаСравнения Тогда
			//Контакты еще не затерты  - значит  должны быть заполнены
			Если ПустаяСтрока(Объект.Контакты) 
				И СписокНеТребуемыхПолей.Найти("Контакты") = Неопределено 
				И ПустаяСтрока("Адрес")
				Тогда
				Стр = Новый СообщениеПользователю;
				Стр.Текст = "Не указаны контактные данные!";
				Стр.ПутьКДанным = "Объект.Контакты";
				Стр.Сообщить();
				ЕстьОшибки = Истина;
			КонецЕсли;	
		КонецЕсли;
		Если ПустаяСтрока(Объект.Город) И СписокНеТребуемыхПолей.Найти("Город") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст 	= "Не указан город!";
			Стр.ПутьКДанным	= "Объект.Город";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если ПустаяСтрока(Объект.СтанцияМетро) И СписокНеТребуемыхПолей.Найти("СтанцияМетро") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст	= "Не указана станция метро!";
			Стр.ПутьКДанным = "Объект.СтанцияМетро";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		//Если (ДополнительныеСвойства.Свойство("ЕКАСКО") и ДополнительныеСвойства.ЕКАСКО>0)
		//	или (ДополнительныеСвойства.Свойство("ЕОСАГО") и ДополнительныеСвойства.ЕОСАГО>0) Тогда
		//	Если ПустаяСтрока(email) или Найти(email,".")=0 или Найти(email,"@")=0 Тогда
		//		
		//		Стр = Новый СообщениеПользователю;
		//		Стр.Текст	= "Для электронных полисов обязательно заполнение email!";
		//		Стр.ПутьКДанным = "Объект.email;
		//	КонецЕсли;	
		//КонецЕсли;
		
		//Если ((ДополнительныеСвойства.Свойство("ЕКАСКО") и ДополнительныеСвойства.ЕКАСКО>0)
		//	или (ДополнительныеСвойства.Свойство("КАСКО") и ДополнительныеСвойства.КАСКО>0))
		//	 и НеобходимостьОсмотра=Перечисления.НеобходимостьОсмотра.БезОсмотра
		//	 и ПараметрыСеанса.уб_ЭтоМенеджер = Истина Тогда
		//	 	Предупреждение("В заявке есть КАСКО, проверьте необходимость осмотра автомобиля");
		//КонецЕсли;	
		
		Если уб_ВызовСервера.АдресЭлектроннойПочтыСоответствуетТребованиям(Объект.email) = Ложь Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не верный email!";
			Стр.ПутьКДанным = "Объект.email";
			Стр.Сообщить();
			ЕстьОшибки = Истина;

		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.НомерДоговора) И СписокНеТребуемыхПолей.Найти("НомерДоговора") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указан номер договора!";
			Стр.ПутьКДанным = "Объект.НомерДоговора";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СК) И СписокНеТребуемыхПолей.Найти("СК") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указана страховая компания!";
			Стр.ПутьКДанным = "Объект.СК";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если ПустаяСтрока(Объект.ЦельВыезда) И СписокНеТребуемыхПолей.Найти("ЦельВыезда") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указана цель выезда!";
			Стр.ПутьКДанным = "Объект.ЦельВыезда";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерЗаявки) И СписокНеТребуемыхПолей.Найти("НомерЗаявки") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указан номер заявки!";
			Стр.ПутьКДанным = "Объект.НомерЗаявки";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КонтактноеЛицо) И СписокНеТребуемыхПолей.Найти("КонтактноеЛицо") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указано контактное лицо!";
			Стр.ПутьКДанным = "Объект.КонтактноеЛицо";	
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Страхователь) И СписокНеТребуемыхПолей.Найти("Страхователь") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указано ФИО страхователя!";
			Стр.ПутьКДанным = "Объект.Страхователь";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		ИначеЕсли Не уб_ВызовСервера.ПроверкаНаШаблон(Строка(Объект.Страхователь),"(\+?[78])?(([\-\(]*)((9\d\d)|095|495|499)([\-\)]*))((\d(( {0,3})|(\-))){7})") Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "В поле ФИО есть номер телефона. Уберите его!";
			Стр.ПутьКДанным = "Объект.Страхователь";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если ПустаяСтрока(Объект.МестоВстречи) И ПустаяСтрока(Объект.Адрес) И СписокНеТребуемыхПолей.Найти("МестоВстречи") = Неопределено Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст = "Не указаны условия доставки! (заполните место встречи или адрес)";
			Стр.ПутьКДанным = "Объект.Адрес";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
			//ИначеЕсли Не Уб_ВызовСервера.ПроверкаНаШаблон(Строка(Элементы.МестоВстречи.Значение),"(\+?[78])?(([\-\(]*)((9\d\d)|095|495|499)([\-\)]*))((\d(( {0,3})|(\-))){7})") Тогда	
			//	Стр = Новый СообщениеПользователю;
			//	Стр.Текст = "В поле Место встречи есть номер телефона. Уберите его!";
			//	Стр.ПутьКДанным = "Объект.МестоВстречи;
		КонецЕсли;
		//Если Не ПустаяСтрока(email) и (Найти(email,".")=0 или Найти(email,"@")=0) Тогда
		//	Стр = Новый СообщениеПользователю;
		//	Стр.Текст = "Не корректный email!";
		//	Стр.ПутьКДанным = "Объект.Страхователь;
		//КонецЕсли;	
		//УБРАНО 28.05.2018 Сячинов
		//Если НЕ Уб_ВызовСервера.ПроверкаНаШаблон(Строка(Элементы.Комментарий.Значение),"(\+?[78])?(([ \.\-\(]*)(\d{3})([ \.\-\)]*))?((\d[ \.\-]*){7})") Тогда
		//	Стр = Новый СообщениеПользователю;
		//	Стр.Текст = "В поле Комментарий есть номер телефона. Уберите его!";
		//	Стр.ПутьКДанным = "Объект.Комментарий;
		//КонецЕсли;
		//Если ПриоритетЗадачи.Пустая() И СписокНеТребуемыхПолей.Найти("ПриоритетЗадачи") = Неопределено Тогда
		//	Стр = Новый СообщениеПользователю;
		//	Стр.Текст = "Не указан приоритет задачи!";
		//	Стр.ПутьКДанным = "Объект.ПриоритетЗадачи;
		//КонецЕсли;
		//Если ПустаяСтрока(Объект.НомерЗаявкиСК) И СписокНеТребуемыхПолей.Найти("НомерЗаявкиСК") = Неопределено Тогда
		//	ПроверитьЗаполнениеНомерСКОбязателен(Ошибки);
		//КонецЕсли;
		//Если ПризнакСтраховкиКредитная И Банк.Пустая() И СписокНеТребуемыхПолей.Найти("Банк") = Неопределено Тогда
		//	Стр = Новый СообщениеПользователю;
		//	Стр.Текст = "Не указан банк при кредитовании!";
		//	Стр.ПутьКДанным = "Объект.Банк;
		//	Стр.Сообщить();
		//КонецЕсли;
		
		//Если Объект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.уб_ФормыОплаты.ПустаяСсылка") и Объект.Дата > Дата(2016,9,20) Тогда
		//	Стр = Новый СообщениеПользователю;
		//	Стр.Текст = "Не указана форма оплаты";
		//	Стр.ПутьКДанным = "Объект.ВидОплаты";//"Объект.ФормаОплаты";
		//	Стр.Сообщить();
		//	ЕстьОшибки = Истина;
		//КонецЕсли;
		
		Если Объект.Дата > Дата(2016,8,1) Тогда
		Иначе
			
			//Если НЕ Самовыезд И ИсточникФинансирования <> Перечисления.уб_ИсточникиФинансирования.Курьер И СписокНеТребуемыхПолей.Найти("ВознаграждениеКурьера") = Неопределено Тогда
			//	Если ВознаграждениеКурьера = 0 Тогда
			//		Стр = Новый СообщениеПользователю;
			//		Стр.Текст = "Не заполнено значение вознаграждения курьера!";
			//		Стр.ПутьКДанным = "Объект.ВознаграждениеКурьера;
			//	ИначеЕсли ВознаграждениеКурьера < ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера Тогда
			//		Стр = Новый СообщениеПользователю;
			//		Стр.Текст = "Сумма вознаграждения курьера ниже допустимого минимума (" + ПоказателиРасчетаЗП.МинСтоимостьВыездаКурьера + ")!";
			//		Стр.ПутьКДанным = "Объект.ВознаграждениеКурьера;                
			//	КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
		Если Объект.Курьер.Пустая() И Не Объект.Самовыезд И Не Объект.ТребуетсяПроверкаРуководителем Тогда
			Стр = Новый СообщениеПользователю;
			Стр.Текст	= "Не выбран курьер!";
			Стр.ПутьКДанным = "Объект.Курьер";
			Стр.Сообщить();
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Объект.Дата >= Дата(2016,11,25)  Тогда
			Если ЗначениеЗаполнено(Объект.НеобходимостьОсмотра) = Ложь Тогда
				Стр = Новый СообщениеПользователю;
				Стр.Текст	= "Укажите необходимость осмотра";
				Стр.ПутьКДанным = "Объект.НеобходимостьОсмотра";
				Стр.Сообщить();
				ЕстьОшибки = Истина;
			КонецЕсли;	
			
		КонецЕсли;
		Если Объект.Дата >= Дата(2017,10,12)
			И Объект.Тип <> ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Административный") 
			И Объект.Тип <> ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.Пролонгация")
			И Объект.Тип <> ПредопределенноеЗначение("Перечисление.уб_ТипВыезда.ОчереднойВзнос") 
			И Не (Объект.НомерЗаявки = ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Личная") или Объект.НомерЗаявки = ПредопределенноеЗначение("Перечисление.уб_ВидыЗаявок.Агентская"))  Тогда
			Если ЗначениеЗаполнено(Объект.Источник) = Ложь Тогда
				Стр = Новый СообщениеПользователю;
				Стр.Текст	= "Укажите источник заявки";
				Стр.ПутьКДанным = "Объект.Источник";
				Стр.Сообщить();
				ЕстьОшибки = Истина;
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;		
	Возврат ЕстьОшибки = ЛОЖЬ;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьЗаполнениеНомерСКОбязателен(ТЗОшибки)

	//Если ПустаяСтрока(НомерЗаявкиСК) Тогда
	//	МассивВидовБСО = БСО.ВыгрузитьКолонку("ВидБСО");
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	ВБ.Наименование
	//	|ИЗ
	//	|	Справочник.уб_ВидыБСО КАК ВБ
	//	|ГДЕ
	//	|	ВБ.Ссылка В(&МассивВидовБСО)
	//	|	И ВБ.НомерСКОбязателен");
	//	Запрос.УстановитьПараметр("МассивВидовБСО", МассивВидовБСО);
	//	Результат = Запрос.Выполнить();
	//	Если Не Результат.Пустой() Тогда
	//		стрСписок = "";
	//		Выборка = Результат.Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			стрСписок = стрСписок + "'" + Выборка.Наименование + "', "
	//		КонецЦикла;
	//		стрСписок = Лев(стрСписок, СтрДлина(стрСписок) - 2);
	//		Стр = ТЗОшибки.Добавить();
	//		Стр.Текст = "Для " + стрСписок + " требуется обязательное заполнение номера заявки СК!";
	//		Стр.ПутьКДанным = "Объект.НомерЗаявкиСК;
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСообщениеОбОшибкахОбщая(Ошибки, Форма = Неопределено) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.уб_СообщениеОбОшибкахУпр",Новый Структура("Ошибки",Ошибки),ЭтаФорма);
	
	//ОбФорма = ПолучитьОбщуюФорму("уб_СообщениеОбОшибках", Форма);
	//ОбФорма.ТаблицаОшибок = Тз.Скопировать();
	//Если ОбФорма.Открыта() Тогда
	//	ОбФорма.Активизировать();
	//Иначе
	//	ОбФорма.Открыть();
	//КонецЕсли;
	
КонецПроцедуры // ОткрытьСообщениеОбОшибках()

&НаКлиенте
Процедура emailПриИзменении(Элемент)
	Если уб_ВызовСервера.АдресЭлектроннойПочтыСоответствуетТребованиям(Объект.email) = Ложь Тогда
		ПоказатьОповещениеПользователя("email  не корректен");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЧек(Команда)
	Записать();
	ТекущиеДанные = Элементы.БСОДерево.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		УидСтроки = ТекущиеДанные.УидСтроки;
		уб_Клиент.ДиалогДобавленияФайла(Объект.Ссылка,ЭтаФорма.УникальныйИдентификатор,Новый Структура("УидСтроки,ВидДокумента",УидСтроки,Уб_ВызовСервера.ВидДокумента(74)));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписокФайлов" и Параметр = Объект.Ссылка Тогда
		ОбновитьОбъектИзСсылки();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТипПолисаПроодленияПриИзменении(Элемент)
	Если ТипПолисаПроодления = "Ссылка в базе" Тогда
		//Элементы.НомерДоговора.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уб_СтраховойПолис");
		Объект.НомерДоговора = ПредопределенноеЗначение("Документ.уб_СтраховойПолис.ПустаяСсылка");
	Иначе	
		//Элементы.НомерДоговора.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Объект.НомерДоговора = "";
		НомерДоговораНачалоВыбора(Элемент, Неопределено, ЛОЖЬ);
	КонецЕсли;
	//Элементы.НомерДоговора.ОбновитьТекстРедактирования();
		
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(Объект.НомерДоговора) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ПриВводеНомераДоговора",ЭтаФорма,Новый Структура),Объект.НомерДоговора,"Введите номер прошлого полиса",,ЛОЖЬ);
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура ПриВводеНомераДоговора(Значение,ДопПараметры) Экспорт
	Если Не Значение = Неопределено Тогда
		Объект.НомерДоговора = Значение;
	КонецЕсли;	
КонецПроцедуры



#КонецОбласти

&НаСервереБезКонтекста
Функция Наименование(Страхователь)
	Если ТипЗнч(Страхователь) = Тип("Строка") или ТипЗнч(Страхователь) = Тип("Неопределено") Тогда
		Возврат Строка(Страхователь);
	Иначе
		Возврат Страхователь.Наименование;
	КонецЕсли;	
КонецФункции	


#КонецОбласти