Процедура УстановитьНовыйНомерОтчетаПоставщику(ОтчетПоставщику) Экспорт 
	
	Поставщик = ОтчетПоставщику.Поставщик;
	Если Поставщик.Пустая() Тогда
		Возврат;	
	КонецЕсли;		
	//Номер для Росгосстрах-Столица
	//Если ОтчетПоставщику.Поставщик = Справочники.Контрагенты.НайтиПоКоду("000000026") Тогда
	Шаблон = СокрЛП(Поставщик.ШаблонНомераОтчетаПоставщику);
	УстановитьТиповойНомер = Истина;
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ОргАгент_ИНН = ОтчетПоставщику.ОрганизацияАгент.ИНН;
		СуффиксВидаСП = ?(ОтчетПоставщику.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО или ОтчетПоставщику.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО, "2",?(ОтчетПоставщику.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или ОтчетПоставщику.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО, "1",""));
		ДатаОтчетаПоставщику = ОтчетПоставщику.Дата;
		Попытка
			ОтчетПоставщику.НомерОтчетаПоставщику = Вычислить(Шаблон);
			УстановитьТиповойНомер = Ложь;
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_ЧастностиСК.УстановитьНовыйНомерОтчетаПоставщику(): ошибка вычисления шаблона: " + Шаблон, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
		КонецПопытки;
	КонецЕсли;
	Если УстановитьТиповойНомер Тогда
		//ТИПОВОЙ НОМЕР
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Т.Поставщик) КАК Кол
		|ИЗ
		|	Документ.уб_ОтчетПоставщику КАК Т
		|ГДЕ
		|	Т.Поставщик = &Поставщик
		|	И Т.НачалоОтчетногоПериода >= &НачалоТекГода
		|	И Т.НачалоОтчетногоПериода <= &КонецТекГода
		|	И Т.Ссылка <> &ОтчетПоставщику";		
		Запрос.УстановитьПараметр("Поставщик", 			ОтчетПоставщику.Поставщик);
		Запрос.УстановитьПараметр("НачалоТекГода", 		НачалоГода(ТекущаяДата()));
		Запрос.УстановитьПараметр("КонецТекГода", 		КонецГода(ТекущаяДата()));
		Запрос.УстановитьПараметр("ОтчетПоставщику", 	ОтчетПоставщику.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ОтчетПоставщику.НомерОтчетаПоставщику = Формат(Выборка.Кол + 1, "ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
