
Процедура ДвижениеСтатусовЗаявок(Ссылка) Экспорт

	//2020 Отключил
	//ТЗТребуетсяВозвратБСО = уб_УСЗ.ТребуетсяВозвратБСОПоСсылке(Ссылка);
	//ТЗТребуетсяВозвратБСО.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	П.ЗаявкаКуда КАК ЗаявкаКуда,
	//|	МИНИМУМ(П.Ссылка.Проведен) КАК Проведен,
	//|	МАКСИМУМ(П.Подтверждено) КАК Подтверждено
	//|ПОМЕСТИТЬ ВТ_Перемещений
	//|ИЗ
	//|	Документ.уб_ПеремещениеБСО.БСО КАК П
	//|ГДЕ
	//|	П.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	П.ЗаявкаКуда
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СЗ.Статус КАК Статус,
	//|	СЗ.Заявка КАК Заявка,
	//|	СЗ.Заявка.Номер КАК ЗаявкаНомер,
	//|	ВЫБОР
	//|		КОГДА ВТ_Перемещений.Проведен
	//|				И ВТ_Перемещений.Подтверждено
	//|               И СЗ.Статус в(ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектДокументацииПодготовлен),ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.НазначениеКурьера))
	//|			ТОГДА ""УстановитьСтатус_БСОНаРукахУКурьера""
	//|           ИНАЧЕ """"
	////|		//ИНАЧЕ ""УстановитьСтатус_ФормированиеКомплектаБСО""
	////|       ИНАЧЕ ""УстановитьСтатус_КомплектДокументацииПодготовлен""
	////|		ИНАЧЕ ""УстановитьСтатус_ЗаявкаВПечати""
	//|	КОНЕЦ КАК УстСтатус
	//|ИЗ
	//|	ВТ_Перемещений КАК ВТ_Перемещений
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	//|		ПО ВТ_Перемещений.ЗаявкаКуда = СЗ.Заявка
	//|ГДЕ
	//|	СЗ.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ФормированиеКомплектаБСО), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗаявкаВПечати),ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.КомплектДокументацииПодготовлен), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.БСОНаРукахУКурьера))");
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Роль = уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
	//СписокОбработанныхЗаявок = Новый СписокЗначений;
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.УстСтатус <> "" Тогда
	//		СтрокаТЗ = ТЗТребуетсяВозвратБСО.Найти(Выборка.Заявка, "Заявка");
	//		Если СтрокаТЗ = Неопределено Тогда
	//			//не должно происходить
	//			ТребуетсяВозвратБСО = Неопределено;
	//		Иначе
	//			ТребуетсяВозвратБСО = СтрокаТЗ.ТребуетсяВозвратБСО;
	//			СтрокаТЗ.Обработано = Истина;
	//		КонецЕсли;
	//		Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
	//			Выборка.Заявка,         
	//			Выборка.Статус,         
	//			Выборка.УстСтатус,      
	//			,
	//			Роль,                   
	//			,
	//			ТребуетсяВозвратБСО
	//			) 
	//			Тогда
	//			СписокОбработанныхЗаявок.Добавить(Выборка.ЗаявкаНомер);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////проверяем оставшиеся заявки
	//МассивСтрокТЗ = ТЗТребуетсяВозвратБСО.НайтиСтроки(Новый Структура("Обработано", Ложь));
	//Для Каждого СтрокаТЗ Из МассивСтрокТЗ Цикл
	//	Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
	//		СтрокаТЗ.Заявка,
	//		,
	//		"ПроверитьБСО",
	//		,
	//		Роль,
	//		,
	//		СтрокаТЗ.ТребуетсяВозвратБСО
	//		) 
	//		Тогда
	//		СписокОбработанныхЗаявок.Добавить(СтрокаТЗ.Заявка);
	//	КонецЕсли;
	//КонецЦикла;
	//#Если Клиент Тогда
	//	Если СписокОбработанныхЗаявок.Количество() > 0 Тогда
	//		Оповестить("уб_СтатусыЗаявокОбновитьСписки", СписокОбработанныхЗаявок, "Документ.уб_ПеремещениеБСО")
	//	КонецЕсли;
	//#КонецЕсли

КонецПроцедуры


