Перем ТекСостояниеБСО;
Перем ТекВладелецБСО;
Перем ТекПодразделение;
Перем СписокСостоянийБСО;
//Перем ВводНаОсновании Экспорт;
Перем мРежимЗаписи Экспорт;
//изза отсутствия отказа в обработке заполнения, в форме ПередОткрытием устанавливается Отказ на основании ЗакрытьФорму
Перем ЗакрытьФорму Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПЕЧАТИ ДОКУМЕНТА

Функция ПреобразоватьВЧисло(Стр)
	
	Возврат ?(Стр = "", 0, Число(Стр))
	
КонецФункции

Процедура ПолучитьПодписиДляСтороны(оАгент,НаДату,ППФИО,ППДляШапки,ППДляПодписи) Экспорт 
	#Если ВебКлиент Тогда
		
	#Иначе	
	
	//TODO оптимизировать!!!
	//Если подразделение - головной офис, то печатаем - от ООО ... в лице агента/сотрудника
	//	Иначе Если Агент - сотрудник, то "Субагент ООО КупиПолис ФИО"
	//	А Если Агент - Контрагент, то "Субагент ФИО "		
	Если Не ЗначениеЗаполнено(оАгент) Тогда
		ППФИО 			= "";
		ППДляШапки 		= "Субагент " + ППФИО;
		ППДляПодписи 	= "Субагент:";
		Возврат;	
	КонецЕсли;	
	Если ТипЗнч(оАгент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Если оАгент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			// Контрагент - ЮрЛицо
			ППОрганизация = оАгент.НаименованиеПолное;
			Если Не ЗначениеЗаполнено(оАгент.ОсновноеКонтактноеЛицо) Тогда
				ППФИО = "";
				ППДляШапки = ППОрганизация;
			Иначе	
				ППФИО = оАгент.ОсновноеКонтактноеЛицо.Наименование;
				ППДляШапки = ППОрганизация + (?(ППОрганизация = "","",", ")) + ППФИО;
			КонецЕсли;
			ППДляПодписи = ППОрганизация + (?(ППОрганизация = "","",": "));
		Иначе
			//Контрагент - Физлицо
			ППФИО = оАгент.Наименование;
			ППДляШапки = "Субагент " + ППФИО;
			ППДляПодписи = "Субагент: ";
		КонецЕсли;
	ИначеЕсли ТипЗнч(оАгент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ППФИО = уб_СС.ПрочитатьФИОФизЛица(оАгент);
		оПодразделение = уб_СС.ПолучитьПодразделениеАгента(оАгент, НаДату, Истина);
		Если оПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			ППОрганизация 	= оПодразделение.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов;
			ППДляШапки 		= ППОрганизация + (?(ППОрганизация = "", "", ", "))+ ППФИО;
			ППДляПодписи 	= ППОрганизация + (?(ППОрганизация = "", "", ": "));
		Иначе
			ППДляШапки = "Субагент " + ППФИО;
			ППДляПодписи = "Субагент: ";
		КонецЕсли;
	ИначеЕсли ТипЗнч(оАгент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		оПодразделение = оАгент;
		ППОрганизация = оПодразделение.Владелец.НаименованиеДляДоговоровИПлатежныхДокументов;
		ПППодразделение = оПодразделение.Наименование;
		ППДляШапки = ППОрганизация + ", подразделение """ + ПППодразделение + """";
		ППДляПодписи = "От " + ПППодразделение + " " + ППОрганизация;
		Если оПодразделение = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО Тогда
			ППФИО = уб_СС.ПрочитатьФИОФизЛица(оПодразделение.МОЛпоБСО);
		Иначе
			ППФИО = "/___________________________/";
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПеремещениеРазрешено(Владелец, ПодрПередающего, ПодрПринимающего, послРегистратор, послАгентОтправитель, ПодрВладельца=Неопределено) Экспорт
	
	Если Агент = Владелец Тогда
		Возврат Истина;	
	КонецЕсли;	
	Если ПодрВладельца = Неопределено Тогда
		ПодрВладельца = уб_СС.ПолучитьПодразделениеАгента(Владелец, Дата);
	КонецЕсли;
	Если Агент = ПодрВладельца Тогда
		//БСО передается от лица подразделения, в которое входит агент-владелец 
		Возврат Истина;	
	КонецЕсли;
	Если (ПодрВладельца = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО И ПодрПередающего = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО) Тогда
		//Владелец В ОУБСО и Передающий в ОУБСО. 
		//Т.е. выдача от лица ОУБСО и при этом бланк числится на сотруднике ОУБСО 
		//или выдача от лица сотрудника ОУБСО и при этом бланк числится на ОУБСО 
		Возврат Истина;	
	КонецЕсли;
	тзнРег = ТипЗнч(послРегистратор);
	Полис_ИЛИ_ПриемкаОплат = (Тип("ДокументСсылка.уб_СтраховойПолис") = тзнРег) ИЛИ (Тип("ДокументСсылка.уб_ПриемкаОплат") = тзнРег);
	Владелец_В_ОУБСО_и_Принимающий_в_ОУБСО = (ПодрВладельца = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО И ПодрПринимающего = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
	Если Владелец_В_ОУБСО_и_Принимающий_в_ОУБСО И Полис_ИЛИ_ПриемкаОплат Тогда
		//После проведения из полиса или приемки оплат БСО числится на ОУБСО (Владелец = ОУБСО)
		//Если после оформления полиса мы формируем акт передачи (оформленного) БСО с агента на ОУБСО или сотрудника ОУБСО,
		// то такое перемещение - допустимо
		Возврат Истина;	
	КонецЕсли;	
	ОтправительСовпадает = (послАгентОтправитель = Агент);
	Если ОтправительСовпадает И Полис_ИЛИ_ПриемкаОплат Тогда
		//Аналогично предыдущему случаю, при проведении полиса или приемки оплат отправителем является некий агент
		//(а БСО поступает в ОУБСО)
		//Если после оформления полиса мы формируем акт передачи с того же агента, 
		// то такое перемещение - допустимо
		Возврат Истина;	
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)
	
	СтруктураОбязательныхПолей = Новый Структура("СК, ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);
	Для Каждого СтрокаТЧ Из БСО Цикл
		Если уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда
			Если СтрокаТЧ.Подтверждено И (ЗначениеНеЗаполнено(СтрокаТЧ.Поставщик) ИЛИ ЗначениеНеЗаполнено(СтрокаТЧ.ОрганизацияАгент)) Тогда
				Отказ = Проведен; 
				Сообщить("Для БСО количественного учета необходимо указать Поставщика и Организацию-Агента. Номер строки: " + СтрокаТЧ.НомерСтроки + ", СК: " + Строка(СтрокаТЧ.СК) + ", Вид БСО: " + Строка(СтрокаТЧ.ВидБСО) + ".");	
			КонецЕсли;
		ИначеЕсли уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО) Тогда
			//пока нет проверок	
		Иначе
			//пока нет проверок	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры


Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	//СтруктураПараметров.Вставить("АгентВТЧДокумента", Ложь);
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Агент", АгентКуда);
	СтруктураПараметров.Вставить("АгентОтправитель", Агент);
	//СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.ПеремещениеБСО);
	//СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	//СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", Ложь);
	СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Истина);
	//СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", Неопределено);
	//СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Поставщик", Неопределено);
	//СтруктураПараметров.Вставить("ОрганизацияАгент", Неопределено);
	//#Если Клиент Тогда
	//	СтруктураПараметров.Вставить("ОсновнаяОрганизация", ОсновнаяОрганизация);
	//#Иначе	
	//	СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//#КонецЕсли
	
	ПодразделениеОт = уб_СС.ПолучитьПодразделениеАгента(Агент, Дата, Истина);
	ПодразделениеКуда = уб_СС.ПолучитьПодразделениеАгента(АгентКуда, Дата, Истина);
	//
	СтруктураПараметров.Вставить("ПодразделениеОт", ПодразделениеОт);
	СтруктураПараметров.Вставить("ПодразделениеКуда", ПодразделениеКуда);
	
	пПлжБСО = Перечисления.уб_ПоложенияБСО;
	
	УстановитьЗначение(Направление, ВернутьНаправление());
	// Вычисляем новое положение БСО
	ТипКуда = ПодразделениеКуда.ТипПодразделения;
	ТипОт = ПодразделениеОт.ТипПодразделения;
	ГоловнойОфис = Перечисления.уб_ТипПодразделения.ГоловнойОфис;
	Если ТипКуда = ГоловнойОфис
		и ТипОт = ГоловнойОфис Тогда
		//нПоложениеБСО = Неопределено;
		нПоложениеБСО = пПлжБСО.ПустаяСсылка();
	ИначеЕсли ТипКуда = ГоловнойОфис
		и ТипОт <> ГоловнойОфис Тогда
		нПоложениеБСО = пПлжБСО.ВозвращенСТочки;
	Иначе
		нПоложениеБСО = пПлжБСО.ПереданНаТочку;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", нПоложениеБСО);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
	СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО", "СостояниеБСО");
	
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Агент, АгентКуда");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	Если Не Отказ Тогда
		//Убрано 20160823 - пусть правят руками в заявке кто поехал
		//чкн
		//КурьерЗаявки = Неопределено;
		//КурьерПеремещения = Неопределено;
		//Если ТипЗнч(СозданНаОсновании) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда 
		//КурьерЗаявки = СозданНаОсновании.Курьер;
		//КонецЕсли;
		//Если ТипЗнч(АгентКуда) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
		//	КурьерПеремещения = АгентКуда;
		//КонецЕсли;
		//Если НЕ (КурьерЗаявки = Неопределено И КурьерПеремещения = Неопределено) И КурьерЗаявки <> КурьерПеремещения 
		//	И КурьерЗаявки = Справочники.ФизическиеЛица.ПустойАгент Тогда 
		//	Попытка
		//		
		//	
		//	мЗаявка = СозданНаОсновании.ПолучитьОбъект();
		//	мЗаявка.ОбменДанными.Загрузка = ИСТИНА;
		//	мЗаявка.Курьер = КурьерПеремещения;
		//	Параметры = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		//	Параметры.ВключаяВыбывших		= Истина;
		//	Параметры.ТолькоТочкиПродаж		= Истина;
		//	Массив = Новый СписокЗначений;
		//	Массив.Добавить(мЗаявка.Менеджер);
		//	Массив.Добавить(мЗаявка.Курьер);
		//	Параметры.СотрудникиПоДокументу = Массив;
		//	уб_СС.ПодчиненныеРуководителя(мЗаявка.Менеджер,, Параметры);
		//	ПараметрыСотрудника = Параметры;
		//	мЗаявка.РасчетВознагражденияКурьера(ПараметрыСотрудника);
		//	мЗаявка.Записать();
		//	мЗаявка.ОбменДанными.Загрузка = ЛОЖЬ;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		////чкн
		ДвиженияПоРегистрам(Отказ, Заголовок);
		Документы.уб_ПеремещениеБСО.ДвижениеСтатусовЗаявок(Ссылка)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначение(Направление, ВернутьНаправление());
	мРежимЗаписи = РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ОбновитьПоставщикаИОргАгента") 
		И ДополнительныеСвойства.ОбновитьПоставщикаИОргАгента  = ИСТИНА Тогда
		ОбновитьДанныеПоПоставщикуОргАгенту();
	КонецЕсли;	
	Если Не Отказ Тогда 
		СинхронизацияБСОСЗаявкой();
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьДанныеПоПоставщикуОргАгенту() Экспорт
//Обновление данных по поставщику в строке: неэффективно перед каждой записью это делать, как вариант вынести в контекст в нутри документа
	Для Каждого СтрокаТЧ Из БСО Цикл
		ЗаписьРег = Неопределено;
		//ИнфоЗапись = НЕ (СтрокаТЧ.Подтверждено И РежимЗаписи = РежимЗаписиДокумента.Проведение);
		Если "" <> СокрЛП(СтрокаТЧ.НомерБСО) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ //ПЕРВЫЕ 1
			|	*
			|ИЗ
			|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
			|			&Период,
			|			ВидБСО = &ВидБСО
			|				И НомерБСО = &НомерБСО
			//|				И СК = &СК
			|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			Запрос.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
			Запрос.УстановитьПараметр("НомерБСО", СтрокаТЧ.НомерБСО);
			Запрос.УстановитьПараметр("СК", СтрокаТЧ.СК);
			Запрос.УстановитьПараметр("Период", МоментВремени());
			
			//Если НЕ ИнфоЗапись Тогда
			//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Подтверждено");
			//КонецЕсли;
			
			тзРег = Запрос.Выполнить().Выгрузить();
			
			ВсегоСтрок = тзРег.Количество();
			Если  ВсегоСтрок > 0 Тогда
				ЗаписьРег = тзРег[0];
				//Если ВсегоСтрок > 1 Тогда
				//	тзРег.СОртировать("Период УБЫВ"); //если предыдущий не страховой полис, то "самое последнее наиболее верное"
				//	ЗаписьРег = тзРег[0];
				//КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		ЕстьИнфоОБСО = ЗаписьРег <> Неопределено;
		Если ЕстьИнфоОБСО Тогда
			хПоставщик			= ЗаписьРег.Поставщик;
			хОрганизацияАгент	= ЗаписьРег.ОрганизацияАгент;
		Иначе
			//Случай записи перемещения не внесенных в систему БСО, либо с ошибочными данными
			хПоставщик = ?(ЗначениеНеЗаполнено(СтрокаТЧ.Поставщик), СтрокаТЧ.СК, СтрокаТЧ.Поставщик);
			#Если Клиент Тогда
				хОрганизацияАгент 	= ?(ЗначениеНеЗаполнено(СтрокаТЧ.ОрганизацияАгент), ОсновнаяОрганизация, СтрокаТЧ.ОрганизацияАгент);
			#Иначе	
				хОрганизацияАгент = СтрокаТЧ.ОрганизацияАгент;
			#КонецЕсли	
		КонецЕсли;
		Если СтрокаТЧ.Поставщик <> хПоставщик Тогда
			СтрокаТЧ.Поставщик = хПоставщик;
		КонецЕсли;
		Если СтрокаТЧ.ОрганизацияАгент <> хОрганизацияАгент Тогда
			СтрокаТЧ.ОрганизацияАгент = хОрганизацияАгент;
		КонецЕсли;
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли	
	КонецЦикла;	
КонецПроцедуры	

Функция ВернутьНаправление() Экспорт
	
	ПодразделениеОт = уб_СС.ПолучитьПодразделениеАгента(Агент, Дата, Истина);
	ПодразделениеКуда = уб_СС.ПолучитьПодразделениеАгента(АгентКуда, Дата, Истина);	
	ТипОт   = ПодразделениеОт.ТипПодразделения;
	ТипКуда = ПодразделениеКуда.ТипПодразделения;
	
	ТП = Новый Массив;
	ТП.Добавить(Перечисления.уб_ТипПодразделения.ТочкаПродаж);
	ТП.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВС);
	ТП.Добавить(Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя);
	
	ОУБСО = Перечисления.уб_ТипПодразделения.ГоловнойОфис;
	_Направление = 0;
	// Вычисляем новое положение БСО	
	Если ТП.Найти(ТипКуда)<>Неопределено и ТипОт = ОУБСО Тогда
		_Направление = 1;
	ИначеЕсли ПодразделениеОт = ПодразделениеКуда Тогда
		_Направление = 0;
	ИначеЕсли ТипКуда = ОУБСО и ТипОт  = ОУБСО Тогда
		_Направление = 0;
	ИначеЕсли ТП.Найти(ТипКуда)<>Неопределено и ТП.Найти(ТипОт)<>Неопределено Тогда
		_Направление = 0;	
	ИначеЕсли ТипКуда = ОУБСО Тогда
		_Направление = -1;
	ИначеЕсли ТП.Найти(ТипКуда)<>Неопределено Тогда
		_Направление = 1;
	Иначе
		_Направление = 0;
	КонецЕсли;
	Возврат _Направление;
	
КонецФункции	

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	#Если Клиент Тогда
		Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
			ОчиститьСообщения();
		КонецЕсли;
	#КонецЕсли
	Заголовок = "Запись документа """ + СокрЛП(Ссылка) + """: ";
	Если Не Проведен Тогда
		ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	КонецЕсли;	
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	Если Отказ и мРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Отказ = Ложь;
		//Возврат;
	КонецЕсли;		
	// Вариант, если не хотим, что бы в регистре были помеченные на удаление
	//Если Не Отказ И Не Проведен И НЕ Ссылка.ПометкаУдаления Тогда
	//	ДвиженияПоРегистрам(Отказ, Заголовок);
	//ИначеЕсли Не Проведен И Ссылка.ПометкаУдаления Тогда	
	//	Движения.уб_ДвиженияБСО.Очистить();
	//	Движения.уб_ДвиженияБСО.Записать();
	//КонецЕсли;	
	//Проверка статуса
	//необходимость возврата теперь проходит в модуле менеджера ДвижениеСтатусовЗаявок
	//Если Не Направление = 0 Тогда
	//	уб_УСЗ.ПроверитьНеобходимостьВозвратаПоСвязаннымЗаявкам(Ссылка);
	//КонецЕсли;
	Если Не Отказ И Не Проведен Тогда 
		Документы.уб_ПеремещениеБСО.ДвижениеСтатусовЗаявок(Ссылка)
	КонецЕсли;
	
		
	
КонецПроцедуры

Процедура СинхронизацияБСОСЗаявкой()
	
	//
	Возврат;
	
	Если ЗначениеЗаполнено(СозданНаОсновании) и ТипЗнч(СозданНаОсновании) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
	Иначе
		Возврат;
	КонецЕсли;	
	ОбЗаявки = СозданНаОсновании.ПолучитьОбъект();
	БСОЗаявки = ОбЗаявки.БСО;
	ФлЕстьПравки = Ложь;
	Для каждого СтрокаБСО из БСо Цикл
		Если СтрокаБСО.Подтверждено = Ложь Тогда
			Продолжить;
		КонецЕсли;	
		Если Не ПустаяСтрока(СтрокаБСо.НомерБСО) Тогда
			
			нСтроки = БСОЗаявки.НайтиСтроки(Новый Структура("ВидБСО",СтрокаБСО.ВидБСО));
			
			Найдено = Ложь;;
			
			Для каждого СтрокаВЗаявке из нСтроки Цикл
				
				Если СтрокаБСо.НомерБСО = СтрокаВЗаявке.НомерБСО Тогда
					Найдено = Истина;
					Прервать;
				ИначеЕсли Прав(СтрокаБСо.НомерБСО,8) = Прав(СтрокаВЗаявке.НомерБСО,8) Тогда
					СтрокаБСО.НомерБСО = СтрокаВЗаявке.НомерБСО;
				КонецЕсли;
				
			КонецЦикла;	
			
			Если Найдено = Ложь Тогда
				Для каждого СтрокаВЗаявке из нСтроки Цикл
					Если ПустаяСтрока(СтрокаВЗаявке.НомерБСО) Тогда
						СтрокаВЗаявке.НомерБСО = СтрокаБСо.НомерБСО;
						СтрокаВЗаявке.ДатаДвиженияБСО = Дата-1;
						Если СтрокаВЗаявке.Состояние   = Перечисления.уб_СостояниеОформления.ПолисЗаведен
							//и (СтрокаБСо.ВидБСО.Тип = Перечисления.уб_ТипыБСО.Полис
							//или СтрокаБСо.ВидБСО.Тип = Перечисления.уб_ТипыБСО.ПолисОСАГО)
							Тогда
							СтрокаВЗаявке.Состояние = Перечисления.уб_СостояниеОформления.ВыпускМаски;
						КонецЕсли;	
						ФлЕстьПравки = Истина;
						Найдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Найдено = Ложь //и НЕ СтрокаБСо.ВидБСО.Тип = Перечисления.уб_ТипыБСО.КвитанцияА7 
				Тогда
				Сообщить("Не найдена строка для номера "+ СтрокаБСо.НомерБСО+" в заявке");
			КонецЕсли;	
			
			
		КонецЕсли;	
		
	КонецЦикла;	
	Если ФлЕстьПравки Тогда
		ОбЗаявки.Записать(?(ОбЗаявки.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	ТипЗнч = ТипЗнч(Основание);
	Если ТипЗнч  = Тип("Структура") И Основание.Свойство("Документ") Тогда
		ЗаполнятьШапку = Неопределено;
		Основание.Свойство("ЗаполнятьШапку", ЗаполнятьШапку);
		Если ЗаполнятьШапку = Неопределено Тогда
			ЗаполнятьШапку = Истина;
		КонецЕсли;	
		ПроверятьНаличиеБСО = Неопределено;
		Основание.Свойство("ПроверятьНаличиеБСО", ПроверятьНаличиеБСО);
		Если ПроверятьНаличиеБСО = Неопределено Тогда
			ПроверятьНаличиеБСО = Истина;
		КонецЕсли;	
		Документ = Основание.Документ;
		Если типЗнч(Документ) = Тип("Массив") Тогда
			ВсегоДокументов = Документ.Количество();
			Для СчетчикДокументов = 0 по ВсегоДокументов - 1  Цикл
				СоздатьНаОсновании(Документ[СчетчикДокументов], ТипЗнч, Основание.Проверять, ?(СчетчикДокументов=ВсегоДокументов-1,ЗаполнятьШапку,Ложь), ПроверятьНаличиеБСО);
			КонецЦикла;	
		Иначе	
			СоздатьНаОсновании(Документ, ТипЗнч, Основание.Проверять, ЗаполнятьШапку, ПроверятьНаличиеБСО);
		КонецЕсли;	
	Иначе
		СоздатьНаОсновании(Основание,ТипЗнч)
	Конецесли;	
	
КонецПроцедуры

Процедура СоздатьНаОсновании(Основание, ТипЗнч, Проверять = Истина, ЗаполнятьШапку = Истина, ПроверятьНаличиеБСО = Ложь)
	
 	Если ТипЗнч(Основание) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста") Тогда
		//проверка на модифицированность формы заявки на ВС
		#Если Клиент Тогда
			Если Основание.ПолучитьФорму().Модифицированность Тогда
				Ответ = Вопрос("Заявка на заказ выездного специалиста была изменена! Записать документ и открыть перемещение БСО?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Основание.ПолучитьФорму().Записать()
				Иначе
					ЗакрытьФорму = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
	    Если Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТребуетсяПроверка(Основание) Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Заявка не проверена руководителем/андеррайтером! Невозможно создать перемещение.", "Предупреждение");
			ЗакрытьФорму = Истина;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		Если ЗаполнятьШапку Тогда 
			СозданНаОсновании = Основание;
			Дата = ТекущаяДата();
			Если Проверять Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	уб_ПеремещениеБСО.Ссылка,
				|	уб_ПеремещениеБСО.Проведен,
				|	уб_ПеремещениеБСО.Номер,уб_ПеремещениеБСО.Дата
				|ИЗ
				|	Документ.уб_ПеремещениеБСО КАК уб_ПеремещениеБСО
				|ГДЕ
				|	уб_ПеремещениеБСО.СозданНаОсновании = &СозданНаОсновании");
				Запрос.УстановитьПараметр("СозданНаОсновании",СозданНаОсновании);
				Выборка = Запрос.Выполнить().Выбрать();
				Список = Новый СписокЗначений;
				Пока Выборка.Следующий() Цикл
					Список.Добавить(Выборка.Ссылка,"Открыть ""Перемещение БСО № "+Выборка.Номер+" от "+Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")+?(Выборка.Проведен," (Проведен)"," (Не проведен)")+"""");
				КонецЦикла;	
				Если Список.Количество() > 0 Тогда
					//В 8.1 не отказа.
					//Ответ = Вопрос("Уже есть перемещения на основании данной заявки!!!"+Символы.ПС+"Все равно создать документ?",РежимДиалогаВопрос.ДаНет);
					#Если Клиент Тогда
						Ответ = Вопрос("Уже есть перемещения на основании данной заявки !"+Символы.ПС+Символы.ПС+"Показать структуру подчиненности?",РежимДиалогаВопрос.ДаНет);
						Если Ответ = КодВозвратаДиалога.Да Тогда
							РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Основание.Ссылка);
							ЗакрытьФорму = Истина;
							Возврат;
						Конецесли;	
					#Конецесли
				КонецЕсли;
			КонецЕсли;
			Если Основание.Самовыезд Тогда
				АгентКуда = Основание.Менеджер;
			Иначе	
				АгентКуда = Основание.Курьер;
			КонецЕсли;	
			Агент = ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО;
			Выдал = ПараметрыСеанса.уб_ТекущееФизЛицо;
		КонецЕсли;		
		ОснованиеЗаявка = ТипЗнч(СозданНаОсновании) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста");
		Если НЕ ОснованиеЗаявка И ТипЗнч(СозданНаОсновании)= Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
			Если НЕ ВернутьНаправление() = -1 Тогда
				//Это не возврат
				ЗаявкаКПодстановке = уб_УСЗ.ПолучитьИзначальныйДокумент(СозданНаОсновании);
				ОснованиеЗаявка = ТипЗнч(ЗаявкаКПодстановке) = Тип("ДокументСсылка.уб_ЗаявкаНаЗаказВыездногоСпециалиста")
			КонецЕсли;
		Иначе
			ЗаявкаКПодстановке = СозданНаОсновании;
		КонецЕсли;	
		//Заполнение таблицы БСО
		
		//ППС 25-07-2014
		СтруктураЗаявок = Документы.уб_ЗаявкаНаПечать.ДанныеПечатиПоВыезду(Основание, Истина);
		
		ВидБСО_ЗаявкаНаПечать          = "";
		НомерПолиса_ЗаявкаНаПечать     = "";
		ВидБСОКвитанции_ЗаявкаНаПечать = "";
		НомерКвитанции_ЗаявкаНаПечать  = "";
		
		СтруктураЗаявок.Свойство("ВидБСО_ЗаявкаНаПечать", 	       ВидБСО_ЗаявкаНаПечать);
		СтруктураЗаявок.Свойство("НомерПолиса_ЗаявкаНаПечать",     НомерПолиса_ЗаявкаНаПечать);	
		СтруктураЗаявок.Свойство("ВидБСОКвитанции_ЗаявкаНаПечать", ВидБСОКвитанции_ЗаявкаНаПечать);
		СтруктураЗаявок.Свойство("НомерКвитанции_ЗаявкаНаПечать",  НомерКвитанции_ЗаявкаНаПечать);
		
		ЗаполнятьНомерПолиса    = Не ПустаяСтрока(НомерПолиса_ЗаявкаНаПечать);
		ЗаполнятьНомерКвитанции = Не ПустаяСтрока(НомерКвитанции_ЗаявкаНаПечать);
		//ППС 25-07-2014
		
		Для Каждого ТекСтрокаБСО Из Основание.БСО Цикл
			//Если ПроверятьНаличиеБСО И БСО.НайтиСтроки(Новый Структура("СК,ВидБСО",ТекСтрокаБСО.СК,ТекСтрокаБСО.ВидБСО)).Количество()>0 Тогда
			//	Продолжить;
			//Конецесли;
			ВидБСО = ТекСтрокаБСО.ВидБСО;
			СК     = ТекСтрокаБСО.СК;		
			Если ЗначениеЗаполнено(ВидБСО) = Ложь Тогда
				Продолжить;
			КонецЕсли;	
			ЭтоСтраховойПродукт = ТипЗнч(ВидБСО) = Тип("ПеречислениеСсылка.уб_ВидыСтраховыхПродуктов");
			//Тип("СправочникСсылка.уб_СтраховыеПродукты");
			Если ЭтоСтраховойПродукт Тогда
				МассивБСО = Новый Массив;
				МассивБСО.Добавить(ВидБСО);
				//Квитанции не добавляем автоматически
				
				//Запрос = Новый Запрос(
				//"ВЫБРАТЬ
				//|	уб_СтраховыеПродуктыВидыБСО.Ссылка,
				//|	уб_СтраховыеПродуктыВидыБСО.НомерСтроки,
				//|	уб_СтраховыеПродуктыВидыБСО.ВидБСО,
				//|	уб_СтраховыеПродуктыВидыБСО.Обязательно,
				//|	уб_СтраховыеПродуктыВидыБСО.НазначениеБСО,
				//|	ВЫБОР
				//|		КОГДА уб_СтраховыеПродуктыВидыБСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго))
				//|			ТОГДА ИСТИНА
				//|		ИНАЧЕ ЛОЖЬ
				//|	КОНЕЦ КАК ЭтоПолис
				//|ИЗ
				//|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК уб_СтраховыеПродуктыВидыБСО
				//|ГДЕ
				//|	уб_СтраховыеПродуктыВидыБСО.Ссылка = &СтраховойПродукт
				//|	И уб_СтраховыеПродуктыВидыБСО.Обязательно = ИСТИНА");
				//Запрос.УстановитьПараметр("СтраховойПродукт",ВидБСО);
				//МассивБСО =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидБСО");
				//ToDO Подумать на случай когда в страховом продукте нет БСО квитанции, требуется его добавлять				
			Иначе	
				МассивБСО = Новый Массив;
				МассивБСО.Добавить(ВидБСО);
				Если уб_СЛ.ОпределитьЭтоПолис(ВидБСО) Тогда
					Квитанция = уб_Кэшируемые.ВидБСОТипаКвА7ДляСК(ТекСтрокаБСО.СК).ВидБСО;
					Если ЗначениеЗаполнено(Квитанция) Тогда
						МассивБСО.Добавить(Квитанция);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			Для Кол = 1 по ТекСтрокаБСО.Количество + ТекСтрокаБСО.ДопКоличество Цикл
				Для каждого ВидБСО из МассивБСО Цикл
					НоваяСтрока = БСО.Добавить();
					НоваяСтрока.Подтверждено 	= Истина;
					НоваяСтрока.СК 				= СК;
					НоваяСтрока.ВидБСО 			= ВидБСО;
					
					//ППС 25-07-2014
					Если ЗаполнятьНомерПолиса и (ВидБСО_ЗаявкаНаПечать = ВидБСО) Тогда
						ЗаполнятьНомерПолиса = Ложь;
						НоваяСтрока.НомерБСО = НомерПолиса_ЗаявкаНаПечать;
					КонецЕсли;
					 
					
					Если ЗаполнятьНомерКвитанции и (ВидБСОКвитанции_ЗаявкаНаПечать = ВидБСО) Тогда
						ЗаполнятьНомерКвитанции = Ложь;
						НоваяСтрока.НомерБСО    = НомерКвитанции_ЗаявкаНаПечать;
					КонецЕсли;					
					
					//ППС 25-07-2014
					
					НоваяСтрока.Количество 		= 1;
					
					Если Кол =1 и ВидБСО = ТекСтрокаБСО.ВидБСО Тогда
						НоваяСтрока.НомерБСО = ТекСтрокаБСО.НомерБСО;
					КонецЕсли;	
					
					Если ОснованиеЗаявка Тогда
						НоваяСтрока.ЗаявкаКуда = ЗаявкаКПодстановке;
						Если ПустаяСтрока(НоваяСтрока.НомерБСО) Тогда
							НоваяСтрока.НомерБСО =  ТекСтрокаБСО.ДопНомерБСО;
						КонецЕсли;	
						НоваяСтрока.СостояниеБСО = Перечисления.уб_СостоянияБСО.Оформлен;
					КонецЕсли;		
				КонецЦикла;	
				//НоваяСтрока = БСО.Добавить();
				//НоваяСтрока.Подтверждено 	= Истина;
				//НоваяСтрока.СК 				= ТекСтрокаБСО.СК;
				//НоваяСтрока.ВидБСО 			= ВидБСО;
				//НоваяСтрока.Количество 		= 1;
				//Если ОснованиеЗаявка Тогда
				//	НоваяСтрока.ЗаявкаКуда = ЗаявкаКПодстановке;
				//КонецЕсли;	
				//Если ЭтоПолис И Кол <= ТекСтрокаБСО.Количество Тогда //На запасные не добавляем квитанции
				//	//Добавим к нему квитанцию
				//	НоваяСтрока = БСО.Добавить();
				//	НоваяСтрока.Подтверждено 	= Истина;
				//	НоваяСтрока.СК 				= ТекСтрокаБСО.СК;
				//	НоваяСтрока.ВидБСО 			= уб_Кэшируемые.ВидБСОТипаКвА7ДляСК(ТекСтрокаБСО.СК);
				//	НоваяСтрока.Количество 		= 1;
				//	Если ОснованиеЗаявка Тогда
				//		НоваяСтрока.ЗаявкаКуда = ЗаявкаКПодстановке;
				//	КонецЕсли;	
				//КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.уб_ПередачаБСОПоставщику") Тогда
		// Заполнение шапки
		Если ЗаполнятьШапку Тогда 
			Агент				= Основание.Агент;
			СозданНаОсновании	= Основание;
			Дата = ТекущаяДата();
		Конецесли;
		Для Каждого ТекСтрокаБСО Из Основание.БСО Цикл
			НоваяСтрока = БСО.Добавить();
			НоваяСтрока.Подтверждено = Истина;
			НоваяСтрока.Поставщик = Основание.Поставщик;
			НоваяСтрока.ОрганизацияАгент = Основание.ОрганизацияАгент;
			НоваяСтрока.СК = ТекСтрокаБСО.СК;
			НоваяСтрока.ВидБСО = ТекСтрокаБСО.ВидБСО;
			НоваяСтрока.НомерБСО = ТекСтрокаБСО.НомерБСО;
			НоваяСтрока.Количество = ТекСтрокаБСО.Количество;
			//НоваяСтрока.ДатаВозврата = ???;
		КонецЦикла;
		//Реквизиты формы
		ФлагТекСостояние = Истина;
		ФлагСостояниеНаДатуДокумента = Истина;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда
		Если Не Основание.Пустая() Тогда
			// Заполнение шапки
			Если ЗаполнятьШапку Тогда 
				Агент				= Основание.АгентКуда;
				АгентКуда		    = Основание.Агент;
				СозданНаОсновании	= Основание;
				Дата = ТекущаяДата();
				Выдал               = Основание.Выдал;
			КонецЕсли;
			Для Каждого ТекСтрокаБСО Из Основание.БСО Цикл
				Если ПроверятьНаличиеБСО И БСО.НайтиСтроки(Новый Структура("СК, ВидБСО, НомерБСО", ТекСтрокаБСО.СК, ТекСтрокаБСО.ВидБСО, ТекСтрокаБСО.НомерБСО)).Количество() > 0 Тогда
					Продолжить;
				Конецесли;	
				НоваяСтрока = БСО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаБСО);
				НоваяСтрока.Подтверждено = Истина;
				НоваяСтрока.ДатаВозврата = ТекущаяДата();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

ЗакрытьФорму = Ложь;

