
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не Отказ Тогда
		Запрос = Новый Запрос;
		Условие = "";
		Если ЭтотОбъект.Отбор.СтраховойПолис.Использование Тогда
			Условие = Условие + " СтраховойПолис = &СтраховойПолис ";
			Запрос.УстановитьПараметр("СтраховойПолис", ЭтотОбъект.Отбор.СтраховойПолис.Значение);
		КонецЕсли;
		Если ЭтотОбъект.Отбор.ТипЗадания.Использование Тогда
			Если Условие <> "" Тогда
				Условие = Условие + " И ";
			КонецЕсли;
			Условие = Условие + " ТипЗадания = &ТипЗадания ";
			Запрос.УстановитьПараметр("ТипЗадания", ЭтотОбъект.Отбор.ТипЗадания.Значение);
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации,
		|	уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис,
		|	уб_СтатусыПролонгацииСрезПоследних.ТипЗадания
		|ИЗ
		|	РегистрСведений.уб_СтатусыПролонгации.СрезПоследних(, &Условие) КАК уб_СтатусыПролонгацииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
		|		ПО уб_СтатусыПролонгацииСрезПоследних.ТипЗадания = уб_ЗаданияНаПролонгацию.ТипЗадания
		|			И уб_СтатусыПролонгацииСрезПоследних.СтраховойПолис = уб_ЗаданияНаПролонгацию.СтраховойПолис
		|			И (НЕ уб_ЗаданияНаПролонгацию.ТекущийСтатус = уб_СтатусыПролонгацииСрезПоследних.СтатусПролонгации)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтраховойПолис = Выборка.СтраховойПолис;
			МенеджерЗаписи.ТипЗадания = Выборка.ТипЗадания;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.ТекущийСтатус = Выборка.СтатусПролонгации;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
