Функция ПривестиЗначениеКТипу(Значение,ТипЗначенияПараметра="Строка") Экспорт
	Если ТипЗначенияПараметра = "Строка" Тогда
		Возврат ""+Значение;
	ИначеЕсли ТипЗначенияПараметра = "Дата" Тогда	
		    //22.05.2014 00:00:00 //Наше строковое
			//2014-05-22T00:00:00 //Xml
			Попытка
				//Возврат Дата(Сред(Значение,7,4)+Сред(Значение,4,2)+Сред(Значение,1,2)+СтрЗаменить(Прав(Значение,8),":",""));
				Возврат Дата(СтрЗаменить(Лев(Значение,10),"-","")+СтрЗаменить(Прав(Значение,8),":",""));
			Исключение
				Сообщить ("Ошибка приведения даты "+ Значение);	
			КонецПопытки;	
	ИначеЕсли ТипЗначенияПараметра = "Логический" Тогда	
		    Возврат Нрег(Значение) = "true";
	ИначеЕсли ТипЗначенияПараметра = "Целое" ИЛИ ТипЗначенияПараметра = "Вещественный" Тогда	
		Попытка
			Возврат Число(Значение);
		Исключение
			Сообщить ("Ошибка приведения числа "+ Значение);
			Возврат 0;
		КонецПопытки;	
	Иначе
		Возврат ""+Значение;
	Конецесли;	

КонецФункции	