Перем Фабрика экспорт;
Перем Прокси экспорт;
Перем AccId экспорт;
Перем АдресСервиса экспорт;
Перем host экспорт;
//Важно
//Формат времени: 2014-02-19T00:00:00
//<pol:internalID>ВнутреннийИдентификатор</pol:internalID>???


//Инициализация данных обработки
Процедура Инициализировать(ЭтоТест=ЛОЖЬ) экспорт
	АдресСервиса  = "http://agent.uralsibins.ru:80/PO.Insurance/POInsuranceService?wsdl";
	host = "agent.uralsibins.ru";
	ТестовыйРежим = ЭтоТест;
	ПолучитьAccID();
КонецПроцедуры	

//чкн
Функция ОтправитьДанныеПолиса()Экспорт
	
	Обработка = ЭтотОбъект;
	
	НомерСессии = Обработка.AccId;
	
	Текст = Новый ТекстовыйДокумент;
	_IDПолиса = "";
	ЕСли НомерСессии <> Неопределено ИЛИ Обработка.ТестовыйРежим = Истина Тогда
		
		//ИмяМакета = "ШаблонИмпорта";
		ДанныеДляЗаполнения = Неопределено;
		
		Если Документ.ПодготовитьДанные(НомерСессии,ДанныеДляЗаполнения) = Истина Тогда
			
			Если ПустаяСтрока(Документ.IDКалькуляции)= Истина Тогда  
				Если ПроизвестиКалькуляцию(ДанныеДляЗаполнения,Текст) = ЛОЖЬ Тогда
					Обработка.ЗакрытьAccID();
					Текст.ДобавитьСтроку("Калькуляция не проведена");
					Возврат Текст;
				КонецЕсли;	
			Иначе
				//Есть код калькуляции
			КонецЕсли;	
			//
			ДопСтрока = ДанныеДляЗаполнения.Добавить();
			ДопСтрока.Параметр = "КодКалькуляции";
			ДопСтрока.Значение = Документ.IDКалькуляции;
		
			ИмяМакета = "ШаблонИмпорта";
			Результат = ЗаполнитьМакет(ИмяМакета,ДанныеДляЗаполнения);
			
			///Сообщить(Результат);
			XMLОтвет = Обработка.ЗапросSoap("importPolicy",Результат);
			Если XMLОтвет = Неопределено Тогда
				Текст.ДобавитьСтроку("Не получено ответа на запрос");
				Текст.ДобавитьСтроку("--------Проект запроса "+Имямакета+"-------");
				Текст.ДобавитьСтроку(Результат);
			Иначе	
				СтрокаXPath = "/S:Envelope/S:Body/ns2:importPolicyResponse/errors/error/message";
				//СтрокаXPath = "//errors/error/message";
				СтрокаXPath = "//errors/error[message or type]";
				ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
				Если ВыборкаXMLНод.length = 0 Тогда
					//Текст.ДобавитьСтроку(XMLОтвет.xml);
				Иначе	
					Для каждого ХМЛнода из ВыборкаXMLНод Цикл
						Текст.ДобавитьСтроку("--------Ошибки отправки-----------------");
						Текст.ДобавитьСтроку(ХМЛнода.Text);
						
					КонецЦикла;		
				КонецЕсли;	
				//СтрокаXPath = "/S:Envelope/S:Body/ns3:importPolicyResponse/policy/ns4:ID";
				СтрокаXPath = "/S:Envelope/S:Body/ns2:importPolicyResponse/policy/ns4:ID";
				ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
				Если ВыборкаXMLНод.length = 0 Тогда
					Текст.ДобавитьСтроку(XMLОтвет.xml);
					//IDПолиса = "";
				Иначе	
					_IDПолиса = ВыборкаXMLНод.item(0).text;
					Если ПустаяСтрока(_IDПолиса)= ИСТИНА ИЛИ (_IDПолиса<>Документ.IDПолиса) Тогда
						IDПолиса = _IDПолиса;
					КонецЕсли;	
					
				КонецЕсли;	
			КонецЕсли;
			
			
			//Корешок = Ответ.DocumentElement;
			//Если ВыборкаXMLНод.length = 0 Тогда
			//	
			//КонецЕсли;
		Иначе
			//Не подготовлены данные
		КонецЕсли;
		Если _IDПолиса = 0 Тогда
		Иначе
			Документ.IDПолиса = IDПолиса;	
		КонецЕсли;	
		Обработка.ЗакрытьAccID();
	Иначе
		Текст.ДобавитьСтроку("Соединение не инициализировано");
	КонецЕсли;	
	
	Возврат Текст;
	
КонецФункции

Функция ПроизвестиКалькуляцию(ДанныеДляЗаполнения,Текст = Неопределено, Обработка = Неопределено,ИмяМакета = "ШаблонКалькуляции") Экспорт
	
	Обработка = ЭтотОбъект;
	
	ТребуетсяЗакрытьСессию = ЛОЖЬ;	
	
	Если Текст = Неопределено Тогда
		//	
		Текст = Новый ТекстовыйДокумент;
	КонецЕсли;	
	
	Если ДанныеДляЗаполнения = Неопределено Тогда
		
		Если НЕ Документ.ПодготовитьДанные(Обработка.AccId,ДанныеДляЗаполнения) = Истина Тогда
			Текст.ДобавитьСтроку("Не подготовлены данные для калькуляции");
			Если ТребуетсяЗакрытьСессию = Истина Тогда
				Обработка.ЗакрытьAccID();
			Конецесли;	
			Возврат ЛОЖЬ;
		КонецЕсли;	
	Конецесли;	
	
	ТекстЗапросаXML = ЗаполнитьМакет(ИмяМакета,ДанныеДляЗаполнения,"МакетВодительРСАX");
	
	///Сообщить(Результат);
	XMLОтвет = Обработка.ЗапросSoap("calcByProductType",ТекстЗапросаXML);
	Если XMLОтвет = Неопределено Тогда
		Текст.ДобавитьСтроку("Не получено ответа на запрос");
		Текст.ДобавитьСтроку("--------Проект запроса "+Имямакета+"-------");
		Сообщить(ТекстЗапросаXML);
	Иначе	
		//Сообщить(XMLОтвет.xml);//XMLОтвет.text);
		СтрокаXPath = //"/S:Envelope/S:Body/ns3:calcByProductTypeResponse/calcPolicyResult/calcResult/errors/error/message";//Полный
		//"/S:Envelope/S:Body/ns3:calcByProductTypeResponse//errors/error/message";//Более универсальный?
		//"//errors/error/message";//Еще более универсальный?
		"//errors/error[message or type]";
		//XMLОтвет.selectNodes("//errors/error/message");
		ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
		//Корешок = Ответ.DocumentElement;
		Если ВыборкаXMLНод.length = 0 Тогда
			//Нет ошибок
			СтрокаXPath = "//calcPolicyResult/calcResult/policy/ns4:calcID";
			ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
			ЭлементВыборки = ВыборкаXMLНод.item(0);
			
			Если ЭлементВыборки = Неопределено Тогда
			Иначе
				КодКалькуляции = ЭлементВыборки.text;	
			КонецЕсли;	
			//
			Если ПустаяСтрока(КодКалькуляции)= ИСТИНА ИЛИ (КодКалькуляции<>Документ.IDКалькуляции) Тогда
				Документ.IDКалькуляции = КодКалькуляции;
			КонецЕсли;	
			
			//СтрокаXPath = "/S:Envelope/S:Body/ns3:calcByProductTypeResponse/calcPolicyResult/calcResult/policy/ns4:insPremTotal";
			СтрокаXPath = "//calcPolicyResult/calcResult/policy/ns4:insPremTotal";
			ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
			
			Для каждого ХМЛнода из ВыборкаXMLНод Цикл
				СтраховаяПремия = ХМЛнода.text;
				Прервать;
			КонецЦикла;
			
			//Сообщить(СтраховаяПремия);
			
			Попытка
				СтраховаяПремия = 	Число(СтраховаяПремия);
			Исключение
				СтраховаяПремия = 0;
			КонецПопытки;
			Документ.УстановитьПараметр("СтраховаяПремияРиск",  СтраховаяПремия);
			Документ.УстановитьПараметр("ПлатежСумма",          СтраховаяПремия);
			
			СписокЗначений = Новый СписокЗначений;
			
			//Значения
			//СтрокаXPath = "/S:Envelope/S:Body/ns3:calcByProductTypeResponse/calcPolicyResult/calcResult/policy/ns4:riskInfo/ns4:risk/ns4:koefficients/ns4:koefficient/ns4:value";
			СтрокаXPath = "//calcPolicyResult/calcResult/policy/ns4:riskInfo/ns4:risk/ns4:koefficients/ns4:koefficient/ns4:value";
			ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
			Для каждого ХМЛнода из ВыборкаXMLНод Цикл
				СписокЗначений.Добавить(ХМЛнода.Text);
			КонецЦикла;	
			//Имена
			//СтрокаXPath = "/S:Envelope/S:Body/ns3:calcByProductTypeResponse/calcPolicyResult/calcResult/policy/ns4:riskInfo/ns4:risk/ns4:koefficients/ns4:koefficient/ns4:name";
			СтрокаXPath = "//calcPolicyResult/calcResult/policy/ns4:riskInfo/ns4:risk/ns4:koefficients/ns4:koefficient/ns4:name";
			ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
			Счетчик = 0;
			Для каждого ХМЛнода из ВыборкаXMLНод Цикл
				ЭлементСписка =  СписокЗначений[Счетчик];
				ЭлементСписка.Представление = ХМЛнода.Text;
				//Сообщить(ХМЛнода.Text+"="+ЭлементСписка.Значение);
				нСтрокиДанные = Документ.Данные.НайтиСтроки(Новый Структура("Параметр",ХМЛнода.Text));
				Если нСтрокиДанные.Количество() = 0 Тогда
					Сообщить("Не найдена строка данных с именем: "+ ХМЛнода.Text);
				Иначе
					нСтрокиДанные[0].Значение = Число(ЭлементСписка.Значение);
					нСтрокиДанные = ДанныеДляЗаполнения.НайтиСтроки(Новый Структура("Параметр",ХМЛнода.Text));
					Если нСтрокиДанные.Количество() > 0 Тогда
						нСтрокиДанные[0].Значение = Число(ЭлементСписка.Значение);
					КонецЕсли;	
				КонецЕсли;	
				Счетчик = Счетчик+1;
			КонецЦикла;
			//Возврат Неопределено;;
			
			Соответствие = ПрочитатьОтветРСА(XMLОтвет);
			Для каждого ЭлементСоответствия из Соответствие Цикл
				ИмяДанных =  ЭлементСоответствия.Значение.Имя;
				
				Если ПустаяСтрока(ИмяДанных) = ЛОЖЬ Тогда
					нСтрокиДанные =	Документ.Данные.НайтиСтроки(Новый Структура("Параметр",ИмяДанных));
					Если нСтрокиДанные.Количество()>0 Тогда
						//
						Если ЗначениеЗаполнено (нСтрокиДанные[0].Значение) и Найти(ИмяДанных,"КБМ") = ЛОЖЬ Тогда
							
						Иначе	
							нСтрокиДанные[0].Значение = ЭлементСоответствия.Значение.Значение;
						КонецЕсли;	
					Иначе
						//!!! 
						//Сообщить ("Заполнение по РСА: не найден  параметр с именем "+ИмяДанных);
					КонецЕсли;	
					
				КонецЕсли;
					 
			КонецЦикла; 
			Документ.УстановитьПараметр("СтраховаяПремияВсего", СтраховаяПремия,,Истина);
		Иначе	
			Для каждого ХМЛнода из ВыборкаXMLНод Цикл
				Текст.ДобавитьСтроку("--------Ошибки калькуляции-----------------");
				Текст.ДобавитьСтроку(ХМЛнода.Text);
			КонецЦикла;	
			Если ТребуетсяЗакрытьСессию = Истина Тогда
				Обработка.ЗакрытьAccID();
			Конецесли;	
			Возврат Ложь;
		КонецЕсли;//Ошибки калькуляции	
	КонецЕсли;	//Наличие ответа
	
	Если ТребуетсяЗакрытьСессию = Истина Тогда
		Обработка.ЗакрытьAccID();
	Конецесли;	
	Возврат Истина;
КонецФункции				

Функция ПрочитатьОтветРСА(xml_doc)
	СтрокаXPath = "//ns4:parameters/ns4:parameter/ns4:name";

	//СтрокаXPath="/"
	//ДокументДОМ = Построитель.Прочитать(ЧтениеXML);
	//ВыражениеXPath = ДокументДОМ.СоздатьВыражениеXPath(СтрокаXPath, Новый РазыменовательПространствИменDOM(ДокументДОМ));
	//РезультатXPath = ВыражениеXPath.Вычислить(ДокументДОМ);
	//УзелDOM = РезультатXPath.ПолучитьСледующий();
	
	//Узел=Ответ.selectNodes("ns2:Dictionary");
	//Ответ.setProperty("SelectionLanguage","XPath");
	ВыборкаXMLНод = xml_doc.selectNodes(СтрокаXPath);
	
	//Корешок = Ответ.DocumentElement;
	Счетчик = 0;
	
	Соотв = Новый Соответствие;
	
	МенеджерОбработки = Обработки.уб_ИнтеграцияПолисОфисУралСиб;
	
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.mesacTO",Новый Структура("Имя,Значение","МесяцТОЧисло"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.mesacTOStr",Новый Структура("Имя,Значение","МесяцТОСтрокой"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.godTO",Новый Структура("Имя,Значение","ГодОчередногоТО"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.dataDiagnKarti",Новый Структура("Имя,Значение","ДатаДиагностическойКарты"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.nomerDiagnKarti",Новый Структура("Имя,Значение","НомерДК"));
	//СерияДК
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.tipDokTO",Новый Структура("Имя,Значение","ТипДокументаТО"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.drugaaMarka",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.ts.kodTSRSA",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel1.kbmRsa",Новый Структура("Имя,Значение","Водитель1КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel1.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель1КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel1.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel2.kbmRsa",Новый Структура("Имя,Значение","Водитель2КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel2.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель2КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel2.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel3.kbmRsa",Новый Структура("Имя,Значение","Водитель3КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel3.kbmWithKoeff",Новый Структура("Имя,Значение","ВодительКБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel3.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel4.kbmRsa",Новый Структура("Имя,Значение","Водитель4КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel4.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель4КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel4.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel5.kbmRsa",Новый Структура("Имя,Значение","Водитель5КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel5.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель5КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel5.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel6.kbmRsa",Новый Структура("Имя,Значение","Водитель6КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel6.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель6КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel6.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel7.kbmRsa",Новый Структура("Имя,Значение","Водитель7КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel7.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель7КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel7.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel8.kbmRsa",Новый Структура("Имя,Значение","Водитель8КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel8.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель8КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel8.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel9.kbmRsa",Новый Структура("Имя,Значение","Водитель9КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel9.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель9КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel9.kbm",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel10.kbmRsa",Новый Структура("Имя,Значение","Водитель10КБМРСАСтрока"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel10.kbmWithKoeff",Новый Структура("Имя,Значение","Водитель10КБМсКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel10.kbm",Новый Структура("Имя,Значение",""));
	
	Соотв.Вставить("dogovor.obektstrahovaniaauto.idCalcKBMRSA",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.kbm",Новый Структура("Имя,Значение","КБМОбъектастрахования"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.soobsenieRSA",Новый Структура("Имя,Значение","ОтветРСА"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.kbmSobstvWithKoeff",Новый Структура("Имя,Значение","КБМСобственникаСКоэф"));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.kbmRSA",Новый Структура("Имя,Значение","КБМОбъектастрахов_РСА"));
	//Соотв.Вставить("dogovor.obektstrahovaniaauto.kbmRSA",Новый Структура("Имя,Значение",""));
	Соотв.Вставить("dogovor.obektstrahovaniaauto.rsaID",Новый Структура("Имя,Значение",""));
	//Соотв.Вставить("",Новый Структура("Имя,Значение",""));
	//Соотв.Вставить("",Новый Структура("Имя,Значение",""));
	
	
	
	Для каждого ХМЛнода из ВыборкаXMLНод Цикл
		ИмяПараметра  = ХМЛнода.text;
		ИскомоеСвойство = Соотв.Получить(ИмяПараметра);
		
		Если ИскомоеСвойство = Неопределено Тогда
			Счетчик = Счетчик+1;
			Продолжить;
		КонецЕсли;	
		
		ТипЗначенияПараметра = xml_doc.selectNodes("//ns4:parameters/ns4:parameter["+Счетчик+"]/ns4:type").item(0).text;
		//Сообщить(ТипЗначенияПараметра);
		Если ТипЗначенияПараметра = "Строка" Тогда
			имяПодСвойства = "stringValue" 
		ИначеЕсли ТипЗначенияПараметра = "Дата" Тогда
			имяПодСвойства = "dateValue" 
		ИначеЕсли ТипЗначенияПараметра = "Целое" Тогда
			имяПодСвойства = "intValue" 
		ИначеЕсли ТипЗначенияПараметра = "Логический" Тогда	
			имяПодСвойства = "boolValue" 
		ИначеЕсли ТипЗначенияПараметра = "Вещественный" Тогда		
			имяПодСвойства = "decimalValue" 
		Иначе 
			имяПодСвойства ="";
			Сообщить("Не известный тип параметра "+ ТипЗначенияПараметра);	
		КонецЕсли;	
		Если Не имяПодСвойства ="" Тогда
		//	Сообщить(ТипЗначенияПараметра);
		//	Сообщить(имяПодСвойства);
			ЗначениеПараметра = "";
			ВыборкаЗначения = xml_doc.selectNodes("//ns4:parameters/ns4:parameter["+Счетчик+"]/ns4:"+имяПодСвойства);
			Если ВыборкаЗначения.length >= 1 Тогда
				ЗначениеПараметра = ВыборкаЗначения.item(0).text;
			КонецЕсли;
			//Сообщить(xml_doc.selectNodes("//ns4:parameters/ns4:parameter["+Счетчик+"]/ns4:"+имяПодСвойства).item(0).text);
			
			ИскомоеСвойство.Значение = МенеджерОбработки.ПривестиЗначениеКТипу(ЗначениеПараметра,ТипЗначенияПараметра);
			//Сообщить(ИскомоеСвойство.Значение);
		Конецесли;

		Счетчик = Счетчик+1;
		
	КонецЦикла;
	Возврат Соотв;
КонецФункции	

//чкн


Функция ЗаполнитьМакет(ИмяМакета,ДанныеДляМакета,ИмяПодМакета="МакетВодительX")Экспорт
	Попытка
		МакетЗапроса = ПолучитьМакет(ИмяМакета);
	Исключение
		Сообщить("Не найден макет "+ИмяМакета);
		Возврат "";
	КонецПопытки;	
	//"ШаблонКалькуляции"
	
	ТекстМакета = МакетЗапроса.ПолучитьТекст();
	
	Для каждого СтрокаДанных из ДанныеДляМакета Цикл
		
		Если Лев(СтрокаДанных.Значение,5) = "Макет" Тогда
			Попытка
				ТекстМакета = СтрЗаменить(ТекстМакета,СтрокаДанных.Параметр,ПолучитьМакет(Сред(СтрокаДанных.Значение,6)).ПолучитьТекст());				
			Исключение
				Сообщить("Ошибка добавления вложенного макета "+Сред(СтрокаДанных.Значение,6));
			КонецПопытки;	
		//Пока частные замены водитля и периода использования
		ИначеЕсли (Лев(СтрокаДанных.Параметр,8) = "Водитель") И  Прав(СтрокаДанных.Параметр,13) = "ПодменаСсылки" Тогда
			ПозПомены = Найти(СтрокаДанных.Параметр,"ПодменаСсылки");
			НомерВодителя = Число(Сред(СтрокаДанных.Параметр,9,ПозПомены-9));
			//В макете есть строки
			//"<!--Водитель1-->";
			//"<!--Водитель2-->";
			// в подмакете есть поля вида "dogovor.obektstrahovaniaauto.dopusk.voditeli.voditel1.vozrast"
			ЗначениеЗамены = ".voditel1.";
			ЗначениеНаЧто  = ".voditel"+НомерВодителя+".";
			ЗначениеВГлавномМакете = "<!--Водитель"+НомерВодителя+"-->";
			//Готовим подмакет
			Подмакет = ПолучитьМакет(ИмяПодМакета).ПолучитьТекст();
			Подмакет = СтрЗаменить(Подмакет,ЗначениеЗамены,ЗначениеНаЧто);
			ЗначениеЗамены = "ВодительX";
			ЗначениеНаЧто  = "Водитель"+НомерВодителя;
			Подмакет = СтрЗаменить(Подмакет,ЗначениеЗамены,ЗначениеНаЧто);
			//заменяем в шаблоне на  готовые подмакеты
			ТекстМакета = СтрЗаменить(ТекстМакета,ЗначениеВГлавномМакете,Подмакет);				
		ИначеЕсли (Лев(СтрокаДанных.Параметр,19) = "ПериодИспользования") И  Прав(СтрокаДанных.Параметр,6) = "Начало" Тогда
			ПозПомены = Найти(СтрокаДанных.Параметр,"Начало");
			НомерПериода = Число(Сред(СтрокаДанных.Параметр,20,ПозПомены-20));
			ИмяПодМакета2 = "МакетПериодыИспользования";
			ЗначениеЗамены = ".periodIspolzovania1.";
			ЗначениеНаЧто  = ".periodIspolzovania"+НомерПериода+".";
			ЗначениеВГлавномМакете = "<!--ПериодИспользования"+НомерПериода+"-->";
			//Готовим подмакет
			Подмакет = ПолучитьМакет(ИмяПодМакета2).ПолучитьТекст();
			Подмакет = СтрЗаменить(Подмакет,ЗначениеЗамены,ЗначениеНаЧто);
			ЗначениеЗамены = "ПериодИспользованияX";
			ЗначениеНаЧто  = "ПериодИспользования"+НомерПериода;
			Подмакет = СтрЗаменить(Подмакет,ЗначениеЗамены,ЗначениеНаЧто);
			//заменяем в шаблоне на  готовые подмакеты
			ТекстМакета = СтрЗаменить(ТекстМакета,ЗначениеВГлавномМакете,Подмакет);					
		//	
		
		КонецЕсли;		
	КонецЦикла;	
	
	Результат = "";
	Для СчетчикСтрок = 1 по СтрЧислоСтрок(ТекстМакета) Цикл
		ТекСтрока = СтрПолучитьСтроку(ТекстМакета,СчетчикСтрок);
		
		ЧтоТоНайдено = Ложь;
		Для каждого СтрокаДанных из ДанныеДляМакета Цикл
			
			Если Найти(ТекСтрока,СтрокаДанных.Параметр)>0 Тогда
				//Предобработчик();
				Значение = Документ.ОтформатироватьЗначение(СтрокаДанных.Значение,СтрокаДанных.Параметр);
				ТекСтрока = СтрЗаменить(ТекСтрока,СтрокаДанных.Параметр,Значение);
				ЧтотоНайдено = Истина;
				
				//Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Результат = Результат + ТекСтрока + Символы.ПС;
		
	КонецЦикла;	
	Возврат Результат;
КонецФункции	

Функция ПолучитьAccID() 
	
	ТекстЗапроса ="<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ser=""http://service.insurance.lois.ru/"">
	|   <soapenv:Header/>
	|   <soapenv:Body>
	|	  <ser:logIn>
	|		 <!--Optional:-->
	|		 <login>KupiPolis</login>
	|		 <!--Optional:-->
//	|		 <password>147258369</password>
	//|		 <password>369258147</password>
	//|		 <password>123456789</password>
	|		 <password>Kupipolis123</password>
	|	  </ser:logIn>
	|   </soapenv:Body>
	|</soapenv:Envelope>";
	
	оXML = ЗапросSoap("LogIn",ТекстЗапроса);
	Если оXML = Неопределено Тогда
	ИначеЕсли  оXML.text <> "" Тогда
		AccID  = оXML.text;
	КонецЕсли;	
	Возврат AccID;
	
КонецФункции

Функция ЗакрытьAccID()  Экспорт
	
	Если НЕ AccID = Неопределено и AccID<>"" Тогда
		ТекстЗапроса ="<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ser=""http://service.insurance.lois.ru/"">
		|   <soapenv:Header/>
		|   <soapenv:Body>
		|      <ser:logOut>"+AccID+"</ser:logOut>
		|   </soapenv:Body>
		|</soapenv:Envelope>";
		
		оXML = ЗапросSoap("LogOut",ТекстЗапроса);
		Если оXML = Неопределено Тогда
		Иначе
			ОтветСтрока  = оXML.text;
			Если не ПустаяСтрока(ОтветСтрока) Тогда
				Сообщить("Ответ при закрытии "+AccID+" "+ОтветСтрока);
			Иначе
				AccID = Неопределено;
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции

Функция ЗапросSoap(МетодСервиса,ТекстЗапроса)  Экспорт
	Запрос = Новый COMОбъект("MSXML2.DOMDocument");
	Запрос.loadXML(ТекстЗапроса);
	//Попытка
	xmlHttp = Новый COMОбъект("MSXML2.xmlHttp");
	xmlHttp.OPEN ("POST", АдресСервиса, 0);
	xmlHttp.setRequestHeader ("SOAPAction", МетодСервиса);
	xmlHttp.setRequestHeader ("Host", host);
	xmlHttp.setRequestHeader ("Content-type", "text/xml; charset=UTF-8");
	Попытка
		Если ТестовыйРежим Тогда
			//
			Сообщить("--------"+МетодСервиса+"-------");
			Сообщить(ТекстЗапроса);
		Иначе	
			xmlHttp.SEND (Запрос);
			Если xmlHttp.status = 200 Тогда
				оXML = xmlHttp.responseXML;
				//DOCToSave=New COMОбъект("MSXML2.DOMDocument");
				//DOCToSave.loadXML(xmlHttp.responseText);
				Возврат оXML;
			Иначе
				Сообщить("Ошибка");
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить("----------ОШИБКА СОЕДИНЕНИЯ попробуйте позднее----------");
		Сообщить(ПреобразоватьОшибку(ОписаниеОшибки()));
		Сообщить(АдресСервиса);
		Сообщить(МетодСервиса);
		Сообщить(host);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПреобразоватьОшибку(ТекстОшибки)
	Если Найти(ТекстОшибки,"Ошибка при вызове метода контекста (send): Произошла исключительная ситуация (msxml3.dll): Не удается найти указанный ресурс")>0 Тогда
		Возврат "Не отвечает сайт"
	Иначе
		Возврат ТекстОшибки
	КонецЕсли;	
	
КонецФункции	


Функция ПолучитьСправочник(ИмяСправочника,ВидСП = "ОСАГО") Экспорт

	

	Попытка	
		ТекстЗапроса ="<?xml version=""1.0"" encoding=""UTF-8""?>
		|<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ser=""http://service.insurance.lois.ru/"" xmlns:dic=""http://dictionary.policy.ie.lois.ru/"">
		|<soapenv:Header/>
		|<soapenv:Body>
		|   <ser:getDictionaries>
		|      <product>ОСАГО</product>
		|      <dictionaryCode>"+ИмяСправочника+"</dictionaryCode>
		|   </ser:getDictionaries>
		|	</soapenv:Body>
		|</soapenv:Envelope>";
		
		XMLОтвет = ЗапросSoap("getDictionaries",ТекстЗапроса);
		
		СтрокаXPath = "//ListDictionaryResponse/ns2:Dictionary/ns2:Value/ns2:Parameter/ns2:Value";
		
		ВыборкаXMLНод = XMLОтвет.selectNodes(СтрокаXPath);
		
		СписокСправочника  = Новый СписокЗначений;
		
		Для каждого ХМЛнода из ВыборкаXMLНод Цикл
			
			СписокСправочника.Добавить(ХМЛнода.Text);
			//Сообщить(ХМЛнода.Text);
			
		КонецЦикла;		
		
		Возврат СписокСправочника
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;	
	//Возврат XMLОтвет;
	
	
КонецФункции	


Функция ПолучитьСтатусДоговора(ДокументОбъект =  Неопределено,Вывестиxml = Ложь) Экспорт
	
	Если ДокументОбъект  = Неопределено Тогда
		ДокументОбъект = Документ;
	КонецЕсли;
	
	IDКалькуляции = ДокументОбъект.IDКалькуляции;
	Если ПустаяСтрока(IDКалькуляции) Тогда
		Возврат "Не определен";
	Иначе
		//
		ТекстЗапроса ="<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:ser=""http://service.insurance.lois.ru/"">
		|<soapenv:Header/>
		|<soapenv:Body>
		|<ser:getPolicy>
		|<!--Optional:-->
		|<accID>"+AccID+"</accID>
		|<!--Optional:-->
		|<calcID>"+IDКалькуляции+"</calcID>
		|</ser:getPolicy>
		|</soapenv:Body>
		|</soapenv:Envelope>";
		
		оXML = ЗапросSoap("getPolicy",ТекстЗапроса);
		Если оXML = Неопределено Тогда
			Возврат "Не определен";
		ИначеЕсли  оXML.text <> "" Тогда
			
			СтрокаXPath = "//errors/error/message";
			ВыборкаXMLНод = оXML.selectNodes(СтрокаXPath);
			Если ВыборкаXMLНод.length = 0 Тогда
				СтрокаXPath = "//ns4:state";
				ВыборкаXMLНод = оXML.selectNodes(СтрокаXPath);
				Если ВыборкаXMLНод.length = 0 Тогда
					Возврат "Не определен";
				Иначе
					Возврат ВыборкаXMLНод.item(0).text;
				КонецЕсли;
			Иначе
				Возврат "Ошибочный ответ";
			КонецЕсли;	
			Если Вывестиxml = Истина Тогда
				xml = оXML.xml;
				Сообщить(xml);
			КонецЕсли;
  			
		КонецЕсли;	
	КонецЕсли;
	//Ответ с ошибкой
//	<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
//   <S:Body>
//	  <ns2:getPolicyResponse xmlns:ns2="http://service.insurance.lois.ru/" xmlns:ns3="http://dictionary.policy.ie.lois.ru/" xmlns:ns4="http://policy.ie.lois.ru/" xmlns:ns5="http://dissolution.ie.lois.ru/" xmlns:ns6="http://error.ie.lois.ru/">
//		 <errors>
//			<error>
//			   <message>Нет сессии с идентификатором 4e4adea2-ecd7-4f79-a986-c539c214d39c. Выполните авторизацию.</message>
//			   <type>Некорректный ввод данных</type>
//			</error>
//		 </errors>
//	  </ns2:getPolicyResponse>
//   </S:Body>
//</S:Envelope>
//Другая ошибка
//<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
//   <S:Body>
//	  <ns2:getPolicyResponse xmlns:ns2="http://service.insurance.lois.ru/" xmlns:ns3="http://dictionary.policy.ie.lois.ru/" xmlns:ns4="http://policy.ie.lois.ru/" xmlns:ns5="http://dissolution.ie.lois.ru/" xmlns:ns6="http://error.ie.lois.ru/">
//		 <errors>
//			<error>
//			   <message>Системная ошибка: null</message>
//			   <type>Системная</type>
//			</error>
//		 </errors>
//	  </ns2:getPolicyResponse>
//   </S:Body>
//</S:Envelope>
КонецФункции
