
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	ПроверитьЗаполнениеТабличнойЧастиНомераПолисов(Отказ, Заголовок);
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	Для Каждого СтрокаТЧ Из СНП Цикл		
		СтруктураСНП = Неопределено;		
		МожноПроводитьНомерПолиса(СтрокаТЧ, Отказ, Заголовок, СтруктураСНП);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
		Движение = Движения.уб_СвободныеНомераПолисов.Добавить();
		// измерения
		Движение.Период					= СтрокаТЧ.Дата;
		Движение.СК						= СтрокаТЧ.СК;
		Движение.Поставщик				= СтрокаТЧ.Поставщик;
		Движение.ОрганизацияАгент		= СтрокаТЧ.ОрганизацияАгент;
		Движение.НомерПолиса			= СтрокаТЧ.НомерПолиса;
		// ресурсы
		//НЕ записываем вид нумерации в регистр
		//часто требуется изменять виды нумерации в поступлении, и во избежание перепроведения движений номеров полисов
		//с измененной нумерацией, будем считать, что вид нумерации будет определяться только поступлением и получать данные
		//нумерации из регистра срезом первых только для нумераций
		//Движение.ВидНумерации			= СтрокаТЧ.ВидНумерации;
		Движение.ГодПолиса				= СтрокаТЧ.ГодПолиса;
		Движение.НомерИспользован 		= Ложь;
		Движение.НомерЗарезервирован 	= Ложь;
		Движение.НомерЗаблокирован 		= СтрокаТЧ.НомерЗаблокирован;		
		Если ЗначениеНеЗаполнено(СтрокаТЧ.Агент) И Не СтрокаТЧ.НомерЗаблокирован Тогда
			Движение.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.ОсвобождениеНомера;
		ИначеЕсли НЕ ЗначениеНеЗаполнено(СтрокаТЧ.Агент) Тогда 	
			Движение.НомерВыданАгенту = СтрокаТЧ.Агент;
			Движение.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.ВыдачаНомера;
		ИначеЕсли СтрокаТЧ.НомерЗаблокирован Тогда
			Движение.КодОперации = Перечисления.уб_КодыОперацийНомеровПолисов.БлокировкаНомера;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Движение.Комментарий = СтрокаТЧ.Комментарий;
		
	КонецЦикла;
	Движения.уб_СвободныеНомераПолисов.Записать();
	
КонецПроцедуры

Процедура МожноПроводитьНомерПолиса(СтрокаТЧ, Отказ, Заголовок, СтруктураСНП = Неопределено) Экспорт
	
	сНомер = СокрЛП(СтрокаТЧ.НомерПолиса);	
	СтруктураСНП = уб_СтраховойБрокер.ПолучитьСтруктуруНомеровПолисов();
	СтруктураСНП.Период = Новый Граница(СтрокаТЧ.Дата, ВидГраницы.Исключая);
	СтруктураСНП.СК 		= СтрокаТЧ.СК;
	СтруктураСНП.НомерПолиса= сНомер;
	уб_СтраховойБрокер.ПрочитатьСостояниеНомераПолиса(СтруктураСНП);	
	Если НЕ СтруктураСНП.Существует Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Номера полиса "+сНомер+" не найден в системе на дату: " + Формат(СтрокаТЧ.Дата,"ДФ='dd.MM.yyyy HH:mm'"), Отказ, Заголовок);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиНомераПолисов(Отказ, Заголовок)
	СтруктураОбязательныхПолей = Новый Структура("НомерПолиса, СК, ВидНумерации");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СНП", СтруктураОбязательныхПолей, Отказ, Заголовок);
КонецПроцедуры

Процедура ПечатьБСО() Экспорт
	ТабДокумент = ПечатьНомеровБСО();
КонецПроцедуры	

Функция ПечатьНомеровБСО()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_Выданных_БСО";
	ТабДокумент.ИспользуемоеИмяФайла = "Печать_Выданных_БСО";
	
	Макет = ПолучитьМакет("ПечатьСпискаВыданныхНомеров");
	
	Организация = ПараметрыСеанса.уб_ОсновнаяОрганизация;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = "Организация: "+Организация;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Т.СК,
	               |	Т.ВидНумерации,
	               |	Т.НомерВыданАгенту,
	               |	Т.Период,
	               |	Т.НомерПолиса
	               |ИЗ
	               |	РегистрСведений.уб_СвободныеНомераПолисов.СрезПоследних(&Период, ) КАК Т
	               |ГДЕ
	               |	Т.НомерВыданАгенту <> &Агент";
				   
	
	
	
	Если ЗначениеНеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Агент = Неопределено;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Агент", Агент);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ТабДокумент.ФиксацияСверху	= 4; 

	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаб");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
 		
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=-";
	ДФ = "ДФ=dd.MM.yyyy";
	
	Для Каждого СтрокаТЗ Из Выборка Цикл
						
		СтрокаЗн = Макет.ПолучитьОбласть("Строка");
		Прм = СтрокаЗн.Параметры;
		
		Прм.СК = СтрокаТЗ.СК;
		Прм.НомерБСО = СтрокаТЗ.НомерПолиса;
		Прм.ВидыБСО = "";
		Прм.Ангент = СтрокаТЗ.НомерВыданАгенту;
		Прм.Дата = Формат(СтрокаТЗ.Период,ДФ);
		Прм.Обычный = "";
		Прм.Кредит = "";
		Прм.Рассрочка = "";
		Прм.БезРассрочки = "";
		
		ТабДокумент.Вывести(СтрокаЗн);
	КонецЦикла;
	
	ОбластьМ = Макет.ПолучитьОбласть("Подвал");
	ОбластьМ.Параметры.Пользователь = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	ТабДокумент.Вывести(ОбластьМ);

	 
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Печать сетки КВ");
	
	Возврат ТабДокумент;

КонецФункции