Процедура ПечатьКВ(КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьМакета();
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект, "---"), НепосредственнаяПечать);
		
КонецПроцедуры	

Функция ПечатьМакета()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_сетки_КВ";
	ТабДокумент.ИспользуемоеИмяФайла = "Печать_сетки_КВ";
	
	Макет = ПолучитьМакет("Макет");
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = Формат(Дата,"ДЛФ=ДД");
	//TODO Сократить
	Если КВДля=1 Тогда
		Если НЕ Агент=Неопределено Тогда
			Если ЗначениеНеЗаполнено(Организация) Тогда
				КВКого = "КВ агента "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация: "+ПараметрыСеанса.уб_ОсновнаяОрганизация;
			Иначе
				КВКого = "КВ агента "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация: "+Организация;
			КонецЕсли;	
		Иначе
			Если ЗначениеНеЗаполнено(Организация) Тогда
				КВКого = "КВ агента "+ПараметрыСеанса.уб_ОсновнаяОрганизация+"";
			Иначе
				КВКого = "КВ агента "+Организация+"";
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли КВДля=2 Тогда
		Если НЕ Агент=Неопределено Тогда
			Если ЗначениеНеЗаполнено(Организация) Тогда
				КВКого = "КВ менеджера "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация: "+ПараметрыСеанса.уб_ОсновнаяОрганизация;
			Иначе
				КВКого = "КВ менеджера "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация: "+Организация;
			КонецЕсли;	
		Иначе
			Если ЗначениеНеЗаполнено(Организация) Тогда
				КВКого = "КВ менеджера "+ПараметрыСеанса.уб_ОсновнаяОрганизация+"";
			Иначе
				КВКого = "КВ менеджера "+Организация+"";
			КонецЕсли;	
		КонецЕсли;
	Иначе
       	Если ЗначениеНеЗаполнено(Организация) Тогда
			КВКого = "КВ Брокера "+ПараметрыСеанса.уб_ОсновнаяОрганизация+"";
		Иначе
			КВКого = "КВ Брокера "+Организация+"";
		КонецЕсли;	
	КонецЕсли;	
	ОбластьМакета.Параметры.КВКого = КВКого;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ФиксацияСверху	= 4; 

	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаб");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
 		
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=-";
	ДФ = "ДФ=dd.MM.yyyy";
	
	Для Каждого СтрокаТЗ Из ТаблицаКВ Цикл
						
		СтрокаЗн = Макет.ПолучитьОбласть("Строка");
		Прм = СтрокаЗн.Параметры;
		
		Прм.Номер = СтрокаТЗ.НомерСтроки;
		Прм.ДатаНач = Формат(СтрокаТЗ.ДатаНач,ДФ);
		Прм.Продукт = СтрокаТЗ.СтраховойПродукт;
		Прм.СтраховаяКомпания = СтрокаТЗ.СК;
		Прм.Вид = СтрокаТЗ.ВидСП;
		Прм.Риск = СтрокаТЗ.Риск;
		Прм.КВПроцент = Строка(СтрокаТЗ.Процент);
		Прм.Условие = СтрокаТЗ.Условие;
					
		ТабДокумент.Вывести(СтрокаЗн);
	КонецЦикла;
	
	ОбластьМ = Макет.ПолучитьОбласть("Подвал");
	ОбластьМ.Параметры.Пользователь = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	ТабДокумент.Вывести(ОбластьМ);

	 
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Печать сетки КВ");
	
	Возврат ТабДокумент;

КонецФункции
