
Функция СписокДоступныхВидовНумераций(ВидБСО, ЕстьКредитныйДоговор = Неопределено, РассрочкаПлатежа = Неопределено) Экспорт

	СписокНумераций = Новый СписокЗначений;
	// Получим список доступных видов Нумераций
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка
	|ИЗ
	|	Справочник.уб_ВидыНумерации.ВидыБСО КАК Т
	|ГДЕ
	|	Т.ВидБСО = &ВидБСО");
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Если ЕстьКредитныйДоговор <> Неопределено Тогда
		Если ЕстьКредитныйДоговор Тогда
			Запрос.Текст = Запрос.Текст + " И Т.Ссылка.ДляКредитныхПолисов"
		Иначе
			Запрос.Текст = Запрос.Текст + " И Т.Ссылка.ДляОбычныхПолисов"
		КонецЕсли;
	КонецЕсли;
	Если РассрочкаПлатежа <> Неопределено Тогда
		Если РассрочкаПлатежа Тогда
			Запрос.Текст = Запрос.Текст + " И Т.Ссылка.СРассрочкой"
		Иначе
			Запрос.Текст = Запрос.Текст + " И Т.Ссылка.БезРассрочки"
		КонецЕсли;
	КонецЕсли;
	СписокНумераций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СписокНумераций;

КонецФункции // ПолучитьСписокДоступныхВидовНумераций()