//Функция проверки ... !!!ОПИСАТЬ!
Функция ПолучитьПрочитатьKey(key="", КонтрольнаяФраза = "контрольная фраза") Экспорт
	
	MD5 = Обработки.уб_MD5.Создать();
	
	Соединения = ПолучитьСоединенияИнформационнойБазы();
	
	Для Каждого Соединение из Соединения Цикл
		//Если соединение с базой в режиме предприятия
		Если Соединение.ИмяПриложения = "1CV8" ИЛИ Соединение.ИмяПриложения = "Толстый клиент" Тогда
			//Если key не передали, вернем key для текущего пользователя
			Если ЗначениеНеЗаполнено(key) Тогда
				Если Соединение.Пользователь.УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
					Возврат MD5.РасчетХЭШ(Строка(Соединение) + КонтрольнаяФраза + Строка(Соединение.Пользователь.УникальныйИдентификатор));
					//Возврат ОбщегоНазначения.MD5Хэш(Строка(Соединение) + КонтрольнаяФраза + Строка(Соединение.Пользователь.УникальныйИдентификатор));
				КонецЕсли;
			//Ищем key в активных соединениях
			Иначе
				Если key = MD5.РасчетХЭШ(Строка(Соединение) + КонтрольнаяФраза + Строка(Соединение.Пользователь.УникальныйИдентификатор)) Тогда
				//Если key = ОбщегоНазначения.MD5Хэш(Строка(Соединение) + КонтрольнаяФраза + Строка(Соединение.Пользователь.УникальныйИдентификатор)) Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Если пытаемся получить key для несуществующего пользователя или 
	//Не удается найти key в активных соединениях возвращаем Ложь
	Возврат Ложь;
КонецФункции

				//*******************************************************************
				//					Функции работы с JSON							*
				//							BEGIN									*
				//*******************************************************************
			
//Не рекомендую объединять фунции ФорматированныйJSON и НеФорматированныйJSON
//в одну, так как функция ФорматированныйJSON обычно используется только в 
//отладочных целях. В реальной работе требуется быстродействие, а не красивость.
Функция JSON(Значение,Форматировать=Ложь) Экспорт
	Если Форматировать Тогда
		Возврат ФорматированныйJSON(Значение)
	КонецЕсли;
	Возврат НеФорматированныйJSON(Значение)
КонецФункции

//Функция имеет недостаток, она не проводит валидацию JSON-строки,
//поэтому если строка "битая" или неправильная, то результат непредсказуем. :-)
//В смысле — в результате работы парсинга будет возвращена какая-нибудь лабуда.
Функция UnJSON(СтрJSON,КакСтруктура = Ложь) Экспорт
	Перем Значение;
	Если ПолучитьЗначениеJSON(СтрJSON,Значение,,,КакСтруктура )=0 Тогда
		Возврат Значение
	КонецЕсли;
	Возврат Неопределено
КонецФункции

//В функции конструкции условий расставлены по частоте их использования.
//Если кому нибудь удастся более оптимально (в смысле быстродействия) написать,
//то просьба сообщить мне на bigb.forum@gmail.com
Функция НеФорматированныйJSON(Значение)
	Разделитель="";
	
	ТипЗн=ТипЗнч(Значение);

	Если ТипЗн=Тип("Строка") Тогда
		Стр=""""+Экранировать(Значение)+""""

	ИначеЕсли ТипЗн=Тип("Число") ИЛИ ТипЗнч(Значение)=Тип("Булево") Тогда
		Стр=XMLСтрока(Значение)

	ИначеЕсли ТипЗн=Тип("Дата") Тогда
		Стр=""""+?(ЗначениеЗаполнено(Значение),XMLСтрока(Значение),"")+""""

	ИначеЕсли ТипЗн=Тип("Структура") ИЛИ ТипЗн=Тип("Соответствие") Тогда
		Стр="{";
		Для Каждого Параметр Из Значение Цикл
			Стр=Стр+Разделитель+Символы.ПС+""""+Параметр.Ключ+""":"+НеФорматированныйJSON(Параметр.Значение);
			Разделитель=","
		КонецЦикла;
		Стр=Стр+Символы.ПС+"}";

	ИначеЕсли ТипЗн=Тип("Массив") Тогда
		Стр="[";
		Для Каждого Элемент Из Значение Цикл
			Стр=Стр+Разделитель+Символы.ПС+НеФорматированныйJSON(Элемент);
			Разделитель=","
		КонецЦикла;
		Стр=Стр+Символы.ПС+"]";

	ИначеЕсли ТипЗн=Тип("ТаблицаЗначений") Тогда
		Колонки=Значение.Колонки;
		Массив=Новый Массив;
		Для Каждого СтрокаТЗ Из Значение Цикл
			Структура=Новый Структура;
			Для Каждого Колонка Из Колонки Цикл
				Структура.Вставить(Колонка.Имя,СтрокаТЗ[Колонка.Имя])
			КонецЦикла;
			Массив.Добавить(Структура);
		КонецЦикла;
		Стр=НеФорматированныйJSON(Массив)

	ИначеЕсли Значение=Неопределено Тогда
		Стр="null"

	Иначе
		Стр=""""+Экранировать(Значение)+""""
	КонецЕсли;

	Возврат Стр
КонецФункции

//Функция более медленная, чем НеФорматированныйJSON,
//но дает более структурированное представление данных.
//Рекомендуется использовать её только в отладочных целях.
Функция ФорматированныйJSON(Значение,Отступ="")
	Разделитель="";
	
	ТипЗн=ТипЗнч(Значение);

	Если ТипЗн=Тип("Строка") Тогда
		Стр=""""+Экранировать(Значение)+""""

	ИначеЕсли ТипЗн=Тип("Число") ИЛИ ТипЗнч(Значение)=Тип("Булево") Тогда
		Стр=XMLСтрока(Значение)

	ИначеЕсли ТипЗн=Тип("Дата") Тогда
		Стр=""""+?(ЗначениеЗаполнено(Значение),XMLСтрока(Значение),"")+""""

	ИначеЕсли ТипЗн=Тип("Структура") ИЛИ ТипЗн=Тип("Соответствие") Тогда
		Стр="{";
		Для Каждого Параметр Из Значение Цикл
			Стр=Стр+Разделитель+Символы.ПС+Отступ+""""+Параметр.Ключ+""":"+ФорматированныйJSON(Параметр.Значение,Отступ+Символы.Таб);
			Разделитель=","
		КонецЦикла;
		Стр=Стр+Символы.ПС+Отступ+"}";

	ИначеЕсли ТипЗн=Тип("Массив") Тогда
		Стр="[";
		Для Каждого Элемент Из Значение Цикл
			Стр=Стр+Разделитель+Символы.ПС+Отступ+ФорматированныйJSON(Элемент,Отступ);
			Разделитель=","
		КонецЦикла;
		Стр=Стр+Символы.ПС+Отступ+"]";

	ИначеЕсли ТипЗн=Тип("ТаблицаЗначений") Тогда
		Колонки=Значение.Колонки;
		Массив=Новый Массив;
		Для Каждого СтрокаТЗ Из Значение Цикл
			Структура=Новый Структура;
			Для Каждого Колонка Из Колонки Цикл
				Структура.Вставить(Колонка.Имя,СтрокаТЗ[Колонка.Имя])
			КонецЦикла;
			Массив.Добавить(Структура);
		КонецЦикла;
		Стр=ФорматированныйJSON(Массив)

	ИначеЕсли Значение=Неопределено Тогда
		Стр="null"

	Иначе
		Стр=""""+Экранировать(Значение)+""""
	КонецЕсли;

	Возврат Стр
КонецФункции

//Экранирует недопустимые символы
Функция Экранировать(Стр)
	Х = ""+Стр;
	Х=СтрЗаменить(Х,"\","\\");
	Х=СтрЗаменить(Х,"/","\/"); //Тут тоже не уверен, но пока оставлю.
	Х=СтрЗаменить(Х,"""","\""");
	//Х=СтрЗаменить(Х,"'","\'"); //??? Не уверен в этой строке. Кто нибудь может подтвердить или опровергнуть нужность этой строки.//Нужна когда в строке идет "'", и используется '' для ограничения строковых параметров
	Х=СтрЗаменить(Х,"'",""); //??? Не уверен в этой строке. Кто нибудь может подтвердить или опровергнуть нужность этой строки.//Нужна когда в строке идет "'", и используется '' для ограничения строковых параметров
	Х=СтрЗаменить(Х,Символ(8),"\b");
	Х=СтрЗаменить(Х,Символы.ПФ,"\f");
	Х=СтрЗаменить(Х,Символы.ПС,"\n");
	Х=СтрЗаменить(Х,Символы.ВК,"\r");
	Х=СтрЗаменить(Х,Символы.ВТаб,"\t");
	Возврат Х
КонецФункции

Функция ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция=1,Ключ="",КакСтруктура =ЛОЖЬ)
	Перем Кавычка;

	ЗначениеВСтроке="";
	Кавычек=0;
	Комментарий=Ложь;
	Строка=Ложь;

	Пока Позиция<=СтрДлина(СтрJSON) Цикл
		ХХ=Сред(СтрJSON,Позиция,2);
		Х=Лев(ХХ,1);
		Позиция=Позиция+1;

		Если Х>" " ИЛИ Строка Тогда //Отсекаем всякий хлам

			Если Комментарий Тогда
				//Это комментарий. Крутимся в цикле пока не встретится конец комментария
				Если ХХ="*/" Тогда
					//Комментарий закончился
					Комментарий=Ложь;
					Позиция=Позиция+1;
				КонецЕсли;

			ИначеЕсли Х="\" Тогда
				Позиция=Позиция+1;
				ХХ=ВРег(ХХ);
				Если ХХ="\""" Тогда ЗначениеВСтроке=ЗначениеВСтроке+""""
				ИначеЕсли ХХ="\\" Тогда ЗначениеВСтроке=ЗначениеВСтроке+"\"
				ИначеЕсли ХХ="\/" Тогда ЗначениеВСтроке=ЗначениеВСтроке+"/"
				ИначеЕсли ХХ="\B" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символ(8)
				ИначеЕсли ХХ="\F" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ПФ //перевод формы (страницы)
				ИначеЕсли ХХ="\N" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ПС //перевод строки
				ИначеЕсли ХХ="\R" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ВК //возврат каретки
				ИначеЕсли ХХ="\T" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ВТаб //символ вертикальной табуляции
				ИначеЕсли ХХ="\U" Тогда
					ЗначениеВСтроке=ЗначениеВСтроке+Символ(Hex2Число(Сред(СтрJSON,Позиция,4))); //шестнадцатиричное число
					Позиция=Позиция+4
				КонецЕсли;

			ИначеЕсли Строка Тогда
				//Если строка не закончилась - то пропускаем управляющие символы
				Если Х=Кавычка Тогда
					//Закончилась строка
					Строка=Ложь;
					Кавычек=Кавычек+1;
				Иначе
					ЗначениеВСтроке=ЗначениеВСтроке+Х;
				КонецЕсли;

			ИначеЕсли ХХ="/*" Тогда
				//Начался комментарий
				Комментарий=Истина;
				Позиция=Позиция+1;

			ИначеЕсли Найти("""'{}[]:,",Х)>0 Тогда
				Если Х="""" ИЛИ Х="'" Тогда
					//Началась строка
					//Строка - коллекция нуля или больше символов Unicode, заключенная в
					//двойные кавычки, используя "\" в качестве символа экранирования.
					//Символ представляется как односимвольная строка.
					//Похожий синтаксис используется в C и Java.
					Строка=Истина;
					Кавычка=Х;
					Кавычек=Кавычек+1;

				ИначеЕсли Х="{" Тогда
					//Начался объект
					//Объект - неупорядоченный набор пар ключ/значение.
					//Объект начинается с "{" и заканчивается "}".
					//Каждое имя сопровождается ":", пары ключ/значение разделяются ",".
					Если КакСтруктура = Истина Тогда
						Объект=Новый Структура;
					Иначе
						Объект=Новый Соответствие;
					КонецЕсли;	
					
					Пока Истина Цикл
						//Получим ключ и значение
						Ключ="";
						Режим=ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция,Ключ,КакСтруктура);
						//0 - есть значение и не конец объекта (запятая)
						//1 - есть значение и конец объекта
						//2 - нет значения и не конец объекта (запятая)
						//3 - нет значения и конец объекта
						Если Режим=0 Тогда
							Объект.Вставить(Ключ,Значение);
						ИначеЕсли Режим=1 Тогда
							Объект.Вставить(Ключ,Значение);
							Прервать
						ИначеЕсли Режим=3 Тогда
							Прервать
						КонецЕсли;
					КонецЦикла;
					Значение=Объект;
					Возврат 0

				ИначеЕсли Х="[" Тогда
					//Начался массив
					//Массив - упорядоченная коллекция значений.
					//Массив начинается с "[" и заканчивается "]".
					//Значения разделены ",".
					Массив=Новый Массив;
					Пока Истина Цикл
						Режим=ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция,,КакСтруктура);
						//0 - есть значение и не конец массива (запятая)
						//1 - есть значение и конец массива
						//2 - нет значения и не конец массива (запятая)
						//3 - нет значения и конец массива
						Если Режим=0 Тогда
							Массив.Добавить(Значение);
						ИначеЕсли Режим=1 Тогда
							Массив.Добавить(Значение);
							Прервать
						ИначеЕсли Режим=3 Тогда
							Прервать
						КонецЕсли;
					КонецЦикла;
					Значение=Массив;
					Возврат 0

				ИначеЕсли Х = "]" ИЛИ Х = "}" Тогда
					//Закончился массив/объект
					Если ЗначениеВСтроке="" И Кавычек=0 Тогда
						Возврат 3 //нет значения и конец массива/объекта
					Иначе
						Значение=ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек);
						Возврат 1 //есть значение и конец массива/объекта
					КонецЕсли;

				ИначеЕсли Х = ":" Тогда
					Ключ=ЗначениеВСтроке;
					Возврат ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция,,КакСтруктура);

				Иначе
					// запятая
					Прервать
				КонецЕсли;

			Иначе
				ЗначениеВСтроке = ЗначениеВСтроке+Х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если Кавычек>0 Тогда
		Значение=ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Если ЗначениеВСтроке = "" Тогда
			Возврат 2
		Иначе
			Значение=ЗначениеБезКавычек(ЗначениеВСтроке)
		КонецЕсли;
	КонецЕсли;
	Возврат 0
КонецФункции

Функция Hex2Число(Hex) Экспорт
	Стр=ВРег(СокрЛП(Hex));
	Dec=0;
	Для Х=1 По СтрДлина(Стр) Цикл
		Dec=Dec+Найти("123456789ABCDEF",Сред(Стр,Х,1))*Pow(16,СтрДлина(Стр)-Х)
	КонецЦикла;
	Возврат Dec
КонецФункции

Функция ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек)
	Если Кавычек>0 Тогда
		Возврат ЗначениеВКавычках(ЗначениеВСтроке)
	ИначеЕсли ЗначениеВСтроке="" Тогда
		Возврат Неопределено
	КонецЕсли;
	Возврат ЗначениеБезКавычек(ЗначениеВСтроке)
КонецФункции

Функция ЗначениеВКавычках(ЗначениеВСтроке)
	//Это или строка или дата.
	//Дата пока не обрабатывается (потом надо дописать)
	//Пока всегда возвращаем просто строку
	Возврат ЗначениеВСтроке;
КонецФункции

Функция ЗначениеБезКавычек(ЗначениеВСтроке)
	//Это число, булево или null.
	//Хотя здесь могут быть и строки. Например: {Code:123}
	Стр=ВРег(ЗначениеВСтроке);
	Если Стр="TRUE" Тогда Возврат Истина
	ИначеЕсли Стр="FALSE" Тогда Возврат Ложь
	ИначеЕсли Стр="NULL" Тогда Возврат Неопределено
	КонецЕсли;

	//Пробежимся по предполагаемому "числу"
	Экспонента=Ложь;
	ХХ=" ";
	Для Индекс=1 По СтрДлина(Стр) Цикл
		Х=Сред(Стр,Индекс,1);
		Если Найти("0123456789.+-",Х) Тогда
			ХХ=ХХ+Х
		ИначеЕсли Х="E" Тогда
			Экспонента=Истина;
			УУ=XMLЗначение(Тип("Число"),ХХ);
			ХХ=" ";
		Иначе
			Возврат ЗначениеВСтроке //Это точно не число, а строка
		КонецЕсли;
	КонецЦикла;

	ХХ=XMLЗначение(Тип("Число"),ХХ);
	Если Экспонента Тогда
		ХХ=УУ*Pow(10,ХХ)
	КонецЕсли;

	Возврат ХХ
КонецФункции


				//*******************************************************************
				//							END										*
				//					Функции работы с JSON							*
				//*******************************************************************


				//*******************************************************************
				//					Отправка POST Запроса                           *
				//							BEGIN									*
				//*******************************************************************

//Функция отправки POST запроса на сервер
//Параметры: строка данных - строка
//Возвращает соответсвие
Функция ОтправитьPOSTЗапросНаСервер(СтрокаДанных) Экспорт
	//Определение переменных
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("tmp");
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("tmp");
	
	Если СформироватьФайлОтправки(СтрокаДанных, Boundary, ИмяФайлаОтправки) Тогда
		Если ОтправитьФайл(Boundary, ИмяФайлаОтправки, ИмяФайлаОтвета) Тогда
			Возврат ПрочитатьОтветСервера(ИмяФайлаОтвета);
		Иначе
			ОтветСервера = Новый Соответствие;
			ОтветСервера.Вставить("status", "unavailable");
			Возврат ОтветСервера;
		КонецЕсли;
	Иначе
		//Если не удалось записать файл, надо что то передать...
	КонецЕсли;
КонецФункции

//Формируем файл для отправки
Функция СформироватьФайлОтправки(СтрокаДанных, Boundary, ИмяФайлаОтправки)
	Попытка
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.UTF8, Символы.ПС, ЛОЖЬ);
		
		//Блок установки кодировки
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
		ФайлОтправки.ЗаписатьСтроку("Content-type: text/html; charset=windows-1251" + Символы.ПС);
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
		
		//Блок установки данных
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
		ФайлОтправки.ЗаписатьСтроку("Content-disposition: form-data; name=""data""" + Символы.ПС);
		ФайлОтправки.ЗаписатьСтроку(СтрокаДанных);
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
		
		ФайлОтправки.Закрыть();
		Возврат Истина;
	Исключение
		ТекстОшибки = "Не удалось записать файл для отправки POST запроса!
		|" + СтрокаДанных + "
		|Файл отправки: " + ИмяФайлаОтправки;
		ЗаписатьОшибкуИСообщить(
			ТекстОшибки,
			?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), 
			Истина, 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			"Скорее всего проблема с правами. " + ОписаниеОшибки(), СтатусСообщения.Важное
		);
		Возврат Ложь;
	КонецПопытки;
КонецФункции

//Отправляем файл на сервер, получаем ответ
Функция ОтправитьФайл(Boundary, ИмяФайлаОтправки, ИмяФайлаОтвета)
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary);	
	Сервер = ПараметрыСеанса.уб_Константы.СерверB2B;
	Порт = ПараметрыСеанса.уб_Константы.Порт;
	АдресСкрипта = ПараметрыСеанса.уб_Константы.АдресСкрипта;
	НТТР = Новый HTTPСоединение(Сервер, Порт);
	Попытка
		НТТР.ОтправитьДляОбработки(ИмяФайлаОтправки, АдресСкрипта, ИмяФайлаОтвета, ЗаголовокHTTP);
		//УдалитьФайлы(ИмяФайлаОтправки);
		Возврат Истина;
	Исключение
		ТекстОшибки = "Не удалось отправить файл POST запроса! " + Сервер + ":" + Порт + "/" + АдресСкрипта + "
		|Файла отправки: " + ИмяФайлаОтправки + ", Файла ответа: " + ИмяФайлаОтвета;
		ЗаписатьОшибкуИСообщить(
			ТекстОшибки,
			?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), 
			Истина, 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			"Проверить доступность сервера. " + ОписаниеОшибки(), СтатусСообщения.Важное
		);
		УдалитьФайлы(ИмяФайлаОтправки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

//Читаем ответ сервера
Функция ПрочитатьОтветСервера(ИмяФайлаОтвета)
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	Если ФайлОтвета.Существует() Тогда
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок() > 0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();
			Ответ = уб_B2B.UnJSON(ОтветСервера);
			//УдалитьФайлы(ИмяФайлаОтвета);
			Возврат Ответ;
		Иначе
			ТекстОшибки = "Отправка POST запроса на сервер: Получен пустой ответ сервера!
			|Файл ответа: " + ИмяФайлаОтвета;
			ЗаписатьОшибкуИСообщить(
				ТекстОшибки,
				?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), 
				Истина, 
				УровеньЖурналаРегистрации.Ошибка, 
				, 
				, 
				"Скорее всего проблема с правами", 
				СтатусСообщения.Важное
			);
			Возврат Ложь;
		КонецЕсли;
		УдалитьФайлы(ИмяФайлаОтвета);
	Иначе
		ТекстОшибки = "Отправка POST запроса на сервер: Ответ сервера не получен!
		|Файл ответа: " + ИмяФайлаОтвета;
		ЗаписатьОшибкуИСообщить(
			ТекстОшибки,
			?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), 
			Истина, 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			"Скорее всего проблема с правами", 
			СтатусСообщения.Важное
		);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

				//*******************************************************************
				//							END										*
				//					Отправка POST Запроса                           *
				//*******************************************************************

Функция УбратьСимволы(строка, СимволЗамены = "") Экспорт
	
	НоваяСтрока = Строка;
	
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"""",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"'",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	">",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"<",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"|",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"?",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"/",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"\",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	":",	СимволЗамены);
	НоваяСтрока = стрЗаменить(НоваяСтрока,	"*",	СимволЗамены);
	
	Возврат НоваяСтрока
	
КонецФункции

//Добавляем запись в журнал регистрации и выводим сообщение
//
//														ПАРАМЕТРЫ:
//*************************************************************************************************************************
//	ТекстСообщение			- Строка                                                                                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	ТипСообщение			- Строка						Сообщить, Предупреждение	                                  *
//															Значение по умолчанию: Сообщить                               *
//*************************************************************************************************************************
//	ДобавлятьЗаписьВЖурнал  - Булево						Значение по умолчанию: Ложь							          *
//															                                                              *
//*************************************************************************************************************************
//															Информация, Ошибка, Предупреждение, Примечание                *
//	УровеньРегистрации   	- УровеньЖурналаРегистрации		Значение по умолчанию: Ошибка. Для информационного сообщения  *
//															будем использовать "Примечание"                               *
//*************************************************************************************************************************
//	ОбъектМетаданных		- ОбъектМетаданных                                                                            *
//                                                                                                                        *
//*************************************************************************************************************************
//															Данные, с которыми связано событие.                           *
//	СсылкаНаОбъект			- Произвольный					Рекомендуется указывать ссылки на объекты данных (элементы    *
//															справочников, документы, к которым относится событие).        *
//*************************************************************************************************************************
//	КомментарийЖурнала		- Строка						Комментарий к записи журнала регистрации                      *
//                                                                                                                        *
//*************************************************************************************************************************
//	Статус					- СтатусСообщения				БезСтатуса, Важное, Внимание, Информация, Обычное, ОченьВажное*
//															Значение по умолчанию: Обычное                                *
//*************************************************************************************************************************
//	Таймаут					- Число							Таймаут предупреждения                                        *
//															Значение по умолчанию: 0                                      *
//*************************************************************************************************************************
//	Заголовок				- Строка						Заголовок предупреждения                                      *
//															Значение по умолчанию: "1С:Предприятие"                       *
//*************************************************************************************************************************

// TODO дубль основной функции в уб_temp
Функция ЗаписатьОшибкуИСообщить(
	ТекстСообщения,
	ТипСообщения			= "Сообщить", 
	ДобавлятьЗаписьВЖурнал	= Ложь, 
	УровеньРегистрации		= "", 
	ОбъектМетаданных		= "", 
	СсылкаНаОбъект			= "", 
	КомментарийЖурнала		= "", 
	Статус 					= "", 
	Таймуат					= 0,
	Заголовок				= ""
	) Экспорт
	
	//Выводим информацию на экран
	Если ТипСообщения = "Сообщить" Тогда
		Если Статус = "" Тогда Статус = СтатусСообщения.Обычное;КонецЕсли;
		#Если Клиент Тогда
			Сообщить(ТекстСообщения, Статус);
		#КонецЕсли
	ИначеЕсли ТипСообщения = "Предупреждение" Тогда
		//Предупреждение возможно выдавать только в режиме клиента
		#Если Клиент Тогда
			Предупреждение(ТекстСообщения, Таймуат, Заголовок);
		#КонецЕсли
	КонецЕсли;
	//Создаем запись в журнале регистрации
	Если ДобавлятьЗаписьВЖурнал Тогда
		Если УровеньРегистрации = "" Тогда 
			УровеньРегистрации = УровеньЖурналаРегистрации.Ошибка;
		КонецЕсли;
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньРегистрации, ОбъектМетаданных, СсылкаНаОбъект, КомментарийЖурнала);
	КонецЕсли;
КонецФункции

//Генератор паролей
//	Используется:
//		* Пользователи B2B
//	Параметры:
//		Русский, Маленькие, Большие, Цифры, Знаки - (Булево) Использование символов
//		Длина - (Число) Длина пароля
Функция ГенераторПароля(Русский = Ложь, Маленькие = Истина, Большие = Ложь, Цифры = Истина, Знаки = Ложь, Длина = 8) Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	МаленькиеРусскиеБуквыЛевые = "ёйцукефывапячсми";
	МаленькиеРусскиеБуквыПравые = "нгшзхърлджэитьбю";
	БольшиеРусскиеБуквыЛевые = "ЁЙЦУКЕФЫВАПЯЧСМИ";
	БольшиеРусскиеБуквыПравые = "НГШЗХЪРЛДЖЭИТЬБЮ";
	ЦифрыЛевые = "123456";
	ЦифрыПравые = "789";
	ЗнакиРусскиеЛевые = "!""№;%:";
	ЗнакиРусскиеПравые = "-=.?*()_+,";
	МаленькиеЛатинскиеБуквыЛевые = "qwertasdfgzxcvb";
	МаленькиеЛатинскиеБуквыПравые = "yuiphklbnm";
	БольшиеЛатинскиеБуквыЛевые = "QWERTASDFGZXCVB";
	БольшиеЛатинскиеБуквыПравые = "YUIPHKLBNM";
	ЗнакиЛатинскиеЛевые = "`~!@#$%^";
	ЗнакиЛатинскиеПравые = "-=[];',./&*()_+{}:""<>?";
	
	НаборЛевый = "";
	НаборПравый = "";
	
	Если русский тогда
		если маленькие тогда
			НаборЛевый = НаборЛевый + МаленькиеРусскиеБуквыЛевые;
			НаборПравый =НаборПравый+ МаленькиеРусскиеБуквыПравые;
		КонецЕсли;
		если Большие тогда
			НаборЛевый = НаборЛевый + БольшиеРусскиеБуквыЛевые;
			НаборПравый = НаборПравый + БольшиеРусскиеБуквыПравые;
		КонецЕсли;
		если Цифры тогда
			НаборЛевый = НаборЛевый + ЦифрыЛевые;
			НаборПравый = НаборПравый + ЦифрыПравые;
		КонецЕсли;
		если Знаки тогда
			НаборЛевый = НаборЛевый + ЗнакиРусскиеЛевые;
			НаборПравый = НаборПравый + ЗнакиРусскиеПравые;
		КонецЕсли;
	иначе
		если маленькие тогда
			НаборЛевый = НаборЛевый + МаленькиеЛатинскиеБуквыЛевые;
			НаборПравый = НаборПравый + МаленькиеЛатинскиеБуквыПравые;
		КонецЕсли;
		если Большие тогда
			НаборЛевый = НаборЛевый + БольшиеЛатинскиеБуквыЛевые;
			НаборПравый = НаборПравый + БольшиеЛатинскиеБуквыПравые;
		КонецЕсли;
		если Цифры тогда
			НаборЛевый = НаборЛевый + ЦифрыЛевые;
			НаборПравый = НаборПравый + ЦифрыПравые;
		КонецЕсли;
		если Знаки тогда
			НаборЛевый = НаборЛевый + ЗнакиЛатинскиеЛевые;
			НаборПравый = НаборПравый + ЗнакиЛатинскиеПравые;
		КонецЕсли;
	КонецЕсли;
	
	НовыйПароль = "";
	Для НомерСимвола = 1 По Длина Цикл
		если НомерСимвола%2=0 тогда			
			ТекущийНабор = НаборЛевый;
		иначе
			ТекущийНабор = НаборПравый;
		КонецЕсли;
		ДлинаНабора = СтрДлина(ТекущийНабор);
		НачальныйНомер = ГСЧ.СлучайноеЧисло(1, ДлинаНабора);
		символ = Сред(ТекущийНабор, НачальныйНомер, 1);
		НовыйПароль = НовыйПароль + Символ;
	КонецЦикла;
		
	Возврат НовыйПароль;
КонецФункции
	
Функция ПолучитьСтатусПользователяB2B(ПользовательB2B) Экспорт
	//Не Опубликован И ID заполнено - отличается
	Если НЕ ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID <> 0 Тогда
		ЦветСтатуса = Новый Цвет(255, 255, 200);
		ТекстСтатуса = "Отличается на В2В";
	//Не Опубликован И ID = 0 - Еще не публиковался
	ИначеЕсли НЕ ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID = 0 Тогда
		ЦветСтатуса = Новый Цвет(200, 240, 255);
		ТекстСтатуса = "Не опубликован";
	//Опубликован И ID = 0 - Удален
	ИначеЕсли ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID = 0 Тогда
		ЦветСтатуса = Новый Цвет(255, 150, 150);
		ТекстСтатуса = "Удален на В2В";
	ИначеЕсли ПользовательB2B.Блокировка Тогда
		ЦветСтатуса = Новый Цвет(200, 255, 200);
		ТекстСтатуса = "Заблокирован";
	Иначе
		НЗ = РегистрыСведений.уб_СвязкаВ2ВПользователиГруппы.СоздатьНаборЗаписей();
		СправочникПользовательB2B = Справочники.уб_ПользователиB2B;
		НЗ.Отбор.Пользователь.Установить(СправочникПользовательB2B.НайтиПоКоду(ПользовательB2B.код));
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда
			ЦветСтатуса = Новый Цвет(240, 220, 255);
			ТекстСтатуса = "Групп неопределено";
		Иначе
			ЦветСтатуса = Новый Цвет();
			ТекстСтатуса = "Опубликован";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("ЦветСтатуса, ТекстСтатуса", ЦветСтатуса, ТекстСтатуса);
КонецФункции

Функция ПолучитьСтатусМассиваПользователейB2B(Массив) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(уб_ПользователиB2B.JoomlaID) КАК JoomlaID,
	|	МАКСИМУМ(уб_ПользователиB2B.Опубликован) КАК Опубликован,
	|	МАКСИМУМ(уб_ПользователиB2B.Блокировка) КАК Блокировка,
	|	уб_ПользователиB2B.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(уб_СвязкаВ2ВПользователиГруппы.ГруппаДоговоров) КАК Количество
	|ИЗ
	|	Справочник.уб_ПользователиB2B КАК уб_ПользователиB2B
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_СвязкаВ2ВПользователиГруппы КАК уб_СвязкаВ2ВПользователиГруппы
	|		ПО уб_СвязкаВ2ВПользователиГруппы.Пользователь = уб_ПользователиB2B.Ссылка
	|ГДЕ
	|	уб_ПользователиB2B.Ссылка В(&Массив)
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ПользователиB2B.Ссылка";
	Запрос.УстановитьПараметр("Массив", Массив);
	ПользовательB2B = Запрос.Выполнить().Выбрать();
	Соответсвие = Новый Соответствие;
	Пока ПользовательB2B.Следующий() Цикл
		//Не Опубликован И ID заполнено - отличается
		Если НЕ ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID <> 0 Тогда
			ЦветСтатуса = Новый Цвет(255, 255, 200);
			ТекстСтатуса = "Отличается на В2В";
			//Не Опубликован И ID = 0 - Еще не публиковался
		ИначеЕсли НЕ ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID = 0 Тогда
			ЦветСтатуса = Новый Цвет(200, 240, 255);
			ТекстСтатуса = "Не опубликован";
			//Опубликован И ID = 0 - Удален
		ИначеЕсли ПользовательB2B.Опубликован И ПользовательB2B.JoomlaID = 0 Тогда
			ЦветСтатуса = Новый Цвет(255, 150, 150);
			ТекстСтатуса = "Удален на В2В";
		ИначеЕсли ПользовательB2B.Блокировка Тогда
			ЦветСтатуса = Новый Цвет(200, 255, 200);
			ТекстСтатуса = "Заблокирован";
		Иначе
			Если ПользовательB2B.Количество = 0 Тогда
				ЦветСтатуса = Новый Цвет(240, 220, 255);
				ТекстСтатуса = "Групп неопределено";
			Иначе
				ЦветСтатуса = Новый Цвет();
				ТекстСтатуса = "Опубликован";
			КонецЕсли;
		КонецЕсли;
		Структура = Новый Структура("ЦветСтатуса, ТекстСтатуса", ЦветСтатуса, ТекстСтатуса);
		Соответсвие.Вставить(ПользовательB2B.Ссылка, Структура);
	КонецЦикла;
	Возврат Соответсвие;
	
КонецФункции

//Функция для проверки!
Функция Temp(id) Экспорт
	//СтруктураПользователя = ДайДанныеПоSid(sid);
	СписокId = уб_B2B.UnJSON(id);
	ПубликоватьОтчетыПоставщику = ПараметрыСеанса.уб_Константы.уб_ПубликоватьОтчетыПоставщикуПаb2b;
	РезультатОбъединения = Новый ТаблицаЗначений;
	РезультатОбъединения.Колонки.Добавить("path");
	
	Для Каждого СтрокаId Из СписокId Цикл
		//Разбиваем полученную строку на массив
		СтруктураПараметров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаId, "/");
		КоличествоПараметров = СтруктураПараметров.Количество();
	
		Если КоличествоПараметров = 1 Тогда
			МассивПервогоПараметра		= ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров[0]);
			КоличествоПервогоПараметра	= МассивПервогоПараметра.Количество();
			
			//Это файл
			Если КоличествоПервогоПараметра = 1 Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
				|			ТОГДА """"
				|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
				|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
				|ИЗ
				|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				|ГДЕ
				|	уб_ФайлыКПолисам.УИД = &УИД
				|	И уб_ФайлыКПолисам.Размещен
				|	И ВЫБОР
				|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
				|		КОНЕЦ");
									  
				Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
				Запрос.УстановитьПараметр("УИД", СтрокаId);
				Рез = Запрос.Выполнить().Выгрузить();
			//Это путь папки 1 уровня Поставщик-ОргАгент
			Иначе
				ПараметрПоставщик	= МассивПервогоПараметра[0];
				ПараметрОргАгент	= МассивПервогоПараметра[1];
				
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
				|			ТОГДА """"
				|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
				|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
				|ИЗ
				|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				|ГДЕ
				|	ВЫБОР
				|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
				|		КОНЕЦ
				|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
				|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
				|	И уб_ФайлыКПолисам.Размещен");
				Запрос.УстановитьПараметр("Поставщик", ПараметрПоставщик);
				Запрос.УстановитьПараметр("ОрганизацияАгент", ПараметрОргАгент);
				Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
				Рез = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
		//Это путь папки 2 уровня Поставщик-ОргАгент/дата
		ИначеЕсли КоличествоПараметров = 2 Тогда
			МассивПервогоПараметра		= ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураПараметров[0]);
			ПараметрПоставщик	= МассивПервогоПараметра[0];
			ПараметрОргАгент	= МассивПервогоПараметра[1];
			ДатаНачала = Дата("20" + СтруктураПараметров[1] + "01");
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ
			|	И уб_ФайлыКПолисам.СтраховойПолис.ОрганизацияАгент.Код = &ОрганизацияАгент
			|	И уб_ФайлыКПолисам.СтраховойПолис.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И уб_ФайлыКПолисам.СтраховойПолис.Поставщик.Код = &Поставщик
			|	И уб_ФайлыКПолисам.Размещен");
			
			Запрос.УстановитьПараметр("ДатаНач",ДатаНачала);
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ДатаНачала));					  
								  
			Запрос.УстановитьПараметр("Поставщик", ПараметрПоставщик);
			Запрос.УстановитьПараметр("ОрганизацияАгент", ПараметрОргАгент);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Рез = Запрос.Выполнить().Выгрузить();
		//Это путь папки 3 уровня Поставщик-ОргАгент/дата/СП
		ИначеЕсли КоличествоПараметров = 3 Тогда
            НовыйУИД = Новый УникальныйИдентификатор(СтруктураПараметров[2]);
			ПараметрСП	= Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
			Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
				ПараметрСП	= Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	уб_ФайлыКПолисам.Размещен
			|	И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
			|	И ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ");
			
			Запрос.УстановитьПараметр("СтраховойПолис", ПараметрСП);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Рез = Запрос.Выполнить().Выгрузить();
			
		//Это путь папки 4 уровня Поставщик-ОргАгент/дата/СП/Вид
		ИначеЕсли КоличествоПараметров = 4 Тогда
			НовыйУИД = Новый УникальныйИдентификатор(СтруктураПараметров[2]);
			ПараметрСП	= Документы.уб_СтраховойПолис.ПолучитьСсылку(НовыйУИД);
			Если Не ЗначениеЗаполнено(ПараметрСП.Дата) Тогда
				ПараметрСП	= Документы.уб_ОтчетПоставщику.ПолучитьСсылку(НовыйУИД);
				ЗначениеПараметра = СтруктураПараметров[3];
			Иначе
				ЗначениеПараметра = Перечисления.уб_ВидыФайловB2B[СтрЗаменить(СтруктураПараметров[3], " ", "_")];
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уб_ФайлыКПолисам.Хранилище.Путь, """") = """"
			|			ТОГДА """"
			|		ИНАЧЕ уб_ФайлыКПолисам.Хранилище.Путь + ""\""
			|	КОНЕЦ + уб_ФайлыКПолисам.ПутьКПапке + ""\"" + уб_ФайлыКПолисам.ФайлИмя КАК path
			|ИЗ
			|	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
			|ГДЕ
			|	уб_ФайлыКПолисам.Размещен
			|	И уб_ФайлыКПолисам.СтраховойПолис = &СтраховойПолис
			|	И ВЫБОР
			|			КОГДА уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|				ТОГДА ПОДСТРОКА(уб_ФайлыКПолисам.УИД, 1, 8) = &Параметр
			|			ИНАЧЕ уб_ФайлыКПолисам.ВидДокумента.ВидФайлаB2B = &Параметр
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &ПубликоватьОтчетыПоставщику = ИСТИНА
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ уб_ФайлыКПолисам.СтраховойПолис ССЫЛКА Документ.уб_ОтчетПоставщику
			|		КОНЕЦ");
			
			Запрос.УстановитьПараметр("СтраховойПолис", ПараметрСП);
			Запрос.УстановитьПараметр("Параметр", ЗначениеПараметра);
			Запрос.УстановитьПараметр("ПубликоватьОтчетыПоставщику", ПубликоватьОтчетыПоставщику = Истина);
			Рез = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		Для Каждого строка Из Рез Цикл
			НовСтр = РезультатОбъединения.Добавить();
			НовСтр.path = строка.path;
		КонецЦикла;

	КонецЦикла;
	
	Возврат уб_B2B.JSON(РезультатОбъединения);
КонецФункции
