
#Если Клиент Тогда
Процедура ОбновитьПараметрыСеансаПользователя() Экспорт

	ТекстРезультата = "";
	
	ПолныеПрава.УстановитьИзменяемыеПараметрыСеансаПользователя(Истина, ТекстРезультата);
	
	ТекстРезультата = "Обновление системной информации завершено успешно!" + Символы.ПС + Символы.ПС + "Протокол обновления:" + Символы.ПС + " " + СокрЛП(ТекстРезультата);
	Предупреждение(ТекстРезультата);

КонецПроцедуры
#КонецЕсли

///////////////////////////////////////////////////////////////////////
//Функции работы со строками
///////////////////////////////////////////////////////////////////////

Функция ПерваяЗаглавная(Знач Стр) Экспорт
	Стр = СокрЛП(Стр);
	Возврат Врег(Сред(Стр, 1, 1)) + Сред(Стр, 2);
КонецФункции

//ВЫделяет первое слово из строки. Если строка не содержит слов, возвращает пустую строку
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

// Возвращает головную организацию для заданной организации
// Если для организации реквизит ГоловнаяОрганизация не заполнен 
// это значит, что сама организация является голвной
//
// Параметры
//  Организация – СправочникСсылка.Организации
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   СправочникСсылка.Организации
//
Функция ГоловнаяОрганизация(Организация) Экспорт

	Если Организация.Пустая() ИЛИ Организация.ГоловнаяОрганизация.Пустая() Тогда
		Возврат Организация;
	Иначе
		Возврат Организация.ГоловнаяОрганизация;
	КонецЕсли;

КонецФункции // ГоловнаяОрганизация()

Функция ПолучитьРабочуюДату() Экспорт
	
	#Если Клиент Тогда
		Дата = РабочаяДата;
	#Иначе
		Дата = ТекущаяДата();
	#КонецЕсли
	
	Возврат Дата;
	
КонецФункции // ПолучитьРабочуюДату()

// Проверяет дату на заполненность по аналогии с системной функцией "ПустаяСтрока".
// 
Функция ПустаяДата(ПроверяемаяДата) Экспорт
	
	Если ТипЗнч(ПроверяемаяДата) = Тип("Дата") 
	   И ПроверяемаяДата = Дата(1,1,1) Тогда	   
		Возврат Истина;		
	Иначе
		Возврат Ложь;		
	КонецЕсли;
	
КонецФункции // ПустаяДата()

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

// функция из исходной строки формирует строку для поиска данных в запросе
Функция СформироватьСтрокуДляПоискаВЗапросе(Знач СтрокаПоиска) Экспорт
	
	ИтоговаяСтрокаДляПоиска = СтрокаПоиска;
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "~", "~~");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "%", "~%");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "_", "~_");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "[", "~[");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "-", "~-");

	Возврат ИтоговаяСтрокаДляПоиска;
	
КонецФункции

Функция MD5Хэш(Знач стрСтрока) Экспорт
	
	Попытка
		objHashedData = Новый COMОбъект("CAPICOM.HashedData");
		objHashedData.Algorithm = 3; //MD5
		objHashedData.Hash(стрСтрока);
		Возврат objHashedData.Value;
	Исключение
		//COMОбъект не зарегистрирован
	КонецПопытки;
	
КонецФункции

Функция ПолучитьТранслит(Текст) Экспорт
	Рез = СокрЛП(Текст);
	Тек = 0; //0 - пустая строка, 1 - кириллица, 2 - латиница
	Если СтрДлина(Рез) > 0 Тогда		
		РусАлфавит = "аАбБвВгГдДеЕёЁжЖзЗиИйЙкКлЛмМнНоОпПрРсСтТуУфФхХцЦчЧшШщЩъЪыЫьЬэЭюЮяЯ";
		
		ОбщиеСимволы 		= "0123456789 .,;*";
		ПервыйСимвол = Лев(Рез, 1);
		Для Счетчик = 2 По СтрДлина(Рез) Цикл
			Если Найти(ОбщиеСимволы,ПервыйСимвол) = 0 Тогда
				Прервать;
			КонецЕсли;
			ПервыйСимвол = Сред(Рез, Счетчик, 1);
		КонецЦикла;
		
		Если Найти(РусАлфавит, ПервыйСимвол) <> 0 Тогда
			Тек = 1;
		Иначе
			Тек = 2;
		КонецЕсли;	
	КонецЕсли;
	Если Тек = 1 Тогда
		Рез = СтрЗаменить(Рез,"а","a");
		Рез = СтрЗаменить(Рез,"б","b");
		Рез = СтрЗаменить(Рез,"в","v");
		Рез = СтрЗаменить(Рез,"г","g");
		Рез = СтрЗаменить(Рез,"дж","j");
		Рез = СтрЗаменить(Рез,"ДЖ","J");
		Рез = СтрЗаменить(Рез,"дЖ","J");
		Рез = СтрЗаменить(Рез,"Дж","J");
		Рез = СтрЗаменить(Рез,"д","d");
		Рез = СтрЗаменить(Рез,"е","e");
		Рез = СтрЗаменить(Рез,"ё","e");
		Рез = СтрЗаменить(Рез,"ж","zh");//?
		Рез = СтрЗаменить(Рез,"з","z");
		Рез = СтрЗаменить(Рез,"и","i");
		Рез = СтрЗаменить(Рез,"й","y");
		Рез = СтрЗаменить(Рез,"к","k");
		Рез = СтрЗаменить(Рез,"л","l");
		Рез = СтрЗаменить(Рез,"м","m");
		Рез = СтрЗаменить(Рез,"н","n");
		Рез = СтрЗаменить(Рез,"о","o");
		Рез = СтрЗаменить(Рез,"п","p");
		Рез = СтрЗаменить(Рез,"р","r");
		Рез = СтрЗаменить(Рез,"с","s");
		Рез = СтрЗаменить(Рез,"т","t");
		Рез = СтрЗаменить(Рез,"у","u");
		Рез = СтрЗаменить(Рез,"ф","f");
		Рез = СтрЗаменить(Рез,"х","h");
		Рез = СтрЗаменить(Рез,"ц","c");
		Рез = СтрЗаменить(Рез,"ч","ch"); //?
		Рез = СтрЗаменить(Рез,"ш","sh");//?
		Рез = СтрЗаменить(Рез,"щ","sch");//?
		Рез = СтрЗаменить(Рез,"ъ","'");
		Рез = СтрЗаменить(Рез,"ы","i");		
		Рез = СтрЗаменить(Рез,"ь","'");
		Рез = СтрЗаменить(Рез,"э","e");
		Рез = СтрЗаменить(Рез,"ю","u");//?				
		Рез = СтрЗаменить(Рез,"я","j");//?		
		Рез = СтрЗаменить(Рез,"А","A");
		Рез = СтрЗаменить(Рез,"Б","B");
		Рез = СтрЗаменить(Рез,"В","V");
		Рез = СтрЗаменить(Рез,"Г","G");
		Рез = СтрЗаменить(Рез,"Д","D");
		Рез = СтрЗаменить(Рез,"Е","E");
		Рез = СтрЗаменить(Рез,"Ё","E");
		Рез = СтрЗаменить(Рез,"Ж","ZH");//?
		Рез = СтрЗаменить(Рез,"З","Z");
		Рез = СтрЗаменить(Рез,"И","I");
		Рез = СтрЗаменить(Рез,"Й","Y");
		Рез = СтрЗаменить(Рез,"К","K");
		Рез = СтрЗаменить(Рез,"Л","L");
		Рез = СтрЗаменить(Рез,"М","M");
		Рез = СтрЗаменить(Рез,"Н","N");
		Рез = СтрЗаменить(Рез,"О","O");
		Рез = СтрЗаменить(Рез,"П","P");
		Рез = СтрЗаменить(Рез,"Р","R");
		Рез = СтрЗаменить(Рез,"С","S");
		Рез = СтрЗаменить(Рез,"Т","T");
		Рез = СтрЗаменить(Рез,"У","U");
		Рез = СтрЗаменить(Рез,"Ф","F");
		Рез = СтрЗаменить(Рез,"Х","H");
		Рез = СтрЗаменить(Рез,"Ц","C");
		Рез = СтрЗаменить(Рез,"Ч","CH");//?
		Рез = СтрЗаменить(Рез,"Ш","SH");//?
		Рез = СтрЗаменить(Рез,"Щ","SCH");//?
		Рез = СтрЗаменить(Рез,"Ъ","'");
		Рез = СтрЗаменить(Рез,"Ы","I");
		Рез = СтрЗаменить(Рез,"Ь","'");			
		Рез = СтрЗаменить(Рез,"Э","E");
		Рез = СтрЗаменить(Рез,"Ю","U");//?
		Рез = СтрЗаменить(Рез,"Я","J");//?		
	ИначеЕсли Тек = 2 Тогда
		Рез = СтрЗаменить(Рез,"a","а");
		Рез = СтрЗаменить(Рез,"b","б");
		Рез = СтрЗаменить(Рез,"c","ц");
		Рез = СтрЗаменить(Рез,"d","д");
		Рез = СтрЗаменить(Рез,"e","е");
		Рез = СтрЗаменить(Рез,"f","ф");
		Рез = СтрЗаменить(Рез,"g","г");
		Рез = СтрЗаменить(Рез,"h","х");
		Рез = СтрЗаменить(Рез,"i","и");
		Рез = СтрЗаменить(Рез,"j","я");//?
		Рез = СтрЗаменить(Рез,"k","к");
		Рез = СтрЗаменить(Рез,"l","л");
		Рез = СтрЗаменить(Рез,"m","м");
		Рез = СтрЗаменить(Рез,"n","н");
		Рез = СтрЗаменить(Рез,"o","о");
		Рез = СтрЗаменить(Рез,"p","п");
		Рез = СтрЗаменить(Рез,"q","к");//?
		Рез = СтрЗаменить(Рез,"r","р");
		Рез = СтрЗаменить(Рез,"s","с");
		Рез = СтрЗаменить(Рез,"t","т");
		Рез = СтрЗаменить(Рез,"u","ю");//?
		Рез = СтрЗаменить(Рез,"v","в");
		Рез = СтрЗаменить(Рез,"w","в");
		Рез = СтрЗаменить(Рез,"x","х");//?
		Рез = СтрЗаменить(Рез,"y","й");//?
		Рез = СтрЗаменить(Рез,"z","з");
		Рез = СтрЗаменить(Рез,"A","А");
		Рез = СтрЗаменить(Рез,"B","Б");
		Рез = СтрЗаменить(Рез,"C","Ц");
		Рез = СтрЗаменить(Рез,"D","Д");
		Рез = СтрЗаменить(Рез,"E","Е");
		Рез = СтрЗаменить(Рез,"F","Ф");
		Рез = СтрЗаменить(Рез,"G","Г");
		Рез = СтрЗаменить(Рез,"H","Х");
		Рез = СтрЗаменить(Рез,"I","И");
		Рез = СтрЗаменить(Рез,"J","Я");//?
		Рез = СтрЗаменить(Рез,"K","К");
		Рез = СтрЗаменить(Рез,"L","Л");
		Рез = СтрЗаменить(Рез,"M","М");
		Рез = СтрЗаменить(Рез,"N","Н");
		Рез = СтрЗаменить(Рез,"O","О");
		Рез = СтрЗаменить(Рез,"P","П");
		Рез = СтрЗаменить(Рез,"Q","К");//?
		Рез = СтрЗаменить(Рез,"R","Р");
		Рез = СтрЗаменить(Рез,"S","С");
		Рез = СтрЗаменить(Рез,"T","Т");
		Рез = СтрЗаменить(Рез,"U","Ю");
		Рез = СтрЗаменить(Рез,"V","В");
		Рез = СтрЗаменить(Рез,"W","В");
		Рез = СтрЗаменить(Рез,"X","Х");//?
		Рез = СтрЗаменить(Рез,"Y","Й");//?
		Рез = СтрЗаменить(Рез,"Z","З");		
	КонецЕсли;
	Возврат(Рез);	
	
КонецФункции

//Функция ПереводРаскладки(Текст) Экспорт
//	
//	РусскаяРаскладка 	= "йцукенгшщзхъфывапролджэячсмитьбю.ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ";
//	ЛатинскаяРаскладка 	= "qwertyuiop[]asdfghjkl;'zxcvbnm,./QWERTYUIOP[]ASDFGHJKL;'ZXCVBNM,.";
//	ОбщиеСимволы 		= "0123456789 .,;*";
//	ПервыйСимвол = Лев(Текст, 1);
//	Для Счетчик = 2 По СтрДлина(Текст) Цикл
//		Если Найти(ОбщиеСимволы,ПервыйСимвол) = 0 Тогда
//			Прервать;
//		КонецЕсли;
//		ПервыйСимвол = Сред(Текст, Счетчик, 1);
//	КонецЦикла;
//	ТекущаяРаскладкаРусская = Найти(РусскаяРаскладка,ПервыйСимвол) > 0;
//	ЛеваяРаскладка = ?(ТекущаяРаскладкаРусская, РусскаяРаскладка, ЛатинскаяРаскладка);
//	ПраваяРаскладка = ?(ТекущаяРаскладкаРусская, ЛатинскаяРаскладка, РусскаяРаскладка);
//	Возврат РегламентированнаяОтчетность.ЗаменитьОдниСимволыДругими(ЛеваяРаскладка,Текст,ПраваяРаскладка);
//	
//КонецФункции

Функция ПроверитьВозможностьИспользованияПолнотекствогоПоиска()
	
	Результат = Ложь;
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		//ИндексАктуален = ДобавитьМесяц(ТекущаяДата(), - 1) < ПолнотекстовыйПоиск.ДатаАктуальности();
		//Если ИндексАктуален Тогда
		//	Результат = Истина;
		//КонецЕсли;
		Если ПолнотекстовыйПоиск.ДатаАктуальности() <> '00010101000000' Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура АвтоПодборТекстаСТранслитом(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ИмяСправочника, Владелец = Неопределено) Экспорт
	
	ТекстДляПоиска = СокрЛП(Текст);
	ДлинаТекста = СтрДлина(ТекстДляПоиска);
	Если ДлинаТекста < 3 Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ТекстВДругойРаскладке = уб_Фильтры.ПеревестиСтроку(ТекстДляПоиска);
	ТранслитТекстДляПоиска = ОбщегоНазначения.ПолучитьТранслит(ТекстДляПоиска);
	ТранслитТекстВДругойРаскладке = ОбщегоНазначения.ПолучитьТранслит(ТекстВДругойРаскладке);
	Результат = ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец);
	Выборка = Результат.Выбрать();
	Количество = Выборка.Количество();
	Если Выборка.Следующий() Тогда
		Если Количество = 1 Тогда
			Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
			Форма.ОповеститьОВыборе(Выборка.Ссылка);
		Иначе
			ТекстАвтоПодбора = Выборка.Наименование;
		КонецЕсли;
	ИначеЕсли ПроверитьВозможностьИспользованияПолнотекствогоПоиска() Тогда
		
		Если ДлинаТекста < 4 Тогда
			КоличествоОтличий = "#1";
		Иначе
			КоличествоОтличий = "#2";
		КонецЕсли;
				
		ПоискПолнотекстовый = ТекстДляПоиска + "* OR " + ТекстВДругойРаскладке + "* OR " + ТекстДляПоиска + КоличествоОтличий + " OR " + ТекстВДругойРаскладке + КоличествоОтличий;
		Список = ВыполнитьПолнотекстовыйПоискВСправочнике(ПоискПолнотекстовый, ИмяСправочника, 30, Владелец);
		//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		//ТекстСРезультатомПоиска = ТекстДляПоиска;
		//ТранслитТекстаСРезультатомПоиска = ТранслитТекстДляПоиска;
		//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		Если Список <> Неопределено Тогда
			Количество = Список.Количество();
			
			ЭлементСписка = Список.Получить(0);
			Если Количество = 1 Тогда
				Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
				Форма.ОповеститьОВыборе(ЭлементСписка.Значение);
			Иначе
				ЭлементСпискаПодходящийПредставление = ЭлементСписка.Представление;
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				//ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
				//СчетчикПодходящихЭлементов = 0;
				//Для Каждого ЭлементСписка Из Список Цикл
				//	ЭлементСпискаПредставление = ЭлементСписка.Представление;
				//	Если Нрег(ТекстСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Или Нрег(ТранслитТекстаСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Тогда
				//		СчетчикПодходящихЭлементов = СчетчикПодходящихЭлементов + 1;
				//		Если СчетчикПодходящихЭлементов = 1 Или СтрДлина(ЭлементСпискаПредставление) < СтрДлина(ЭлементСпискаПодходящийПредставление) Тогда
				//			ЭлементСпискаПодходящийПредставление = ЭлементСпискаПредставление;
				//			ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
				//		КонецЕсли;
				//	КонецЕсли;
				//КонецЦикла;
				//Если СчетчикПодходящихЭлементов = 1 Тогда
				//	Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
				//	Форма.ОповеститьОВыборе(ЭлементСпискаПодходящийЗначение);
				//Иначе
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
					Если СтрДлина(ЭлементСпискаПодходящийПредставление) > ДлинаТекста Тогда
						ТекстАвтоПодбора = ЭлементСпискаПодходящийПредставление;
					КонецЕсли;
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос	
				//КонецЕсли;
				//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец, ОграничениеКоличества = 30)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ " + СтрЗаменить(Строка(ОграничениеКоличества),Символы.НПП, "") + "
	|	Спр.Ссылка,
	|	Спр.Наименование,
	|	Спр.Код
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Спр
	|ГДЕ
	|	1 = 1 И (Спр.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &НаименованиеТранслит + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &ПереводРаскладки + ""%""
	|			ИЛИ Спр.Наименование ПОДОБНО ""%"" + &ПереводРаскладкиТранслит + ""%"")";	
	Запрос.УстановитьПараметр("Наименование", ТекстДляПоиска);
	Запрос.УстановитьПараметр("НаименованиеТранслит", ТранслитТекстДляПоиска);
	Запрос.УстановитьПараметр("ПереводРаскладки", ТекстВДругойРаскладке);
	Запрос.УстановитьПараметр("ПереводРаскладкиТранслит", ТранслитТекстВДругойРаскладке);
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Спр.Владелец В (&Владелец)");
		Если ТипЗнч(Владелец) <> Тип("СписокЗначений") Тогда
			ПараметрВладелец = Новый СписокЗначений;
			ПараметрВладелец.Добавить(Владелец);
		Иначе
			ПараметрВладелец = Владелец;
		КонецЕсли;
		Запрос.УстановитьПараметр("Владелец", ПараметрВладелец);
	КонецЕсли;
	Возврат Запрос.Выполнить();
КонецФункции
	
Процедура ОкончаниеВводаТекстаСТранслитом(Элемент, Текст, Значение, СтандартнаяОбработка, ИмяСправочника, Владелец = Неопределено) Экспорт
	
	ТекстДляПоиска = СокрЛП(Текст);
	ДлинаТекста = СтрДлина(ТекстДляПоиска);
	Если ДлинаТекста < 3 Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ТекстВДругойРаскладке = уб_Фильтры.ПеревестиСтроку(ТекстДляПоиска);
	ТранслитТекстДляПоиска = ОбщегоНазначения.ПолучитьТранслит(ТекстДляПоиска);
	ТранслитТекстВДругойРаскладке = ОбщегоНазначения.ПолучитьТранслит(ТекстВДругойРаскладке);
	
	Результат = ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец);
	Выборка = Результат.Выбрать();
	Количество = Выборка.Количество();
	
	Если Количество = 1 Тогда		
		Если Выборка.Следующий() Тогда
			Значение = Выборка.Ссылка;				
		КонецЕсли;
	ИначеЕсли Количество > 1 Тогда
		Значение = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			Значение.Добавить(Выборка.Ссылка, Выборка.Наименование + " (" + Выборка.Код + ")");
		КонецЦикла;
		Значение.СортироватьПоПредставлению();//!переделать на упорядочивание в запросе!
	ИначеЕсли ПроверитьВозможностьИспользованияПолнотекствогоПоиска() Тогда
		
		Если ДлинаТекста < 4 Тогда
			КоличествоОтличий = "#1";
		Иначе
			КоличествоОтличий = "#2";
		КонецЕсли;
		
		ПоискПолнотекстовый = ТекстДляПоиска + "* OR " + ТекстВДругойРаскладке + "* OR " + ТекстДляПоиска + КоличествоОтличий + " OR " + ТекстВДругойРаскладке + КоличествоОтличий;
		Список = ВыполнитьПолнотекстовыйПоискВСправочнике(ПоискПолнотекстовый, ИмяСправочника, 30, Владелец);
		//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		//ТекстСРезультатомПоиска = ТекстДляПоиска;
		//ТранслитТекстаСРезультатомПоиска = ТранслитТекстДляПоиска;
		//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		Если Список <> Неопределено Тогда
			Количество = Список.Количество();
			ЭлементСписка = Список.Получить(0);
			Если Количество = 1 Тогда
				Значение = ЭлементСписка.Значение;
			Иначе
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				//СчетчикПодходящихЭлементов = 0;
				//ЭлементСпискаПодходящийПредставление = ЭлементСписка.Представление;
				//ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
				//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				Значение = Новый СписокЗначений;
				Для Каждого ЭлементСписка Из Список Цикл
					Значение.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление + " (" + ЭлементСписка.Значение.Код + ")");
					//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
					//ЭлементСпискаПредставление = ЭлементСписка.Представление;
					//Если Нрег(ТекстСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Или Нрег(ТранслитТекстаСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Тогда
					//	СчетчикПодходящихЭлементов = СчетчикПодходящихЭлементов + 1;
					//	Если СчетчикПодходящихЭлементов = 1 Или СтрДлина(ЭлементСпискаПредставление) < СтрДлина(ЭлементСпискаПодходящийПредставление) Тогда
					//		ЭлементСпискаПодходящийПредставление = ЭлементСпискаПредставление;
					//		ЭлементСпискаПодходящийЗначение = ЭлементСписка.Значение;
					//	КонецЕсли;
					//КонецЕсли;
					//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				КонецЦикла;
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				//Если СчетчикПодходящихЭлементов = 1 Тогда
				//	Значение = ЭлементСпискаПодходящийЗначение;
				//	Форма = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, Элемент);
				//	Форма.ОповеститьОВыборе(ЭлементСпискаПодходящийЗначение);
				//Иначе
				//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
					Значение.СортироватьПоПредставлению();
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос	
				//КонецЕсли;
				//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокЭлементовСправочникаПоОтборуСТранслитом(Знач Текст, ИмяСправочника, Владелец = Неопределено, ОграничениеКоличества = 30, ИндексЗапуска = 1) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	ТекстДляПоиска = СокрЛП(Текст);
	ДлинаТекста = СтрДлина(ТекстДляПоиска);
	Если ДлинаТекста < ИндексЗапуска Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекстВДругойРаскладке = уб_Фильтры.ПеревестиСтроку(ТекстДляПоиска);
	ТранслитТекстДляПоиска = ОбщегоНазначения.ПолучитьТранслит(ТекстДляПоиска);
	ТранслитТекстВДругойРаскладке = ОбщегоНазначения.ПолучитьТранслит(ТекстВДругойРаскладке);
	
	Результат = ПолучитьРезультатЗапросаПоиска(ИмяСправочника, ТекстДляПоиска, ТранслитТекстДляПоиска, ТекстВДругойРаскладке, ТранслитТекстВДругойРаскладке, Владелец, ОграничениеКоличества);
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокЗначений.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЦикла;
		
	ИначеЕсли ПроверитьВозможностьИспользованияПолнотекствогоПоиска() Тогда
		
		Если ДлинаТекста < 4 Тогда
			КоличествоОтличий = "#1";
		Иначе
			КоличествоОтличий = "#2";
		КонецЕсли;
		
		ПоискПолнотекстовый = ТекстДляПоиска + "* OR " + ТекстВДругойРаскладке + "* OR " + ТекстДляПоиска + КоличествоОтличий + " OR " + ТекстВДругойРаскладке + КоличествоОтличий;
		Список = ВыполнитьПолнотекстовыйПоискВСправочнике(ПоискПолнотекстовый, ИмяСправочника, ОграничениеКоличества, Владелец);
		//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		//ТекстСРезультатомПоиска = ТекстДляПоиска;
		//ТранслитТекстаСРезультатомПоиска = ТранслитТекстДляПоиска;
		//СписокПодходящихЭлементов = Новый СписокЗначений;
		//СчетчикПодходящихЭлементов = 0;
		//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		Если Список <> Неопределено Тогда
			Для Каждого ЭлементСписка Из Список Цикл
				ЭлементСпискаПредставление = ЭлементСписка.Представление;
				ЭлементСпискаЗначение = ЭлементСписка.Значение;
				//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				//Если Нрег(ТекстСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Или Нрег(ТранслитТекстаСРезультатомПоиска) = Нрег(Лев(ЭлементСпискаПредставление,ДлинаТекста)) Тогда
				//	СписокПодходящихЭлементов.Добавить(ЭлементСпискаЗначение, ЭлементСпискаПредставление);
				//КонецЕсли;
				//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
				СписокЗначений.Добавить(ЭлементСпискаЗначение, ЭлементСпискаПредставление);
			КонецЦикла;
		КонецЕсли;
		//+Не актуально, если Перед Полнотекстовым поискам выполняется запрос
		//Если СписокПодходящихЭлементов.Количество() > 0 Тогда
		//	СписокЗначений = СписокПодходящихЭлементов;
		//КонецЕсли;
		//-Не актуально, если Перед Полнотекстовым поискам выполняется запрос
	КонецЕсли;
	Возврат СписокЗначений;
	
КонецФункции

//Возвращает список если поиск дал результат, иначе возвращает Неопределено
Функция ВыполнитьПолнотекстовыйПоискВСправочнике(Знач Текст, ИмяСправочника = "", РазмерПорции = 30, Владелец = Неопределено) Экспорт
	
	Результат = Неопределено;
	//ДлинаТекста = СтрДлина(Текст);
	//Если ДлинаТекста < 4 Тогда
	//	КоличествоОтличий = "#1";
	//Иначе
	//	КоличествоОтличий = "#2";
	//КонецЕсли;
	//Текст = Текст + КоличествоОтличий;
	ВладелецМассив = ТипЗнч(Владелец) = Тип("Массив");
	Список = ПолнотекстовыйПоиск.СоздатьСписок(Текст, РазмерПорции);
	Если ТипЗнч(ИмяСправочника) = Тип("Массив") Тогда
		Список.ОбластьПоиска = ИмяСправочника;
	ИначеЕсли Не ПустаяСтрока(ИмяСправочника) Тогда
		МассивОтбор = Новый Массив();
		МассивОтбор.Добавить(Метаданные.Справочники[ИмяСправочника]);
		Список.ОбластьПоиска = МассивОтбор;
	КонецЕсли;
	Попытка
		Список.ПерваяЧасть();
		
		Количество = Список.Количество();
		Если Количество > 0 Тогда
			СписокРезультата = Новый СписокЗначений;
			Для Счетчик = 1 По Количество Цикл
				ЭлементСписка = Список.Получить(Количество - Счетчик);
				Если Найти(ЭлементСписка.Описание,"Наименование:") <> 0 Тогда
					Если Владелец <> Неопределено Тогда
						Если ВладелецМассив Тогда
							Если Владелец.Найти(ЭлементСписка.Значение.Владелец) = Неопределено Тогда
								Продолжить;
							КонецЕсли;
						ИначеЕсли ЭлементСписка.Значение.Владелец <> Владелец Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					СписокРезультата.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
				КонецЕсли;
			КонецЦикла;
			
			Если СписокРезультата.Количество() > 0 Тогда
				Результат = СписокРезультата;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Результат;
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ВАЛЮТАМИ

// Эта функция пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон
//
// Параметры:      
//	Сумма          - сумма, которую следует пересчитать;
//	ВалютаНач      - ссылка на элемент справочника Валют;
//                   определяет валюты из которой надо пересчитвать;
//	ВалютаКон      - ссылка на элемент справочника Валют;
//                   определяет валюты в которую надо пересчитвать;
// 	ПоКурсуНач     - курс из которого надо пересчитать;
// 	ПоКурсуКон     - курс в который надо пересчитать;
// 	ПоКратностьНач - кратность из которого надо пересчитать (по умолчанию = 1);
// 	ПоКратностьКон - кратность в который надо пересчитать  (по умолчанию = 1);
//
// Возвращаемое значение: 
//  Сумма, пересчитанная в другую валюту
//
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	                               ПоКратностьНач = 1, ПоКратностьКон = 1 ) Экспорт

	Если (ВалютаНач = ВалютаКон) Тогда

		// Считаем, что пересчет не нужен.
		Возврат Сумма;

	КонецЕсли;

	Если (ПоКурсуНач     = ПоКурсуКон) 
	   и (ПоКратностьНач = ПоКратностьКон) Тогда

		// ну, тут и считать нечего...
		Возврат Сумма;

	КонецЕсли;

	Если ПоКурсуНач     = 0 
	 или ПоКурсуКон     = 0 
	 или ПоКратностьНач = 0 
	 или ПоКратностьКон = 0 Тогда
		СообщитьОбОшибке("Процедура ""ПересчитатьИзВалютыВВалюту()"": при пересчете обнаружен нулевой курс.");
		Возврат 0;

	КонецЕсли;

	Возврат Окр((Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач), 2);

КонецФункции //ПересчитатьИзВалютыВВалюту()

// Возвращает курс валюты на дату
//
// Параметры:
//  Валюта     - Валюта (элемент справочника "Валюты")
//  ДатаКурса  - Дата, на которую следует получить курс
//
// Возвращаемое значение: 
//  Структура, содержащая:
//   Курс      - курс валюты
//   Кратность - кратность валюты
//
Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт

	Запись = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", Валюта));
   	Если ЗначениеЗаполнено(Валюта) И Запись.Курс=0 Тогда
		Сообщить("Не найден курс валюты '" + Строка(Валюта) + "' на дату: " + Строка(ДатаКурса) + "
		|Зайдите в справочник валют и обновите курс валюты за требуемый период.");	
	КонецЕсли;
	Возврат Запись;

КонецФункции // ПолучитьКурсВалюты()

Функция ПолучитьВалютуРубли() Экспорт
//В связи с тем, что код рубля может быть и 810 и 643 используем эту функцию	
	валРубли = Справочники.Валюты.НайтиПоКоду("643");
	Если ЗначениеНеЗаполнено(валРубли) Тогда
		валРубли = Справочники.Валюты.НайтиПоКоду("810");
		Если ЗначениеНеЗаполнено(валРубли) Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Возврат валРубли;
КонецФункции

Функция ПересчитатьВРубли(СуммаВВалюте, Валюта, ДатаКурса) Экспорт
	
	валРубли = ПолучитьВалютуРубли();
	Если Валюта = валРубли Тогда
		Возврат СуммаВВалюте;
	КонецЕсли;
	
	Запись = ПолучитьКурсВалюты(Валюта, ДатаКурса);
	
	Курс = ?(Запись.Курс=0,1,Запись.Курс);
	Кратность = ?(Запись.Кратность=0,1,Запись.Кратность);
	Возврат СуммаВВалюте * Курс / Кратность;
		
КонецФункции

// Определяет курс документа, который равен либо курсу документа (если в документе он существует),
// либо курсу взаиморасчетов, либо 1.
//
// Параметры: 
//  ДокументОбъект                 - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - курс документа.
//
Функция КурсДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		// Если валюта документа совпадает с валютой регл. учета, то курс 1.
		Если (ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) И (ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда
			
			МетаданныеДокумента = ДокументОбъект.Метаданные();
			
			// Если есть реквизит КурсДокумента - его и вернем
			Если ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КурсДокумента;
			КонецЕсли;
			
			// Если нет КурсДокумента и валюта документа не совпадает с валютой регл. учета, 
			// то такой документ может быть выписан только в валюте взаиморасчетов,
			// если есть реквизит КурсВзаиморасчетов - его и вернем.
			Если ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КурсВзаиморасчетов;
			КонецЕсли;
			
			// Если нет КурсВзаиморасчетов и валюта документа не совпадает с валютой регл. учета, 
			// то КурсВзаиморасчетов долежн быть в табличной части документа или может вообще отсутсвовать.
			// Тогда возьмем курс из справочника на дату документа.
			Возврат ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата).Курс;
			
		КонецЕсли;
	КонецЕсли;

	Возврат 1;

КонецФункции // КурсДокумента()

// Определяет кратность документа, которая равен либо кратности документа (если в документе она существует),
// либо кратности взаиморасчетов, либо 1.
//
// Параметры: 
//  ДокументОбъект - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - кратность валюты в документе.
//
Функция КратностьДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		// Если валюта документа совпадает с валютой регл. учета, то кратность 1.
		Если (ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) И (ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда
			
			// Если есть реквизит КратностьДокумента - его и вернем
			Если ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КратностьДокумента;
			КонецЕсли;
			
			// Если нет КратностьДокумента и валюта документа не совпадает с валютой регл. учета, 
			// то такой документ может быть выписан только в валюте взаиморасчетов,
			// если есть реквизит КратностьВзаиморасчетов - его и вернем.
			Если ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
				Возврат ДокументОбъект.КратностьВзаиморасчетов;
			КонецЕсли;
			
			// Если нет КратностьВзаиморасчетов и валюта документа не совпадает с валютой регл. учета, 
			// то КратностьВзаиморасчетов должна быть в табличной части документа или может вообще отсутсвовать.
			//Тогда возьмем Кратность из справочника на дату документа.
			Возврат ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата).Кратность;
			
		КонецЕсли;
    КонецЕсли;
	
	Возврат 1;

КонецФункции // КратностьДокумента()

// Проверяет наличие установленного курс аи кратности валюты на 1 января 1980 года.
// В случае отсутствия устанавливает курс и кратность равными единице.
//
// Параметры:
//  Валюта - ссылка на элемент справочника Валют
//
Процедура ПроверитьКорректностьКурсаНа01_01_1980(Валюта) Экспорт

	ДатаКурса = Дата(1980, 1, 1);
	СтруктураКурса = ПолучитьКурсВалюты(Валюта, ДатаКурса);

	Если (СтруктураКурса.Курс = 0) Или (СтруктураКурса.Кратность = 0) Тогда

		// установим курс и кратность = 1 на 01.01.1980, чтобы не было ошибок при создании документов

		РегистрКурсыВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();

		РегистрКурсыВалют.Период    = ДатаКурса;
		РегистрКурсыВалют.Валюта    = Валюта;
		РегистрКурсыВалют.Курс      = 1;
		РегистрКурсыВалют.Кратность = 1;
		РегистрКурсыВалют.Записать();

	КонецЕсли;

КонецПроцедуры // ПроверитьКорректностьКурсаНа01_01_1980()

//// Определяет коэффициент распределения
//// расходов по видам деятельности (ЕНВД / не ЕНВД) в детализации по номенклатурным группам.
//Функция РаспределениеРасходовПоВидамДеятельности(Организация, НачДата, КонДата) Экспорт
//	
//	// Расчет базы распределения
//	ТекстЗапроса = "ВЫБРАТЬ
//	|	ВЫБОР КОГДА ХозрасчетныйОбороты.Счет В (&СчетВыручкаЕНВД) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЕНВД,
//	|	ХозрасчетныйОбороты.Субконто1 КАК НоменклатурнаяГруппа,
//	|	СУММА(-(ХозрасчетныйОбороты.СуммаОборот)) КАК База
//	|ИЗ
//	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачГраница, &КонГраница, Период, Счет В ИЕРАРХИИ (&СчетаБазы), , Организация = &Организация) КАК ХозрасчетныйОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВЫБОР КОГДА ХозрасчетныйОбороты.Счет В (&СчетВыручкаЕНВД) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ,
//	|	ХозрасчетныйОбороты.Субконто1";
//	
//	//Массив счетов, по которым формируется база распределения расходов
//	СчетаБазы = Новый Массив;
//	СчетаБазы.Добавить(ПланыСчетов.Хозрасчетный.Выручка);
//	СчетаБазы.Добавить(ПланыСчетов.Хозрасчетный.Продажи_НДС);
//	СчетаБазы.Добавить(ПланыСчетов.Хозрасчетный.Продажи_Акцизы);
//	СчетаБазы.Добавить(ПланыСчетов.Хозрасчетный.Продажи_ЭкспортныеПошлины);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	Запрос.УстановитьПараметр("НачГраница",      НачДата);
//	Запрос.УстановитьПараметр("КонГраница",      КонДата);
//	Запрос.УстановитьПараметр("Организация",     Организация);
//	Запрос.УстановитьПараметр("СчетВыручкаЕНВД", ОбщегоНазначения.МассивСчетовВыручкиЕНВД());
//	Запрос.УстановитьПараметр("СчетаБазы",       СчетаБазы);
//	
//	//Убрать отрицательные значения
//	Результат = Запрос.Выполнить().Выгрузить();
//	
//	КолвоЭлементов = Результат.Количество(); 
//	Для ОбратныйИндекс = 1 По КолвоЭлементов Цикл
//		Строка = Результат[КолвоЭлементов - ОбратныйИндекс];
//		Если Строка.База <= 0 Тогда
//			Результат.Удалить(Строка);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции // БазаРаспределенияПоВыручке()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПИСИ НАБОРА КОНСТАНТ

// Записывает набор констант, сравнивая его с эталонным набором
// Записываются только те константы, которые были изменены относительно эталонного набора
//
// Параметры: 
//  НаборКонстант  - Набор констант
//  ЭталонныйНабор - Эталонный набор констант
//  Модифицированность - Устанавливается в истину, если операция выполнена успешно
//
// Возвращаемое значение:
//  Истина - операция выполнена, ложь - иначе.
//
Функция ЗаписатьНаборКонстант(НаборКонстант, ЭталонныйНабор, Модифицированность = Истина) Экспорт
	
	ЗаписываемыеКонстанты = "";
	Для каждого Константа Из Метаданные.Константы Цикл
		
		ИмяКонстанты = Константа.Имя;
		
		ЗначениеНабора    = ЗначениеВСтрокуВнутр(НаборКонстант[ИмяКонстанты]);
		ЭталонноеЗначение = ЗначениеВСтрокуВнутр(ЭталонныйНабор[ИмяКонстанты]);
		
		Если Не ЗначениеНабора = ЭталонноеЗначение Тогда
			
			ТекущееЗначение   = ЗначениеВСтрокуВнутр(Константы[ИмяКонстанты].Получить());
			
			Если Не ЗначениеНабора = ТекущееЗначение Тогда
				ЗаписываемыеКонстанты = ЗаписываемыеКонстанты + ?(ПустаяСтрока(ЗаписываемыеКонстанты), "", ", ") + ИмяКонстанты;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ЗаписываемыеКонстанты) Тогда
		
		ЗаписываемыйНабор = Константы.СоздатьНабор(ЗаписываемыеКонстанты);
		ЗаполнитьЗначенияСвойств(ЗаписываемыйНабор, НаборКонстант, ЗаписываемыеКонстанты);
		
		Попытка
			ЗаписываемыйНабор.Записать();
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		НаборКонстант.Прочитать();
		ЗаполнитьЗначенияСвойств(ЭталонныйНабор, НаборКонстант);
		
	КонецЕсли; 
	
	Модифицированность = Ложь;
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ НАЛИЧИЯ И ЗАПОЛНЕНИЯ РЕВИЗИТОВ

// Позволяет определить есть ли среди реквизитов документа реквизит с переданным именем.
// 
//Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт

	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции // ЕстьРеквизитДокумента()

// Позволяет определить есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  Объект - Документ-объект, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизит(ИмяРеквизита, Объект) Экспорт
    МетаданныеОбъекта = Объект.Метаданные();
	Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
КонецФункции // ЕстьРеквизитДокумента()

// Позволяет определить есть ли табличная часть документа с переданным именем.
//
// Параметры: 
//  ИмяТабЧасти - строковое имя искомой табличной части,
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьТабЧастьДокумента(ИмяТабЧасти, МетаданныеДокумента) Экспорт

	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 

КонецФункции // ЕстьТабЧастьДокумента()

// Позволяет определить есть ли среди реквизитов табличной части документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//  ИмяТабЧасти  - строковое имя табличной части документа, среди реквизитов которого производится поиск
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, МетаданныеДокумента, ИмяТабЧасти) Экспорт

	ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);

	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;

	Иначе
		Возврат НЕ (ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

	КонецЕсли;

КонецФункции // ЕстьРеквизитТабЧастиДокумента()

// Функция проверяет наличие в строке только цифр
//
// Параметры
//  СтрокаПроверки - Строка для проверки только цифр
//
// Возвращаемое значение:
//   Булево
//
Функция ТолькоЦифрыВСтроке(Знач СтрокаПроверки, УчитыватьЛидирующиеНули = Истина, УчитыватьПробелы = Истина) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		НомерПервойЦифры = 0;
		Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
			НомерПервойЦифры = НомерПервойЦифры + 1;
			КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
			Если КодСимвола <> 48 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, НомерПервойЦифры);
	КонецЕсли;
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Истина;
	
КонецФункции

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента(ДокументОбъект) Экспорт

	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();

	Если Не ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
	 Или НЕ ЗначениеЗаполнено(ДокументОбъект.Организация.Префикс) Тогда

		ДокументОбъект.УстановитьНовыйНомер("00");

	Иначе

		ДокументОбъект.УстановитьНовыйНомер(ДокументОбъект.Организация.Префикс);
        		
	КонецЕсли;
	
	//Если ЕстьРеквизитДокумента("НДСВключенВСтоимость", МетаданныеДокумента) И
	//	ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
	//	Если ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
	//		ДокументОбъект.НДСВключенВСтоимость = Истина;
	//	КонецЕсли;
	//КонецЕсли;


КонецПроцедуры // УстановитьНомерДокумента()

//TO DO Изменить функции!
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МЕХАНИЗМОМ ОТПРАВКИ СООБЩЕНИЙ В ОТДЕЛ ТЕХНИЧЕСКОЙ ПОДДЕРЖКИ ПОЛЬЗОВАТЕЛЕЙ

// Функнция проверяет заполнения обязательных параметров для отправки сообщения
//  в отдел технической поддержки.
//
// Параметры
//  ТаблицаДанных - Таблица значений
//
// Возвращаемое значение:
//   Булево - результат корректости проверки
//
Функция ПроверитьСтруктуруЗаполненияПараметровДляОтправкиСообщенияВОтделТехническойПоддержки(ТаблицаДанных, ПубликоватьСообщения = Истина) Экспорт

	ЗначениеПроверки = Истина;
	СтрокаЗаголовкаОшибки = "Не заполнены настройки для отправки сообщения.";
	
	СписокИменОбязательныхРеквизитов = Новый СписокЗначений;
	СписокИменОбязательныхРеквизитов.Добавить("ПараметрыОтправкиЭлектронногоСообщения_АдресЭлектроннойПочтыОтделаТехническойПоддержки");
	СписокИменОбязательныхРеквизитов.Добавить("ПараметрыОтправкиЭлектронногоСообщения_АдресЭлектроннойПочтыОтправителя");
	СписокИменОбязательныхРеквизитов.Добавить("ПараметрыОтправкиЭлектронногоСообщения_АдресCервераSMTP");
	СписокИменОбязательныхРеквизитов.Добавить("ПараметрыОтправкиЭлектронногоСообщения_ПортSMTP");
	СписокИменОбязательныхРеквизитов.Добавить("ОсновныеДанные_РегистрационныйНомерПрограммы");
	СписокИменОбязательныхРеквизитов.Добавить("Владелец_Организация");
	
	Для каждого СтрокаРаздела Из ТаблицаДанных Цикл
		Для каждого ЭлементЗначения Из СтрокаРаздела.ДанныеРаздела Цикл
			Если СписокИменОбязательныхРеквизитов.НайтиПоЗначению(ЭлементЗначения.Ключ) <> Неопределено И НЕ ЗначениеЗаполнено(ЭлементЗначения.Значение[1]) Тогда
				Если ПубликоватьСообщения Тогда
					СообщитьОбОшибке("Не указан """ + Лев(ЭлементЗначения.Значение[0], (СтрДлина(ЭлементЗначения.Значение[0]) - 1)) + """.",, СтрокаЗаголовкаОшибки);
				КонецЕсли; 
				ЗначениеПроверки = Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
	Возврат ЗначениеПроверки;

КонецФункции // ПроверитьСтруктуруЗаполненияПараметровДляОтправкиСообщенияВОтделТехническойПоддержки()

// Процедура формирует таблицу значений со структурой для заполнения данными
// с информацией обращения в отдел технической поддержки
//
// Параметры:
//  ТаблицаДанных - таблица значений для заполнения
//  ФормаНастройкиПараметров - общая форма настройки параметров для отправки в отдел технической поддержки
//
Процедура ЗаполнитьСтруктуруДанныхНастройкиОбращенияВОтделТехподдержкиПоУмолчанию(ТаблицаДанных, ФормаНастройкиПараметров = Неопределено) Экспорт

	// Структура данных - таблица значений:
	//  Колонки:
	//   ИмяРездела
	//   ПредставлениеРаздела
	//   ДанныеРаздела
	
	// Структура данных раздела
	//  Ключ - Имя значения настройки, как оно задано в форме настройки параметров обращения
	//  Значение - Массив значений
	// 
	// Массив значений:
	//  [0] - Представление наименования параметра для печати
	//  [1] - Значение параметра

	Если ТипЗнч(ТаблицаДанных) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаДанных = Новый ТаблицаЗначений;
	КонецЕсли;

	Если ТаблицаДанных.Колонки.Количество() = 0 Тогда

		ТаблицаДанных.Колонки.Добавить("ИндексСортировки"    , Новый ОписаниеТипов("Число"));
		ТаблицаДанных.Колонки.Добавить("ИмяРаздела"          , Новый ОписаниеТипов("Строка"));
		ТаблицаДанных.Колонки.Добавить("ПредставлениеРаздела", Новый ОписаниеТипов("Строка"));
		ТаблицаДанных.Колонки.Добавить("ДанныеРаздела"       , Новый ОписаниеТипов("Структура"));

		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "ПараметрыОтправкиЭлектронногоСообщения";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры отправки электронного сообщения";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "ОсновныеДанные";
		СтрокаРаздела.ПредставлениеРаздела = "Основные данные по использованию 1С:Предприятие 8.0 и конфигурации";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "Владелец";
		СтрокаРаздела.ПредставлениеРаздела = "Организация-пользователь";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "РаспределенныеБД";
		СтрокаРаздела.ПредставлениеРаздела = "Распределенные информационные базы данных (ИБ)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "ФайлСервер";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры компьютера (файл-сервер)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "SQLСервер";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры компьютера (SQL-сервер)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "СерверПредприятия";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры компьютера (сервер 1С:Предприятия)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "ТерминалСервер";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры компьютера (терминал-сервер)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "WebРасширение";
		СтрокаРаздела.ПредставлениеРаздела = "Параметры компьютера (Web-расширение)";
		
		СтрокаРаздела = ТаблицаДанных.Добавить();
		СтрокаРаздела.ИмяРаздела = "Внедрение";
		СтрокаРаздела.ПредставлениеРаздела = "Сведения о внедрении";
		
	КонецЕсли;

	Если ФормаНастройкиПараметров = Неопределено Тогда
		ФормаНастройкиПараметров = ПолучитьОбщуюФорму("НастройкаПараметровОбращенияВОтделТехническойПоддержки");
	КонецЕсли;

	ТаблицаДанных.Индексы.Добавить("ИмяРаздела");
	
	Для каждого ЭлементФормы Из ФормаНастройкиПараметров.ЭлементыФормы Цикл

		Если ТипЗнч(ЭлементФормы) <> Тип("ПолеВвода")
		   И ТипЗнч(ЭлементФормы) <> Тип("ПолеВыбора")
		   И ТипЗнч(ЭлементФормы) <> Тип("Флажок") Тогда
			Продолжить;
		КонецЕсли;

		ПозицияРазделителяРаздела = Найти(ЭлементФормы.Имя, "_");
		Если ПозицияРазделителяРаздела = 0 Тогда
			Продолжить;
		КонецЕсли;

		ИмяРаздела    = Сред(ЭлементФормы.Имя, 1, (ПозицияРазделителяРаздела - 1));
		СтрокаРаздела = ТаблицаДанных.Найти(ИмяРаздела, "ИмяРаздела");

		Если СтрокаРаздела = Неопределено Тогда

			СтрокаРаздела = ТаблицаДанных.Добавить();
			СтрокаРаздела.ИмяРаздела = ИмяРаздела;

			Попытка
				СтрокаРаздела.ПредставлениеРаздела = ФормаНастройкиПараметров.ЭлементыФормы.ОсновнаяПанель.Страницы[ИмяРаздела].Заголовок;
				СтрокаРаздела.ИндексСортировки     = ФормаНастройкиПараметров.ЭлементыФормы.ОсновнаяПанель.Страницы.Индекс(ФормаНастройкиПараметров.ЭлементыФормы.ОсновнаяПанель.Страницы[ИмяРаздела]);
			Исключение
				СтрокаРаздела.ПредставлениеРаздела = ИмяРаздела;
			КонецПопытки;

		КонецЕсли;

		МассивЗначений = Новый Массив;

		Попытка

			Если ТипЗнч(ЭлементФормы) = Тип("Флажок") Тогда
				МассивЗначений.Добавить((ЭлементФормы.Заголовок + ":"));
			Иначе
				МассивЗначений.Добавить(ФормаНастройкиПараметров.ЭлементыФормы["Надпись_" + ЭлементФормы.Имя].Заголовок);
			КонецЕсли;

		Исключение
			МассивЗначений.Добавить(ЭлементФормы.Имя);
		КонецПопытки;

		МассивЗначений.Добавить("");

		СтрокаРаздела.ДанныеРаздела.Вставить(ЭлементФормы.Имя, МассивЗначений);

	КонецЦикла;

	ТаблицаДанных.Сортировать("ИндексСортировки ВОЗР");

КонецПроцедуры

// Функция формирует текст сообщения на линию техподдержки
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   Текст сообщения
//
Функция ПолучитьТекстСообщенияВОтделТехническойПоддержки() Экспорт

	ТекстВозврата = "";
	
	ТекстВозврата = ТекстВозврата + Символы.ПС;
	ТекстВозврата = ТекстВозврата + Символы.ПС;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "============ Сведения об использовании ПП 1С:Предприятие 8.0 ============";
	
	ТаблицаДанных = Константы.ПараметрыСообщенияПриОбращенииВОтделТехническойПоддержки.Получить().Получить();
	
	// Сформируем обязательный информационный раздел
	
	СистемИнфо = Новый СистемнаяИнформация;
	
	ТекстВозврата = ТекстВозврата + Символы.ПС;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "1. ДАННЫЕ ТЕКУЩЕГО КОМПЬЮТЕРА И КОНФИГУРАЦИИ";
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Версия 1С:Предприятия 8.0: " + СистемИнфо.ВерсияПриложения;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Конфигурация: "              + Метаданные.Синоним;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Версия конфигурации: "       + Метаданные.Версия;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Поставщик: "                 + Метаданные.Поставщик;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Операционная система: "      + СистемИнфо.ВерсияОС;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Оперативная память (МБ): "   + СистемИнфо.ОперативнаяПамять;
	ТекстВозврата = ТекстВозврата + Символы.ПС + "Процессор: "                 + СистемИнфо.Процессор;

	НомерСтрокиРаздела = 1;
	
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		
		Для каждого СтрокаТаблицыРаздела Из ТаблицаДанных Цикл
			
			СтрокаРаздела = "";
			
			Если СтрокаТаблицыРаздела.ИмяРаздела = "ПараметрыОтправкиЭлектронногоСообщения" Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого ЭлементЗначения Из СтрокаТаблицыРаздела.ДанныеРаздела Цикл
				Если НЕ ЗначениеЗаполнено(ЭлементЗначения.Значение[1]) Тогда
					Продолжить;
				КонецЕсли; 
				СтрокаРаздела = СтрокаРаздела + Символы.ПС + ЭлементЗначения.Значение[0] + " " + ?(ТипЗнч(ЭлементЗначения.Значение[1]) = Тип("Булево"), ?(ЭлементЗначения.Значение[1], "Да", "Нет"), ЭлементЗначения.Значение[1]);
			КонецЦикла; 
			
			Если НЕ ЗначениеЗаполнено(СтрокаРаздела) Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтрокиРаздела = НомерСтрокиРаздела + 1;
			
			СтрокаРаздела = Строка(НомерСтрокиРаздела) + ". " + ВРег(СтрокаТаблицыРаздела.ПредставлениеРаздела) + СтрокаРаздела;
			
			ТекстВозврата = ТекстВозврата + Символы.ПС;
			ТекстВозврата = ТекстВозврата + Символы.ПС + СтрокаРаздела;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТекстВозврата;

КонецФункции // ПолучитьТекстСообщенияВОтделТехническойПоддержки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ТИПАМИ

// Служебная функция, предназначенная для получения описания типов строки, заданной длины.
// 
// Параметры:
//  ДлинаСтроки - число, длина строки.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для строки указанной длины.
//
Функция ПолучитьОписаниеТиповСтроки(ДлинаСтроки) Экспорт

	Массив = Новый Массив; 
	Массив.Добавить(Тип("Строка"));

	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);

	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);

КонецФункции // ПолучитьОписаниеТиповСтроки()

// Служебная функция, предназначенная для получения описания типов числа, заданной разрядности.
// 
// Параметры:
//  Разрядность 			- число, разряд числа.
//  РазрядностьДробнойЧасти - число, разряд дробной части.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для числа указанной разрядности.
//
Функция ПолучитьОписаниеТиповЧисла(Разрядность,РазрядностьДробнойЧасти=0) Экспорт

	Массив = Новый Массив;

	Массив.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность,РазрядностьДробнойЧасти);

	Возврат Новый ОписаниеТипов(Массив, КвалификаторЧисла);

КонецФункции // ПолучитьОписаниеТиповЧисла() 

// Служебная функция, предназначенная для получения описания типов даты
// 
// Параметры:
//  ЧастиДаты - системное перечисление ЧастиДаты.
// 
Функция ПолучитьОписаниеТиповДаты(ЧастиДаты) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));

	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты);

	Возврат Новый ОписаниеТипов(Массив, , , КвалификаторДаты);

КонецФункции // ПолучитьОписаниеТиповДаты() 

Функция ПолучитьОписаниеТиповБулево() Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Булево"));
	Возврат Новый ОписаниеТипов(Массив);

КонецФункции // ПолучитьОписаниеТиповБулево()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ПЕРЕЧИСЛЕНИЯМИ

// Функция формирует список элементов перечисления
//
// Параметры
//  ИмяПеречисления - имя перечисления, как оно задано в конфигураторе
//
// Возвращаемое значение:
//   СписокЗначений - список элементов перечисления
//
Функция ПолучитьСписокЭлементовПеречисления(ИмяПеречисления) Экспорт

	СписокЭлементовПеречисления = Новый СписокЗначений;
	
	Попытка
		КоллекцияЭлементовПеречисления = Перечисления[ИмяПеречисления];
	Исключение
		Возврат СписокЭлементовПеречисления;
	КонецПопытки;
	
	Для каждого ЭлементПеречисления Из КоллекцияЭлементовПеречисления Цикл
		СписокЭлементовПеречисления.Добавить(ЭлементПеречисления, Строка(ЭлементПеречисления));
	КонецЦикла;
	
	Возврат СписокЭлементовПеречисления;

КонецФункции // ПолучитьСписокЭлементовПеречисления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МЕТАДАННЫМИ

// Функция возвращает имя табличной части, к которой принадлежит переданная строка
//
// Параметры
//  СтрокаТабличнойЧасти - ссылка на строку табличной части
//
// Возвращаемое значение:
//   Строка - имя табличной части, как оно задано в конфигураторе
//
Функция ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти) Экспорт

	Возврат Метаданные.НайтиПоТипу(ТипЗнч(СтрокаТабличнойЧасти)).Имя;

КонецФункции // ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку()

// Функция возвращает метаданные документа, которому принадлежит переданная строка
//
// Параметры
//  СтрокаТабличнойЧасти - ссылка на строку табличной части
//
// Возвращаемое значение:
//   Метаданные - метаданные документа, как оно задано в конфигураторе
//
Функция ПолучитьМетаданныеДокументаПоСсылкеНаСтроку(СтрокаТабличнойЧасти) Экспорт

	Возврат Метаданные.НайтиПоТипу(ТипЗнч(СтрокаТабличнойЧасти)).Родитель();

КонецФункции // ПолучитьМетаданныеДокументаПоСсылкеНаСтроку()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДВИЖЕНИЯМИ ДОКУМЕНТОВ

// Удаляет движения документа по указанному регистру либо по всем регистрам. 
//
// Параметры:
//  Движения	- коллекция движений документа.
//  ИмяРегистра - имя регистра, движения по которому будут удалены;
//				необязательный, если не указан - удаляются все движения.
//
Процедура УдалитьДвиженияДокумента(Движения,ИмяРегистра = "") Экспорт

	Если ИмяРегистра = "" Тогда
		Для Каждого ДвиженияРегистра Из Движения Цикл
			ДвиженияРегистра.Очистить();
		КонецЦикла;
	Иначе
		Движения[ИмяРегистра].Очистить();
	КонецЕсли;

КонецПроцедуры // УдалитьДвиженияДокумента()

// Процедура удаления существующих движений документа при перепроведении (отмене проведения)
Процедура УдалитьДвиженияРегистратора(ДокументОбъект, Отказ, РучнаяКорректировка = Ложь) Экспорт
	
	// получение списка регистров, по которым существуют движения
	ТаблицаДвижений = ПолныеПрава.ОпределитьНаличиеДвиженийПоРегистратору(ДокументОбъект.Ссылка);
	ТаблицаДвижений.Колонки.Добавить("НаборЗаписей");
		
	Для Каждого СтрокаДвижения ИЗ ТаблицаДвижений Цикл
		// имя регистра передается как значение, полученное с помощью
		// функции ПолноеИмя() метаданных регистра
		ПозицияТочки = Найти(СтрокаДвижения.Имя, ".");
		ТипРегистра = Лев(СтрокаДвижения.Имя, ПозицияТочки - 1);
		ИмяРегистра = СокрП(Сред(СтрокаДвижения.Имя, ПозицияТочки + 1));
		
		Если РучнаяКорректировка Тогда
			Набор = ДокументОбъект.Движения[ИмяРегистра];
			Набор.Прочитать();
			Набор.УстановитьАктивность(Ложь);
			
		Иначе
			ЕСли ТипРегистра = "РегистрНакопления" Тогда
				МетаданныеНабора = Метаданные.РегистрыНакопления[ИмяРегистра];
				Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
				
			ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда
				МетаданныеНабора = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
				Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
				
			ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
				МетаданныеНабора = Метаданные.РегистрыСведений[ИмяРегистра];
				Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
				
			ИначеЕсли ТипРегистра = "РегистрРасчета" Тогда
				МетаданныеНабора = Метаданные.РегистрыРасчета[ИмяРегистра];
				Набор = РегистрыРасчета[ИмяРегистра].СоздатьНаборЗаписей();
				
			КонецЕсли;
			
			Если НЕ ПравоДоступа("Изменение", МетаданныеНабора) Тогда
				// отсутствуют права на всю таблицу регистра
				СообщитьОбОшибке("Нарушение прав доступа", Отказ, СтрокаДвижения.Имя);
				Возврат;
			КонецЕсли;
			
			Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);			
			// набор не записывается сразу, чтобы не откатывать транзакцию, если впоследствии
			// выяснится, что на один из регистров не хватает прав.
		КонецЕсли;
		
		СтрокаДвижения.НаборЗаписей = Набор;		
		
	КонецЦикла;	
	
	Для Каждого СтрокаДвижения ИЗ ТаблицаДвижений Цикл		
		Попытка
			СтрокаДвижения.НаборЗаписей.Записать();
		Исключение
			// возможно «сработал» RLS или механизм даты запрета изменения
			СообщитьОбОшибке(ОписаниеОшибки(), Отказ, СтрокаДвижения.Имя);
			ВызватьИсключение "Операция не выполнена";
		КонецПопытки;
	КонецЦикла;
	
	Если (НЕ Отказ) И (НЕ РучнаяКорректировка) Тогда
		Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
			Если Движение.Количество() > 0 Тогда
				Движение.Очистить();
			КонецЕсли;
		КонецЦикла;
		Если НЕ ДокументОбъект.ПометкаУдаления Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ ДОКУМЕНТАМИ

Функция ПолучитьМассивПрефиксовРИБ() Экспорт
	
	МассивПрефиксов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	ПрефиксыИнформационныхБаз.Префикс КАК Префикс
	               |ИЗ
	               |	РегистрСведений.ПрефиксыИнформационныхБаз КАК ПрефиксыИнформационныхБаз";
	
	ВыборкаУзлов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		Если Не ПустаяСтрока(ВыборкаУзлов.Префикс) Тогда
			
			МассивПрефиксов.Добавить(ВыборкаУзлов.Префикс);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивПрефиксов;
	
КонецФункции

Функция СформироватьМассивПрефиксовДляРИБИОрганизации(Организация) Экспорт
	
	МассивПрефиксов = ПолучитьМассивПрефиксовРИБ();	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Префикс = СокрЛП(Организация.Префикс);
		
		Если Префикс <> "" Тогда
			МассивПрефиксов.Добавить(Префикс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивПрефиксов.Количество() = 0 Тогда
		МассивПрефиксов.Добавить("");
	КонецЕсли;
	
	Возврат МассивПрефиксов;
	
КонецФункции

// Процедура предназначена для преобразования номера документа.
//
// Параметры:
//  Документ - (ДокументСсылка), документ, чей номер надо получить для печати.
//
// Возвращаемое значение.
//  Строка - номер документа для печати
//
Функция ПолучитьНомерНаПечать(Документ, МассивПрефиксов = Неопределено) Экспорт

	Если Документ = Неопределено Тогда 
		Возврат 0;
	КонецЕсли;

	Номер   = СокрЛП(Документ.Номер);
	Префикс = "";
	Если МассивПрефиксов = Неопределено Тогда
		
		Организация = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ВыборкаИзРезультатаЗапроса")
			ИЛИ ТипЗнч(Документ) = Тип("Структура") Тогда

			Организация = Документ.Организация;
			
		Иначе

			МетаданныеДокумента = Документ.Метаданные();

			Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда

				Организация = Документ.Организация;

			КонецЕсли;

		КонецЕсли;
		
		МассивПрефиксовДляОбхода = СформироватьМассивПрефиксовДляРИБИОрганизации(Организация)
		
	Иначе
		
		МассивПрефиксовДляОбхода = МассивПрефиксов;
		
	КонецЕсли;
	
	Для Каждого ТекущийПрефикс ИЗ МассивПрефиксовДляОбхода Цикл
		
		// удаление префикса из номера документа
		Если Найти(Номер, ТекущийПрефикс)=1 Тогда 
			Номер = Сред(Номер, СтрДлина(ТекущийПрефикс)+1);
		КонецЕсли;
		
		// так же, может остаться "минус" впереди
		Если Лев(Номер, 1) = "-" Тогда
			Номер = Сред(Номер, 2);
		КонецЕсли;
		
		// удаление ведущих нулей
		Пока Лев(Номер, 1)="0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
	КонецЦикла;

	Возврат Номер;

КонецФункции // ПолучитьНомерНаПечать()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ОШИБКАМИ

// Функция убирает из текста сообщения слущебную информацию
//
// Параметры
//  ТекстСообщения, Строка, исходный текст сообщения//
// Возвращаемое значение:
//   Строка
//
Функция СформироватьТекстСообщения(Знач ТекстСообщения) Экспорт

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
						 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
						 
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);

КонецФункции // ()

Процедура СообщитьИнформациюПользователю(СтрокаСообщенияПользователю) Экспорт
	
	//#Если Клиент Тогда
	//Сообщить(СтрокаСообщенияПользователю);
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = СтрокаСообщенияПользователю;
	СообщениеПользователю.Сообщить();
	//#КонецЕсли
	
КонецПроцедуры

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
// В случае работы на клиенте или на сервере выводит в окно сообщений,
// в случае внешнего соединения вызывает исключение.
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения.
//  Отказ          - булево, признак отказа (необязательный).
//
Процедура СообщитьОбОшибке(Знач ТекстСообщения, Отказ = Ложь, Заголовок = "", Знач Статус = Неопределено) Экспорт

	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Важное;
	КонецЕсли;
	
	ТекстСообщения = СформироватьТекстСообщения(ТекстСообщения);
	Отказ = Истина;
	
	#Если ВнешнееСоединение Тогда
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
			Заголовок = "";
		КонецЕсли;
		
		ВызватьИсключение (ТекстСообщения);
		
	#Иначе
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			//Сообщить(Заголовок);
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = Заголовок;
			СообщениеПользователю.Сообщить();
			Заголовок = "";
		КонецЕсли;
		
		//Сообщить(ТекстСообщения, Статус);
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Сообщить();
		глПоследняяОшибка = ТекстСообщения;
	#КонецЕсли
	
КонецПроцедуры // СообщитьОбОшибке()

Функция ПосмотретьОшибку()Экспорт
	//!!! Исправить!!!
	//ТекстОшибки = глПоследняяОшибка;
	ТекстОшибки = "";
	Возврат ТекстОшибки;
КонецФункции	

Функция ВопросПерезаполнитьКУДиР() Экспорт
	
	Ответ = Ложь;
	
	#Если Клиент Тогда
		ТекстВопроса = 
		"Отражение платежа в Книге учета доходов и расходов настроено вручную.
		|Перезаполнить показатели Книги учета доходов и расходов?";
		
		Ответ = (Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да);
	#КонецЕсли
	
	Возврат Ответ;
	
КонецФункции

// Формирует сообщение при ошибках проведения документов.
//
// Параметры: 
//  ТекстСообщения - Исходный текст, выводимого сообщения,
//  Отказ          - Флаг отказа в проведении докумета,
//  Заголовок      - Заголовок начала серии сообщений об ошибках проведения (не обязательный)
//
Процедура ОшибкаПриПроведении(ТекстСообщения, Отказ, Заголовок="", Статус = Неопределено) Экспорт

	СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок, Статус);

КонецПроцедуры // ОшибкаПриПроведении()

// Формирует строку представления документа для сообщений при проведении.
//
// Параметры
//  Документ - ссылка на проводимый документ.
//
// Возвращаемое значение
//  Строка с представлением документа.
//
Функция ПредставлениеДокументаПриПроведении(Документ) Экспорт

	МетаданныеДокумента = Документ.Метаданные();

	ВидОперацииСтр = "";

	Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента) Тогда
		ВидОперацииСтр = " (" + Документ.ВидОперации + ")";
	КонецЕсли;

	Возврат "Проведение документа: " + СокрЛП(Документ) + ВидОперацииСтр;

КонецФункции // ПредставлениеДокументаПриПроведении()

// Проверяет принадлежность документа к видам учета
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	Перем Бух, Нал, УСН;

	Бух     = Истина;
	Если не СтруктураШапкиДокумента.Свойство("ОтражатьВБухгалтерскомУчете",    Бух) тогда
		Бух = Истина;
	КонецЕсли;
	ЕстьНал = СтруктураШапкиДокумента.Свойство("ОтражатьВНалоговомУчете",    Нал);
	ЕстьУСН = СтруктураШапкиДокумента.Свойство("ОтражатьВНалоговомУчетеУСН", УСН);

	Если Бух <> Истина И Нал <> Истина И УСН <> Истина Тогда
		ОшибкаПриПроведении("Документ должен принадлежать хотя бы одному из видов учета: ""Бухгалтерский"" и (или)  ""Налоговый"".", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  ДокументОбъект             - объект проводимого документа, 
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапкиДокумента(ДокументОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок) Экспорт

	ТипыПланыСчетов     = ПланыСчетов.ТипВсеСсылки();
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().Реквизиты;

	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = ДокументОбъект[КлючЗначение.Ключ];
		ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();

		Если НЕ ЗначениеЗаполнено(Значение) Тогда 

			Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда //
				СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;

			ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);

		ИначеЕсли ТипыПланыСчетов.СодержитТип(ТипЗнч(Значение)) тогда

			Если Значение.ЗапретитьИспользоватьВПроводках Тогда
				СтрокаСообщения = "Реквизит """ + СокрЛП(ПредставлениеРеквизита) + """ : счет " + СокрЛП(Значение)+" """ + Значение.Наименование + """ нельзя использовать в проводках.";
				ОшибкаПриПроведении(СтрокаСообщения, Отказ, Заголовок);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если СтруктураОбязательныхПолей.Свойство("Организация") и СтруктураОбязательныхПолей.Свойство("ДоговорКонтрагента") тогда

		// Если в документе есть организация и договор - провести проверку на соответствие
		//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
		Организация = ДокументОбъект.Организация;
		ДоговорКонтрагента = ДокументОбъект.ДоговорКонтрагента;
		Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") тогда
			ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапкиДокумента()
// Проверяет, что организация в документе совпадает с организацией, указанной в договоре взаиморасчетов.
//  при несовпадении устанавливается флаг отказа в проведении.
//
// Параметры:
//  Организация           - ссылка на организацию, выбранную в документе,
//  ДоговорКонтрагента - ссылка на договор, выбранный в документе,
//  ДоговорОрганизация    - ссылка на Организацию, выбранную в договоре,
//  Отказ                 - флаг отказа в проведении.
//  Заголовок             - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, 
	                                                             ДоговорОрганизация, Отказ, Заголовок) Экспорт

	// Если не заполнен договор или организация, то не ругаемся.
	Если ЗначениеЗаполнено(Организация) 
	   И ЗначениеЗаполнено(ДоговорКонтрагента)
	   И Организация <> ДоговорОрганизация Тогда

	   уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Выбран договор контрагента, не соответствующий организации, указанной в документе!","Сообщить");
	   //ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов()

// Проверяет правильность заполнения строк табличной части документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
//
// Параметры:
//  ДокументОбъект             - объект проводимого документа, 
//  ИмяТабличнойЧасти          - табличная часть документа,
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, 
                                            Отказ, Заголовок) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	ТабличнаяЧасть      = ДокументОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	//Если (НЕ МетаданныеРеквизиты.Найти("СчетДоходовБУ") = Неопределено)
	//	И (НЕ МетаданныеРеквизиты.Найти("СчетРасходовБУ") = Неопределено) Тогда
	//	ПроверятьВидДеятельности = Истина;
	//Иначе
		ПроверятьВидДеятельности = Ложь;
	//КонецЕсли;
	
	КэшСчетов = Новый Соответствие;
	
	// Цикл по строкам табличной части.
	Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";
			
		// Цикл по проверяемым полям
		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если НЕ ЗначениеЗаполнено(Значение) Тогда 

				Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда //
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";

				Иначе
					СтрокаСообщения = КлючЗначение.Значение;

				КонецЕсли;

				ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);

			КонецЕсли;

		КонецЦикла;
		
		//Если ПроверятьВидДеятельности Тогда
		//	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы["СчетДоходовБУ"]) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы["СчетРасходовБУ"]) Тогда
		//		//Один из счетов не заполнен, соответствие не проверяется
		//	Иначе			
		//		СчетДоходовБУВСтроке = СтрокаТаблицы["СчетДоходовБУ"];
		//		СчетДоходовБУЕНВД = КэшСчетов[СчетДоходовБУВСтроке];
		//		Если СчетДоходовБУЕНВД = Неопределено Тогда
		//			СчетДоходовБУЕНВД = ОтноситсяКДеятельностиЕНВД(СчетДоходовБУВСтроке);
		//			КэшСчетов[СчетДоходовБУВСтроке] = СчетДоходовБУЕНВД;					
		//		КонецЕсли;
		//		
		//		СчетРасходовБУВСтроке = СтрокаТаблицы["СчетРасходовБУ"];
		//		СчетРасходовБУЕНВД = КэшСчетов[СчетРасходовБУВСтроке];
		//		Если СчетРасходовБУЕНВД = Неопределено Тогда
		//			СчетРасходовБУЕНВД = ОтноситсяКДеятельностиЕНВД(СчетРасходовБУВСтроке);
		//			КэшСчетов[СчетРасходовБУВСтроке] = СчетРасходовБУЕНВД;
		//		КонецЕсли;
		//		
		//		Если НЕ СчетДоходовБУЕНВД = СчетРасходовБУЕНВД Тогда
		//			СтрокаСообщения = "Счета доходов и расходов для бухгалтерского учета относятся к разным видам деятельности!"; 
		//			ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		//		КонецЕсли;
		//	КонецЕсли;
		//Конецесли;

	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧасти()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ТАБЛИЦАМИ

// Проверяет наличие требуемых данных в источнике и Формирует таблицу значений
//
// Параметры
//  Источник  – ТаблицаЗначений или ТабличнаяЧасть или КоллекцияСтрокДереваЗначений с исходными данными
//
//  Реквизиты – структура – Структура реквизитов. 
//							Ключ 		- Наименование колонки в источнике
//							Значение    - Наименование колонки в получаемой ТЗ
//							Если значение опущено - приравнивается ключу.
//	ПолучитьНомерСтрокиДокумента - булево
//	                        Используется только при выгрузке из табличной части документа.
//							В формируемой таблице создает новую колонку "НомерСтрокиДокумента"
//								и заполняет её реальными номерами строк
//
//  КоллекцияКолонокДереваЗначений - только для коллекции строк дерева значений.
// Возвращаемое значение:
//  Таблица значений или Неопределено (если не хватает реквизитов)
//
Функция СформироватьТаблицуЗначений(Источник,Реквизиты=Неопределено,ПолучитьНомерСтрокиДокумента = ложь,ФормироватьОтстутствующиеКолонки=Ложь,КоллекцияКолонокДереваЗначений=Неопределено) экспорт

	ЭтоТаблицаЗначений      = (ТипЗнч(Источник) = Тип("ТаблицаЗначений"));
	ЭтоСтрокиДереваЗначений = (ТипЗнч(Источник) = Тип("КоллекцияСтрокДереваЗначений"));

	Если ЭтоСтрокиДереваЗначений и КоллекцияКолонокДереваЗначений = Неопределено тогда
		Возврат Неопределено;
	Конецесли;

	Если НЕ ЗначениеЗаполнено(Реквизиты) тогда

		Если ЭтоТаблицаЗначений тогда

			НоваяТЗ = Источник.Скопировать();

			Возврат НоваяТЗ;

		ИначеЕсли ЭтоСтрокиДереваЗначений тогда

			Реквизиты = Новый Структура();

			Для каждого Колонка из КоллекцияКолонокДереваЗначений цикл
				Реквизиты.Вставить(Колонка.Имя);
			КонецЦикла;

		Иначе

			НоваяТЗ = Источник.Выгрузить();
			Возврат НоваяТЗ;

		КонецЕслИ;

	Конецесли;

	Если НЕ ЭтоТаблицаЗначений И НЕ ЭтоСтрокиДереваЗначений тогда
		РеквизитыТабличнойЧасти = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).Реквизиты;
	Конецесли;

	НоваяТЗ = Новый ТаблицаЗначений();

	Если не ЭтоТаблицаЗначений и ПолучитьНомерСтрокиДокумента тогда
		НоваяТЗ.Колонки.Добавить("НомерСтрокиДокумента",ПолучитьОписаниеТиповЧисла(5,0));
	КонецЕсли;

	Пока НоваяТЗ.Количество()<Источник.Количество() Цикл

		Строка = НоваяТЗ.Добавить();

		Если не ЭтоТаблицаЗначений и ПолучитьНомерСтрокиДокумента тогда
			Строка.НомерСтрокиДокумента = НоваяТЗ.Количество();
		КонецЕсли;

	КонецЦикла;

	Для каждого ТекРеквизит из Реквизиты Цикл

		ИскомыйРеквизит = ТекРеквизит.Ключ;
		НовыйРеквизит   = ?(ТекРеквизит.Значение = Неопределено,ТекРеквизит.Ключ,ТекРеквизит.Значение);

		Если ЭтоТаблицаЗначений тогда
			ИсточникКолонка = Источник.Колонки.Найти(ИскомыйРеквизит);

		ИначеЕсли ЭтоСтрокиДереваЗначений тогда
			ИсточникКолонка = КоллекцияКолонокДереваЗначений.Найти(ИскомыйРеквизит);

		Иначе
			ИсточникКолонка = РеквизитыТабличнойЧасти.Найти(ИскомыйРеквизит);

		Конецесли;

		Если ИсточникКолонка= неопределено тогда

			//недостаточно реквизитов
			Если ФормироватьОтстутствующиеКолонки тогда
				НоваяТЗ.Колонки.Добавить(НовыйРеквизит);
			Иначе
				Возврат Неопределено;
			КонецЕсли;

		Иначе
			НоваяТЗ.Колонки.Добавить(НовыйРеквизит);
			НоваяТЗ.ЗагрузитьКолонку(Источник.ВыгрузитьКолонку(ИскомыйРеквизит),НовыйРеквизит);

		Конецесли;

	КонецЦикла;

	Возврат НоваяТЗ;

КонецФункции // СформироватьТаблицуЗначений()

Процедура ДополнитьКолонкиТаблицыЗначений(ТаблицаБазовая,ТаблицаДополнений) Экспорт

	Для каждого Колонка из ТаблицаДополнений.Колонки Цикл

		Если Не(ТаблицаБазовая.Колонки.Найти(Колонка.Имя) = Неопределено) тогда
			//Колонка уже есть
			Продолжить;
		КонецЕсли;

		ТаблицаБазовая.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения,Колонка.Заголовок,Колонка.Ширина);

	КонецЦикла;

КонецПроцедуры

// Добавляет в таблицу значений строки из другой таблицы значений и 
// в них значения колонок с совпадающими наименованиями.
//
// Параметры:
//  ТаблицаИсточник - таблица значений, откуда берутся значения.
//  ТаблицаПриемник - таблица значений, куда добавляются строки.
//
Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник) Экспорт

	Для каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл

		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);

	КонецЦикла;

КонецПроцедуры // ЗагрузитьВТаблицуЗначений()

Функция ПолучитьПустуюТаблицуЗначенийДляЗаполенинияПоЗаписиРегистраСведений(ИмяРегистраСведений) Экспорт
	//Возвращает ТЗ. Имена полей - все измерения, реквизиты и ресурсы.
	МР = Метаданные.РегистрыСведений[ИмяРегистраСведений];
	ТЗ = Новый ТаблицаЗначений;
	Для каждого Измерение Из МР.Измерения Цикл
		ТЗ.Колонки.Добавить(Измерение.Имя,Измерение.Тип, Измерение.Синоним);
	КонецЦикла;
	Для каждого Ресурс Из МР.Ресурсы Цикл
		ТЗ.Колонки.Добавить(Ресурс.Имя,Ресурс.Тип, Ресурс.Синоним);
	КонецЦикла;
	Для каждого Реквизит Из МР.Реквизиты Цикл
		ТЗ.Колонки.Добавить(Реквизит.Имя,Реквизит.Тип, Реквизит.Синоним);
	КонецЦикла;
	Возврат ТЗ;
КонецФункции

Функция ПолучитьСтруктуруИзЗаписиРегистраСведений(ИмяРегистраСведений, МЗ = Неопределено) Экспорт
	//Возвращает структуру, в которой имена полей - все измерения, реквизиты и ресурсы.
	//Если передан менеджер записи - МЗ, то структура заполняется значениями 
	МР = Метаданные.РегистрыСведений[ИмяРегистраСведений];
	СтруктураМЗ = Новый Структура();
	Для каждого Измерение Из МР.Измерения Цикл
		СтруктураМЗ.Вставить(Измерение.Имя, ?(МЗ = Неопределено,Неопределено,МЗ[Измерение.Имя]));
	КонецЦикла;
	Для каждого Ресурс Из МР.Ресурсы Цикл
		СтруктураМЗ.Вставить(Ресурс.Имя, ?(МЗ = Неопределено,Неопределено,МЗ[Ресурс.Имя]));
	КонецЦикла;
	Для каждого Реквизит Из МР.Реквизиты Цикл
		СтруктураМЗ.Вставить(Реквизит.Имя, ?(МЗ = Неопределено,Неопределено,МЗ[Реквизит.Имя]));
	КонецЦикла;
	
	Возврат СтруктураМЗ;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С СТРУКТУРАМИ

Функция ВыгрузитьСтруктуруВСтроку(Структура,ПоЗначениям = Ложь,СтруктураПроверки = Неопределено) Экспорт

	НеПроверять = (СтруктураПроверки = Неопределено);
	НоваяСтрока = "";

	Для каждого Колонка из Структура Цикл

		Если НеПроверять тогда
			НоваяСтрока = НоваяСтрока + ?(НЕ ЗначениеЗаполнено(Колонка.Значение)или не ПоЗначениям,Колонка.Ключ,Колонка.Значение)+",";

		ИначеЕсли СтруктураПроверки.Свойство(?(НЕ ЗначениеЗаполнено(Колонка.Значение) или не ПоЗначениям,Колонка.Ключ,Колонка.Значение)) тогда
			НоваяСтрока = НоваяСтрока + ?(НЕ ЗначениеЗаполнено(Колонка.Значение),Колонка.Ключ,Колонка.Значение)+",";

		Иначе
			//Нет в проверке!
			Возврат Ложь;

		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(НоваяСтрока) Тогда
		НоваяСтрока = Лев(НоваяСтрока,СтрДлина(НоваяСтрока)-1);
	КонецЕсли;

	Возврат НоваяСтрока;

КонецФункции // ВыгрузитьСтруктуруВСтроку

// Предназначена для получения пустого значения заданного типа:
//	примитивного, или ссылочного. Используется
//
// Параметры:
//	ЗаданныйТип   - тип, пустое значение которого нужно получить
//
Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт

	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;

КонецФункции // ПустоеЗначениеТипа();

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТАВКАМИ НАЛОГОВ И ВЗНОСОВ

//// Эта функция получает ставку взноса на страхование от несчастных случаев
////
//// Параметры:      
////	Организация - СправочникСсылка.Организации - организация для которой нужно получить ставку
////	ДатаАктуальности - дата на которую нужно получить ставку
////
//// Возвращаемое значение: 
////  Число - размер ставки, если ставка не задана - 0
////
//Функция ПолучитьСтавкуВзносаНаСтрахованиеОтНесчастныхСлучаев(Организация, ДатаАктуальности) Экспорт

//	Отбор = Новый Структура("Организация", Организация);

//	Возврат РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ДатаАктуальности, Отбор).Ставка/100;

//КонецФункции // ПолучитьСтавкуВзносаНаСтрахованиеОтНесчастныхСлучаев

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СЧЕТАМИ И СУБКОНТО

// Эта функция возвращает информацию о счете из переданного соответсвия
// Если в соответствии не найдена информация о счете - она подготавливается и 
// помещается в соответсвие
// Применяется для работы с формами в которых активно требуется получать 
// информащцию о счетах, например, при выводе строки табличного поля
//
// Параметры:      
//	СведенияОСчетах - соответсвие у котрого в качестве ключа - ПланСчетовСсылка, а 
//  				  в качестве значения - структура из 4-х элементов
//					  КоличествоСубконто - число
//                    ТипСубконто1 - описание типа
//                    ТипСубконто2 - описание типа
//                    ТипСубконто3 - описание типа
//					  ВидСубконто1Представление - представление вида субконто
//					  ВидСубконто2Представление - представление вида субконто
//					  ВидСубконто3Представление - представление вида субконто
//
//	Счет - ПланСчетовСсылка
//
// Возвращаемое значение:
//  Описанная выше структура
//
Функция ПолучитьСведенияОСчете(СведенияОСчетах, Счет) Экспорт

	СведенияОСчете = СведенияОСчетах[Счет];

	Если СведенияОСчете = Неопределено Тогда

		СведенияОСчете = Новый Структура("КоличествоСубконто, ВидСубконто1, ВидСубконто2, ВидСубконто3, ТипСубконто1, ТипСубконто2, ТипСубконто3, ВидСубконто1Представление, ВидСубконто2Представление, ВидСубконто3Представление");

		СведенияОСчете.КоличествоСубконто = Счет.ВидыСубконто.Количество();

		Если СведенияОСчете.КоличествоСубконто > 0 Тогда

			ВидСубконто = Счет.ВидыСубконто[0].ВидСубконто;

			СведенияОСчете.ВидСубконто1              = ВидСубконто;
			СведенияОСчете.ТипСубконто1              = ВидСубконто.ТипЗначения;
			СведенияОСчете.ВидСубконто1Представление = ВидСубконто.Наименование;

		КонецЕсли;

		Если СведенияОСчете.КоличествоСубконто > 1 Тогда

			ВидСубконто = Счет.ВидыСубконто[1].ВидСубконто;

			СведенияОСчете.ВидСубконто2              = ВидСубконто;
			СведенияОСчете.ТипСубконто2              = ВидСубконто.ТипЗначения;
			СведенияОСчете.ВидСубконто2Представление = ВидСубконто.Наименование;

		КонецЕсли;

		Если СведенияОСчете.КоличествоСубконто > 2 Тогда

			ВидСубконто = Счет.ВидыСубконто[2].ВидСубконто;

			СведенияОСчете.ВидСубконто3              = ВидСубконто;
			СведенияОСчете.ТипСубконто3              = ВидСубконто.ТипЗначения;
			СведенияОСчете.ВидСубконто3Представление = ВидСубконто.Наименование;

		КонецЕсли;

		СведенияОСчетах[Счет] = СведенияОСчете;

	КонецЕсли;

	Возврат СведенияОСчете;

КонецФункции  // ПолучитьСведенияОСчете

// Выполняет в табличном поле приведение значений субконто к типу, соответствующему счету
// сведения о счете передаются через параметр СведенияОСчете
// используется для табличных полей, содержащих колонки типа Счет и соответствующие ему субконто
//
// Параметры:
//	ТабличноеПоле 	- табличное поле 
//  ДтКт 			- строка "Дт", "Кт" или "" - часть имени колонки табличного поля
// 					для колонок табличного поля поддерживаются имена 
//					типа СубконтоДт1, СубконтоКт1, Субконто1...
//  СведенияОСчете 	- структура
//					  КоличествоСубконто - число
//                    ТипСубконто1 - описание типа
//                    ТипСубконто2 - описание типа
//                    ТипСубконто3 - описание типа
//					  ВидСубконто1Представление - представление вида субконто - в данной процедуре не используется
//					  ВидСубконто2Представление - представление вида субконто - в данной процедуре не используется
//					  ВидСубконто3Представление - представление вида субконто - в данной процедуре не используется
//
Процедура ПривестиЗначениеСубконто(ТабличноеПоле, ДтКт, СведенияОСчете) Экспорт

	Для СчетчикСубконто = 1 По 3 Цикл

		Если СведенияОСчете.КоличествоСубконто >= СчетчикСубконто Тогда
			ТабличноеПоле.ТекущиеДанные["Субконто"+ДтКт+СчетчикСубконто] = СведенияОСчете["ТипСубконто"+СчетчикСубконто].ПривестиЗначение(ТабличноеПоле.ТекущиеДанные["Субконто"+ДтКт+СчетчикСубконто]);

		Иначе
			ТабличноеПоле.ТекущиеДанные["Субконто"+ДтКт+СчетчикСубконто] = Неопределено;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры   // ПривестиЗначениеСубконто

// Назначает видимость ячейкам строки табличного поля, соответствующим субконто
// в зависимлсти от счета. Сведения о счете передаются через параметр СведенияОСчете
// Используется для табличных полей, содержащих колонки типа Счет и соответствующие ему субконто
// при выводе строки
//
// Параметры:
//	ОформлениеСтроки 	- оформление строки
//  ДтКт 				- строка "Дт", "Кт" или "" - часть имени колонки табличного поля
// 						для колонок табличного поля поддерживаются имена 
//						типа СубконтоДт1, СубконтоКт1, Субконто1...
//  СведенияОСчете 		- структура
//					  	КоличествоСубконто - число
//                    	ТипСубконто1 - описание типа
//                    	ТипСубконто2 - описание типа
//                    	ТипСубконто3 - описание типа
//					    ВидСубконто1Представление - представление вида субконто - в данной процедуре не используется
//					    ВидСубконто2Представление - представление вида субконто - в данной процедуре не используется
//					    ВидСубконто3Представление - представление вида субконто - в данной процедуре не используется
//
Процедура НазначитьВидимостьСубконто(ОформлениеСтроки, ДтКт, СведенияОСчете) Экспорт

	Для СчетчикСубконто = 1 По 3 Цикл
		ОформлениеСтроки.Ячейки["Субконто"+ДтКт+СчетчикСубконто].Видимость = СведенияОСчете.КоличествоСубконто >= СчетчикСубконто;
		ОформлениеСтроки.Ячейки["Субконто"+ДтКт+СчетчикСубконто].ТолькоПросмотр = НЕ СведенияОСчете.КоличествоСубконто >= СчетчикСубконто;
	КонецЦикла;

КонецПроцедуры

// Узнаем нужно ли что то перезаполнять и если нужно, то нужно ли задавать вопрос
//Процедура устанавливает два параметра: 
//ЗаполнятьСчета - метка о том нужно ли вообще что-либо перезаполнять
//ЗадаватьВопрос - в том случае если надо перезаполнять, то надо ли задавать вопрос
//				   о перезаполнении, если вопрос не будет задаваться то счета будет перезаполняться автом.
Процедура ПроверитьНеобходимостьПерезаполненияСчетовУчета(ДокументОбъект, СтруктураОбязательныхПолей,СтруктураНеОбязательныхПолей, ЗадаватьВопрос, ЗаполнятьСчета) Экспорт
	ЗаполнятьСчета = Ложь;
	ЗадаватьВопрос = Ложь;
	
	//Проверяем заполнение обязательных	
	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
		ЗначениеРеквизита = ДокументОбъект[КлючЗначение.Ключ];
		ЗначениеНовое = КлючЗначение.Значение; 
		
		Если (ЗначениеЗаполнено(ЗначениеРеквизита))И (ЗначениеРеквизита<>ЗначениеНовое)  Тогда
			ЗадаватьВопрос = Истина;
			ЗаполнятьСчета = Истина;
			Возврат;
		ИначеЕсли (НЕ ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда
			ЗаполнятьСчета = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	//Проверяем заполнение не обязательных
	Для каждого КлючЗначение Из СтруктураНеОбязательныхПолей Цикл
		ЗначениеРеквизита = ДокументОбъект[КлючЗначение.Ключ];
		ЗначениеНовое = КлючЗначение.Значение; 
		
		Если ЗначениеЗаполнено(ЗначениеРеквизита) И (ЗначениеРеквизита<>ЗначениеНовое) Тогда
			ЗадаватьВопрос = Истина;
			ЗаполнятьСчета = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНеобходимостьПерезаполненияСчетовУчета()

/////////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ РАБОТЫ С ЕНВД И УСН

//Функция ОтноситсяКДеятельностиЕНВД(Счет) Экспорт

//	Если РегистрыСведений.СчетаДоходовИРасходовЕНВД.Выбрать(Новый Структура("Счет", Счет)).Следующий() тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;

//КонецФункции // ОтноситсяКДеятельностиЕНВД()

//Функция МассивСчетовВыручкиЕНВД() Экспорт

//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Счет90_01", Планысчетов.Хозрасчетный.Выручка);

//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	Хозрасчетный.Ссылка КАК Счет
//	|ИЗ
//	|	РегистрСведений.СчетаДоходовИРасходовЕНВД КАК СчетаДоходовИРасходовЕНВД
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
//	|		ПО СчетаДоходовИРасходовЕНВД.Счет = Хозрасчетный.Ссылка
//	|
//	|ГДЕ
//	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счет90_01)";
//	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();

//	Возврат ТаблицаСчетов.ВыгрузитьКолонку("Счет");

//КонецФункции

//Функция МассивСчетовРасходовЕНВД() Экспорт

//	Запрос = Новый Запрос;
//	
//	Массив = Новый Массив;
//	Массив.Добавить(ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажу);
//	Массив.Добавить(ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы);
//	Запрос.УстановитьПараметр("Счет90_02", Массив);

//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	Хозрасчетный.Ссылка КАК Счет
//	|ИЗ
//	|	РегистрСведений.СчетаДоходовИРасходовЕНВД КАК СчетаДоходовИРасходовЕНВД
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
//	|		ПО СчетаДоходовИРасходовЕНВД.Счет = Хозрасчетный.Ссылка
//	|
//	|ГДЕ
//	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счет90_02)";
//	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();

//	Возврат ТаблицаСчетов.ВыгрузитьКолонку("Счет");

//КонецФункции

////Определяет применяется ли упрощенная система налогообложения
////
//Функция ПрименениеУСН(Организация, Знач Дата) Экспорт

//	Если НЕ ЗначениеЗаполнено(Организация) Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(Дата) Тогда
//		Дата = ТекущаяДата();
//	КонецЕсли;

//	УчетнаяПолитика = ПолучитьПараметрыУчетнойПолитики(Дата, Ложь, Организация,,Ложь);
//	Если УчетнаяПолитика.Количество() = 0 Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат (УчетнаяПолитика.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная);
//	КонецЕсли;

//КонецФункции

//// Определяет, установлена ли поддержка ПБУ 18/02.
////
//// Параметры:
////  Организация  - Справочник.Ссылка - Организация, по которой
////                 определяется поддержка ПБУ 18/02
////  Дата         - Дата - Дата, на которую получаются сведения
////
//// Возвращаемое значение:
////  Булево.
////
//Функция ПрименениеПБУ18(Организация, Знач Дата) Экспорт

//	Если НЕ ЗначениеЗаполнено(Организация) Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(Дата) Тогда
//		Дата = ТекущаяДата();
//	КонецЕсли;

//	УчетнаяПолитика = ПолучитьПараметрыУчетнойПолитики(Дата, Ложь, Организация,,Ложь);
//	Если УчетнаяПолитика.Количество() = 0 Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат УчетнаяПолитика.ПоддержкаПБУ18;
//	КонецЕсли;

//КонецФункции

////Определяет применяется ли упрощенная система налогообложения
////
//Функция ПрименениеУСНДоходы(Организация, Знач Дата, Отказ = Ложь) Экспорт

//	Если НЕ ЗначениеЗаполнено(Организация) Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(Дата) Тогда
//		Дата = ТекущаяДата();
//	КонецЕсли;

//	ПараметрыУчетнойПолитики = ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация,,Ложь);
//	
//	Если Отказ = Истина Тогда
//		Возврат Ложь;
//	КонецЕсли;

//	
//	Если НЕ ПараметрыУчетнойПолитики.УСН Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ПараметрыУчетнойПолитики.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;

//КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ РЕКВИЗИТОВ В ФОРМЕ

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа,
//  ТекПользователь                - ссылка на справочник, определяет текущего пользователя  
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  ТипОперации                    - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                   если не передан, то реквизиты, зависящие от вида операции, не заполняются
//  ПараметрОбъектКопирования 	   - указывает что документ создан копированием
//  ПараметрОснование 			   - ссылка на документ сонование
Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "",ПараметрОбъектКопирования = неопределено, ПараметрОснование = неопределено) Экспорт

	Перем ТипЦен;

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	//Если ЕстьРеквизитДокумента("ОтражатьВНалоговомУчете", МетаданныеДокумента) Тогда
	//	Если ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
	//		ДокументОбъект.ОтражатьВНалоговомУчете =ПараметрОбъектКопирования.ОтражатьВНалоговомУчете;
	//	Иначе
	//		ДокументОбъект.ОтражатьВНалоговомУчете = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "НеОтражатьДокументыВНалоговомУчете");
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", МетаданныеДокумента) Тогда
		
		Если ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
			ДокументОбъект.ОтражатьВБухгалтерскомУчете =ПараметрОбъектКопирования.ОтражатьВБухгалтерскомУчете;
		Иначе
			//По умолчанию все документы требуют отражения в бухгалтерском учете
			ДокументОбъект.ОтражатьВБухгалтерскомУчете = Истина
		КонецЕсли;;

	КонецЕсли;


	Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
	  И (НЕ ЗначениеЗаполнено(ДокументОбъект.Организация)) Тогда
		ДокументОбъект.Организация = глЗначениеПеременной("ОсновнаяОрганизация");
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ПодразделениеОрганизации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПодразделениеОрганизации)) Тогда
		ДокументОбъект.ПодразделениеОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделениеОрганизации");
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.СтруктурнаяЕдиница) 
	   И ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
		ДокументОбъект.СтруктурнаяЕдиница = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
	  ДокументОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)) Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;

	Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Склад)) Тогда
		ДокументОбъект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;

	Если ЕстьРеквизитДокумента("СкладОрдер", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.СкладОрдер) Тогда
		ДокументОбъект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;

	Если ЕстьРеквизитДокумента("СтавкаНДС", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.СтавкаНДС)) Тогда
		ДокументОбъект.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяСтавкаНДС");
	КонецЕсли;

	Если ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчет) Тогда
		ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		Если ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
		ДокументОбъект.СчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		ДокументОбъект.ВалютаДокумента = ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента)) Тогда
	    СтруктураКурсаДокумента      = ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

		Если ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;


	Если (ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента))
	   И (ЗначениеЗаполнено(ДокументОбъект.ТипЦен)) Тогда

		// Если ТипЦен - элемент справочника ТипыЦенНоменклатуры и цены выбранного типа расчетные, 
		// то флаги включения налогов надо брать из базовой цены
		ТипЦен = ДокументОбъект.ТипЦен;

		// Флаги учета налогов заполняем, только если флаг УчитыватьНДС не заполнен.
		Если ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента) 
		   И (Не ДокументОбъект.УчитыватьНДС) Тогда

			ДокументОбъект.УчитыватьНДС     = Истина;
			ДокументОбъект.СуммаВключаетНДС = ТипЦен.ЦенаВключаетНДС;

		КонецЕсли; 
		
	Иначе

		// Заполним значениями по умолчанию (нет, либо не заполнен ТипЦен).
		// Флаги учета налогов заполняем, только если флаг УчитыватьНДС не заполнен.
		Если ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента) 
		   И (Не ДокументОбъект.УчитыватьНДС) Тогда

			ДокументОбъект.УчитыватьНДС     = Истина;
			ДокументОбъект.СуммаВключаетНДС = Истина;
		КонецЕсли; 
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ЗанимаемыхСтавок", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ЗанимаемыхСтавок)) Тогда
		ДокументОбъект.ЗанимаемыхСтавок = 1;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ДатаС", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаС)) Тогда
		ДокументОбъект.ДатаС = ДокументОбъект.Дата;
	КонецЕсли;
	
	//Если ЕстьРеквизитДокумента("НДСВключенВСтоимость", МетаданныеДокумента) И
	//	ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
	//	Если ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
	//		ДокументОбъект.НДСВключенВСтоимость = Истина;
	//	КонецЕсли;
	//КонецЕсли;

	# Если Клиент Тогда

	Если ЕстьРеквизитДокумента("ПериодРегистрации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации)) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(РабочаяДата);
	КонецЕсли;

	#КонецЕсли

КонецПроцедуры // ЗаполнитьШапкуДокумента()

// Процедура предназначена для заполнения общих реквизитов документов по документу основанию,
//	вызывается в обработчиках событий "ОбработкаЗаполнения" в модулях документов.
//
// Параметры:
//  ДокументОбъект  - объект редактируемого документа,
//  ДокументОснование - объект документа основания
//
Процедура ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, ДокументОснование) Экспорт

	МетаданныеДокумента          = ДокументОбъект.Метаданные();
	МетаданныеДокументаОснования = ДокументОснование.Метаданные();
	
	// Дата
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата = ПолучитьРабочуюДату();
	КонецЕсли;
	
	// Организация.
	Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("Организация", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Организация = ДокументОснование.Организация;
	КонецЕсли;

	// Склад.
	Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("Склад", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Склад = ДокументОснование.Склад;
	КонецЕсли;

	// Контрагент.
	Если ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("Контрагент", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.Контрагент = ДокументОснование.Контрагент;
	КонецЕсли;

	// ДоговорКонтрагента.
	Если ЕстьРеквизитДокумента("ДоговорКонтрагента", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("ДоговорКонтрагента", МетаданныеДокументаОснования) 
	   И (НЕ ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
	      ИЛИ ДокументОбъект.Организация = ДокументОснование.ДоговорКонтрагента.Организация) Тогда

		ДокументОбъект.ДоговорКонтрагента = ДокументОснование.ДоговорКонтрагента;

		// КурсВзаиморасчетов.
		Если ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
			СтруктураКурсаВзаиморасчетов = ПолучитьКурсВалюты(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДокументОбъект.Дата);
			ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;

			// КратностьВзаиморасчетов.
			Если ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
				ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// Банковский счет 
	Если ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента) Тогда

		// Если в документе-основании есть структурная единица, то берем ее оттуда
		Если ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.СтруктурнаяЕдиница) 
			   И ТипЗнч(ДокументОснование.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
				ДокументОбъект.БанковскийСчет = ДокументОснование.СтруктурнаяЕдиница;
			КонецЕсли;
		ИначеЕсли ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокументаОснования) Тогда
			Если ЗначениеЗаполнено(ДокументОснование.БанковскийСчет) Тогда
				ДокументОбъект.БанковскийСчет = ДокументОснование.БанковскийСчет;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// ВалютаДокумента.
	Если ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокументаОснования) Тогда

		// Если есть касса или банковский счет, то валюта должна браться только оттуда
		Если ЕстьРеквизитДокумента("Касса", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
				ДокументОбъект.ВалютаДокумента = ДокументОбъект.Касса.ВалютаДенежныхСредств;
			КонецЕсли;
		ИначеЕсли ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.БанковскийСчет) Тогда
				ДокументОбъект.ВалютаДокумента = ДокументОбъект.БанковскийСчет.ВалютаДенежныхСредств;
		    КонецЕсли;
		Иначе
			ДокументОбъект.ВалютаДокумента = ДокументОснование.ВалютаДокумента;
		КонецЕсли;

		// КурсДокумента.
		Если ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента) Тогда
			СтруктураКурсаДокумента = ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
			ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

			// КратностьДокумента.
			Если ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
				ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// ТипЦен.
	Если ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.ТипЦен = ДокументОснование.ТипЦен;
	КонецЕсли;

	// УчитыватьНДС.
	Если ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.УчитыватьНДС = ДокументОснование.УчитыватьНДС;
	КонецЕсли;

	// СуммаВключаетНДС.
	Если ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
	   И ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокументаОснования) Тогда
		ДокументОбъект.СуммаВключаетНДС = ДокументОснование.СуммаВключаетНДС;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("ОтражатьВНалоговомУчете", МетаданныеДокумента) Тогда
		Если ЕстьРеквизитДокумента("ОтражатьВНалоговомУчете", МетаданныеДокументаОснования) Тогда
			ДокументОбъект.ОтражатьВНалоговомУчете = ДокументОснование.ОтражатьВНалоговомУчете;
		Иначе
			ДокументОбъект.ОтражатьВНалоговомУчете = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьШапкуДокументаПоОснованию()

// Функция определяет пол физлица по его отчеству
Функция ПолучитьПол(ОтчествоРаботника) Экспорт
	
	Если Прав(ОтчествоРаботника, 2) = "ич" Тогда
		Возврат Перечисления.ПолФизическихЛиц.Мужской;
	
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" Тогда
		Возврат Перечисления.ПолФизическихЛиц.Женский;
	
	КонецЕсли;
	
	Возврат Перечисления.ПолФизическихЛиц.ПустаяСсылка();
	
КонецФункции

// Функция формирует Фамилию Имя Отчество или Фамилию И. О. либо по наименованию элемента спр-ка ФизическиеЛица либо по переданным строкам.
//  
//  Если передан Объект, то извлеченная из него строка считается совокупностью 
//  Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры
//  Объект		- строка или ссылка или объект элемента спр-ка ФизическиеЛица.
//  Фамилия		- фамилия физ. лица.
//  Имя			- имя физ. лица.
//  Отчество	- отчество физ. лица.
//
// Возвращаемое значение 
//  Фамилия и Инициалы одной строкой. Побочные эффекты - переданная целая строка 
//  Побочные эффекты - переданная целая строка разбивается на подстроки, соответствующие
//  отдельным Фамилии,Имени и Отчеству
//
Функция ФИО_ФизЛица(Объект = Неопределено, Фамилия = " ", Имя = " ", Отчество = " ", бФИОКратко = Ложь) Экспорт

	ТипОбъекта = ТипЗнч(Объект);

	Если ТипОбъекта = Тип("Строка") И СокрЛП(Объект) <> "" Тогда
		ФИОПолностью = СокрЛП(Объект);
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда 
		ФИОПолностью = СокрЛП(Объект.Наименование);
	Иначе
		// используем возможно переданные отдельные строки
        ФИОПолностью = СтрЗаменить(СокрЛП(СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество)),"  "," ");
	КонецЕсли;
	
	мФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ФИОПолностью, " ");
	
	//Обновим входные параметры Фамилия, Имя, Отчество
	КоличествоПодстрок = мФИО.Количество();
	Фамилия  = ?(КоличествоПодстрок > 0,мФИО[0],"");
	Имя      = ?(КоличествоПодстрок > 1,мФИО[1],"");
	Отчество = ?(КоличествоПодстрок > 2,мФИО[2],"");
	
	Если бФИОКратко = Ложь Тогда
		Возврат ФИОПолностью;	
	КонецЕсли;
	ФИОКратко = "";
	Если НЕ ПустаяСтрока(Фамилия) Тогда
		ФИОКратко = Фамилия;
		Если НЕ ПустаяСтрока(Имя) Тогда
			ФИОКратко = ФИОКратко + " " + Лев(Имя,1) + ".";
			Если НЕ ПустаяСтрока(Отчество) Тогда
				ФИОКратко = ФИОКратко + " " + Лев(Отчество,1) + ".";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ФИОКратко;
КонецФункции

// Функция собирает сведения о 
//
// Параметры:
//  Организация - организация, для которой нужно определить руководящих лиц.
//
Функция ОтветственныеЛица(Организация, ДатаСреза) Экспорт

	Результат = Новый Структура("Руководитель, РуководительДолжность, РуководительФИО, РуководительПредставление, 
								|ГлавныйБухгалтер, ГлавныйБухгалтерДолжность, ГлавныйБухгалтерФИО, ГлавныйБухгалтерПредставление, 
								|ФинОтветственный, ФинОтветственныйДолжность, ФинОтветственныйФИО, ФинОтветственныйПредставление, 
								|ОтветственныйЗаБСО, ОтветственныйЗаБСОДолжность, ОтветственныйЗаБСОФИО, ОтветственныйЗаБСОПредставление, 
								|Кассир, КассирДолжность, КассирФИО, КассирПредставление,  
								|ОтветственныйЗаРегистры, ОтветственныйЗаРегистрыДолжность, ОтветственныйЗаРегистрыФИО, ОтветственныйЗаРегистрыПредставление");

	Если Организация <> Неопределено тогда

		ЗапросПоЛицам = Новый Запрос();
		ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
		ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
		ЗапросПоЛицам.УстановитьПараметр("ПризнакФизЛица",   Перечисления.ЮрФизЛицо.ФизЛицо);
		
		ЗапросПоЛицам.Текст = "ВЫБРАТЬ
		                      |	ФИОФизЛицСрезПоследних.Фамилия,
		                      |	ФИОФизЛицСрезПоследних.Имя,
		                      |	ФИОФизЛицСрезПоследних.Отчество,
		                      |	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизическоеЛицо
		                      |ИЗ
		                      |	РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛицСрезПоследних
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		                      |		ПО ФИОФизЛицСрезПоследних.ФизЛицо = Организации.ИндивидуальныйПредприниматель
		                      |			И (Организации.Ссылка = &Организация)
		                      |			И (Организации.ЮрФизЛицо = &ПризнакФизЛица)";
		
		Руководители = ЗапросПоЛицам.Выполнить().Выбрать();
		
		Пока Руководители.Следующий() Цикл
			
			ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление");
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Фамилия) или Руководители.Фамилия = NULL) Тогда
				ФИО.Фамилия = Руководители.Фамилия;
			КонецЕсли;
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Имя) или Руководители.Имя = NULL) Тогда
				ФИО.Имя = Руководители.Имя;
			КонецЕсли;
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Отчество) или Руководители.Отчество = NULL) Тогда
				ФИО.Отчество = Руководители.Отчество;
			КонецЕсли;
			Представление = ФИО_ФизЛица(Неопределено, ФИО.Фамилия, ФИО.Имя, ФИО.Отчество);
			
			Результат.Руководитель               = Руководители.ФизическоеЛицо;
			Результат.РуководительДолжность      = "";
			Результат.РуководительФИО            = ФИО;
			Результат.РуководительПредставление  = Представление;
			
		КонецЦикла;
		
		ЗапросПоЛицам.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ФизЛицо ССЫЛКА Справочник.ФизическиеЛица) КАК ФИОФизЛицСрезПоследних
		|		ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
		Руководители = ЗапросПоЛицам.Выполнить().Выбрать();

		Пока Руководители.Следующий() Цикл

			ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление");
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Фамилия) или Руководители.Фамилия = NULL) Тогда
				ФИО.Фамилия = Руководители.Фамилия;
			КонецЕсли;
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Имя) или Руководители.Имя = NULL) Тогда
				ФИО.Имя = Руководители.Имя;
			КонецЕсли;
			Если НЕ (НЕ ЗначениеЗаполнено(Руководители.Отчество) или Руководители.Отчество = NULL) Тогда
				ФИО.Отчество = Руководители.Отчество;
			КонецЕсли;
			Представление = ФИО_ФизЛица(Неопределено, ФИО.Фамилия, ФИО.Имя, ФИО.Отчество);
			
			Если Руководители.ОтветственноеЛицо      = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
				Результат.Руководитель               = Руководители.ФизическоеЛицо;
				Результат.РуководительДолжность      = Руководители.Должность;
				Результат.РуководительФИО            = ФИО;
				Результат.РуководительПредставление  = Представление;

			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда
				Результат.ГлавныйБухгалтер           = Руководители.ФизическоеЛицо;
				Результат.ГлавныйБухгалтерДолжность  = Руководители.Должность;
                Результат.ГлавныйБухгалтерФИО        = ФИО;
				Результат.ГлавныйБухгалтерПредставление  = Представление;
				
			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ФинОтветственный Тогда
				Результат.ФинОтветственный           = Руководители.ФизическоеЛицо;
				Результат.ФинОтветственныйДолжность  = Руководители.Должность;
                Результат.ФинОтветственныйФИО        = ФИО;
				Результат.ФинОтветственныйПредставление  = Представление;
				
			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБСО Тогда
				Результат.ОтветственныйЗаБСО    = Руководители.ФизическоеЛицо;
				Результат.ОтветственныйЗаБСОДолжность      = Руководители.Должность;
				Результат.ОтветственныйЗаБСОФИО = ФИО;
				Результат.ОтветственныйЗаБСОПредставление  = Представление;

			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Кассир Тогда
				Результат.Кассир                     = Руководители.ФизическоеЛицо;
				Результат.КассирДолжность      		 = Руководители.Должность;
                Результат.КассирФИО            		 = ФИО;
				Результат.КассирПредставление  = Представление;
				
			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаНалоговыеРегистры Тогда
				Результат.ОтветственныйЗаРегистры    = Руководители.ФизическоеЛицо;
				Результат.ОтветственныйЗаРегистрыДолжность      = Руководители.Должность;
				Результат.ОтветственныйЗаРегистрыФИО = ФИО;
				Результат.ОтветственныйЗаРегистрыПредставление  = Представление;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Получение представления для документа, удостоверяющего личность
//
// Параметры
//  ДанныеФизЛица  – Коллекция данных физ. лица (структура, строка таблицы, ...), содержащая значения: 
//                   ДокументВид, ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан  
//
// Возвращаемое значение:
//   Строка   – Представление документа, удостоверяющего личность
//
Функция ПолучитьПредставлениеДокументаФизЛица(ДанныеФизЛица) Экспорт

	Возврат Строка(ДанныеФизЛица.ДокументВид) + " серия " +
			ДанныеФизЛица.ДокументСерия       + ", номер " +
			ДанныеФизЛица.ДокументНомер       + ", выданный " +
			Формат(ДанныеФизЛица.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")  + " " +
			ДанныеФизЛица.ДокументКемВыдан;

КонецФункции // ПолучитьПредставлениеДокументаФизЛица()

// Функция возвращает совокупность данных о физическом лице в виде структуры, 
// В совокупность данных входит ФИО, должность в заданной организации, 
// паспортные данные и др.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - организация, по которой
//                 определяется должность и подразделение работника
//  ФизЛицо      - СправочникСсылка.ФизическиеЛица - физическое лицо,
//                 по которому возвращается совокупность данных
//  ДатаСреза    - Дата - дата, на которую считываются данные
//  ФИОКратко    - Булево - если Истина (по умолчанию), Представление физ.лица включает фамилию и инициалы, если Ложь - фамилию и полностью имя и отчество
//
// Возвращаемое значение:
//  Структура    - Структура с совокупностью данных о физическом лице:
//                 - Фамилия
//                 - Имя
//                 - Отчетсво
//                 - Представление (Фамилия И.О.)
//                 - Подразделение
//                 - ДокументВид
//                 - ДокументСерия
//                 - ДокументНомер
//                 - ДокументДатаВыдачи
//                 - ДокументКемВыдан
//                 - ДокументКодПодразделения
//
Функция ДанныеФизЛица(Организация, ФизЛицо, ДатаСреза, ФИОКратко = Истина) Экспорт
	
	ЗапросПоЛицам = Новый Запрос();
	ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
	ЗапросПоЛицам.УстановитьПараметр("ФизЛицо", ФизЛицо);
	ЗапросПоЛицам.Текст =
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	//|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер,
	//|	РаботникиОрганизацийСрезПоследних.Должность,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК ФизЛицо ИЗ Справочник.ФизическиеЛица ГДЕ Ссылка = &ФизЛицо) КАК ФизЛица
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|	ПО ФизЛица.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаСреза, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|	ПО ФизЛица.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	//|	ЛЕВОЕ СОЕДИНЕНИЕ 
	//|		(ВЫБРАТЬ 
	//|			РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	//|			РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо КАК ФизЛицо,
	//|			РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	//|			РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	//|		ИЗ
	//|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза,	Сотрудник.ФизЛицо = &ФизЛицо И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	//|		ГДЕ
	//|			РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//|		) КАК РаботникиОрганизацийСрезПоследних
	//|	ПО ФизЛица.ФизЛицо = РаботникиОрганизацийСрезПоследних.Физлицо
	|";
	
	Данные = ЗапросПоЛицам.Выполнить().Выбрать();
	Данные.Следующий();
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Представление, 
								|ТабельныйНомер, Должность, ПодразделениеОрганизации, 
								|ДокументВид, ДокументСерия, ДокументНомер,  
								|ДокументДатаВыдачи, ДокументКемВыдан, ДокументКодПодразделения, 
								|ПредставлениеДокумента");

	ЗаполнитьЗначенияСвойств(Результат, Данные);

	Результат.Представление          = ФИО_ФизЛица(Неопределено, Результат.Фамилия, Результат.Имя, Результат.Отчество, ФИОКратко);
	Результат.ПредставлениеДокумента = ПолучитьПредставлениеДокументаФизЛица(Данные);
	
	Возврат Результат;
	
КонецФункции // ДанныеФизЛица

// Функция возвращает совокупность данных о физических лицах в виде таблицы
// значений. В совокупность данных входит ФИО, должность в заданной 
// организации, паспортные данные и др.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - организация, по которой
//                 определяется должность и подразделение работника(ов)
//  ФизЛицо      - СправочникСсылка.ФизическиеЛица или Массив - физическое лицо
//                 или список физ. лиц, по которым возвращается совокупность 
//                 данных
//  ДатаСреза    - Дата - дата, на которую считываются данные
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с совокупностью данных о физическом лице. 
//                  Колонки: возвращаемой таблицы:
//                  - Фамилия
//                  - Имя
//                  - Отчетсво
//                  - Представление (Фамилия И.О.)
//                  - Подразделение
//                  - ДокументВид
//                  - ДокументСерия
//                  - ДокументНомер
//                  - ДокументДатаВыдачи
//                  - ДокументКемВыдан
//                  - ДокументКодПодразделения
//
Функция ДанныеФизЛиц(Организация, ФизЛицо, ДатаСреза) Экспорт

	ЗапросПоЛицам = Новый Запрос();
	ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
	ЗапросПоЛицам.УстановитьПараметр("ФизЛицо", ФизЛицо);
	ЗапросПоЛицам.Текст =
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения
	|ИЗ
	|	(ВЫБРАТЬ Ссылка КАК ФизЛицо ИЗ Справочник.ФизическиеЛица ГДЕ Ссылка В (&ФизЛицо)) КАК ФизЛица
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ФизЛицо В (&ФизЛицо)) КАК ФИОФизЛицСрезПоследних
	|	ПО ФизЛица.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаСреза, ФизЛицо В (&ФизЛицо)) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|	ПО ФизЛица.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ 
	|			РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	|			РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо КАК ФизЛицо,
	|			РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	|			РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза,	Сотрудник.ФизЛицо В (&ФизЛицо) И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	|		ГДЕ
	|			РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|		) КАК РаботникиОрганизацийСрезПоследних
	|	ПО ФизЛица.ФизЛицо = РаботникиОрганизацийСрезПоследних.Физлицо
	|";
	
	Данные = ЗапросПоЛицам.Выполнить().Выбрать();
	
	ТабРезультат = Новый ТаблицаЗначений();
	ТабРезультат.Колонки.Добавить("Фамилия");
	ТабРезультат.Колонки.Добавить("Имя");
	ТабРезультат.Колонки.Добавить("Отчество");
	ТабРезультат.Колонки.Добавить("Представление");
	ТабРезультат.Колонки.Добавить("ТабельныйНомер");
	ТабРезультат.Колонки.Добавить("Должность");
	ТабРезультат.Колонки.Добавить("ПодразделениеОрганизации");
	ТабРезультат.Колонки.Добавить("ДокументВид");
	ТабРезультат.Колонки.Добавить("ДокументСерия");
	ТабРезультат.Колонки.Добавить("ДокументНомер");
	ТабРезультат.Колонки.Добавить("ДокументДатаВыдачи");
	ТабРезультат.Колонки.Добавить("ДокументКемВыдан");
	ТабРезультат.Колонки.Добавить("ДокументКодПодразделения");
	ТабРезультат.Колонки.Добавить("ПредставлениеДокумента");
								
	Пока Данные.Следующий() Цикл
		
		Результат = ТабРезультат.Добавить();
		
		ЗаполнитьЗначенияСвойств(Результат, Данные);

		Результат.Представление          = ФИО_ФизЛица(Неопределено, Данные.Фамилия, Данные.Имя, Данные.Отчество);
		Результат.ПредставлениеДокумента = ПолучитьПредставлениеДокументаФизЛица(Данные);
		
	КонецЦикла;

	Возврат ТабРезультат;
	
КонецФункции // ДанныеФизЛиц

////////////////////////////////////////////////////////////////////////////////
// МАТЕМАТИКА

// возвращает "количество полных и неполных рублей"
// Параметры:
//	Сумма - число
// Возвращаемое значение:
//  число, равное ближайшему целому "сверху"
Функция ЦелМаксимальное(Сумма) Экспорт
	Возврат ?(Цел(Сумма) = Сумма, Сумма, Цел(Сумма) + 1);
	
КонецФункции // ЦелМаксимальное()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПАРАМЕТРОВ СЕАНСА

// Функция дополняет структуру шапки документа положениями учетной политики.
Процедура ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, КонДата, Отказ, Организация, Учет = "Нал", СтруктураПолейУчетнойПолитикиНУ = Неопределено, СообщатьОбОшибке = Истина) Экспорт
	
	СтруктураУП = ПолучитьПараметрыУчетнойПолитики(КонДата, Отказ, Организация,,СообщатьОбОшибке);
	
	Для Каждого ПараметрУП Из СтруктураУП Цикл
		
		Если (ТипЗнч(СтруктураПолейУчетнойПолитикиНУ) = Тип("Структура"))
		   И НЕ (СтруктураПолейУчетнойПолитикиНУ.Количество() = 0) Тогда
		   
			// Заполнение определенными полями
			Если СтруктураПолейУчетнойПолитикиНУ.Свойство(ПараметрУП.Ключ) Тогда
				
				Если НЕ ЗначениеЗаполнено(СтруктураПолейУчетнойПолитикиНУ[ПараметрУП.Ключ]) Тогда
					
					СтруктураШапкиДокумента.Вставить(ПараметрУП.Ключ,ПараметрУП.Значение);
					
				Иначе
					
					СтруктураШапкиДокумента.Вставить(СтруктураПолейУчетнойПолитикиНУ[ПараметрУП.Ключ],ПараметрУП.Значение);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе	
			
			// Дополняем всеми параметрами учетной политики
			СтруктураШапкиДокумента.Вставить(ПараметрУП.Ключ, ПараметрУП.Значение);  
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ДополнитьПоложениямиУчетнойПолитики()

Функция ОпределитьТекущийРежимРаботыМонопольный() Экспорт
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	НомерТекущегоСоединения = НомерСоединенияИнформационнойБазы();
	
	Для каждого Соединение ИЗ МассивСоединений Цикл
		
		Если Соединение.ИмяПриложения <> "Designer" 
			И Соединение.НомерСоединения <> НомерТекущегоСоединения Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФАЙЛАМИ
//
// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьЧастьСтрокиОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат "";
  	
КонецФункции

// Выделяет из имени файла его расширение (набор символов после последней точки).
//
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция ПолучитьРасширениеФайла(Знач ИмяФайла) Экспорт
	
	Расширение = ПолучитьЧастьСтрокиОтделеннойСимволом(ИмяФайла, ".");
	Возврат Расширение;
	
КонецФункции


// Выделяет из полного пути к файлу его имя (набор символов после последней \).
//
// Параметры
//  ПутьКФайлу     – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция ПолучитьИмяФайлаИзПолногоПути(Знач ПутьКФайлу) Экспорт
	
	ИмяФайла = ПолучитьЧастьСтрокиОтделеннойСимволом(ПутьКФайлу, "\");
	Возврат ИмяФайла;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБНОВЛЕНИЯ КОНФИГУРАЦИИ

Функция ВопросДаНет(ТекстВопроса) Экспорт
	
	#Если Клиент Тогда
	
	КодВозврата = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
						 
	Возврат (КодВозврата = КодВозвратаДиалога.Да);
	 
 	#Иначе
	 
	Возврат Истина;
	
	#КонецЕсли

КонецФункции // ВопросДаНет()
 
Процедура ПредупреждениеОбОшибке(ТекстСообщения) Экспорт
	 
	#Если Клиент Тогда
		
		Предупреждение(ТекстСообщения);
	
	#Иначе
		
		ВызватьИсключение(ТекстСообщения);
		
	#КонецЕсли
	 
КонецПроцедуры // ПредупреждениеОбОшибке()

Процедура ЗапуститьПрограмму(ПутьКПрограмме, РабочийКаталог = Неопределено) Экспорт
	
	#Если Клиент Тогда
		
		ЗапуститьПриложение(ПутьКПрограмме, РабочийКаталог);
	
	#КонецЕсли
	
КонецПроцедуры // ЗапуститьПрограмму()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ УПРАВЛЕНИЯ НОМЕРАМИ ДОКУМЕНТОВ

Процедура ДобавитьПрефиксОрганизации(ДокументОбъект, Префикс) Экспорт
	
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();

	Если Не ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
		 ИЛИ НЕ ЗначениеЗаполнено(ДокументОбъект.Организация.Префикс)  Тогда
		Префикс = "0";
	Иначе
                                
		Префикс = ДокументОбъект.Организация.Префикс;
        		
	КонецЕсли;
Конецпроцедуры

Процедура ПриУстановкеНовогоКодаСправочника(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	//ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомераДокумента(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(Источник, Префикс);
	//ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);	
	
Конецпроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ПАРАМЕТРОВ СЕАНСА

Функция ПолучитьЗначениеПеременной(ИмяПараметра, Кэш = Неопределено, КэшИзменен = Ложь) Экспорт
	
	Если Кэш = Неопределено Тогда
		// Кэш не был проинициализирован
		Кэш = Новый Структура;
	Иначе
		// Ищем значение в структуре
		НайденноеЗначение = Неопределено;
		Если Кэш.Свойство(ИмяПараметра, НайденноеЗначение) Тогда
			Возврат НайденноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	// Значение в КЭШе не нашли, получим значение из БД
	Если ВРег(ИмяПараметра) = ВРег("глТекущийПользователь") Тогда
		НайденноеЗначение = ПараметрыСеанса.ТекущийПользователь;
	//ИначеЕсли ВРег(ИмяПараметра) = ВРег("глУчетнаяПолитикаПоПерсоналуОрганизации") Тогда
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("глУчетнаяПолитикаПоПерсоналуОрганизации") Тогда
		НайденноеЗначение = ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации();
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("глУчетнаяПолитика") Тогда
		НайденноеЗначение = ЗаполнениеУчетнойПолитики();
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("КэшСтратегииАвтонумерации") Тогда	
		НайденноеЗначение = Новый Соответствие;		
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("глКоличествоСекундОпросаОбмена") Тогда	
		НайденноеЗначение = Константы.ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте.Получить();
		Если НайденноеЗначение = 0 Тогда
			НайденноеЗначение = 60;
		КонецЕсли;
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("УчетПоВсемОрганизациям") Тогда	
		НайденноеЗначение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетПоВсемОрганизациям");
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("ОсновнаяОрганизация") Тогда	
		НайденноеЗначение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("ЗначенияДополнительныхПравПользователя") Тогда
		НайденноеЗначение = Новый Соответствие;
	#Если Клиент Тогда	
	ИначеЕсли ВРег(ИмяПараметра) = ВРег("глЗапрашиватьПодтверждениеПриЗакрытии") Тогда	
		НайденноеЗначение = Истина;		
	#КонецЕсли
	Иначе
		СтрокаИсключения = "Невозможно обработать параметр " + """" + ИмяПараметра + """" + " для получения значения";
		ВызватьИсключение СтрокаИсключения;
	КонецЕсли;
	
	Кэш.Вставить(ИмяПараметра, НайденноеЗначение);
	КэшИзменен = Истина;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Процедура УстановитьЗначениеПеременной(ИмяПараметра, Кэш, ЗначениеПараметра, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	Если Кэш = Неопределено Тогда
		// Кэш не был проинициализирован
		Кэш = Новый Структура;
	КонецЕсли;
	
	Если Кэш.Свойство(ИмяПараметра) Тогда
		Кэш.Вставить(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;
	
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
		Если ОбновлятьВоВсехКэшах Тогда
			КэшНаСервере = ПараметрыСеанса.ОбщиеЗначения.Получить();
			КэшНаСервере.Вставить(ИмяПараметра, ЗначениеПараметра);
			ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(КэшНаСервере);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// Функция возвращает структуру с параметрами учетной политики на заданную дату.
//
Функция ПолучитьПараметрыУчетнойПолитики(ТекущаяДата, Отказ, Организация, Учет = "", СообщатьОбОшибке = Истина) Экспорт
	
	СтруктураУчПолитика = Новый Структура;
			
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Отказ = Истина;
		Возврат СтруктураУчПолитика;	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяДата) Тогда
		
		Отказ = Истина;
		Возврат СтруктураУчПолитика;	
		
	КонецЕсли;

	УчетнаяПолитика=глЗначениеПеременной("глУчетнаяПолитика");	
	
	УчетнаяПолитика.Индексы.Добавить("Организация");
	УчетнаяПолитикаОрганизации = УчетнаяПолитика.НайтиСтроки(Новый Структура("Организация", Организация));
	
	Если УчетнаяПолитикаОрганизации.Количество() = 0 Тогда
		    Отказ = Истина;	
		Если СообщатьОбОшибке Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не указаны параметры учетной политики для организации """+СокрЛП(Организация)+""" на " + Формат(ТекущаяДата, "ДЛФ=DD") +  "
			|Учетная политика устанавливается в меню ""Предприятие""","Сообщить");
			РаньшеСообщалосьОбОшибке = Истина;
		КонецЕсли;
		Возврат СтруктураУчПолитика;	
	Иначе
			
		Номер = 0;
		ФлагОтказа = Истина;
		Для НомерСтроки = 1 По УчетнаяПолитикаОрганизации.Количество() Цикл
				
			Строка = УчетнаяПолитикаОрганизации.Получить(НомерСтроки - 1);
			Если Строка.Период <= ТекущаяДата Тогда
				Номер = НомерСтроки;
				ФлагОтказа = Ложь;
					
			Иначе 
				Прервать;
			КонецЕсли;
		КонецЦикла;
			
		Если Номер <> 0 Тогда
			Строка = УчетнаяПолитикаОрганизации.Получить(Номер - 1);
			Для Каждого Колонка Из УчетнаяПолитика.Колонки Цикл
				СтруктураУчПолитика.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
			КонецЦикла;
			СтруктураУчПолитика.Вставить("УСН", Строка.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная);
			
			Если ТекущаяДата >= '20060101' И СтруктураУчПолитика.Свойство("МоментОпределенияНалоговойБазыНДС") и СтруктураУчПолитика.МоментОпределенияНалоговойБазыНДС = Перечисления.МоментыОпределенияНалоговойБазыНДС.ПоОплате Тогда			
				СтруктураУчПолитика.Вставить("МоментОпределенияНалоговойБазыНДС", Перечисления.МоментыОпределенияНалоговойБазыНДС.ПоОтгрузке);
			КонецЕсли;
			Если ТекущаяДата < '20060101' И СтруктураУчПолитика.Свойство("НачислятьНДСПоОтгрузке") И СтруктураУчПолитика.НачислятьНДСПоОтгрузке Тогда
				СтруктураУчПолитика.Свойство("НачислятьНДСПоОтгрузке", Ложь);
			КонецЕсли;
			Если ТекущаяДата >= '20080101' И СтруктураУчПолитика.Свойство("НДСНалоговыйПериод") и СтруктураУчПолитика.НДСНалоговыйПериод = Перечисления.Периодичность.Месяц Тогда
				СтруктураУчПолитика.Вставить("НДСНалоговыйПериод", Перечисления.Периодичность.Квартал);
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;
		
	Если  ФлагОтказа = Истина Тогда
		Если СообщатьОбОшибке Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не указаны параметры учетной политики для организации """+СокрЛП(Организация)+""" на " + Формат(ТекущаяДата, "ДЛФ=DD") +  "
			|Учетная политика устанавливается в меню ""Предприятие""","Сообщить");
			//ОбщегоНазначения.СообщитьОбОшибке("Не указаны параметры учетной политики для организации """+СокрЛП(Организация)+""" на " + Формат(ТекущаяДата, "ДЛФ=DD") +  "
			//|Учетная политика устанавливается в меню ""Предприятие""", Отказ);
			РаньшеСообщалосьОбОшибке = Истина;
		Иначе
			Отказ = Истина;
		КонецЕсли;
		Возврат СтруктураУчПолитика;	
	КонецЕсли; 
		
	Возврат СтруктураУчПолитика;
		
КонецФункции // ПолучитьПараметрыУчетнойПолитики()

// Функция определяет наличие клиентских подключений к базе других пользователей
Функция ЕстьДругиеПользователиВБазе() Экспорт
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	НомерТекущегоСоединения = НомерСоединенияИнформационнойБазы();
	
	Для каждого Соединение ИЗ МассивСоединений Цикл		
		Если Соединение.ИмяПриложения <> "Designer" 
			И Соединение.НомерСоединения <> НомерТекущегоСоединения Тогда			
			Возврат Истина;						
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАСТРОЙКИ АНАЛИТИЧЕСКОГО УЧЕТА

// Функция разбирает строку вида
// ТипОбъектаМетаданных.ИмяДокумента.ТабличнаяЧасть.ИмяТабличнойЧасти.Реквизит.ИмяРеквизита.
// ТипОбъектаМетаданных должен быть Справочник или Документ.
//
// Параметры:
//  ПутьКДанным - строка.
//
// Возвращаемое значение:
//  Структура - путь к объекту метаданных
//
Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	Если Структура.ТипОбъекта = "Документ" Тогда
		Структура.Вставить("Метаданные", Метаданные.Документы[Структура.ВидОбъекта]);
	Иначе
		Структура.Вставить("Метаданные", Метаданные.Справочники[Структура.ВидОбъекта]);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

Процедура УстановитьСортировкуПолейВТаблице(ЭлементТабПоле,СписокПолей = "") Экспорт
	Если СписокПолей = "" Тогда
		Для каждого Колонка Из ЭлементТабПоле.Колонки Цикл
			УстановитьСортировкуПоляВТаблице(ЭлементТабПоле,Колонка.Данные);
	 	КонецЦикла;
	Иначе
	    МассивПолей = РазложитьСтрокуВМассивПодстрок(СписокПолей,",");
		Для каждого Поле Из МассивПолей Цикл
			УстановитьСортировкуПоляВТаблице(ЭлементТабПоле,Поле);
	 	КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСортировкуПоляВТаблице(ЭлементТабПоле,ИмяДанныхПоля) Экспорт
	ЭлементУП = ЭлементТабПоле.НастройкаПорядка.Найти(ИмяДанныхПоля);
	Если ЭлементУП <> Неопределено Тогда
	   ЭлементУП.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьПовторяющиесяЭлементы(Массив) Экспорт
	
	Если ТипЗнч(Массив) = Тип("Массив") Тогда
		ОписаниеТиповСправочники = Справочники.ТипВсеСсылки();
		ОписаниеТиповДокументы = Документы.ТипВсеСсылки();
		ОписаниеТиповПВХ = ПланыВидовХарактеристик.ТипВсеСсылки();
		ОписаниеТиповПланыСчетов = ПланыСчетов.ТипВсеСсылки();
		ОписаниеТиповПланыРасчета = ПланыВидовРасчета.ТипВсеСсылки();
		БылоНеопределено = Ложь;
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			УжеВМасссиве = Новый Соответствие;			
			КолвоЭлементовВМассиве = Массив.Количество();
			Для ОбратныйИндекс = 1 По КолвоЭлементовВМассиве Цикл
				ЭлементМассива = Массив[КолвоЭлементовВМассиве - ОбратныйИндекс];
				Если ЭлементМассива = Неопределено Тогда
					Если БылоНеопределено Тогда
						Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс);
					Иначе
						БылоНеопределено = Истина;					
					КонецЕсли;
					Продолжить;
				КонецЕсли;				
				ТипЭлемента = ТипЗнч(ЭлементМассива);
				Если (ОписаниеТиповСправочники.СодержитТип(ТипЭлемента)
					ИЛИ ОписаниеТиповДокументы.СодержитТип(ТипЭлемента)
					ИЛИ ОписаниеТиповПВХ.СодержитТип(ТипЭлемента)
					ИЛИ ОписаниеТиповПланыСчетов.СодержитТип(ТипЭлемента)
					ИЛИ ОписаниеТиповПланыРасчета.СодержитТип(ТипЭлемента)) Тогда
					ИДЭлемента = Строка(ЭлементМассива.УникальныйИдентификатор());
				Иначе
					ИДЭлемента = ЭлементМассива;
				КонецЕсли;
				Если УжеВМасссиве[ИДЭлемента] = Истина Тогда
					Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс);
				Иначе
					УжеВМасссиве.Вставить(ИДЭлемента, Истина);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//список значений в таблицу значений
Функция СЗвТЗ(СЗ, ИмяКолонки = "Поле", ЗаголовокКолонки = Неопределено) Экспорт

	Если ЗаголовокКолонки = Неопределено Тогда
		ЗаголовокКолонки = ИмяКолонки
	КонецЕсли;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить(ИмяКолонки,,ЗаголовокКолонки);
	Для Каждого Элемент Из СЗ Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ[ИмяКолонки] = Элемент.Значение;
	КонецЦикла;
	Возврат ТЗ;
		
КонецФункции // СЗвТЗ()

//функция получает, равно ли значение определенного ключа структуры переданному значению. 
//Истина если равно, ложь - если нет, не структура или нет свойства
//ПроверятьТип - проверяется не само значение а тип свойства структуры (передается тип)
//TODO - возможность отправлять не только ключ, а еще и массив для обработки вложенных структур
Функция СравнитьСоЗначениемВСтруктуре(Структура, Ключ, Значение, ПроверятьТип = Ложь) Экспорт

	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Если ПроверятьТип Тогда
			Результат = ТипЗнч(Структура[Ключ]) = Значение
		Иначе
			Результат = Структура[Ключ] = Значение
		КонецЕсли;
	Иначе
		Результат = Ложь
	КонецЕсли;
	Возврат Результат

КонецФункции // СравнитьСоЗначениемВСтруктуре()

Процедура УстановитьТекстВБуферОбмена(Текст) Экспорт
	
	#Если Клиент Тогда 
    Объект = Новый COMОбъект("htmlfile");
    Объект.ParentWindow.ClipboardData.Setdata("Text", Текст);
	#КонецЕсли 

КонецПроцедуры

Функция ПолучитьТекстБуфераОбмена() Экспорт
	
	#Если Клиент Тогда
    Объект = Новый COMОбъект("htmlfile");
    Возврат Объект.ParentWindow.ClipboardData.Getdata("Text");
#КонецЕсли

КонецФункции

Функция МассивВСЗ(Массив) Экспорт

	СЗ = Новый СписокЗначений;
	Для Каждого ЭлементМассива Из Массив Цикл
		СЗ.Добавить(ЭлементМассива);
	КонецЦикла;
	Возврат СЗ;

КонецФункции // МассивВСЗ()

Функция ПолучитьПодстрокуВыделеннуюСимволами(Стр, СимволНачала = "(", СимволКонца = ")") Экспорт

	Результат = "";
	ИндНач = Найти(Стр, СимволНачала);
	Если ИндНач <> 0 Тогда
		ИндКон = Найти(Стр, СимволКонца);
		Если ИндКон <> 0 И ИндКон > ИндНач Тогда
			Результат = Сред(Стр, ИндНач, ИндКон - ИндНач)
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьПодстрокуВыделеннуюСимволами()

