#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	уб_ФормыВызовСервера.ЗаписатьКонтактнуюИнформацию(ЭтаФорма,"Объект",Отказ);
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма._ОтветственныеЛица,"СтруктурнаяЕдиница",ТекущийОбъект.Ссылка,,ИСТИНА);
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма._БанковскиеСчета,"Владелец",ТекущийОбъект.Ссылка,,ИСТИНА);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтактнаяИнформация
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.КПП.Видимость = НЕ Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьФорму()
	уб_ФормыВызовСервера.ДобавитьКонтактнуюИнформацию(ЭтаФорма,Объект.Ссылка,"Объект",Элементы.КонтактнаяИнформация,1);
	уб_ФормыВызовСервера.ДобавитьОбщиеРеквизиты(ЭтаФорма,Объект.Ссылка);	
	
	//Отключили многострочный режим
	Если Найти (Объект.НаименованиеДляДоговоровИПлатежныхДокументов,Символы.ПС) Тогда
		Объект.НаименованиеДляДоговоровИПлатежныхДокументов = СтрЗаменить(Объект.НаименованиеДляДоговоровИПлатежныхДокументов,Символы.ПС," ");
	КонецЕсли;	
	
	Если Найти (Объект.НаименованиеПолное,Символы.ПС) Тогда
		Объект.НаименованиеПолное = СтрЗаменить(Объект.НаименованиеПолное,Символы.ПС," ");
	КонецЕсли;
	
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма._ОтветственныеЛица,"СтруктурнаяЕдиница",Объект.Ссылка,,ИСТИНА);
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма._БанковскиеСчета,"Владелец",Объект.Ссылка,,ИСТИНА);
	
	ПравоИзменения = ПравоДоступа("Изменение",Метаданные.Справочники.Организации);
	Если ПравоИзменения = ЛОЖЬ Тогда
		Элементы._БанковскиеСчета  .ТолькоПросмотр = Истина;
		Элементы._ОтветственныеЛица.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти



