

Функция ПоказатьИзначальныйПолис(НовыйПолис)  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ЗаданияНаПролонгацию.СтраховойПолис,
	|	уб_ЗаданияНаПролонгацию.ТипЗадания
	|ИЗ
	|	РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
	|ГДЕ
	|	уб_ЗаданияНаПролонгацию.НовыйПолис = &НовыйПолис
	|	И уб_ЗаданияНаПролонгацию.ТипЗадания = ЛОЖЬ";
	Запрос.УстановитьПараметр("НовыйПолис",НовыйПолис);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтраховойПолис;
	Иначе
		Возврат Документы.уб_СтраховойПолис.ПустаяСсылка();
	КонецЕсли;
КонецФункции


Функция НайтиПодходящийПолис(НовыйПолис,СоздаватьЗадание = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_СтраховойПолис.Ссылка,
	|	уб_СтраховойПолис.ДатаНачала,
	|	уб_СтраховойПолис.ВидС,
	|	уб_СтраховойПолис.Страхователь,
	|	уб_СтраховойПолис.ОбъектСтрахования,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(уб_ТранспортныеСредства.ИдентификационныйНомер, """") КАК СТРОКА) КАК ИдентификационныйНомер,
	|	уб_СтраховойПолис.Дата,
	|	СтарыеПолиса.Ссылка КАК СтарыйПолис,
	|	СтарыеПолиса.ДатаНачала КАК ДатаНачалаСтарый,
	|	СтарыеПолиса.ОбъектСтрахования КАК ОбъектСтрахованияСтарый,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(уб_ТранспортныеСредства2.ИдентификационныйНомер, """") КАК СТРОКА) КАК ИдентификационныйНомерСтарый
	|ПОМЕСТИТЬ Первоначальный
	|ИЗ
	|	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	|		ПО уб_СтраховойПолис.ОбъектСтрахования = уб_ТранспортныеСредства.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК СтарыеПолиса
	|		ПО уб_СтраховойПолис.ВидС = СтарыеПолиса.ВидС
	|			И (СтарыеПолиса.ДатаНачала < уб_СтраховойПолис.ДатаНачала)
	|			И уб_СтраховойПолис.Страхователь = СтарыеПолиса.Страхователь
	|			И (НЕ уб_СтраховойПолис.Ссылка = СтарыеПолиса.Ссылка)
	|			И (НЕ СтарыеПолиса.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства2
	|		ПО (СтарыеПолиса.ОбъектСтрахования = уб_ТранспортныеСредства2.Объект)
	|ГДЕ
	|	уб_СтраховойПолис.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Первоначальный.Ссылка,
	|	Первоначальный.ДатаНачала КАК ДатаНачала,
	|	Первоначальный.ДатаНачалаСтарый КАК ДатаНачалаСтарый,
	|	Первоначальный.ВидС,
	|	Первоначальный.Страхователь,
	|	Первоначальный.ОбъектСтрахования,
	|	Первоначальный.ИдентификационныйНомер,
	|	Первоначальный.Дата,
	|	Первоначальный.СтарыйПолис,
	|	Первоначальный.ОбъектСтрахованияСтарый,
	|	Первоначальный.ИдентификационныйНомерСтарый
	|ИЗ
	|	Первоначальный КАК Первоначальный
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Первоначальный.ВидС В (ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКО),ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.КАСКОПП), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ЕКАСКО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.ОСАГО), ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтрахования.КАСКО))
	|					И Первоначальный.ИдентификационныйНомер ПОДОБНО ВЫРАЗИТЬ(Первоначальный.ИдентификационныйНомерСтарый КАК СТРОКА)
	|				ТОГДА ИСТИНА
	|			КОГДА Первоначальный.ОбъектСтрахования = Первоначальный.ОбъектСтрахованияСтарый
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	//|	И НЕ Первоначальный.СтарыйПолис В
	//|				(ВЫБРАТЬ
	//|					УжеСвязанные.СтраховойПолис
	//|				ИЗ
	//|					РегистрСведений.уб_ЗаданияНаПролонгацию КАК УжеСвязанные)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалаСтарый УБЫВ";
	Запрос.УстановитьПараметр("Ссылка",НовыйПолис);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если СоздаватьЗадание Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уб_ЗаданияНаПролонгацию.СтраховойПолис КАК СтраховойПолис,
			|	уб_ЗаданияНаПролонгацию.ТипЗадания КАК ТипЗадания
			|ИЗ
			|	РегистрСведений.уб_ЗаданияНаПролонгацию КАК уб_ЗаданияНаПролонгацию
			|ГДЕ
			|	уб_ЗаданияНаПролонгацию.НовыйПолис = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",НовыйПолис);
			ВыборкаУжеЕсть = Запрос.Выполнить().Выбрать();
			Пока ВыборкаУжеЕсть.Следующий() Цикл
				Мз = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
				Мз.СтраховойПолис = ВыборкаУжеЕсть.СтраховойПолис;
				Мз.ТипЗадания = ВыборкаУжеЕсть.ТипЗадания; 
				мз.Прочитать();
				Если Мз.Выбран() Тогда
					Мз.Удалить();
				КонецЕсли;	
				
				
			КонецЦикла;	
			Мз = РегистрыСведений.уб_ЗаданияНаПролонгацию.СоздатьМенеджерЗаписи();
			Мз.СтраховойПолис = Выборка.СтарыйПолис;
			Мз.НовыйПолис = НовыйПолис;
			Мз.ТипЗадания = Ложь;//Пролонгация
			Мз.Записать();
		КонецЕсли;	
		Возврат Выборка.СтарыйПолис
	Иначе
		Возврат Документы.уб_СтраховойПолис.ПустаяСсылка();
	КонецЕсли;	
КонецФункции 