// Обработчик события УстановкаПараметровСеанса()
//
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	
	
	Если ТребуемыеПараметры = Неопределено Тогда
		// инициализация параметра сеанса "ТекущийПользователь"
		ПолныеПрава.УстановитьПараметрСеансаТекущийПользователь();	
		ПолныеПрава.УстановитьИзменяемыеПараметрыСеансаПользователя(Истина);
		УстановкаСоответствияКвитанцийДляСК();
		Если РольДоступна("уб_МенеджерНаТочке") и Не РольДоступна("ПолныеПрава") Тогда
			ПараметрыСеанса.уб_ЭтоМенеджер = Истина;
		Иначе	
			ПараметрыСеанса.уб_ЭтоМенеджер = Ложь;
		КонецЕсли;	
		ПараметрыСеанса.уб_РежимОтладки = 0;
		
		//уб_temp.УстановкаПараметраСеансаВнешниеСервисы();
		Структура = Новый Структура("ДоступенШлюзCRM, ДоступенСерверSVS, ДоступенСерверB2B", Истина, Истина, Истина);
	    ПараметрыСеанса.уб_ВнешниеСервисы = Новый ФиксированнаяСтруктура(Структура);
		//уб_СтраховойБрокер.УстановкаПараметраСеансаВнешниеСервисы();
		
		ОсновноеПодразделение = уб_СС.ПолучитьПодразделениеАгента(ПараметрыСеанса.уб_ТекущееФизЛицо,,Истина);
		
		ПараметрыСеанса.уб_ОсновноеПодразделение = ОсновноеПодразделение;//Обычно это уже верное подразделение
		//
		уб_ВызовСервера.УстановитьПараметрыСеансаКонстант();//Требуется основное подразделение
		//ПолучитьЗначениеПоУмолчанию() использует константы
		ПараметрыСеанса.уб_ОсновнаяОрганизация = уб_ВызовСервера.ПолучитьЗначениеКонстанты("ОсновнаяОрганизация");//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
		
		Если ОсновноеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
			ОсновноеПодразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновноеПодразделениеОрганизации");
		КонецЕсли;
		ПараметрыСеанса.уб_ОсновноеПодразделение = ОсновноеПодразделение;
		
		ПараметрыСеанса.уб_Количество_ТОП_дляСписков = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "КоличествоТОПДляСписков");
		ПараметрыСеанса.уб_КомпонентаПадежейИнициализирована = Ложь;
		ПараметрыСеанса.уб_ДатаНачалаСеанса = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры // УстановкаПараметровСеанса

Процедура УстановкаСоответствияКвитанцийДляСК()
	Возврат;//Неиспользуется
	ЗапросВидамБСОА7 = Новый Запрос("ВЫБРАТЬ
	                      |	уб_ВидыБСО.Ссылка,
	                      |	уб_ВидыБСО.Владелец КАК СК,
	                      |	уб_ВидыБСО.ТипУчетаБСО,
	                      |	уб_ВидыБСО.УниверсальноеБСО,
	                      |	уб_ВидыБСО.ДатаОкончанияДействия,
	                      |	уб_ВидыБСО.УниверсальноеБСООбязательно,
	                      |	уб_ВидыБСО.Наименование
	                      |ИЗ
	                      |	Справочник.уб_ВидыБСО КАК уб_ВидыБСО
	                      |ГДЕ
	                      |	уб_ВидыБСО.Тип = &Тип");
	ЗапросВидамБСОА7.УстановитьПараметр("Тип",Перечисления.уб_ТипыБСО.КвитанцияА7);
	Соответствие = Новый Соответствие;
	Выборка = ЗапросВидамБСОА7.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Соответствие.Получить(Выборка.СК)= Неопределено Тогда
			Структура = Новый Соответствие;
			Структура.Вставить("ВидБСО", Выборка.Ссылка);
			Структура.Вставить("ТипУчетаБСО", Выборка.ТипУчетаБСО);
			Структура.Вставить("УниверсальноеБСО", Выборка.УниверсальноеБСО);
			Структура.Вставить("УниверсальноеБСООбязательно", Выборка.УниверсальноеБСООбязательно);
			Структура.Вставить("Наименование", Выборка.Наименование);
			Соответствие.Вставить(Выборка.СК,Новый ФиксированноеСоответствие(Структура));
		Конецесли;	
	КонецЦикла;	
	Структура = Новый Соответствие;
	Структура.Вставить("ВидБСО", Справочники.уб_ВидыБСО.ПустаяСсылка());
	Структура.Вставить("ТипУчетаБСО", Перечисления.уб_ТипыУчетаБСО.ПустаяСсылка());
	Структура.Вставить("УниверсальноеБСО", Ложь);
	Структура.Вставить("УниверсальноеБСООбязательно", Ложь);
	Структура.Вставить("Наименование", "");
	Соответствие.Вставить(Справочники.Контрагенты.ПустаяСсылка(),Новый ФиксированноеСоответствие(Структура));
	//ПараметрыСеанса.КвитанцииА7ДляСК = Новый ФиксированноеСоответствие(Соответствие);
КонецПроцедуры

