#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияФормы();
КонецПроцедуры
#КонецОбласти

#Область КомандыСписка
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.СК) КАК СК,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВидБСО) КАК ВидБСО,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаОплатыСтрока) КАК ФормаОплатыСтрока
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Список)";
				   
	
	_Скидки = Неопределено;
	Ключи = Строки.ПолучитьКлючи();
	Запрос.УстановитьПараметр("Список",Ключи);		
	
	
	СтраховыеКомпании = Запрос.Выполнить().Выгрузить();	
	Ссылки = СтраховыеКомпании.Скопировать();
	Ссылки.Свернуть("Ссылка");
	Для каждого Ссылка из Ссылки Цикл
		СтрокаСписка = Строки[Ссылка.Ссылка];    
		
		Масс = СтраховыеКомпании.НайтиСтроки(Новый Структура("Ссылка",Ссылка.Ссылка));
		СтрокаСК = "";
		СтрокаВидыСП = "";
		СтрокаОплаты = "";
		Для каждого СтрокаБСО из Масс Цикл
			Если найти(СтрокаСК,СтрокаБСО.СК) = 0 Тогда
				СтрокаСК = СтрокаСК+""+?(СтрокаСК="","",", ")+СтрокаБСО.СК;
			КонецЕсли;	
			Если найти(СтрокаВидыСП,СтрокаБСО.ВидБСО) = 0 Тогда
				СтрокаВидыСП = СтрокаВидыСП+""+?(СтрокаВидыСП="","",", ")+СтрокаБСО.ВидБСО;
			КонецЕсли;	
			Если найти(СтрокаОплаты,СтрокаБСО.ФормаОплатыСтрока) = 0 Тогда
				СтрокаОплаты = СтрокаОплаты+""+?(СтрокаОплаты="","",", ")+СтрокаБСО.ФормаОплатыСтрока;
			КонецЕсли;	
		КонецЦикла;
		
		Попытка
			СтрокаСписка.Оформление["СК"].УстановитьЗначениеПараметра("Текст",  СтрокаСК);
			СтрокаСписка.Оформление["Город"].УстановитьЗначениеПараметра("Текст",  СтрокаВидыСП);
			
			Если ПустаяСтрока(СтрокаОплаты) Тогда
				СтрокаОплаты = Строка(Ссылка.Ссылка.ФормаОплаты)
			КонецЕсли;	
			СтрокаСписка.Оформление["ФормаОплаты"].УстановитьЗначениеПараметра("Текст",  СтрокаОплаты);
			//СтрокаСписка.Оформление["Наименование"].УстановитьЗначениеПараметра("ЦветТекста",  Новый Цвет(200,200,200));
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.РежимВыбора = Истина Тогда
		ОповеститьОВыборе(Элементы.Список.ТекущаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ФункцииПоиска
&НаКлиенте
Процедура ПриИзмененииФильтра(Элемент)
	Фильтр()
КонецПроцедуры

&НаСервере
Процедура Фильтр() Экспорт
	СтруктурыФильтра = Новый Массив;
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Менеджер",          эуПоискМенеджер,           Неопределено, НЕ эуПоискМенеджер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Курьер",            эуПоискКурьер,             Неопределено, НЕ эуПоискКурьер.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Номер",      _Число(эуПоискНомер),      Неопределено, НЕ ПустаяСтрока(эуПоискНомер)));
	Если ТипЗнч(эуПоискНомерЗаявки) = Тип("Строка") Тогда 
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",_Число(эуПоискНомерЗаявки),Неопределено, НЕ ПустаяСтрока(эуПоискНомерЗаявки)));
	Иначе
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","НомерЗаявки",эуПоискНомерЗаявки,Неопределено, ЗначениеЗаполнено(эуПоискНомерЗаявки)));
	КонецЕсли;	
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","БСО.СК",эуСК,Неопределено,НЕ эуСК.Пустая()));
	
	Если СтрДлина(эуПоискСтрахователь)>=3 Тогда
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  уб_ВызовСервера.СтрахователиПоНаименованию(эуПоискСтрахователь),
		                                                                                                            ВидСравненияКомпоновкиДанных.ВСписке, НЕ ПустаяСтрока(эуПоискСтрахователь)));
		//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СтраховательНаименование", эуПоискСтрахователь, ВидСравненияКомпоновкиДанных.Содержит,НЕ ПустаяСтрока(эуПоискСтрахователь)));
	Иначе
		
		//Отключаем
		СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.ВСписке,ЛОЖЬ));
		//СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","СтраховательНаименование",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.Содержит,ЛОЖЬ));
	КонецЕсли;	

	//Если СтрДлина(эуПоискСтрахователь)>=3 Тогда
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  уб_ВызовСервера.СтрахователиПоНаименованию(эуПоискСтрахователь),
	//	                                                                                                            ВидСравненияКомпоновкиДанных.ВСписке, НЕ ПустаяСтрока(эуПоискСтрахователь)));
	//Иначе
	//	//Отключаем
	//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Страхователь",  эуПоискСтрахователь,ВидСравненияКомпоновкиДанных.Равно,ЛОЖЬ));
	//КонецЕсли;	
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","Тип",               эуПоискТипВыезда, Неопределено, НЕ эуПоискТипВыезда.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","БСО.ФормаОплатыСтрока",       эуФормаОплаты,    Неопределено, НЕ эуФормаОплаты.Пустая()));
	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование","БСО.ВидБСО",        эуПоискВидСП,     Неопределено, НЕ эуПоискВидСП.Пустая()));
	
	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра);
КонецПроцедуры	

&НаКлиенте
Процедура эуПоискСтраховательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	Если СтрДлина(Текст)>4 тогда
//		эуПоискСтрахователь = Текст;
//		Фильтр();
//	КонецЕсли;	
	//ОтключитьОбработчикОжидания("Фильтр");
	//ПодключитьОбработчикОжидания("Фильтр",0.3,Истина);
КонецПроцедуры

&НаКлиенте
Процедура эуПоискСтраховательИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//Если СтрДлина(Текст)>4 Тогда
	//	
	//	//СтандартнаяОбработка = Ложь;
	//	Если Не эуПоискСтрахователь = Текст Тогда
	//		эуПоискСтрахователь = Текст;
	//		Фильтр();
	//	КонецЕсли;	
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура эуПоискСтраховательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура эуСКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),Элемент);
	//TODO Переделать под управляемые формы
	//ПараметрыОткрытия= уб_СС.ПараметрыНачалаВыбора();
	//ПараметрыОткрытия.Вставить("МенюПоТипам",     Новый Структура("Контрагенты",Истина));
	//ПараметрыОткрытия.Вставить("ОтображениеМеню", Новый Структура("Контрагенты",Истина));
	//
	//Если Элемент.Имя = "эуСК" Тогда
	//	ПараметрыОткрытия.Вставить("Значение",эуСК);
	//КонецЕсли;	
	//ПараметрыОткрытия.Вставить("ИмяФормыВыбора","ФормаВыбораУправляемая");
	//уб_СС.ВыборПоставщика(Элемент, СтандартнаяОбработка,,ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура эуПоискМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Сотрудники"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры

&НаКлиенте
Процедура эуПоискКурьерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.ФизическиеЛица.Курьеры"));
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",Новый Структура("Отбор,РежимВыбора",ПараметрыОтбора,Истина),Элемент);
КонецПроцедуры


&НаКлиенте
Процедура эуПоискНомерЗаявкиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	эуПоискНомерЗаявки   = "";
	Фильтр();
КонецПроцедуры


&НаСервереБезКонтекста
Функция _Число(Число)
	Если  ПустаяСтрока(Число) Тогда
		Возврат 0
	Иначе
		Попытка
			Возврат Число(Число);
		Исключение
			Возврат 0
		КонецПопытки;	
	КонецЕсли;	
КонецФункции	


#КонецОбласти

#Область Вспомогательные

&НаСервере
Процедура ИнициализацияФормы()
	ОбновитьСпискиВыбора();
	
	Если Параметры.РежимВыбора Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
		//скрываем колонки
		
		Элементы.ВремяНачало.Видимость		= Ложь;
		Элементы.ВремяВстречи.Видимость  	= Ложь;
		Элементы.ВремяОкончания.Видимость   = Ложь;
		Элементы.СтатусЗаявки.Видимость			= Ложь;
	КонецЕсли;
	
	НовыйПараметр = Новый ПараметрВыбора("ЭтоСотрудник", Истина);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы.эуПоискМенеджер.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСпискиВыбора()
	
	Запрос  = Новый Запрос;
	РасчетныйПериод = ТекущаяДата();//НачалоМесяца(ТекущаяДата())-1;
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(РасчетныйПериод));					   
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(ТекущаяДата()));					   
	
	ЭтоПолныеПрава = Ложь;
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") 
		или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.КураторВыездных, Ложь) 
		или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПросмотрВсехПолисовИЗаявок, Ложь) 
		Тогда
		ЭтоПолныеПрава = Истина;
		ПодчиненныеРуководителя = Неопределено;
	Иначе	
		ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
		ПараметрыПодчиненных.ВключаяВыбывших = Истина;
		ПодчиненныеРуководителя = уб_СС.ПодчиненныеРуководителя(,РасчетныйПериод,  ПараметрыПодчиненных);
	КонецЕсли;
	
	Если ПодчиненныеРуководителя = Неопределено или СокрЛП(ПараметрыПодчиненных.ПодразделениеСотрудника) = "СВС" Тогда
		ПодчиненныеРуководителя = Неопределено;//ДЛя СВС
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ  Разрешенные
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер
		|ИЗ
		|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		|ГДЕ
		|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
		|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
		|	И (НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Менеджер.Наименование";
		СписокМенеджеров = Новый СписокЗначений;
		СписокМенеджеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");
	Иначе
		СписокМенеджеров = ПодчиненныеРуководителя.ВыгрузитьЗначения(); 
		///Запрос.Текст = "ВЫБРАТЬ Разрешенные
		//|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка
		//|ИЗ
		//|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
		//|ГДЕ
		//|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер В(&Менеджер)
		//|   или уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.Преемник  В(&Менеджер)
		//|	ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер В(&Менеджер)";
		//Запрос.УстановитьПараметр("Менеджер",СписокМенеджеров);
		//ДоступныеЗаявки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		//Если ЭтоПолныеПрава = Ложь Тогда
		//	СтруктурыФильтра = Новый Массив;
		//	СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Ссылка",ДоступныеЗаявки,ВидСравненияКомпоновкиДанных.ВСписке, Истина,"Скрытое"));
		//	уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра,Истина);
		//КонецЕсли;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	ФизическиеЛица.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
				               |ГДЕ
				               |	(ФизическиеЛица.Ссылка В (&Менеджер)
				               |			ИЛИ ФизическиеЛица.Преемник В (&Менеджер))";
		Запрос.УстановитьПараметр("Менеджер",СписокМенеджеров);
		ДоступныеФизлица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если ЭтоПолныеПрава = Ложь Тогда
			СтруктурыФильтра = Новый Массив;
			СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Менеджер",ДоступныеФизлица,ВидСравненияКомпоновкиДанных.ВСписке, Истина,"Скрытое"));
			СтруктурыФильтра.Добавить(Новый Структура("ИмяПоля,Значение,ВидСравнения,Использование,Представление","Курьер",ДоступныеФизлица,ВидСравненияКомпоновкиДанных.ВСписке, Истина,"Скрытое"));
			уб_ФормыВызовСервера.УстановитьОтборыСписка(ЭтаФорма.Список,СтруктурыФильтра,Истина);
		КонецЕсли;

	КонецЕсли;
	
	Элементы.эуПоискМенеджер.СписокВыбора.ЗагрузитьЗначения(СписокМенеджеров);
	Элементы.эуПоискМенеджер.ВысотаСпискаВыбора = Мин(30,СписокМенеджеров.Количество());	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ   Разрешенные
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер КАК Курьер
	|ИЗ
	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	|ГДЕ
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата >= &ДатаНач
	|	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата <= &ДатаКон
	|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПометкаУдаления
	|	И НЕ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Самовыезд
	|
	|УПОРЯДОЧИТЬ ПО
	|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование";
	СписокКурьеров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Курьер");
	Элементы.эуПоискКурьер.СписокВыбора.ЗагрузитьЗначения(СписокКурьеров);
	Элементы.эуПоискКурьер.ВысотаСпискаВыбора = Мин(30,СписокКурьеров.Количество());	
	
	
	
	
	СписокВыбора =	Элементы.эуСК.СписокВыбора;
	СписокВыбора.Очистить();
	Для каждого ЭлементСписка из уб_СЛ.ПолучитьСписокСК() Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);
	КонецЦикла;	
	Элементы.эуСК.ВысотаСпискаВыбора = Мин(20,СписокВыбора.Количество());
	
	
	СписокВыбора = Новый Массив;
	СписокВыбора.Добавить(Перечисления.уб_ВидыЗаявок.Личная);
	СписокВыбора.Добавить(Перечисления.уб_ВидыЗаявок.Агентская);
	Элементы.эуПоискНомерЗаявки.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	Элементы.эуПоискНомерЗаявки.КнопкаВыпадающегоСписка = Истина;
	эуПоискНомерЗаявки = "";
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗаявкаНаЗаказВыездногоСпециалиста" Тогда
		//Элементы.Список.Обновить();
		//Для агентов отбор идет по ссылке, список не видит нового документа
		ОбновитьСпискиВыбора();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СтараяФорма(Команда)
	ОткрытьФорму("Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Форма.ФормаСписка",Новый Структура("РежимВыбора",ЛОЖЬ));
КонецПроцедуры

&НаКлиенте
Процедура эуПоискНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Найти(Текст,Символы.НПП)>0 Тогда
		Текст = СтрЗаменить(Текст,Символы.НПП,"")
	КонецЕсли;	
	Если Найти(Текст," ")>0 Тогда
		Текст = СтрЗаменить(Текст," ","");
	КонецЕсли;	
	Если СтрДлина(Текст) = 6 Тогда
		эуПоискНомер = Текст;
		Фильтр();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура эуПоискНомерЗаявкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 5 Тогда
		эуПоискНомерЗаявки = Текст;
		Фильтр();
	КонецЕсли;	
КонецПроцедуры






#КонецОбласти
