Процедура РасчитатьЗП(ПараметрыРасчетаЗП =Неопределено,Форма=Неопределено) Экспорт

	Если ПараметрыРасчетаЗП = Неопределено Тогда
		ПараметрыРасчетаЗП = Новый Структура("НачПериода,КонПериода,ВключитьЗаводы,РабочийРежим",Форма.НачПериода,КонецДня(Форма.КонПериода),Ложь,Форма.РабочийРежим);
	КонецЕсли;	
	
	//Дополним параметрами
	ПолучитьПараметрыРасчетаЗП(ПараметрыРасчетаЗП,Форма);

	//Результаты
	ПараметрыРасчетаЗП.Вставить("За_СКВ_До_Планки_По_Моторам",0);
	ПараметрыРасчетаЗП.Вставить("За_СКВ_До_Планки_По_НЕ_Моторам",0);
	ПараметрыРасчетаЗП.Вставить("Коэффициент_По_КВ",0);
	ПараметрыРасчетаЗП.Вставить("За_СКВ_Сверх_Планки_По_Моторам",0);
	ПараметрыРасчетаЗП.Вставить("За_СКВ_Сверх_Планки_По_НЕ_Моторам",0);
	ПараметрыРасчетаЗП.Вставить("ИнфоСтрока","");
	ПараметрыРасчетаЗП.Вставить("ЗП",0);
	ПараметрыРасчетаЗП.Вставить("ЗП_БезОклада",0);
	
	
	Если ПараметрыРасчетаЗП.СКВ_Моторы <= ПараметрыРасчетаЗП.Планка_СКВ_По_Моторам Тогда
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам = ПараметрыРасчетаЗП.СКВ_Моторы * ПараметрыРасчетаЗП.Процент_От_СКВ_До_Планки/100;
	Иначе
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам = ПараметрыРасчетаЗП.Планка_СКВ_По_Моторам * ПараметрыРасчетаЗП.Процент_От_СКВ_До_Планки/100;
	КонецЕсли;
	
	Если ПараметрыРасчетаЗП.СКВ_Не_Моторы <= ПараметрыРасчетаЗП.Планка_СКВ_По_Не_Моторам Тогда
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам = ПараметрыРасчетаЗП.СКВ_Не_Моторы * ПараметрыРасчетаЗП.Процент_От_СКВ_До_Планки/100;
	Иначе
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам = ПараметрыРасчетаЗП.Планка_СКВ_По_Не_Моторам * ПараметрыРасчетаЗП.Процент_От_СКВ_До_Планки/100;
	КонецЕсли;
	
	Если ПараметрыРасчетаЗП.КВ_Моторы >ПараметрыРасчетаЗП.КВ_По_Мотрам_На_Старте Тогда
		ПараметрыРасчетаЗП.Коэффициент_По_КВ = ПараметрыРасчетаЗП.КВ_По_Мотрам_На_Старте/ПараметрыРасчетаЗП.КВ_Моторы;
	Иначе
		ПараметрыРасчетаЗП.Коэффициент_По_КВ = 1;
	КонецЕсли;
	
	
	// Мотивационная часть за Моторы сверх Планки зависит от КВ
	Если ПараметрыРасчетаЗП.СКВ_Моторы <= ПараметрыРасчетаЗП.Планка_СКВ_По_Моторам Тогда
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам = 0;
	Иначе
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам = (ПараметрыРасчетаЗП.СКВ_Моторы - ПараметрыРасчетаЗП.Планка_СКВ_По_Моторам)
															* ПараметрыРасчетаЗП.Процент_От_СКВ_Сверх_Планки_По_Моторам/100 * ПараметрыРасчетаЗП.Коэффициент_По_КВ;
	КонецЕсли;
	
	
	// Мотивационная часть за НЕ Моторы сверх планки НЕ зависит от КВ
	Если ПараметрыРасчетаЗП.СКВ_Не_Моторы <= ПараметрыРасчетаЗП.Планка_СКВ_По_Не_Моторам Тогда
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам = 0;
	Иначе
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам = (ПараметрыРасчетаЗП.СКВ_Не_Моторы - ПараметрыРасчетаЗП.Планка_СКВ_По_Не_Моторам) 
																* ПараметрыРасчетаЗП.Процент_От_СКВ_Сверх_Планки_По_Не_Моторам/100;
	КонецЕсли;
	
	Если ПараметрыРасчетаЗП.НачПериода<Дата(2019,8,1) Тогда
		ДопЧасть = Окр(ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам +  ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам +  ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам + ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам,2);
	Иначе
		ДопЧасть = 0;
		Если ПараметрыРасчетаЗП.НачПериода>=Дата(2021,10,1) Тогда
			ВсегоСКВ  = ПараметрыРасчетаЗП.СКВ_по_КВ_Для_Агента;
		Иначе	
			ВсегоСКВ = ПараметрыРасчетаЗП.СКВ_Моторы+ПараметрыРасчетаЗП.СКВ_Не_Моторы;
		КонецЕсли;	
		Если ВсегоСКВ>7000000 Тогда
			ДопЧасть = (ВсегоСКВ-7000000)*5/100;
		КонецЕсли;	
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам = 0;
		ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам = 0;
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам = 0;
		ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам = 0;
	КонецЕсли;	
	
	ПараметрыРасчетаЗП.ЗП = Окр(ПараметрыРасчетаЗП.Оклад + ДопЧасть,2);
	                   
	ПараметрыРасчетаЗП.ЗП_БезОклада = Окр(ДопЧасть,2);
	
	Инфо = "ЗП = "                      + Формат(ПараметрыРасчетаЗП.ЗП,"ЧЦ=7; ЧДЦ=0; ЧН=0; ЧГ=3,0")
	+ Символы.ПС + "Оклад = "           + Формат(ПараметрыРасчетаЗП.Оклад,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=3,0") 
	+ Символы.ПС +  "Моторы База = "    + Формат(ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=3,0")
	+ Символы.ПС + "Не Моторы База = "  + Формат(ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=3,0")
	+ Символы.ПС + "Моторы Сверх = "    + Формат(ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=3,0")
	+ Символы.ПС + "Не Моторы Сверх = " + Формат(ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=3,0")
	+ Символы.ПС + "(Коэфф КВ = "       + Формат(ПараметрыРасчетаЗП.Коэффициент_По_КВ,"ЧЦ=3; ЧДЦ=2; ЧН=0") + ")"; 
	Если НЕ Форма=Неопределено  Тогда
		Форма.Инфо = Инфо;
	КонецЕсли;	

КонецПроцедуры

Функция ПолучитьПараметрыРасчетаЗП(ПараметрыРасчетаЗП,Форма=Неопределено) Экспорт
	//Исходные
	Если ПараметрыРасчетаЗП.Свойство("РабочийРежим") и ПараметрыРасчетаЗП.РабочийРежим = Истина Тогда
		ПараметрыРасчетаЗП.Вставить("Оклад"                                    ,80000);
		//ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Моторам"                    ,8082987);
		//ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Не_Моторам"                 ,94527);
		//На лето 2017
		ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Моторам"                    ,7000000);
		ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Не_Моторам"                 ,230000);
		
		ПараметрыРасчетаЗП.Вставить("КВ_По_Мотрам_На_Старте"                   ,21.65);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_До_Планки"                 ,0.5);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_Сверх_Планки_По_Моторам"   ,7);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_Сверх_Планки_По_Не_Моторам",10);
		Если Не Форма = Неопределено Тогда
			Форма.Оклад                      = ПараметрыРасчетаЗП.Оклад;
			Форма.Планка_СКВ_По_Моторам      = ПараметрыРасчетаЗП.Планка_СКВ_По_Моторам;
			Форма.Планка_СКВ_По_Не_Моторам   = ПараметрыРасчетаЗП.Планка_СКВ_По_Не_Моторам;
			Форма.Процент_От_СКВ_До_Планки     = ПараметрыРасчетаЗП.Процент_От_СКВ_До_Планки;
			Форма.КВ_По_Мотрам_На_Старте     = ПараметрыРасчетаЗП.КВ_По_Мотрам_На_Старте;
			Форма.Процент_От_СКВ_Сверх_Планки_По_Моторам     = ПараметрыРасчетаЗП.Процент_От_СКВ_Сверх_Планки_По_Моторам;
			Форма.Процент_От_СКВ_Сверх_Планки_По_Не_Моторам     = ПараметрыРасчетаЗП.Процент_От_СКВ_Сверх_Планки_По_Не_Моторам;
		КонецЕсли;
	Иначе
		ПараметрыРасчетаЗП.Вставить("Оклад"                                    ,Форма.Оклад);
		ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Моторам"                    ,Форма.Планка_СКВ_По_Моторам);
		ПараметрыРасчетаЗП.Вставить("Планка_СКВ_По_Не_Моторам"                 ,Форма.Планка_СКВ_По_Не_Моторам);
		ПараметрыРасчетаЗП.Вставить("КВ_По_Мотрам_На_Старте"                   ,Форма.КВ_По_Мотрам_На_Старте);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_До_Планки"                 ,Форма.Процент_От_СКВ_До_Планки);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_Сверх_Планки_По_Моторам"   ,Форма.Процент_От_СКВ_Сверх_Планки_По_Моторам);
		ПараметрыРасчетаЗП.Вставить("Процент_От_СКВ_Сверх_Планки_По_Не_Моторам",Форма.Процент_От_СКВ_Сверх_Планки_По_Не_Моторам);
		ПараметрыРасчетаЗП.Вставить("СКВ_Моторы",    Форма.СКВ_МОТОРы);
		ПараметрыРасчетаЗП.Вставить("СКВ_Не_Моторы", Форма.СКВ_Не_Моторы);
		ПараметрыРасчетаЗП.Вставить("КВ_Моторы",     Форма.КВ_Моторы);
		Возврат ПараметрыРасчетаЗП
	КонецЕсли;
	
	//ПолучаемАктуальныеДанные
	Уровень = 0;
	МассивЗапросов = ВернутьЗапросы(Отчеты.СтатистикаСКВиКВ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"),Уровень);
	//Сообщить("Запросов "+МассивЗапросов.Количество());
	Если МассивЗапросов.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = МассивЗапросов[0];
		Запрос.НайтиПараметры();
		Для каждого парЗапроса из  Запрос.НайтиПараметры() Цикл
			//Сообщить(парЗапроса.Имя);
			Если парЗапроса.Имя = "ДатаНачала" Тогда
				Запрос.УстановитьПараметр(парЗапроса.Имя,ПараметрыРасчетаЗП.НачПериода);
			ИначеЕсли парзапроса.Имя = "ДатаКонца" Тогда
				Запрос.УстановитьПараметр(парЗапроса.Имя,ПараметрыРасчетаЗП.КонПериода);
			ИначеЕсли парзапроса.Имя = "ВключитьЗаводы" Тогда	
				Запрос.УстановитьПараметр(парЗапроса.Имя, ПараметрыРасчетаЗП.ВключитьЗаводы);
			Иначе
				Сообщить("Незаданный параметр"+парзапроса.Имя);
				Возврат ПараметрыРасчетаЗП;
			КонецЕсли;	
		КонецЦикла;	
		РезЗапроса = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаР из РезЗапроса Цикл
			//Сообщить(СтрокаР.СКВ_Все_МОТОРы);
			//СКВ_Моторы = 9000000;
		    //СКВ_Не_Моторы = 300000;
	        //КВ_Моторы = 25;
			ПараметрыРасчетаЗП.Вставить("СКВ_Моторы",    СтрокаР.СКВ_Все_МОТОРы);
			ПараметрыРасчетаЗП.Вставить("СКВ_Не_Моторы", СтрокаР.СКВ_аг_ПРОЧЕЕ_НеЛички);
			ПараметрыРасчетаЗП.Вставить("КВ_Моторы",     СтрокаР.СрКВ_для_Агента_По_Моторам);
			ПараметрыРасчетаЗП.Вставить("СКВ_по_КВ_Для_Агента",     СтрокаР.СКВ_по_КВ_Для_Агента);
			
			Если Не Форма = Неопределено Тогда
				Форма.СКВ_МОТОРы    = ПараметрыРасчетаЗП.СКВ_Моторы;
		        Форма.СКВ_Не_Моторы = ПараметрыРасчетаЗП.СКВ_Не_Моторы;
		        Форма.КВ_Моторы     = ПараметрыРасчетаЗП.КВ_Моторы;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	

КонецФункции	


Функция ВернутьЗапросы(МакетКомпоновки, Уровень,Массив = Неопределено) Экспорт
	Если Массив = Неопределено Тогда
		Массив = Новый Массив;
	КонецЕсли;	
	Для каждого Набор из МакетКомпоновки.НаборыДанных Цикл
		//Сообщить("Уровень "+Уровень+": "+Набор.Имя);
		Массив.Добавить(Набор.Запрос);
		Попытка
			Для каждого ЭлементТела из МакетКомпоновки.Тело Цикл
				Если ТипЗнч(ЭлементТела)=Тип("ГруппировкаМакетаКомпоновкиДанных") Тогда
					Для каждого ЭлементТелаГруппировки из ЭлементТела.Тело Цикл
						Если ТипЗнч(ЭлементТелаГруппировки)=Тип("ВложенныйОбъектМакетаКомпоновкиДанных") Тогда
							ВернутьЗапросы(ЭлементТелаГруппировки.КомпоновкаДанных, Уровень+1,Массив)
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат Массив;

КонецФункции