
//ВидБСО возможные типы: Вид БСО, Страховой продукт, или массив или сз с этими типами
//НеПодходящиеПоУсловие - выберет все условия, отличные от параметра
Функция РезультатЗапросаСвязанныхБСО(Знач ВидБСО, ТолькоСУсловием = Ложь, Условие = "", ТипСравненияУсловияРавно = Истина) Экспорт

	ТипЗнч = ТипЗнч(ВидБСО);
	Если ТипЗнч = Тип("Массив") Или ТипЗнч = Тип("СписокЗначений") Тогда
		Массив = ВидБСО
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(ВидБСО);
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВБ.БСО КАК БСО,
	|	ВБ.БСО.Владелец КАК БСОВладелец,
	|	ВЫРАЗИТЬ(ВБ.УсловиеДобавления КАК СТРОКА(100)) КАК УсловиеДобавления,
	|	ВБ.УсловиеВидаЗаявокЛичная КАК УсловиеВидаЗаявокЛичная//,
	//|	ВБ.БСО.ПлановаяСтоимость КАК ПлановаяСтоимость
	|ИЗ
	|	Справочник.уб_ВидыБСО.СвязанныеБСО КАК ВБ
	|ГДЕ
	|	ВБ.ДобавлятьВЗаявку
	|	И ВБ.Ссылка В(&Массив)
	|	И НЕ ВБ.БСО = ЗНАЧЕНИЕ(Справочник.уб_ВидыБСО.ПустаяСсылка)
	|	И &УсловиеГде
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВБ.БСО,
	|	ВБ.БСО.Владелец,
	|	ВЫРАЗИТЬ(ВБ.УсловиеДобавления КАК СТРОКА(100)),
	|	ВБ.УсловиеВидаЗаявокЛичная//,
//	|	ВБ.БСО.ПлановаяСтоимость КАК ПлановаяСтоимость
	|ИЗ
	|	Справочник.уб_СтраховыеПродукты.ВидыБСО КАК уб_СтраховыеПродуктыВидыБСО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ВидыБСО.СвязанныеБСО КАК ВБ
	|		ПО уб_СтраховыеПродуктыВидыБСО.ВидБСО = ВБ.Ссылка
	|ГДЕ
	|	ВБ.ДобавлятьВЗаявку
	|	И уб_СтраховыеПродуктыВидыБСО.Ссылка В(&Массив)
	|	И НЕ ВБ.БСО = ЗНАЧЕНИЕ(Справочник.уб_ВидыБСО.ПустаяСсылка)
	|	И &УсловиеГде";
	Если ТолькоСУсловием Тогда
		ТекстЗамены = "НЕ ВЫРАЗИТЬ(ВБ.УсловиеДобавления КАК СТРОКА(6)) = ""Всегда""";
	Иначе
		ТекстЗамены = "ИСТИНА";
	КонецЕсли;
	Если Условие <> "" Тогда
		ДлинаСтрокиУсловия = СтрДлина(Условие);
		ТекстЗамены = ТекстЗамены + " И " + ?(ТипСравненияУсловияРавно, "", "НЕ ") + "ВЫРАЗИТЬ(ВБ.УсловиеДобавления КАК СТРОКА(" + ДлинаСтрокиУсловия + ")) = """ + Условие + """";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", ТекстЗамены);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Массив", Массив);
	Возврат Запрос.Выполнить();

КонецФункции // ВыборкаСвязанныхБСОПоВидуБСОИлиСтраховомуПродукту()
