Функция ТекстЗапросаМенеджеры() экспорт
	Возврат "ВЫБРАТЬ
	               |	уб_РуководителиПодразделенийСрезПоследних.Период,
	               |	уб_РуководителиПодразделенийСрезПоследних.Подразделение,
	               |	уб_РуководителиПодразделенийСрезПоследних.Заместитель,
	               |	уб_РуководителиПодразделенийСрезПоследних.Сотрудник,
	               |	уб_РуководителиПодразделенийСрезПоследних.Уход,
	               |	уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство
	               |ПОМЕСТИТЬ Руководители
	               |ИЗ
	               |	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ДатаСреза, ) КАК уб_РуководителиПодразделенийСрезПоследних
	               |ГДЕ
	               |	уб_РуководителиПодразделенийСрезПоследних.Уход = ЛОЖЬ
	               |	И уб_РуководителиПодразделенийСрезПоследних.Заместитель = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	руководители.Период,
	               |	руководители.Подразделение,
	               |	руководители.Заместитель,
	               |	руководители.Сотрудник,
	               |	руководители.Уход,
	               |	руководители.ПолучаетВознаграждениеЗаРуководство
	               |ИЗ
	               |	Руководители КАК руководители
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДФ.Агент КАК Агент,
	               |	ДФ.Подразделение,
	               |	ДФ.Агент.Категория как Категория,
				   |	ДФ.Выбытие
	               |ИЗ
	               |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаСреза, ) КАК ДФ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Руководители КАК Руководители
	               |		ПО (Руководители.Подразделение = ДФ.Подразделение)
	               |ГДЕ
	               |	ДФ.Подразделение.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.ТочкаПродаж)
	               //|	И НЕ ДФ.Подразделение = &Подразделение
	               |	И НЕ ДФ.Подразделение.Наименование = ""Агентская сеть""
	               |	И НЕ ДФ.Подразделение.Наименование = ""Отдел развития""
	               |	И НЕ ДФ.Подразделение.Наименование = ""Дирекция""
	               |	И НЕ ДФ.Подразделение.Наименование = ""Операторы БД""
				   |	И НЕ ДФ.Подразделение.Наименование = ""Отдел сопровождения договоров страхования""				   
	               |	И (&ПоВсем = ИСТИНА
	               |			ИЛИ ДФ.Агент В (&Агенты))
	               |	И (&ВыбПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |			ИЛИ ДФ.Подразделение = &ВыбПодразделение)
	               |	И (&ВыбКатегория = ЗНАЧЕНИЕ(Справочник.уб_КатегорииПерсонала.ПустаяСсылка)
	               |			ИЛИ ДФ.Агент.Категория = &ВыбКатегория)
	               //|	И ДФ.Выбытие = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               //|	
				   |	ДФ.Агент.Категория.Наименование,
				   |	ДФ.Подразделение.Наименование,
	               |	ВЫБОР
	               |		КОГДА Руководители.Сотрудник = ДФ.Агент
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ,
	               |	ДФ.Агент.Наименование";
	
КонецФункции
