
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Создает печатную форму по параметрам
//
// Параметры
//	Наименование - Строка - наименование печатной формы
// 
//	ДокументКонфигурации - Строка - Имя объекта документ в конфигурации
//
//	ИспользоватьДляСпискаЗастрахованных - Булево - признак использования для списка застрахованных
//
//	ТабличныйДокумент - ТабличныйДокумент - макет формы
//
//	ТекстовыйДокумент - ТекстовыйДокумент - код формы
//
Процедура СоздатьПечатнуюФорму(Наименование, ДокументКонфигурации, ИспользоватьДляСпискаЗастрахованных, ТабличныйДокумент, ТекстовыйДокумент) Экспорт
	//ПечатнаяФорма = Справочники.уб_ПечатныеФормы.СоздатьЭлемент();
	//ПечатнаяФорма.Наименование = Наименование;
	////ПечатнаяФорма.СтраховойПродукт = Ссылка;
	//ПечатнаяФорма.ДокументКонфигурации = ДокументКонфигурации;
	////ПечатнаяФорма.ИспользоватьДляСпискаЗастрахованных = ИспользоватьДляСпискаЗастрахованных;
	//ПечатнаяФорма.СохранитьМакет(ТабличныйДокумент);
	//ПечатнаяФорма.СохранитьТекст(ТекстовыйДокумент);
	//ПечатнаяФорма.Записать();	
КонецПроцедуры // СоздатьПечатнуюФорму()

// Создает все печатные формы по ОСАГО
//
// Параметры
//	Нет
//
Процедура СоздатьПечатныеФормыОСАГО() Экспорт

	// Полис ОСАГО
	СоздатьПечатнуюФорму("Полис ОСАГО", "ДСП", Ложь, ПолучитьМакет("МакетПолисОСАГО"), ПолучитьМакет("КодПолисОСАГО"));

	// Заявление
	СоздатьПечатнуюФорму("Заявление", "ДСП", Ложь, ПолучитьМакет("МакетЗаявлениеОСАГО"), ПолучитьМакет("КодЗаявлениеОСАГО"));
	
	// Тарифы ОСАГО
	СоздатьПечатнуюФорму("Тарифы ОСАГО", "ДСП", Ложь, ПолучитьМакет("МакетТарифыОСАГО"), ПолучитьМакет("КодТарифыОСАГО"));
	
	// Приложение 4
	СоздатьПечатнуюФорму("Приложение №4", "ДСП", Ложь, ПолучитьМакет("МакетПриложение4ОСАГО"), ПолучитьМакет("КодПриложение4ОСАГО"));
	
	// тоже самое на по допсу
	
	// Полис ОСАГО
	СоздатьПечатнуюФорму("Полис ОСАГО (Допс)", "ДопсДСП", Ложь, ПолучитьМакет("МакетПолисОСАГО"), ПолучитьМакет("КодПолисОСАГО"));

	// Заявление
	СоздатьПечатнуюФорму("Заявление (Допс)", "ДопсДСП", Ложь, ПолучитьМакет("МакетЗаявлениеОСАГО"), ПолучитьМакет("КодЗаявлениеОСАГО"));
	
	// Тарифы ОСАГО
	СоздатьПечатнуюФорму("Тарифы ОСАГО (Допс)", "ДопсДСП", Ложь, ПолучитьМакет("МакетТарифыОСАГО"), ПолучитьМакет("КодТарифыОСАГО"));
	
	// Приложение 4
	СоздатьПечатнуюФорму("Приложение №4 (Допс)", "ДопсДСП", Ложь, ПолучитьМакет("МакетПриложение4ОСАГО"), ПолучитьМакет("КодПриложение4ОСАГО"));
	
КонецПроцедуры // СоздатьПечатныеФормыОСАГО()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ
