
Функция Getpolicy(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_СтраховойПолис.Ссылка,
	                      |	уб_СтраховойПолис.Дата,
	                      |	уб_СтраховойПолис.Номер,
	                      |	уб_СтраховойПолис.ДатаНачала,
	                      |	уб_СтраховойПолис.ДатаОкончания,
	                      |	уб_СтраховойПолис.Страхователь,
	                      |	уб_СтраховойПолис.СтраховаяПремия,
	                      |	уб_СтраховойПолис.СтраховаяСумма,
	                      |	уб_СтраховойПолис.ОбъектСтрахования,
	                      |	уб_СтраховойПолис.СтраховойПродукт,
	                      |	уб_СтраховойПолис.СК.Наименование  Как НаименованиеСК
	                      |ИЗ
	                      |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	                      |ГДЕ
	                      |	уб_СтраховойПолис.НомерЗаявки = &НомерЗаявки");
						  
	ЗапроС.УстановитьПараметр("НомерЗаявки",Число(Параметр.id));
	result = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package2.org", "result")); 
	
	Выборка = ЗапроС.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
	
	
	
		item = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package2.org", "resItem"));
		item.id     = Строка(Выборка.Ссылка.УникальныйИдентификатор());;
		item.name   = Строка(Выборка.Страхователь);;
		item.date  =  Строка(Выборка.Дата);
		item.dateBegin  = Строка(Выборка.ДатаНачала);
		item.dateEnd  = Строка(Выборка.ДатаОкончания);
		item.object  = Строка(Выборка.ОбъектСтрахования);
		item.product  = Строка(Выборка.СтраховойПродукт);
		item.insureCompany  = Выборка.НаименованиеСК;
		
		result.items.Добавить(item);
	КонецЦикла;
	
	Возврат result; 
	
						  
	
КонецФункции

Функция Zapros(text, parametr)
	Запрос = Новый Запрос;
	Запрос.Текст  = text;
	Структура = ЗначениеизСтрокиВнутр(parametr);
	Для каждого Элемент из Структура Цикл
		Запрос.УстановитьПараметр(Элемент.Имя,Элемент.Значение);
	КонецЦикла;	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ЗначениеВСтрокуВнутр(ТЗ);
КонецФункции
