&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Строка(Объект.Тип) ="Автомобиль" Тогда
		ПрочитатьДанныеАвто();
		Элементы.МаркаТС.Видимость  = Истина;
		Элементы.МодельТС.Видимость = Истина;
		Элементы.VIN.Видимость      = Истина;
	Иначе
		Элементы.МаркаТС.Видимость  = ЛОЖЬ;
		Элементы.МодельТС.Видимость = ЛОЖЬ;
		Элементы.VIN.Видимость      = ЛОЖЬ;
	КонецЕсли;	
КонецПроцедуры
	

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Строка(Объект.Тип) ="Автомобиль" Тогда
		ПрочитатьДанныеАвто();
		Элементы.МаркаТС.Видимость  = Истина;
		Элементы.МодельТС.Видимость = Истина;
		Элементы.VIN.Видимость      = Истина;
		Элементы.Наименование.Видимость = Ложь;
	Иначе
		Элементы.МаркаТС.Видимость  = ЛОЖЬ;
		Элементы.МодельТС.Видимость = ЛОЖЬ;
		Элементы.VIN.Видимость      = ЛОЖЬ;
		Элементы.Наименование.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры


Процедура ПрочитатьДанныеАвто();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_ТранспортныеСредства.Объект КАК Объект,
	               |	уб_ТранспортныеСредства.РегистрационныйЗнак КАК РегистрационныйЗнак,
	               |	уб_ТранспортныеСредства.ИдентификационныйНомер КАК ИдентификационныйНомер,
	               |	уб_ТранспортныеСредства.МаркаТС КАК МаркаТС,
	               |	уб_ТранспортныеСредства.МодельТС КАК МодельТС,
	               |	уб_ТранспортныеСредства.ТипТС КАК ТипТС,
	               |	уб_ТранспортныеСредства.Категория КАК Категория,
	               |	уб_ТранспортныеСредства.ГодВыпуска КАК ГодВыпуска,
	               |	уб_ТранспортныеСредства.ДвигательНомер КАК ДвигательНомер,
	               |	уб_ТранспортныеСредства.ШассиНомер КАК ШассиНомер,
	               |	уб_ТранспортныеСредства.КузовНомер КАК КузовНомер,
	               |	уб_ТранспортныеСредства.Цвет КАК Цвет,
	               |	уб_ТранспортныеСредства.МощностьДвигателя КАК МощностьДвигателя,
	               |	уб_ТранспортныеСредства.МаксМасса КАК МаксМасса,
	               |	уб_ТранспортныеСредства.КолПассажирскихМест КАК КолПассажирскихМест,
	               |	уб_ТранспортныеСредства.Грузоподъемность КАК Грузоподъемность,
	               |	уб_ТранспортныеСредства.ПротивоугоннаяСистема КАК ПротивоугоннаяСистема,
	               |	уб_ТранспортныеСредства.ПаспортСерия КАК ПаспортСерия,
	               |	уб_ТранспортныеСредства.ПаспортНомер КАК ПаспортНомер,
	               |	уб_ТранспортныеСредства.ПаспортДатаВыдачи КАК ПаспортДатаВыдачи
	               |ИЗ
	               |	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
	               |ГДЕ
	               |	уб_ТранспортныеСредства.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МаркаТС  = Выборка.МаркаТС;
		МодельТС = Выборка.МодельТС;
		VIN      = Выборка.ИдентификационныйНомер;
		год = выборка.ГодВыпуска;
		РегистрационныйЗнак = выборка.РегистрационныйЗнак;
		Мощность = Выборка.МощностьДвигателя;
	Иначе
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Строка(Объект.Тип) ="Автомобиль" Тогда
		Выборка = Регистрысведений.уб_ТранспортныеСредства.Выбрать(Новый Структура("Объект",Объект.ссылка));
		Если Выборка.Следующий() Тогда
			МЗ = регистрысведений.уб_ТранспортныеСредства.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		Иначе
			МЗ =регистрысведений.уб_ТранспортныеСредства.СоздатьМенеджерЗаписи();
			МЗ.Объект = Объект.Ссылка;
		КонецЕсли;
		МЗ.МаркаТС = МаркаТС;
		МЗ.МодельТС = МодельТС;
		МЗ.ИдентификационныйНомер = VIN;
		Мз.МощностьДвигателя =Мощность;
		МЗ.ГодВыпуска =Год;
		Мз.РегистрационныйЗнак = РегистрационныйЗнак;
		МЗ.Записать();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МаркаТСПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(МаркаТС)+" "+СокрЛП(МодельТС);
КонецПроцедуры

&НаКлиенте
Процедура МодельТСПриИзменении(Элемент)
	МаркаТСПриИзменении(Элемент);
КонецПроцедуры


