
Функция ДанныеАдресногоКлассификатора(Знач Параметры) Экспорт

	Массив = Новый Массив;
	Массив.Добавить("Регион");
	Массив.Добавить("Район");
	Массив.Добавить("Город");
	Массив.Добавить("НаселенныйПункт");
	Массив.Добавить("Улица");
	//Массив.Добавить("Дом");
	Для Индекс = 0 По Мин(Параметры.ТипАдресногоЭлемента - 1, 5) Цикл
		ОбработкаПоТипуЗаписиАдресногоКлассификатора(Параметры, Индекс + 1);	
	КонецЦикла;
	Если Параметры.ТипАдресногоЭлемента > 0
		И Параметры.ТипАдресногоЭлемента < 7
		Тогда
		Результат = Параметры.СписокВыбора
	Иначе
		Результат = Параметры.Результат;
	КонецЕсли;
	Возврат Результат

КонецФункции // КодЗаписиАдресногоКлассификатора()

Функция ОбработкаПоТипуЗаписиАдресногоКлассификатора(Параметры, ТипАдресногоЭлемента)

	Параметры.ЗаполнятьСписокВыбора = Параметры.ТипАдресногоЭлемента = ТипАдресногоЭлемента;
	ИмяТипаАдресногоЭлемента = Параметры.СоответствиеТипаАдресногоЭлементаНаименованию.Получить(ТипАдресногоЭлемента);
	ФильтрЗаполнен = Не ПустаяСтрока(Параметры[ИмяТипаАдресногоЭлемента]);
	Если Параметры.ОтсутствующийТипАдресногоЭлементаСтрока = ""
		И (Параметры.ЗаполнятьСписокВыбора Или ФильтрЗаполнен) Тогда
		Запрос = ЗапросКодаЗаписиАдресногоКлассификатора(Параметры, ТипАдресногоЭлемента);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Параметры.ОтсутствующийТипАдресногоЭлементаСтрока = ИмяТипаАдресногоЭлемента;
			Параметры.Результат = Новый Массив;
		Иначе
			Параметры["ЕстьФильтр" + ИмяТипаАдресногоЭлемента] = ФильтрЗаполнен;
			Параметры.ТекущийТипАдресногоЭлементаДляФильтра = ИмяТипаАдресногоЭлемента;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ФильтрЗаполнен 
					И (Не Параметры.ЗаполнятьСписокВыбора 
						Или Выборка.Наименование = Параметры[ИмяТипаАдресногоЭлемента]
					)
					Тогда
					Попытка
						Параметры["МассивКодов" + ИмяТипаАдресногоЭлемента].Добавить(Выборка.Код);
					Исключение
						Сообщить(ОписаниеОшибки());
						ФильтрЗаполнен = Ложь;
					КонецПопытки;	
				КонецЕсли;
				Если Параметры.ЗаполнятьСписокВыбора Тогда
					
					Если Параметры.ДобавлятьСокращение Тогда
						ДобавляемоеЗначение = ?(ПустаяСтрока(Выборка.Сокращение),Выборка.Наименование, СокрЛП(Выборка.Наименование) + " " + СокрЛП(Выборка.Сокращение));
					Иначе
						ДобавляемоеЗначение = Выборка.Наименование;
					КонецЕсли;
					Если Параметры.СписокВыбора.НайтиПоЗначению(ДобавляемоеЗначение) = Неопределено Тогда
						Параметры.СписокВыбора.Добавить(ДобавляемоеЗначение);
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			Если ФильтрЗаполнен Тогда
				Параметры.Результат = Параметры["МассивКодов" + ИмяТипаАдресногоЭлемента];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецФункции

Функция УсловиеГдеКодаЗаписиАдресногоКлассификатора(МассивКодов, Интервал)

	УсловиеГде = "";
	Для Каждого Код Из МассивКодов Цикл
		УсловиеГде = УсловиеГде + "АК.Код МЕЖДУ " + СтрЗаменить(Код, Символ(160), "") + " И " + СтрЗаменить(Код + Интервал, Символ(160), "") + Символы.ПС + Символы.Таб + "И ";
	КонецЦикла;
	Возврат УсловиеГде;

КонецФункции // ДополнитьУсловиеГдеКодаЗаписиАдресногоКлассификатора()

Функция ЗапросКодаЗаписиАдресногоКлассификатора(Параметры, ТипАдресногоЭлемента)

	ИмяТипаАдресногоЭлемента = Параметры.СоответствиеТипаАдресногоЭлементаНаименованию.Получить(ТипАдресногоЭлемента);
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АК.Код КАК Код,
	|	&Выборка
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АК
	|ГДЕ
	|	АК.ТипАдресногоЭлемента = &ТипАдресногоЭлемента
	|	И &УсловиеГде";
	Запрос.УстановитьПараметр("ТипАдресногоЭлемента", ТипАдресногоЭлемента);
	УсловиеГде = "";
	Если Не ПустаяСтрока(Параметры[ИмяТипаАдресногоЭлемента]) 
		И Не Параметры.ЗаполнятьСписокВыбора
		Тогда
		Если Параметры.ИскатьССокращением И Найти(СокрЛП(Параметры[ИмяТипаАдресногоЭлемента]), " ") > 1 Тогда
			УсловиеГде = УсловиеГде + "(АК.Наименование = &Наименование ИЛИ АК.Наименование + "" "" + АК.Сокращение = &НаименованиеССокращением)";
			ДлинаСокращения = 0;
			Для Счетчик = - СтрДлина(Параметры[ИмяТипаАдресногоЭлемента]) По - 1 Цикл
				Символ = Сред(Параметры[ИмяТипаАдресногоЭлемента], - Счетчик, 1);
				Если Символ = " " Тогда
					Прервать;
				Иначе
					ДлинаСокращения = ДлинаСокращения + 1
				КонецЕсли;
			КонецЦикла;
			ДлинаРеквизита = 12;
			НаименованиеССокращением = Параметры[ИмяТипаАдресногоЭлемента];
			Для Счетчик = 1 По ДлинаРеквизита - ДлинаСокращения Цикл
				НаименованиеССокращением = НаименованиеССокращением + " ";
			КонецЦикла;
			Запрос.УстановитьПараметр("НаименованиеССокращением", НаименованиеССокращением);
		Иначе
			УсловиеГде = УсловиеГде + "АК.Наименование = &Наименование";
		КонецЕсли;
		УсловиеГде = УсловиеГде + Символы.ПС + Символы.Таб + "И ";
		Запрос.УстановитьПараметр("Наименование", Параметры[ИмяТипаАдресногоЭлемента]);
	КонецЕсли;
	Если Параметры.ТекущийТипАдресногоЭлементаДляФильтра <> "" Тогда
		ДопТекст = Параметры.ТекущийТипАдресногоЭлементаДляФильтра;
		УсловиеГде = УсловиеГде + УсловиеГдеКодаЗаписиАдресногоКлассификатора(Параметры["МассивКодов" + ДопТекст], Параметры["Интервал" + ДопТекст]);	
	КонецЕсли;
	Если УсловиеГде = "" Тогда
		УсловиеГде = "ИСТИНА"
	Иначе
		УсловиеГде = Лев(УсловиеГде, СтрДлина(УсловиеГде) - 2);
	КонецЕсли;
	Если Параметры.ЗаполнятьСписокВыбора Тогда
		// получаем список выбора - это конечный этап
		ТекстВыборка = "АК.Наименование КАК Наименование," + Символы.ПС + Символы.Таб + "АК.Сокращение КАК Сокращение" + Символы.ПС + Символы.Таб;
		УсловиеГде = УсловиеГде+Символы.ПС+"Упорядочить по АК.Наименование";
	Иначе
		ТекстВыборка = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Выборка",	ТекстВыборка);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеГде", УсловиеГде);
	Возврат Запрос;
	
КонецФункции // ТекстОсновногоЗапросаКодаЗаписиАдресногоКлассификатора()

Функция ПараметрыФункцииДанныеАдресногоКлассификатора() Экспорт

	Структура = Новый Структура;
	// Входящие параметры (типы адресного элементы)
	Структура.Вставить("Индекс",				"");
	Структура.Вставить("Регион",				"");
	Структура.Вставить("Район",					"");
	Структура.Вставить("Город",					"");
	Структура.Вставить("НаселенныйПункт",		"");
	Структура.Вставить("Улица",					"");
	Структура.Вставить("Дом",					"");
	Структура.Вставить("Корпус",				"");
	Структура.Вставить("Квартира",				"");
	Структура.Вставить("Представление",			"");
	Структура.Вставить("ДобавлятьСокращение",   Истина);
	// для конечного отбора только по определенному типу адресного элемента (6 - самый нижний уровень, показывает все)
	//	по этому типу создается список выбора
	Структура.Вставить("ТипАдресногоЭлемента",	999);
	Структура.Вставить("КодКладра",	""); //ограниченного полем ТипАдресногоЭлемента
	// Исходящие параметры
	Структура.Вставить("Результат",		Новый Массив);
	Структура.Вставить("СписокВыбора",  Новый СписокЗначений);
	// 	в реквизите хранится именование параметра типа адресного элемента, заполненного при вызове и отсутствующего при вызове
	Структура.Вставить("ОтсутствующийТипАдресногоЭлементаСтрока", "");
	Структура.Вставить("МассивКодовРегион", 			Новый Массив);
	Структура.Вставить("МассивКодовРайон",				Новый Массив);
	Структура.Вставить("МассивКодовГород",				Новый Массив);
	Структура.Вставить("МассивКодовНаселенныйПункт",    Новый Массив);
	Структура.Вставить("МассивКодовУлица",				Новый Массив);
	// вспомогательные параметры
	Структура.Вставить("ТекущийТипАдресногоЭлементаДляФильтра", "");
	Структура.Вставить("ИнтервалРегион", 			100000000000000000000000 - 1);
	Структура.Вставить("ИнтервалРайон",				100000000000000000000 - 1);
	Структура.Вставить("ИнтервалГород",				100000000000000000 - 1);
	Структура.Вставить("ИнтервалНаселенныйПункт",	100000000000000 - 1);
	Структура.Вставить("ИнтервалУлица",				10000000000 - 1);
	Структура.Вставить("ИнтервалДом",				1000000 - 1);
	Структура.Вставить("ЕстьФильтрРегион",  		Ложь);
	Структура.Вставить("ЕстьФильтрРайон",			Ложь);
	Структура.Вставить("ЕстьФильтрГород",			Ложь);
	Структура.Вставить("ЕстьФильтрНаселенныйПункт", Ложь);
	Структура.Вставить("ЕстьФильтрУлица",			Ложь);
	Структура.Вставить("ЕстьФильтрДом",				Ложь);
	Структура.Вставить("ЗаполнятьСписокВыбора",		Ложь);
	Структура.Вставить("СоответствиеТипаАдресногоЭлементаНаименованию", СоответствиеТипаАдресногоЭлементаНаименованию());
	Структура.Вставить("ИскатьССокращением",		Истина);
	Возврат Структура;

КонецФункции // ПараметрыФункцииКодЗаписиАдресногоКлассификатора()

Функция СоответствиеТипаАдресногоЭлементаНаименованию()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1, "Регион");
	Соответствие.Вставить(2, "Район");
	Соответствие.Вставить(3, "Город");
	Соответствие.Вставить(4, "НаселенныйПункт");
	Соответствие.Вставить(5, "Улица");
	Соответствие.Вставить(6, "Дом");
	Возврат Соответствие;

КонецФункции // СоответствиеТипаАдресногоЭлементаНаименованию()

Функция ДанныеПоКоду(Код) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("Регион", 			СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("Район",				СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("Город",				СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("НаселенныйПункт",	СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("Улица",				СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("Дом",				СтруктураРесурсовАдресногоКлассификатора());
	Параметры.Вставить("Найдено", 				Ложь);
	Параметры.Вставить("ЕстьРегион", 			Ложь);
	Параметры.Вставить("ЕстьРайон",		    	Ложь);
	Параметры.Вставить("ЕстьГород",				Ложь);
	Параметры.Вставить("ЕстьНаселенныйПункт",	Ложь);
	Параметры.Вставить("ЕстьУлица",				Ложь);
	Параметры.Вставить("ЕстьДом",				Ложь);
	Параметры.Вставить("СоответствиеТипаАдресногоЭлементаНаименованию", СоответствиеТипаАдресногоЭлементаНаименованию());
	МассивКодов = Новый Массив;
	Параметры.Вставить("Код", Код);
	МассивКодов.Добавить(Параметры.Код);
	Параметры.Вставить("КодРегиона", Окр(Код, -23)); 
	МассивКодов.Добавить(Параметры.КодРегиона);
	Параметры.Вставить("КодРайона", Окр(Код, -20));
	МассивКодов.Добавить(Параметры.КодРайона);
	Параметры.Вставить("КодГорода", Окр(Код, -17));
	МассивКодов.Добавить(Параметры.КодГорода);
	Параметры.Вставить("КодНаселенногоПункта", Окр(Код, -14));
	МассивКодов.Добавить(Параметры.КодНаселенногоПункта);
	Параметры.Вставить("КодУлицы", Окр(Код, -9));
	МассивКодов.Добавить(Параметры.КодУлицы);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	АК.Наименование,
	|	АК.Сокращение,
	|	АК.Индекс,
	|	АК.АльтернативныеНазвания,
	|	АК.ТипАдресногоЭлемента
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АК
	|ГДЕ
	|	АК.Код В (&МассивКодов)");
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИмяТипаАдресногоЭлемента = Параметры.СоответствиеТипаАдресногоЭлементаНаименованию.Получить(Выборка.ТипАдресногоЭлемента);
			Параметры.Найдено = Истина;
			Параметры[ИмяТипаАдресногоЭлемента].Найдено = Истина;
			ЗаполнитьЗначенияСвойств(Параметры[ИмяТипаАдресногоЭлемента], Выборка);
			Параметры[ИмяТипаАдресногоЭлемента].Сокращение = СокрЛП(Выборка.Сокращение);
			Параметры["Есть" + ИмяТипаАдресногоЭлемента] = Истина;
		КонецЦикла;
	КонецЕсли;
	Возврат Параметры;

КонецФункции // ДанныеПоКоду()

Функция СтруктураРесурсовАдресногоКлассификатора()

	Структура = Новый Структура;
	Структура.Вставить("Найдено",					Ложь);
	Структура.Вставить("Наименование", 				"");
	Структура.Вставить("Сокращение",				"");
	Структура.Вставить("Индекс",					"");
	Структура.Вставить("АльтернативныеНазвания",    "");
	Возврат Структура;

КонецФункции // СтруктураРесурсовАдресногоКлассификатора()


Функция КодКладра(Регион,Район,ГородНаселенныйПункт) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	АК.Код / 1000000000000 КАК Значение,
	                      |	АК.КодРегионаВКоде,
	                      |	АК.КодРайонаВКоде,
	                      |	1 КАК приоритет
	                      |ПОМЕСТИТЬ Районы
	                      |ИЗ
	                      |	РегистрСведений.АдресныйКлассификатор КАК АК
	                      |ГДЕ
	                      |	АК.ТипАдресногоЭлемента = 2
	                      |	И АК.КодРегионаВКоде В
	                      |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |				АК.КодРегионаВКоде
	                      |			ИЗ
	                      |				РегистрСведений.АдресныйКлассификатор КАК АК
	                      |			ГДЕ
	                      |				АК.ТипАдресногоЭлемента = 1
	                      |				И АК.Наименование = &ПараметрРегион)
	                      |	И АК.Наименование = &ПараметрРайон
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Влож.Значение,
	                      |	Влож.КодРегионаВКоде,
	                      |	Влож.КодРайонаВКоде,
	                      |	Влож.приоритет КАК приоритет
	                      |ИЗ
	                      |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		АК.Код / 1000000000000 КАК Значение,
	                      |		АК.КодРегионаВКоде КАК КодРегионаВКоде,
	                      |		АК.КодРайонаВКоде КАК КодРайонаВКоде,
	                      |		1 КАК приоритет
	                      |	ИЗ
	                      |		РегистрСведений.АдресныйКлассификатор КАК АК
	                      |	ГДЕ
	                      |		АК.ТипАдресногоЭлемента = 1
	                      |		И АК.Наименование = &ПараметрРегион
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		АК.Код / 1000000000000,
	                      |		АК.КодРегионаВКоде,
	                      |		АК.КодРайонаВКоде,
	                      |		3 * ВЫБОР
	                      |			КОГДА Районы.КодРайонаВКоде ЕСТЬ NULL 
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 2
	                      |		КОНЕЦ
	                      |	ИЗ
	                      |		РегистрСведений.АдресныйКлассификатор КАК АК
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Районы КАК Районы
	                      |			ПО АК.КодРайонаВКоде = Районы.КодРайонаВКоде
	                      |	ГДЕ
	                      |		АК.ТипАдресногоЭлемента = 3
	                      |		И АК.Наименование = &ПараметрНП
	                      |		И АК.КодРегионаВКоде В
	                      |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |					АК.КодРегионаВКоде
	                      |				ИЗ
	                      |					РегистрСведений.АдресныйКлассификатор КАК АК
	                      |				ГДЕ
	                      |					АК.ТипАдресногоЭлемента = 1
	                      |					И АК.Наименование = &ПараметрРегион)
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |		АК.Код / 1000000000000,
	                      |		АК.КодРегионаВКоде,
	                      |		АК.КодРайонаВКоде,
	                      |		2 * ВЫБОР
	                      |			КОГДА Районы.КодРайонаВКоде ЕСТЬ NULL 
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 2
	                      |		КОНЕЦ
	                      |	ИЗ
	                      |		РегистрСведений.АдресныйКлассификатор КАК АК
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Районы КАК Районы
	                      |			ПО АК.КодРайонаВКоде = Районы.КодРайонаВКоде
	                      |	ГДЕ
	                      |		АК.ТипАдресногоЭлемента = 4
	                      |		И АК.Наименование = &ПараметрНП
	                      |		И АК.КодРегионаВКоде В
	                      |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |					АК.КодРегионаВКоде
	                      |				ИЗ
	                      |					РегистрСведений.АдресныйКлассификатор КАК АК
	                      |				ГДЕ
	                      |					АК.ТипАдресногоЭлемента = 1
	                      |					И АК.Наименование = &ПараметрРегион)) КАК Влож
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	приоритет УБЫВ");
Запрос.УстановитьПараметр("ПараметрРегион",Регион);
Запрос.УстановитьПараметр("ПараметрРайон",Район);
Запрос.УстановитьПараметр("ПараметрНП",ГородНаселенныйПункт);

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда
	КодКладра = Формат(Выборка.Значение,"ЧГ=");
Иначе
	КодКладра = "";
КонецЕсли;	
    Возврат КодКладра;
КонецФункции	


