
//http://localhost:8081/IB83/hs/json/doc
Функция docgo(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	
	Результат = "pong " + ТекущаяДата();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Результат);
	Возврат Ответ;
	
КонецФункции

//Функция docpost(Запрос)
//	Ответ = Новый HTTPСервисОтвет(200);
//	Возврат Ответ;
//КонецФункции

Функция docpost(Запрос)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());          //Входящий запрос JSON  
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	ОтветНазапрос = "";
	ГотовыйОтвет = "";
	ГотовыйJSONpost(Данные, ГотовыйОтвет ,ОтветНазапрос);
	
	Возврат  ГотовыйОтвет;
	
КонецФункции


Процедура ГотовыйJSONpost(Данные,Ответ,ОтветНаЗапрос)
	
	УстановитьПривилегированныйРежим(Истина);
	//ОтветНаЗапрос = "[123]";
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.УстановитьТелоИзСтроки("Ответ","UTF-8");
	//Возврат;
	
	//Если 1 = 1 Тогда
	//	ИсходнаяСтруктура = Структура("Ответ","авпрапрпропропро");
	ИсходнаяСтруктура = Новый Структура;
	//	ИсходнаяСтруктура.Вставить("Организации",Новый Массив);
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Данные.Свойство("apikey") = Ложь Тогда 
			Ответ = Ответ(405,"");
			Возврат 
		//ИначеЕсли  Данные.apikey<>"fce6566b-7754-4764-ade3-ac4fdff9e226" Тогда
		//	Ответ = Ответ(405,"");
		//	Возврат 
		ИначеЕсли apikey(Данные) = истина Тогда
			Если Данные.Свойство("command") Тогда
				
				Если Данные.command = "check" Тогда
					Ответ = ОтветНаcheck(Данные);	
					Возврат
				ИначеЕсли Данные.command = "today" или Данные.command = "todaylist" Тогда
					Ответ = ОтветНаList(Данные,"today");	
					Возврат	
				ИначеЕсли Данные.command = "tomorrow" или Данные.command = "tomorrow" Тогда
					Ответ = ОтветНаList(Данные,"tomorrow");	
					Возврат	
	
				ИначеЕсли Данные.command = "week" или Данные.command = "weeklist" Тогда
					Ответ = ОтветНаList(Данные,"week");	
					Возврат		
				ИначеЕсли Данные.command = "lastweek"  Тогда
					Ответ = ОтветНаList(Данные,"lastweek");	
					Возврат			
				ИначеЕсли Данные.command = "w_check"  Тогда
					Ответ = ОтветНаList(Данные,"w_check");	
					Возврат				
				ИначеЕсли Данные.command = "list"  Тогда
					Ответ = ОтветНаList(Данные,"list");	
					Возврат					
				ИначеЕсли Данные.command = "info"  Тогда
					Ответ = ОтветНаinfo(Данные);	
					Возврат				
				ИначеЕсли Данные.command = "upload"  Тогда
					Ответ = ОтветНаupload(Данные);	
					Возврат	
				ИначеЕсли Данные.command = "download"  Тогда
					Ответ = ОтветНаdownload(Данные);	
					Возврат		
				ИначеЕсли Данные.command = "delete"  Тогда
					Ответ = ОтветНаdelete(Данные);	
					Возврат	
				ИначеЕсли Данные.command = "pay_slip"  Тогда
					Ответ = ОтветНаpay_slip(Данные);	
					
					Возврат		
				ИначеЕсли Данные.command = "support"  Тогда
					Ответ = ОтветНаsupport(Данные);	
					
					Возврат		
	
				ИначеЕсли Данные.command = "get_task"  Тогда
					Ответ = ОтветНаget_task(Данные);	
					
					Возврат			
				ИначеЕсли Данные.command = "ЗАЯВКА"  Тогда
					Ответ = ОтветНаЗАЯВКА(Данные);	
					Возврат				
				ИначеЕсли Данные.command = "СООБЩЕНИЯ"  Тогда
					Ответ = ОтветНаСООБЩЕНИЯ(Данные);	
					Возврат				
				ИначеЕсли Данные.command = "СООБЩЕНИЕ"  Тогда
					Ответ = ОтветНаСООБЩЕНИЕ(Данные);	
					Возврат					
	 	 		ИначеЕсли Данные.command = "doc_type_list"  Тогда
					Ответ = ОтветНаdoc_type_list(Данные);	
					Возврат		
				ИначеЕсли Данные.command = "Страхователь"  Тогда
					Ответ = ОтветНаСтрахователь(Данные);	
					Возврат			
					//{"apikey":"fce6566b-7754-4764-ade3-ac4fdff9e226","command":"Страхователь","params":{"ФИО":"Однораленко Александр Сергеевич","ДР":"2026-09-04T00:00:00", "ПАСПОРТ" :"0101 020304" }}
				ИначеЕсли Данные.command = "Автомобиль"  Тогда
					Ответ = ОтветНаАвтомобиль(Данные);	
					Возврат			
				ИначеЕсли Данные.command = "uu"  Тогда
					Ответ = уб_Серверные.ОбработатьUU(Данные);	
					Возврат				
				ИначеЕсли Данные.command = "foto"  Тогда
					Ответ = ОтветНаfoto(Данные);		
				Иначе	
					Ответ = Ответ(404,"Неизвестная команда");
					Возврат 
				КонецЕсли;	
			Иначе	
				Ответ = Ответ(404,"");
				Возврат 	
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда
		//Обработка = Обработки.rdp_ЗагрузкаДанныхИзВнешнегоИсточника.Создать(); 
		//ИсходнаяСтруктура = Обработка.Загрузить(Данные);
		
	КонецЕсли;
	
	//Для 8.3
	//ЗаписьJSON = Новый ЗаписьJSON;                                                     // Генерируем ответ на запрос JSON
	//ЗаписьJSON.УстановитьСтроку();
	//
	//Попытка
	//	
	//	Записатьуб_СЕРВЕРные.JSON(ЗаписьJSON, ИсходнаяСтруктура);
	//	
	//Исключение
	//	
	//	ИнфоОшибкиЗаписатьJSON = ИнформацияОбОшибке();
	//	                                                 // Запись Ошибка Генерируем ответ на запрос JSON	
	//КонецПопытки;
	//
	//ОтветНаЗапрос = ЗаписьJSON.Закрыть();
	
	//Для 8.2
	//ОтветНаЗапрос = ЗначениеВСтрокуВнутр(ИсходнаяСтруктура);
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.УстановитьТелоИзСтроки(ОтветНаЗапрос ,"UTF-8");
	УстановитьПривилегированныйРежим(Ложь);
	//Возврат Ответ;
	
КонецПроцедуры

Функция Ответ(КодОшибки,Строка= "")
	Ответ = Новый HTTPСервисОтвет(КодОшибки);
	Если Найти(Строка,"{") = Ложь Тогда
		СтрокаОтвет = уб_СЕРВЕРные.JSON(Новый Структура("error",Строка));
	Иначе
		СтрокаОтвет = Строка
	КонецЕсли;	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвет,"UTF-8");
	Возврат Ответ
КонецФункции	

Функция ОтветНаcheck(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("taskid") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование как  Страхователь,
				|	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование как userid,
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id как tg_id
				|ИЗ
				|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				|		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				|ГДЕ
				|	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер";
				Запрос.УстановитьПараметр("Номер", Данные.params.taskid);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Структура = Новый Структура;
					Структура.Вставить("Номер",Выборка.Номер);
					Структура.Вставить("Дата",Выборка.Дата);
					Структура.Вставить("Страхователь",Выборка.Страхователь);
					Структура.Вставить("Статус",Выборка.Статус);
					Структура.Вставить("userid",Выборка.userid);
					Структура.Вставить("tg_id",Выборка.tg_id);
					
					Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				Иначе
					Ответ = Ответ(404,"Не найдена заявка");
					Возврат Ответ
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует taskid");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции


Функция ОтветНаinfo(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				
				Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
					tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				Иначе
					tg_id =  Строка(Данные.params.tg_id);
				КонецЕсли;	
				
				Парам = Новый Структура;
								
				Парам.Вставить("Условие",  " Ссылка.Номер = &Номер");
				Парам.Вставить("Условие2",  " Ссылка.Номер = &Номер");
				Парам.Вставить("Параметры", Новый Структура("tg_id,Номер",tg_id,Данные.params.request_id));
				
				Ответ = Новый Массив;
				Данные = ПолучитьВыборку(Парам);
				Выборка     = Данные.Заявки;
				Чеки = Данные.Чеки;
				Сообщения = Данные.Сообщения;
				Если Выборка.Следующий() Тогда
					Структура = ВыборкаВструктуру(Выборка,Чеки,Сообщения);
					
					Ответ.Добавить(Структура);
					
					Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				

				
				//Запрос = Новый Запрос;
				//Запрос.Текст = "ВЫБРАТЬ
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
				//               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь) КАК Страхователь,
				//               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование КАК userid,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id КАК tg_id,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент как ВремяНачало,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяОкончанияКлиент как ВремяОкончания,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
				//			   |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СтанцияМетро,
				//			   |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.МестоВстречи как Комментарий,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия - уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК Премия,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес,
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО.(
				//               |		ВидБСО,
				//               |		ИтогСтраховаяПремия,
				//               |		ИтогПредоставленнаяСкидка,
				//               |		ДатаНачала,
				//               |		ДатаОкончания,
				//               |		УидСтроки
				//               |	)
				//               |ИЗ
				//               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				//               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				//               |ГДЕ
				//               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер
				//               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id";
				//Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				//Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
				//	Запрос.УстановитьПараметр("tg_id", Формат(Данные.params.tg_id,"ЧГ="));
				//Иначе
				//	Запрос.УстановитьПараметр("tg_id", Строка(Данные.params.tg_id));
				//КонецЕсли;	
				//Выборка = Запрос.Выполнить().Выбрать();
				//Если Выборка.Следующий() Тогда
				//	Структура = Новый Структура;
				//	Структура.Вставить("Номер",Выборка.Номер);
				//	Структура.Вставить("Дата",Выборка.Дата);
				//	Структура.Вставить("Страхователь",Выборка.Страхователь);
				//	Структура.Вставить("Статус",Выборка.Статус);
				//	Структура.Вставить("userid",Выборка.userid);
				//	Структура.Вставить("tg_id",Выборка.tg_id);
				//	Структура.Вставить("Менеджер",Строка(Выборка.Менеджер));
				//	Структура.Вставить("Оператор",Строка(Выборка.Оператор));
				//	Структура.Вставить("СтанцияМетро",Строка(Выборка.СтанцияМетро));
				//	Структура.Вставить("Комментарий",СокрлП(Выборка.Комментарий));
				//	Структура.Вставить("Премия",Выборка.Премия);
				//	//Структура.Вставить("ВремяВстречи",Выборка.ВремяВстречи);
				//	Структура.Вставить("Адрес",Выборка.Адрес);
				//	
				//	МассивБСО = Новый Массив;
				//	
				//	Для каждого СтрокаБСО из Выборка.БСО.Выгрузить() Цикл
				//		СтруктураБСО = Новый Структура;
				//		СтруктураБСО.Вставить("Вид",Строка(СтрокаБСО.ВидБСО));
				//		СтруктураБСО.Вставить("Премия",СтрокаБСО.ИтогСтраховаяПремия-СтрокаБСО.ИтогПредоставленнаяСкидка);
				//		СтруктураБСО.Вставить("ДатаНачала",СтрокаБСО.ДатаНачала);
				//		СтруктураБСО.Вставить("ДатаОкончания",СтрокаБСО.ДатаОкончания);
				//		СтруктураБСО.Вставить("УидСтроки",СтрокаБСО.УидСтроки);						
				//		
				//		МассивБСО.Добавить(СтруктураБСО);
				//	КонецЦикла;	
				//	
				//	Структура.Вставить("БСО",МассивБСО);
					
					//Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				Иначе
					Ответ = Ответ(404,"Не найдена заявка проверьте пользователя или номер");
					Возврат Ответ
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции

Функция ОтветНаList(Данные,Вид)
	Дата1 = НачалоДня(ТекущаяДата());
	name = "";
	ЕстьЧек = Ложь;
	
		
	Если Вид = "today" Тогда
		Дата2 = КонецДня(Дата1);
	ИначеЕсли Вид = "tomorrow" Тогда
		Дата1 = КонецДня(Дата1)+1;
		Дата2 = КонецДня(Дата1);
	ИначеЕсли Вид = "week" Тогда
		Дата2 = КонецДня(Дата1+7*24*3600);
	ИначеЕсли Вид = "lastweek" Тогда
		Дата2 = КонецДня(Дата1);
		Дата1 = НачалоДня(Дата1-8*24*3600);
	ИначеЕсли Вид = "w_check" Тогда
		Дата2 = КонецДня(Дата1);
		//Дата1 = НачалоМесяца(НачалоМесяца(Дата1)-1);
		Дата1 = НачалоДня(Дата1-60*24*3600);
		ЕстьЧек = Истина;
	ИначеЕсли Вид = "list" Тогда
		Дата2 = КонецДня(Дата1+7*24*3600);
		Дата1 = НачалоДня(Дата1-60*24*3600);
		
	Иначе
		Ответ = Ответ(407,"Параметры имеют неизвестный формат");
		Возврат Ответ	
	КонецЕсли;	
	
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("name") Тогда
				Если Найти(Данные.params.name,"%") = 0 и СтрДлина(Данные.params.name)>4 тогда
					name = "%"+Данные.params.name+"%"
				КонецЕсли;	
			КонецЕсли;
			
			Если Данные.params.Свойство("date1") Тогда
				Дата1 =  ДатаИзСтроки(Данные.params.date1);
			КонецЕсли;
			
			Если Данные.params.Свойство("date2") Тогда
				Дата2 =  ДатаИзСтроки(Данные.params.date2);
			КонецЕсли;
			
			Если Данные.params.Свойство("w_check") Тогда
				ЕстьЧек =  Данные.params.w_check = Истина или Данные.params.w_check = "true" или Данные.params.w_check = "True";
			КонецЕсли;
			
		КонецЕсли;	
    КонецЕсли;

	
	
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("tg_id")  Тогда
				tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				
				
				Парам = Новый Структура;
				
				Если Вид ="w_check" или ЕстьЧек = Истина Тогда
					Условие = " Ссылка.Дата >= &Дата1 И Ссылка.Дата <= &Дата2
					//| И Чеки.УидСтроки есть null  
					|и уб_ИсторияСтатусовЗаявокСрезПоследних.Статус в (Значение(Перечисление.уб_СтатусыЗаявок.БСОНаРукахУКурьера),Значение(Перечисление.уб_СтатусыЗаявок.СтраховкаСостоялась),Значение(Перечисление.уб_СтатусыЗаявок.ЗаявкаОтработана),Значение(Перечисление.уб_СтатусыЗаявок.КомплектНаХраненииВБухгалтерии) ,Значение(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)) ";
				ИначеЕсли Вид ="list" Тогда	
					Условие = " Ссылка.Дата >= &Дата1 И Ссылка.Дата <= &Дата2 ";
					//Если пустаяСтрока(name) Тогда
					//	name = "Не будем искать";
					//КонецЕсли	
				Иначе	
					Условие = " Ссылка.Дата >= &Дата1 И Ссылка.Дата <= &Дата2";
				КонецЕсли;
				
				Если не пустаяСтрока(name) Тогда
					Условие =  Условие + " И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование подобно &name ";
				КонецЕсли;	
				
				Условие2 = " Ссылка.Дата >= &Дата1 И Ссылка.Дата <= &Дата2";
				Парам.Вставить("Условие", Условие );
				Парам.Вставить("Условие2", Условие2 );
				Парам.Вставить("Параметры", Новый Структура("tg_id,Дата1,Дата2,name",tg_id,Дата1,Дата2,name));
				
				Ответ = Новый Массив;
				Данные = ПолучитьВыборку(Парам);
				Выборка     = Данные.Заявки;
				Чеки = Данные.Чеки;
				Сообщения = Данные.Сообщения;

				Пока Выборка.Следующий() Цикл
					Если (Вид ="w_check" или ЕстьЧек = Истина) и Выборка.ЕстьЧек  = Истина Тогда
						Продолжить;
					КонецЕсли;	
						
						
					Структура = ВыборкаВструктуру(Выборка,Чеки,Сообщения);
					
					
					Ответ.Добавить(Структура);
				КонецЦикла;	
				Возврат Ответ(200,уб_СЕРВЕРные.JSON(Ответ));
				
			Иначе
				Ответ = Ответ(404,"Не найдена заявка");
				Возврат Ответ
			КонецЕсли;	
	Иначе	
		Ответ = Ответ(407,"Параметры имеют неизвестный формат");
		Возврат Ответ	
	КонецЕсли;	
Иначе
	Ответ = Ответ(406,"Отсутствуют параметры");
	Возврат Ответ 	
КонецЕсли;	

КонецФункции


Функция ВыборкаВСтруктуру(Выборка,Чеки,Сообщения)
	Структура = Новый Структура;
	Структура.Вставить("Номер",Выборка.Номер);
	Структура.Вставить("Дата",Выборка.Дата);
	Структура.Вставить("Страхователь",Выборка.Страхователь);
	Структура.Вставить("Статус",Выборка.Статус);
	Структура.Вставить("userid",Выборка.userid);
	Структура.Вставить("tg_id",Выборка.tg_id);
	Структура.Вставить("userid",Выборка.userid);
	Структура.Вставить("ВремяНачало",Выборка.ВремяНачало);
	Структура.Вставить("ВремяОкончания",Выборка.ВремяОкончания);
	Структура.Вставить("Адрес",Выборка.Адрес);
	Структура.Вставить("Комментарий",Выборка.Комментарий);
	Структура.Вставить("СтанцияМетро",Строка(Выборка.СтанцияМетро));
	Структура.Вставить("Менеджер",Строка(Выборка.Менеджер));
	Структура.Вставить("man_id",Строка(Выборка.man_id));	
	Структура.Вставить("НомерАМО",Выборка.НомерАМО);
	
	Структура.Вставить("НеобходимостьОсмотра",Выборка.НеобходимостьОсмотра);
	
	Структура.Вставить("КонтактноеЛицо",Выборка.КонтактноеЛицо);
	Структура.Вставить("ЕстьЧек",Выборка.ЕстьЧек);
	Структура.Вставить("ФормаОплаты",Строка(Выборка.ФормаОплаты));
	Структура.Вставить("СуммаИтого",Формат(Выборка.СуммаИтого,"ЧДЦ=2; ЧГ="));
	
	МассивБСО = Новый Массив;
	Для каждого СтрокаБСО из Выборка.Ссылка.БСО.Выгрузить() Цикл
		СтруктураБСО = Новый Структура;
		СтруктураБСО.Вставить("Вид",Строка(СтрокаБСО.ВидБСО));
		СтруктураБСО.Вставить("СтраховаяКомпания",Строка(СтрокаБСО.СК));
		СтруктураБСО.Вставить("Премия",СтрокаБСО.ИтогСтраховаяПремия-СтрокаБСО.ИтогПредоставленнаяСкидка);
		СтруктураБСО.Вставить("ДатаНачала",СтрокаБСО.ДатаНачала);
		СтруктураБСО.Вставить("ДатаОкончания",СтрокаБСО.ДатаОкончания);
		СтруктураБСО.Вставить("УидСтроки",СтрокаБСО.УидСтроки);		
		нСтроки = Чеки.НайтиСтроки(Новый Структура("УидСтроки",СтрокаБСО.УидСтроки));
		
		СтруктураБСО.Вставить("ЕстьЧек",нСтроки.Количество()>0);		
		
		МассивБСО.Добавить(СтруктураБСО);
	КонецЦикла;	
	
	Структура.Вставить("БСО",МассивБСО);
	
	Префикс = Префикс();
	
	Структура.Вставить("ref",Префикс+ПолучитьНавигационнуюСсылку(Выборка.Ссылка));
	
	
	Структура.Вставить("Сообщения",Сообщения(Сообщения.Скопировать(Новый Структура("Ссылка",Выборка.Ссылка))));
	Структура.Вставить("КоличествоСообщений",Структура.Сообщения.Количество());
	
	
	
	Попытка
		Структура.Вставить("refСтрахователь",Префикс+ПолучитьНавигационнуюСсылку(Выборка.refСтрахователь));
	Исключение
		Структура.Вставить("refСтрахователь","");
	КонецПопытки;	
	Возврат Структура
КонецФункции

Функция ПолучитьВыборку(Парам)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.Ссылка КАК Заявка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.УидСтроки КАК УидСтроки
	               |ПОМЕСТИТЬ Чеки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалистаСписокФайлов.СсылкаСправочника = уб_ФайлыКПолисам.УИД
	               |			И (уб_ФайлыКПолисам.ВидДокумента.Код = 74)
	               |			И (2 = 2)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер КАК Номер,
	               //|	ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.00006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.0006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 6)) / 6 + 1, 1) КАК НомерСтрокой,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата КАК Дата,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки) = ТИП(ЧИСЛО)
	               |			ТОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки)
	               |	КОНЕЦ КАК НомерАМО,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование КАК Страхователь,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь КАК refСтрахователь,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование, """") КАК userid,
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id, """") КАК tg_id,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент КАК ВремяНачало,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяОкончанияКлиент КАК ВремяОкончания,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СтанцияМетро КАК СтанцияМетро,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НеобходимостьОсмотра) КАК НеобходимостьОсмотра,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер КАК Менеджер,
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id, ""345789"") КАК man_id,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор КАК Оператор,
	               |	ПОДСТРОКА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.МестоВстречи, 1, 1024) КАК Комментарий,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	ПОДСТРОКА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес, 1, 1024) КАК Адрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА Чеки.УидСтроки ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ) КАК ЕстьЧек,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия КАК ИтогСтраховаяПремия,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК ИтогПредоставленнаяСкидка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия - уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК СуммаИтого,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаОплаты КАК ФормаОплаты
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
	               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО
	               |		ПО (уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.Ссылка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Чеки КАК Чеки
	               |		ПО (Чеки.УидСтроки = уб_ЗаявкаНаЗаказВыездногоСпециалистаБСО.УидСтроки)
	               |ГДЕ
	               |	(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id
	               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id = &tg_id)
	               |	И 1 = 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяОкончанияКлиент,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.КонтактноеЛицо,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка,
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id, ""345789""),
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.СтанцияМетро,
	               |	ПОДСТРОКА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.МестоВстречи, 1, 1024),
	               |	ПОДСТРОКА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес, 1, 1024),
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ФормаОплаты,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование, """"),
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id, """"),
	               |	ЕСТЬNULL(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id, ""345789""),
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки) = ТИП(ЧИСЛО)
	               |			ТОГДА уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НомерЗаявки)
	               |	КОНЕЦ,
	               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус),
	               |	ПРЕДСТАВЛЕНИЕ(уб_ЗаявкаНаЗаказВыездногоСпециалиста.НеобходимостьОсмотра)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 200
	               |	чеки.Заявка КАК Заявка,
	               |	чеки.УидСтроки КАК УидСтроки
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чеки КАК чеки
	               |		ПО (чеки.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
	               |ГДЕ
	               |	(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id
	               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id = &tg_id)
	               |	И 2 = 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка,
	               |	""З-"" +ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.00006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.0006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 6)) / 6 + 1, 1) КАК Номер
	               |ПОМЕСТИТЬ ЗаявкиНомера
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	(уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id
	               |			ИЛИ уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id = &tg_id)
	               |	И 2 = 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер КАК Номер,
	               |	Сообщения.ИмяКанала КАК ИмяКанала,
	               |	ЕСТЬNULL(Сообщения.Отправитель.ФизЛицо.Наименование, """") КАК ОтправительФизЛицоНаименование,
	               |	ЕСТЬNULL(Сообщения.Отправитель.ФизЛицо.tg_id, """") КАК ОтправительФизЛицоtg_id,
	               |	ЕСТЬNULL(Сообщения.Получатель.ФизЛицо.Наименование, """") КАК ПолучательФизЛицоНаименование,
	               |	ЕСТЬNULL(Сообщения.Получатель.ФизЛицо.tg_id, """") КАК ПолучательФизЛицоtg_id,
	               |	ЕСТЬNULL(Сообщения.Сообщение, """") КАК Сообщение,
	               |	ЕСТЬNULL(Сообщения.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
	               |	ЕСТЬNULL(Сообщения.Руководителю, ЛОЖЬ) КАК Руководителю,
	               |	ЕСТЬNULL(Сообщения.SMS, ЛОЖЬ) КАК SMS,
	               |	ЕСТЬNULL(Сообщения.ИДСообщения, """") КАК УИД,
	               |	ЕСТЬNULL(Сообщения.Заголовок,"""") КАК Заголовок
	               |ИЗ
	               |	ЗаявкиНомера КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_Сообщения КАК Сообщения
	               |		ПО (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = Сообщения.ИмяКанала)";
				   
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1",Парам.Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"2 = 2",Парам.Условие2);
	Для каждого ТекущийПараметр из Парам.Параметры Цикл
		
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ,ТекущийПараметр.Значение);
	КонецЦикла;	
	
	Попытка
		
		Данные = Запрос.ВыполнитьПакет();
		Возврат Новый Структура("Заявки,Чеки,Сообщения", Данные[1].Выбрать(),Данные[2].Выгрузить(),Данные[4].Выгрузить());
	Исключение
		ВызватьИсключение(ОписаниеОшибки())
	КонецПопытки;	

КонецФункции	


Функция ОтветНаupload(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование КАК Страхователь,
				               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование КАК userid,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id КАК tg_id,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент как ВремяВстречи,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
							    |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id КАК man_id,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия - уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК Премия,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО.(
				               |		ВидБСО,
				               |		ИтогСтраховаяПремия,
				               |		ИтогПредоставленнаяСкидка,
				               |		ДатаНачала,
				               |		ДатаОкончания,
				               |		УидСтроки
				               |	)
				               |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |ГДЕ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер";
				Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					Структура = Новый Структура;
										
					МассивБСО = Новый Массив;
					Если Данные.params.Свойство("file") Тогда
						
						ssl = Новый ЗащищенноеСоединениеOpenSSL;
						Соединение = Новый httpСоединение("kupipolis.ru",,,,,15,ssl);
						Адрес = СтрЗаменить(Данные.params.file,"https://kupipolis.ru/","");
						//http://work.kupipolis.ru:16789/IB83/hs/json/doc
						httpЗапрос = новый httpЗапрос(Адрес);
						//httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
						//https://kupipolis.ru/upload/form/287953.jpg;
						ДлинаАдреса = СтрДлина(Адрес);
						Расширение = "jpg";
						Для Счетчик = 0 по ДлинаАдреса Цикл
							Если Сред(Адрес,ДлинаАдреса-Счетчик,1) = "." Тогда
								Расширение = Сред(Адрес,ДлинаАдреса-Счетчик+1);
								Прервать;
							КонецЕсли;	
						КонецЦикла;	
						
						ИмяВременнногоФайла = ПолучитьИмяВременногоФайла(Расширение);
						ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"/"),уб_ВызовСервера.ИмяФайлаИзАдреса(Адрес,"/"));
						Попытка
							Ответ = Соединение.Получить(httpЗапрос,ИмяВременнногоФайла);
							Если Ответ.КодСостояния = 200 Тогда
								
							Иначе
								Ответ = Ответ(405,"Ошибка при скачивании файла "+Ответ.КодСостояния);
								Возврат Ответ
							КонецЕсли;	
						Исключение
							Ответ = Ответ(405,"Ошибка при скачивании файла "+ОписаниеОшибки());
							Возврат Ответ
						КонецПопытки;
						

					Иначе
						Ответ = Ответ(404,"Отсутствует ссылка на файл");
						Возврат Ответ
					КонецЕсли;	
					
					Если Данные.params.Свойство("УидСтроки") Тогда
						УидСтроки = Данные.params.УидСтроки;
					Иначе	
						Для каждого СтрокаБСО из Выборка.БСО.Выгрузить() Цикл
							УидСтроки = СтрокаБСО.УидСтроки;
							Прервать
						КонецЦикла;	
					КонецЕсли;
					
					Если Данные.params.Свойство("doc_type") Тогда
						ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(Данные.params.doc_type);
						Если ВидДокумента.Пустая() Тогда
							ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(74);
						КонецЕсли;	
					Иначе	
						ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(74);
					КонецЕсли;	
					
					Попытка
						уб_ВызовСервера.ДобавитьФайлКЗаявке(ДокументОбъект,Новый Структура("УидСтроки,ПолноеИмяФайла,ВидДокумента",УидСтроки,ИмяВременнногоФайла,ВидДокумента));
						Ответ = Ответ(200,"Успешно добавлен к заявке "+ДокументОбъект.Номер);
						Возврат Ответ
					Исключение
						Возврат Ответ(500,ОписаниеОшибки());
					КонецПопытки;	
					УдалитьФайлы(ИмяВременнногоФайла);
					//Структура.Вставить("БСО",МассивБСО);
					
					Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				Иначе
					Ответ = Ответ(404,"Не найдена заявка");
					Возврат Ответ
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции



Функция ОтветНаpay_slip(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("tg_id") Тогда
				
				Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
					tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				Иначе
					tg_id = Строка(Данные.params.tg_id);
				КонецЕсли;	
				
				ИмяВременнногоФайла = ПолучитьИмяВременногоФайла("pdf");
				ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"\"),tg_id+".pdf");
				ФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("tg_id",tg_id);
				Если ФизЛицо.Пустая() Тогда
					Возврат Ответ(404,"Не найден сотрудник");
				КонецЕсли;	
				Сформирован = Обработки.уб_РасчетныеЛистки.СформироватьРасчетныйЛисток(ФизЛицо,ИмяВременнногоФайла,Истина);	
				Если Сформирован = Истина Тогда
					Ответ = Новый HTTPСервисОтвет(200);
					Ответ.УстановитьИмяФайлаТела(ИмяВременнногоФайла);				
				Иначе
					Ответ = Ответ(407,"Ошибка при формировании: "+Сформирован);
				КонецЕсли;	
				Возврат Ответ;
			Иначе
				Ответ = Ответ(407,"Отсутствует tg_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции


Функция ОтветНаFoto(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("tg_id") Тогда
				
				Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
					tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				Иначе
					tg_id = Строка(Данные.params.tg_id);
				КонецЕсли;	
				
				
				ФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("tg_id",tg_id);
				Если ФизЛицо.Пустая() Тогда
					Возврат Ответ(404,"Не найден сотрудник");
				КонецЕсли;	
				
				ФизЛицоОбъект = ФизЛицо.ПолучитьОбъект();
				Фото = ФизЛицоОбъект.Фотография.Получить();
				Если Фото<>неопределено и  Фото.Количество() >0 Тогда
					ТекущееФото = Фото[0];
					ИмяВременнногоФайла = ПолучитьИмяВременногоФайла(ТекущееФото.Расширение);
					ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"\"),"foto_"+tg_id+"."+ТекущееФото.Расширение);
					ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,"..",".");
					
					ДД = Фото[0].Фото;
					ДД.Записать(ИмяВременнногоФайла);
					
					Ответ = Новый HTTPСервисОтвет(200);
					Ответ.УстановитьИмяФайлаТела(ИмяВременнногоФайла);				
				Иначе
					Ответ = Ответ(407,"Отсутствует фото");
				КонецЕсли;	
				Возврат Ответ;
			Иначе
				Ответ = Ответ(407,"Отсутствует tg_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции




Функция ОтветНаsupport(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				
				Если ТипЗНч(Данные.params.request_id) = Тип("Число") Тогда
					request_id = Формат(Данные.params.request_id,"ЧГ=");
				Иначе
					request_id = Строка(Данные.params.request_id);
				КонецЕсли;	
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
							   |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |ГДЕ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер
				               |	И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id или уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id = &tg_id)";
				Запрос.УстановитьПараметр("Номер", Число(Данные.params.request_id));
				Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
					Запрос.УстановитьПараметр("tg_id", Формат(Данные.params.tg_id,"ЧГ="));
				Иначе
					Запрос.УстановитьПараметр("tg_id", Строка(Данные.params.tg_id));
				КонецЕсли;	
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда

				
				ИмяВременнногоФайла = ПолучитьИмяВременногоФайла("pdf");
				ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"\"),"sup_"+request_id+".pdf");
				
				Таб = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПечатьДоговораПоддержки(Новый Структура,Выборка.Ссылка);
				Таб.Записать(ИмяВременнногоФайла,ТипФайлаТабличногоДокумента.PDF);
					Ответ = Новый HTTPСервисОтвет(200);
					Ответ.УстановитьИмяФайлаТела(ИмяВременнногоФайла);				
				Иначе
					Ответ = Ответ(407,"Ошибка при формировании");
				
				КонецЕсли;
				Возврат Ответ;
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции	


Функция ОтветНаget_task(Данные)
	
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				
				Если ТипЗНч(Данные.params.request_id) = Тип("Число") Тогда
					request_id = Формат(Данные.params.request_id,"ЧГ=");
				Иначе
					request_id = Строка(Данные.params.request_id);
				КонецЕсли;	
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка
							   |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |ГДЕ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер
				               |	И (уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id = &tg_id или уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер.tg_id = &tg_id)";
				Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
					Запрос.УстановитьПараметр("tg_id", Формат(Данные.params.tg_id,"ЧГ="));
				Иначе
					Запрос.УстановитьПараметр("tg_id", Строка(Данные.params.tg_id));
				КонецЕсли;	
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда

				
				ИмяВременнногоФайла = ПолучитьИмяВременногоФайла("pdf");
				ИмяВременнногоФайла = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"\"),request_id+".pdf");
				
				Таб = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.Печать(Новый Структура("ПечататьАктПеремещения",ЛОЖЬ),Выборка.Ссылка);
				Таб.Записать(ИмяВременнногоФайла,ТипФайлаТабличногоДокумента.PDF);
					Ответ = Новый HTTPСервисОтвет(200);
					Ответ.УстановитьИмяФайлаТела(ИмяВременнногоФайла);				
				Иначе
					Ответ = Ответ(407,"Ошибка при формировании");
				
				КонецЕсли;
				Возврат Ответ;
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции	

Функция ОтветНаЗаявка(Данные)
	
	Ошибка = "";
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("Номер") Тогда
				
				Если ТипЗНч(Данные.params.Номер) = Тип("Число") Тогда
					request_id = Формат(Данные.params.Номер,"ЧГ=");
				Иначе
					request_id = Строка(Данные.params.Номер);
				КонецЕсли;	
			Иначе
				request_id = "";
			КонецЕсли;	
			
			Если Данные.params.Свойство("НомерАМО") Тогда
				НомерАМО = Данные.params.НомерАМО;
			Иначе	
				НомерАМО = Перечисления.уб_ВидыЗаявок.Личная;
			КонецЕсли;	
			
			Если Данные.params.Свойство("Дата") Тогда
				Дата = ДатаИзСтроки(Данные.params.Дата);
			Иначе
				Дата = ТекущаяДата();
			КонецЕсли;	
			
			Если Данные.params.Свойство("Страхователь") Тогда
				Страхователь = Данные.params.Страхователь;
				Если Страхователь.Свойство("ФИО") Тогда
					СтраховательНаименование = Страхователь.ФИО;
				ИначеЕсли Страхователь.Свойство("Наименование") Тогда
					СтраховательНаименование = Страхователь.Наименование;	
				КонецЕсли;	
			Иначе
				СтраховательНаименование = "";
			КонецЕсли;	
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Заявки.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК Заявки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
			|		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = Заявки.Ссылка)
			|ГДЕ
			|	Заявки.Менеджер.tg_id = &man_id
			|	И Заявки.ПометкаУдаления = ЛОЖЬ
			|	И 1 = 1";
			Если НЕ НомерАМО = Перечисления.уб_ВидыЗаявок.Личная Тогда
				Запрос.УстановитьПараметр("НомерЗаявки", НомерАМО);
				УсловиеПоиска =  "Заявки.НомерЗаявки = &НомерЗаявки";
			ИначеЕсли ПустаяСтрока(request_id) = ЛОЖЬ Тогда
				Запрос.УстановитьПараметр("Номер", request_id);
				УсловиеПоиска =  "Заявки.Номер = &Номер"
			Иначе	
				Запрос.УстановитьПараметр("Страхователь", СтраховательНаименование);
				Запрос.УстановитьПараметр("Дата",         НачалоДня(Дата));
				УсловиеПоиска =  
				"Заявки.Страхователь.Наименование = &Страхователь
				| и (НачалоПериода(Заявки.ДатаСоздания,ДЕНЬ) = &Дата или НачалоПериода(Заявки.Дата,ДЕНЬ) = &Дата)";
			КонецЕсли;
			
			Запрос.Текст = СТрЗаменить(Запрос.Текст,"1 = 1",УсловиеПоиска);
			
			Если ТипЗНч(Данные.params.man_id) = Тип("Число") Тогда
				man_id =  Формат(Данные.params.man_id,"ЧГ=");
			Иначе
				man_id =  Строка(Данные.params.man_id);
			КонецЕсли;	
			Запрос.УстановитьПараметр("man_id", man_id);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбъектЗаявка = Выборка.Ссылка.ПолучитьОбъект();			
			Иначе
				ОбъектЗаявка = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СоздатьДокумент();
				ОбъектЗаявка.Дата         = Дата;
				ОбъектЗаявка.ДатаСоздания = Дата;
			КонецЕсли;
			
			//МЕНЕДЖЕР
			ОбъектЗаявка.Менеджер = Справочники.ФизическиеЛица.НайтиПоРеквизиту("tg_id",man_id);
			Если ОбъектЗаявка.Менеджер.Пустая() Тогда
				Ошибка = Ошибка+"Не найден менеджер с id = "+man_id+Символы.ПС;				
			КонецЕсли;	
			
			//КУРЬЕР
			Если Данные.params.Свойство("tg_id") = ЛОЖЬ  Тогда
				tg_id = "";
			ИначеЕсли ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
				tg_id =  Формат(Данные.params.tg_id,"ЧГ=");
			Иначе
				tg_id =  Строка(Данные.params.tg_id);
			КонецЕсли;	
			Если НЕ tg_id = "" Тогда
				ОбъектЗаявка.Курьер = Справочники.ФизическиеЛица.НайтиПоРеквизиту("tg_id",tg_id);
				Если ОбъектЗаявка.Курьер.Пустая() Тогда
					Ошибка = Ошибка+"Не найден курьер с id ="+tg_id+Символы.ПС;				
				КонецЕсли;	
			КонецЕсли;	
			
			//СТРАХОВАТЕЛЬ
			СсылкаСтрахователь = "";
			ОтветНаСтрахователь(Страхователь,СсылкаСтрахователь);
			Если ЗначениеЗаполнено(СсылкаСтрахователь) Тогда
				ОбъектЗаявка.Страхователь = СсылкаСтрахователь;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ОбъектЗаявка.Страхователь) Тогда
				Ошибка = Ошибка+"Не найден страхователь"+Символы.ПС;				
			КонецЕсли;	
			//
			Если ОбъектЗаявка.ВремяНачало = Дата(1,1,1) Тогда
				Если Данные.params.Свойство("ВремяНачало") Тогда
					ВремяНачало = ДатаИзСтроки(Данные.params.ВремяНачало);
				Иначе
					ВремяНачало = КонецДня(Дата)+8*3600;
				КонецЕсли;	
				ОбъектЗаявка.ВремяНачало = ВремяНачало;
			КонецЕсли;	
			//
			Если ОбъектЗаявка.ВремяОкончания = Дата(1,1,1) Тогда
				Если Данные.params.Свойство("ВремяОкончания") Тогда
					ВремяОкончания = ДатаИзСтроки(Данные.params.ВремяОкончания);
				Иначе
					ВремяОкончания = ВремяНачало+2*3600;
				КонецЕсли;	
				ОбъектЗаявка.ВремяОкончания = ВремяОкончания;
			КонецЕсли;	
			//
			Если Данные.params.Свойство("Адрес") Тогда
				Адрес = Данные.params.Адрес;
				ОбъектЗаявка.Адрес = Адрес;
			Иначе
				Адрес = "Офис";
			КонецЕсли;	
			
			//
			Если Данные.params.Свойство("Комментарий") Тогда
				Комментарий = Данные.params.Комментарий;
				ОбъектЗаявка.Комментарий = Комментарий;
			Иначе
				Комментарий = "";
			КонецЕсли;	
			
			//
			Если Данные.params.Свойство("СтанцияМетро") Тогда
				СтанцияМетроСтрока = Данные.params.СтанцияМетро;
			ИначеЕсли ЗначениеЗаполнено(ОбъектЗаявка.СтанцияМетро) Тогда
				СтанцияМетроСтрока = Строка(ОбъектЗаявка.СтанцияМетро);	
			Иначе
				СтанцияМетроСтрока = "Дмитровская";
			КонецЕсли;	
			СтанцияМетро = Справочники.уб_СтанцииМетро.НайтиПоНаименованию(СтанцияМетроСтрока);
			ОбъектЗаявка.СтанцияМетро = СтанцияМетро;
			
			//
			
			Если ЗначениеЗаполнено(ОбъектЗаявка.НомерЗаявки) Тогда
				НомерАМО = ОбъектЗаявка.НомерЗаявки;
			КонецЕсли;
			ОбъектЗаявка.НомерЗаявки = НомерАМО;
			//
			Если Данные.params.Свойство("НеобходимостьОсмотра") Тогда
				НеобходимостьОсмотра = Данные.params.НеобходимостьОсмотра;
				НеобходимостьОсмотра = НайтиПеречислениеПоСинонимуИлиИмени("НеобходимостьОсмотра",НеобходимостьОсмотра);
			Иначе
				НеобходимостьОсмотра = Перечисления.НеобходимостьОсмотра.БезОсмотра;
			КонецЕсли;	
			ОбъектЗаявка.НеобходимостьОсмотра = НеобходимостьОсмотра;
			//
			
			Если Данные.params.Свойство("ТипСтраховки") Тогда
				ТипСтраховки = Данные.params.ТипСтраховки;
				ТипСтраховки = НайтиПеречислениеПоСинонимуИлиИмени("уб_ТипВыезда",ТипСтраховки);
			Иначе
				ТипСтраховки = Перечисления.уб_ТипВыезда.Страховка;
			КонецЕсли;	
			ОбъектЗаявка.Тип = ТипСтраховки;
			//
			Если Данные.params.Свойство("НеобходимостьДоставки") Тогда
				НеобходимостьДоставки = Данные.params.НеобходимостьДоставки;
				Если НеобходимостьДоставки = "Без доставки" Тогда
					ТипВыезда = 1;
				Иначе
					ТипВыезда = 0;
				КонецЕсли;	
			Иначе
				ТипВыезда = 1;
			КонецЕсли;	
			ОбъектЗаявка.ТипВыезда = ТипВыезда;
			
			//
			Если Данные.params.Свойство("Источник") Тогда
				Источник = Данные.params.Источник;
				СсылкаИсточник = Справочники.ИсточникиЗаявок.НайтиПоНаименованию(Лев(Источник,25),Истина);
				Если СсылкаИсточник.Пустая() Тогда
					ОбъектИсточник = Справочники.ИсточникиЗаявок.СоздатьЭлемент();
					ОбъектИсточник.Наименование = Источник;
					ОбъектИсточник.Записать();
					СсылкаИсточник = ОбъектИсточник.Ссылка;
				КонецЕсли;	
				ОбъектЗаявка.Источник = СсылкаИсточник;
			КонецЕсли;	
			
			//
			Если Данные.params.Свойство("КонтактноеЛицо") Тогда
				КонтактноеЛицо = Данные.params.КонтактноеЛицо;
				ОбъектЗаявка.КонтактноеЛицо = КонтактноеЛицо;
			КонецЕсли;	
			
			//
			Если Данные.params.Свойство("КонтактноеЛицоТелефон") Тогда
				КонтактноеЛицоТелефон = Данные.params.КонтактноеЛицоТелефон;
				ОбъектЗаявка.Контакты = КонтактноеЛицоТелефон;
			КонецЕсли;	
			
			//
			Если Данные.params.Свойство("КонтактноеЛицоemail") Тогда
				email = Данные.params.КонтактноеЛицоemail;
				ОбъектЗаявка.email = email;
			КонецЕсли;	
			
			Если Данные.params.Свойство("БСО") Тогда
				СтарыеСтроки = 	ОбъектЗаявка.БСО.Выгрузить();
				ОбъектЗаявка.БСО.Очистить();
				Для каждого СтрокаБСО из Данные.params.БСО Цикл
					СтрокаНайдена = Ложь;
					Если СтрокаБСО.Свойство("УидСтроки") Тогда
						
						Для каждого СтараяСтрока из СтарыеСтроки Цикл
							Если Нрег(СтараяСтрока.УидСтроки) = Нрег(СтрокаБСО.УидСтроки) Тогда
								СтрокаНайдена = Истина;
								Прервать;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;	
					Если СтрокаНайдена = Ложь Тогда
						Для каждого СтараяСтрока из СтарыеСтроки Цикл
							Если Нрег(СтараяСтрока.ВидБСО) = Нрег(СтрокаБСО.Вид)
								и СтараяСтрока.СтраховаяПремия = Число(СтрокаБСО.Премия)
								Тогда
								СтрокаНайдена = Истина;
								Прервать;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;	
					
					НоваяСтрока = ОбъектЗаявка.БСО.Добавить();
					Если СтрокаНайдена = Истина Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтараяСтрока);
						СтарыеСтроки.Удалить(СтараяСтрока);
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("Вид") Тогда
						Вид = СтрокаБСО.Вид;
						Вид = НайтиПеречислениеПоСинонимуИлиИмени("уб_ВидыСтраховыхПродуктов",Вид);
						НоваяСтрока.ВидБСО = Вид;
						Если Найти(нрег(СтрокаБСО.Вид), "осаго")>0 тогда
							НоваяСтрока.ЛимитОтветственности = 400000;
						КонецЕсли;	
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("СтраховаяКомпания") Тогда
						НоваяСтрока.СК = Справочники.Контрагенты.НайтиПоНаименованию(СтрокаБСО.СтраховаяКомпания,Истина);
					КонецЕсли;	
					Если ЗначениеЗаполнено(НоваяСтрока.Поставщик) = ЛОЖЬ Тогда
						НоваяСтрока.Поставщик = НоваяСтрока.СК;
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("Премия") Тогда
						НоваяСтрока.СтраховаяПремия = Число(СтрокаБСО.Премия);   
						НоваяСтрока.СуммаВзноса      = НоваяСтрока.СтраховаяПремия;
						НоваяСтрока.ИтогСуммаВзноса     = НоваяСтрока.СтраховаяПремия;  
						НоваяСтрока.ИтогСтраховаяПремия = НоваяСтрока.СтраховаяПремия;
						НоваяСтрока.Количество = 1;
					КонецЕсли;	
					
					Если НоваяСтрока.ДатаОформления = Дата(1,1,1) Тогда
						НоваяСтрока.ДатаОформления  = ОбъектЗаявка.Дата;
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("СтраховаяСумма") Тогда
						НоваяСтрока.ЛимитОтветственности = Число(СтрокаБСО.СтраховаяСумма);
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("КВ") Тогда
						НоваяСтрока.КВБрокераПлан = Число(СтрокаБСО.КВ);
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("ВидОплаты") Тогда
						ВидОплаты = СтрокаБСО.ВидОплаты;
						НоваяСтрока.ФормаОплатыСтрока = НайтиПеречислениеПоСинонимуИлиИмени("уб_ФормыОплаты",ВидОплаты);						 
					КонецЕсли;	
					//
					Если ЗначениеЗаполнено(НоваяСтрока.ДатаНачала) = ЛОЖЬ и СтрокаБСО.Свойство("ДатаНачала") Тогда
						НоваяСтрока.ДатаНачала = ДатаИзСтроки(СтрокаБСО.ДатаНачала);
					КонецЕсли;	
					//
					Если ЗначениеЗаполнено(НоваяСтрока.ДатаОкончания) = ЛОЖЬ и СтрокаБСО.Свойство("ДатаОкончания") Тогда
						НоваяСтрока.ДатаОкончания = ДатаИзСтроки(СтрокаБСО.ДатаОкончания);
					КонецЕсли;	
					
					Если СтрокаБСО.Свойство("Автомобиль") Тогда
						ОбъектСтрахования = Неопределено;
						Vin = "";
						
						Марка = Справочники.уб_МаркиТС.ПустаяСсылка();
						Модель = Справочники.уб_МоделиТС.ПустаяСсылка();
						
						Ответ = ОтветНаАвтомобиль(СтрокаБСО.Автомобиль,ОбъектСтрахования,Vin,Марка,Модель);	
						Если ЗначениеЗаполнено(ОбъектСтрахования) Тогда
							НоваяСтрока.ОбъектСтрахования = ОбъектСтрахования;
							Если ЗначениеЗаполнено(Марка) Тогда
								НоваяСтрока.МаркаТС = Марка;
							КонецЕсли;	
							Если ЗначениеЗаполнено(Модель) Тогда
								НоваяСтрока.МодельТС = Модель;
							КонецЕсли;	
							
						КонецЕсли;	
						Если Не ПустаяСтрока(Vin) Тогда
							НоваяСтрока.Vin = Vin;
						КонецЕсли;	
					КонецЕсли;	
					
					
					
					Если ПустаяСтрока(НоваяСтрока.УидСтроки) = Истина Тогда
						Если СтрокаБСО.Свойство("УидСтроки") Тогда
							НоваяСтрока.УидСтроки = СтрокаБСО.УидСтроки;
						КонецЕсли;	
						Если ПустаяСтрока(НоваяСтрока.УидСтроки) = Истина Тогда
							НоваяСтрока.УидСтроки = Строка(Новый УникальныйИдентификатор);
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			
			
			ОбъектЗаявка.Записать();
			Ответ = Новый Структура;
			Ответ.Вставить("ref",Префикс()+ПолучитьНавигационнуюСсылку(ОбъектЗаявка.Ссылка));
			Ответ.Вставить("error",Ошибка);
			Ответ.Вставить("Номер",ОбъектЗаявка.Номер);
			Возврат Ответ(200,уб_СЕРВЕРные.JSON(Ответ));
			
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции	


Функция ОтветНаdelete(Данные)
	Структура = Новый Структура;
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование КАК Страхователь,
				               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование КАК userid,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id КАК tg_id,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент как ВремяВстречи,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия - уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК Премия,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО.(
				               |		ВидБСО,
				               |		ИтогСтраховаяПремия,
				               |		ИтогПредоставленнаяСкидка,
				               |		ДатаНачала,
				               |		ДатаОкончания,
				               |		УидСтроки
				               |	),
				               |	Список.УидСтроки,
				               |	Список.СсылкаСправочника,
				               |	уб_ФайлыКПолисам.ВидДокумента
				               |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК Список
				               |		ПО (Список.Ссылка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				               |		ПО (уб_ФайлыКПолисам.УИД = Список.СсылкаСправочника)
				               |			И (Список.Ссылка = уб_ФайлыКПолисам.СтраховойПолис)
				               |			И (уб_ФайлыКПолисам.ВидДокумента = &ВидДокумента)
				               |ГДЕ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер";
				Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				
				
				Если Данные.params.Свойство("doc_type") Тогда
					doc_type = Данные.params.doc_type;
					ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
					Если ВидДокумента.Пустая() Тогда
						doc_type = 74;
						ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
					КонецЕсли;	
				Иначе	
					doc_type = 74;
					ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
				КонецЕсли;	
				Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
				
				ДокументОбъект =  Неопределено;
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ДокументОбъект = Неопределено Тогда
						ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					КонецЕсли; 
					
					 ЕстьИзменения = УдалитьСтрокуФайла(ДокументОбъект,Выборка) или УдалитьСтрокуФайла(ДокументОбъект,Выборка);
					 
				 КонецЦикла;
				Если ЕстьИзменения = Истина Тогда 
					ДокументОбъект.Записать();
				КонецЕсли;	
				
				Если Выборка.Количество() = 0 Тогда
					Ответ = Ответ(404,"Не найдены файлы в заявке с видом "+doc_type);
					Возврат Ответ
				Иначе
					Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции




Функция ОтветНаdownload(Данные)
	Структура = Новый Структура;
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Дата КАК Дата,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Страхователь.Наименование КАК Страхователь,
				               |	ПРЕДСТАВЛЕНИЕ(уб_ИсторияСтатусовЗаявокСрезПоследних.Статус) КАК Статус,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.Наименование КАК userid,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Курьер.tg_id КАК tg_id,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВремяВстречиКлиент КАК ВремяВстречи,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Менеджер,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Оператор,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСтраховаяПремия - уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогПредоставленнаяСкидка КАК Премия,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Адрес,
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО.(
				               |		ВидБСО,
				               |		ИтогСтраховаяПремия,
				               |		ИтогПредоставленнаяСкидка,
				               |		ДатаНачала,
				               |		ДатаОкончания,
				               |		УидСтроки
				               |	),
				               |	Список.УидСтроки,
				               |	Список.СсылкаСправочника,
				               |	уб_ФайлыКПолисам.ВидДокумента,
				               |	уб_ФайлыКПолисам.ФайлРасширение,
				               |	уб_ФайлыКПолисам.ФайлИмя,
				               |	уб_ФайлыКПолисам.Хранилище.Путь,
				               |	уб_ФайлыКПолисам.ПутьКПапке
				               |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК уб_ИсторияСтатусовЗаявокСрезПоследних
				               |		ПО (уб_ИсторияСтатусовЗаявокСрезПоследних.Заявка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.СписокФайлов КАК Список
				               |		ПО (Список.Ссылка = уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка)
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
				               |		ПО (уб_ФайлыКПолисам.УИД = Список.СсылкаСправочника)
				               |			И (Список.Ссылка = уб_ФайлыКПолисам.СтраховойПолис)
				               //|			И (уб_ФайлыКПолисам.ВидДокумента = &ВидДокумента)
				               |ГДЕ
				               |	уб_ФайлыКПолисам.ФайлРасширение ПОДОБНО &Расширение
				               |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер
				               |	И уб_ФайлыКПолисам.ДатаПубликации >= &ДатаПубликации";
				Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				Запрос.УстановитьПараметр("Расширение", "%PDF");
				Запрос.УстановитьПараметр("ДатаПубликации", ТекущаяДата()-31*24*3600);
				
				
				Если Данные.params.Свойство("doc_type") Тогда
					doc_type = Данные.params.doc_type;
					ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
					Если ВидДокумента.Пустая() Тогда
						doc_type = 60;
						ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
					КонецЕсли;	
				Иначе	
					doc_type = 60;
					ВидДокумента = Справочники.уб_ВидыДокументовКПолисам.НайтиПоКоду(doc_type);
				КонецЕсли;	
				Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
				
				
				ИмяАрхивногоФайла = ПолучитьИмяВременногоФайла("zip");
				НомерЗаявки = Формат(Данные.params.request_id,"ЧГ=");
				ИмяАрхивногоФайла = СтрЗаменить(ИмяАрхивногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяАрхивногоФайла,"/"),НомерЗаявки+".zip");
				//КаталогВременныхФайлов = СтрЗаменить(ИмяВременнногоФайла,уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"/"),"");
				
				//уб_ВызовСервера.ИмяФайлаИзАдреса(ИмяВременнногоФайла,"/")
				
				КаталогВременныхФайлов = КаталогВременныхФайлов();					 
				
				ЗаписьZIP = Новый ЗаписьZipФайла(ИмяАрхивногоФайла);


				Выборка = Запрос.Выполнить().Выбрать();
				ФайлыКУдалению = Новый Массив;
				счетчик = 0;
				
				Пока Выборка.Следующий() Цикл
					
					ИмяВХранилище = ""+Выборка.ХранилищеПуть+"\"+Выборка.ПутьКПапке+"\"+Выборка.ФайлИмя;
					ФайлХ = Новый Файл(ИмяВХранилище);
					Если ФайлХ.Существует() = Истина Тогда
						
						счетчик = счетчик+1;
						
						ИмяНовогоФайла = КаталогВременныхФайлов+""+НомерЗаявки+"_"+Счетчик+".pdf";
						Попытка
							КопироватьФайл(ИмяВХранилище,ИмяНовогоФайла);
							ФайлыКУдалению.Добавить(ИмяНовогоФайла);
						Исключение
							
						КонецПопытки;	
					Иначе
						Продолжить
					КонецЕсли;
					
					ЗаписьZIP.Добавить(ИмяНовогоФайла, РежимСохраненияПутейZIP.НеСохранятьПути);				
				КонецЦикла;
				
				
				Если счетчик = 0 Тогда
					Ответ = Ответ(404,"За последние 30 дней в заявке нет вложенных полисов");//Не найдены файлы в заявке с видом "+doc_type);
					Возврат Ответ
				Иначе
					ФайлыКУдалению.Добавить(ИмяАрхивногоФайла);
					ЗаписьZIP.Записать();
					Ответ = Новый HTTPСервисОтвет(200);
					Ответ.УстановитьИмяФайлаТела(ИмяАрхивногоФайла);				
					ЗаписьZIP = Неопределено;
					Для каждого ИмяФайла из ФайлыКУдалению Цикл
						Попытка
							УдалитьФайлы(ИмяФайла);
						Исключение
							Ошибка = ОписаниеОшибки();
						КонецПопытки;	
					КонецЦикла;	
					Возврат Ответ;
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции






Функция ОтветНаdoc_type_list(Данные)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ВидыДокументовКПолисам.Код,
	|	уб_ВидыДокументовКПолисам.Наименование КАК Наименование
	|ИЗ
	|	Справочник.уб_ВидыДокументовКПолисам КАК уб_ВидыДокументовКПолисам
	|ГДЕ
	|	уб_ВидыДокументовКПолисам.НеИспользуется = ЛОЖЬ
	|	И уб_ВидыДокументовКПолисам.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивВидов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		МассивВидов.Добавить(Новый Структура("doc_type_id,doc_type_desc",Выборка.Код,Выборка.Наименование));
		
	КонецЦикла;
	Возврат Ответ(200,уб_СЕРВЕРные.JSON(МассивВидов));
			
	
КонецФункции


#Область Страхователь

Функция ОтветНаСтрахователь(Данные,Ссылка = Неопределено)
	//
	//{"apikey":"fce6566b-7754-4764-ade3-ac4fdff9e226","command":"Страхователь","params":{"ФИО":"Однораленко Александр Сергеевич","ДР":"2026-09-04T00:00:00", "ПАСПОРТ" :"0101 020304" }}
	ФИО     = "";
	ДР      =  Дата(1,1,1);
	ДАТАВЫДАЧИ = Дата(1,1,1);
	Паспорт = "";
	ВнешнийУИД = "";
	ДанныеПаспорта = Новый Структура("Серия,Номер","","");
	Создать = ЛОЖЬ;
	
	Если Данные.Свойство("params") Тогда
		Источник = Данные.params;
	Иначе
		Источник = Данные;
	КонецЕсли;	
	
	Если ТипЗнч(Источник) = Тип("Структура") Тогда
		Если Источник.Свойство("ФИО") Тогда
			Фио = СокрЛП(Источник.ФИО);
			
			
			Если Источник.Свойство("ПАСПОРТ") Тогда
				ПАСПОРТ = СокрЛП(Источник.ПАСПОРТ);
				ДанныеПаспорта = ПреобразоватьПаспорт(ПАСПОРТ);
			КонецЕсли;
			Если Источник.Свойство("ДР") Тогда
				ДР = ДатаИзСтроки(Источник.ДР);
			КонецЕсли;
			
			Если Источник.Свойство("ДАТАВЫДАЧИ") Тогда
				ДАТАВЫДАЧИ = ДатаИзСтроки(Источник.ДАТАВЫДАЧИ);
			КонецЕсли;
			
			Если Источник.Свойство("ВнешнийID") Тогда
				ВнешнийУИД = Источник.ВнешнийID;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ФизическиеЛица.Ссылка КАК Ссылка,
			               |	ФизическиеЛица.Наименование КАК Наименование,
			               |	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
			               |	3 КАК КоличествоСовпадений,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ДокументСерия,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ДокументНомер,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.Период КАК Период,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи
			               |ПОМЕСТИТЬ Найдены
			               |ИЗ
			               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			               |		ПО (ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
			               |ГДЕ
			               |	ФизическиеЛица.Наименование = &Наименование
			               |	И ФизическиеЛица.ДатаРождения = &ДатаРождения
			               |	И ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия = &Серия
			               |	И ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер = &Номер
			               |
			               |ОБЪЕДИНИТЬ
			               |
			               |ВЫБРАТЬ
			               |	ФизическиеЛица.Ссылка,
			               |	ФизическиеЛица.Наименование,
			               |	ФизическиеЛица.ДатаРождения,
			               |	1,
			               |	"""",
			               |	"""",
			               |	ДАТАВРЕМЯ(1, 1, 1),
			               |	ДАТАВРЕМЯ(1, 1, 1)
			               |ИЗ
			               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
			               |ГДЕ
			               |	ФизическиеЛица.Наименование = &Наименование
			               |	И ФизическиеЛица.ДатаРождения = &ДатаРождения
			               |
			               |ОБЪЕДИНИТЬ
			               |
			               |ВЫБРАТЬ
			               |	ФизическиеЛица.Ссылка,
			               |	ФизическиеЛица.Наименование,
			               |	ФизическиеЛица.ДатаРождения,
			               |	2,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.Период,
			               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи
			               |ИЗ
			               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			               |		ПО (ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
			               |ГДЕ
			               |	ФизическиеЛица.Наименование = &Наименование
			               |	И ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия = &Серия
			               |	И ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер = &Номер
			               |
			               |ОБЪЕДИНИТЬ
			               |
			               |ВЫБРАТЬ
			               |	ФизическиеЛица.Ссылка,
			               |	ФизическиеЛица.Наименование,
			               |	ФизическиеЛица.ДатаРождения,
			               |	0,
			               |	"""",
			               |	"""",
			               |	ДАТАВРЕМЯ(1, 1, 1),
			               |	ДАТАВРЕМЯ(1, 1, 1)
			               |ИЗ
			               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
			               |ГДЕ
			               |	ФизическиеЛица.Наименование = &Наименование
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	МАКСИМУМ(Найдены.КоличествоСовпадений) КАК КоличествоСовпадений
			               |ПОМЕСТИТЬ Макс
			               |ИЗ
			               |	Найдены КАК Найдены
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	Найдены.Ссылка КАК Ссылка,
			               |	Найдены.Наименование КАК Наименование,
			               |	Найдены.ДатаРождения КАК ДатаРождения,
			               |	Найдены.КоличествоСовпадений КАК КоличествоСовпадений,
			               |	Найдены.ДокументСерия КАК ДокументСерия,
			               |	Найдены.ДокументНомер КАК ДокументНомер,
			               |	Найдены.Период КАК Период,
			               |	Найдены.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			               |	Найдены.Ссылка.ВнешнийУИД КАК ВнешнийУИД
			               |ИЗ
			               |	Найдены КАК Найдены
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макс КАК Макс
			               |		ПО Найдены.КоличествоСовпадений = Макс.КоличествоСовпадений";
			Запрос.УстановитьПараметр("Наименование",ФИО);
			Запрос.УстановитьПараметр("ДатаРождения",ДР);
			Запрос.УстановитьПараметр("Серия",ДанныеПаспорта.Серия);
			Запрос.УстановитьПараметр("Номер",ДанныеПаспорта.Номер);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Ссылка = Выборка.Ссылка;
				Если Выборка.КоличествоСовпадений = 3 Тогда
					Ответ = Ответ(200,"Корректно");
					Если ДатаВыдачи<> Дата(1,1,1) и не Выборка.ДокументДатаВыдачи = ДатаВыдачи  Тогда
						ПаспортныеДанныеФизЛиц = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
						ПаспортныеДанныеФизЛиц.ФизЛицо       = Выборка.Ссылка;
						СрезПаспорта = СрезПаспорта(ПаспортныеДанныеФизЛиц.ФизЛицо);
						Если НЕ СрезПаспорта = Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ПаспортныеДанныеФизЛиц,СрезПаспорта);
							ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();
							ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи = ДатаВыдачи;
							ПаспортныеДанныеФизЛиц.Записать();
							
						КонецЕсли;	
					КонецЕсли;	
					
					Если Не ПустаяСтрока(ВнешнийУИД) и НЕ Выборка.ВнешнийУИД = ВнешнийУИД Тогда 
						ОбъектФизлицо = Выборка.Ссылка.ПолучитьОбъект();
						ОбъектФизлицо.ВнешнийУИД = ВнешнийУИД;
						ОбъектФизлицо.Записать();
					КонецЕсли;	
						
					
				ИначеЕсли Выборка.КоличествоСовпадений = 2 Тогда
					Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
						Ответ = Ответ(200,"Не найдено "+ФИО+ " с "+Формат(ДР,"ДФ=dd.MM.yyyy"));	
					Иначе	
						ОбъектФизлицо = Выборка.Ссылка.ПолучитьОбъект();
						ОбъектФизлицо.ДатаРождения = ДР;
						ОбъектФизлицо.Записать();
						Ответ = Ответ(200,"Обновлено ДР");	
					КонецЕсли;	
				ИначеЕсли Выборка.КоличествоСовпадений = 1 Тогда
					Если НЕ ПустаяСтрока(ДанныеПаспорта.Номер)
						или НЕ ПустаяСтрока(ДанныеПаспорта.Серия)
						или ДатаВыдачи<> Дата(1,1,1) Тогда
						Ответ = Ответ(200,"Обновлен паспорт");	
					Иначе
						Ответ = Ответ(200,"Паспорт не обновлен");	
					КонецЕсли;	
					ПаспортныеДанныеФизЛиц = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
					ПаспортныеДанныеФизЛиц.ФизЛицо       = Выборка.Ссылка;
					СрезПаспорта = СрезПаспорта(ПаспортныеДанныеФизЛиц.ФизЛицо);
					Если НЕ СрезПаспорта = Неопределено Тогда
						ЗаполнитьЗначенияСвойств(ПаспортныеДанныеФизЛиц,СрезПаспорта);
					Иначе
						ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();
					КонецЕсли;			
					ПаспортныеДанныеФизЛиц.ДокументВид   = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
					Если НЕ ПустаяСтрока(ДанныеПаспорта.Серия) Тогда
						ПаспортныеДанныеФизЛиц.ДокументСерия = ДанныеПаспорта.Серия;
						ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();
					КонецЕсли;	
					Если НЕ ПустаяСтрока(ДанныеПаспорта.Номер) Тогда
						ПаспортныеДанныеФизЛиц.ДокументНомер = ДанныеПаспорта.Номер;
						ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();	
					КонецЕсли;	
					Если ДатаВыдачи<> Дата(1,1,1) Тогда
						ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи = ДатаВыдачи;
					КонецЕсли;	
					ПаспортныеДанныеФизЛиц.Записать();
				ИначеЕсли Выборка.КоличествоСовпадений = 0 Тогда
					Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
						Ответ = Ответ(200,"Не найдено "+ФИО+ " с "+Формат(ДР,"ДФ=dd.MM.yyyy"));	
						Создать = Истина;
					Иначе	
						ОбъектФизлицо = Выборка.Ссылка.ПолучитьОбъект();
						ОбъектФизлицо.ДатаРождения = ДР;
						Если Не ПустаяСтрока(ВнешнийУИД) Тогда 
							ОбъектФизлицо.ВнешнийУИД = ВнешнийУИД;
						КонецЕсли;	
						ОбъектФизлицо.Записать();
						
						ПаспортныеДанныеФизЛиц = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
						ПаспортныеДанныеФизЛиц.ФизЛицо       = Выборка.Ссылка;
						СрезПаспорта = СрезПаспорта(ПаспортныеДанныеФизЛиц.ФизЛицо);
						Если НЕ СрезПаспорта = Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ПаспортныеДанныеФизЛиц,СрезПаспорта);
						Иначе	
							ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();	
						КонецЕсли;	
						
						ПаспортныеДанныеФизЛиц.ДокументВид   = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
						Если НЕ ПустаяСтрока(ДанныеПаспорта.Серия) Тогда
							ПаспортныеДанныеФизЛиц.ДокументСерия = ДанныеПаспорта.Серия;
							ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();	
						КонецЕсли;	
						Если НЕ ПустаяСтрока(ДанныеПаспорта.Номер) Тогда
							ПаспортныеДанныеФизЛиц.ДокументНомер = ДанныеПаспорта.Номер;
							ПаспортныеДанныеФизЛиц.Период = ТекущаяДата();		
						КонецЕсли;	
						Если ДатаВыдачи<>Дата(1,1,1) Тогда
							ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи = ДатаВыдачи;
						КонецЕсли;	
						
						ПаспортныеДанныеФизЛиц.Записать();
						Если НЕ ПустаяСтрока(ДанныеПаспорта.Номер)
							или НЕ ПустаяСтрока(ДанныеПаспорта.Серия)
							или ДатаВыдачи<> Дата(1,1,1) Тогда
							Ответ = Ответ(200,"Обновлено ДР и паспорт");			
						Иначе
							Ответ = Ответ(200,"Обновлено ДР");			
						КонецЕсли;	
						
					КонецЕсли;	
					
					
				КонецЕсли;	
			Иначе
				//Ответ = Ответ(200,"Не найдено "+ФИО);	
				Создать = Истина;
			КонецЕсли;	
			
			Если Создать = Истина Тогда
				ОбъектФизлицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ОбъектФизлицо.Наименование = Фио;
				ОбъектФизлицо.ДатаРождения = ДР;
				Если Прав(ФИО,3)="вич" Тогда
					ОбъектФизлицо.Пол          = Перечисления.ПолФизическихЛиц.Мужской;
				ИначеЕсли Прав(ФИО,3)="вна" Тогда
					ОбъектФизлицо.Пол          = Перечисления.ПолФизическихЛиц.Женский;
				КонецЕсли;	
				
				Если Не ПустаяСтрока(ВнешнийУИД) Тогда 
					ОбъектФизлицо.ВнешнийУИД = ВнешнийУИД;
				КонецЕсли;	
						
				ОбъектФизлицо.Записать();
				Ссылка = ОбъектФизлицо.Ссылка;
				
				Если не ПустаяСтрока(ДанныеПаспорта.Серия) и не ПустаяСтрока(ДанныеПаспорта.Номер) Тогда
					ПаспортныеДанныеФизЛиц = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
					ПаспортныеДанныеФизЛиц.Период        = ТекущаяДата();
					ПаспортныеДанныеФизЛиц.ФизЛицо       = ОбъектФизлицо.Ссылка;
					ПаспортныеДанныеФизЛиц.ДокументВид   = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
					Если НЕ ПустаяСтрока(ДанныеПаспорта.Серия) Тогда
						ПаспортныеДанныеФизЛиц.ДокументСерия = ДанныеПаспорта.Серия;
					КонецЕсли;	
					Если НЕ ПустаяСтрока(ДанныеПаспорта.Номер) Тогда
						ПаспортныеДанныеФизЛиц.ДокументНомер = ДанныеПаспорта.Номер;
					КонецЕсли;	
					Если ДатаВыдачи<>Дата(1,1,1) Тогда
						ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи = ДатаВыдачи;
					КонецЕсли;	
					ПаспортныеДанныеФизЛиц.Записать();
				КонецЕсли;
				Ответ = Ответ(200,"Создан новый "+ФИО);	
			КонецЕсли;	
		ИначеЕсли Источник.Свойство("Наименование") Тогда
			ИНН = "";
			Если Источник.Свойство("ИНН") Тогда
				ИНН = Источник.ИНН;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	Контрагенты.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.Контрагенты КАК Контрагенты
				               |ГДЕ
				               |	Контрагенты.ИНН = &ИНН
				               |	И НЕ Контрагенты.Ссылка В ИЕРАРХИИ(&Ссылка)
				               |	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
				Запрос.УстановитьПараметр("ИНН",ИНН);
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
			               |	Контрагенты.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Контрагенты КАК Контрагенты
			               |ГДЕ
			               |	Контрагенты.Наименование подобно ""%"+Источник.Наименование+"""%
						   |	И НЕ Контрагенты.Ссылка В ИЕРАРХИИ (&Ссылка)
				           |	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
			КонецЕсли;	
			Запрос.УстановитьПараметр("Ссылка",Справочники.Контрагенты.НайтиПоКоду("000000005"));
			ЕстьПравки = Ложь;
			Выборка= Запрос.Выполнить().Выбрать();
			Обновлено  = 0;
			ЕстьСтрахователи = Ложь;
			Пока Выборка.Следующий() Цикл
				ЕстьСтрахователи = Истина;
				Если Ссылка = Неопределено Тогда
					Ссылка= Выборка.Ссылка;
				КонецЕсли;	
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Если НЕ Объект.Наименование =  Источник.Наименование Тогда
					Объект.Наименование =  Источник.Наименование;
					ЕстьПравки = Истина;
				КонецЕсли;	
				Если ПустаяСтрока(ИНН) = ЛОЖЬ и  НЕ Объект.ИНН =  ИНН Тогда
					Объект.ИНН =  ИНН;
					ЕстьПравки = Истина;
				КонецЕсли;	
				
				Если Источник.Свойство("КПП") и ПустаяСтрока(Источник.КПП) = ЛОЖЬ и  НЕ Объект.КПП =  Источник.КПП Тогда
					Объект.КПП =  Источник.КПП;
					ЕстьПравки = Истина;
				КонецЕсли;	

				
				Если ЕстьПравки = Истина Тогда
					Обновлено = Обновлено+1;
					Объект.Записать();
				КонецЕсли;	
			КонецЦикла;	
			Если ЕстьСтрахователи = Ложь Тогда
				Объект = Справочники.Контрагенты.СоздатьЭлемент();
				
				Если Источник.Свойство("Наименование") и ПустаяСтрока(Источник.Наименование) = ЛОЖЬ и  НЕ Объект.Наименование =  Источник.Наименование Тогда
					Объект.Наименование =  Источник.Наименование;
					Объект.НаименованиеПолное  = Источник.Наименование;
					Объект.НаименованиеКраткое = Источник.Наименование;
				КонецЕсли;	
				Если ЛЕв(Объект.Наименование,2) = "ИП" или Найти(Объект.Наименование,"ндивидуальный") = 2 Тогда
					Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
				Иначе	
					Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
				КонецЕсли;	
				Если Источник.Свойство("ИНН") и ПустаяСтрока(Источник.ИНН) = ЛОЖЬ и  НЕ Объект.ИНН =  Источник.ИНН Тогда
					Объект.ИНН =  Источник.ИНН;
				КонецЕсли;	
				Если Источник.Свойство("КПП") и ПустаяСтрока(Источник.КПП) = ЛОЖЬ и  НЕ Объект.КПП =  Источник.КПП Тогда
					Объект.КПП =  Источник.КПП;
				КонецЕсли;
				Попытка 
					Объект.Записать();
					Ссылка = Объект.Ссылка;
				Исключение
				КонецПопытки;	
				
				Ответ = Ответ(200,"Создан страхователь "+Источник.Наименование);
				Возврат Ответ
			КонецЕсли;	
			Если Обновлено >0 Тогда
				Ответ = Ответ(200,"Обновлено "+Обновлено);
			ИначеЕсли  ЕстьСтрахователи =Истина Тогда
				Ответ = Ответ(200,"Нечего обновлять. Найден "+Выборка.Количество());
			Иначе
				Ответ = Ответ(200,"Не найдены страхователи ");
			КонецЕсли;	
		Иначе	
			Ответ = Ответ(406,"Отсутствуют обязательные поля поиска страхователя");
		КонецЕсли;
	Иначе
		Ответ = Ответ(406,"Некорректные параметры ");
	КонецЕсли;	
	
	Возврат Ответ
КонецФункции

Функция СрезПаспорта(Физлицо)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПаспортныеДанныеФизЛицСрезПоследних.Период КАК Период,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ДокументВид,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства
	               |ИЗ
	               |	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо);
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

#КонецОбласти


Функция ОтветНаАвтомобиль(Данные,СсылкаОбъект = Неопределено,VIN = "",СпрМарка = "",СпрМодель="")
	//
	//{"apikey":"fce6566b-7754-4764-ade3-ac4fdff9e226","command":"Автомобиль","params":{"VIN":"XW8ZZZ5NZDG103171", "ГосНомер" :"0350ОСВ22","Марка":"Жигули", "Модель" :"Тигуан" , "ГодВыпуска" :"2012" , "Мощность" :"170"}}
	VIN     = "";
	
	
	Если Данные.Свойство("params") Тогда
		Источник = Данные.params;
	Иначе
		Источник = Данные;
	КонецЕсли;	
	
		Если ТипЗнч(Источник) = Тип("Структура") Тогда
			Если Источник.Свойство("VIN") Тогда
				VIN = СокрЛП(Источник.VIN);
			Иначе
				Ответ = Ответ(406,"Отсутствует VIN");
				Возврат Ответ 		
			КонецЕсли;
			Если Источник.Свойство("Марка") Тогда
				Марка = СокрЛП(Источник.Марка);
			КонецЕсли;
			Если Источник.Свойство("Модель") Тогда
				Модель = СокрЛП(Источник.Модель);
			КонецЕсли;	
			
			Если Источник.Свойство("ГосНомер") Тогда
				ГосНомер = СокрЛП(Источник.ГосНомер);
			КонецЕсли;	
			
			Если Источник.Свойство("Мощность") Тогда
				Мощность = СокрЛП(Источник.Мощность);
			КонецЕсли;	
			
			Если Источник.Свойство("ГодВыпуска") Тогда
				ГодВыпуска = СокрЛП(Источник.ГодВыпуска);
			КонецЕсли;	
			Если ПустаяСтрока(VIN) Тогда
				Ответ = Ответ(406,"Пустой VIN");
				Возврат Ответ 		
			КонецЕсли;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	уб_ТранспортныеСредства.Объект КАК Объект,
			               |	уб_ТранспортныеСредства.РегистрационныйЗнак КАК РегистрационныйЗнак,
			               |	уб_ТранспортныеСредства.ИдентификационныйНомер КАК ИдентификационныйНомер,
			               |	уб_ТранспортныеСредства.МаркаТС КАК МаркаТС,
			               |	уб_ТранспортныеСредства.МодельТС КАК МодельТС,
			               |	уб_ТранспортныеСредства.ТипТС КАК ТипТС,
			               |	уб_ТранспортныеСредства.Категория КАК Категория,
			               |	уб_ТранспортныеСредства.ГодВыпуска КАК ГодВыпуска,
			               |	уб_ТранспортныеСредства.ДвигательНомер КАК ДвигательНомер,
			               |	уб_ТранспортныеСредства.ШассиНомер КАК ШассиНомер,
			               |	уб_ТранспортныеСредства.КузовНомер КАК КузовНомер,
			               |	уб_ТранспортныеСредства.Цвет КАК Цвет,
			               |	уб_ТранспортныеСредства.МощностьДвигателя КАК МощностьДвигателя,
			               |	уб_ТранспортныеСредства.МаксМасса КАК МаксМасса,
			               |	уб_ТранспортныеСредства.КолПассажирскихМест КАК КолПассажирскихМест,
			               |	уб_ТранспортныеСредства.Грузоподъемность КАК Грузоподъемность,
			               |	уб_ТранспортныеСредства.ПротивоугоннаяСистема КАК ПротивоугоннаяСистема,
			               |	уб_ТранспортныеСредства.ПаспортСерия КАК ПаспортСерия,
			               |	уб_ТранспортныеСредства.ПаспортНомер КАК ПаспортНомер,
			               |	уб_ТранспортныеСредства.ПаспортДатаВыдачи КАК ПаспортДатаВыдачи
			               |ИЗ
			               |	РегистрСведений.уб_ТранспортныеСредства КАК уб_ТранспортныеСредства
			               |ГДЕ
			               |	уб_ТранспортныеСредства.ИдентификационныйНомер ПОДОБНО &vin";
			Запрос.УстановитьПараметр("VIN",VIN);
			СтрокаОбновления = "";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				МЗ = РегистрыСведений.уб_ТранспортныеСредства.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ,Выборка);
				
				
				
				НеобходимоОбновитьНаименование = Ложь;
				Если ПустаяСтрока(Марка) Тогда
					СтрокаОбновления = СтрокаОбновления
					+"Пустая марка"
					+Символы.ПС;
				Иначе
					СпрМарка = Справочники.уб_МаркиТС.НайтиПоНаименованию(Марка);
					
					Если СпрМарка.Пустая() Тогда
						СтрокаОбновления = СтрокаОбновления
						+"Не найдена марка"
						+Символы.ПС;
					Иначе
						СтрокаОбновления = СтрокаОбновления
						+"Обновлена марка"
						+Символы.ПС;

						МЗ.МаркаТС = СпрМарка;
						НеобходимоОбновитьНаименование = Истина;
					КонецЕсли;	
					
				КонецЕсли;
				
				Если ПустаяСтрока(Модель) Тогда
					СтрокаОбновления = СтрокаОбновления
					+"Пустая модель"
					+Символы.ПС;
				Иначе
					СпрМодель = Справочники.уб_МоделиТС.НайтиПоНаименованию(Модель);
					
					Если СпрМодель.Пустая() Тогда
						СтрокаОбновления = СтрокаОбновления
						+"Не найдена модель"
						+Символы.ПС;
					Иначе
						Мз.МодельТС = СпрМодель;
						НеобходимоОбновитьНаименование = Истина;
						СтрокаОбновления = СтрокаОбновления
						+"Обновлена модель"
						+Символы.ПС;

					КонецЕсли;	
					
				КонецЕсли;	
				Если ЗначениеЗаполнено(ГодВыпуска) и не Мз.ГодВыпуска = ГодВыпуска Тогда
					СтрокаОбновления = СтрокаОбновления
						+"Обновлен год " +Мз.ГодВыпуска +"=>"+ГодВыпуска
						+Символы.ПС;

					Мз.ГодВыпуска = ГодВыпуска;
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(Мощность) и не Мз.МощностьДвигателя = Мощность Тогда
					СтрокаОбновления = СтрокаОбновления
						+"Обновлена мощность " +Мз.МощностьДвигателя +"=>"+Мощность
						+Символы.ПС;

					Мз.МощностьДвигателя = Мощность;
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(Госномер) и не Мз.РегистрационныйЗнак = Госномер Тогда
					СтрокаОбновления = СтрокаОбновления
						+"Обновлен госномер " +Мз.РегистрационныйЗнак +"=>"+Госномер
						+Символы.ПС;

					Мз.РегистрационныйЗнак = Госномер;
				КонецЕсли;	
				
				Если не пустаяСтрока(СтрокаОбновления) Тогда
					Мз.Записать();
				КонецЕсли;	
				Ответ = Ответ(200,"Найден "+vin+" обновлено: "+СтрокаОбновления);	
				Если НеобходимоОбновитьНаименование = Истина Тогда
					ОбъектСтрахования = Выборка.объект.ПолучитьОбъект();
					ОбъектСтрахования.Тип = Справочники.уб_ТипыОбъектовСтрахования.НайтиПоНаименованию("Автомобиль");
					ОбъектСтрахования.Наименование = Марка+" "+Модель;
					ОбъектСтрахования.Записать();
					СсылкаОбъект = Выборка.объект;
				Иначе
					СсылкаОбъект = Выборка.Объект;
				КонецЕсли;	
			КонецЦикла;
			Если Выборка.Количество() = 0 Тогда
				//Ответ = Ответ(200,"Не найден "+vin);	
				СпрМарка = Справочники.уб_МаркиТС.НайтиПоНаименованию(Марка);
				СпрМодель = Справочники.уб_МоделиТС.НайтиПоНаименованию(Модель);
				
				ОбъектСтрахования = СПравочники.уб_ОбъектыСтрахования.СоздатьЭлемент();
				ОбъектСтрахования.Наименование = ""+СпрМарка+" "+СпрМодель;
				ОбъектСтрахования.Тип = Справочники.уб_ТипыОбъектовСтрахования.НайтиПоНаименованию("Автомобиль");
				ОбъектСтрахования.Записать();
				СсылкаОбъект = ОбъектСтрахования.Ссылка;
				МЗ = РегистрыСведений.уб_ТранспортныеСредства.СоздатьМенеджерЗаписи();     
				МЗ.Объект = ОбъектСтрахования.Ссылка;
				Мз.ИдентификационныйНомер = VIN;
				Мз.РегистрационныйЗнак = Госномер;
				МЗ.МаркаТС = СпрМарка;
				
				Мз.МодельТС = СпрМодель;
				
				Мз.МощностьДвигателя = Мощность;
				Мз.РегистрационныйЗнак = Госномер;
				Мз.ГодВыпуска = ГодВыпуска;
				Мз.Записать();
				Ответ = Ответ(200,"Создан "+vin);	
			КонецЕсли;	
			
		Иначе
			Ответ = Ответ(406,"Некорректные параметры ");
		КонецЕсли;	
	
Возврат Ответ
КонецФункции

Функция ОтветНаСообщения(Данные)
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("request_id") Тогда
				
				//Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
				//	tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				//Иначе
				//	tg_id =  Строка(Данные.params.tg_id);
				//КонецЕсли;	
				
				Ответ = Новый Массив;
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Номер", Данные.params.request_id);
				Запрос.Текст = "ВЫБРАТЬ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка КАК Ссылка,
				               |	ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.00006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.0006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.006)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер * 6)) / 6 + 1, 1) КАК Номер
				               |ПОМЕСТИТЬ ЗаявкиНомера
				               |ИЗ
				               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
				               |ГДЕ
				               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Номер = &Номер
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ ПЕРВЫЕ 100
				               |	ЗаявкиНомера.Ссылка КАК Ссылка,
				               |	ЗаявкиНомера.Номер КАК Номер,
				               |	Сообщения.ИмяКанала КАК ИмяКанала,
				               |	ЕСТЬNULL(Сообщения.Отправитель.ФизЛицо.Наименование, """") КАК ОтправительФизЛицоНаименование,
				               |	ЕСТЬNULL(Сообщения.Отправитель.ФизЛицо.tg_id, """") КАК ОтправительФизЛицоtg_id,
				               |	ЕСТЬNULL(Сообщения.Получатель.ФизЛицо.Наименование, """") КАК ПолучательФизЛицоНаименование,
				               |	ЕСТЬNULL(Сообщения.Получатель.ФизЛицо.tg_id, """") КАК ПолучательФизЛицоtg_id,
				               |	ЕСТЬNULL(Сообщения.Сообщение, """") КАК Сообщение,
				               |	ЕСТЬNULL(Сообщения.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
				               |	ЕСТЬNULL(Сообщения.Руководителю, ЛОЖЬ) КАК Руководителю,
				               |	ЕСТЬNULL(Сообщения.SMS, ЛОЖЬ) КАК SMS,
				               |	ЕСТЬNULL(Сообщения.ИДСообщения, """") КАК УИД,
								|	ЕСТЬNULL(Сообщения.Заголовок,"""") КАК Заголовок
				               |ИЗ
				               |	ЗаявкиНомера КАК ЗаявкиНомера
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_Чат_Сообщения КАК Сообщения
				               |		ПО (""З-"" + ЗаявкиНомера.Номер = Сообщения.ИмяКанала)";
				Выборка     = Запрос.Выполнить();
				
				Если НЕ Выборка.Пустой() Тогда
					Сообщения = Сообщения(Выборка.Выгрузить());
					
					Возврат Ответ(200,уб_СЕРВЕРные.JSON(Сообщения));
				
				//	Структура.Вставить("БСО",МассивБСО);
					
					//Возврат Ответ(200,уб_СЕРВЕРные.JSON(Структура));
				Иначе
					Ответ = Ответ(404,"Не найдена заявка проверьте пользователя или номер");
					Возврат Ответ
				КонецЕсли;	
			Иначе
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции	

Функция Сообщения(Таблица)
	Сообщения = Новый Массив;
	Для каждого Сообщение из Таблица Цикл
		
		//Структура.Вставить("Руководителю",Сообщение.Руководителю);
		//Структура.Вставить("SMS",Сообщение.SMS);
		Сообщения.Добавить(Сообщение(Сообщение,Сообщение.Ссылка));
	КонецЦикла;	
	Возврат Сообщения; 
КонецФункции	
Функция Сообщение(Сообщение,Ссылка)
	Структура = Новый Структура;
	
	
	Структура.Вставить("ref",Префикс()+ПолучитьНавигационнуюСсылку(Ссылка));
	Если ТипЗнч(Сообщение) = тип("РегистрСведенийМенеджерЗаписи.уб_Чат_Сообщения") Тогда
		Структура.Вставить("УИД",Сообщение.ИДСообщения);
		Структура.Вставить("Заявка",Формат(Ссылка.Номер,"ЧГ="));	
		Структура.Вставить("Отправитель",Новый Структура("Имя,tg_id",Сообщение.Отправитель.ФизЛицо.Наименование,Сообщение.Отправитель.ФизЛицо.tg_id));
		Структура.Вставить("Получатель",Новый Структура("Имя,tg_id",Сообщение.Получатель.ФизЛицо.Наименование,Сообщение.Получатель.ФизЛицо.tg_id));
	Иначе	
		Структура.Вставить("УИД",Сообщение.УИД);
		Структура.Вставить("Заявка",Формат(Сообщение.Номер,"ЧГ="));	
		Структура.Вставить("Отправитель",Новый Структура("Имя,tg_id",Сообщение.ОтправительФизЛицоНаименование,Сообщение.ОтправительФизЛицоtg_id));
		Структура.Вставить("Получатель",Новый Структура("Имя,tg_id",Сообщение.ПолучательФизЛицоНаименование,Сообщение.ПолучательФизЛицоtg_id));
	КонецЕсли;	
	Структура.Вставить("Сообщение",Сообщение.Сообщение);
	Структура.Вставить("Заголовок",Сообщение.Заголовок);
	Структура.Вставить("Дата",Сообщение.Период);
	Возврат Структура
КонецФункции	

Функция ПреобразоватьПаспорт(ПАСПОРТ)
	Серия = "";
	Номер = "";
	Длина = СтрДлина(ПАСПОРТ);
	Для счетчик = 1 по Длина Цикл
		
		Символ = Сред(Паспорт,Счетчик,1);
		Если Найти("0123456789",Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Если СтрДлина(Серия) = 4 Тогда
			Номер = Номер+Символ;
		Иначе
			Серия = Серия+Символ;
		КонецЕсли;	
		
	КонецЦикла;	
	Возврат Новый Структура("Серия,Номер",Серия,Номер);
	
КонецФункции	

Функция ОтветНаСообщение(Данные) 
	
	Если Данные.Свойство("params") Тогда
		Если ТипЗнч(Данные.params) = Тип("Структура") Тогда
			Если Данные.params.Свойство("Заявка") Тогда
				
				//Если ТипЗНч(Данные.params.tg_id) = Тип("Число") Тогда
				//	tg_id = Формат(Данные.params.tg_id,"ЧГ=");
				//Иначе
				//	tg_id =  Строка(Данные.params.tg_id);
				//КонецЕсли;	
				
				НовыйКанал = "З-"+Формат(Данные.params.Заявка,"ЧГ=");
				ЗаявкаСсылка = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.НайтиПоНомеру(Данные.params.Заявка);
				Если НЕ ЗаявкаСсылка.Пустая() Тогда
					МЗ = РегистрыСведений.уб_Чат_Сообщения.СоздатьМенеджерЗаписи(); 
					МЗ.Период      = ТекущаяДата();
					Мз.ИмяКанала   = НовыйКанал;
					Мз.Отправитель = НайтиПользователя(Данные.params.Отправитель);
					Если Мз.Отправитель.Пустая() Тогда
						Ответ = Ответ(404,"Не найден отправитель");
						Возврат Ответ
					КонецЕсли;	
					Мз.Получатель  = НайтиПользователя(Данные.params.Получатель);
					Если Мз.Получатель.Пустая() Тогда
						Ответ = Ответ(404,"Не найден Получатель");
						Возврат Ответ
					КонецЕсли;	
					Если Данные.params.Свойство("УИД") Тогда
						МЗ.ИДСообщения = Новый УникальныйИдентификатор(Данные.params.УИД);
					Иначе
						МЗ.ИДСообщения = Новый УникальныйИдентификатор;
					КонецЕсли;	
					ОбработатьПериодСообщения(МЗ);
					
					Мз.Заголовок  = "Заявка "+Формат(Данные.params.Заявка,"ЧГ=")+", страхователь: "+ЗаявкаСсылка.Страхователь;					
					Мз.Сообщение = Данные.params.Сообщение;
					Мз.Записать();
					Сообщение = Сообщение(Мз,ЗаявкаСсылка);
					Если ЗначениеЗаполнено(Сообщение.Получатель.tg_id) Тогда
						СообщениеСтрокой = уб_СЕРВЕРные.JSON(Сообщение);
					КонецЕсли;	
					
					//https://kupipolis.ru/webhook.php?chat_push=true
					ssl = Новый ЗащищенноеСоединениеOpenSSL;
					Соединение = Новый httpСоединение("kupipolis.ru",,,,,,ssl);
					httpЗапрос = новый httpЗапрос("webhook.php?chat_push=true");
					httpЗапрос.УстановитьТелоИзСтроки(СообщениеСтрокой,КодировкаТекста.UTF8);
					
					
					Попытка
						Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
						Сообщить(Ответ.ПолучитьТелоКакСтроку());
						Возврат Ответ(200,"Записано.Отправка боту: "+Ответ.ПолучитьТелоКакСтроку());
					Исключение
						Ответ = Ответ(500,"Записано.Отправка боту: "+ОписаниеОшибки());
					КонецПопытки;	
					
					Возврат Ответ(200,"");
				Иначе	
					Ответ = Ответ(404,"Не найдена заявка");
					Возврат Ответ
				КонецЕсли;
				
				Ответ = Ответ(407,"Отсутствует request_id");
				Возврат Ответ
			КонецЕсли;
		Иначе	
			Ответ = Ответ(407,"Параметры имеют неизвестный формат");
			Возврат Ответ	
		КонецЕсли;	
	Иначе
		Ответ = Ответ(406,"Отсутствуют параметры");
		Возврат Ответ 	
	КонецЕсли;	
	
КонецФункции	

Функция НайтиПользователя(id)
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("tg_id", id);
	 Запрос.Текст = "ВЫБРАТЬ
	                |	Пользователи.Ссылка КАК Ссылка,
	                |	Пользователи.ФизЛицо.tg_id КАК ФизЛицоtg_id
	                |ИЗ
	                |	Справочник.Пользователи КАК Пользователи
	                |ГДЕ
	                |	Пользователи.ФизЛицо.tg_id = &tg_id";
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Возврат Выборка.Ссылка;
	 Иначе
		 Возврат Справочники.Пользователи.ПустаяСсылка();
	 КонецЕсли; 
 КонецФункции	
 
Процедура ОбработатьПериодСообщения(МЗ)
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	уб_Чат_Сообщения.Период КАК Период,
	                |	уб_Чат_Сообщения.Отправитель КАК Отправитель,
	                |	уб_Чат_Сообщения.Получатель КАК Получатель,
	                |	уб_Чат_Сообщения.ИмяКанала КАК ИмяКанала,
	                |	уб_Чат_Сообщения.ИДСообщения КАК ИДСообщения,
	                |	уб_Чат_Сообщения.Заголовок КАК Заголовок,
	                |	уб_Чат_Сообщения.Сообщение КАК Сообщение,
	                |	уб_Чат_Сообщения.Вложения КАК Вложения,
	                |	уб_Чат_Сообщения.НеОтображатьНаWeb КАК НеОтображатьНаWeb,
	                |	уб_Чат_Сообщения.ДатаОбновления КАК ДатаОбновления,
	                |	уб_Чат_Сообщения.ИмяИконки КАК ИмяИконки,
	                |	уб_Чат_Сообщения.ЕстьВложения КАК ЕстьВложения,
	                |	уб_Чат_Сообщения.ВОтчет КАК ВОтчет,
	                |	уб_Чат_Сообщения.SMS КАК SMS,
	                |	уб_Чат_Сообщения.Руководителю КАК Руководителю
	                |ИЗ
	                |	РегистрСведений.уб_Чат_Сообщения КАК уб_Чат_Сообщения
	                |ГДЕ
	                |	уб_Чат_Сообщения.Отправитель = &Отправитель
	                |	И уб_Чат_Сообщения.Получатель = &Получатель
	                |	И уб_Чат_Сообщения.ИмяКанала = &ИмяКанала
	                |	И уб_Чат_Сообщения.ИДСообщения = &ИДСообщения
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период";
	 Запрос.УстановитьПараметр("Отправитель",МЗ.Отправитель);
	 Запрос.УстановитьПараметр("Получатель",МЗ.Получатель);
	 Запрос.УстановитьПараметр("ИмяКанала",МЗ.ИмяКанала);
	 Запрос.УстановитьПараметр("ИДСообщения",МЗ.ИДСообщения);
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 МЗ.Период = Выборка.Период;
	КонецЕсли; 
КонецПроцедуры 

Функция Префикс()
	Возврат "https://work.kupipolis.ru:16788/IB/#";	
КонецФункции


Функция  УдалитьСтрокуФайла(ДокументОбъект,Выборка)
	НайденФайл = Ложь;
	Для каждого СтрокаСписка из ДокументОбъект.СписокФайлов Цикл
		Если СтрокаСписка.СсылкаСправочника = Выборка.СсылкаСправочника 
			и СтрокаСписка.УидСтроки = Выборка.УидСтроки
			Тогда
			ДокументОбъект.СписокФайлов.Удалить(СтрокаСписка);
			НайденФайл = Истина;
		КонецЕсли;	
	КонецЦикла;	
	Возврат НайденФайл
КонецФункции					


Функция ДатаИзСтроки(_СтрокаДаты)
	СтрокаДаты = ""+_СтрокаДаты;
	СтрокаДаты = СтрЗаменить(СтрокаДаты,"T","");
	СтрокаДаты = СтрЗаменить(СтрокаДаты,"-","");
	СтрокаДаты = СтрЗаменить(СтрокаДаты,":","");
	Попытка
		Возврат Дата(СтрокаДаты);
	Исключение
		//ВызватьИсключение("Дата("+СтрокаДаты+")");
		Возврат Дата(1,1,1);
		//Ответ = Ответ+
		//"Ключ "+ТекИмя+"."+ИмяТЧ+"."+КлючТЧ+" отсутствует"+
		//Символы.ПС;
		//Сообщить();
	КонецПопытки;

	
КонецФункции	

Функция apikey(Данные)
	Если Данные.apikey="fce6566b-7754-4764-ade3-ac4fdff9e226" Тогда
		Возврат Истина;
	ИначеЕсли Данные.apikey="3f7e4a8c-12d4-4b8a-9e2c-56a7f3d1b902" Тогда
		Возврат Истина;
	ИначеЕсли Данные.apikey="19df2ec7-f0a4-4d68-9ec6-4d38b9acc451" Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции	
//Как заставить XMLHTTPRequest загружать данные с другого домена
//http://infostart.ru/public/393456/index.php?ID=393456
//"Кроссдоменные HTTP-запросы к 1С"
//
//В конфиге Apache:
//1. Найти строку "#LoadModule headers_module modules/mod_headers.so" и убрать первый символ "#"
//2. В раздел "<Directory />" (также при наличии Location, Files) вписать следующее (соответственно указав области доступа более конкретно.):
//<IfModule mod_headers.c>
//   Header always set Access-Control-Allow-Origin "*"
//   Header always set Access-Control-Max-Age "1000"
//   Header always set Access-Control-Allow-Headers "X-Requested-With, Content-Type, Origin, Authorization, Accept, Client-Security-Token, Accept-Encoding"
//   Header always set Access-Control-Allow-Methods "POST, GET, OPTIONS, DELETE, PUT"
//</IfModule>

Функция НайтиПеречислениеПоСинонимуИлиИмени(ИмяПеречисления, ЗначениеДляПоиска)
    МетаданныеПеречисления = Метаданные.Перечисления[ИмяПеречисления];
	нрег = нрег(ЗначениеДляПоиска);
    Для Каждого Стр Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
        Если нрег(Стр.Синоним) = нрег Или нрег(Стр.Имя) = нрег Тогда
            Возврат Перечисления[ИмяПеречисления][Стр.Имя];
        КонецЕсли;
    КонецЦикла;
    Возврат Перечисления[ИмяПеречисления].ПустаяСсылка();
КонецФункции