////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ, ФУНКЦИИ ДЛЯ УСТАНОВКИ СООТВЕТСТВИЯ ПОЛИС- ДОГОВОР КОНТРАГЕНТА

// Проверяет, есть ли на договор ссылки кроме регистра сведений "СоответствиеПолисДоговор"
//
// Параметры
//  фДоговор  - ссылка на документ Страховой полис
//
// Возвращаемое значение
//  Истина - есть ссылки на договор, Ложь - нет
//
Функция ЕстьНеСвоиСсылкиНаДоговор(фДоговор)
	
	Массив = Новый Массив;
	Массив.Добавить(фДоговор);
	ТабСсылок = НайтиПоСсылкам(Массив);
	ЕстьЧужиеСсылки = Ложь;
	Для Каждого СтрокаТЗ из ТабСсылок Цикл		
			ЕстьЧужиеСсылки = Истина;		
	КонецЦикла;	
	
	Возврат ЕстьЧужиеСсылки;
	
КонецФункции

// Удаляет договор контрагента, или ставит пометку удаления, если на него имеются ссылки
//
// Параметры
//  фДоговор  - ссылка на документ Страховой полис
//
// Возвращаемое значение
//  Истина - договор удален, Ложь - нет
//
Функция УдалитьДоговор(фДоговор) Экспорт
	
	Удален = Ложь;
	Попытка
		Контрагент = фДоговор.Владелец;
		Если Контрагент.ОсновнойДоговорКонтрагента = фДоговор Тогда
			КонтрагентОбъект = Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.ОсновнойДоговорКонтрагента = "";
			КонтрагентОбъект.Записать();
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЕстьНеСвоиСсылкиНаДоговор(фДоговор) Тогда
		Если НЕ фДоговор.ПометкаУдаления Тогда
			Объект = фДоговор.ПолучитьОбъект();
			Объект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	Иначе
		Попытка
			Объект = фДоговор.ПолучитьОбъект();
			Объект.Удалить();
			Удален = Истина;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат Удален;
	
КонецФункции

// Создает договор контрагента, соответствующий документу "Страховой полис"
//
// Параметры
//  Ссылка  - ссылка на документ Страховой полис
//  ТекПользователь  - ссылка на справочник Пользователи
//
// Возвращаемое значение
//  Ссылка на созданный договор или пустая ссылка
//
Функция СоздатьДоговорСоответствующийПолису(Ссылка, ТекПользователь)
	
	Страхователь = Ссылка.Страхователь;
	
	// пропишем основной договор
	ДоговорОбъект              = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	ДоговорОбъект.Наименование = СокрЛП(Ссылка.Номер);
	ДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	
	ДоговорОбъект.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяВалютаВзаиморасчетов");
	Если ЗначениеНеЗаполнено(ДоговорОбъект.ВалютаВзаиморасчетов) Тогда
		//ДоговорОбъект.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
		ДоговорОбъект.ВалютаВзаиморасчетов = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
	КонецЕсли;
    ДоговорОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
	Если ЗначениеНеЗаполнено(ДоговорОбъект.Организация) Тогда
		Выборка = Справочники.Организации.Выбрать();
		Если Выборка.Следующий() Тогда
			ДоговорОбъект.Организация = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	ДоговорОбъект.Владелец    = Страхователь;
	ДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ДоговорОбъект.Комментарий = "#Создан документом "+Строка(Ссылка)+", дата создания: "+Строка(ТекущаяДата());
	// запишем и договор и Головного Контрагента
	СозданДоговор = Ложь;
	Попытка
		ДоговорОбъект.Записать();
		СозданДоговор = Истина;
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Договор, соответствующий Страховому полису не был создан. "+ОписаниеОшибки(),"Сообщить");
		//ОбщегоНазначения.СообщитьОбОшибке("Договор, соответствующий Страховому полису не был создан. "+ОписаниеОшибки());
	КонецПопытки; 
	Попытка
		Если СозданДоговор Тогда
			Если ЗначениеНеЗаполнено(Страхователь.ОсновнойДоговорКонтрагента) Тогда
				КонтрагентОбъект = Страхователь.ПолучитьОбъект();
				КонтрагентОбъект.ОсновнойДоговорКонтрагента = ДоговорОбъект.Ссылка;
				КонтрагентОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки; 
	
	Если СозданДоговор Тогда
		Возврат ДоговорОбъект.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

	
////////////////////////////////////////////////////////////////////////////////
