Перем Открыть;

// Процедура подключения к базе "Бухгалтерия предприятия"
Функция ПодключитьБазу(Ошибка = Неопределено) Экспорт
	
	User = ИмяПользователя;
	Pass = Пароль;
	Путь = ПутькБазе;
	Сервер = ИмяСервера;
	База = БазаНаСервере;
	
	Если СерверноеПодключение Тогда 
		
		ПараметрСоединения = "Srvr="""+Сервер+""";Ref="""+БазаНаСервере+""";Usr="""+User+""";Pwd="""+Pass+""";";
	Иначе
		
		ПараметрСоединения = "File=""" + ПутькБазе + """; Usr=""" + ИмяПользователя + """; Pwd="""+Пароль+""";";
	КонецЕсли;
	
	Возврат уб_ОбменДанными.ПодключитьСоединение(Открыть, ПараметрСоединения, "V82","База <Брокер> не открыта! Проверьте параметры подключения!");
	
КонецФункции


Функция ПолучитьТаблицуДляВыгрузки(Интерактивно = Ложь) Экспорт
	
	ТаблицаДанных  = Новый ТаблицаЗначений;
	Колонки = ТаблицаДанных.Колонки;
	Колонки.Добавить("ДанныеБухгалтерии");
	Колонки.Добавить("ДанныеБрокера");
	Колонки.Добавить("КодБрокера");
	Колонки.Добавить("УИД");
	Колонки.Добавить("Переносить");
	
	СтрокаОшибки ="";
	Если НЕ ПодключитьБазу(СтрокаОшибки) Тогда
		СтрокаСообщения=СтрокаОшибки;
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
		
		Возврат ТаблицаДанных;
	КонецЕсли;
	
	КонтрагентУБ = Справочники.Контрагенты.Выбрать();
	
	//	ИндикаторОбработки = ИндикаторОбработки + 10;
	
	Пока КонтрагентУБ.Следующий() Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		//		ИндикаторОбработки = ИндикаторОбработки + 1;
		
		Если КонтрагентУБ.ЭтоГруппа 
			Или КонтрагентУБ.ПометкаУдаления 
			Или ЗначениеЗаполнено(Открыть.Справочники.Контрагенты.НайтиПоКоду(КонтрагентУБ.КодБух).Наименование) 
			Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.ДанныеБрокера = КонтрагентУБ.Ссылка;
		НоваяСтрока.КодБрокера    = КонтрагентУБ.КодБух;
		НоваяСтрока.УИД			  = КонтрагентУБ.Ссылка.УникальныйИдентификатор();
		НоваяСтрока.Переносить  =  НЕ Интерактивно;
	КонецЦикла;
	Возврат ТаблицаДанных;
КонецФункции

//ПРОЦЕДУРЫ ДЛЯ ВЫГРУЗКИ ДАННЫХ 
//
Процедура ВыгрузитьДанныеИзУБ(ТаблицаДанных)  Экспорт
	// Выгрузка данных из УБ в БП
	ЗаписьХМL = Новый ЗаписьXML;
	//ИмяФайла = "C:\ВыгрузкаКонтрагентовИзУБ.xml";
	ИмяФайла = ФайлВыгрузки;
	ЗаписьХМL.ОткрытьФайл(ИмяФайла);
	
	// Записать начало корневого элемента 
	ЗаписьХМL.ЗаписатьНачалоЭлемента("Корневой");
	
	Переносимые = ТаблицаДанных.Скопировать(Новый Структура("Переносить",Истина));
	
	ВыгрузитьКонтрагентов(Переносимые,ЗаписьХМL);
	
	ЗаписьХМL.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой"
	ЗаписьХМL.Закрыть();
КонецПроцедуры	


// Процедура выгружает выбранных контрагентов в xml-файл
Процедура ВыгрузитьКонтрагентов(ТаблицаДляВыгрузки,ЗаписьХМL)
	
	// Записываем контрагентов
	Для Каждого Выборка Из ТаблицаДляВыгрузки Цикл 
		
		Если Не Выборка.Переносить Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("Контрагент");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Выборка.ДанныеБрокера.Наименование);
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("УникальныйИдентификатор");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.УИД));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ЮрФизЛицо");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.ЮрФизЛицо));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Родитель");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.Родитель.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		Если Строка(Выборка.ДанныеБрокера.ЮрФизЛицо) = "Юр. лицо" Тогда
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("НаименованиеПолное");
			ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.НаименованиеПолное));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("КПП");
			ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.КПП));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
		Иначе
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("ДокументУдостоверяющийЛичность");
			ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.ДокументУдостоверяющийЛичность));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
		КонецЕсли;
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ИНН");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.ИНН));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("КодПоОКПО");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.КодПоОКПО));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ГоловнойКонтрагентКод");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБрокера.ГоловнойКонтрагент.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьКонецЭлемента(); 
		//ИндикаторОбработки = ИндикаторОбработки + 100;
		ВыгрузитьДоговора(Выборка.ДанныеБрокера,ЗаписьХМL);
		//ИндикаторОбработки = ИндикаторОбработки + 100;
		ВыгрузитьСчета(Выборка.ДанныеБрокера,ЗаписьХМL);
		//ИндикаторОбработки = ИндикаторОбработки + 100;
		ВыгрузитьКИ(Выборка.ДанныеБрокера,ЗаписьХМL);
		//ИндикаторОбработки = ИндикаторОбработки + 100;
	КонецЦикла;
	
КонецПроцедуры	

// Процедура выгружает договора выбранных контрагентов в xml-файл
Процедура ВыгрузитьДоговора(Владелец,ЗаписьХМL)
	
	// Записываем договора контрагентов
	
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Договор = Справочники.ДоговорыКонтрагентов.Выбрать(,Владелец.Ссылка);
	
	Пока Договор.Следующий() Цикл
		
		//Для Каждого Выборка Из ТабличноеПоле Цикл 
		//	
		Если Договор.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("ДоговораКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Владелец.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВалютаВзаиморасчетов");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.ВалютаВзаиморасчетов));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВидДоговора");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.ВидДоговора));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ОрганизацияНаим");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Организация.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ОрганизацияКод");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Организация.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ПроцентКомиссионногоВознаграждения");
		ЗаписьХМL.ЗаписатьТекст(Формат(Договор.ПроцентКомиссионногоВознаграждения,"ЧГ="));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("СрокДействия");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.ДатаОкончанияДействияДоговора));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		//		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура выгружает банковские счета выбранных контрагентов в xml-файл
Процедура ВыгрузитьСчета(Владелец,ЗаписьХМL)
	
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем договора контрагентов
	Счет = Справочники.БанковскиеСчета.Выбрать(,Владелец.Ссылка);
	
	Пока Счет.Следующий() Цикл
		
		Если Счет.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("БанковскиеСчетаКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Владелец.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Банк");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Банк.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВалютаДенежныхСредств");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.ВалютаДенежныхСредств));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("НомерСчета");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.НомерСчета));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВидСчета");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.ВидСчета));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выгружает контактную информацию выбранных контрагентов в xml-файл
Процедура ВыгрузитьКИ(Владелец,ЗаписьХМL)
	
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем договора контрагентов
	КИ = РегистрыСведений.КонтактнаяИнформация.Выбрать(Новый Структура("Объект",Владелец.Ссылка));
	
	Пока КИ.Следующий() Цикл
		
		//Для Каждого Выборка Из ТабличноеПоле Цикл 
		//	
		//	Если Не Выборка.Переносить Или Не КИ.Объект = Выборка.ДанныеБрокера Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//	
		ЗаписьХМL.ЗаписатьНачалоЭлемента("КонтактнаяИнформацияКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Объект.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Вид");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Вид.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле1");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле1));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле2");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле2));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле3");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле3));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле4");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле4));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле5");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле5));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле6");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле6));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле7");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле7));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле8");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле8));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле9");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле9));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле10");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле10));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Представление");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Представление));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Тип");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Тип));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		//КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры


// ПРОЦЕДУРЫ ДЛЯ ЗАГРУЗКИ ДАННЫХ

//Процедура ВыполнитьАвтоматическуюЗагрузку()

//КонецПроцедуры;	

Функция ЗаполнитьТаблицуДляЗагрузкиИзБП() Экспорт 
	
	ТаблицаДанных  = Новый ТаблицаЗначений;
	Колонки = ТаблицаДанных.Колонки;
	Колонки.Добавить("ДанныеБухгалтерии");
	Колонки.Добавить("ДанныеБрокера");
	Колонки.Добавить("КодБрокера");
	Колонки.Добавить("УИД");
	Колонки.Добавить("Переносить");
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(Файл);
	
	Имя = ЧтениеXML.Имя;
	
	Пока ЧтениеXML.Прочитать() Цикл 
		
		//		ИндикаторОбработки = ИндикаторОбработки + 1;
		
		ПолучитьXMLТип(ЧтениеXML);
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента  Тогда
			
			Имя = ЧтениеXML.Имя;
			
			Если Имя = "Контрагент" Тогда
				ЧтениеXML.ПрочитатьАтрибут();           
				ЧтениеXML.ПрочитатьАтрибут();
				
				Наименование = СокрЛП(ЧтениеXML.Значение);
				ЧтениеXML.ПрочитатьАтрибут();
				УИД			  	  = СокрЛП(ЧтениеXML.Значение);
				
				СсылкаПОУИД = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
				СсылкаПоНаименованию = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
				Если  НЕ ЗначениеЗаполнено(СсылкаПОУИД.Код)
					И Не ЗначениеЗаполнено(СсылкаПоНаименованию) Тогда
					НоваяСтрока = ТаблицаДанных.Добавить();
					НоваяСтрока.Переносить        = Истина;
					НоваяСтрока.ДанныеБухгалтерии = Наименование;
					НоваяСтрока.УИД			  	  = УИД;
				Иначе
					СтрокаСообщения="Контрагент " + СокрЛП(Наименование) + " уже создан в базе ""Управление брокером""! 
					|Внутренний UID"+УИД+"/"+СсылкаПоНаименованию+"/"+СсылкаПоУИД+"
					|		Проверьте заполнение кода в базе ""Бухгалтерия предприятия""!";
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить");
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТаблицаДанных;
КонецФункции

Процедура ЗагрузитьФайлИзБП(ТаблицаЗагрузки) Экспорт
	ТабличноеПоле = ТаблицаЗагрузки.Скопировать(Новый Структура("Переносить",Истина));
	ТабличноеПоле.Индексы.Добавить("ДанныеБухгалтерии");
	//ИндикаторОбработки = 0;
	//ЭлементыФормы.ИндикаторОбработки.МаксимальноеЗначение = ?(ЭлементовВФайле=Неопределено,1000,ЭлементовВФайле);
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(Файл);
	
	Имя = ЧтениеXML.Имя;
	ЕстьОшибкаПоКонтрагенту = Ложь;
	Пока ЧтениеXML.Прочитать() Цикл 
		
		//		ИндикаторОбработки = ИндикаторОбработки + 1;
		
		ПолучитьXMLТип(ЧтениеXML);
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента  Тогда
			
			Имя = ЧтениеXML.Имя;
			
			Если Имя = "Контрагент" Тогда
				Если ТранзакцияАктивна() Тогда
					Если ЕстьОшибкаПоКонтрагенту Тогда
						
						СтрокаСообщения="Отменена транзакция из-за ошибок";
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
						ОтменитьТранзакцию()
					Иначе
						ПОпытка
							ЗафиксироватьТранзакцию();
						Исключение
							
							СтрокаСообщения="При Фиксации транзакции: "+ОписаниеОшибки();
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
						КонецПопытки;	
					Конецесли;	
				КонецЕсли;
				
				ЕстьОшибкаПоКонтрагенту = Ложь;
				НачатьТранзакцию();
				
				ЧтениеXML.ПрочитатьАтрибут();           
				Код = ЧтениеXML.Значение;
				ЧтениеXML.ПрочитатьАтрибут();
				Наим = СокрЛП(ЧтениеXML.Значение);
				
				ТекСтрока = ТабличноеПоле.Найти(Наим, "ДанныеБухгалтерии");
				
				Если ТекСтрока = Неопределено Или Не ТекСтрока.Переносить Тогда 
					Продолжить;
				КонецЕсли;
				
				ЧтениеXML.ПрочитатьАтрибут();
				СтрокаGUID = СокрЛП(ЧтениеXML.Значение);
				НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
				УИД = Справочники.Контрагенты.ПолучитьСсылку(НовыйGUID);
				
				Если ЗначениеЗаполнено(УИД.Код) Тогда 
					
					СтрокаСообщения="Уже есть такой контрагент или изменено наименование контрагента: " + УИД.Наименование + " / " + Наим;
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить");
					Продолжить;
				Иначе
					ЕстьОшибка = НЕ СоздатьКонтрагента(ЧтениеXML,Наим,Код,УИД);
					ЕстьОшибкаПоКонтрагенту = ?(ЕстьОшибкаПоКонтрагенту,Истина,ЕстьОшибка);
					Если НЕ ЕстьОшибкаПоКонтрагенту Тогда
						ТекСтрока.КодБрокера = Код;
					КонецЕсли;	
				КонецЕсли;
			ИначеЕсли Имя = "ДоговораКонтрагента" Тогда
				ЧтениеXML.ПрочитатьАтрибут();
				Попытка
					Владелец  = Справочники.Контрагенты.НайтиПоНаименованию(ЧтениеXML.Значение);
				Исключение
					СтрокаСообщения="Ошибка при поиске контрагента, возможно нужна переиндексация базы / "+ ЧтениеXML.Значение;
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
					Продолжить;
				КонецПопытки;	
				ТекСтрока = ТабличноеПоле.Найти(СокрЛП(ЧтениеXML.Значение), "ДанныеБухгалтерии");
				Если ТекСтрока = Неопределено Или Не ТекСтрока.Переносить Или Не ЗначениеЗаполнено(Владелец.Код) Тогда 
					Продолжить;
				Иначе
					ЕстьОшибка = НЕ СоздатьДоговор(ЧтениеXML,Владелец);
					ЕстьОшибкаПоКонтрагенту = ?(ЕстьОшибкаПоКонтрагенту,Истина,ЕстьОшибка);
				КонецЕсли;
			ИначеЕсли Имя = "БанковскиеСчетаКонтрагента" Тогда
				ЧтениеXML.ПрочитатьАтрибут();
				Попытка
					Владелец  = Справочники.Контрагенты.НайтиПоНаименованию(ЧтениеXML.Значение);
				Исключение
					СтрокаСообщения="Ошибка при поиске контрагента, возможно нужна переиндексация базы / "+ ЧтениеXML.Значение;
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
					Продолжить;
				КонецПопытки;	
				ТекСтрока = ТабличноеПоле.Найти(СокрЛП(ЧтениеXML.Значение), "ДанныеБухгалтерии");
				Если ТекСтрока = Неопределено Или Не ТекСтрока.Переносить Или Не ЗначениеЗаполнено(Владелец.Код) Тогда 
					Продолжить;
				Иначе
					
					ЕстьОшибка = НЕ СоздатьСчет(ЧтениеXML,Владелец);
					ЕстьОшибкаПоКонтрагенту = ?(ЕстьОшибкаПоКонтрагенту,Истина,ЕстьОшибка);
					
				КонецЕсли;
				
			ИначеЕсли Имя = "КонтактнаяИнформацияКонтрагента" Тогда
				ЧтениеXML.ПрочитатьАтрибут();
				Попытка
					Владелец  = Справочники.Контрагенты.НайтиПоНаименованию(ЧтениеXML.Значение);
				Исключение
					СтрокаСообщения="Ошибка при поиске контрагента, возможно нужна переиндексация базы / "+ ЧтениеXML.Значение;
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
					Продолжить;
				КонецПопытки;	
				ТекСтрока = ТабличноеПоле.Найти(СокрЛП(ЧтениеXML.Значение), "ДанныеБухгалтерии");
				Если ТекСтрока = Неопределено Или Не ТекСтрока.Переносить  Или Не ЗначениеЗаполнено(Владелец.Код) Тогда 
					Продолжить;
				Иначе
					ЕстьОшибка = НЕ СоздатьКИ(ЧтениеXML,Владелец);
					ЕстьОшибкаПоКонтрагенту = ?(ЕстьОшибкаПоКонтрагенту,Истина,ЕстьОшибка);
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	Если ТранзакцияАктивна() Тогда
		Если ЕстьОшибкаПоКонтрагенту Тогда
			ОтменитьТранзакцию()
		Иначе
			ПОпытка
				ЗафиксироватьТранзакцию();
			Исключение
				СтрокаСообщения="При Фиксации транзакции: "+ОписаниеОшибки();
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
			КонецПопытки;	
		Конецесли;	
	КонецЕсли;
	//ИндикаторОбработки = 1000;
	
	
КонецПроцедуры	

// Процедура создания выбранного контрагента с данными из xml-файла
Функция СоздатьКонтрагента(ЧтениеXML,Наим,Код,СсылкаПоУИД)
	
	Попытка
		
		НовыйКонтрагентБП 						 = Справочники.Контрагенты.СоздатьЭлемент();
		
		НовыйКонтрагентБП.УстановитьСсылкуНового(СсылкаПоУИД);
		
		//ЧтениеXML.ПрочитатьАтрибут();           
		НовыйКонтрагентБП.КодБух                 = Код;
		//ЧтениеXML.ПрочитатьАтрибут();
		//Наим 									 = СокрЛП(ЧтениеXML.Значение);
		//НовыйКонтрагентБП.Наименование			 = СокрЛП(ЧтениеXML.Значение);
		НовыйКонтрагентБП.Наименование			 = Наим;
		ЧтениеXML.ПрочитатьАтрибут();
		Если ЧтениеXML.Значение = "Юр. лицо" Тогда
			НовыйКонтрагентБП.ЮрФизЛицо  		 = Перечисления.ЮрФизЛицо.ЮрЛицо;
		Иначе                                           
			НовыйКонтрагентБП.ЮрФизЛицо  		 = Перечисления.ЮрФизЛицо.ФизЛицо;
		КонецЕсли;
		ЧтениеXML.ПрочитатьАтрибут();
		Группа 									 = НайтиГруппу(ЧтениеXML.Значение);
		НовыйКонтрагентБП.Родитель  			 = Группа;
		ЧтениеXML.ПрочитатьАтрибут();
		Если НовыйКонтрагентБП.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
			НовыйКонтрагентБП.НаименованиеПолное = СокрЛП(ЧтениеXML.Значение);
			ЧтениеXML.ПрочитатьАтрибут();
			НовыйКонтрагентБП.КПП		         = СокрЛП(ЧтениеXML.Значение);
		Иначе 
			НовыйКонтрагентБП.ДокументУдостоверяющийЛичность = СокрЛП(ЧтениеXML.Значение);
		КонецЕсли;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйКонтрагентБП.ИНН                    = СокрЛП(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйКонтрагентБП.КодПоОКПО              = СокрЛП(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		//НовыйКонтрагентБП.ГоловнойКонтрагент	 = Справочники.Контрагенты.НайтиПоКоду(ЧтениеXML.Значение);
		НовыйКонтрагентБП.УстановитьНовыйКод();
		НовыйКонтрагентБП.Записать();
		Возврат Истина;
	Исключение
		
		СтрокаСообщения="Не удалось создать контрагента " + Наим + "/" + ОписаниеОшибки();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура создания нового договора выбранного контрагента с данными из xml-файла
Функция СоздатьДоговор(ЧтениеXML,Владелец)
	
	Попытка
		
		НовыйДоговорБП 						= Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		//ЧтениеXML.ПрочитатьАтрибут();
		//Владелец							= Справочники.Контрагенты.НайтиПоНаименованию(ЧтениеXML.Значение);
		НовыйДоговорБП.Владелец				= Владелец;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйДоговорБП.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоНаименованию(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		Если ЧтениеXML.Значение = "С поставщиком" Тогда
			НовыйДоговорБП.ВидДоговора 		=  Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ИначеЕсли ЧтениеXML.Значение = "С покупателем" Тогда
			НовыйДоговорБП.ВидДоговора 		=  Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		ИначеЕсли ЧтениеXML.Значение = "С комитентом (принципалом)" Тогда
			НовыйДоговорБП.ВидДоговора 		=  Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
		ИначеЕсли ЧтениеXML.Значение = "С комиссионером (агентом)" Тогда
			НовыйДоговорБП.ВидДоговора 		=  Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
		ИначеЕсли ЧтениеXML.Значение = "Прочее" Тогда
			НовыйДоговорБП.ВидДоговора 		=  Перечисления.ВидыДоговоровКонтрагентов.Прочее;
		КонецЕсли;
		ЧтениеXML.ПрочитатьАтрибут();
		//НовыйДоговорБП.Код        			= 
		ЧтениеXML.ПрочитатьАтрибут();
		Наим								= СокрЛП(ЧтениеXML.Значение);
		НовыйДоговорБП.Наименование       	= СокрЛП(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		ОргНаим = ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		ОргКод  = ЧтениеXML.Значение;
		Организация = ПроверитьОрганизацию(ОргНаим, ОргКод);
		НовыйДоговорБП.Организация        	= Организация;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйДоговорБП.ПроцентКомиссионногоВознаграждения = ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйДоговорБП.ДатаОкончанияДействияДоговора      = Дата(ЧтениеXML.Значение);
		НовыйДоговорБП.УстановитьНовыйКод();
		НовыйДоговорБП.Записать();
		Возврат Истина
	Исключение
		
		СтрокаСообщения="Не удалось создать договор " + Наим + " контрагента " + Владелец + " / " + ОписаниеОшибки();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
		Возврат Ложь
	КонецПопытки;
	
КонецФункции

// Процедура создания нового банковского счета выбранного контрагента с данными из xml-файла
Функция СоздатьСчет(ЧтениеXML,Владелец)
	
	Попытка
		
		НовыйСчет 						= Справочники.БанковскиеСчета.СоздатьЭлемент();
		//ЧтениеXML.ПрочитатьАтрибут();
		//Владелец						= Справочники.Контрагенты.НайтиПоНаименованию(ЧтениеXML.Значение);
		НовыйСчет.Владелец              = Владелец;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйСчет.Банк                  = Справочники.Банки.НайтиПоКоду(СокрЛП(ЧтениеXML.Значение));
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйСчет.ВалютаДенежныхСредств = Справочники.Валюты.НайтиПоНаименованию(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		//НовыйСчет.Код			        =
		ЧтениеXML.ПрочитатьАтрибут();
		Наим 							= ЧтениеXML.Значение;
		НовыйСчет.Наименование          = ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйСчет.НомерСчета            = СокрЛП(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		НовыйСчет.ВидСчета				= СокрЛП(ЧтениеXML.Значение);
		НовыйСчет.УстановитьНовыйКод();
		НовыйСчет.Записать();
		Возврат Истина;
	Исключение
		
		СтрокаСообщения="Не удалось создать счет " + Наим + "контрагента " + Владелец + " / " + ОписаниеОшибки();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Процедура создания новой контактной информации выбранного контрагента с данными из xml-файла
Функция СоздатьКИ(ЧтениеXML,Владелец)
	
	Попытка
		
		НоваяКИ 		= РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		//ЧтениеXML.ПрочитатьАтрибут();
		//Владелец 			= НайтиВладельцаКИ(ЧтениеXML.Значение);
		НоваяКИ.Объект  = Владелец;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Вид 	= Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(ЧтениеXML.Значение);
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле1  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле2  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле3  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле4  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле5  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле6  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле7  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле8  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле9  	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		НоваяКИ.Поле10 	= ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		Наим 			= ЧтениеXML.Значение; 
		НоваяКИ.Представление = ЧтениеXML.Значение;
		ЧтениеXML.ПрочитатьАтрибут();
		Если ЧтениеXML.Значение = "Адрес" Тогда
			НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ИначеЕсли ЧтениеXML.Значение = "Телефон" Тогда
			НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ИначеЕсли ЧтениеXML.Значение = "ВебСтраница" Тогда
			НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
		ИначеЕсли ЧтениеXML.Значение = "АдресЭлектроннойПочты" Тогда
			НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ИначеЕсли ЧтениеXML.Значение = "Другое" Тогда
			НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
		КонецЕсли;
		НоваяКИ.Записать();
		Возврат Истина;
	Исключение
		
		СтрокаСообщения="Не удалось создать контактную информацию " + Наим + " контрагента " + Владелец + "/" + ОписаниеОшибки();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СтрокаСообщения,"Сообщить",ДобавлятьЗаписьВЖурнал);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Функция проверки существования выбранной организации
Функция ПроверитьОрганизацию(ОргНаим, ОргКод)
	
	ОргПоКоду = Справочники.Организации.НайтиПоКоду(ОргКод);
	ОргПоНаим = Справочники.Организации.НайтиПоНаименованию(ОргНаим);
	
	Если ОргПоКоду.Наименование = ОргПоНаим.Наименование Тогда
		Возврат ОргПоКоду;
	ИначеЕсли НЕ ОргПоКоду.Пустая() И Найти(ОргНаим,ОргПоКоду.Наименование)>0 Тогда
		Возврат ОргПоКоду;	
	Иначе 
		Возврат ОргПоНаим;
	КонецЕсли;
	
КонецФункции

// Функция поиска владельца контактной информации
Функция НайтиВладельцаКИ(Владелец)
	
	Если ЗначениеЗаполнено(Справочники.Контрагенты.НайтиПоНаименованию(Владелец)) Тогда
		Возврат Справочники.Контрагенты.НайтиПоНаименованию(Владелец);
	ИначеЕсли ЗначениеЗаполнено(Справочники.ФизическиеЛица.НайтиПоНаименованию(Владелец)) Тогда 
		Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию(Владелец);
	КонецЕсли;
	
КонецФункции	

// Функция поиска группы контрагента для загрузки данных
Функция НайтиГруппу(ТекНаим)
	
	Группа = Справочники.Контрагенты.НайтиПоНаименованию(ТекНаим);
	Если Группа.Наименование = ТекНаим И Группа.ЭтоГруппа Тогда
		Возврат Группа.Ссылка;
	КонецЕсли;
	
	НоваяГруппа 			 = Справочники.Контрагенты.СоздатьГруппу();
	НоваяГруппа.Наименование = ТекНаим;
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
	
КонецФункции


//Процедуры для выгрузки данных из БП через COM - соединение
//через Промежуточные Файлы

Функция ПолучитьТаблицуДляВыгрузкиИзБП() Экспорт
	
	//	ИндикаторОбработки = 0;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Колво
	//|ИЗ
	//|	Справочник.Контрагенты КАК Контрагенты";
	//Результат = Запрос.Выполнить().Выбрать();
	//Результат.Следующий();
	//	ЭлементыФормы.ИндикаторОбработки.МаксимальноеЗначение = 10 + Результат.Колво;
	
	ТаблицаДанных  = Новый ТаблицаЗначений;
	Колонки = ТаблицаДанных.Колонки;
	Колонки.Добавить("ДанныеБухгалтерии");
	Колонки.Добавить("ДанныеБрокера");
	Колонки.Добавить("КодБрокера");
	Колонки.Добавить("УИД");
	Колонки.Добавить("Переносить");
	
	
	
	
	Если НЕ ПодключитьБазу() Тогда
		Возврат ТаблицаДанных;
	КонецЕсли;	
	
	КонтрагентБП = Открыть.Справочники.Контрагенты.Выбрать();
	
	//	ИндикаторОбработки = ИндикаторОбработки + 10;
	
	Пока КонтрагентБП.Следующий() Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		Если Лев(КонтрагентБП.Комментарий,1)="-" Тогда
			//Исключения
			Продолжить;
		КонецЕсли;	
		//	ИндикаторОбработки = ИндикаторОбработки + 1;
		
		Если КонтрагентБП.ЭтоГруппа 
			Или КонтрагентБП.ПометкаУдаления 
			Или ЗначениеЗаполнено(Справочники.Контрагенты.НайтиПоРеквизиту("КодБух", КонтрагентБП.Код).Наименование) 
			Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.ДанныеБухгалтерии = КонтрагентБП.Ссылка;
		НоваяСтрока.КодБрокера        = КонтрагентБП.Код;
		НоваяСтрока.УИД				  = Открыть.String(КонтрагентБП.Ссылка.УникальныйИдентификатор());
		
	КонецЦикла;
	
	//Предупреждение("Таблица для переноса заполнена!");
	Возврат ТаблицаДанных;
КонецФункции	

Процедура ВыгрузитьДанныеИзБП(ТаблицаДанных)
	Если ФайлВыгрузки = "" Тогда
		//Предупреждение("Не выбран файл выгрузки данных из базы ""Бухгалтерия предприятия""");
		//ОбработкаОбъект.ПолучитьФорму().Панель.ТекущаяСтраница = ОбработкаОбъект.ПолучитьФорму().Панель.Страницы.Получить(1);
		Возврат;
	КонецЕсли;	
	
	Выгружать = НЕ ТаблицаДанных.Найти(Истина,"Переносить") = Неопределено;
	
	Если Не Выгружать Тогда 
		//Предупреждение("Не выбраны элементы для выгрузки");
		Возврат;
	КонецЕсли;
	Переносимые = ТаблицаДанных.Скопировать(Новый Структура("Переносить",Истина));
	
	ИндикаторОбработки = 0;
	// Выгрузка данных из БП в УБ
	ЗаписьХМL = Новый ЗаписьXML;
	//ИмяФайла = "C:\ВыгрузкаКонтрагентовИзБП.xml";
	ИмяФайла = ФайлВыгрузки;
	ЗаписьХМL.ОткрытьФайл(ИмяФайла);
	
	// Записать начало корневого элемента 
	ЗаписьХМL.ЗаписатьНачалоЭлемента("Корневой");
	
	
	
	ВыгрузитьКонтрагентовИзБП(Переносимые,ЗаписьХМL);
	
	//ВыгрузитьКодыКонтрагентов();
	//ИндикаторОбработки = ИндикаторОбработки + 100;
	
	ЗаписьХМL.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой"
	ЗаписьХМL.Закрыть();
	
	//Предупреждение("Выгрузка данных закончена");
КонецПроцедуры

// Процедура выгружает выбранных контрагентов в xml-файл
Процедура ВыгрузитьКонтрагентовИзБП(ТабличноеПоле,ЗаписьХМL)
	
	// Записываем контрагентов
	Для Каждого Выборка Из ТабличноеПоле Цикл 
		
		ИндикаторОбработки = ИндикаторОбработки + 1;
		
		Если Не Выборка.Переносить Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("Контрагент");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Выборка.ДанныеБухгалтерии.Наименование);
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("УникальныйИдентификатор");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Выборка.УИД));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ЮрФизЛицо");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Выборка.ДанныеБухгалтерии.ЮрФизЛицо));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Родитель");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.Родитель.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		Если Строка(Выборка.ДанныеБухгалтерии.ЮрФизЛицо) = "Юр. лицо" Тогда
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("НаименованиеПолное");
			ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.НаименованиеПолное));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("КПП");
			ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.КПП));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
		Иначе
			
			ЗаписьХМL.ЗаписатьНачалоАтрибута("ДокументУдостоверяющийЛичность");
			ЗаписьХМL.ЗаписатьТекст(Открыть.String(Выборка.ДанныеБухгалтерии.ДокументУдостоверяющийЛичность));
			ЗаписьХМL.ЗаписатьКонецАтрибута();
			
		КонецЕсли;
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ИНН");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.ИНН));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("КодПоОКПО");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.КодПоОКПО));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ГоловнойКонтрагентКод");
		ЗаписьХМL.ЗаписатьТекст(Строка(Выборка.ДанныеБухгалтерии.ГоловнойКонтрагент.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		
		ВыгрузитьДоговораИзБП(ЗаписьХМL,Выборка.ДанныеБухгалтерии);
		ВыгрузитьСчетаИзБП(ЗаписьХМL,Выборка.ДанныеБухгалтерии);
		ВыгрузитьКИИзБП(ЗаписьХМL,Выборка.ДанныеБухгалтерии);
		
	КонецЦикла;
	
КонецПроцедуры	

// Процедура выгружает договора выбранных контрагентов в xml-файл
Процедура ВыгрузитьДоговораИзБП(ЗаписьХМL,Владелец)
	
	// Записываем договора контрагентов
	Договор = Открыть.Справочники.ДоговорыКонтрагентов.Выбрать(,Владелец.Ссылка);
	
	Пока Договор.Следующий() Цикл
		
		Если Договор.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("ДоговораКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Договор.Владелец));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВалютаВзаиморасчетов");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Договор.ВалютаВзаиморасчетов));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВидДоговора");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Договор.ВидДоговора));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ОрганизацияНаим");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Организация.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ОрганизацияКод");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.Организация.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ПроцентКомиссионногоВознаграждения");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.ПроцентКомиссионногоВознаграждения));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("СрокДействия");
		ЗаписьХМL.ЗаписатьТекст(Строка(Договор.СрокДействия));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выгружает банковские счета выбранных контрагентов в xml-файл
Процедура ВыгрузитьСчетаИзБП(ЗаписьХМL,Владелец)
	
	// Записываем договора контрагентов
	Счет = Открыть.Справочники.БанковскиеСчета.Выбрать(,Владелец.Ссылка);
	
	Пока Счет.Следующий() Цикл
		
		Если Счет.ПометкаУдаления  Тогда
			Продолжить;
		КонецЕсли;	
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("БанковскиеСчетаКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Счет.Владелец));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Банк");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Счет.Банк.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВалютаДенежныхСредств");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Счет.ВалютаДенежныхСредств));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Код");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Код));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Наименование");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.Наименование));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("НомерСчета");
		ЗаписьХМL.ЗаписатьТекст(Строка(Счет.НомерСчета));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("ВидСчета");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(Счет.ВидСчета));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		//	КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выгружает контактную информацию выбранных контрагентов в xml-файл
Процедура ВыгрузитьКИИзБП(ЗаписьХМL,Владелец)
	
	// Записываем договора контрагентов
	КИ = Открыть.РегистрыСведений.КонтактнаяИнформация.Выбрать(Новый Структура("Объект",Владелец.Ссылка));
	
	Пока КИ.Следующий() Цикл
		
		
		ЗаписьХМL.ЗаписатьНачалоЭлемента("КонтактнаяИнформацияКонтрагента");
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Владелец");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Объект));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Вид");
		ЗаписьХМL.ЗаписатьТекст(Строка(Открыть.String.Вид));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле1");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле1));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле2");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле2));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле3");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле3));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле4");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле4));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле5");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле5));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле6");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле6));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле7");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле7));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле8");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле8));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле9");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле9));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Поле10");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Поле10));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Представление");
		ЗаписьХМL.ЗаписатьТекст(Строка(КИ.Представление));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL.ЗаписатьНачалоАтрибута("Тип");
		ЗаписьХМL.ЗаписатьТекст(Открыть.String(КИ.Тип));
		ЗаписьХМL.ЗаписатьКонецАтрибута();
		
		ЗаписьХМL. ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;
	
КонецПроцедуры

