
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка = ПараметрыСеанса.ТекущийПользователь Тогда
		КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
		глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", Новый Соответствие, Истина);
	КонецЕсли;
	
КонецПроцедуры
