Перем Параметры Экспорт;	// хранит дополнительные параметры

// Восстанавливает сохраненный ранее макет
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ, содержащий последний сохраненный вариант.
//
Функция ВосстановитьМакет() Экспорт
	
	ТабличныйДокумент = МакетШаблона.Получить();
	Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		Возврат ТабличныйДокумент;
	Иначе
		Возврат Новый ТабличныйДокумент;
	КонецЕсли; 
	
КонецФункции 

// Сохраняет макет
Процедура СохранитьМакет(ТабличныйДокумент) Экспорт
	
	НовыйТабДок = Новый ТабличныйДокумент();
	НовыйТабДок.ВставитьОбласть(ТабличныйДокумент.Область(), НовыйТабДок.Область(), , Ложь);
	МакетШаблона = Новый ХранилищеЗначения(НовыйТабДок, Новый СжатиеДанных());
	
КонецПроцедуры

// Восстанавливает сохраненный ранее текст кода основной программы
Функция ВосстановитьТекстПрограммы() Экспорт
	
	Текст = ТекстПрограммы.Получить();
	Возврат ?(ТипЗнч(Текст) = Тип("Строка"),Текст,"");
	
КонецФункции 

Функция СохранитьТекстПрограммы(Документ_ТекстПрограммы) Экспорт
	
	Текст = Документ_ТекстПрограммы.ПолучитьТекст();
	ТекстПрограммы = Новый ХранилищеЗначения(Текст, Новый СжатиеДанных());
	Возврат Не ПустаяСтрока(Текст);
	
КонецФункции

// печать текущего объекта 
Процедура Печать(ДокументОбъект, ПП_КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	ТекстП = ВосстановитьТекстПрограммы();
	Макет = ВосстановитьМакет();
	ТабДок = Новый ТабличныйДокумент;
	// Получить экземпляр документа на печать
    Выполнить(ТекстП);
	// проверим высоты и напечатаем
	Если ТабДок.ВысотаТаблицы > 0 Тогда
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, ПП_КоличествоЭкземпляров, НаПринтер);		
	КонецЕсли;
	
КонецПроцедуры //Печать

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоГруппа Тогда
		ОбновитьПараметрыМакета();
		ОбновитьОбъемКода();
	КонецЕсли;
	уб_СС.ОтметитьФактМодификации(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбновитьОбъемКода() Экспорт
	
	Текст = ТекстПрограммы.Получить();
	RegExp = Новый COMОбъект("VBScript.RegExp");
	//Удалаяем комменты
	RegExp.MultiLine = Истина;
	RegExp.Global = Истина;
	RegExp.Pattern = "//(.*?)$";
	Текст = RegExp.Replace(Текст,"");
	//Удаляем пустые строки (не содержащие значащих символов)
	RegExp.Pattern = "^\s*[\r\n]+";
	Текст = RegExp.Replace(Текст,"");
	//Подсчитываем количество значимых строк кода
	RegExp.Pattern = "^[ \t]*[^\s]+?.*?$";
	Рез = RegExp.Execute(Текст);
	КоличествоСтрокКода = Рез.Count;
	//Подсчитываем количество значимых символов
	RegExp.MultiLine = Ложь;
	RegExp.Global = Ложь;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = "\s+";
	КоличествоСимволовКода = СтрДлина(RegExp.Replace(Текст,"$1"));	
	RegExp = Null;
	
КонецПроцедуры

Процедура СтандартнаяСортировка(Табл) Экспорт
	
	Табл.Сортировать("НетВМакете УБЫВ,ПорядокОбласти,Порядок,Область,Параметр");
	
КонецПроцедуры

Функция ОбластьЕстьВМакете(ТабДок = Неопределено, Знач Область, ВозвращаемаяОбласть = Неопределено) Экспорт
	
	мПризнакНеименованнойОбласти = уб_ПФ.кПризнакНеименованнойОбласти();
	Если ТабДок = Неопределено Тогда    
		ТабДок = ВосстановитьМакет();
	КонецЕсли;	
	Если Область = мПризнакНеименованнойОбласти Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Обл из ТабДок.Области Цикл 
		Если Обл.Имя = Область Тогда
			ВозвращаемаяОбласть = Обл;
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

Процедура ОбновитьПараметрыМакета(ТабДок = Неопределено, Принудительно = Ложь) Экспорт
	
	мПризнакНеименованнойОбласти = уб_ПФ.кПризнакНеименованнойОбласти();
	мПризнакСвободногоКода =  уб_ПФ.кПризнакСвободногоКода();
	Если ТабДок = Неопределено Тогда
		ТабДок = ВосстановитьМакет();
	КонецЕсли;
	ТЗПараметров = уб_ПФ.ПолучитьСписокПараметровТабличногоДокумента(ТабДок);
	хСтрока = "";
	Для Каждого Стр ИЗ ТЗПараметров Цикл
		хСтрока	= хСтрока + Стр.ИД + Стр.ИмяООЯ;	
	КонецЦикла;
	MD5ХЭШ = ОбщегоНазначения.MD5Хэш(хСтрока);
	Если MD5ХЭШ <> Неопределено И Не Принудительно И MD5хэшПараметровМакета = MD5ХЭШ Тогда
		Возврат;	
	КонецЕсли;	
	ТЗПараметров.Колонки.Добавить("КодЗаполнения", 		ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0));
	ТЗПараметров.Колонки.Добавить("ЕстьКодЗаполнения", 	Новый ОписаниеТипов("Булево"));
	ТЗПараметров.Колонки.Добавить("НетВМакете", 		Новый ОписаниеТипов("Булево"));	
	//Переносим частный код для параметров. 
	//Если в новом макете нет параметра, для которого указан частный код, 
	//ставим для него пометку "НетВМакете"
	Для Каждого Стр из ПараметрыМакета Цикл
		Если НЕ ЗначениеЗаполнено(Стр.КодЗаполнения) Тогда 
			Продолжить;	
		КонецЕсли;		
		//Ищем по ИД
		НС = ТЗПараметров.Найти(Стр.ИД,"ИД");
		Если НС = Неопределено Тогда
			//Выясняем, есть ли в макете указанная область			
			ОбластьМакета = Неопределено;
			Если Стр.Область = мПризнакНеименованнойОбласти Тогда
				бНетОбласти = Ложь; 
				чТипОбласти = 1; 
				чПорядокОбласти = чТипОбласти * 1000000; 
			ИначеЕсли ОбластьЕстьВМакете(ТабДок, Стр.Область, ОбластьМакета) Тогда
				бНетОбласти = Ложь; 
				чТипОбласти = уб_ПФ.ПолучитьЧисловойТипОбласти(ОбластьМакета.ТипОбласти); 
				чПорядокОбласти = чТипОбласти * 1000000 + ОбластьМакета.Верх * 1000 + ОбластьМакета.Лево; 
			Иначе
				бНетОбласти = Истина; 
				чТипОбласти = 0;
				чПорядокОбласти = 0;
			КонецЕсли;			
			НС = ТЗПараметров.Вставить(0);
			НС.ТипОбласти 			= чТипОбласти;
			НС.Область 				= Стр.Область;
			НС.Параметр 			= Стр.Параметр;
			НС.ИмяООЯ 				= Неопределено;
			НС.Строка 				= Неопределено;
			НС.Колонка 				= Неопределено;
			НС.СтрокаВОбласти 		= Неопределено;
			НС.КолонкаВОбласти 		= Неопределено;
			НС.АдресЯчейкиВОбласти 	= Неопределено;
			НС.Тип 					= Неопределено;
			НС.Порядок 				= 0;
			НС.ПорядокОбласти 		= чПорядокОбласти;
			НС.ИД 					= Стр.Область + "@" + Стр.Параметр;
			НС.Количество 			= 0;
			НС.КодЗаполнения 		= Стр.КодЗаполнения;
			НС.ЕстьКодЗаполнения 	= Истина;
			// Имя параметра свободного кода области: мПризнакСвободногоКода
			НС.НетВМакете 			= ((Стр.Параметр <> мПризнакСвободногоКода) ИЛИ бНетОбласти);
		Иначе 
			НС.КодЗаполнения 		= Стр.КодЗаполнения;
			НС.ЕстьКодЗаполнения 	= Истина;
		КонецЕсли;
	КонецЦикла;
	СтандартнаяСортировка(ТЗПараметров);
	ПараметрыМакета.Загрузить(ТЗПараметров);
	Если MD5ХЭШ <> Неопределено Тогда
		MD5хэшПараметровМакета = MD5ХЭШ
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	#Если Клиент Тогда
	Оповестить("ПриЗаписиПечатныеФормы");
	#КонецЕсли
	
КонецПроцедуры
