Перем мТолькоУдалятьДвиженияПриЗаписи;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция БылиДвиженияБСО()

	ЕстьДвижения = Ложь;
	Для Каждого СтрокаТЧ Из БСО Цикл
		
		Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО) Тогда 
			
			ТЗ = уб_СтраховойБрокер.СформироватьСписокНомеровБСО(СтрокаТЧ);
			МассивНомеровБСО = ТЗ.ВыгрузитьКолонку("НомерБСО");
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	Д.НомерБСО
			               |ИЗ
			               |	РегистрСведений.уб_ДвиженияБСО КАК Д
			               |ГДЕ
			               |	Д.Регистратор.МоментВремени > &МВ
			               |	И Д.Поставщик = &Поставщик
			               |	И Д.ВидБСО = &ВидБСО
			               |	И Д.НомерБСО В(&МассивНомеровБСО)
			               |	И Д.Подтверждено
						   //|	И Д.ДокПроведен
						   |	И Д.Активность
						   |";
			
			Запрос.УстановитьПараметр("МВ", МоментВремени());
			Запрос.УстановитьПараметр("Поставщик", Поставщик);
			Запрос.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
			Запрос.УстановитьПараметр("МассивНомеровБСО", МассивНомеровБСО);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			ЕстьДвижения = НЕ Результат.Пустой();
			Если ЕстьДвижения Тогда
				Прервать;
			КонецЕсли;
			
		ИначеЕсли уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда
			// количественный учет проверять не будем, это не так важно
		КонецЕсли;

	КонецЦикла;
	
	Возврат ЕстьДвижения;
	
КонецФункции

// Проверяет правильность заполнения строк табличной части.
//
// Параметры: 
//  Отказ		- флаг отказа в проведении.
//  Заголовок	- строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	Для Каждого СтрокаТЧ Из БСО Цикл
		Если СтрокаТЧ.КоличествоБСО < 1 Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) + ": ";
			СтрокаСообщения = "Количество номеров БСО равно 0";
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		Если уб_СЛ.НомерПолисаЗаполняетсяПриПоступлении(СтрокаТЧ.ВидБСО) Тогда
			Если СтрокаТЧ.КоличествоБСО <> СтрокаТЧ.КоличествоПолисов Тогда
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) + ": ";
				СтрокаСообщения = "Количество номеров БСО не совпадает с количеством номеров полисов";
				ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОбязательныхПолей = Новый Структура("ВидБСО, КоличествоБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиБСО()

// Формируем движения по регистрам.
//
Процедура ДвиженияПоРегистрам(Отказ, Заголовок);
	
	Движения.уб_ДвиженияБСО.Очистить();
	Движения.уб_ОстаткиБСО.Очистить();	
	ГраницаДокумента = Новый Граница(МоментВремени(),ВидГраницы.Исключая);
	ЗапросПроверки = Новый Запрос;
	ЗапросПроверки.УстановитьПараметр("Дата", Дата);
	ЗапросПроверки.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.Регистратор КАК ПоступлениеБСО
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|	Д.СК = &СК
	|	И Д.ВидБСО = &ВидБСО
	|	И Д.НомерБСО = &НомерБСО
	|	И Д.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО
	|	И Д.Период < &Дата";						   
	ЗапросПроверки2 = Новый Запрос;
	ЗапросПроверки2.УстановитьПараметр("Дата", Дата);
	ЗапросПроверки2.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.Регистратор
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|ГДЕ
	|	Д.СК = &СК
	|	И Д.ВидБСО = &ВидБСО
	|	И Д.НомерБСО = &НомерБСО
	|	И (Д.Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО
	|			ИЛИ Д.Регистратор ССЫЛКА Документ.уб_ПередачаБСОПоставщику
	|			ИЛИ Д.Регистратор ССЫЛКА Документ.уб_СписаниеБСО)
	|	И Д.Период < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Д.Период УБЫВ";
	Для Каждого СтрокаТЧ Из БСО Цикл
		Если уб_СЛ.ОпределитьВедетсяНомернойУчет(СтрокаТЧ.ВидБСО) 
			И НЕ ЗначениеНеЗаполнено(СокрЛП(СтрокаТЧ.НачНомерБСО)) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО НОМЕРНОГО УЧЕТА
			сНачНомерБСО 	= СтрокаТЧ.НачНомерБСО;
			сКонНомерБСО 	= СтрокаТЧ.КонНомерБСО;
			сНачНомерСП 	= СтрокаТЧ.НачНомерПолиса;
			сКонНомерСП 	= СтрокаТЧ.КонНомерПолиса;
			КолличествоБСО 	= СтрокаТЧ.КоличествоБСО;
			КолличествоСП 	= СтрокаТЧ.КоличествоПолисов;
			чНомерБСО 		= Число2(сНачНомерБСО);
			чНомерСП 		= Число2(сНачНомерСП);
			МаксДлинаНомераБСО  = Макс(СтрДлина(сНачНомерБСО),СтрДлина(сКонНомерБСО));
			МаксДлинаНомераСП  	= Макс(СтрДлина(сНачНомерСП),СтрДлина(сКонНомерСП));
			Если КолличествоСП > 1 И Число2(сНачНомерСП) > Число2(сКонНомерСП) Тогда
				Дельта = -1; //Обратная нумерация полисов
			Иначе	 
				Дельта = 1; //Прямая нумерация полисов
			КонецЕсли;
			ЗапросПроверки.УстановитьПараметр("СК", СтрокаТЧ.СК);
			ЗапросПроверки.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
			Для N = 0 По КолличествоБСО - 1 Цикл
				сНомерБСО = Формат(чНомерБСО,"ЧГ=");
				сНомерСП = Формат(чНомерСП,"ЧГ=");
				уб_СтраховойБрокер.ДобавитьНулиСлева(сНомерБСО, МаксДлинаНомераБСО);
				уб_СтраховойБрокер.ДобавитьНулиСлева(сНомерСП, МаксДлинаНомераСП);
				СерияБСО = СокрЛП(СтрокаТЧ.СерияБСО);
				СерияСП = СокрЛП(СтрокаТЧ.СерияПолиса);
				СуффиксСП = СокрЛП(СтрокаТЧ.СуффиксПолиса);
				ПолныйНомерБСО = СерияБСО + сНомерБСО;
				Если НЕ ПараметрыСеанса.уб_Константы.ОтключитьПроверкуПоступленияНомера = Истина Тогда
					ЗапросПроверки.УстановитьПараметр("НомерБСО", ПолныйНомерБСО);
					Выборка = ЗапросПроверки.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ЗапросПроверки2.УстановитьПараметр("СК", СтрокаТЧ.СК);
						ЗапросПроверки2.УстановитьПараметр("ВидБСО", СтрокаТЧ.ВидБСО);
						ЗапросПроверки2.УстановитьПараметр("НомерБСО", ПолныйНомерБСО);
						Выборка2 = ЗапросПроверки2.Выполнить().Выбрать();
						Если Выборка2.Следующий() Тогда
							Если ТипЗнч(Выборка2.Регистратор) = Тип("ДокументСсылка.уб_ПоступлениеБСО") Тогда
								Отказ = Истина;
							КонецЕсли;
						Иначе
							Отказ = Истина;
						КонецЕсли;
						Если Отказ Тогда
							Сообщить("БСО № '" + ПолныйНомерБСО + "' Вида '" + Строка(СтрокаТЧ.ВидБСО) + "' уже поступало документом " + Строка(Выборка.ПоступлениеБСО));
							Возврат;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ДвижениеБСО = Движения.уб_ДвиженияБСО.Добавить();
				ДвижениеБСО.Период 				= Дата;
				ДвижениеБСО.СК 					= СтрокаТЧ.СК;
				ДвижениеБСО.ВидБСО				= СтрокаТЧ.ВидБСО;
				ДвижениеБСО.НомерБСО 			= ПолныйНомерБСО;
				ДвижениеБСО.Поставщик			= Поставщик;
				ДвижениеБСО.ОрганизацияАгент	= ОрганизацияАгент;
				ДвижениеБСО.Подтверждено    	= Истина;
				//ДвижениеБСО.ДокПроведен 		= Ссылка.Проведен;
				ДвижениеБСО.Активность			= Ссылка.Проведен;
				ДвижениеБСО.Агент				= Агент;
				ДвижениеБСО.ПоложениеБСО		= Перечисления.уб_ПоложенияБСО.ПолученИзСК;
				ДвижениеБСО.СостояниеБСО		= Перечисления.уб_СостоянияБСО.ПустойБланк;
				Если КолличествоСП > 0 Тогда
					ДвижениеБСО.НомерПолиса		= СерияСП + сНомерСП + СуффиксСП;
					ДвижениеБСО.ГодПолиса		= СтрокаТЧ.ГодПолиса;
				КонецЕсли;
				ДвижениеБСО.КодОперации			= Перечисления.уб_КодыОперацийБСО.ПоступлениеБСО;
				Если Дата > Дата(2018,7,1) или Актуальное = Истина Тогда
					ДвижениеБСО.Актуальная = Истина;
				КонецЕсли;	
				чНомерБСО = чНомерБСО + 1;
				чНомерСП = чНомерСП + Дельта;
			КонецЦикла;
		ИначеЕсли Ссылка.Проведен И уб_СЛ.ОпределитьВедетсяКоличественныйУчет(СтрокаТЧ.ВидБСО) Тогда
			// ДВИЖЕНИЯ ДЛЯ БСО КОЛИЧЕСТВЕННОГО УЧЕТА
			//  увеличиваем количество, куда перемещается
			Движение = Движения.уб_ОстаткиБСО.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период 			= Дата;
			Движение.Поставщик			= Поставщик;
			Движение.ОрганизацияАгент 	= ОрганизацияАгент;
			Движение.СК 				= СтрокаТЧ.СК;
			Движение.ВидБСО				= СтрокаТЧ.ВидБСО;
			Движение.Агент				= Агент;
			Движение.Количество			= СтрокаТЧ.КоличествоБСО;
			Движение.КодОперации		= Перечисления.уб_КодыОперацийБСО.ПоступлениеБСО;
			Движение.СостояниеБСО		= Перечисления.уб_СостоянияБСО.ПустойБланк;
		КонецЕсли;
	КонецЦикла;
	Движения.уб_ДвиженияБСО.Записать();
	Движения.уб_ОстаткиБСО.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, Режим)
	 
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент, Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	мТолькоУдалятьДвиженияПриЗаписи = Истина;	
	Если БылиДвиженияБСО() Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если Вопрос("Найдены движения БСО. Все равно отменить проведение?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Найдены движения БСО. Получено разрешение пользователя на отмену проведения!",
				"Сообщить", 
				Истина,
				УровеньЖурналаРегистрации.Информация,
				Ссылка.Метаданные(),
				Ссылка);
			Иначе
				Отказ = Истина;
			КонецЕсли;
		#ИначеЕсли Сервер ИЛИ ВнешнееСоединение Тогда
			Отказ = Истина;
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Найдены движения БСО. Запрещено.",
				"Сообщить", 
				Истина,
				УровеньЖурналаРегистрации.Информация,
				Ссылка.Метаданные(),
				Ссылка);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент, Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	// Движения по документу
	Если Не Отказ И Не Проведен И НЕ мТолькоУдалятьДвиженияПриЗаписи Тогда
		Отказ2 = 0;
		ДвиженияПоРегистрам(Отказ2, Заголовок);
	ИначеЕсли мТолькоУдалятьДвиженияПриЗаписи Тогда
		Движения.уб_ДвиженияБСО.Очистить();
		Движения.уб_ОстаткиБСО.Очистить();
		мТолькоУдалятьДвиженияПриЗаписи = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры

Функция Число2(Стр)
	
	Возврат Число(?(Стр="","0",Стр))
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПравкаПоступленияБСО = уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("ПравкаПоступленияБСО",Ложь) или уб_кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ");
	Если Не ПравкаПоступленияБСО = Истина тогда
		Сообщить("Вам запрещена правка документа ""Поступление БСО""");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

мТолькоУдалятьДвиженияПриЗаписи = Ложь;