Перем ПараметрыОбмена Экспорт;

Процедура ВыполнитьОбмен() Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	//ЗагрузитьИз1СДеньги();
	ЗагрузитьИз1СДеньгиЧерезHTTP();
КонецПроцедуры


Процедура ИнициализироватьПараметры() Экспорт 
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("ИмяСоединения","Деньги");
КонецПроцедуры	

Процедура ЗагрузитьИз1СДеньгиЧерезHTTP()
	
	ОбработкаВыгрузки = Обработки.ВыгрузкаДанныхВоВнешнююСистему.Создать();
	
	//Параметры подклчения
	ОбработкаВыгрузки.Инициализировать();
	
	МассивОбъектов = Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов) 
		И ТипЗнч(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов)=Тип("Число") Тогда
		Период0 = ТекущаяДата()-(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов*3600*24);
	Иначе
		Период0 = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);	
	Конецесли;
	Период = Период0 - 7*3600*24; 
	МассивОбъектов.Добавить(Новый Структура("Выгрузка,Приходы,Расход,Дата",Истина,Истина,Истина,XMLСтрока(Период0)));
	Строкаjson = ОбработкаВыгрузки.ЗаписьJSON(МассивОбъектов);
	ответ =  ОбработкаВыгрузки.ОтправитьСтрокой(Строкаjson);
	Запрос = Неопределено;
	Для каждого Элемент из ответ.Обработанные Цикл
		Если ТипЗнч(Элемент) = Тип("Массив") Тогда
			Для каждого Элемент2 из Элемент Цикл
				Если ТипЗнч(Элемент2) = Тип("Массив") Тогда
					
					КэшОрганизации = Новый Соответствие;
					уб_ВалютаРегламентированногоУчета = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
					
					Для каждого Выборка из Элемент2 Цикл
						Если Выборка.Запрос = 1 Тогда
						ИНН = Выборка.ИНН;								  
						Организация = Выборка.Организация;
						Если ИНН = "" Или Организация = "" Тогда
							Продолжить;
						КонецЕсли;	
						ОрганизацияАгент = КэшОрганизации.Получить(Организация);
						Если ОрганизацияАгент = Неопределено Тогда
							ПозСкобки = Найти(Организация,"(");
							Если ПозСкобки>0 Тогда
								Организация = Лев(Организация,ПозСкобки-1);
							КонецЕсли;	
							ЗапросОрг = Новый Запрос("ВЫБРАТЬ
							|	Организации.Ссылка
							|ИЗ
							|	Справочник.Организации КАК Организации
							|ГДЕ
							|	Организации.Наименование ПОДОБНО &Наименование
							|	ИЛИ Организации.НаименованиеПолное ПОДОБНО &Наименование
							|   ИЛИ Организации.НаименованиеДляДоговоровИПлатежныхДокументов ПОДОБНО &Наименование");
							ЗапросОрг.УстановитьПараметр("Наименование","%"+СокрЛП(Организация)+"%");
							ВыборкаОрг = ЗапросОрг.Выполнить().Выбрать();
							Если ВыборкаОрг.Следующий() Тогда
								ОрганизацияАгент = ВыборкаОрг.Ссылка;
							Иначе	
								ОрганизацияАгент = Справочники.Организации.ПустаяСсылка();
							КонецЕсли;	
							Если ОрганизацияАгент.Пустая() Тогда
								уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найдена организация по наименованию: " + Организация, "Сообщить", Истина);
								Продолжить;
							КонецЕсли;	
							КэшОрганизации.Вставить(Организация,ОрганизацияАгент);
						КонецЕсли;		
						Поставщик = уб_СЛ.ПоставщикПоИНН(Выборка.ИНН, ОрганизацияАгент);
						Если Поставщик = Справочники.Контрагенты.ПустаяСК Тогда
							уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найден контрагент " + Выборка.Поставщик + "/" + Выборка.ИНН + " для " + ОрганизацияАгент, "Сообщить", Истина);
							Продолжить; //??? Или создавать?
						КонецЕсли;	
						РезультатПоиска = НайтиПлатеж(Период,ДатаИзСтроки(Выборка.Дата),_Число(Выборка.Сумма),Перечисления.уб_ВидОперацииВзаиморасчетов[?(Выборка.Операция="Приход","ПоступлениеКВОтПоставщика","ПеречислениеПоставщику")],Поставщик,Запрос,Выборка.Комментарий,Выборка.НомерВходящегоДокумента);
						Если НЕ РезультатПоиска = Неопределено Тогда
							#Если Клиент Тогда
								//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
								Сообщить("Уже есть документ " + РезультатПоиска.Ссылка);
							#КонецЕсли 
						Иначе	
							Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
							Об.Дата            = ДатаИзСтроки(Выборка.Дата);
							Об.Контрагент      = Поставщик;
							Об.Поставщик       = Поставщик;
							Об.ПоставщикСтрока = Выборка.Поставщик; 
							Об.ОрганизацияАгент= ОрганизацияАгент;
							//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
							Об.ВалютаДокумента = уб_ВалютаРегламентированногоУчета;
							Об.ФормаОплаты     = ?(Выборка.ТипСчета="Банковский счет",Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
							Об.СуммаДокумента  = _Число(Выборка.Сумма);
							//.Ответственный   = ;           
							Об.ДокументБух     			= Выборка.Операция + " от " + Об.Дата;
							#Если Клиент Тогда
								//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
								Сообщить("Создаем документ " + Об.ДокументБух);
							#КонецЕсли 
							Об.Комментарий     = Выборка.Комментарий;
							Об.НомерВходящегоДокумента = Выборка.НомерВходящегоДокумента;
							Об.ДатаВходящегоДокумента  = Выборка.ДатаВходящегоДокумента;
							Об.НаправлениеРасчетов     = ?(Выборка.Операция="Расход",Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику,Перечисления.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика);
							Попытка
								Об.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + _Число(Выборка.Сумма) + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), "Сообщить", Истина);
							КонецПопытки;	
						КонецЕсли;
					ИначеЕсли Выборка.Запрос = 2 Тогда
						РезультатПоиска = НайтиПлатеж(Период,ДатаИзСтроки(Выборка.Дата),_Число(Выборка.Сумма),Перечисления.уб_ВидОперацииВзаиморасчетов[?(Выборка.Операция="Приход","БрокеруПоБезналу","ОтБрокераПоБезналу")],,Запрос,Выборка.Комментарий);
						Если НЕ РезультатПоиска = Неопределено Тогда
							#Если Клиент Тогда
								//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
								Сообщить("Уже есть документ "+РезультатПоиска.Ссылка);
							#КонецЕсли 
						Иначе	
							Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
							Об.Дата            = ДатаИзСтроки(Выборка.Дата);
							Об.ПоставщикСтрока = Выборка.Клиент; 
							Поставщик = ПолучитьСтрахователя(Выборка.Клиент);
							Об.Контрагент      = Поставщик;
							Об.Поставщик       = Поставщик;
							//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
							Об.ВалютаДокумента = уб_ВалютаРегламентированногоУчета;
							Об.ФормаОплаты     = Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;//?(Выборка.ТипСчета="Банковский счет",Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
							Об.СуммаДокумента  = _Число(Выборка.Сумма);
							Об.ДокументБух     			= Выборка.Операция + " от " + Об.Дата;
							#Если Клиент Тогда
								//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
								Сообщить("Создаем документ " + Об.ДокументБух);
							#КонецЕсли 
							Об.Комментарий     = Выборка.Комментарий;
							Об.НомерВходящегоДокумента = Выборка.НомерВходящегоДокумента;
							Об.ДатаВходящегоДокумента  = Выборка.ДатаВходящегоДокумента;
							Об.НаправлениеРасчетов     = ?(Выборка.Операция="Расход",Перечисления.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу,Перечисления.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу);
							Попытка
								Об.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + _Число(Выборка.Сумма) + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), "Сообщить", Истина);
							КонецПопытки;	
						КонецЕсли;
						ИначеЕсли Выборка.Запрос = 3 Тогда
							РезультатПоиска = НайтиПлатеж(Период,ДатаИзСтроки(Выборка.Дата),_Число(Выборка.Сумма),Перечисления.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту,,Запрос,Выборка.Комментарий);
							Если НЕ РезультатПоиска = Неопределено Тогда
								
								#Если Клиент Тогда
									//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
									Сообщить("Уже есть документ " + РезультатПоиска.Ссылка);
								#КонецЕсли 
							Иначе	
																//Поставщик = ПолучитьСтрахователя(Выборка.Комментарий);
								Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
								Об.Дата            			= ДатаИзСтроки(Выборка.Дата);
								Об.ПоставщикСтрока 			= Выборка.Комментарий; 
								Об.ВалютаДокумента 			= уб_ВалютаРегламентированногоУчета;
								//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
								Об.ФормаОплаты     			= ?(Выборка.ТипСчета = "Банковский счет", Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично, Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
								Об.СуммаДокумента  			= _Число(Выборка.Сумма);      
								Об.ДокументБух     			= Выборка.Операция + " от " + Об.Дата;
								#Если Клиент Тогда
									//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
									Сообщить("Создаем документ " + Об.ДокументБух);
								#КонецЕсли 
								Об.Комментарий     			= Выборка.Комментарий;
								Об.НомерВходящегоДокумента 	= Выборка.НомерВходящегоДокумента;
								Об.ДатаВходящегоДокумента  	= Выборка.ДатаВходящегоДокумента;
								Об.НаправлениеРасчетов     	= Перечисления.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту;
								Попытка
									Об.Записать(РежимЗаписиДокумента.Проведение);
								Исключение
									уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + _Число(Выборка.Сумма) + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), , Истина, , , );
								КонецПопытки;	
							КонецЕсли;	
						КонецЕсли;

					КонецЦикла;
					
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	ОбработкаВыгрузки = Неопределено;
КонецПроцедуры

Функция _Число(Число)
	Если ТипЗнч(Число) = Тип("Число") Тогда
		Возврат Число;
	Иначе	
		Если Число = "" Тогда
			Возврат  0;
		КонецЕсли;	
		_Число = СтрЗаменить(Число," ","");
		_Число = СтрЗаменить(_Число,Символы.ПС,"");
		
		Возврат число(_Число);
		
	КонецЕсли;
КонецФункции	

Функция ДатаИзСтроки(_СтрокаДаты)
	Если ТипЗнч(_СтрокаДаты) = тип("Дата") тогда
		Возврат  _СтрокаДаты
	КонецЕсли;	
	СтрокаДаты = ""+_СтрокаДаты;
	СтрокаДаты = СтрЗаменить(СтрокаДаты,"T","");
	СтрокаДаты = СтрЗаменить(СтрокаДаты,"-","");
	СтрокаДаты = СтрЗаменить(СтрокаДаты,":","");
	Попытка
		Возврат Дата(СтрокаДаты);
	Исключение
		Возврат Дата(1,1,1);
		//Ответ = Ответ+
		//"Ключ "+ТекИмя+"."+ИмяТЧ+"."+КлючТЧ+" отсутствует"+
		//Символы.ПС;
		//Сообщить();
	КонецПопытки;

	
КонецФункции	

Функция НайтиПлатеж(Дата0,Дата,Сумма,Направление,Контрагент = Неопределено,Запрос = Неопределено,Комментарий,НомерВходящегоДокумента="")
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	Платеж.Ссылка КАК Ссылка,
		               |	Платеж.НаправлениеРасчетов КАК НаправлениеРасчетов,
		               |	Платеж.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		               |	Платеж.Дата КАК Дата,
		               |	Платеж.СуммаДокумента КАК СуммаДокумента,
		               |	Платеж.Поставщик КАК Поставщик,
		               |	Платеж.ОрганизацияАгент КАК ОрганизацияАгент,
		               |	Платеж.Комментарий КАК Комментарий
		               |ПОМЕСТИТЬ Платежи
		               |ИЗ
		               |	Документ.уб_ВзаиморасчетСПоставщиком КАК Платеж
		               |ГДЕ
		               |	Платеж.Проведен
		               |	И Платеж.ДатаСоздания >= &Дата";
		Запрос.УстановитьПараметр("Дата",НачалоДня(Дата0));				   
		Запрос.Выполнить();
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Платеж.Ссылка,
	               |	Платеж.Дата,
	               |	Платеж.СуммаДокумента,
	               |	Платеж.Поставщик,
	               |	Платеж.ОрганизацияАгент,
	               |	Платеж.Комментарий
	               |ИЗ
	               |	Платежи КАК Платеж
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Платеж.Дата, ДЕНЬ) = &Дата
	               |	И ВЫБОР
	               |			КОГДА Платеж.СуммаДокумента >= &СуммаДокумента
	               |				ТОГДА Платеж.СуммаДокумента - &СуммаДокумента < 0.01
	               |			ИНАЧЕ &СуммаДокумента - Платеж.СуммаДокумента < 0.01
	               |		КОНЕЦ
	               |	И Платеж.Комментарий ПОДОБНО &Комментарий
	               |	И Платеж.НаправлениеРасчетов = &НаправлениеРасчетов"+
				   ?(Контрагент = Неопределено,""," И Платеж.Поставщик = &Контрагент")+
				   ?(ПустаяСтрока(НомерВходящегоДокумента),""," И Платеж.НомерВходящегоДокумента = &НомерВходящегоДокумента");;
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("СуммаДокумента",Сумма);
	Запрос.УстановитьПараметр("НаправлениеРасчетов",Направление);
	Запрос.УстановитьПараметр("Комментарий",Комментарий);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",НомерВходящегоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено
	КонецЕсли;	
		
КонецФункции	





Процедура ЗагрузитьИз1СДеньги()
	
	Соединение = Неопределено;
	//Если НЕ уб_ОбменДанными.ПодключитьСоединение (Соединение, ПараметрыОбмена.ИмяСоединения,,"Ошибка подключения к 1С Деньги!") Тогда
	//	Возврат
	//КонецЕсли;
	СтрокаПодключения = ПараметрыОбмена.ИмяСоединения;
	Версия = уб_ОбменДанными.ПолучитьВерсиюПоИдентификатору(СтрокаПодключения);
	V8 = Новый COMОбъект(Версия + ".COMConnector");	
	ФактСтрокаПодключения = уб_ОбменДанными.ПолучитьСтрокуПодключения(СтрокаПодключения);
	Соединение = V8.Connect(ФактСтрокаПодключения);

	
	уб_ВалютаРегламентированногоУчета = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
	Запрос = Соединение.NewObject("Запрос");
	Если ЗначениеЗаполнено(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов) 
		И ТипЗнч(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов)=Тип("Число") Тогда
		Период = ТекущаяДата()-(ПараметрыСеанса.уб_Константы.ПериодПроверкиДокументов*3600*24);
	Иначе
		Период = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);	
	Конецесли;	
	Запрос.УстановитьПараметр("Дата",Период);
	Запрос.Текст =
	"ВЫБРАТЬ
	|Выбор когда Приход.Сумма<0 тогда ""Расход"" иначе ""Приход"" конец КАК Операция,
	|Приход.Ссылка.Дата КАК Дата,
	|ПРЕДСТАВЛЕНИЕ(Приход.Статья) КАК Статья,
	|Выбор когда Приход.Сумма<0 тогда -Приход.Сумма иначе Приход.Сумма конец как Сумма,
	|ПРЕДСТАВЛЕНИЕ(Поставщик.Значение) КАК Поставщик,
	|Поставщик.Значение.Комментарий КАК ИНН,
	|ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Организация.Значение), """") КАК Организация,
	|Приход.Ссылка.Комментарий,
	|Приход.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|Приход.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|ПРЕДСТАВЛЕНИЕ(Приход.Ссылка.Кошелек.ТипСчета) КАК ТипСчета,
	|Приход.Ссылка
	|ИЗ
	|Документ.Приход.ДвиженияДенег КАК Приход
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Приход.СвойстваДокументаПострочно КАК Поставщик
	| 	 ПО Приход.УИН = Поставщик.УИН
	|		И Приход.Ссылка = Поставщик.Ссылка
	|		И (Поставщик.Значение ССЫЛКА Справочник.Контакты)
	|		И (Поставщик.Значение.Родитель.Наименование = ""Поставщики"")
	|		И (Приход.Ссылка.ДатаИзменения >= &Дата)
	|		И (Приход.Ссылка.Проведен = ИСТИНА)
	|		И (Приход.Ссылка.Загружен = ЛОЖЬ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Приход.СвойстваДокументаПострочно КАК Организация
	|	ПО Приход.УИН = Организация.УИН
	|		И Приход.Ссылка = Организация.Ссылка
	|		И (Организация.СвойствоДокумента.Наименование = ""Дочерняя организация"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|Выбор когда Расход.Сумма<0 тогда ""Приход"" иначе ""Расход"" конец,
	|Расход.Ссылка.Дата,
	|ПРЕДСТАВЛЕНИЕ(Расход.Статья),
	|Выбор когда Расход.Сумма<0 тогда -Расход.Сумма иначе Расход.Сумма конец,
	|ПРЕДСТАВЛЕНИЕ(Поставщик.Значение),
	|Поставщик.Значение.Комментарий,
	|ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Организация.Значение), """"),
	|Расход.Ссылка.Комментарий,
	|Расход.Ссылка.НомерВходящегоДокумента,
	|Расход.Ссылка.ДатаВходящегоДокумента,
	|ПРЕДСТАВЛЕНИЕ(Расход.Ссылка.Кошелек.ТипСчета),
	|Расход.Ссылка
	|ИЗ
	|Документ.Расход.ДвиженияДенег КАК Расход
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Расход.СвойстваДокументаПострочно КАК Поставщик
	|	ПО Расход.УИН = Поставщик.УИН
	|		И Расход.Ссылка = Поставщик.Ссылка
	|		И (Поставщик.Значение ССЫЛКА Справочник.Контакты)
	|		И (Поставщик.Значение.Родитель.Наименование = ""Поставщики"")
	|		И (Расход.Ссылка.ДатаИзменения >= &Дата)
	|		И (Расход.Ссылка.Проведен = ИСТИНА)
	|		И (Расход.Ссылка.Загружен = ЛОЖЬ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Расход.СвойстваДокументаПострочно КАК Организация
	|	ПО Расход.УИН = Организация.УИН
	|		И Расход.Ссылка = Организация.Ссылка
	|		И (Организация.СвойствоДокумента.Наименование = ""Дочерняя организация"")";
	Выборка = Запрос.Выполнить().Выбрать();
	//
	КэшОрганизации = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ИНН = Выборка.ИНН;								  
		Организация = Выборка.Организация;
		Если ИНН = "" Или Организация = "" Тогда
			Продолжить;
		КонецЕсли;	
		ОрганизацияАгент = КэшОрганизации.Получить(Организация);
		Если ОрганизацияАгент = Неопределено Тогда
			ПозСкобки = Найти(Организация,"(");
			Если ПозСкобки>0 Тогда
				Организация = Лев(Организация,ПозСкобки-1);
			КонецЕсли;	
			ЗапросОрг = Новый Запрос("ВЫБРАТЬ
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Наименование ПОДОБНО &Наименование
			|	ИЛИ Организации.НаименованиеПолное ПОДОБНО &Наименование
			|   ИЛИ Организации.НаименованиеДляДоговоровИПлатежныхДокументов ПОДОБНО &Наименование");
			ЗапросОрг.УстановитьПараметр("Наименование","%"+СокрЛП(Организация)+"%");
			ВыборкаОрг = ЗапросОрг.Выполнить().Выбрать();
			Если ВыборкаОрг.Следующий() Тогда
				ОрганизацияАгент = ВыборкаОрг.Ссылка;
			Иначе	
				ОрганизацияАгент = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;	
			Если ОрганизацияАгент.Пустая() Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найдена организация по наименованию: " + Организация, "Сообщить", Истина);
				Продолжить;
			КонецЕсли;	
			КэшОрганизации.Вставить(Организация,ОрганизацияАгент);
		КонецЕсли;		
		Поставщик = уб_СЛ.ПоставщикПоИНН(Выборка.ИНН, ОрганизацияАгент);
		Если Поставщик = Справочники.Контрагенты.ПустаяСК Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найден контрагент " + Выборка.Поставщик + "/" + Выборка.ИНН + " для " + ОрганизацияАгент, "Сообщить", Истина);
			Продолжить; //??? Или создавать?
		КонецЕсли;	
		РезультатПоиска = НайтиПлатеж0(Выборка.Дата,Выборка.Сумма,Перечисления.уб_ВидОперацииВзаиморасчетов[?(Выборка.Операция="Приход","ПоступлениеКВОтПоставщика","ПеречислениеПоставщику")],Поставщик,,Выборка.Комментарий,Выборка.НомерВходящегоДокумента);
		Если НЕ РезультатПоиска = Неопределено Тогда
			#Если Клиент Тогда
				//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
				Сообщить("Уже есть документ " + РезультатПоиска.Ссылка);
			#КонецЕсли 
		Иначе	
			Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
			Об.Дата            = Выборка.Дата;
			Об.Контрагент      = Поставщик;
			Об.Поставщик       = Поставщик;
			Об.ПоставщикСтрока = Выборка.Поставщик; 
			Об.ОрганизацияАгент= ОрганизацияАгент;
			//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.ВалютаДокумента = уб_ВалютаРегламентированногоУчета;
			Об.ФормаОплаты     = ?(Выборка.ТипСчета="Банковский счет",Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
			Об.СуммаДокумента  = Выборка.Сумма;
			//.Ответственный   = ;           
			Об.ДокументБух     = Выборка.Операция+" от "+Выборка.Дата;
			Об.Комментарий     = Выборка.Комментарий;
			Об.НомерВходящегоДокумента = Выборка.НомерВходящегоДокумента;
			Об.ДатаВходящегоДокумента  = Выборка.ДатаВходящегоДокумента;
			Об.НаправлениеРасчетов     = ?(Выборка.Операция="Расход",Перечисления.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику,Перечисления.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика);
			Попытка
				Об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + Выборка.Сумма + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), "Сообщить", Истина);
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;		
	//Запрос по страхователям
	Запрос.Текст =
	"ВЫБРАТЬ
	|ВЫБОР
	|	КОГДА Приход.Сумма >= 0
	|		ТОГДА ""Приход""
	|	ИНАЧЕ ""Расход""
	|КОНЕЦ КАК Операция,
	|Приход.Ссылка.Дата КАК Дата,
	|ПРЕДСТАВЛЕНИЕ(Приход.Статья) КАК Статья,
	|ВЫБОР
	|	КОГДА Приход.Сумма >= 0
	|		ТОГДА Приход.Сумма
	|	ИНАЧЕ -Приход.Сумма
	|КОНЕЦ КАК Сумма,
	|Приход.Ссылка.Комментарий,
	|Приход.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|Приход.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|ПРЕДСТАВЛЕНИЕ(Приход.Ссылка.Кошелек.ТипСчета) КАК ТипСчета,
	|Приход.Ссылка,
	|Приход.Комментарий КАК Клиент
	|ИЗ
	|Документ.Приход.ДвиженияДенег КАК Приход
	|	ГДЕ
	|		Приход.Ссылка.Проведен = ИСТИНА
	|   И (Приход.Статья.Наименование = ""Продажа страховок""
	|		ИЛИ Приход.Статья.Наименование = ""Возврат премии""
	|       ИЛИ Приход.Статья.Наименование = ""Возмещение денежных средств-эквайринг"")
	|И НЕ Приход.Ссылка.Кошелек.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Наличность)
	|		И (Приход.Ссылка.ДатаИзменения >= &Дата)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| ВЫБОР
	|	КОГДА Расход.Сумма >= 0
	|		ТОГДА ""Расход""
	|	ИНАЧЕ ""Приход""
	|КОНЕЦ,
	|Расход.Ссылка.Дата,
	|ПРЕДСТАВЛЕНИЕ(Расход.Статья),
	|ВЫБОР
	|	КОГДА Расход.Сумма >= 0
	|		ТОГДА Расход.Сумма
	|	ИНАЧЕ -Расход.Сумма
	|КОНЕЦ,
	|Расход.Ссылка.Комментарий,
	|Расход.Ссылка.НомерВходящегоДокумента,
	|Расход.Ссылка.ДатаВходящегоДокумента,
	|ПРЕДСТАВЛЕНИЕ(Расход.Ссылка.Кошелек.ТипСчета),
	|Расход.Ссылка,
	|Расход.Комментарий
	|ИЗ
	|  Документ.Расход.ДвиженияДенег КАК Расход
	|ГДЕ
	|	Расход.Ссылка.Проведен = ИСТИНА И
	|	(Расход.Статья.Наименование = ""Продажа страховок""
	|		ИЛИ Расход.Статья.Наименование = ""Возврат премии"")
	|И НЕ Расход.Ссылка.Кошелек.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Наличность)
	|		И (Расход.Ссылка.ДатаИзменения >= &Дата)
	|УПОРЯДОЧИТЬ ПО
	|Дата";
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		РезультатПоиска = НайтиПлатеж0(Выборка.Дата,Выборка.Сумма,Перечисления.уб_ВидОперацииВзаиморасчетов[?(Выборка.Операция="Приход","БрокеруПоБезналу","ОтБрокераПоБезналу")],,,Выборка.Комментарий);
		Если НЕ РезультатПоиска = Неопределено Тогда
			#Если Клиент Тогда
				//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
				Сообщить("Уже есть документ "+РезультатПоиска.Ссылка);
			#КонецЕсли 
		Иначе	
			Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
			Об.Дата            = Выборка.Дата;
			Об.ПоставщикСтрока = Выборка.Клиент; 
			Поставщик = ПолучитьСтрахователя(Выборка.Клиент);
			Об.Контрагент      = Поставщик;
			Об.Поставщик       = Поставщик;
			//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.ВалютаДокумента = уб_ВалютаРегламентированногоУчета;
			Об.ФормаОплаты     = Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;//?(Выборка.ТипСчета="Банковский счет",Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично,Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
			Об.СуммаДокумента  = Выборка.Сумма;
			Об.ДокументБух     = Выборка.Операция + " от " + Выборка.Дата;
			Об.Комментарий     = Выборка.Комментарий;
			Об.НомерВходящегоДокумента = Выборка.НомерВходящегоДокумента;
			Об.ДатаВходящегоДокумента  = Выборка.ДатаВходящегоДокумента;
			Об.НаправлениеРасчетов     = ?(Выборка.Операция="Расход",Перечисления.уб_ВидОперацииВзаиморасчетов.ОтБрокераПоБезналу,Перечисления.уб_ВидОперацииВзаиморасчетов.БрокеруПоБезналу);
			Попытка
				Об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + Выборка.Сумма + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), "Сообщить", Истина);
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;	
	//Запрос по возврату скидок клиентам
	Запрос.Текст =
	"ВЫБРАТЬ
	|""Расход"" КАК Операция,
	|Приход.Ссылка.Дата КАК Дата,
	|ПРЕДСТАВЛЕНИЕ(Приход.Статья) КАК Статья,
	|ВЫБОР
	|	КОГДА Приход.Сумма >= 0
	|		ТОГДА Приход.Сумма
	|	ИНАЧЕ -Приход.Сумма
	|КОНЕЦ КАК Сумма,
	|Приход.Ссылка.Комментарий,
	|Приход.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|Приход.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|ПРЕДСТАВЛЕНИЕ(Приход.Ссылка.Кошелек.ТипСчета) КАК ТипСчета,
	|Приход.Ссылка,
	|Приход.Комментарий КАК Комментарий
	|ИЗ
	|Документ.Расход.ДвиженияДенег КАК Приход
	|	ГДЕ 
	|	Приход.Ссылка.Проведен = ИСТИНА И
	|(Приход.Статья.Наименование = ""Возврат скидки клиенту""
	|	ИЛИ Приход.Статья.Наименование = ""Возврат КВ менеджеру"")
	|		И (Приход.Ссылка.ДатаИзменения >= &Дата)";
	//
	Запрос.УстановитьПараметр("Дата",Период);
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		РезультатПоиска = НайтиПлатеж0(Выборка.Дата,Выборка.Сумма,Перечисления.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту,,,Выборка.Комментарий);
		Если НЕ РезультатПоиска = Неопределено Тогда
		
			#Если Клиент Тогда
				//Выносить в лог событий будет избыточно, либо сделать с проверкой даты создания
				Сообщить("Уже есть документ " + РезультатПоиска.Ссылка);
			#КонецЕсли 
		Иначе	
			//Поставщик = ПолучитьСтрахователя(Выборка.Комментарий);
			Об = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
			Об.Дата            			= Выборка.Дата;
			Об.ПоставщикСтрока 			= Выборка.Комментарий; 
			Об.ВалютаДокумента 			= уб_ВалютаРегламентированногоУчета;
			//Об.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Об.ФормаОплаты     			= ?(Выборка.ТипСчета = "Банковский счет", Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично, Перечисления.уб_ФормаОплатыВзаиморасчеты.Наличными);
			Об.СуммаДокумента  			= Выборка.Сумма;      
			Об.ДокументБух     			= Выборка.Операция + " от " + Выборка.Дата;
			Об.Комментарий     			= Выборка.Комментарий;
			Об.НомерВходящегоДокумента 	= Выборка.НомерВходящегоДокумента;
			Об.ДатаВходящегоДокумента  	= Выборка.ДатаВходящегоДокумента;
			Об.НаправлениеРасчетов     	= Перечисления.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту;
			Попытка
				Об.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи взаиморасчета " + Выборка.Дата + " " + Выборка.Сумма + "" + Выборка.Комментарий + "/" + ОписаниеОшибки(), , Истина, , , );
			КонецПопытки;	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры	

Функция НайтиПлатеж0(Дата,Сумма,Направление,Контрагент = Неопределено,Запрос = Неопределено,Комментарий,НомерВходящегоДокумента="")
	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Платеж.Ссылка,
	               |	Платеж.Дата,
	               |	Платеж.СуммаДокумента,
	               |	Платеж.Поставщик,
	               |	Платеж.ОрганизацияАгент,
	               |	Платеж.Комментарий
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком КАК Платеж
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Платеж.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И ВЫБОР
	               |			КОГДА Платеж.СуммаДокумента >= &СуммаДокумента
	               |				ТОГДА Платеж.СуммаДокумента - &СуммаДокумента < 0.01
	               |			ИНАЧЕ &СуммаДокумента - Платеж.СуммаДокумента < 0.01
	               |		КОНЕЦ
	               |	И Платеж.Проведен
				   |	И Платеж.Комментарий ПодобНО  &Комментарий
	               |	И Платеж.НаправлениеРасчетов = &НаправлениеРасчетов"+
				   ?(Контрагент = Неопределено,""," И Платеж.Поставщик = &Контрагент")+
				   ?(ПустаяСтрока(НомерВходящегоДокумента),""," И Платеж.НомерВходящегоДокумента = &НомерВходящегоДокумента");;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("СуммаДокумента",Сумма);
	Запрос.УстановитьПараметр("НаправлениеРасчетов",Направление);
	Запрос.УстановитьПараметр("Комментарий",Комментарий);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",НомерВходящегоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено
	КонецЕсли;	
		
КонецФункции	

Функция ПолучитьСтрахователя(Представление)
	Страхователь = Справочники.Контрагенты.ПустаяСсылка();
	Если НЕ ПустаяСтрока(Представление) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.Наименование ПОДОБНО &Наименование
		|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
		|			ИЛИ Контрагенты.НаименованиеКраткое ПОДОБНО &Наименование)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование");
		Запрос.УстановитьПараметр("Наименование","%"+СокрЛП(Представление)+"%");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Страхователь = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Страхователь;
КонецФункции	



Функция СинхронизироватьКошельки() Экспорт
	
	ОбработкаВыгрузки = Обработки.ВыгрузкаДанныхВоВнешнююСистему.Создать();
	
	//Параметры подклчения
	ОбработкаВыгрузки.Инициализировать();
	
	МассивОбъектов = Новый Массив;
	
	МассивОбъектов.Добавить(Новый Структура("Выгрузка,Кошельки",Истина,Истина));
	Строкаjson = ОбработкаВыгрузки.ЗаписьJSON(МассивОбъектов);
	ответ =  ОбработкаВыгрузки.ОтправитьСтрокой(Строкаjson);
	Запрос = Неопределено;
	Для каждого Элемент из ответ.Обработанные Цикл
		Если ТипЗнч(Элемент) = Тип("Массив") Тогда
			Для каждого Элемент2 из Элемент Цикл
				Если ТипЗнч(Элемент2) = Тип("Массив") Тогда
					
					Для каждого СтруктураКошелька из Элемент2 Цикл
						Ссылка  = СтруктураКошелька.Ссылка;
						//КошелькиИСчета_cea4b1f8_e32f_11e8_80db_001e6713e044
						УИД = Новый УникальныйИдентификатор(СтрЗаменить(Прав(СтруктураКошелька.Ссылка,36),"_","-"));
						СсылкаЗдесь = Справочники.Кошельки.ПолучитьСсылку(УИД);
						ОбъектЗдесь = СсылкаЗдесь.ПолучитьОбъект();
						Если ОбъектЗдесь = Неопределено Тогда
							Если СтруктураКошелька.Активность = ЛОЖЬ Тогда
								//Неактивные не тянем
								Продолжить
							КонецЕсли;	
							ОбъектЗдесь = Справочники.Кошельки.СоздатьЭлемент();
							ОбъектЗдесь.УстановитьСсылкуНового(СсылкаЗдесь);
						КонецЕсли;	
						
						ОбъектЗдесь.Актуальность = СтруктураКошелька.Активность;
						ОбъектЗдесь.Наименование = СтруктураКошелька.Наименование;
						ОбъектЗдесь.Записать();
					КонецЦикла;	
					
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	ОбработкаВыгрузки = Неопределено;

КонецФункции	
	

