
Процедура ДвижениеСтатусовЗаявок(Ссылка) Экспорт
	
	//пометка удаления?
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Полисы.Заявка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Полисы.Ссылка.ОтчетКассира.Проведен
	|					И Полисы.Ссылка.ОтчетКассира.Подтверждено
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Установить
	|ПОМЕСТИТЬ ВТ_Заявок
	|ИЗ
	|	Документ.уб_ПриемкаОплат.Полисы КАК Полисы
	|ГДЕ
	|	Полисы.Ссылка.ОтчетКассира = &Ссылка
	|	И НЕ Полисы.Ссылка.ПометкаУдаления
	|	И НЕ Полисы.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Полисы.Заявка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	П.Заявка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА П.ОтчетКассира.Проведен
	|					И П.ОтчетКассира.Подтверждено
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|ИЗ
	|	Документ.уб_ПриемкаОплат КАК П
	|ГДЕ
	|	П.ОтчетКассира = &Ссылка
	|	И НЕ П.ПометкаУдаления
	|	И НЕ П.Заявка = ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	П.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СЗ.Заявка,
	|	СЗ.Статус,
	|	СЗ.Заявка.Номер,
	|	ВЫБОР
	|		КОГДА ВТ_Заявок.Установить
	|			ТОГДА ""УстановитьСтатус_ДеньгиВКомпании""
	|		ИНАЧЕ ""УстановитьСтатус_КомплектИДеньгиУКассира""
	|	КОНЕЦ КАК УстСтатус
	|ИЗ
	|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявок КАК ВТ_Заявок
	|		ПО СЗ.Заявка = ВТ_Заявок.Заявка
	|ГДЕ
	|	(ВТ_Заявок.Установить
	|				И СЗ.Статус <> ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании)
	|			ИЛИ НЕ ВТ_Заявок.Установить
	|				И СЗ.Статус = ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ДеньгиВКомпании))");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//для позиционирования строк в статусах заявок
	СписокОбработанныхЗаявок = Новый СписокЗначений;
	Роль = уб_УСЗ.ПолучитьРольПользователяДляЗаявок();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		УстановитьПривилегированныйРежим(Истина);

		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Выборка.Заявка;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ДвижениеСтатусов;
		МенеджерЗаписи.Параметр   = Выборка.УстСтатус;
		МенеджерЗаписи.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		//Если уб_УСЗ.ВыполнитьДействиеПоЗаявке(
		//	Выборка.Заявка, 
		//	Выборка.Статус,
		//	Выборка.УстСтатус,
		//	,
		//	Роль,
		//	, //ТекстКоманды
		//	)
		//	Тогда
		//	СписокОбработанныхЗаявок.Добавить(Выборка.ЗаявкаНомер);
		//КонецЕсли;	
	КонецЦикла;
	//#Если Клиент Тогда
	//	Если СписокОбработанныхЗаявок.Количество() > 0 Тогда
	//		Оповестить("уб_СтатусыЗаявокОбновитьСписки", СписокОбработанныхЗаявок, "Документ.уб_ОтчетКассира")
	//	КонецЕсли;
	//#КонецЕсли
	
	Если Ссылка.Подтверждено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уб_ПриемкаОплат.Ссылка КАК Приемка,
		               |	уб_ПриемкаОплат.Дата
		               |ИЗ
		               |	Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
		               |ГДЕ
		               |	уб_ПриемкаОплат.ОтчетКассира = &ОтчетКассира
		               |	И уб_ПриемкаОплат.Дата >= &ДатаМинус30Дней";
		Запрос.УстановитьПараметр("ОтчетКассира", Ссылка);			   
		ДатаМинус30Дней = ТекущаяДата()-60*24*3600;
		Запрос.УстановитьПараметр("ДатаМинус30Дней", ДатаМинус30Дней);			   
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			УстановитьПривилегированныйРежим(Истина);
			
			МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Выборка.Приемка;
			МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.СозданиеПолисов;
			МенеджерЗаписи.Параметр   = Ссылка.Номер;
			МенеджерЗаписи.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЦикла;
	КонецЕсли;

	
	
	
КонецПроцедуры

Функция МассивОтчетовКассираПоЗаявке(Заявка) Экспорт

	Если Заявка.Пустая() Тогда
		Результат = Новый Массив;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПОП.Ссылка.ОтчетКассира КАК ОтчетКассира
		|ИЗ
		|	Документ.уб_ПриемкаОплат.Полисы КАК ПОП
		|ГДЕ
		|	ПОП.Заявка = &Заявка
		|	И НЕ ПОП.Заявка.ПометкаУдаления
		|	И НЕ ПОП.Ссылка.ПометкаУдаления
		|	И НЕ ПОП.Ссылка.ОтчетКассира.ПометкаУдаления
		|	И НЕ ПОП.Ссылка.ОтчетКассира = ЗНАЧЕНИЕ(Документ.уб_ОтчетКассира.ПустаяСсылка)");
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтчетКассира");
	КонецЕсли;
	Возврат Результат;

КонецФункции // ОтчетКассираПоЗаявке()
