
Функция ПроверкаЗаполнения()
	
	Статус = СтатусСообщения.Важное;	
	Рез = Истина;
	Если Не ЗначениеЗаполнено(Номер) Тогда 
		УстановитьНовыйНомер();
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли; 
	Если Ответственный.Пустая() Тогда 
		Если Не Проведен Тогда
			Отв_й = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
			Если Отв_й <> Неопределено Тогда
				Ответственный = Отв_й;
			КонецЕсли;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Ответственный) Тогда 
			#Если Клиент Тогда
				Сообщить("Не заполнено поле 'ОтветственныйБСО'!", Статус);
			#КонецЕсли
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	#Если Клиент Тогда
		//У сервера нет настроек/нет фин ответственного
		Если ОтветственныйФинансы.Пустая() Тогда 
			Если Не Проведен Тогда
				ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(ОтветственныйФинансы) Тогда 
				Сообщить("Не заполнено поле 'Фин. Ответственный'!",Статус);
				Рез = Ложь;
			КонецЕсли;
		КонецЕсли; 
	#КонецЕсли
	Возврат Рез;
	
КонецФункции



///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//SS TODO При проведении проверять, проведены ли квитанции.
// Если не проведены - отказ и уведомление, что надо сначала провести соответствующий страховой полис.


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПравоПроведенияОА = ПравоДоступа("Проведение", Метаданные());
	ДокументОК = ПроверкаЗаполнения();
	Отказ = Не (ДокументОК И ПравоПроведенияОА);
	#Если Клиент Тогда
		Если Отказ Тогда
			Предупреждение("Документ не проведен!")
		Иначе
			Оповестить("ПроведениеВОтчетеКассира", Ссылка, ЭтотОбъект)
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = НЕ ПравоДоступа("ОтменаПроведения", Метаданные());
	Если Не Отказ Тогда
		#Если Клиент Тогда
		Оповестить("ПроведениеВОтчетеКассира", Ссылка, ЭтотОбъект);
		#КонецЕсли
	КонецЕсли; 
	Возврат;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ,РежимЗаписи,РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	Если (Подтверждено И Ссылка.Подтверждено и Модифицированность()) и Уб_Кэшируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") = Ложь Тогда
		
		Сообщение = "Документ уже подтвержден. Изменять документ нельзя!";
		#Если Клиент Тогда
			
			Предупреждение(Сообщение, 10, "Внимание!!!");
		#Иначе
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Ссылка + "" + Символы.ПС + "Ошибка: " +Сообщение+" "+ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
		#КонецЕсли
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//Этот код задействовать, когда запись ОК, будет отвязана от приемок
	//Раз документы приняты, то ОК менять нельзя уже на следующий день, в независимости от заполненности приемки
	//КодПользователя = СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код);
	//Если (Дата<НачалоДня(ТекущаяДата()) ИЛИ (НЕ ЭтоНовый() И Ссылка.Дата<НачалоДня(ТекущаяДата()))) и НЕ(КодПользователя="tretyakov" ИЛИ КодПользователя="makarov") Тогда //TO DO Сделать отдельную роль для правки выплат задним числом
	//	#Если Клиент Тогда
	//	Предупреждение("Документ можно править только в течении дня!");
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецЕсли;	
	//Оповестить("ПередЗаписьюОтчета", , ЭтотОбъект); 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Не ЭтоНовый() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уб_ПриемкаОплат.Ссылка,
			|	уб_ПриемкаОплат.ПометкаУдаления,
			|	уб_ПриемкаОплат.Номер
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
			|ГДЕ
			|	уб_ПриемкаОплат.ОтчетКассира = &ОтчетКассира
			|	И НЕ уб_ПриемкаОплат.Проведен";
			Запрос.УстановитьПараметр("ОтчетКассира", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			СообщениеОПомеченныхНаУдаление = "Перед проведением отчета кассира необходимо снять пометку удаления с приемок оплат с номерами: ";
			ЕстьПриемкиПомеченныеНаУдаление = Ложь;
			Пока Выборка.Следующий() Цикл
				Если Выборка.ПометкаУдаления Тогда
					СообщениеОПомеченныхНаУдаление = СообщениеОПомеченныхНаУдаление + Выборка.Номер + ", ";
					Отказ = Истина;
					ЕстьПриемкиПомеченныеНаУдаление = Истина;
				Иначе
					Док = Выборка.Ссылка.ПолучитьОбъект();
					Попытка
						Док.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Док + "" + Символы.ПС + "Ошибка: " + ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
						Отказ = Истина;//???А почему отказ истина? Те если не возможно провести оплату он не запишет документ? -Да
					КонецПопытки;
				КонецЕсли;
			КонецЦикла; 
			Если ЕстьПриемкиПомеченныеНаУдаление Тогда
				СообщениеОПомеченныхНаУдаление = Лев(СообщениеОПомеченныхНаУдаление, СтрДлина(СообщениеОПомеченныхНаУдаление) - 2) + "!";
				#Если Клиент Тогда
					Сообщить(СообщениеОПомеченныхНаУдаление);
				#Иначе
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Док + "" + Символы.ПС + "Ошибка: " +СообщениеОПомеченныхНаУдаление+" / "+ ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное)
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
		Если Ссылка.Подтверждено Тогда
			//Был подтвержден
			РежимПроверкиСумм = Истина;
			ИзмененнаяСумма = Сумма;
		Конецесли;	
	КонецЕсли;
	//Если Не ЭтоНовый() Тогда	
	//	ОбновитьКоличествоСтрокПриемок();
	//КонецЕсли;
	Если НЕ Отказ Тогда
		Если РежимПроверкиСумм  = Истина и Подтверждено Тогда
			//Если у нас есть право установить утвержедено, 
			//значит можно отключить режим отслеживания сумм
			РежимПроверкиСумм  = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	Если ВТомЧислеНаКарту>0 и ПустаяСтрока(УИННаКарту) Тогда
		УИННаКарту = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;	
	//Движение статусов заявок
	Если Не Отказ Тогда
		Документы.уб_ОтчетКассира.ДвижениеСтатусовЗаявок(Ссылка);
		#Если Клиент Тогда
			Оповестить("ПослеЗаписиОтчетаКассира", Ссылка, ЭтотОбъект);
		#КонецЕсли			
		уб_ОбменДанными.ВыполнитьСинхронизацию(Ссылка);
		
		//
		
		Если Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя Тогда
			//Проводим документы, так как это влияет на списание бланков с Агента, 
			//Если подтвержденный отчет кассира - блкнки списываются, 
			//Если НЕТ то не списываются
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уб_ПриемкаОплат.Ссылка,
			|	уб_ПриемкаОплат.ПометкаУдаления,
			|	уб_ПриемкаОплат.Номер
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
			|ГДЕ
			|	уб_ПриемкаОплат.ОтчетКассира = &ОтчетКассира
			|	И уб_ПриемкаОплат.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("ОтчетКассира", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			СообщениеОПомеченныхНаУдаление = "Перед проведением отчета кассира необходимо снять пометку удаления с приемок оплат с номерами: ";
			ЕстьПриемкиПомеченныеНаУдаление = Ложь;
			Пока Выборка.Следующий() Цикл
				
				МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = Выборка.Ссылка;
				МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.Проведение;
				МенеджерЗаписи.Параметр   = "";
				МенеджерЗаписи.Записать();

				//Док = Выборка.Ссылка.ПолучитьОбъект();
				//Попытка
				//	Док.Записать(РежимЗаписиДокумента.Проведение);
				//Исключение
				//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Невозможно провести Документ: " + Док + "" + Символы.ПС + "Ошибка: " + ОписаниеОшибки(),, Истина,,,Ссылка,,СтатусСообщения.ОченьВажное);
				//	Отказ = Истина;
				//КонецПопытки;
				
			КонецЦикла; 
		КонецЕсли;

		//
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Сумма = 0;
	ПодтвержденнаяСумма = 0;
	Подтверждено = Ложь;
	
КонецПроцедуры

Функция ПолучитьСумму() Экспорт

	Результат = 0;
	Если Не Ссылка.Пустая() Тогда
		СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
		Если СистемаТЧПлатежи Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(П.ИтогСуммаПлатежи), 0) КАК Сумма
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК П
			|ГДЕ
			|	П.ОтчетКассира = &Ссылка
			|	И П.Проведен";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				Результат = Выборка.Сумма;
			КонецЕсли;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПрОп.Сумма
			|ИЗ
			|	Документ.уб_ПриемкаОплат КАК ПрОп
			|ГДЕ
			|	ПрОп.ОтчетКассира = &Ссылка
			|	И ПрОп.Проведен";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			Результат = ТЗ.Итог("Сумма");
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьСумму()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗнчДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипЗнчДанныеЗаполнения = Тип("Структура") И ДанныеЗаполнения.Свойство("РучнойРежим") И ДанныеЗаполнения.РучнойРежим = Истина Тогда
		ТекущаяДата	= ТекущаяДата();
		Ответственный			= ПараметрыСеанса.уб_ТекущееФизЛицо;
		ОтветственныйФинансы    = уб_СС.ПолучитьФИНОтветственного();
		Дата					= ТекущаяДата;
		НачОтчетПериод			= НачалоДня(ТекущаяДата);
		Сумма					= ДанныеЗаполнения.ИтогСуммаПлатежи;
		КоличествоСтрокПриемок	= 1;
	КонецЕсли;
	
КонецПроцедуры


Функция ОбновитьРасчеты() Экспорт
	Запрос  = Новый Запрос;
	
	Запрос.Текст = ТекстЗапроса();
	Запрос.УстановитьПараметр("ОтчетКассира",Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаРасчеты = Пакет[1].Выгрузить();
	Если ВыборкаРасчеты.Итог("Сумма")<> ВзаиморасчетыПоОрганизациям.Итог("Ожидается") Тогда
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	Для каждого СтрокаР из ВзаиморасчетыПоОрганизациям Цикл
		СтрокаР.Ожидается = 0;
	КонецЦикла;	
	
	Для каждого СтрокаР из ВыборкаРасчеты Цикл
		нСтроки = ВзаиморасчетыПоОрганизациям.НайтиСтроки(Новый Структура("Организация",СтрокаР.ОрганизацияАгент));
		Если нСтроки.Количество()>0 Тогда
			ТекСтрока = нСтроки[0];
		Иначе
			ТекСтрока = ВзаиморасчетыПоОрганизациям.Добавить();
			ТекСтрока.Организация = СтрокаР.ОрганизацияАгент;
		КонецЕсли;	
		ТекСтрока.Ожидается = ТекСтрока.Ожидается + СтрокаР.Сумма;
	КонецЦикла;
	
	флОплачено = ВзаиморасчетыПоОрганизациям.Итог("Поступило")>=ВзаиморасчетыПоОрганизациям.Итог("Ожидается");
	Если флОплачено = Истина Тогда
		Оплачено = Истина;
	Иначе
		Если флОплачено<>Оплачено Тогда
			Сообщить("Расхождения в сумме взаиморасчетов");
		КонецЕсли;	
	КонецЕсли;	

КонецФункции	

Функция ТекстЗапроса() Экспорт
	Возврат "ВЫБРАТЬ
	        |	Полисы.Ссылка КАК приемка,
	        |	Полисы.Поставщик КАК Поставщик,
	        |	Полисы.ОрганизацияАгент КАК ОрганизацияАгент,
	        |	Полисы.СК КАК СК,
	        |	Полисы.ВидБСО КАК ВидБСО,
	        |	Полисы.НомерБСО КАК НомерБСО,
	        |	Полисы.НомерПолиса КАК НомерПолиса,
	        |	Полисы.НомерКвитанции КАК НомерКвитанции,
	        |	Полисы.ПоставщикКвитанции КАК ПоставщикКвитанции,
	        |	Полисы.ОрганизацияАгентКвитанции КАК ОрганизацияАгентКвитанции,
	        |	Полисы.Сумма КАК Сумма,
	        |	Полисы.Сумма КАК СуммаВВалюте,
	        |	Полисы.УИДСтроки КАК УИДСтроки,
	        |	Полисы.ОплатаПолисаДляОтчетаАгента КАК ОплатаПолисаДляОтчетаАгента,
	        |	Полисы.Заявка КАК Заявка,
	        |	Полисы.ЭтоСвободныйНомер КАК ЭтоСвободныйНомер,
	        |	Полисы.Разница КАК Разница,
	        |	Полисы.УИДСтрокиЗаявки КАК УИДСтрокиЗаявки,
	        |	МАКСИМУМ(ЕСТЬNULL(уб_ВременныеДанныеПолисаКПриемкеОплат.Страхователь, уб_КвитовкаОплат.ОплатаПолиса.СтраховойПолис.Страхователь)) КАК Страхователь,
	        |	ВЫБОР
	        |		КОГДА Полисы.ОрганизацияАгент.ОрганизацияОтчетаКассира = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	        |			ТОГДА Полисы.ОрганизацияАгент
	        |		ИНАЧЕ Полисы.ОрганизацияАгент.ОрганизацияОтчетаКассира
	        |	КОНЕЦ КАК ОрганизацияАгентОтчет,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА Полисы.ВидБСО.Наименование В (""Техосмотр"", ""Заполнение Е-ОСАГО"")
	        |				ТОГДА ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)
	        |			ИНАЧЕ ЕСТЬNULL(уб_КвитовкаОплат.ОплатаПолиса.ФормаОплаты, уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты)
	        |		КОНЕЦ) КАК ФормаОплаты,
	        |	Полисы.Ссылка.ПринятоОТ КАК ПринятоОТ,
	        |	Полисы.Ссылка.Номер КАК Номер,
	        |	Полисы.Ссылка.Дата КАК Дата,
	        |	Полисы.Ссылка.Валюта КАК Валюта,
	        |	Полисы.Заявка.Номер КАК ЗаявкаНомер,
	        |	Полисы.СК КАК СК1
	        |ПОМЕСТИТЬ Данные
	        |ИЗ
	        |	Документ.уб_ПриемкаОплат.Полисы КАК Полисы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ВременныеДанныеПолисаКПриемкеОплат КАК уб_ВременныеДанныеПолисаКПриемкеОплат
	        |		ПО Полисы.УИДСтроки = уб_ВременныеДанныеПолисаКПриемкеОплат.УИДСтрокиТЧ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
	        |		ПО Полисы.УИДСтроки = уб_КвитовкаОплат.УИДСтрокиТЧ
	        |ГДЕ
	        |	Полисы.Ссылка В
	        |			(ВЫБРАТЬ
	        |				П.Ссылка
	        |			ИЗ
	        |				Документ.уб_ПриемкаОплат КАК П
	        |			ГДЕ
	        |				П.ОтчетКассира = &ОтчетКассира)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Полисы.Ссылка,
	        |	Полисы.Поставщик,
	        |	Полисы.ОрганизацияАгент,
	        |	Полисы.СК,
	        |	Полисы.ВидБСО,
	        |	Полисы.НомерБСО,
	        |	Полисы.НомерПолиса,
	        |	Полисы.НомерКвитанции,
	        |	Полисы.ПоставщикКвитанции,
	        |	Полисы.ОрганизацияАгентКвитанции,
	        |	Полисы.Сумма,
	        |	Полисы.УИДСтроки,
	        |	Полисы.ОплатаПолисаДляОтчетаАгента,
	        |	Полисы.Заявка,
	        |	Полисы.ЭтоСвободныйНомер,
	        |	Полисы.Разница,
	        |	Полисы.УИДСтрокиЗаявки,
	        |	уб_ВременныеДанныеПолисаКПриемкеОплат.Страхователь,
	        |	уб_КвитовкаОплат.ОплатаПолиса.ФормаОплаты,
	        |	уб_ВременныеДанныеПолисаКПриемкеОплат.ФормаОплаты,
	        |	ВЫБОР
	        |		КОГДА Полисы.ОрганизацияАгент.ОрганизацияОтчетаКассира = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	        |			ТОГДА Полисы.ОрганизацияАгент
	        |		ИНАЧЕ Полисы.ОрганизацияАгент.ОрганизацияОтчетаКассира
	        |	КОНЕЦ,
	        |	Полисы.Ссылка.ПринятоОТ,
	        |	Полисы.Ссылка.Номер,
	        |	Полисы.Ссылка.Дата,
	        |	Полисы.Ссылка.Валюта,
	        |	Полисы.СК,
	        |	Полисы.Сумма
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Данные.ОрганизацияАгентОтчет КАК ОрганизацияАгент,
	        |	СУММА(Данные.Сумма) КАК Сумма,
	        |	СУММА(Данные.СуммаВВалюте) КАК СуммаВВалюте,
	        |	ЕСТЬNULL(Данные.ФормаОплаты, ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)) КАК ФормаОплаты
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		Данные.Сумма КАК Сумма,
	        |		Данные.СуммаВВалюте КАК СуммаВВалюте,
	        |		Данные.ОрганизацияАгентОтчет КАК ОрганизацияАгентОтчет,
	        |		Данные.ФормаОплаты КАК ФормаОплаты
	        |	ИЗ
	        |		Данные КАК Данные
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |		уб_ПриемкаОплатПлатежи.Сумма,
	        |		уб_ПриемкаОплатПлатежи.Сумма,
	        |		ВЫБОР
	        |			КОГДА уб_ПриемкаОплатПолисы.ОрганизацияАгент.ОрганизацияОтчетаКассира = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	        |				ТОГДА уб_ПриемкаОплатПолисы.ОрганизацияАгент
	        |			ИНАЧЕ уб_ПриемкаОплатПолисы.ОрганизацияАгент.ОрганизацияОтчетаКассира
	        |		КОНЕЦ,
	        |		уб_ПриемкаОплатПлатежи.ФормаОплаты
	        |	ИЗ
	        |		Документ.уб_ПриемкаОплат.Платежи КАК уб_ПриемкаОплатПлатежи
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	        |			ПО уб_ПриемкаОплатПлатежи.Ссылка = уб_ПриемкаОплатПолисы.Ссылка
	        |				И (уб_ПриемкаОплатПолисы.НомерСтроки = 1)
	        |	ГДЕ
	        |		уб_ПриемкаОплатПлатежи.ОтсутствуетВОплатах = ИСТИНА
	        |		И уб_ПриемкаОплатПлатежи.Ссылка.ОтчетКассира = &ОтчетКассира) КАК Данные
	        |ГДЕ
	        |	ЕСТЬNULL(Данные.ФормаОплаты, ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)) = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Данные.ОрганизацияАгентОтчет,
	        |	ЕСТЬNULL(Данные.ФормаОплаты, ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Данные.приемка КАК приемка,
	        |	Данные.Поставщик КАК Поставщик,
	        |	Данные.ОрганизацияАгент КАК ОрганизацияАгент,
	        |	Данные.СК КАК СК,
	        |	Данные.ВидБСО КАК ВидБСО,
	        |	Данные.НомерБСО КАК НомерБСО,
	        |	Данные.НомерПолиса КАК НомерПолиса,
	        |	Данные.НомерКвитанции КАК НомерКвитанции,
	        |	Данные.ПоставщикКвитанции КАК ПоставщикКвитанции,
	        |	Данные.ОрганизацияАгентКвитанции КАК ОрганизацияАгентКвитанции,
	        |	Данные.Сумма КАК Сумма,
	        |	Данные.СуммаВВалюте КАК СуммаВВалюте,
	        |	Данные.УИДСтроки КАК УИДСтроки,
	        |	Данные.ОплатаПолисаДляОтчетаАгента КАК ОплатаПолисаДляОтчетаАгента,
	        |	Данные.Заявка КАК Заявка,
	        |	Данные.ЭтоСвободныйНомер КАК ЭтоСвободныйНомер,
	        |	Данные.Разница КАК Разница,
	        |	Данные.УИДСтрокиЗаявки КАК УИДСтрокиЗаявки,
	        |	Данные.Страхователь КАК Страхователь,
	        |	Данные.ОрганизацияАгентОтчет КАК ОрганизацияАгентОтчет,
	        |	Данные.ФормаОплаты КАК ФормаОплаты,
	        |	Данные.ПринятоОТ КАК ПринятоОТ,
	        |	Данные.Номер КАК Номер,
	        |	Данные.Дата КАК Дата,
	        |	Данные.Валюта КАК Валюта,
	        |	Данные.ЗаявкаНомер КАК ЗаявкаНомер
	        |ИЗ
	        |	Данные КАК Данные
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ОрганизацияАгентОтчет,
	        |	ФормаОплаты,
	        |	приемка
	        |ИТОГИ
	        |	СУММА(Сумма),
	        |	СУММА(СуммаВВалюте),
	        |	СУММА(Разница)
	        |ПО
	        |	ОрганизацияАгентОтчет,
	        |	ФормаОплаты,
	        |	Валюта,
	        |	приемка";
КонецФункции		
  