
Функция ПолучитьНастройкуПользователя(ИмяНастройки) Экспорт
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	чат_НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.уб_Чат_НастройкиПользователей КАК чат_НастройкиПользователей
		|ГДЕ
		|	чат_НастройкиПользователей.Пользователь = &Пользователь
		|	И чат_НастройкиПользователей.Настройка = &Настройка";
		
		Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
		Запрос.УстановитьПараметр("Настройка",ПланыВидовХарактеристик.чат_НастройкиПользователей[ИмяНастройки]);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		КонецЕсли;
		
		Возврат Неопределено;
		
	Исключение
		
		// неверное имя настройки
		Возврат Неопределено;
		
	КонецПопытки;

	
КонецФункции //ПолучитьНастройкуПользователя()

Процедура ОткрытьФормуЧата() Экспорт
	
	//TODO что это дф_ЧатСервер
	//Форма = дф_ЧатСервер.ПолучитьФорму("Форма");
	//Если НЕ Форма.Открыта() Тогда
	//	Форма.Открыть();
	//КонецЕсли;
	
КонецПроцедуры //ОткрытьФормуЧата()