
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК ЕстьРезультат
	|ИЗ
	|	Справочник.Пользователи КАК П
	|ГДЕ
	|	П.Профиль = &ЭтотОбъект И П.Ссылка = &ТекущийСеанс";
	
	Запрос.УстановитьПараметр("ЭтотОбъект", 	Ссылка);
	Запрос.УстановитьПараметр("ТекущийСеанс",	ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
		глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", Новый Соответствие, Истина);
	КонецЕсли;

КонецПроцедуры
