Функция ПолучитьПоРазностиВремениПредставлениеДляПользователя(РазностьВремени) Экспорт
	
	Если РазностьВремени = 0 Тогда
		Возврат "00:00:00";
	КонецЕсли;
	
	ОстатокВремени = РазностьВремени;
	
	КоличествоДней = Цел(ОстатокВремени /(60 * 60 * 24));
	ОстатокВремени = РазностьВремени - КоличествоДней * 60 * 60 * 24;
	
	КоличествоЧасов = Цел(ОстатокВремени /(60 * 60));
	ОстатокВремени = РазностьВремени - КоличествоЧасов * 60 * 60;
	
	КоличествоМинут = Цел(ОстатокВремени /(60));
	ОстатокВремени = РазностьВремени - КоличествоМинут * 60;
	
	КоличествоСекунд = ОстатокВремени;
	
	
	ВремяСтрокой = Прав("00" + Строка(КоличествоЧасов), 2) + ":" + Прав("00" + Строка(КоличествоМинут), 2) + ":" + Прав("00" + Строка(КоличествоСекунд), 2);
	
	Если КоличествоДней <> 0 тогда
		
		ВремяСтрокой = Строка(КоличествоДней) + " дней " + ВремяСтрокой;
		
	КонецЕсли;
	
	Возврат ВремяСтрокой;
	
КонецФункции

Функция ПолучитьИмяДняНедели(Дата = Неопределено,НомерДняНедели = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		НомерДняНедели = ДеньНедели(ТекущаяДата());
	Иначе
		НомерДняНедели = ДеньНедели(Дата);
	КонецЕсли;
	
	Если НомерДняНедели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняНедели = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДняНедели = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДняНедели = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДняНедели = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДняНедели = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";	
	КонецЕсли;
	
КонецФункции

// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьСтрокуОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
			
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьРасширениеИмениФайла(Знач ИмяФайла) Экспорт
	
	Расширение = ПолучитьСтрокуОтделеннойСимволом(ИмяФайла, ".");
	Возврат Расширение;
	
КонецФункции

Функция ПолучитьИмяПротоколаЗагрузки(ИмяФайлаПротоколаОбмена) Экспорт
	
	РасширениеФайлаПротокола = ПолучитьРасширениеИмениФайла(ИмяФайлаПротоколаОбмена);
	
	Если Не ПустаяСтрока(РасширениеФайлаПротокола) Тогда
		
		ИмяФайлаПротоколаЗагрузки = СтрЗаменить(ИмяФайлаПротоколаОбмена, "." + РасширениеФайлаПротокола, "");
		
	Иначе
		
		ИмяФайлаПротоколаЗагрузки = ИмяФайлаПротоколаОбмена;
		
	КонецЕсли;
	
	ИмяФайлаПротоколаЗагрузки = ИмяФайлаПротоколаЗагрузки + "_Загрузка";
	
	Если Не ПустаяСтрока(РасширениеФайлаПротокола) Тогда
		
		ИмяФайлаПротоколаЗагрузки = ИмяФайлаПротоколаЗагрузки + "." + РасширениеФайлаПротокола;	
		
	КонецЕсли;
	
	Возврат ИмяФайлаПротоколаЗагрузки;
	
КонецФункции

//Используется для передачи элементов конфигурации используя xml
//Парметры:
//	ИмяФайла - полное имя файла для сохранения (C:\exchange.xml)
//	Данные - объект конфигурации для передачи (ЭтотОбъект)
Функция ПередатьДанныеXML(ИмяФайла, Данные) Экспорт
	// Создаем объект записи XML
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписатьXML(ЗаписьXML, Данные);
	
	// Выводим диагностическое сообщение о записанных данных
	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Записаны данные '" + Строка(Данные.Метаданные()) + ": " + Строка(Данные) + "' в файл " + ИмяФайла,"Сообщить");
	// Завершаем запись сообщения
	ЗаписьXML.Закрыть();
КонецФункции //ПередатьДанныеXML

//Используется для передачи элементов конфигурации используя xml
//Парметры:
//	ИмяФайла - полное имя файла для чтения (C:\exchange.xml)
Функция ПолучитьДанныеXML(ИмяФайла) Экспорт
	// Создаем объект чтения XML
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	Данные = ПрочитатьXML(ЧтениеXML);
	
	Если НЕ Данные.ЭтоГруппа Тогда
		Если Данные.Родитель.ПолучитьОбъект() = Неопределено Тогда
			Данные.Родитель = "";
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Данные.Записать();
	Исключение
		Если Данные.Ссылка.Пустая() Тогда
			Данные.УстановитьНовыйКод();
		Иначе
			Данные.Код = Данные.Ссылка.Код;
		КонецЕсли;
		Данные.Записать();
	КонецПопытки;
	
	// Выводим диагностическое сообщение о записанных данных
	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("- " + Строка(Данные.Метаданные()) + ": " + Строка(Данные),"Сообщить");
	// Запись перенесенных данных
	Данные.Записать();
	ЧтениеXML.Закрыть();
	
	Возврат Данные.Ссылка;
	
КонецФункции //ПолучитьДанныеXML

//Используется для отправки почтового сообщения
//Параметры: заполняются с помощью функции ПараметрыСообщенияEMailПоУмолчанию()
//Все настройки хранятся в справочнике уб_Константы
Функция SendMail(Параметры) Экспорт
	
	ТекстОшибки = "";
	Если Параметры.ВыборкаУчетнойЗаписи = Неопределено Тогда
		ТекстОшибки = "Ошибка при получении данных справочника учетных записей: незаполнены данные учетной записи";
		Перейти ~НаВыход;
	Иначе
		Выборка = Параметры.ВыборкаУчетнойЗаписи
	КонецЕсли;
	//Если Выборка.Количество() = 0 Тогда
	//	ТекстОшибки = "Не найдена системная учетная запись электронной почты";
	//	ПисатьВЖурналПриОшибке = Истина;
	//	Перейти ~НаВыход;
	//КонецЕсли;
	Получатели				= Параметры.Получатели;
	ТипЗнчПолучатели		= ТипЗнч(Получатели);
	Если (ТипЗнчПолучатели <> Тип("Строка") И ТипЗнчПолучатели <> Тип("Массив") И ТипЗнчПолучатели <> Тип("СписокЗначений"))
		Или (ТипЗнчПолучатели = Тип("Строка") И ПустаяСтрока(Получатели))
		Или (ТипЗнчПолучатели <> Тип("Строка") И Получатели.Количество() = 0) Тогда
		ТекстОшибки = "Не заполнены получатели сообщения!";
		Перейти ~НаВыход;
	КонецЕсли;
	// вложения
	МассивВложений = Новый Массив;
	Если ТипЗнч(Параметры.Вложения) = Тип("Массив") Тогда
		МассивВложений = Параметры.Вложения;
	ИначеЕсли ТипЗнч(Параметры.Вложения) = Тип("Строка") Тогда
		Если Не ПустаяСтрока(Параметры.Вложения) Тогда
			МассивВложений.Добавить(Параметры.Вложения);
		КонецЕсли;
	КонецЕсли;
	Вложения = Новый Массив;
	РазмерВложений = 0;
	Если Параметры.ПроверятьНаличиеФайловВложений Тогда
		Для Каждого Вложение Из МассивВложений Цикл
			Файл = Новый Файл(Вложение);
			Если Файл.Существует() Тогда
				Вложения.Добавить(Вложение);
				Если Параметры.МаксимальныйРазмерФайловВложений > 0 Тогда
					РазмерВложений = РазмерВложений + Файл.Размер();
				КонецЕсли;
			КонецЕсли;
			Файл = Неопределено;
		КонецЦикла;
	Иначе
		Вложения = МассивВложений;
	КонецЕсли;
	Если Параметры.МаксимальныйРазмерФайловВложений > 0 И Параметры.МаксимальныйРазмерФайловВложений < РазмерВложений Тогда
		ТекстОшибки = "Превышен предел размера вложенных файлов. Максимальный размер 8 Мб. Размер файлов " + Окр(РазмерВложений / 1048576, 2) + " Мб";
		Перейти ~НаВыход;
	КонецЕсли;
	ПисатьВЖурналПриОшибке 	= Параметры.ПисатьВЖурналТемуПриОшибке;
	Получатели 				= Параметры.Получатели;
	Тема 					= Параметры.Тема;
	ТекстHTML				= Параметры.ТекстHTML;
	Сокращенное				= Параметры.Сокращенное;                                    
	Тело 					= Параметры.Сообщение;
	Если Не Сокращенное Тогда
		ТекстПисьма = Тело + "
		|База: " + СтрокаСоединенияИнформационнойБазы() + "
		|
		|====================================================================================
		|Это письмо сформированно автоматически в конфигурации 1C ""ITC:Управление Брокером"",
		|Отвечать на него не нужно. По всем возникшим вопросам обращаться к администратору."; 						
	Иначе
		ТекстПисьма = Тело;
	КонецЕсли;
	//Выборка.Следующий();
	ВремяОжидания 	= Выборка.Timeout;
	POP3ПередSMTP	= Выборка.POP3BeforeSMTP;
	Если ТипЗнч(ВремяОжидания) <> Тип("Число") Или ВремяОжидания < 0 Тогда
		ВремяОжидания = 30;
	КонецЕсли;
	ПортPOP3 = Выборка.POP3Port;
	Если ТипЗнч(ПортPOP3) <> Тип("Число") Или ПортPOP3 <= 0 Тогда
		ПортPOP3 = 110;
	КонецЕсли;
	ПортSMTP = Выборка.SMTPPort;
	Если ТипЗнч(ПортSMTP) <> Тип("Число") Или ПортSMTP <= 0 Тогда
		ПортSMTP = 25;
	КонецЕсли;
	Если Выборка.ЧерезCDO Тогда
		// отправка через SSL с помощью COM CDO.Message
		Попытка
			CDO = Новый COMОбъект("CDO.Message");
		Исключение
			ТекстОшибки = "Ошибка при создании объекта CDO.Message";
			ПисатьВЖурналПриОшибке = Истина;
			Перейти ~НаВыход;
		КонецПопытки;
		Попытка
			// проверочный корректный код
			//CDO_СерверSMTP			= "smtp.mail.ru";
			//Аутентификация			= 1;
			//CDO_ПользовательSMTP	= "itclabs.1c@mail.ru";
			//CDO_ПарольSMTP			= "Kf,elfKf,elf";
			//CDO_ПортSMTP			= 25;
			//CDO_ПортSMTP			= 465; //add SSL
			//Отправитель = CDO_ПользовательSMTP;
			//Письмо = Новый COMОбъект("CDO.Message");
			//Письмо.from		= CDO_ПользовательSMTP;
			//Письмо.Subject	= "Тема письма";
			//Письмо.TextBody	= "Автоматически сгенереный текст письма " + ТекущаяДата();
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendusing").Value 			= 2;
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpserver").Value 		= CDO_СерверSMTP;
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpauthenticate").Value 	= Аутентификация;
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendusername").Value 		= CDO_ПользовательSMTP;
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/sendpassword").Value 		= CDO_ПарольSMTP;
			//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpserverport").Value 	= CDO_ПортSMTP;
    		//Письмо.Configuration.Fields.Item("http://schemas.microsoft.com/cdo/configuration/smtpusessl").Value 		= 1;//add SSL
			//Письмо.Configuration.Fields.Update();
			//Письмо.Send();
			//CDO.DSNOptions = 2; // http://msdn.microsoft.com/en-us/library/ms526567(v=exchg.10).aspx
			// -- проверочный корректный код 
			URL = "http://schemas.microsoft.com/cdo/configuration/";
			CDO.Configuration.Fields.Item(URL + "sendusing").Value 		= 2; //?
			CDO.Configuration.Fields.Item(URL + "smtpserver").Value 	= Выборка.SMTPServer;
			CDO.Configuration.Fields.Item(URL + "smtpserverport").Value = ПортSMTP;
			// 0 - Do not authenticate; 1 - basic (clear-text) authentication; 2 - NTLM
			CDO.Configuration.Fields.Item(URL + "smtpauthenticate").Value 		= Выборка.SMTPAuthentication;
			CDO.Configuration.Fields.Item(URL + "smtpconnectiontimeout").Value 	= ВремяОжидания;
			CDO.Configuration.Fields.Item(URL + "sendusername").Value 			= Выборка.SMTPUser;
			CDO.Configuration.Fields.Item(URL + "sendpassword").Value 			= Выборка.SMTPPassword;
			CDO.Configuration.Fields.Item(URL + "smtpusessl").Value 			= Истина; //?
			Попытка
				CDO.Configuration.Fields.Update();
			Исключение
				ТекстОшибки = "Ошибка обновления полей объекта CDO.Message";
				ПисатьВЖурналПриОшибке = Истина;
				CDO = Неопределено;
				Перейти ~НаВыход;
			КонецПопытки;
			Для Каждого Вложение Из Вложения Цикл
				CDO.addAttachment(Вложение);
			КонецЦикла;
			Если ТипЗнч(Получатели) = Тип("Массив") Тогда
				СтрокаПолучателей = "";
				Для Каждого ЭлементМассива Из Получатели Цикл
					СтрокаПолучателей = СтрокаПолучателей + "," + ЭлементМассива;
				КонецЦикла;
				СтрокаПолучателей = Сред(СтрокаПолучателей, 2);
			Иначе
				СтрокаПолучателей = Получатели;
			КонецЕсли;
			CDO.To 		= СтрокаПолучателей;
			CDO.From    = Выборка.EMail;
			CDO.ReplyTo	= Параметры.ОбратныйАдрес;
			CDO.FollowUpTo = Параметры.ОбратныйАдрес;
			CDO.Subject = Тема;
			Если Не ПустаяСтрока(ТекстHTML) Тогда
				Попытка
					CDO.TextBody = ТекстПисьма; 
					CDO.HTMLBody = ТекстHTML;
					CDO.HTMLBodyPart.Charset = "windows-1251";
				Исключение
				КонецПопытки;
			Иначе
				CDO.TextBody = ТекстПисьма; 
			КонецЕсли;
		Исключение
			ТекстОшибки = "Ошибка при заполнении объекта CDO.Message "+ОписаниеОшибки();
			ПисатьВЖурналПриОшибке = Истина;
			CDO = Неопределено;
		КонецПопытки;
		//Для каждого Вложение из МассивВложений Цикл
		//	CDO.addAttachment(Вложение);
		//КонецЦикла;

		Если CDO <> Неопределено Тогда
			Попытка
				CDO.Send();
			Исключение
				ТекстОшибки = "Возникли проблемы при отправке почтового сообщения через SSL с темой: " + Параметры.Тема+"/"+ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
		CDO = Неопределено;
	Иначе
		// отправка без SSL
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Если ТипЗнч(Получатели) = Тип("Строка") Тогда
			Получатели = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Получатели)
		КонецЕсли;
		Для Каждого Получатель Из Получатели Цикл
			Письмо.Получатели.Добавить(Получатель)
		КонецЦикла;
		Отправитель 	= Параметры.Отправитель;
		ИмяОтправителя  = Параметры.ИмяОтправителя;
		Организация		= Параметры.Организация;
		ОбратныйАдрес	= Параметры.ОбратныйАдрес;
		КопияСебе		= Параметры.КопияСебе;		
		//Создаем профиль
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.POP3ПередSMTP 		= POP3ПередSMTP;
		Профиль.ВремяОжидания 		= ВремяОжидания;
		Профиль.ПортPOP3 			= ПортPOP3;
		Профиль.АдресСервераPOP3	= Выборка.POP3Server;
		Профиль.Пользователь		= Выборка.POP3User;
		Профиль.Пароль				= Выборка.POP3Password;
		Профиль.ПортSMTP			= ПортSMTP;
		Профиль.АдресСервераSMTP	= Выборка.SMTPServer;
		Профиль.ПользовательSMTP	= Выборка.SMTPUser;
		Профиль.ПарольSMTP			= Выборка.SMTPPassword;
		Профиль.ИспользоватьSSLIMAP	= Выборка.ИспользоватьSSLIMAP;
		//Если Профиль.ИспользоватьSSLIMAP Тогда
		Профиль.АдресСервераIMAP 	= Выборка.АдресСервераIMAP;
		Профиль.ПарольIMAP			= Выборка.POP3Password;//Выборка.ПарольIMAP;
		Профиль.ПортIMAP			= Выборка.ПортIMAP;
		Профиль.ПользовательIMAP	= Выборка.POP3User;//Выборка.ПользовательIMAP;
	//Иначе

		чАутентификацияSMTP 		= Выборка.SMTPAuthentication;
		Если чАутентификацияSMTP = 0 Тогда
			АутентификацияSMTP = СпособSMTPАутентификации.CramMD5;
		ИначеЕсли чАутентификацияSMTP = 1 Тогда
			АутентификацияSMTP = СпособSMTPАутентификации.Login;
		ИначеЕсли чАутентификацияSMTP = 2 Тогда
			АутентификацияSMTP = СпособSMTPАутентификации.Plain;
		ИначеЕсли чАутентификацияSMTP = 3 Тогда
			АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		ИначеЕсли чАутентификацияSMTP = 4 Тогда
			АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		Иначе
			АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		КонецЕсли;
		чАутентификацияPOP3 = Выборка.POP3Authentication;
		Если чАутентификацияPOP3 = 0 Тогда
			АутентификацияPOP3 = СпособPOP3Аутентификации.APOP;
		ИначеЕсли чАутентификацияPOP3 = 1 Тогда
			АутентификацияPOP3 = СпособPOP3Аутентификации.CramMD5;
		ИначеЕсли чАутентификацияPOP3 = 2 Тогда
			АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
		Иначе
			АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;
		КонецЕсли;
		Профиль.АутентификацияSMTP	= АутентификацияSMTP;
		Профиль.АутентификацияPOP3	= АутентификацияPOP3;	
		// Если надо, то отправляем копию себе
		Если КопияСебе Тогда
			Письмо.Получатели.Добавить(?(ЗначениеЗаполнено(ОбратныйАдрес), Отправитель, Выборка.EMail));
		КонецЕсли;
		Для Каждого Вложение Из Вложения Цикл					
			Письмо.Вложения.Добавить(Вложение);
		КонецЦикла;
		Письмо.ИмяОтправителя 	= ИмяОтправителя;
		Письмо.Отправитель 		= Отправитель;
		Письмо.ОбратныйАдрес.Добавить(ОбратныйАдрес);
		Если Не ПустаяСтрока(Организация) Тогда
			Письмо.Организация = Организация;
		КонецЕсли;
		Письмо.Кодировка 	= "windows-1251"; 
		Письмо.Тема 		= Тема; 
		//TODO сейчас отправляется либо html, либо текст.
		Если Не ПустаяСтрока(ТекстHTML) Тогда
			Письмо.Тексты.Добавить(ТекстHTML, ТипТекстаПочтовогоСообщения.HTML);
			Письмо.ОбработатьТексты();
		Иначе
			Письмо.Тексты.Добавить(ТекстПисьма);
		КонецЕсли;
		//Отправляем
		Почта = Новый ИнтернетПочта; 
		//ошибочно считает размер - лучше не использовать
		// проверка на размер файлов вложений есть выше
		//Если Письмо.Размер > ПараметрыСеанса.уб_Константы.МаксимальныйРазмерСообщения * 1024 * 1024 Тогда //в Мб Тогда
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Размер сообщения больше максимально установленного (" + ПараметрыСеанса.уб_Константы.МаксимальныйРазмерСообщения + " MB)";
		//	Сообщение.Сообщить();
		//	Возврат 0;
		//КонецЕсли;
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			Почта.Отключиться();
		Исключение
			ТекстОшибки = "Возникли проблемы при отправке почтового сообщения с темой: " + Параметры.Тема+"/"+ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;

	~НаВыход:

	Если ТекстОшибки <> "" Тогда
		ТекстОшибки = ТекстОшибки + "
		|Почта не была отправлена!" + ?(ЗначениеЗаполнено(Параметры.ДопИнформацияПриВыводеОшибки), " " + Параметры.ДопИнформацияПриВыводеОшибки, "");
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки, Параметры.ТипСообщенияПриИсключении, Параметры.ПисатьВЖурналТемуПриОшибке);
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция SendSMS (Параметры,Ответы = "") Экспорт
	Получатели = Параметры.Получатели;
	Если ТипЗнч(Получатели) = Тип("Строка") Тогда
		Получатели = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Получатели,";");
	КонецЕсли;
	Если Получатели.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены получатели сообщения!";
		Сообщение.Сообщить();
		Возврат Ложь;
	Иначе
		МассивПолучателей = Новый Массив;
		
		ТолькоОдномуПолучателю = Ложь;
		Параметры.Свойство("ТолькоОдномуПолучателю",ТолькоОдномуПолучателю);
		
		Для Каждого Получатель Из Получатели Цикл
			_ДлинаСтроки = 0;
			Получатель = уб_СтраховойБрокер.ТолькоЦифрыСтроки(Получатель,_ДлинаСтроки);
			_Лев2  = Лев  (Получатель,2);
			//_Сред3 = Сред (Получатель,3,1);"+7" случаи +7 запрещаем на уровне ввода номера
			Если _Лев2<>"89" и (_Лев2)<>"79" Тогда
				Продолжить;
			КонецЕсли;
			Если _ДлинаСтроки = 11 Тогда
				ПриведенныйНомер = ?(_Лев2="89","7"+Сред(Получатель,2),Получатель);
				МассивПолучателей.Добавить(ПриведенныйНомер);
				Если ТолькоОдномуПолучателю = Истина Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		Если МассивПолучателей.Количество()=0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не обнаружены подходящие номера телефонов!";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Параметры.ИмяСервиса = Нрег(Параметры.ИмяСервиса);
	
	Если Параметры.ИмяСервиса = "iqsms.ru" Тогда
		ДополнитьПараметрыУчетнойЗаписью(Параметры);
		Если Параметры.Режим ="email" Тогда
			ТекстПисьма = "login: "    + Параметры.login     + Символы.ПС +
			"password: " + Параметры.Password   + Символы.ПС +
			Параметры.Сообщение + Символы.ПС +
			"sender: "   + Параметры.Подпись;
			//Сообщить(ТекстПисьма);
			//			ПараметрыEmail = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
			Получатели = "";
			ВсегоПолучателей = МассивПолучателей.Количество();
			ТекПолучатель = 0;
			Для Каждого Получатель из МассивПолучателей Цикл
				ТекПолучатель = ТекПолучатель+1;
				Получатели = Получатели +Получатель+ "@iqsms.ru"+?(ТекПолучатель=ВсегоПолучателей,"",",");
			КонецЦикла;
			Параметры.Получатели 	= Получатели;
			
			Параметры.Тема			= "Рассылка СМС";
			Параметры.Сообщение		= ТекстПисьма;
			Параметры.Сокращенное = ИСТИНА; //Без подписи откуда отправлено
			Если Параметры.Активна Тогда
				уб_ОбменДанными.SendMail(Параметры);
			КонецЕсли;	
		ИначеЕсли Параметры.Режим ="REST" Тогда	
			//Запрос = "http://gate.iqsms.ru/senders/"; //Подписи
			Запрос = "http://gate.iqsms.ru/credits/"; //Баланс количества СМС
			//Запрос = "http://gate.iqsms.ru/status/?id=A132571BC"; //Состояние отправленного сообщения
			//Запрос = "http://gate.iqsms.ru/statusQueue/?statusQueueName=svs&limit=50"; //Очередь статуса отправленных 
			
			//Запрос ="http://gate.iqsms.ru/send/?phone=%2B79133616124&text=testovoe%20pismо&sender=tretyakov&statusQueueName=svs";
			
			//phone	Обязательно	Номер телефона, в формате +71234567890
			//text	Обязательно	Текст сообщения, в UTF-8 кодировке
			//wapurl		Wap-push ссылка, в случае, если вы хотите передать wap-push сообщение (например wap.yousite.ru)
			//sender		Подпись отправителя (например TEST) 
			//flash		Flash SMS – сообщение, которое сразу отображается на экране и не сохраняется в памяти телефона (1 – активировано)
			//scheduleTime		Дата для отложенной отправки сообщения, в UTC (2009-01-01T12:30:01+00:00) 
			//statusQueueName
			Попытка
				XMLHttp = GetCOMObject("", "Microsoft.XMLHTTP");
			Исключение
				Ошибка = ОписаниеОшибки();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка создания  Microsoft.XMLHTTP "+Ошибка+"("+Запрос+")";
				Сообщение.Сообщить();
			КонецПопытки;
			
			
			//Инициируем запрос, который вернет управление программе только после получения ответа
			Для Каждого Получатель из МассивПолучателей Цикл
				_Сообщение = Параметры.Сообщение;
				Запрос= "http://gate.iqsms.ru/send/"         +
				"?phone="  + URI("+"+Получатель)   +
				"&text="   + URI(_Сообщение)       +
				//"&sender=" + URI(Параметры.Подпись)+
				"&statusQueueName=svs";
				Если Параметры.Активна Тогда
					Ответ = ВыполнитьHttpЗапрос(Запрос, Параметры.login, Параметры.Password, XMLHttp, "СМС-рассылка","?phone="+Получатель);
					Ответы = Ответы+Ответ+"; "
				Иначе//Не активная учетка
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Пропущен запрос для неактивной учетной записи: "+Запрос;
					//Сообщение.Сообщить();
				КонецЕсли;


			КонецЦикла;
		//ИначеЕсли Параметры.Режим ="json" Тогда//
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Неизвестный режим отправки SMS: "+Параметры.Режим;
			Сообщение.Сообщить();
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"),Истина,,,,"СМС-рассылка.Error.Режим");
			Возврат Ложь;	
		Конецесли;	
		
	ИначеЕсли Параметры.ИмяСервиса = "smsc.ru" Тогда	
		ДополнитьПараметрыУчетнойЗаписью(Параметры);
		Если Параметры.Режим ="HTTP" Тогда	
			//Запрос = "http://gate.iqsms.ru/senders/"; //Подписи
			Запрос = "http://smsc.ru/sys/balance.php?login=<login>&psw=<password>"; //Баланс количества СМС
			Попытка
				XMLHttp = GetCOMObject("", "Microsoft.XMLHTTP");
			Исключение
				Ошибка = ОписаниеОшибки();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка создания  Microsoft.XMLHTTP "+Ошибка+"("+Запрос+")";
				Сообщение.Сообщить();
			КонецПопытки;
			//Инициируем запрос, который вернет управление программе только после получения ответа
			Для Каждого Получатель из МассивПолучателей Цикл
				_Сообщение = Параметры.Сообщение;
				//http://smsc.ru/sys/send.php?login=<login>&psw=<password>&phones=<phones>&mes=<message>
				Запрос= "http://smsc.ru/sys/send.php"         +
				"?login="  + Параметры.login   +
				"&psw="    + Параметры.Password   +
				"&phones="  + URI("+"+Получатель)   +
				"&mes="   + URLEncode(_Сообщение)       +
				"&sender=" + URI(Параметры.Подпись)+
				"&cost=3"+//В ответе цену
				"&fmt=0"+//Формат ответа сервера об успешной отправке.
				//0 – (по умолчанию) в виде строки (OK - 1 SMS, ID - 1234).
				//1 – вернуть ответ в виде чисел: ID и количество SMS через запятую (1234,1), при cost = 2 еще стоимость через запятую (1234,1,1.40), при cost = 3 еще новый баланс Клиента (1234,1,1.40,100.50), при cost = 1 стоимость и количество SMS через запятую (1.40,1).
				//2 – ответ в xml формате.
				//3 – ответ в json формате.
				"";
				//"&statusQueueName=svs";
				Если Параметры.Активна Тогда
					Ответ = ВыполнитьHttpЗапрос(Запрос, Параметры.login, Параметры.Password, XMLHttp, "СМС-рассылка","?phones="+Получатель);
					Ответы = Ответы+Ответ+"; "
				Иначе//Не активная учетка
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Пропущен запрос для неактивной учетной записи: "+Запрос;
					//Сообщение.Сообщить();
				КонецЕсли;
			КонецЦикла;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Неизвестный режим отправки SMS: "+Параметры.Режим;
			Сообщение.Сообщить();
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина,,,,"СМС-рассылка.Error.Режим");
			Возврат Ложь;	
		Конецесли;	
	ИначеЕсли Параметры.ИмяСервиса = "www.sluice" Тогда	
			ДополнитьПараметрыУчетнойЗаписью(Параметры);	
			Запрос = "";
			MD5 = Обработки.уб_MD5.Создать();
			
			//http://sluice.loc/
			//"?type=sms_gate&task=send&phones=79235687059&message=%D0%A2%D0%B5%D1%81%D1%82+%D0%A1%D0%9CC&sender=for-ins.ru&signature=909ffaf2026ae9d19820797495f785c4"
			type      = "sms_gate";
			task      = "send";
			Для Каждого Получатель из МассивПолучателей Цикл
				_Сообщение = Параметры.Сообщение;
				
				phones    = Получатель;
				message   = _Сообщение;//URI(_Сообщение);
				sender    = URI(Параметры.Подпись);
				//sender    = "for-ins.ru";
				secretkey = "F89HpuEv0R";//"qweasdzxc";
				signature = НРЕГ(MD5.РасчетХЭШ(
				НРЕГ(MD5.РасчетХЭШ(secretkey))
				+НРЕГ(MD5.РасчетХЭШ(sender))
				+НРЕГ(MD5.РасчетХЭШ(type))
				+НРЕГ(MD5.РасчетХЭШ(task))
				+НРЕГ(MD5.РасчетХЭШ(""))
				+НРЕГ(MD5.РасчетХЭШ(phones))
				));
				Message = уб_обменДанными.URI(Message);
				Запрос=
				"http://www.sluice/?type=" + type     +
				"&task="            + task     +
				"&phones="          + phones   +
				"&message="         + message  +
				"&sender="          + sender   +
				"&signature="       + signature;
				
				Если Параметры.Активна Тогда
					Ответ = ВыполнитьHttpЗапрос(Запрос, Параметры.login, Параметры.Password, XMLHttp, "СМС-рассылка","?phones="+Получатель);
					Ответы = Ответы+Ответ+"; "
				Иначе//Не активная учетка
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Пропущен запрос для неактивной учетной записи: "+Запрос;
					//Сообщение.Сообщить();
				КонецЕсли;
			КонецЦикла;	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неизвестный SMS сервис:"+Параметры.ИмяСервиса;
		Сообщение.Сообщить();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст,"",Истина,,,,"СМС-рассылка.Error.Провайдер");
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

Процедура ДополнитьПараметрыУчетнойЗаписью(Параметры, НаименованиеУчетнойЗаписи = Неопределено)
	
	Запрос = Новый Запрос (
	"ВЫБРАТЬ
	|	УЗ.Ссылка,
	|	УЗ.ПометкаУдаления,
	|	НЕ УЗ.НеАктивна КАК Активна,
	|	УЗ.Предопределенный,
	|	УЗ.Код,
	|	УЗ.Наименование,
	|	УЗ.POP3Authentication,
	|	УЗ.POP3User,
	|	УЗ.POP3Password,
	|	УЗ.POP3BeforeSMTP,
	|	УЗ.POP3Port,
	|	УЗ.POP3Server,
	|	УЗ.SMTPAuthentication,
	|	УЗ.SMTPUser,
	|	УЗ.SMTPPassword,
	|	УЗ.SMTPPort,
	|	УЗ.SMTPServer,
	|	УЗ.Timeout,
	|	УЗ.КопияСебе,
	|	УЗ.МаксимальныйРазмерСообщения,
	|	УЗ.EMail,
	|	УЗ.Представление
	|ИЗ
	|	Справочник.уб_УчетныеЗаписи КАК УЗ
	|ГДЕ
	|	УЗ.Наименование = &Наименование");	
	Запрос.УстановитьПараметр("Наименование",?(НаименованиеУчетнойЗаписи = Неопределено, Параметры.ИмяСервиса, НаименованиеУчетнойЗаписи));
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Параметры.Вставить("Login",  	Выборка.POP3User);
		Параметры.Вставить("Password", 	Выборка.POP3Password);
		Параметры.Вставить("Подпись", 	Выборка.EMail);
		Параметры.Вставить("Активна", 	Выборка.Активна);
	Иначе	
		Параметры.Вставить("Активна", 	Ложь);
		Параметры.Вставить("Login",  	"");
		Параметры.Вставить("Password", 	"");
		Параметры.Вставить("Подпись", 	"");
	КонецЕсли;
	
КонецПроцедуры	

//Выполняет запрос через Microsoft.XMLHTTP, возвращает результат, при ошибках пишет в журнал регистрации
Функция ВыполнитьHttpЗапрос(Запрос, login = "", Password = "", XMLHttp = Неопределено, ИмяЗапроса = "XMLHttp",ТекстУспешногоСообщения = "",Адрес = Неопределено) Экспорт
	
 //   Если Найти(Запрос,"https") Тогда
 //   	XMLHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
 //   	
 //   	XMLHttp.Option(2,"UTF-8");
 //   	XMLHttp.Option(4, 13056); //intSslErrorIgnoreFlags
 //   	Попытка
 //   		//1
 ////   		Скрипт= Новый COMОбъект("MSScriptControl.ScriptControl");
 ////
 ////   		Скрипт.language="javascript";
 ////   		Скрипт.AddObject("WinHttp",XMLHttp);
 ////	 		Скрипт.Eval("WinHttp.Option(2)=1251");
 //// 			Скрипт.Eval("WinHttp.Option(4)=13056");//intSslErrorIgnoreFlags
 ////			XMLHttp.SetTimeouts(5000, 10000, 15000, 40000);
 //   		///Скрипт.Eval(\"WinHttp.Option(6)=true\");//blnEnableRedirects
 //	
 //   		//Скрипт.Eval(\"WinHttp.Option(12)=true\");//blnEnableHttpsToHttpRedirects
 //   		//2
 //   		//Об = vbsОбертка();
 //   		//Об.Run("Opti",XMLHttp,2,"UTF-8");
 //   		//Об.Run("Opti",XMLHttp,4,13056);
 //   		//3
 //   		Об = ПолучитьОбертку();
 //   		Об.Опция(XMLHttp,2,"UTF-8");
 //   	Об.Опция(XMLHttp,4,13056);	
 //   	Исключение
 //   		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ОписаниеОшибки(), "Сообщить", Истина,,,,ИмяЗапроса+".Error.Обертка" );
 //   	КонецПопытки;
 //   	
 //   	//WinHttp.Option(6, true);//blnEnableRedirects    
 //   	//WinHttp.Option(12, true);//blnEnableHttpsToHttpRedirects
 //   	
 //   	//XMLHttp.Open("POST", "https://b2b.soglasie.ru/CCM/CCMPort", 0);
 //   	//WinHttp.SetCredentials(Авторизация.POP3User, Авторизация.POP3Password, 0);
 //   	//WinHttp.SetCredentials("test_user", "jashgj675237512", 0);
 //   	
 //   	//WinHttp.SetRequestHeader("Accept-Encoding", "gzip,deflate");
 //   	//WinHttp.setRequestHeader("Content-Type"," text/xml;charset=UTF-8");   
 //   	//WinHttp.setRequestHeader("Cache-Control", "no-cache"); 
 //   	
 //   	//Попытка
 //   	//	WinHttp.Send(request); //, ИСТИНА, "test_user", "jashgj675237512");
 //   	//Исключение
 //   	//	Сообщить(ОписаниеОшибки());
 //   	//КонецПопытки;
 //   	
 //   	//Попытка
 //   	//	XMLHttp = WinHttp.Status;
 //   	//Исключение
 //   	//КонецПопытки;
 //   Иначе
		Если XMLHttp = Неопределено Тогда 
			XMLHttp = GetCOMObject("", "Microsoft.XMLHTTP"); 
		КонецЕсли;		
	//КонецЕсли;
	
	Попытка
		XMLHttp.Open("GET", Запрос, Ложь,login,Password);
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибочный OPEN "+Ошибка+"("+Запрос+")";
		Сообщение.Сообщить();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина,,,,ИмяЗапроса+".Error.Open" );
		Возврат Ложь;
	КонецПопытки;	
	//Отправка запроса      
	Попытка
		XMLHttp.Send();	
	Исключение
		Если РольДоступна("ПолныеПрава") Тогда
			//Сообщить("При отправке "+ОписаниеОшибки()+" "+"("+Запрос+")");
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При отправке "+ОписаниеОшибки()+" "+"("+Запрос+")", "Сообщить", Истина,,,,ИмяЗапроса+".Error.Обертка" );
		КонецЕсли;	
		Возврат Ложь;
	КонецПопытки;
	
	Если XMLHttp.Status = 200 Тогда //Список статусов: http://msdn.microsoft.com/en-us/library/ie/ms767625(v=vs.85).aspx
		// после возврата ResponseText - можно еще анализировать сам текст ответа приобразованый в ХМЛ структуру
		// использовать при необходимости прочитать результат запроса. 
		// Напр. мы в строке юзаем пхп скрипт и он нам должен отдать результат выполнения... В ResponseText и хранится это значение
		Ответ = XMLHttp.ResponseText;
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = Ответ;
		//Сообщение.Сообщить();		
		//Если ТекстУспешногоСообщения = ЛОЖЬ  -  не логируется ответ
		Если НЕ ТекстУспешногоСообщения = Ложь Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить( "" + Ответ + "{" + ТекстУспешногоСообщения + "}", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина, УровеньЖурналаРегистрации.Информация,,,ИмяЗапроса+".OK");
		КонецЕсли;	
		Если не Адрес = Неопределено Тогда
			ПоместитьВоВременноеХранилище(Ответ,Адрес);
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить( "Помещено в хранилище", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина, УровеньЖурналаРегистрации.Информация,,,ИмяЗапроса+".OK");
		КонецЕсли;
		
		Возврат Ответ;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибочный статус при отправке " + ИмяЗапроса + " " + XMLHttp.Status + "/" + XMLHttp.statusText + "(" + Запрос + ") - "+XMLHttp.ResponseText;
		Сообщение.Сообщить();
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(Сообщение.Текст, ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина,,,, ИмяЗапроса+"Error.Status");
		Возврат Ложь;	
	КонецЕсли;

КонецФункции

Функция vbsОбертка() Экспорт
	Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
	Скрипт.Language="vbscript";
	Скрипт.AddCode("Function Opti(Y,Opt,Val)
	|  Y.Option Opt,Val
	|End Function");
	//Результат = Скрипт.Run("Option",Строка);
	//Возврат Результат;
	Возврат Скрипт
КонецФункции

Функция ПолучитьОбертку() Экспорт
 
    ХТМЛ = Новый COMОбъект("htmlfile");
 
    ХТМЛ.Open("text/html");
 
    //<-- Подготовим нужные методы
 
    ХТМЛ.Write("<script>
 
    |var ХТМЛ;
 
    |Опция=function(x,y,z){var ret=x.Option(y);if(z) x.Option(y)=z; return ret};
 
    |Записать=function(x,y){x.Write(y.responseBody())};
 
    |</script>");
 
    Док=ХТМЛ.documentElement.document;
 
    // Внедрение объекта Скрипта в самого себя, для сохранности контекста
 
    Док.script.ХТМЛ=ХТМЛ;
 
    // Все подготовке -->
 
    Возврат Док.script;
 
КонецФункции    // ПолучитьОбертку(Это)

Функция ВернутьСтатусSMSСообщения (id, ИмяСервиса = "iqsms.ru") Экспорт
	
	Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
	Параметры.Вставить("ИмяСервиса",ИмяСервиса);	
	ДополнитьПараметрыУчетнойЗаписью(Параметры);
	Если ИмяСервиса = "iqsms.ru" Тогда
		Если Параметры.Активна Тогда
			Запрос = "http://gate.iqsms.ru/status/?id="+id; //Состояние отправленного сообщения
			Ответ = ВыполнитьHttpЗапрос(Запрос, Параметры.login, Параметры.Password,, "СМС-статус","?id="+id);
			Ответ = Сред(Ответ,Найти(Ответ,"=")+1);
			Если Ответ = "queued" Тогда
				Ответ = "Сообщение находится в очереди";
			ИначеЕсли Ответ = "delivered" Тогда
				Ответ = "Сообщение доставлено";
			ИначеЕсли Ответ = "delivery error" Тогда
				Ответ = "Ошибка доставки SMS (абонент в течение времени доставки находился вне зоны действия сети или номер абонента заблокирован)";
			ИначеЕсли Ответ = "smsc submit" Тогда
				Ответ = "Сообщение доставлено в SMSC";
			ИначеЕсли Ответ = "smsc reject" Тогда	
				Ответ = "Сообщение отвергнуто SMSC (номер заблокирован или не существует)";
			ИначеЕсли Ответ = "incorrect id" Тогда		
				Ответ = "Неверный идентификатор сообщения";
			КонецЕсли;			
			Возврат Ответ;
		Иначе//Не активная учетка
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Пропущен запрос для неактивной учетной записи: "+Запрос;
			//Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не известен сервис для которого необходимо проверить состояние: "+Имясервиса;
		Сообщение.Сообщить();
	КонецЕсли;

КонецФункции	

Функция ПараметрыСообщенияEMailПоУмолчанию(Знач УчетнаяЗапись = Неопределено, ПолучениеПочты = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	Справочник.уб_УчетныеЗаписи КАК УЗ
	|ГДЕ
	|	УЗ.Ссылка = &УчетнаяЗапись";
	Если УчетнаяЗапись = Неопределено Тогда
		УчетнаяЗапись = ПараметрыСеанса.уб_Константы.SystemEMail;
	КонецЕсли;
	Если ТипЗнч(УчетнаяЗапись) <> Тип("СправочникСсылка.уб_УчетныеЗаписи") Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Некорректный тип параметры УчетныеЗаписи функции ПараметрыСообщенияEMailПоУмолчанию(), тип: " + ТипЗнч(УчетнаяЗапись), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
		УчетнаяЗапись = Справочники.уб_УчетныеЗаписи.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	КонецЕсли;
	Параметры = Новый Структура;
	Параметры.Вставить("УчетнаяЗапись",					УчетнаяЗапись);
	СтруктураВыборки = Новый Структура;
	Для каждого КолонкаРезультата из РезультатЗапроса.Колонки Цикл
		СтруктураВыборки.Вставить(КолонкаРезультата.Имя,Выборка[КолонкаРезультата.Имя]);		
	КонецЦикла;	
	
	Параметры.Вставить("ВыборкаУчетнойЗаписи",			СтруктураВыборки);
	Параметры.Вставить("ПисатьВЖурналТемуПриОшибке",	Ложь);
	Параметры.Вставить("ТипСообщенияПриИсключении",		"Сообщить");
	// любого типа для добавления в сообщение ошибки для конкретизации чего-либо
	Параметры.Вставить("ДопИнформацияПриВыводеОшибки");
	Если ПолучениеПочты Тогда
		Параметры.Вставить("ПараметрыОтбораIMAP", Новый Структура);
	Иначе
		Если Выборка = Неопределено Тогда
			Отправитель 	= "";
			КопияСебе		= Ложь;
			Представление	= "";
		Иначе
			Отправитель 	= Выборка.EMail;
			КопияСебе		= Выборка.КопияСебе;
			Представление   = Выборка.Представление2;
		КонецЕсли;
		Параметры.Вставить("Отправитель",						Отправитель);
		Параметры.Вставить("ОбратныйАдрес",						Отправитель);
		Параметры.Вставить("КопияСебе",							КопияСебе);
		Параметры.Вставить("Получатели", 						"");
		Параметры.Вставить("Тема",								"");
		Параметры.Вставить("Сообщение",							"");
		Параметры.Вставить("Вложения",							"");
		Параметры.Вставить("ИмяОтправителя",					Представление);
		Параметры.Вставить("Организация",						"");
		Параметры.Вставить("Сокращенное",						Ложь);
		Параметры.Вставить("ТекстHTML",							"");
		Параметры.Вставить("ПроверятьНаличиеФайловВложений", 	Истина);
		// 8 Мб (8 * 1024 * 1024) 
		//	проверяется только при условии ПроверятьНаличиеФайловВложений = Истина
		//	Если = 0 тогда не проверяется размер файлов вложений
		Параметры.Вставить("МаксимальныйРазмерФайловВложений",	8388608); // 8 Мб (8 * 1024 * 1024)
	КонецЕсли;
	Возврат Параметры;
	
КонецФункции // ПараметрыСообщенияEMailПоУмолчанию()

Функция ПодключитьСоединение (Соединение, СтрокаПодключения,Версия = "",ТекстОшибки = "Ошибка подключения!") Экспорт
	//
	Если Соединение = Неопределено Или Соединение = "" Или Соединение=0 Тогда
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
	Если Версия = "" Тогда
		Версия = ПолучитьВерсиюПоИдентификатору(СтрокаПодключения);
	КонецЕсли;
	
	Попытка
		V8 = Новый COMОбъект(Версия + ".COMConnector");	
		ФактСтрокаПодключения = ПолучитьСтрокуПодключения(СтрокаПодключения);
		Если Найти(ФактСтрокаПодключения, "=")>0 Тогда
			#Если Клиент Тогда
				Соединение = Расширение().мСоединения.Получить(СтрокаПодключения);
				Если Соединение = Неопределено Тогда
					Соединение = V8.Connect(ФактСтрокаПодключения);
					Расширение().мСоединения.Вставить(СтрокаПодключения,Соединение);
				КонецЕсли;
			#Иначе
				Соединение = V8.Connect(ФактСтрокаПодключения);
			#КонецЕсли 
		Иначе
			//Строка подключения не задана или некорректна
			//Сообщение об этом не выводим, это не ошибка подключения
			//TO DO при думать способ информирования о незаполненной строке подключения
			//В заголовке системы показывать наличие активных сторонних подключений?
			Возврат Ложь;	
		КонецЕсли;
		Возврат Истина;
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки + ОписаниеОшибки(), "Сообщить");
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции


//Функция ПодключитьСоединение2 (СтрокаПодключения,Версия = "",ТекстОшибки = "Ошибка подключения!") Экспорт
//	//
//	Если Соединение = Неопределено Или Соединение = "" Или Соединение=0 Тогда
//	Иначе
//		Возврат Истина;
//	КонецЕсли;	
//	
//	Если Версия = "" Тогда
//		Версия = ПолучитьВерсиюПоИдентификатору(СтрокаПодключения);
//	КонецЕсли;
//	
//	Попытка
//		V8 = Новый COMОбъект(Версия + ".COMConnector");	
//		ФактСтрокаПодключения = ПолучитьСтрокуПодключения(СтрокаПодключения);
//		Если Найти(ФактСтрокаПодключения, "=")>0 Тогда
//			#Если Клиент Тогда
//				Соединение = Расширение().мСоединения.Получить(СтрокаПодключения);
//				Если Соединение = Неопределено Тогда
//					Соединение = V8.Connect(ФактСтрокаПодключения);
//					Расширение().мСоединения.Вставить(СтрокаПодключения,Соединение);
//				КонецЕсли;
//			#Иначе
//				Соединение = V8.Connect(ФактСтрокаПодключения);
//			#КонецЕсли 
//		Иначе
//			//Строка подключения не задана или некорректна
//			//Сообщение об этом не выводим, это не ошибка подключения
//			//TO DO при думать способ информирования о незаполненной строке подключения
//			//В заголовке системы показывать наличие активных сторонних подключений?
//			Возврат Ложь;	
//		КонецЕсли;
//		Возврат Истина;
//	Исключение
//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки + ОписаниеОшибки(), "Сообщить");
//		Возврат Ложь;
//	КонецПопытки;
//	
//КонецФункции

Процедура ВыполнитьКомандуРасширения(Команда) Экспорт
	Если Команда = "ОчиститьСоединения" Тогда
		Попытка
			#Если Клиент Тогда
				Расширение().мСоединения.Очистить();
			#КонецЕсли 
		Исключение
			Сообщить("Ошибка при очистке сессий!");
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьВерсиюПоИдентификатору (Идентификатор) Экспорт
	Версия = "V83";
	Если Идентификатор = "Консолидация" Тогда
		Версия = "V82";
	ИначеЕсли Идентификатор = "БП81" Тогда
		Версия = "V81";
	ИначеЕсли Идентификатор = "БП82" Тогда
		Версия = "V83";
	ИначеЕсли Идентификатор = "БП16" Тогда
		Версия = "V81";
	ИначеЕсли Идентификатор = "БП20" Тогда
		Версия = "V83";	
	ИначеЕсли Идентификатор = "Деньги" Тогда	
		Версия = "V83";	
	КонецЕсли;	
	
	Возврат Версия;
КонецФункции	

Функция ПолучитьСтрокуПодключения (Идентификатор)  Экспорт
	
	СтрокаПодключения = Идентификатор;
	Если Идентификатор = "Консолидация" Тогда
		СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияККонсолидации;
	ИначеЕсли Идентификатор = "БП81" Тогда
		СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии81;
	ИначеЕсли Идентификатор = "БП16" Тогда
		СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии81;	
	ИначеЕсли Идентификатор = "БП82" Тогда
		СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии82;	
	ИначеЕсли Идентификатор = "БП20" Тогда
		СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияКБухгалтерии82;		
	ИначеЕсли Идентификатор = "Деньги" Тогда	
		//СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияК1СДеньги;		
		Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияК1СДеньги;
		Иначе
			СтрокаПодключения = "Srvr=""TAU:2041"";Ref=""money_demo"";Usr=""робот"";Pwd=""тобор""";
		КонецЕсли;
	КонецЕсли;	
	Если ТипЗнч(СтрокаПодключения) <> Тип("Строка") Или ПустаяСтрока(СтрокаПодключения) Тогда
		СтрокаПодключения = Идентификатор;
	КонецЕсли;	
	Возврат СтрокаПодключения;
	
КонецФункции	

//Возвращает ссылку в текущей базе, соответствующую переданной ссылке в удаленной базе, через запрос регистра соответствий в "Консолидации"

Функция ЛокальнаяСсылка (ВнешняяСсылка,УдаленноеСоединение, ИдентификаторУдаленнойБазы="",Консолидация = Неопределено,КодЭтойБазы = "УБ") Экспорт
	
	//Если ИдентификаторУдаленнойБазы="" Тогда
	//Иначе
	//КонецЕсли;	
	
	Если НЕ ПодключитьСоединение(Консолидация,"Консолидация") Тогда
		Возврат Неопределено;
	Конецесли;	
	
	Запрос = Консолидация.NewObject("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
	|Источник.УзелИнформационнойБазы,
	|Источник.ТипИсточника,
	|Источник.ПредставлениеОбъектаПриемника,
	|Источник.УникальныйИдентификаторПриемника,
	|Получатель.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|Получатель.ТипПриемника КАК ТипПриемника
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовИнформационныхБаз КАК Источник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектовИнформационныхБаз КАК Получатель
	|		ПО Источник.УникальныйИдентификаторИсточника = Получатель.УникальныйИдентификаторИсточника
	|			И (Получатель.УзелИнформационнойБазы.Код = &КодПолучателя)
	|ГДЕ
	|	Источник.УзелИнформационнойБазы.Код = &КодИсточника
	|	И Источник.УникальныйИдентификаторПриемника = &УникальныйИдентификаторИсточника";
	Запрос.УстановитьПараметр("КодИсточника",ИдентификаторУдаленнойБазы);
	Запрос.УстановитьПараметр("КодПолучателя",КодЭтойБазы);
	Запрос.УстановитьПараметр("УникальныйИдентификаторИсточника",УдаленноеСоединение.String(ВнешняяСсылка.UUID()));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		//	
		
		Ссылка = Справочники[ВыделитьВидИзСтрокиТипа(Выборка.ТипПриемника)].ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.УникальныйИдентификаторПриемника));
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		Иначе
			Возврат Ссылка;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецФункции	

//Возвращает удаленную ссылку соответсвующую локальной ссылке в этой базе
Функция УдаленнаяСсылка(ЛокальнаяСсылка,УдаленноеСоединенние,ИдентификаторУдаленнойБазы,Консолидация = Неопределено,КодЭтойБазы = "УБ") Экспорт
	//
	Если НЕ ПодключитьСоединение(Консолидация,"Консолидация") Тогда
		Возврат Неопределено;
	Конецесли;	
	
	Запрос = Консолидация.NewObject("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
	|Источник.УзелИнформационнойБазы,
	|Источник.ТипИсточника,
	|Источник.ПредставлениеОбъектаПриемника,
	|Источник.УникальныйИдентификаторПриемника,
	|Получатель.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|Получатель.ТипПриемника КАК ТипПриемника
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовИнформационныхБаз КАК Источник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектовИнформационныхБаз КАК Получатель
	|		ПО Источник.УникальныйИдентификаторИсточника = Получатель.УникальныйИдентификаторИсточника
	|			И (Получатель.УзелИнформационнойБазы.Код = &КодПолучателя)
	|ГДЕ
	|	Источник.УзелИнформационнойБазы.Код = &КодИсточника
	|	И Источник.УникальныйИдентификаторПриемника = &УникальныйИдентификаторИсточника";
	Запрос.УстановитьПараметр("КодИсточника",КодЭтойБазы);
	Запрос.УстановитьПараметр("КодПолучателя",ИдентификаторУдаленнойБазы);
	Запрос.УстановитьПараметр("УникальныйИдентификаторИсточника",Строка(ЛокальнаяСсылка.УникальныйИдентификатор()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		//	
		
		Ссылка = УдаленноеСоединенние.Справочники[ВыделитьВидИзСтрокиТипа(Выборка.ТипПриемника)].ПолучитьСсылку(УдаленноеСоединенние.NewObject("УникальныйИдентификатор",Выборка.УникальныйИдентификаторПриемника));
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		Иначе
			Возврат Ссылка;
		КонецЕсли;	
		
	КонецЕсли;	
КонецФункции	

Функция ВыделитьВидИзСтрокиТипа (СтрокаТипа)
	
	ПозСпр = Найти(СтрокаТипа,".");
	Если  ПозСпр> 0 Тогда
		Возврат Сред (СтрокаТипа,ПозСпр+1); 
	КонецЕсли;	
	
	//ПозДок = Найти(СтрокаТипа,"ДокументСсылка");
	//Если  ПозСпр> 0 Тогда
	//	Возврат Сред (СтрокаТипа,СтрДлина("ДокументСсылка")+1); 
	//КонецЕсли;	
	
	Возврат СтрокаТипа;
	
КонецФункции	

Процедура ВыполнитьСинхронизацию(Ссылка) Экспорт
	
	Перем ТипСсылки;
	
	Если ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Ссылка;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
		МенеджерЗаписи.Параметр   = Ссылка.Номер;
		МенеджерЗаписи.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		//ОбработкаВыгрузки = Обработки.ВыгрузкаДанныхВоВнешнююСистему.Создать();
		//ОбработкаВыгрузки.Инициализировать();
		//ОбработкаВыгрузки.ОтправитьСсылку(Ссылка);
		
		//ОбработкаВыгрузки.НачПериода = Дата(2023,3,13);
		//ОбработкаВыгрузки.КонПериода = КонецМесяца(ОбработкаВыгрузки.НачПериода);
		
		

	КонецЕсли;	
	//	СтрокаПодключения = ПараметрыСеанса.уб_Константы.СтрокаПодключенияК1СДеньги;
	//Иначе
	//	СтрокаПодключения = "Srvr=""TAU:2041"";Ref=""money_demo"";Usr=""робот"";Pwd=""тобор""";
	//КонецЕсли;
	//
	//Если ТипЗнч(СтрокаПодключения) = Тип("Строка") 
	//	И Не ПустаяСтрока(СтрокаПодключения)
	//	Тогда
	//	ТипСсылки = ТипЗнч(Ссылка);
	//	Если ТипСсылки = Тип("ДокументСсылка.уб_ВыплатаЗП") Тогда
	//		ПроверитьСоздатьВыплатуЗПВДеньгах(Ссылка);
	//	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.уб_ОтчетКассира") Тогда	
	//		ПроверитьСоздатьОтчетКассираВДеньгах(Ссылка);
	//	КонецЕсли;
	//Иначе
	//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Синхронизация с 1С:Деньги не выполнена: ЭтоРабочаяБаза '" + ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза + "'
	//	|Строка подключения к деньгам: '" + ПараметрыСеанса.уб_Константы.СтрокаПодключенияК1СДеньги + "'
	//	|Ссылка: '" + Ссылка + "'", ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
	//КонецЕсли;
	
	
КонецПроцедуры	

//Процедура создает документ в базе денег, если он проведен здесь,в противном случае удаляет
// Параметры 
// 		СсылкаЗдесь = Ссылка на создаваемый документ
// 		Соединение = в этот реквизит возможно передать ссылку на уже подключенное соединение
Процедура ПроверитьСоздатьВыплатуЗПВДеньгах (СсылкаЗдесь,Соединение = Неопределено)  Экспорт
	
	//Возврат;
	Если Не ПодключитьСоединение (Соединение, "Деньги",, "Ошибка подключения к 1С Деньги!") Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = СсылкаЗдесь;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
		МенеджерЗаписи.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат
		//"C:\Users\Roman1C\Documents\Money"
	КонецЕсли;		
	Попытка
		ДокументДолженБытьПеренесен =  СсылкаЗдесь.Проведен И СсылкаЗдесь.Дата>Дата(2012,4,1) и СсылкаЗдесь.НеОтражатьРасчетыВ1СДеньги = Ложь и СсылкаЗдесь.ВидОперации <> Перечисления.уб_ВидОперацииВыплатыЗП.СписаниеЗадолженности;
		ОбъектТам = ПолучитьОбъектВ1СДеньгиПоУИН(Соединение,СсылкаЗдесь,"Расход",ДокументДолженБытьПеренесен);	;		
		Если ОбъектТам = Неопределено Тогда
			Возврат;
		КонецЕсли;			
		СуммаВыплаты = СсылкаЗдесь.ИтогоВыплачено;
		Проект = "";
		Если ДокументДолженБытьПеренесен Тогда //= СсылкаЗдесь.Проведен
			ОбъектТам.ПометкаУдаления = Ложь;
			ОбъектТам.Загружен = Истина;
			Если ОбъектТам.Дата >Дата(2018,1,1) и ЗначениеЗаполнено(СсылкаЗдесь.Подразделение) и СсылкаЗдесь.Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя Тогда
				ОбъектТам.Кошелек			= Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию(Соединение.string(СсылкаЗдесь.Подразделение.КодПоОКАТО), Истина);
				Если ОбъектТам.Кошелек.Пустая() Тогда
					Сообщить("Проверьте название кошелька "+СсылкаЗдесь.Подразделение.КодПоОКАТО+ " в поле 'Код по ОКАТО' подразделения, пропущена загрузка");
					Возврат;
				КонецЕсли;	
				Проект = СсылкаЗдесь.Подразделение.Проект;
			Иначе	
				ОбъектТам.Кошелек			= Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию("СЕЙФ", Истина);
			КонецЕсли;	
			//ОбъектТам.Кошелек		            = Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию("СЕЙФ",Истина);
			ОбъектТам.ОднострочныйРежим         = Ложь;
			ОбъектТам.Дата                      = СсылкаЗдесь.Дата;
			ОбъектТам.Комментарий	            = "";
			ОбъектТам.ОписаниеОперации         	= "";			
			ОбъектТам.СуммаВВалютеКошелька      = СуммаВыплаты;
			ОбъектТам.ВидОперации				= Соединение.Справочники.ВидыОпераций.Расход;
			ОбъектТам.ВалютаРасход				= Соединение.Справочники.Валюты.НайтиПоНаименованию("руб.");
			ОбъектТам.НаправлениеДвиженияДенег	= Соединение.Перечисления.НаправленияДвиженияДенег.Расход;
			ОбъектТам.СуммаРасход               = СуммаВыплаты;
			ОбъектТам.ВалютаДвижения            = ОбъектТам.ВалютаРасход;
			ОбъектТам.СуммаВВалютеДвижения      = СуммаВыплаты;
			ОбъектТам.КурсКошелекДвижения       = 1;
			ОбъектТам.КратностьДвиженияКошелек  = 1;
			ОбъектТам.СуммаБезСкидкиВВалютеДвижения  = СуммаВыплаты;
			ОбъектТам.ЦеныВДругойВалюте         = Ложь;			
			ДвиженияДенег = ОбъектТам.ДвиженияДенег;
			Если ДвиженияДенег.Количество()= 1 Тогда
				УинСтроки = ДвиженияДенег.Получить(0).УИН;
			Иначе
				УинСтроки = СокрЛП(Новый УникальныйИдентификатор);
			КонецЕсли;
			ДвиженияДенег.Очистить();
			ОбъектТам.СвойстваДокумента.Очистить();
			ОбъектТам.СвойстваДокументаПострочно.Очистить();
			//Движение
			НоваяСтрокаДвижение = ДвиженияДенег.Добавить();
			НоваяСтрокаДвижение.Статья		= Соединение.Справочники.СтатьиРасходов.НайтиПоНаименованию("Выплаты сотрудникам");
			НоваяСтрокаДвижение.УИН 		= УинСтроки;
			НоваяСтрокаДвижение.Сумма		= СуммаВыплаты;
			НоваяСтрокаДвижение.Цена       	= СуммаВыплаты;
			НоваяСтрокаДвижение.Количество 	= 1;
			НоваяСтрокаДвижение.КОплате    	=  СуммаВыплаты;
			НоваяСтрокаДвижение.Комментарий = СсылкаЗдесь.КраткийСоставДокумента;
			Если НЕ ПустаяСтрока(Проект) Тогда
				ПроектТам = Соединение.Справочники.СвойстваДокументов.НайтиПоНаименованию(Проект,,,Соединение.ПланыВидовХарактеристик.СвойстваДокументов.Проект);
				Если Не ПроектТам.Пустая() Тогда
					НоваяСтрокаДвижение.Проект = ПроектТам;
				КонецЕсли;	
			КонецЕсли;
			//Аналитика
			СтрокаСвойства                    = ОбъектТам.СвойстваДокументаПострочно.Добавить();
			СтрокаСвойства.УИН                =  НоваяСтрокаДвижение.УИН;
			СтрокаСвойства.СвойствоДокумента  = Соединение.ПланыВидовХарактеристик.СвойстваДокументов.НайтиПоНаименованию("Вид выплаты зарплаты");	
			стрВидВыплаты = Строка(СсылкаЗдесь.ВидОперации);
			Если стрВидВыплаты = "Займ" Тогда
				стрВидВыплаты = "Долг";
			КонецЕсли;	
			СтрокаСвойства.Значение = Соединение.Справочники.СвойстваДокументов.НайтиПоНаименованию(стрВидВыплаты);			
			ОбъектТам.Записать(Соединение.РежимЗаписиДокумента.Проведение);
		Иначе	
			ОбъектТам.Удалить();
		КонецЕсли;	
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = СсылкаЗдесь;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Сообщить("При синхронизации 1C:Управление брокером и 1С:Деньги 8.2"+Символы.ПС+ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьСоздатьОтчетКассираВДеньгах(СсылкаЗдесь,Соединение = Неопределено)  Экспорт
	
	Если не ПодключитьСоединение (Соединение, "Деньги",,"Ошибка подключения к 1С Деньги!") Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = СсылкаЗдесь;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
		МенеджерЗаписи.Записать();
		УстановитьПривилегированныйРежим(Ложь);

		Возврат
		//"C:\Users\Roman1C\Documents\Money"
	КонецЕсли;	
	Попытка
		//Только проведенные и подтвержденные отчеты кассиру создаются в 1С:Деньги
		ДокументДолженБытьПеренесен = СсылкаЗдесь.Проведен И СсылкаЗдесь.Подтверждено И СсылкаЗдесь.Дата > Дата(2012,4,1) и СсылкаЗдесь.НеОтражатьРасчетыВ1СДеньги = Ложь;
		Запрос = Новый Запрос;
		СистемаТЧПлатежи = ПараметрыСеанса.уб_Константы.СистемаТЧПлатежейВПриемкеОплат = Истина;
		Если СистемаТЧПлатежи Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	П.Ссылка.Категория КАК Категория,
			|	ЕСТЬNULL(СУММА(П.Сумма), 0) КАК Сумма,
			|	ЕСТЬNULL(СУММА(ВЫБОР
			|				КОГДА П.ОбоснованиеРазницы = ""Оплата выезда клиентом""
			|					ТОГДА П.Сумма
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК СуммаВознагражденияКурьераКлиентом,
			|	ЕСТЬNULL(СУММА(П.Сумма) - СУММА(ВЫБОР
			|				КОГДА П.ОбоснованиеРазницы = ""Оплата выезда клиентом""
			|					ТОГДА П.Сумма
			|				ИНАЧЕ 0
			|			КОНЕЦ), 0) КАК СуммаПоСтраховкам
			|ИЗ
			|	Документ.уб_ОтчетКассира КАК ОК
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Платежи КАК П
			|		ПО (П.Ссылка.ОтчетКассира = ОК.Ссылка)
			|			И (П.Ссылка.Проведен)
			|			И (П.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)
			|				ИЛИ (П.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
			|					И П.Ссылка.Дата > ДАТАВРЕМЯ(2023, 7, 1)))
			|ГДЕ
			|	ОК.Ссылка = &ОтчетКассира
			|
			|СГРУППИРОВАТЬ ПО
			|	П.Ссылка.Категория";
		Иначе
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.уб_КатегорииДенежныхСредств.ПустаяСсылка) КАК Категория,
			|	СУММА(ЕСТЬNULL(уб_ПриемкаОплат.Сумма, 0)) КАК Сумма,
			|	СУММА(ЕСТЬNULL(уб_ПриемкаОплат.СуммаВВалюте, 0)) КАК СуммаВВалюте,
			|	СУММА(ЕСТЬNULL(уб_ПриемкаОплат.ВознаграждениеКурьераКлиентом, 0)) КАК СуммаВознагражденияКурьераКлиентом,
			|	СУММА(ЕСТЬNULL(уб_ПриемкаОплат.Сумма, 0)) - СУММА(ЕСТЬNULL(уб_ПриемкаОплат.ВознаграждениеКурьераКлиентом, 0)) КАК СуммаПоСтраховкам
			|ИЗ
			|	Документ.уб_ОтчетКассира КАК уб_ОтчетКассира
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат КАК уб_ПриемкаОплат
			|		ПО (уб_ПриемкаОплат.ОтчетКассира = уб_ОтчетКассира.Ссылка)
			|			И (уб_ПриемкаОплат.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Касса)
			|				ИЛИ (уб_ПриемкаОплат.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.НаКарту)
			|					И уб_ПриемкаОплат.Дата > ДАТАВРЕМЯ(2023, 7, 1)))
			|ГДЕ
			|	уб_ОтчетКассира.Ссылка = &ОтчетКассира";
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ОтчетКассира", СсылкаЗдесь);
		ОтчетыКассиру = Запрос.Выполнить().Выгрузить();
		Если ОтчетыКассиру.НайтиСтроки(Новый Структура("Категория",Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка())).Количество()= 0 Тогда
			итОтчетаКассиру = ОтчетыКассиру.Вставить(0);
			итОтчетаКассиру.Категория = Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка();
			итОтчетаКассиру.Сумма = 0;
			итОтчетаКассиру.СуммаВознагражденияКурьераКлиентом= 0;
			итОтчетаКассиру.СуммаПоСтраховкам= 0;
		КонецЕсли;	
		
		_СуммаВыплаты = 0;
		Для каждого итОтчетаКассиру из ОтчетыКассиру Цикл
			СуммаВыплаты = итОтчетаКассиру.Сумма;
			СуммаВознагражденияКурьераКлиентом = итОтчетаКассиру.СуммаВознагражденияКурьераКлиентом;
			СуммаПоСтраховкам = итОтчетаКассиру.СуммаПоСтраховкам;
			
			ОбъектТам = ПолучитьОбъектВ1СДеньгиПоУИН(Соединение, СсылкаЗдесь, ?(СуммаВыплаты >= 0, "Приход", "Расход"), ДокументДолженБытьПеренесен,итОтчетаКассиру.Категория);	
			Если ОбъектТам = Неопределено 
				ИЛИ (СуммаВыплаты = 0 и СуммаВознагражденияКурьераКлиентом=0 и СуммаПоСтраховкам = 0) //В этом документе нет наличных приемок
				Тогда
				Возврат;
			КонецЕсли;	
			Если ДокументДолженБытьПеренесен Тогда 
				ОбъектТам.ПометкаУдаления 	= Ложь;
				ОбъектТам.Загружен 			= Истина;
				Проект = "";
				Если СсылкаЗдесь.Дата >Дата(2018,8,8) 
					и ЗначениеЗаполнено(СсылкаЗдесь.Подразделение) 
					и СсылкаЗдесь.Подразделение.ТипПодразделения = Перечисления.уб_ТипПодразделения.СлужбаВСВнешняя Тогда
					Если итОтчетаКассиру.Категория = Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка() или ПустаяСтрока(итОтчетаКассиру.Категория.НаименованиеКошелька) Тогда
						ОбъектТам.Кошелек = Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию(Соединение.string(СсылкаЗдесь.Подразделение.КодПоОКАТО), Истина);
						Если ОбъектТам.Кошелек.Пустая() Тогда
							Сообщить("Проверьте название кошелька "+СсылкаЗдесь.Подразделение.КодПоОКАТО+ " в поле 'Код по ОКАТО' подразделения, пропущена загрузка");
							Возврат;
						КонецЕсли;
						Проект = СсылкаЗдесь.Подразделение.Проект;

					Иначе
						ОбъектТам.Кошелек = Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию(Соединение.string(итОтчетаКассиру.Категория.НаименованиеКошелька), Истина);
						Если ОбъектТам.Кошелек.Пустая() Тогда
							Сообщить("Проверьте название кошелька "+итОтчетаКассиру.Категория.НаименованиеКошелька+ " в категории денежных средств "+итОтчетаКассиру.Категория);
							Возврат;
						КонецЕсли;	
					КонецЕсли;	
						
					
				Иначе	
					ОбъектТам.Кошелек			= Соединение.Справочники.КошелькиИСчета.НайтиПоНаименованию("СЕЙФ", Истина);
				КонецЕсли;	
				ОбъектТам.ОднострочныйРежим = Ложь;
				ОбъектТам.Дата              = СсылкаЗдесь.Дата;
				ОбъектТам.Комментарий	    = "";
				ОбъектТам.ОписаниеОперации  = "";
				ЭтоПриход = СуммаВыплаты > 0;
				Если ЭтоПриход Тогда 
					ОбъектТам.ВалютаПриход				= Соединение.Справочники.Валюты.НайтиПоНаименованию("руб.");
					ОбъектТам.НаправлениеДвиженияДенег	= Соединение.Перечисления.НаправленияДвиженияДенег.Доход;
					ОбъектТам.ВидОперации				= Соединение.Справочники.ВидыОпераций.Доход;
				Иначе
					СуммаВыплаты 						= - СуммаВыплаты;
					СуммаПоСтраховкам 					= - СуммаПоСтраховкам;
					СуммаВознагражденияКурьераКлиентом  = - СуммаВознагражденияКурьераКлиентом;
					ОбъектТам.СуммаВВалютеКошелька      = СуммаВыплаты;
					ОбъектТам.ВидОперации				= Соединение.Справочники.ВидыОпераций.Расход;
					ОбъектТам.ВалютаРасход				= Соединение.Справочники.Валюты.НайтиПоНаименованию("руб.");
					ОбъектТам.НаправлениеДвиженияДенег	= Соединение.Перечисления.НаправленияДвиженияДенег.Расход;
					ОбъектТам.СуммаРасход               = СуммаВыплаты;
					ОбъектТам.ВалютаДвижения            = ОбъектТам.ВалютаРасход;
					ОбъектТам.СуммаВВалютеДвижения      = СуммаВыплаты;
					ОбъектТам.КурсКошелекДвижения       = 1;
					ОбъектТам.КратностьДвиженияКошелек  = 1;
					ОбъектТам.СуммаБезСкидкиВВалютеДвижения  = СуммаВыплаты;
					ОбъектТам.ЦеныВДругойВалюте         = Ложь;
				КонецЕсли;
				ДвиженияДенег = ОбъектТам.ДвиженияДенег;
				//заполняем уины строк
				МассивУИН = Новый Массив;
				МассивУИН.Добавить(Неопределено);
				МассивУИН.Добавить(Неопределено);
				Для Каждого СтрокаТЧ Из ДвиженияДенег Цикл
					МассивУИН.Добавить(СтрокаТЧ.УИН)
				КонецЦикла;
				Для Индекс = 1 По 2 - МассивУИН.Количество() Цикл
					МассивУИН.Добавить(Неопределено)
				КонецЦикла;
				ДвиженияДенег.Очистить();
				ОбъектТам.СвойстваДокумента.Очистить();
				ОбъектТам.СвойстваДокументаПострочно.Очистить();
				//Движение
				//по продажам страховок или возврату премии
				НоваяСтрокаДвижение = ДвиженияДенег.Добавить();
				Если ЭтоПриход Тогда 
					НоваяСтрокаДвижение.Статья		= Соединение.Справочники.СтатьиДоходов.НайтиПоНаименованию("Продажа страховок");
				Иначе
					НоваяСтрокаДвижение.Статья	   	= Соединение.Справочники.СтатьиРасходов.НайтиПоНаименованию("Возврат премии");
					НоваяСтрокаДвижение.Цена       	= СуммаПоСтраховкам;
					НоваяСтрокаДвижение.Количество 	= 1;
					НоваяСтрокаДвижение.КОплате    	= СуммаПоСтраховкам;
				КонецЕсли;	
				НоваяСтрокаДвижение.УИН         = ?(МассивУИН[0] = Неопределено, СокрЛП(Новый УникальныйИдентификатор), МассивУИН[0]);
				НоваяСтрокаДвижение.Сумма	    = СуммаПоСтраховкам;
				НоваяСтрокаДвижение.Комментарий = "Отчет кассиру № " + СсылкаЗдесь.Номер + " " + СокрЛП(СсылкаЗдесь.Период);
				
				Если НЕ ПустаяСтрока(Проект) Тогда
					ПроектТам = Соединение.Справочники.СвойстваДокументов.НайтиПоНаименованию(Проект,,,Соединение.ПланыВидовХарактеристик.СвойстваДокументов.Проект);
					Если Не ПроектТам.Пустая() Тогда
						НоваяСтрокаДвижение.Проект = ПроектТам;
					КонецЕсли;	
				КонецЕсли;	
				
				Если СуммаВознагражденияКурьераКлиентом <> 0 Тогда
					НоваяСтрокаДвижение = ДвиженияДенег.Добавить();
					Если ЭтоПриход Тогда
						НоваяСтрокаДвижение.Статья = Соединение.Справочники.СтатьиДоходов.НайтиПоНаименованию("Оплата выезда клиентом")
					Иначе
						НоваяСтрокаДвижение.Статья 		= Соединение.Справочники.СтатьиРасходов.НайтиПоНаименованию("Неопределенные расходы");
						НоваяСтрокаДвижение.Цена		= СуммаВознагражденияКурьераКлиентом;
						НоваяСтрокаДвижение.Количество  = 1;
						НоваяСтрокаДвижение.КОплате		= СуммаВознагражденияКурьераКлиентом;
					КонецЕсли;
					НоваяСтрокаДвижение.УИН			= ?(МассивУИН[1] = Неопределено, СокрЛП(Новый УникальныйИдентификатор), МассивУИН[1]);
					НоваяСтрокаДвижение.Сумма		= СуммаВознагражденияКурьераКлиентом;
					НоваяСтрокаДвижение.Комментарий = "Отчет кассиру № " + СсылкаЗдесь.Номер + " " + СокрЛП(СсылкаЗдесь.Период);
				КонецЕсли;
				//Аналитика
				//СтрокаСвойства                    = ОбъектТам.СвойстваДокументаПострочно.Добавить();
				//СтрокаСвойства.УИН                = НоваяСтрокаДвижение.УИН;
				//СтрокаСвойства.СвойствоДокумента  = Соединение.ПланыВидовХарактеристик.СвойстваДокументов.НайтиПоНаименованию("");	
				//СтрокаСвойства.Значение           = Соединение.Справочники.СвойстваДокументов.НайтиПоНаименованию("");
				ОбъектТам.Записать(Соединение.РежимЗаписиДокумента.Проведение);
			Иначе	
				Если Не ОбъектТам.ЭтоНовый() Тогда
					ОбъектТам.Удалить();
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи = РегистрыСведений.уб_Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = СсылкаЗдесь;
		МенеджерЗаписи.ТипОчереди = Перечисления.уб_ТипыОчереди.ВыгрузкаВоВнешнююСистему;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		Сообщить("При синхронизации 1C:Управление брокером и 1С:Деньги 8.2" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОбъектВ1СДеньгиПоУИН(Соединение,СсылкаЗдесь,ТипДокумента,ДокументДолженБытьПеренесен,Категория = Неопределено)
	
	УИНСтрокой = Строка (СсылкаЗдесь.УникальныйИдентификатор());
	Если Категория = Неопределено или Категория = Справочники.уб_КатегорииДенежныхСредств.ПустаяСсылка() Тогда
	Иначе
		УИНСтрокой = Строка (СсылкаЗдесь.УникальныйИдентификатор());
		УИНСтрокой = ОбщегоНазначения.MD5Хэш(УИНСтрокой+Категория.УникальныйИдентификатор());
		УИНСтрокой = Сред(УИНСтрокой,1,8)+"-"+Сред(УИНСтрокой,9,4)+"-"+Сред(УИНСтрокой,13,4)+"-"+Сред(УИНСтрокой,17,4)+"-"+Сред(УИНСтрокой,21,12);
	КонецЕсли;	
	МенеджерДокумента = Соединение.Документы[ТипДокумента];
	ДокументВ1СДеньги = МенеджерДокумента.НайтиПоРеквизиту("УИН", УИНСтрокой);	
	Если ДокументВ1СДеньги.Пустая() Тогда
		//есть возможность изменения типа документа (Приход/Расход)
		//TODO сделать запросом для нахождения всех документов по уину
		ОбратныйТип = ?(ТипДокумента = "Приход", "Расход", "Приход");
		ОбратныйДокументВ1СДеньги = Соединение.Документы[ОбратныйТип].НайтиПоРеквизиту("УИН", УИНСтрокой);
		Если Не ОбратныйДокументВ1СДеньги.Пустая() Тогда
			//удаляем не актуальный документ
			ОбратныйДокументВ1СДеньги.Удалить()
		КонецЕсли;
		Если ДокументДолженБытьПеренесен Тогда
			ОбъектТам = МенеджерДокумента.СоздатьДокумент();
			СсылкаТам = МенеджерДокумента.ПолучитьСсылку(Соединение.NewObject("УникальныйИдентификатор",УИНСтрокой));
			ОбъектТам.УстановитьСсылкуНового(СсылкаТам);
			ОбъектТам.УИН = УИНСтрокой;
			ОбъектТам.Дата = СсылкаЗдесь.Дата;
		Иначе
			//Документа нет и не надо создавать
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		ОбъектТам = ДокументВ1СДеньги.ПолучитьОбъект();
	КонецЕсли;
	Возврат ОбъектТам;
	
КонецФункции

Функция ПолучитьДанныеОДокументеИзБухгалтерии(УИДСтрокой,СтрокаСоединения="БП82") Экспорт
	//
	Результат = "";
	Соединение = Неопределено;
	Если Не уб_ОбменДанными.ПодключитьСоединение (Соединение, СтрокаСоединения,, "Ошибка подключения к 1С Бухгалтерии!") Тогда
		Возврат "Нет соединения с бухгалтерией";
		//"C:\Users\Roman1C\Documents\Money"
	КонецЕсли;

	Попытка
		СсылкаТам = Соединение.Документы.ОтчетКомиссионераОПродажах.ПолучитьСсылку(Соединение.NewObject("УникальныйИдентификатор",УИДСтрокой));
	Исключение
		Возврат "Ошибка преобразование УИД из бухгалтерии "+УИДСтрокой;
	КонецПопытки;
	ТекстЗапроса = "";
	Запрос = Соединение.NewObject("Запрос");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Ссылка,
	|	ОтчетКомиссионераОПродажах.Проведен,
	|	ОтчетКомиссионераОПродажах.Дата,
	|	ОтчетКомиссионераОПродажах.Номер,
	|	ОтчетКомиссионераОПродажах.ПометкаУдаления,
	|	ОтчетКомиссионераОПродажах.СуммаВознаграждения,
	|	ОтчетКомиссионераОПродажах.СуммаДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр ("Ссылка",СсылкаТам); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
 		Результат = "Отчет "
		+ Выборка.Номер 
		+ " от " + Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")
		+" на сумму "+Формат(Выборка.СуммаДокумента,"ЧЦ=15; ЧДЦ=2")
		+";"+Символы.ПС + "Вознаграждение: "+Формат(Выборка.СуммаВознаграждения,"ЧЦ=15; ЧДЦ=2")
		+ " ("+Формат(?(Выборка.СуммаДокумента=0,0,Выборка.СуммаВознаграждения*100/Выборка.СуммаДокумента),"ЧЦ=15; ЧДЦ=2")+"%)"
		+ ?(Выборка.ПометкаУдаления = Истина," (Помечен на удаление)",?(Выборка.Проведен = Ложь," (Не проведен)",""))
		;
	Иначе
		Результат = "Не получено данных по существующему документу в бухгалтерии";
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции	

// Параметры.ПараметрыОтбораIMAP
//		не работают
// виснет 1с через IMAP, если есть хоть одно сообщение без темы (как на клиенте, так и на сервере)
Функция ПолучитьПочту(
	УчетнаяЗапись 	= Неопределено,
	Параметры 		= Неопределено
	) Экспорт

	ТекстОшибки = "";
	Результат = Новый Массив;
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыСообщенияEMailПоУмолчанию(УчетнаяЗапись, Истина);
	КонецЕсли;
	Если Параметры.ВыборкаУчетнойЗаписи = Неопределено Тогда
		ТекстОшибки = "Ошибка при получении данных справочника учетных записей: незаполнены данные учетной записи";
		Перейти ~НаВыход;
	Иначе
		Выборка = Параметры.ВыборкаУчетнойЗаписи
	КонецЕсли;
	Почта 	= Новый ИнтернетПочта;
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.ИспользоватьSSLIMAP = Выборка.ИспользоватьSSLIMAP;
	Если Профиль.ИспользоватьSSLIMAP Тогда
		Профиль.АдресСервераIMAP 	= Выборка.АдресСервераIMAP;
		Профиль.ПарольIMAP			= Выборка.POP3Password;//Выборка.ПарольIMAP;
		Профиль.ПортIMAP			= Выборка.ПортIMAP;
		Профиль.ПользовательIMAP	= Выборка.POP3User;//Выборка.ПользовательIMAP;
	Иначе
		Профиль.АдресСервераPOP3	= Выборка.POP3Server;
		Профиль.Пользователь		= Выборка.POP3User;
		Профиль.Пароль				= Выборка.POP3Password;
		Профиль.ПортPOP3			= Выборка.POP3Port;
	КонецЕсли;
	Попытка
		Почта.Подключиться(Профиль, ?(Профиль.ИспользоватьSSLIMAP, ПротоколИнтернетПочты.IMAP, ПротоколИнтернетПочты.POP3));
	Исключение
		ТекстОшибки = "Ошибка подключения к почте ПолучитьПочту(), описание ошибки: " + ОписаниеОшибки();
		Перейти ~НаВыход;
	КонецПопытки;
	//Если Профиль.ИспользоватьSSLIMAP Тогда
	//	Почта.ТекущийПочтовыйЯщик = "Inbox";
	//КонецЕсли;
	Результат = Почта.ПолучитьЗаголовки(Параметры.ПараметрыОтбораIMAP);
	Почта.Отключиться();
	
	~НаВыход:

	Если ТекстОшибки <> "" Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(ТекстОшибки, Параметры.ТипСообщенияПриИсключении, Параметры.ПисатьВЖурналТемуПриОшибке);
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьПочту()

Функция ПолучитьПочтуOld(
	АдресСервераPOP3, 
	Пользователь, 
	Пароль, 
	КаталогВыгрузки = "", 
	НеВыгружатьВложения = Ложь
	) Экспорт
	
	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		КаталогВыгрузки = КаталогВременныхФайлов();
	КонецЕсли;
	// Подключение к почте
	Почта = Новый ИнтернетПочта;
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераPOP3 	= АдресСервераPOP3;
	Профиль.Пользователь 		= Пользователь;
	Профиль.Пароль 				= Пароль;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Новый Массив;
	КонецПопытки;
	Заголовки = Почта.ПолучитьЗаголовки();
	Сообщить("В почтовом ящике " + Заголовки.Количество() + " сообщений");
	//  Загрузка сообщений в массив
	МассивСообщений = Почта.Выбрать(Ложь,Заголовки);
	Если НеВыгружатьВложения = ИСТИНА Тогда
	ИНАЧЕ	
		Для Индекс = 0 по МассивСообщений.Количество()-1 Цикл 
			Для каждого Вложения из МассивСообщений[Индекс].Вложения Цикл
				Если Найти(ВРег(Вложения.Имя),"DOC_") > 0 тогда
					Сообщить("В письме № "+(Индекс+1)+" есть файл DOC");
					Попытка
						Вложения.Данные.Записать(КаталогВыгрузки+Вложения.Имя);
					Исключение
						Сообщить("Не удалось записать файл " + Вложения.Имя + " в каталог " + КаталогВыгрузки + " из-за " + ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	// отключение
	Почта.Отключиться();
	Возврат МассивСообщений;
	
КонецФункции

Функция URLEncode(Стр1)
             
    СтрокаСимволов = " @№#%?/$&+";    
	Hex = Новый Массив(16);
	Hex[0]="0";
	Hex[1]="1";
	Hex[2]="2";
	Hex[3]="3";
	Hex[4]="4";
	Hex[5]="5";
	Hex[6]="6";
	Hex[7]="7";
	Hex[8]="8";
	Hex[9]="9";
	Hex[10]="A";
	Hex[11]="B";
	Hex[12]="C";
	Hex[13]="D";
	Hex[14]="E";
	Hex[15]="F";
    Рез = ""; 
    Стр= СокрЛП(Стр1);
    Для Сч=1 По СтрДлина(Стр) Цикл

        Символ = Сред(Стр, Сч, 1);
        КС = КодСимвола(Символ);
        // Перевод из UNICODE в ASCII
        Если ((КС > 1039) И (КС < 1104)) Тогда 
            КС = КС - 848; 
        ИначеЕсли КС = 8470 Тогда 
            КС =  185; 
        ИначеЕсли КС = 1105 Тогда 
            КС =  184; 
        ИначеЕсли КС = 1025 Тогда 
            КС =  168; 
        КонецЕсли; 
    
        флЗаменили = 0;    
        Если Найти(СтрокаСимволов, Символ) > 0 Тогда

            Рез = Рез + "%"+ Hex[Цел(КС/16)] + Hex[Цел(КС%16)];
            флЗаменили = 1;
            
        КонецЕсли;

        Если (КС <= 127) и (флЗаменили = 0) Тогда 
            Рез = Рез + Символ; 
        ИначеЕсли флЗаменили = 0 Тогда
            Рез = Рез + "%"+ Hex[Цел(КС/16)] + Hex[Цел(КС%16)];
        КонецЕсли;
        
    КонецЦикла;

    Возврат Рез;
КонецФункции // URLEncode()  

Функция URI(Строка) Экспорт
	ScrCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrCtrl.Language="JScript";
	Возврат ScrCtrl.eval("var uri='"+Строка+"'; encodeURIComponent(uri);") ;
КонецФункции	
Функция encodeURI(Строка) Экспорт
	ScrCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrCtrl.Language="JScript";
	Возврат ScrCtrl.eval("var uri='"+Строка+"'; encodeURI(uri);") ;
КонецФункции	

Функция escape(Строка) Экспорт
	ScrCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrCtrl.Language="JScript";
	Возврат ScrCtrl.eval("var uri='"+Строка+"'; escape(uri);") ;
КонецФункции	

Функция URLEncode2( value )
    table = "%00%01%02%03%04%05%06%07%08%09%0A%0B%0C%0D%0E%0F%10%11%12%13%14" +
            "%15%16%17%18%19%1A%1B%1C%1D%1E%1F%20%21%22%23%24%25%26%27%28" +
            "%29%2A%2B%2C%2D%2E%2F%30%31%32%33%34%35%36%37%38%39%3A%3B%3C" +
            "%3D%3E%3F%40%41%42%43%44%45%46%47%48%49%4A%4B%4C%4D%4E%4F%50" +
            "%51%52%53%54%55%56%57%58%59%5A%5B%5C%5D%5E%5F%60%61%62%63%64" +
            "%65%66%67%68%69%6A%6B%6C%6D%6E%6F%70%71%72%73%74%75%76%77%78" +
            "%79%7A%7B%7C%7D%7E%7F%80%81%82%83%84%85%86%87%88%89%8A%8B%8C" +
            "%8D%8E%8F%90%91%92%93%94%95%96%97%98%99%9A%9B%9C%9D%9E%9F%A0" +
            "%A1%A2%A3%A4%A5%A6%A7%A8%A9%AA%AB%AC%AD%AE%AF%B0%B1%B2%B3%B4" +
            "%B5%B6%B7%B8%B9%BA%BB%BC%BD%BE%BF%C0%C1%C2%C3%C4%C5%C6%C7%C8" +
            "%C9%CA%CB%CC%CD%CE%CF%D0%D1%D2%D3%D4%D5%D6%D7%D8%D9%DA%DB%DC" +
            "%DD%DE%DF%E0%E1%E2%E3%E4%E5%E6%E7%E8%E9%EA%EB%EC%ED%EE%EF%F0" +
            "%F1%F2%F3%F4%F5%F6%F7%F8%F9%FA%FB%FC%FD%FE%FF";
    
    result = "";        
            
    length = СтрДлина( value );        
    
    Для i = 1 По  length Цикл        
        symbol = Сред( value, i, 1 );        
        code = КодСимвола( symbol );        
        result = result + Сред( table, code*3 + 1, 3 );        
    КонецЦикла;
    
    Возврат result;
КонецФункции

Функция ПолучитьДанныеЗаявкиИзБазы(task_id, Источник = Неопределено,Параметры = Неопределено) Экспорт  
	
	MarkerUsrID = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID");
	Если Источник = Неопределено Тогда
	Иначе
		//
		Если MarkerUsrID = "a19dce94-dd5c-41a0-8bd5-42a2b4b15ca3" Тогда
			Если не уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Тогда
				MarkerUsrID =  "25e80606-f0fb-4071-bace-4cd6a7c95b6b";//Подмена чтобы в других местах не видели телефон
			КонецЕсли;	
		Иначе
		КонецЕсли;	
	КонецЕсли;
	
	ИмяВходящегоФайла = ПолучитьИмяВременногоФайла("htm");
	
	ПараметрыЗапроса = Новый Структура("MarkerUsrID,ИмяВходящегоФайла,task_id",MarkerUsrID,ИмяВходящегоФайла,task_id);
	
	Если НЕ Параметры = Неопределено Тогда
		РезультатИмяФайла	= ?(Параметры.Свойство("КакИмяФайла"),Параметры.КакИмяФайла,Ложь);
		Фоновое	= ?(Параметры.Свойство("Фоновое"),Параметры.Фоновое,Ложь);
	Иначе
		РезультатИмяФайла	= Ложь;
		Фоновое  = Ложь;
	КонецЕсли;
	
	
	Если Фоновое = Истина Тогда
		КлючЗадания = Новый УникальныйИдентификатор();
		Параметры.Вставить("КлючЗадания",КлючЗадания);
		Мас = Новый Массив;
		Мас.Добавить(ПараметрыЗапроса);
		ФоновыеЗадания.Выполнить("уб_ОбменДанными.ЗапросКБазе",Мас,КлючЗадания);
	Иначе	
		ЗапросКБазе(ПараметрыЗапроса);
	КонецЕсли;
	
	
	Если РезультатИмяФайла = Истина Тогда
		Возврат ИмяВходящегоФайла;
	Иначе	
		
		Текст = Новый ТекстовыйДокумент; 
		Текст.Прочитать(ИмяВходящегоФайла); 
		
		Стр = "";
		
		Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
			Стр = Стр + Текст.ПолучитьСтроку(НомерСтроки) + "
			|"; 
		КонецЦикла; 
		
		
		УдалитьФайлы(ИмяВходящегоФайла,);
		
		Возврат Стр;
	КонецЕсли;
	
КонецФункции

Функция ЗапросКБазе(Структура) экспорт
	
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("tmp");
	
	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.ОткрытьФайл(ИмяФайлаОтправки, "UTF-8");
	ОбъектXML.ЗаписатьОбъявлениеXML();
	
	ОбъектXML.ЗаписатьНачалоЭлемента("rq");
	ОбъектXML.ЗаписатьАтрибут("task_id", Формат(Структура.task_id,"ЧГ=0"));
	//ОбъектXML.ЗаписатьАтрибут("hash", "b22be856-b27a-4ee2-beae-2491403c2a85");//УИД ЖЕЛЕЗА ВРЕМЕННЫЙ!!!
	//ОбъектXML.ЗаписатьАтрибут("hash", ПараметрыСеанса.уб_Константы.SID);
	ОбъектXML.ЗаписатьАтрибут("hash", уб_КЭШируемые.SID());
	
	ОбъектXML.ЗаписатьАтрибут("uid", Структура.MarkerUsrID);
	ОбъектXML.ЗаписатьАтрибут("sessid", "");
	ОбъектXML.ЗаписатьАтрибут("comp_name", ИмяКомпьютера());
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьБезОбработки("");
	ОбъектXML.Закрыть();
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
	
	Сервер = "www.sluice";
	Порт = 80 ;
	
	HTTP = Новый HTTPСоединение(Сервер, Порт);
	
	Попытка
		HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, "", Структура.ИмяВходящегоФайла, ЗаголовокHTTP);
	Исключение
		УдалитьФайлы(ИмяФайлаОтправки,);
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаОтправки,);
	
КонецФункции

Процедура ОбработатьПолучитьДанныеЗаявкиИзБазы(НомерЗаявки,Владелец = Неопределено,Элемент=Неопределено) Экспорт
	
	
	_НомерЗаявкиПодходит = Типзнч(НомерЗаявки) = Тип("Число");
	Если _НомерЗаявкиПодходит = ЛОЖЬ Тогда
		Сообщение = "Номер заявки не число!"; 
		Состояние_(Сообщение,2000);
		Если (ТипЗнч(Элемент) = Тип("Кнопка")) Тогда
			Элемент.Подсказка = Сообщение;
		КонецЕсли;
		Возврат;
	КонецЕсли;	
	Если Элемент = Неопределено Тогда
		Источник = Неопределено;
	Иначе
		 Попытка
		 	Источник = Элемент.Имя;
		 Исключение
			Источник = Неопределено;
		 КонецПопытки;
	КонецЕсли;	
		
		
	ДоступенШлюзCRM = ПараметрыСеанса.уб_ВнешниеСервисы.ДоступенШлюзCRM;
	Если Не ДоступенШлюзCRM Тогда
		Сообщение = "Шлюз CRM не доступен!";
		Состояние_(Сообщение,2000);
		Если (ТипЗнч(Элемент) = Тип("Кнопка")) Тогда
			Элемент.Подсказка = Сообщение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Состояние_("Получение данных из базы.");
	ТекстHtml = ПолучитьДанныеЗаявкиИзБазы(НомерЗаявки,Источник);
	Если НЕ ТекстHtml = "" Тогда
		Если Владелец = Неопределено Тогда
			Браузер = ПолучитьОбщуюФорму("уб_Браузер", ,);	
		Иначе
			Браузер = ПолучитьОбщуюФорму("уб_Браузер", Владелец ,);	
		КонецЕсли;	
		Если Браузер.Открыта() Тогда
			Браузер.Активизировать();
		Иначе	
			Браузер.Открыть();
		КонецЕсли;
		Браузер.Заголовок = "Данные заявки №" + НомерЗаявки + " из базы ";
		Браузер.ЭлементыФормы.ПолеHTMLДокумента.УстановитьТекст(ТекстHtml);
	Конецесли;
	Сообщение = "Показать данные из базы по заявке";
    Если (ТипЗнч(Элемент) = Тип("Кнопка")) Тогда
		Элемент.Подсказка = Сообщение;
	КонецЕсли;

КонецПроцедуры	

Функция ПолучитьСтатистикуИзБазы(dateStart,dateEnd) Экспорт
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("tmp");
	
	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.ОткрытьФайл(ИмяФайлаОтправки, "UTF-8");
	ОбъектXML.ЗаписатьОбъявлениеXML();
	
	ОбъектXML.ЗаписатьНачалоЭлемента("rq");
	
	//ОбъектXML.ЗаписатьАтрибут("hash", "b22be856-b27a-4ee2-beae-2491403c2a85");//УИД ЖЕЛЕЗА ВРЕМЕННЫЙ!!!
	ОбъектXML.ЗаписатьАтрибут("type","stat");
	ОбъектXML.ЗаписатьАтрибут("dateStart",Строка(dateStart));
	ОбъектXML.ЗаписатьАтрибут("dateEnd",Строка(dateEnd));
	
	ОбъектXML.ЗаписатьАтрибут("hash", уб_КЭШируемые.SID());
	ОбъектXML.ЗаписатьАтрибут("uid", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID"));
	ОбъектXML.ЗаписатьАтрибут("sessid", "");
	ОбъектXML.ЗаписатьАтрибут("comp_name", ИмяКомпьютера());
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьБезОбработки("");
	ОбъектXML.Закрыть();
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
	
	Сервер = "www.sluice";
	Порт = 80 ;
	
	HTTP = Новый HTTPСоединение(Сервер, Порт);
	
	ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("tmp");
	Попытка
		HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, "", ИмяПолученногоФайла, ЗаголовокHTTP);
	Исключение
		УдалитьФайлы(ИмяФайлаОтправки,);
		
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
	КонецПопытки;
	
	Текст = Новый ТекстовыйДокумент; 
	Текст.Прочитать(ИмяПолученногоФайла); 
	
	//Стр = "";
	//
	//Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
	//	Стр = Стр + Текст.ПолучитьСтроку(НомерСтроки) + "
	//	|"; 
	//КонецЦикла; 
	
	УдалитьФайлы(ИмяФайлаОтправки,);
	УдалитьФайлы(ИмяПолученногоФайла,);
	
	Возврат Текст;
	
КонецФункции

//Сервисная для ПолучитьДанныеЗаявкиИзБазы
Функция СформироватьТекстОшибки (ОписаниеОшибки)
	
	Если Найти(ОписаниеОшибки,"Couldn't resolve host name")>0 Тогда
		Возврат "Не известен адрес шлюза. Невозможно получить внешние данные по заявке.";
	Иначе
		Возврат ОписаниеОшибки;
	КонецЕсли;	
	
КонецФункции	
