Перем мОснование;

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|   и Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";	
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		ОсновнойДоговорКонтрагента = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(Наименование,"¶")>0 Тогда
		Наименование = СтрЗаменить(Наименование,"¶"," ");
		Наименование = СтрЗаменить(Наименование,"  "," ");//двойной пробел
	КонецЕсли;	
	Если ПустаяСтрока(НаименованиеКраткое) Тогда
		НаименованиеКраткое = Наименование;
	КонецЕсли;	
	//Наименование = Уб_temp.УбратьСимволы(Наименование,"","""”„“‟¶'«»‹›〝〟〞＂:;,")//из заявки

	
	//Проверка уникальности страхователя - физлица
	Если Не ПометкаУдаления И ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	К.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК К
		|ГДЕ
		|	К.Наименование = &ФИО
		|	И К.ДатаРождения = &ДР
		|	И К.Ссылка <> &Ссылка
		|	И К.ПометкаУдаления <> ИСТИНА";
		Запрос.УстановитьПараметр("ФИО", 	Наименование);
		Запрос.УстановитьПараметр("ДР", 	ДатаРождения);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			#Если Клиент Тогда
			Отказ = Истина;
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
				сДР = "(c пустой датой рождения)";
			Иначе
				сДР = "(ДР: " + Формат(ДатаРождения,"ДФ=dd.MM.yyyy") + ")";
			КонецЕсли; 
			Предупреждение("Контрагент - физ.лицо '" + Наименование + "' " + сДР 
				+ " уже присутствует в справочнике!
				|(Код: " + Строка(Выборка.Контрагент.Код) + ", группа '" 
				+ ПолучитьПутьКЭлементу(Выборка.Контрагент) + "')"); 
			#КонецЕсли	
			Возврат;	
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда
		ГоловнойКонтрагентКонтрагента = ГоловнойКонтрагент.ГоловнойКонтрагент;
		Если ЗначениеЗаполнено(ГоловнойКонтрагентКонтрагента) И ГоловнойКонтрагентКонтрагента <> ГоловнойКонтрагент Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Контрагент "+СокрЛП(ГоловнойКонтрагент)+ " не может быть выбран головным,
				|так как для него уже был назначен головной контрагент " + СокрЛП(ГоловнойКонтрагентКонтрагента) + "!", "Предупреждение");
			//ОбщегоНазначения.СообщитьОбОшибке("Контрагент "+СокрЛП(ГоловнойКонтрагент)+" не может быть выбран головным, 
			//				|так как для него уже был назначен головной контрагент "+СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)+"!");
			Отказ = Истина;
		ИначеЕсли Не Ссылка.Пустая() Тогда
			// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
			// в качестве головного у другого контрагента.
			ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
			Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
				СообщениеОНевозможностиЗаписи = "Контрагент "+СокрЛП(ЭтотОбъект)+" не может иметь головного контрагента!
												|Этот контрагент уже установлен головным для: ";
				Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
					СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
				КонецЦикла;
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СообщениеОНевозможностиЗаписи,"Предупреждение");
				//ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не Отказ Тогда
		уб_СС.ОтметитьФактМодификации(ЭтотОбъект)
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

Функция ПолучитьПутьКЭлементу(оКонтрагент, СтрокаПути = "")
	
	оРодитель = оКонтрагент.Родитель;
	Если ЗначениеЗаполнено(оРодитель) Тогда
		СтрокаПути = оРодитель.Наименование + (?(СтрокаПути = "",""," > ")) + СтрокаПути; 
		Результат = ПолучитьПутьКЭлементу(оРодитель, СтрокаПути)
	Иначе
		Результат = СтрокаПути;
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Перечисления.ЮрФизЛицо.ЮрЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КПП                    = Основание.КПП;
		КодПоОКПО              = Основание.КодПоОКПО;
		мОснование             = Основание;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактныеЛица.Ссылка КАК КонтЛицо
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &Ссылка
		|	И КонтактныеЛица.ПометкаУдаления <> &ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
		Запрос.УстановитьПараметр("ПометкаУдаления",    ПометкаУдаления);
		ВыборкаКонтЛиц = Запрос.Выполнить().Выбрать();
		Пока ВыборкаКонтЛиц.Следующий() Цикл
			Попытка
				КонтЛицо = ВыборкаКонтЛиц.КонтЛицо.ПолучитьОбъект();
				КонтЛицо.УстановитьПометкуУдаления(ПометкаУдаления);
				КонтЛицо.Записать();
			Исключение
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ПриЗаписи() Контрагенты: Описание ошибки: " + ОписаниеОшибки(), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



