Процедура ОбработатьФайлыКПолису(
	ДатаНачалаПроверки 	= '00010101', 
	ОтправлятьВОтделБСО = Ложь
	) Экспорт

	ТекстОшибки = "";
	ImageResize = Обработки.уб_ImageResize.Создать();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ф.*
	|ИЗ
	|	РегистрСведений.уб_ФайлыКПолисам КАК Ф
	|ГДЕ
	|	НЕ Ф.Обработан
	|	И Ф.ФайлРасширение <> ""pdf""
	|	И ВЫРАЗИТЬ(Ф.СтраховойПолис КАК Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста) ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ф.УИД");
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда
		Запрос.Текст = ЗапросОбработатьФайлыКПолису();
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	МассивТолькоЧтение = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЭтоИзображение(Выборка.ФайлРасширение) Тогда 
			Обработки.уб_ImageResize.Создать().ImageResize(Выборка, ТекстОшибки, МассивТолькоЧтение, ДатаНачалаПроверки);
		КонецЕсли;
	КонецЦикла;
	Если МассивТолькоЧтение.Количество() > 0 Тогда
		Если Не уб_СЕРВЕРные.УбратьТолькоЧтениеФайла(МассивТолькоЧтение, Ложь) Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("уб_МодульРегламентныхЗаданий.ОбработкаФайловКПолису(): Не убран атрибут только чтение у файлов", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
		Параметры.Получатели	= ПараметрыСеанса.уб_Константы.АдресДоставкиЛога;
		Параметры.Тема			= "1С:РЗ: Обновление файлов к полису" + Формат(ТекущаяДата());
		Параметры.Сообщение		= ТекстОшибки;
		Если ОтправлятьВОтделБСО И ПараметрыСеанса.уб_Константы.ЭтоРабочаяБаза = Истина Тогда
			РуководительБСО = уб_КЭШируемые.ПолучитьМОЛпоБСО(ПараметрыСеанса.уб_Константы.уб_ОсновноеПодразделениеПоУчетуБСО);
			Если ЗначениеЗаполнено(РуководительБСО) Тогда
				ЭлПочта = уб_temp.КонтактнаяИнформация(РуководительБСО, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				Если Не ПустаяСтрока(ЭлПочта) Тогда
					Параметры.Получатели = Параметры.Получатели + "," + ЭлПочта
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		уб_ОбменДанными.SendMail(Параметры);
	КонецЕсли;

КонецПроцедуры

//чкн
Функция ЗапросОбработатьФайлыКПолису()
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	уб_ФайлыКПолисам.Ссылка КАК УИД,
	        |	уб_ФайлыКПолисам.ДатаПубликации,
	        |	уб_ФайлыКПолисам.ПутьКПапке,
	        |	уб_ФайлыКПолисам.Хранилище,
	        |	уб_ФайлыКПолисам.Обработан,
	        |	уб_ФайлыКПолисам.ФайлРазмер,
	        |	уб_ФайлыКПолисам.ФайлРасширение,
	        |	уб_ФайлыКПолисам.ФайлИмя
	        |ИЗ
	        |	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	        |ГДЕ
	        |	уб_ФайлыКПолисам.Архив = ЛОЖЬ
	        |	И уб_ФайлыКПолисам.ФайлРасширение <> ""pdf""
	        |	И уб_ФайлыКПолисам.Обработан = ЛОЖЬ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	УИД";
КонецФункции
		
Функция ЭтоИзображение(ФайлРасширение)	
	Индекс = 1;
	Для Индекс = 1 По СтрДлина(ФайлРасширение) Цикл
		Если Сред(ФайлРасширение, Индекс, 1) <> "." Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Расширение = Сред(ФайлРасширение, Индекс);
	СписокРасширений = Новый СписокЗначений;
	СписокРасширений.Добавить("bmp");
	СписокРасширений.Добавить("dib");
	СписокРасширений.Добавить("rle");
	СписокРасширений.Добавить("jpg");
	СписокРасширений.Добавить("jpeg");
	СписокРасширений.Добавить("jfif");
	СписокРасширений.Добавить("webp");	
	СписокРасширений.Добавить("tif");
	СписокРасширений.Добавить("gif");
	СписокРасширений.Добавить("png");
	СписокРасширений.Добавить("wmf");
	СписокРасширений.Добавить("emf");
	Возврат СписокРасширений.НайтиПоЗначению(НРег(Расширение)) <> Неопределено;
	
КонецФункции
		
//чкн



Функция ПроверитьОбновитьКоличествоПолисов(КоличествоПолисов = 100) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	               |	уб_СтраховойПолис.Ссылка
	               |ИЗ
	               |	Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	               |ГДЕ
	               |	уб_СтраховойПолис.Модификатор <> ЗНАЧЕНИЕ(Справочник.Пользователи.robot)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уб_СтраховойПолис.ДатаИзменения УБЫВ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВЫБРАТЬ ПЕРВЫЕ 100","ВЫБРАТЬ ПЕРВЫЕ "+Формат(КоличествоПолисов,"ЧГ="));			   
	Счетчик = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока  Выборка.Следующий() Цикл
		
		ОБПолиса = Выборка.Ссылка.ПолучитьОбъект();
		КоличествоФайловКПолису = ОБПолиса.ПолучитьКоличествоФайловКПолису();
		флЕстьИзменения = Ложь;
		Если КоличествоФайловКПолису = ОБПолиса.КоличествоФайловB2B Тогда
		Иначе
			ОБПолиса.КоличествоФайловB2B =  КоличествоФайловКПолису;
			флЕстьИзменения = Истина;
		КонецЕсли;	
		Если флЕстьИзменения Тогда
			Счетчик = Счетчик+1;
			ОБПолиса.МодиФикатор   = Справочники.Пользователи.Robot;
			ОБПолиса.ДатаИзменения = ТекущаяДата(); 
			ОБПолиса.ОбменДанными.Загрузка = Истина;
			ОБПолиса.Записать();
		КонецЕсли;		
	КонецЦикла; 
	Возврат  Счетчик;
		
	
	
КонецФункции	
	