Функция Обновить(РежимОтладки = Ложь) Экспорт
	
	
	Сервер        = "osago.app";
	Ресурс       = "/rest/rest1c";
	
	HTTPСоединение = Новый  HttpСоединение(Сервер,80,,,,30,);
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPЗапрос.Заголовки.Вставить("Authorization","Basic ****");
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
    HTTPЗапрос.Заголовки.Вставить("Accept",       "application/json");
    HTTPЗапрос.Заголовки.Вставить("Connection",   "Keep-Alive");
	
	
	ТелоЗапроса = Новый Структура();
	ТелоЗапроса.Вставить("login","qScRflR@s");
	ТелоЗапроса.Вставить("password","mFnb%Fvht$$f");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "", Истина));
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.Авто);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	Результат    = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	
	
	Если Результат.КодСостояния = 200 Тогда
		//ДД = Результат.ПолучитьТелоКакДвоичныеДанные();
		//ДД.Записать("D:\!1C\маркимодели.txt");
		ОтветСтрокой = Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		
		Если РежимОтладки = Истина Тогда
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(ОтветСтрокой);
			ТекстовыйДокумент.Записать("D:\!1C\маркимодели0.txt");
		КонецЕсли;
	
		//ОтветСтрокой = СтрЗаменить(ОтветСтрокой,"\\","\");
		//ОтветСтрокой = СтрЗаменить(ОтветСтрокой,"\/","/");
		//ОтветСтрокой = СтрЗаменить(ОтветСтрокой,"\""","""");
		//ОтветСтрокой = СтрЗаменить(ОтветСтрокой,"""[","[");
		//ОтветСтрокой = СтрЗаменить(ОтветСтрокой,"]""","]");
		
		
	Иначе	
		ОтветСтрокой = Результат.ПолучитьТелоКакСтроку();
		Сообщить(ОтветСтрокой);
		Возврат  Истина;
	КонецЕсли;	
	//
	Если РежимОтладки = Истина Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ОтветСтрокой);
		ТекстовыйДокумент.Записать("D:\!1C\маркимодели.txt");
	КонецЕсли;
	//Для Счетчик = 1 по ТекстовыйДокумент.КоличествоСтрок() Цикл
	//	ТекущаяСтрока = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
	//	//Сообщить(ТекущаяСТрока);
	//КонецЦикла;	
	
	                         
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON,Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	//Возврат ЛОЖЬ;
	
	ОбработатьДанные(Данные,Истина);
	
	Возврат  Истина;
КонецФункции	


Процедура ОбработатьДанные(Данные,УдалятьНеиспользуемые = Истина)
	
	Если НЕ ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Сообщить("Обновление марок не выполнено: данные не массив");
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_МаркиТС.Ссылка,
	               |	уб_МаркиТС.ПометкаУдаления КАК ПометкаУдаления,
	               |	уб_МаркиТС.Неактуальная КАК Неактуальная,
	               |	уб_МаркиТС.Наименование,
	               |	ЛОЖЬ КАК Найдена
	               |ИЗ
	               |	Справочник.уб_МаркиТС КАК уб_МаркиТС
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПометкаУдаления,
	               |	Неактуальная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уб_МоделиТС.Ссылка,
	               |	уб_МоделиТС.ПометкаУдаления КАК ПометкаУдаления,
	               |	уб_МоделиТС.Наименование,
	               |	ЛОЖЬ КАК Найдена,
	               |	уб_МоделиТС.Владелец
	               |ИЗ
	               |	Справочник.уб_МоделиТС КАК уб_МоделиТС
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПометкаУдаления";
	Пакет = Запрос.ВыполнитьПакет();
	ТаблицаМарок = Пакет[0].Выгрузить();
	ТаблицаМарок.Индексы.Добавить("Наименование");
	ТаблицаМоделей = Пакет[1].Выгрузить();
	ТаблицаМоделей.Индексы.Добавить("Наименование");
	ТаблицаМоделей.Индексы.Добавить("Владелец");	
	ДлинаНаименованияМодели = 30;
	Для каждого СтрокаМарки из данные Цикл
		МаркаНайдена = Ложь;
		нСтроки = ТаблицаМарок.НайтиСтроки(Новый Структура("Наименование",СтрокаМарки.Ключ));
		Для каждого НайденаяСтрока из нСтроки Цикл
			МаркаНайдена = Истина;
			НайденаяСтрока.Найдена = Истина;
						
			//Последующие удаляем
			Прервать;
		КонецЦикла;	
		
		Если МаркаНайдена = Ложь Тогда
			ОбъектМарки = Справочники.уб_МаркиТС.СоздатьЭлемент();
			ОбъектМарки.Наименование = СтрокаМарки.Ключ;
			ОбъектМарки.Записать();
			
			НайденаяСтрока = ТаблицаМарок.Добавить();
			ЗаполнитьЗначенияСвойств(НайденаяСтрока,ОбъектМарки);
			НайденаяСтрока.Найдена = Истина;
		КонецЕсли;	
		
		
		Если ТипЗнч(СтрокаМарки.Значение) = Тип("Массив") Тогда
			
			Для каждого ТекущаяМодель из СтрокаМарки.Значение Цикл
				МодельНайдена= Ложь;
				нСтрокиМодели = ТаблицаМоделей.НайтиСтроки(Новый Структура("Наименование,Владелец",Лев(ТекущаяМодель,ДлинаНаименованияМодели),НайденаяСтрока.Ссылка));
				Для каждого НайденаяСтрокаМодели из нСтрокиМодели Цикл
					НайденаяСтрокаМодели.Найдена = Истина;
					МодельНайдена = Истина;
					//Последующие удаляем
					Прервать
				КонецЦикла;	
				Если МодельНайдена = Ложь Тогда
					ОбъектМодели = Справочники.уб_МоделиТС.СоздатьЭлемент();
					ОбъектМодели.Наименование = ТекущаяМодель;
					ОбъектМодели.Владелец = НайденаяСтрока.Ссылка;
					ОбъектМодели.Записать();
					
					НайденаяСтрокаМодели = ТаблицаМоделей.Добавить();
					ЗаполнитьЗначенияСвойств(НайденаяСтрокаМодели,ОбъектМодели);
					НайденаяСтрокаМодели.Найдена = Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого Строка из ТаблицаМарок Цикл
		Если СТрока.Найдена = ЛОЖЬ И Строка.ПометкаУдаления = ЛОЖЬ и Строка.Неактуальная = ЛОЖЬ Тогда
			ОбъектМарки = Строка.Ссылка.ПолучитьОбъект();
			ОбъектМарки.ПометкаУдаления = Истина;
			ОбъектМарки.Неактуальная = Истина;
			ОбъектМарки.Записать();
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого Строка из ТаблицаМоделей Цикл
		Если СТрока.Найдена = ЛОЖЬ И Строка.ПометкаУдаления = ЛОЖЬ Тогда
			ОбъектМарки = Строка.Ссылка.ПолучитьОбъект();
			ОбъектМарки.ПометкаУдаления = Истина;
			ОбъектМарки.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

//Обновить();