
Функция ЗаполнитьНомерные(Параметры) Экспорт
	//---------------------------------------
	//  Заполним БСО номерного учета
	//---------------------------------------
	
	Запрос = Новый Запрос;
				   
	ТекстЗапроса = "ВЫБРАТЬ
	|	СП.СК,
	|	СП.ВидБСО,
	|	СП.Поставщик,
	|	СП.ОрганизацияАгент,
	|	СП.НомерБСО,
	|	СП.СостояниеБСО как УстановитьСостояниеБСО,
	|	СП.ПоложениеБСО как УстановитьПоложениеБСО,
	|	Выбор Когда &НеИспользоватьБлокировкиБСО = Истина Тогда Ложь Иначе ЕСТЬNULL(уб_БлокировкаБСОСрезПоследних.Блокировка, ЛОЖЬ) Конец КАК Блокировка,
	|	СП.Агент,
	//|	СП.Подразделение,
	|	Истина КАК Наличие,
	|   РазностьДат(СП.Период,&ПериодДата,ДЕНЬ) как Срок,
	|   СП.Заявка как Заявка
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&Период, Истина ";
	Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО", 	ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина);
	Запрос.УстановитьПараметр("Период", 						Параметры.МоментВремени);
	Запрос.УстановитьПараметр("ПериодДата",					    Параметры.Дата);
	
	Если НЕ ЗначениеНеЗаполнено(Параметры.СК) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СК = &СК";
		Запрос.УстановитьПараметр("СК", Параметры.СК);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " И Подтверждено ) КАК СП ";//И ДокПроведен
	ТекстЗапроса = ТекстЗапроса + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
	|				&Период,";
	Если НЕ ЗначениеНеЗаполнено(Параметры.СК) Тогда
		ТекстЗапроса = ТекстЗапроса + " СК = &СК ";		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ") КАК уб_БлокировкаБСОСрезПоследних
	|		ПО СП.ВидБСО = уб_БлокировкаБСОСрезПоследних.ВидБСО
	|			И СП.СК = уб_БлокировкаБСОСрезПоследних.СК
	|			И СП.НомерБСО = уб_БлокировкаБСОСрезПоследних.НомерБСО";
	
	ТекстЗапроса = ТекстЗапроса + " 
	|ГДЕ ИСТИНА ";
	
	Если НЕ ЗначениеНеЗаполнено(Параметры.Поставщик) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СП.Поставщик = &Поставщик";
		Запрос.УстановитьПараметр("Поставщик", Параметры.Поставщик);
	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(Параметры.ОрганизацияАгент) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СП.ОрганизацияАгент = &ОрганизацияАгент";
		Запрос.УстановитьПараметр("ОрганизацияАгент", Параметры.ОрганизацияАгент);
	КонецЕсли;		
	
	
	
	оПП = Перечисления.уб_ПоложенияБСО;		   
	зП_ПереданВСК = оПП.ПереданВСК;
	зП_Списан = оПП.Списан;
	зП_ОтданКлиенту = оПП.ОтданКлиенту;
	зП_ОтданБанку = оПП.ОтданБанку;
	оПС = Перечисления.уб_СостоянияБСО;		   
	зС_Утрачен = оПС.Утрачен;
	зС_Украден = оПС.Украден;
	зС_Уничтожен = оПС.Уничтожен;
	
				   
	Если НЕ Параметры.ДобавлятьВсе Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|	И СП.ПоложениеБСО <> &ПереданВСК
			|	И СП.ПоложениеБСО <> &Списан
			|	И СП.ПоложениеБСО <> &ОтданКлиенту
			|	И СП.ПоложениеБСО <> &ОтданБанку
			|	И СП.СостояниеБСО <> &Утрачен
			|	И СП.СостояниеБСО <> &Украден
			|	И СП.СостояниеБСО <> &Уничтожен	";
		
		Запрос.УстановитьПараметр("ПереданВСК", зП_ПереданВСК);
		Запрос.УстановитьПараметр("Списан", зП_Списан);
		Запрос.УстановитьПараметр("ОтданКлиенту", зП_ОтданКлиенту);
		Запрос.УстановитьПараметр("ОтданБанку", зП_ОтданБанку);
		Запрос.УстановитьПараметр("Утрачен", зС_Утрачен);
		Запрос.УстановитьПараметр("Украден", зС_Украден);
		Запрос.УстановитьПараметр("Уничтожен", зС_Уничтожен);

	КонецЕсли;
	
	Если НЕ ЗначениеНеЗаполнено(Параметры.Агент) Тогда
		ТекстЗапроса = ТекстЗапроса + " И Агент = &Агент";
		Запрос.УстановитьПараметр("Агент", Параметры.Агент);
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса+" Упорядочить по СП.Поставщик,СП.ВидБСО,СП.НомерБСО";
	Запрос.Текст = ТекстЗапроса;			   
				   
	
	Результат = Запрос.Выполнить();
	ПромежуточнаяТаблица = Результат.Выгрузить();
	
	Если Параметры.ДобавлятьВсе Тогда
		Для каждого СтрПТ из ПромежуточнаяТаблица Цикл 
			зП = СтрПТ.УстановитьПоложениеБСО;
			зС = СтрПТ.УстановитьСостояниеБСО;
			
			Если зП = зП_ПереданВСК
				ИЛИ зП = зП_Списан
				ИЛИ зП = зП_ОтданКлиенту
				ИЛИ зП = зП_ОтданБанку
				ИЛИ зС = зС_Утрачен
				ИЛИ зС = зС_Украден
				ИЛИ зС = зС_Уничтожен 
				Тогда
				СтрПТ.Наличие = Ложь;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	Возврат ПромежуточнаяТаблица;
КонецФункции	

Процедура АнализЛимитов(ПриОткрытии =Ложь,ТаблицаБСО,ТаблицаЛимитов,ТолькоПросмотр)  Экспорт
	
	Если ТипЗнч(ТаблицаБСО) = Тип("ТаблицаЗначений") Тогда
		ВидыБСо = ТаблицаБСО.Скопировать();
		Заявки = ТаблицаБСО.Скопировать();
	Иначе	
		ВидыБСо = ТаблицаБСО.Выгрузить();
		Заявки = ТаблицаБСО.Выгрузить();
	КонецЕсли;	
	ВидыБСо.Свернуть("ВидБСО");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ВидыБСО.Ссылка как ВидБСО,
	|	МАКСИМУМ(ЕСТЬNULL(уб_СтраховыеПродуктыВидыБСО.Ссылка.Вид, ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.ПустаяСсылка))) КАК ВидСП
	|ИЗ
	|	Справочник.уб_ВидыБСО КАК уб_ВидыБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уб_СтраховыеПродукты.ВидыБСО КАК уб_СтраховыеПродуктыВидыБСО
	|		ПО (уб_СтраховыеПродуктыВидыБСО.ВидБСО = уб_ВидыБСО.Ссылка)
	|			И (уб_СтраховыеПродуктыВидыБСО.ВидБСО.Тип В (ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.Полис), ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.ПолисОсаго)))
	|ГДЕ
	|	уб_ВидыБСО.Ссылка В(&ВидБСО)
	|
	|СГРУППИРОВАТЬ ПО
	|	уб_ВидыБСО.Ссылка";
	Запрос.УстановитьПараметр("ВидБСО",ВидыБСО.ВыгрузитьКолонку("ВидБСО"));
	
	ВидыСП = Запрос.Выполнить().Выгрузить();
	
	Заявки.Свернуть("Заявка");
	
	
	СуммыЗаявок = СуммыЗаявок(Заявки.ВыгрузитьКолонку("Заявка"));
	
	Для каждого Лимит из ТаблицаЛимитов Цикл
		Лимит.КоличествоФакт = 0;
		Лимит.СуммаФакт      = 0;
	КонецЦикла;	
	
	ФлЕстьПравки  = Ложь;
	_СтраховаяПремия = 0;
	Для каждого СтрокаБСО из ТаблицаБСО Цикл
		_СтрокаБСО = ВРЕГ(СтрокаБСО.ВидБСО);
		
		
		нСтроки = ВидыСП.НайтиСтроки(Новый Структура("ВидБСО",СтрокаБСО.ВидБСО));
		Если нСтроки.Количество()>0 Тогда				
			ВидСП = нСтроки[0].ВидСП;
		Иначе
			ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка();
		КонецЕсли;

		ЕСли Найти(_СтрокаБСО,"КАСКО")>0 Тогда
		    _ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО;
		ИначеЕсли Найти(_СтрокаБСО,"ОСАГО")>0 Тогда
			_ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО;
		ИначеЕсли Найти(_СтрокаБСО,"КВАРТИРА")>0 Тогда
			_ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.Имущество;
		ИначеЕсли Найти(_СтрокаБСО,"ДМС")>0 Тогда
			_ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДМС;
		ИначеЕсли Найти(_СтрокаБСО,"ВЗР")>0 Тогда
			_ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР;
		ИначеЕсли Найти(_СтрокаБСО,"САГО")>0 Тогда
			_ПриведенныйСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДСАГО;
		Иначе	
			_ПриведенныйСП = ВидСП;
		КонецЕсли;	
		
		Если ВидСП<>_ПриведенныйСП Тогда
			Сообщить("Неверно определен вид СП для "+СтрокаБСО.ВидБСО+": "+СтрокаБСО.НомерБСО+" ("+ВидСП+") проверьте страховые продукты!");
			ВидСП = _ПриведенныйСП;
		КонецЕсли;
		
		
				
			
		Для каждого Лимит из ТаблицаЛимитов Цикл
			Если ВидСП = Лимит.Вид Тогда
				Лимит.КоличествоФакт = Лимит.КоличествоФакт+1;
				ФлЕстьПравки = Истина;
				Прервать;
			Конецесли;
		КонецЦикла;	
		
		
		Остаток = ОстатокЗаявки(СуммыЗаявок,СтрокаБСО);
		Если ТолькоПросмотр= ложь и ПриОткрытии = Ложь Тогда
			СтрокаБСО.СтраховаяПремия = Остаток;
		КонецЕсли;
		
		
		Для каждого Лимит из ТаблицаЛимитов Цикл
			Если ВидСП = Лимит.Вид Тогда
				
				Если Остаток<>0 Тогда
					ФлЕстьПравки = Истина;
				КонецЕсли;
				_СтраховаяПремия =_СтраховаяПремия+Остаток;
				Лимит.СуммаФакт = Лимит.СуммаФакт+Остаток;
				
				Если Лимит.ДнейФакт < СтрокаБСО.Срок Тогда
					Лимит.ДнейФакт = СтрокаБСО.Срок;
					ФлЕстьПравки = Истина;
				КонецЕсли;	
				Прервать;
			Конецесли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Если ТаблицаЛимитов.Количество()> 5 и ФлЕстьПравки = Истина Тогда
		ТаблицаЛимитов.Сортировать("КоличествоФакт убыв,Вид");
	КонецЕсли;
    //Сообщить("В лимитах найдено "+_СтраховаяПремия  + " из "+СтраховаяПремия);
	
КонецПроцедуры

Функция СуммаПоНомеру(НомерБСО,СК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(уб_ОплатаПолисов.НачисленнаяСуммаВзноса), 0) КАК НачисленнаяСуммаВзноса
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	               |ГДЕ
	               |	уб_ОплатаПолисов.СтраховойПолис В
	               |			(ВЫБРАТЬ
	               |				уб_СтраховойПолисБСО.Ссылка
	               |			ИЗ
	               |				Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	               |			ГДЕ
	               |				уб_СтраховойПолисБСО.НомерБСО = &НомерБСО
	               |				И уб_СтраховойПолисБСО.Ссылка.СК = &СК)
	               |	И уб_ОплатаПолисов.Проведен
	               |	И уб_ОплатаПолисов.ОплаченоФакт > 0";
				   Запрос.УстановитьПараметр("СК",СК);
				   Запрос.УстановитьПараметр("НомерБСО",НомерБСО);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		_Сумма = Выборка.НачисленнаяСуммаВзноса;
	Иначе
		_Сумма = 0;
	КонецЕсли;	
	Возврат _Сумма;
КонецФункции	

Функция СуммыЗаявок(Заявки) Экспорт
	Запрос = Новый Запрос;
	Текст = "ВЫБРАТЬ
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСуммаВзноса,
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВидБСО
	        |ПОМЕСТИТЬ СтоимостьЗаявок0
	        |ИЗ
	        |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.БСО КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	        |ГДЕ
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Заявка)
	        |	И уб_ЗаявкаНаЗаказВыездногоСпециалиста.УидРодителя = """"
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	        |	СУММА(уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСуммаВзноса) КАК ИтогСуммаВзноса,
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВидБСО
	        |ПОМЕСТИТЬ СтоимостьЗаявок
	        |ИЗ
	        |	СтоимостьЗаявок0 КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	        |ГДЕ
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Заявка)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	        |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ВидБСО
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтоимостьЗаявок.Ссылка КАК Заявка,
	        |	СтоимостьЗаявок.ИтогСуммаВзноса КАК Взнос,
	        |	ЕСТЬNULL(Влож.Сумма, 0) КАК Сдано,
	        |	ВЫБОР
	        |		КОГДА Влож.Сумма > СтоимостьЗаявок.ИтогСуммаВзноса
	        |			ТОГДА 0
	        |		ИНАЧЕ СтоимостьЗаявок.ИтогСуммаВзноса - ЕСТЬNULL(Влож.Сумма, 0)
	        |	КОНЕЦ КАК Остаток,
	        |	0 КАК Учтено,
	        |	СтоимостьЗаявок.ВидБСО
	        |ИЗ
	        |	СтоимостьЗаявок КАК СтоимостьЗаявок
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			уб_ПриемкаОплатПолисы.Заявка КАК Заявка,
	        |			СУММА(уб_ПриемкаОплатПолисы.Сумма) КАК Сумма,
	        |			уб_ПриемкаОплатПолисы.ВидБСО КАК ВидБСО
	        |		ИЗ
	        |			Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	        |		ГДЕ
	        |			уб_ПриемкаОплатПолисы.Ссылка.ПометкаУдаления = ЛОЖЬ
	        |			И уб_ПриемкаОплатПолисы.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПУстаяСсылка)
	        |			И уб_ПриемкаОплатПолисы.Заявка В(&Заявка)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			уб_ПриемкаОплатПолисы.Заявка,
	        |			уб_ПриемкаОплатПолисы.ВидБСО) КАК Влож
	        |		ПО СтоимостьЗаявок.Ссылка = Влож.Заявка
	        |			И СтоимостьЗаявок.ВидБСО = Влож.ВидБСО";
	//Без Видов
	Текст0 = "ВЫБРАТЬ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка,
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.ИтогСуммаВзноса
	               |ПОМЕСТИТЬ СтоимостьЗаявок
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |ГДЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка В(&Заявка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтоимостьЗаявок.Ссылка КАК Заявка,
	               |	СтоимостьЗаявок.ИтогСуммаВзноса КАК Взнос,
	               |	ЕСТЬNULL(Влож.Сумма, 0) КАК Сдано,
	               |	ВЫБОР
	               |		КОГДА Влож.Сумма > СтоимостьЗаявок.ИтогСуммаВзноса
	               |			ТОГДА 0
	               |		ИНАЧЕ СтоимостьЗаявок.ИтогСуммаВзноса - ЕСТЬNULL(Влож.Сумма, 0)
	               |	КОНЕЦ КАК Остаток,
	               |	0 КАК Учтено
	               |ИЗ
	               |	СтоимостьЗаявок КАК СтоимостьЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			уб_ПриемкаОплатПолисы.Заявка КАК Заявка,
	               |			СУММА(уб_ПриемкаОплатПолисы.Сумма) КАК Сумма
	               |		ИЗ
	               |			Документ.уб_ПриемкаОплат.Полисы КАК уб_ПриемкаОплатПолисы
	               |		ГДЕ
	               |			уб_ПриемкаОплатПолисы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |			И уб_ПриемкаОплатПолисы.Заявка <> ЗНАЧЕНИЕ(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПУстаяСсылка)
	               |			И уб_ПриемкаОплатПолисы.Заявка В(&Заявка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			уб_ПриемкаОплатПолисы.Заявка) КАК Влож
	               |		ПО СтоимостьЗаявок.Ссылка = Влож.Заявка";
				   
    Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Заявка",Заявки);
	
	СуммыЗаявок = Запрос.Выполнить().Выгрузить();
	Возврат СуммыЗаявок;
КонецФункции	
Функция ОстатокЗаявки(СуммыЗаявок,СтрокаБСО,ИмяПоляЗаявка="Заявка") Экспорт
	нСтроки = СуммыЗаявок.НайтиСтроки(Новый Структура("Заявка,ВидБСО",СтрокаБСО[ИмяПоляЗаявка],СтрокаБСО.ВидБСО));
	Если нСтроки.Количество()>0 Тогда
		Если нСтроки[0].Сдано = 0 Тогда
			нСтроки[0].Сдано = СуммаПоНомеру(СтрокаБСО.НомерБСО,СтрокаБСО.СК);
			Если нСтроки[0].Сдано>0 Тогда
				Сообщить("Сумма найдена по номеру "+СтрокаБСО.НомерБСО+" и равна "+Формат(нСтроки[0].Сдано,"ЧДЦ=2"));
				нСтроки[0].Остаток = ?(нСтроки[0].Сдано>нСтроки[0].Взнос, 0,нСтроки[0].Взнос-нСтроки[0].Сдано);
			КонецЕсли;	
		КонецЕсли;	
		Остаток = нСтроки[0].Остаток-нСтроки[0].Учтено;
		нСтроки[0].Учтено = нСтроки[0].Остаток;
	Иначе	
		Остаток = 0;
	КонецЕсли;
	Возврат Остаток
КонецФункции	