////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	ТабПФ = уб_ПФ.ПустаяТЗСтруктурыПФ();	
	Возврат ТабПФ;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	ДвижениеПоРегиструДвижениеБСО(Отказ, Заголовок);
	ДвижениеПоРегиструОстаткиБСО(Отказ, Заголовок);	
КонецПроцедуры

Процедура ДвижениеПоРегиструОстаткиБСО(Отказ, Заголовок)	
	Движения.уб_ОстаткиБСО.Очистить();
	Для Каждого СтрокаТЧ Из КоличественныеБСО Цикл
		Если СтрокаТЧ.Отклонение <> 0 И СтрокаТЧ.Подтверждено Тогда
			Движение = Движения.уб_ОстаткиБСО.Добавить();
			Движение.Активность = Проведен;
			Движение.Агент = Агент;
			Движение.ВидБСО = СтрокаТЧ.ВидБСО;
			Движение.Заявка = СтрокаТЧ.Заявка;
			Движение.КодОперации = Перечисления.уб_КодыОперацийБСО.ИнвентаризацияБСО;
			
			Движение.ОрганизацияАгент = СтрокаТЧ.ОрганизацияАгент;
			Движение.Период = Дата;
			Движение.Поставщик = СтрокаТЧ.Поставщик;
			Движение.СК = СтрокаТЧ.СК;
			Движение.СостояниеБСО = СтрокаТЧ.СостояниеБСО;
			Если СтрокаТЧ.Отклонение > 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Количество = СтрокаТЧ.Отклонение;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Количество = -СтрокаТЧ.Отклонение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.уб_ОстаткиБСО.Записать();
КонецПроцедуры	


Процедура ДвижениеПоРегиструДвижениеБСО(Отказ, Заголовок)
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	//СтруктураПараметров.Вставить("АгентВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Агент", Агент);
	СтруктураПараметров.Вставить("АгентОтправитель", "Агент");
	//СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.ИнвентаризацияБСО);
	//СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	//СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Ложь);
	//СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", Неопределено);
	//СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("Поставщик", Неопределено);
	//СтруктураПараметров.Вставить("ОрганизацияАгент", Неопределено);
	//СтруктураПараметров.Вставить("ОсновнаяОрганизация", Неопределено);
	//СтруктураПараметров.Вставить("ПоложениеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Истина);
	СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО", "УстановитьСостояниеБСО");
	СтруктураПараметров.Вставить("ИмяКолонкиПоложениеБСО", "УстановитьПоложениеБСО");
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Функция ЕстьИзмененияВНовойЗаписи(Движение,ЗаписьРег)	
	Если ЗаписьРег = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;	
	Результат = Ложь;
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.уб_ДвиженияБСО.Ресурсы Цикл
		Если Движение[Ресурс.Имя] <> ЗаписьРег[Ресурс.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Для Каждого Измерение Из Метаданные.РегистрыСведений.уб_ДвиженияБСО.Измерения Цикл
		Если Движение[Измерение.Имя] <> ЗаписьРег[Измерение.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.РегистрыСведений.уб_ДвиженияБСО.Реквизиты Цикл
		Если Реквизит.Имя <> "КодОперации" И Движение[Реквизит.Имя] <> ЗаписьРег[Реквизит.Имя] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли; 	
	КонецЦикла;
	Возврат Результат;
КонецФункции	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	//СтруктураОбязательныхПолей = Новый Структура("СК, Подразделение");
	СтруктураОбязательныхПолей = Новый Структура("Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли
	
	// Вставить содержимое обработчика.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	//СтруктураОбязательныхПолей = Новый Структура("СК, Подразделение");
	СтруктураОбязательныхПолей = Новый Структура("Агент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	_СтраховаяПремия = БСо.Итог("СтраховаяПремия");
	УстановитьЗначение(СтраховаяПремия,_СтраховаяПремия);
	_СтраховаяПремия = СостояниеЛимитов.Итог("СуммаФакт");
	УстановитьЗначение(СтраховаяПремияЛимиты,_СтраховаяПремия);
	
	_Количество = БСо.Количество()+КоличественныеБСО.Итог("КоличествоУчет");
	
	УстановитьЗначение(Количество,_Количество);
	
	Если ЗначениеЗаполнено(Подразделение) = Ложь Тогда
		Если Агент = Неопределено Или Агент.Пустая() Тогда
			Подразделение = Неопределено;
		ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Подразделение = уб_СС.ПолучитьПодразделениеАгента(Агент, Дата);	
		ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Подразделение = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети;
		ИначеЕсли ТипЗнч(Агент) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			Подразделение = Агент;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
