Перем Контекст Экспорт; // Структура, используемая в печатных формах

Процедура ПечатьКВ(КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьМакета();
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект, "---"), НепосредственнаяПечать);
		
КонецПроцедуры	

Процедура ПечатьКВСГруппировкой(КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьМакетаСГруппировой();
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект, "---"), НепосредственнаяПечать);
		
КонецПроцедуры

Функция ПечатьМакета()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_сетки_КВ";
	ТабДокумент.ИспользуемоеИмяФайла = "Печать_сетки_КВ";
	
	Макет = ПолучитьМакет("Макет");
	ИменительныйПадеж = Перечисления.Падежи.Именительный;
	Если КВДля = 1 Тогда
		Макет.УдалитьОбласть(Макет.Область("ОргПост"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	Если КВДля = 0 Тогда
	    Макет.УдалитьОбласть(Макет.Область("АВ"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = Формат(Дата,"ДЛФ=ДД");
	лАгентВнешний = (Подразделение = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети);
	Если КВДля=1 Тогда
		Если НЕ Агент=Неопределено Тогда
			Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация агент: "+ПараметрыСеанса.уб_ОсновнаяОрганизация;
			Иначе
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация агент: "+ОрганизацияАгент;
			КонецЕсли;	
		Иначе
			Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Подразделение.Владелец+"";
			Иначе
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+ОрганизацияАгент+"";
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
			КВКого = "КВ Брокера "+ПараметрыСеанса.уб_ОсновнаяОрганизация+"";
		Иначе
			КВКого = "КВ Брокера "+ОрганизацияАгент+"";
		КонецЕсли;	
	КонецЕсли;	
	ОбластьМакета.Параметры.КВКого = КВКого;
	
	ТабДокумент.Вывести(ОбластьМакета);
	Фикс = 5;
	
	Если ЗначениеЗаполнено(СК) Тогда
		оСК = Макет.ПолучитьОбласть("СК");
		оСК.Параметры.СК = СК.Наименование;
		ТабДокумент.Вывести(оСК);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСП) Тогда
		оВидСП = Макет.ПолучитьОбласть("ВидСП");
		оВидСП.Параметры.ВидСП = ВидСП;
		ТабДокумент.Вывести(оВидСП);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		оПоставщик = Макет.ПолучитьОбласть("Поставщик");
		оПоставщик.Параметры.Поставщик = Поставщик.Наименование;
		ТабДокумент.Вывести(оПоставщик);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОрганизацияАгент) Тогда
		оОргАгент = Макет.ПолучитьОбласть("ОргАгент");
		оОргАгент.Параметры.ОргАгент = ОрганизацияАгент.НаименованиеПолное;
		ТабДокумент.Вывести(оОргАгент);
		Фикс = Фикс + 1;
	КонецЕсли;
	ТабДокумент.ФиксацияСверху	= Фикс;
		
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаб");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
 	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Области.ШапкаТаб;
	
		
	ТабКВ = ТаблицаКВ;
	ТабКВ.Сортировать("СК Возр, Поставщик Возр, ОрганизацияАгент Возр, Банк Возр, ВидСП Возр");

	
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=-";
	ДФ = "ДФ=dd.MM.yyyy";
	
	Для Каждого СтрокаТЗ Из ТабКВ Цикл
						
		СтрокаЗн = Макет.ПолучитьОбласть("Строка");
		Прм = СтрокаЗн.Параметры;
		
		Прм.Номер = СтрокаТЗ.НомерСтроки;
		Если НЕ КВДля = 1 Тогда
			Прм.ОрганизацияАгент = СтрокаТЗ.ОрганизацияАгент;
			Прм.Поставщик = СтрокаТЗ.Поставщик;
		КонецЕсли;
		Прм.ДатаНач = Формат(СтрокаТЗ.ДатаНач,ДФ);
		Прм.Продукт = СтрокаТЗ.СтраховойПродукт;
		Прм.СтраховаяКомпания = СтрокаТЗ.СК;
		Прм.Вид = СтрокаТЗ.ВидСП;
		Если КВДля = 1 Тогда
	        Прм.АВПроцент = Строка(СтрокаТЗ.ПроцентАВ)+"%";;
		КонецЕсли; 
	    Прм.КВПроцент = Строка(СтрокаТЗ.Процент)+"%";
		Прм.Условие = СтрокаТЗ.Условие;
		Прм.Банк = СтрокаТЗ.Банк;			
		ТабДокумент.Вывести(СтрокаЗн);
	КонецЦикла;
	
	Область_Подвал = Макет.ПолучитьОбласть("Подвал");
	ФизЛицо = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	Область_Подвал.Параметры.ОсновнаяОрганизация_НаименованиеДляДоговоровиотчетов = ПараметрыСеанса.уб_ОсновнаяОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	Область_Подвал.Параметры.ТекущийПользователь_Физлицо_ФиоКратко = уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, Дата, Истина, ИменительныйПадеж); 
	ТабДокумент.Вывести(Область_Подвал);
	
	ТабДокумент.РазмерКолонтитулаСверху = 6;
	ВКлн = ТабДокумент.ВерхнийКолонтитул;
	ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ВКлн.НачальнаяСтраница = 1;
	ВКлн.Выводить	= Истина;
	ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
	ВКлн.Шрифт = Новый Шрифт(,7);

	
	ТабДокумент.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДокумент.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница = 1;
	HКлн.Выводить	= Истина;
	HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия + "." + Формат(ТекущаяДата(),"ДФ=yyMMdd.HHmm");
	HКлн.Шрифт = Новый Шрифт(,7);
		
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Печать сетки КВ");
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьМакетаСГруппировой()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_сетки_КВ";
	ТабДокумент.ИспользуемоеИмяФайла = "Печать_сетки_КВ";
	
	Макет = ПолучитьМакет("МакетСГруппировкой");
	ИменительныйПадеж = Перечисления.Падежи.Именительный;
	
	Если КВДля = 0 Тогда
	    Макет.УдалитьОбласть(Макет.Область("АВ"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли; 
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = Формат(Дата,"ДЛФ=ДД");
		
	лАгентВнешний = (Подразделение = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети);
	Если КВДля=1 Тогда
		Если НЕ Агент=Неопределено Тогда
			Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация агент: "+ПараметрыСеанса.уб_ОсновнаяОрганизация;
			Иначе
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Агент+"";
				ОбластьМакета.Параметры.Организация = "Организация агент: "+ОрганизацияАгент;
			КонецЕсли;	
		Иначе
			Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+Подразделение.Владелец+"";
			Иначе
				КВКого = "КВ "+?(лАгентВнешний,"агента","менеджера")+" "+ОрганизацияАгент+"";
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
			КВКого = "КВ Брокера "+ПараметрыСеанса.уб_ОсновнаяОрганизация+"";
		Иначе
			КВКого = "КВ Брокера "+ОрганизацияАгент+"";
		КонецЕсли;	
	КонецЕсли;	
	ОбластьМакета.Параметры.КВКого = КВКого;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Фикс = 5;
	
	Если ЗначениеЗаполнено(СК) Тогда
		оСК = Макет.ПолучитьОбласть("шСК");
		оСК.Параметры.СК = СК.Наименование;
		ТабДокумент.Вывести(оСК);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСП) Тогда
		оВидСП = Макет.ПолучитьОбласть("шВидСП");
		оВидСП.Параметры.ВидСП = ВидСП;
		ТабДокумент.Вывести(оВидСП);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		оПоставщик = Макет.ПолучитьОбласть("шПоставщик");
		оПоставщик.Параметры.Поставщик = Поставщик.Наименование;
		ТабДокумент.Вывести(оПоставщик);
		Фикс = Фикс + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОрганизацияАгент) Тогда
		оОргАгент = Макет.ПолучитьОбласть("шОргАгент");
		оОргАгент.Параметры.ОргАгент = ОрганизацияАгент.НаименованиеПолное;
		ТабДокумент.Вывести(оОргАгент);
		Фикс = Фикс + 1;
	КонецЕсли;
	ТабДокумент.ФиксацияСверху	= Фикс;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаб");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
 	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Области.ШапкаТаб;	
	
	
	
	ЧФ = "ЧЦ=14; ЧДЦ=2; ЧН=-";
	ДФ = "ДФ=dd.MM.yyyy";
	
	ТабКВ = ТаблицаКВ;
	ТабКВ.Сортировать("Поставщик Возр, ОрганизацияАгент Возр, СК Возр, Банк Возр, ВидСП Возр");
	ПоставщикТек = Неопределено;
	ОрганизацияАгентТек = Неопределено;
	СКТек = Неопределено;
	БанкТек = Неопределено;
	БанкНаст = "";
	Ном = 0;
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	Для Каждого СтрокаТЗ Из ТабКВ Цикл
		Если ПоставщикТек = Неопределено ИЛИ ПоставщикТек <> СтрокаТЗ.Поставщик Тогда
			//ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
			//ОбластьПоставщик.Параметры.Поставщик = СтрокаТЗ.Поставщик;
			//ТабДокумент.Вывести(ОбластьПоставщик, 1, "Поставщик", Истина);
			ПоставщикТек = СтрокаТЗ.Поставщик;
			Изменен = Истина;
		КонецЕсли; 	
		Если ОрганизацияАгентТек = Неопределено ИЛИ ОрганизацияАгентТек <> СтрокаТЗ.ОрганизацияАгент ИЛИ Изменен Тогда
			//ОбластьОрг = Макет.ПолучитьОбласть("Орг");
			//ОбластьОрг.Параметры.ОрганизацияАгент = СтрокаТЗ.ОрганизацияАгент;
			//ТабДокумент.Вывести(ОбластьОрг,2, "Орг", Истина);
			ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
			ОбластьПоставщик.Параметры.Поставщик = Строка(СтрокаТЗ.Поставщик)+" / "+Строка(СтрокаТЗ.ОрганизацияАгент);
		    ТабДокумент.Вывести(ОбластьПоставщик, 1, "Поставщик", Истина);
			ОрганизацияАгентТек = СтрокаТЗ.ОрганизацияАгент;
			Изменен = Истина;
		КонецЕсли;
		Если СКТек = Неопределено ИЛИ СКТек <> СтрокаТЗ.СК ИЛИ Изменен Тогда
			ОбластьСК = Макет.ПолучитьОбласть("СК");
			ОбластьСК.Параметры.СтраховаяКомпания = СтрокаТЗ.СК;
		    ТабДокумент.Вывести(ОбластьСК,2, "СК", Истина);
			СКТек = СтрокаТЗ.СК;
			БанкТек = Неопределено;
		КонецЕсли;
		Если ЗначениеНеЗаполнено(СтрокаТЗ.Банк) Тогда
		    БанкНаст = "Без Банка";
			ЕстьБанк = Ложь;
		Иначе	
		    БанкНаст = "Кредитные";
			ЕстьБанк = Истина;
		КонецЕсли; 
		Если ЕстьБанк И БанкТек <> БанкНаст Тогда
			ОбластьБанк = Макет.ПолучитьОбласть("Банк");
			ОбластьБанк.Параметры.Банк = БанкНаст;
			ТабДокумент.Вывести(ОбластьБанк,3, "Банк", Истина);
			БанкТек = БанкНаст;
			//Ном = 0;
		КонецЕсли;
		Изменен = Ложь;
		Группировка = Ложь;
		Ном = Ном + 1;
		Если ЗначениеНеЗаполнено(СтрокаТЗ.Банк) Тогда
		    СтрокаЗн = Макет.ПолучитьОбласть("Строка");
		Иначе	
			СтрокаЗн = Макет.ПолучитьОбласть("Строка1");
		КонецЕсли; 
		Прм = СтрокаЗн.Параметры;
		Прм.Номер = Ном;
		Прм.ДатаНач = Формат(СтрокаТЗ.ДатаНач,ДФ);
		Прм.Продукт = СтрокаТЗ.СтраховойПродукт;
		Прм.Вид = СтрокаТЗ.ВидСП;
		Если КВДля = 1 Тогда 
			Прм.АВПроцент = Строка(СтрокаТЗ.ПроцентАВ)+"%";;
		КонецЕсли;
		Прм.КВПроцент = Строка(СтрокаТЗ.Процент)+"%";
		Прм.Условие = СтрокаТЗ.Условие;
		Прм.Банк = СтрокаТЗ.Банк;
					
		ТабДокумент.Вывести(СтрокаЗн,4, "Строка", Ложь);
	КонецЦикла;
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(2);
	Область_Подвал = Макет.ПолучитьОбласть("Подвал");
	ФизЛицо = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	Область_Подвал.Параметры.ОсновнаяОрганизация_НаименованиеДляДоговоровиотчетов = ПараметрыСеанса.уб_ОсновнаяОрганизация.НаименованиеДляДоговоровИПлатежныхДокументов;
	Область_Подвал.Параметры.ТекущийПользователь_Физлицо_ФиоКратко = уб_Кэшируемые.ФИОФизлицаСтрокой(ФизЛицо, Дата, Истина, ИменительныйПадеж); 
	ТабДокумент.Вывести(Область_Подвал);
	
	ТабДокумент.РазмерКолонтитулаСверху = 6;
	ВКлн = ТабДокумент.ВерхнийКолонтитул;
	ВКлн.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ВКлн.НачальнаяСтраница = 1;
	ВКлн.Выводить	= Истина;
	ВКлн.ТекстСправа = " стр. [&НомерСтраницы] из [&СтраницВсего]";
	ВКлн.Шрифт = Новый Шрифт(,7);

	
	ТабДокумент.РазмерКолонтитулаСнизу = 8;
	HКлн = ТабДокумент.НижнийКолонтитул;
	HКлн.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	HКлн.НачальнаяСтраница = 1;
	HКлн.Выводить	= Истина;
	HКлн.ТекстСправа = "ITC:УБ v." + Метаданные.Версия + "." + Формат(ТекущаяДата(),"ДФ=yyMMdd.HHmm");
	HКлн.Шрифт = Новый Шрифт(,7);
		
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.Показать("Печать сетки КВ");
	
	Возврат ТабДокумент;

КонецФункции
