
// Процедура выполняет движения по регистрам при проведении
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.уб_ДатыРасчетовССотрудниками.Прочитать();
	ТаблицаДвиженийДоПроведения = Движения.уб_ДатыРасчетовССотрудниками.Выгрузить();
	
	ОбщегоНазначения.УдалитьДвиженияДокумента(Движения);	
	//Выплата з/п
	ВО = Перечисления.уб_ВидОперацииВыплатыЗП;
	Если ВидОперации = ВО.Зарплата  Тогда
		Описание = "Выплата заработной платы";
	ИначеЕсли ВидОперации = ВО.Аванс  Тогда	
		Описание = "Выплата аванса";
	ИначеЕсли ВидОперации = ВО.Остаток  Тогда	
		Описание = "Начальный остаток или корректировка задолженности";	
	ИначеЕсли ВидОперации = ВО.Отпускные  Тогда	
		Описание = "Выплата отпускных";
	ИначеЕсли ВидОперации = ВО.Займ  Тогда		
		Описание = "Выдан займ"
	ИначеЕсли ВидОперации  = ВО.СписаниеЗадолженности Тогда	
		Описание = "Списан долг без выплаты";
	КонецЕсли;	
	
	Для Каждого ТекСтрокаВедомости Из Ведомость Цикл
		// регистр уб_РасчетыСФЛПоЗП Приход
		Если ТекСтрокаВедомости.Выплачено Тогда
			
			//Если ВидОперации = ВО.Зарплата Тогда
			//	Дата2 = Дата;
			//	Показатели = Документы.уб_ЖурналУспеваемостиСотрудников.ПоказательУспеваемостиСотрудника(ТекСтрокаВедомости.Сотрудник,Дата2);
			//	Если Показатели.СредБаллМесяц<72.5 и Показатели.ТочкаПродаж = Истина и Показатели.ЭтоРуководитель = Ложь Тогда
			//		Сообщить("Средний балл у "+ТекСтрокаВедомости.Сотрудник+ " ниже 72.5 баллов ("+Показатели.СредБаллМесяц+")",СтатусСообщения.Информация);
			//		Если Дата >=Дата(2017,4,19) Тогда
			//			Отказ = Истина;
			//		КонецЕсли;	
			//	КонецЕсли;
			//	
			//КонецЕсли;
			ДатаДвижения = ?(ТекСтрокаВедомости.ДатаВыплаты = Дата(1,1,1),Дата,ТекСтрокаВедомости.ДатаВыплаты);
			
			Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
			Движение.Период         = ДатаДвижения;
			Движение.Организация    = Организация;
			Движение.ФизическоеЛицо = ТекСтрокаВедомости.Сотрудник;
			Движение.Сумма          = ТекСтрокаВедомости.Результат;
			//Движение.РасчетныйПериод = РасчетныйПериод;
			//	Движение.ПериодРегистрации = Дата;
			
			Движение.Описание       = Описание;
			Движение.Раздел         = 21;
			
			//Меняем последнюю дату расчетов с сотрудниками
			Если НЕ (ВидОперации = ВО.Аванс ИЛИ ВидОперации = ВО.Отпускные ИЛИ ВидОперации = ВО.Займ) Тогда
				
				СтрокаДоПроведения =  ТаблицаДвиженийДоПроведения.Найти(ТекСтрокаВедомости.Сотрудник,"ФизическоеЛицо");
				Если СтрокаДоПроведения = Неопределено Тогда
					//Это не перепроведение
					//Получаем текущую дату фиксации по сотруднику и сравниваем с датой
					ТЗ = РегистрыСведений.уб_ДатыРасчетовССотрудниками.СрезПоследних(,Новый Структура("ФизическоеЛицо", ТекСтрокаВедомости.Сотрудник));
					Если  ТЗ.Количество()>0 Тогда
						ДатаФиксации = ТЗ[0].Дата;
					Иначе
						ДатаФиксации = Дата(1,1,1,1,1,1);
					КонецЕсли;
					Если ДатаФиксации>ДатаДвижения Тогда
						//Будет авансом поскольку нельзя задним числом вносить выплату с фиксацией
						Движение.Описание = "Выплата аванса";
						Если Ведомость.Количество()=1 Тогда
							ВидОперации = ВО.Аванс;
						КонецЕсли;	
					Иначе
						Движение = Движения.уб_ДатыРасчетовССотрудниками.Добавить();
						Движение.Дата           = ДатаДвижения;
						Движение.Период         = ДатаДвижения;
						Движение.Регистратор    = Ссылка;
						Движение.ФизическоеЛицо = ТекСтрокаВедомости.Сотрудник;	
					КонецЕсли;	
				Иначе
					//!!!При смене даты, одновременно с перепроведение возможны проблемы
					Движение = Движения.уб_ДатыРасчетовССотрудниками.Добавить();
					Движение.Дата           = ДатаДвижения;
					Движение.Период         = ДатаДвижения;
					Движение.Регистратор    = Ссылка;
					Движение.ФизическоеЛицо = ТекСтрокаВедомости.Сотрудник;		
				Конецесли;
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	
	уб_ОбменДанными.ВыполнитьСинхронизацию(Ссылка);
	
КонецПроцедуры

// Процедура - обработчик ПередЗаписью документа, отмечает факт модификации
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КодПользователя = СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код);
	Если (Дата<НачалоДня(ТекущаяДата()) ИЛИ (НЕ ЭтоНовый() И Ссылка.Дата<НачалоДня(ТекущаяДата()))) и НЕ уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ВыплатаЗПНеоперативноеПроведение, Ложь) Тогда //TO DO Сделать отдельную роль для правки выплат задним числом
		#Если Клиент Тогда
		Предупреждение("Документ можно править только в течении дня!");
		#КонецЕсли
		Отказ = Истина;
	Иначе
		//Проверка
		ВО = Перечисления.уб_ВидОперацииВыплатыЗП;
		Для Каждого ТекСтрокаВедомости Из Ведомость Цикл
			// регистр уб_РасчетыСФЛПоЗП Приход
			Если ТекСтрокаВедомости.Выплачено Тогда
				Если ПустаяСтрока(ТекСтрокаВедомости.УИДСтроки) Тогда
					ТекСтрокаВедомости.УИДСтроки = Новый УникальныйИдентификатор;
				КонецЕсли;	
				Если ТекСтрокаВедомости.ДатаВыплаты = Дата(1,1,1) Тогда
					ТекСтрокаВедомости.ДатаВыплаты = Дата;
				КонецЕсли;	
				Если ВидОперации = ВО.Зарплата Тогда
					Дата2 = Дата;
					Попытка
						//Показатели = Документы.уб_ЖурналУспеваемостиСотрудников.ПоказательУспеваемостиСотрудника(ТекСтрокаВедомости.Сотрудник,Дата2);
						//Если Показатели.СредБаллМесяц<72.5 и Показатели.ТочкаПродаж = Истина и Показатели.ЭтоРуководитель = Ложь Тогда
						//	Сообщить("Средний балл у "+ТекСтрокаВедомости.Сотрудник+ " ниже 72.5 баллов ("+Показатели.СредБаллМесяц+")",СтатусСообщения.Информация);
						//	//Если Дата >=Дата(2017,4,19) Тогда
						//	//	Отказ = Истина;
						//	//КонецЕсли;	
						//КонецЕсли;
					Исключение
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Обновление представление списка входящих
	УстановитьЗначение(КраткийСоставДокумента, уб_Temp.ЗаполнитьКраткийСоставДокумента(Ведомость,, "Сотрудник"));
	
	//Обновление итогов выплаты
	УстановитьЗначение(ИтогоВыплачено,Ведомость.Выгрузить(Новый Структура("Выплачено", Истина), "Результат").Итог("Результат"));
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Не Отказ 
	//	//И НеОтражатьРасчетыВ1СДеньги = ЛОЖЬ //Убрано могут поменять, тогда должно быть удалено удаленно, проверка теперь внутри
		Тогда
		Если Дата >Дата(2026,6,1) Тогда
			уб_ОбменДанными.ВыполнитьСинхронизацию(Ссылка);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик отмены проведения, удаляет движения документа
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.уб_ДатыРасчетовССотрудниками.Прочитать();
	
	ТаблицаДвиженийДоУдаления = Движения.уб_ДатыРасчетовССотрудниками.Выгрузить();
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект,Отказ);
	
	//2024.02.19 отказываемся от схлапывания движений, 
	//документы редко удаляют, но могут временно снять с проведения задним числом,
	//а это вызывает разрыв расчетных листков
	//проблема может быть только, если во время снятия с проведения, будет произведено начисление ЗП, 
	//но при кратковременном такого не будет
	возврат;
	Для каждого СтрокаДвижения из ТаблицаДвиженийДоУдаления Цикл
		//
		
		Сотрудник = СтрокаДвижения.ФизическоеЛицо;
		ТекущаяДатаФиксации = СтрокаДвижения.Дата;
		ТЗ = РегистрыСведений.уб_ДатыРасчетовССотрудниками.СрезПоследних(ТекущаяДатаФиксации-1,Новый Структура("ФизическоеЛицо", Сотрудник));
		Если  ТЗ.Количество()>0 Тогда
			ПредДатаФиксации = ТЗ[0].Дата;
		Иначе
			ПредДатаФиксации = Дата(1,1,1,1,1,1);
		КонецЕсли;
		
		ТЗ = РегистрыСведений.уб_ДатыРасчетовССотрудниками.СрезПервых(ТекущаяДатаФиксации+1,Новый Структура("ФизическоеЛицо", Сотрудник));
		Если  ТЗ.Количество()>0 Тогда
			СледДатаФиксации = ТЗ[0].Дата;
		Иначе
			СледДатаФиксации = Дата(1,1,1,1,1,1);
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	уб_РасчетыСФЛПоЗП.Регистратор
		                      |ИЗ
		                      |	РегистрНакопления.уб_РасчетыСФЛПоЗП КАК уб_РасчетыСФЛПоЗП
		                      |ГДЕ
		                      |	уб_РасчетыСФЛПоЗП.Активность
		                      |	И уб_РасчетыСФЛПоЗП.ФизическоеЛицо = &ФизическоеЛицо
		                      |	И уб_РасчетыСФЛПоЗП.Период > &ПредДатаФиксации
		                      |	И 1 = 1
		                      |	И (НЕ уб_РасчетыСФЛПоЗП.Раздел = 21)");
		Если НЕ СледДатаФиксации = Дата(1,1,1,1,1,1) Тогда
			//
			Запрос.УстановитьПараметр("СледДатаФиксации",СледДатаФиксации);
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"1 = 1","уб_РасчетыСФЛПоЗП.Период < &СледДатаФиксации");
		КонецЕсли;	  
		Запрос.УстановитьПараметр("ФизическоеЛицо",Сотрудник);
		Запрос.УстановитьПараметр("ПредДатаФиксации",ПредДатаФиксации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//
			Об = Выборка.Регистратор.ПолучитьОбъект();
			Дата0 = НачалоМесяца(Об.Дата);
			ЗаменитьПериодыВТЧ (Об.Начисления,Дата0,Сотрудник,ПредДатаФиксации,СледДатаФиксации,"Период","Сотрудник");
			ЗаменитьПериодыВТЧ (Об.ВознаграждениеЗаПродажи,Дата0,Сотрудник,ПредДатаФиксации,СледДатаФиксации,"Период","Сотрудник");
			ЗаменитьПериодыВТЧ (Об.ВознаграждениеКурьеров,Дата0,Сотрудник,ПредДатаФиксации,СледДатаФиксации,"Период","Сотрудник");
			ЗаменитьПериодыВТЧ (Об.ВознаграждениеКурьеров,Дата0,Сотрудник,ПредДатаФиксации,СледДатаФиксации,"ПериодДляИсточника","ИсточникФинансирования");
			ЗаменитьПериодыВТЧ (Об.НачисленияРазовые,Дата0,Сотрудник,ПредДатаФиксации,СледДатаФиксации,"Период","Сотрудник");
			Об.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;	
	КонецЦикла;	
	
	уб_ОбменДанными.ВыполнитьСинхронизацию(Ссылка);
КонецПроцедуры

Процедура ЗаменитьПериодыВТЧ (ТЧ,РасчетныйПериод,ФЛ,ПредДатаФиксации,СледДатаФиксации,ПолеПериода,ПолеСотрудника)
	//
	МассивСтрокпоФЛ = ТЧ.НайтиСтроки(Новый Структура(ПолеСотрудника,ФЛ));
	ВсегоСтрокПоФл = МассивСтрокпоФЛ.Количество();
	ФлПроверятьКонДату = НЕ СледДатаФиксации=Дата(1,1,1,1,1,1);
	КоличествоПравок = 0;
	Для СчетчикСтрок = 0 по ВсегоСтрокПоФл-1 Цикл
		//
		ТекСтрока = МассивСтрокпоФЛ[СчетчикСтрок];
		Если ТекСтрока[ПолеПериода]>ПредДатаФиксации Тогда
			Если ФлПроверятьКонДату Тогда
				Если ТекСтрока[ПолеПериода]>=СледДатаФиксации Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			НовыйПериод = Макс(РасчетныйПериод,ПредДатаФиксации+1);
			Если НовыйПериод=ТекСтрока[ПолеПериода] Тогда
			Иначе
				ТекСтрока[ПолеПериода]  = НовыйПериод;
				КоличествоПравок=КоличествоПравок+1;
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

