//Функция возвращаяет соответствубщий периоду и организации документ, при необходимости создает
Функция ПолучитьДокументНачисленияЗаПериод (искПериод,искОрганизация,СоздатьПриОтсутствии=Ложь,Создан=Ложь)  Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_НачислениеЗП.Ссылка
	|ИЗ
	|	Документ.уб_НачислениеЗП КАК уб_НачислениеЗП
	|ГДЕ
	|	уб_НачислениеЗП.Дата = &Дата
	|	И уб_НачислениеЗП.Проведен");
	//|	И уб_НачислениеЗП.Организация = &Организация"); //Организация не актуально. может вызвать проблемы
	//|	И уб_НачислениеЗП.Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("Организация",искОрганизация);
	Запрос.УстановитьПараметр("Дата",искПериод);
	//Запрос.УстановитьПараметр("Ссылка",искОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		#Если Клиент Тогда
			//Предупреждение("Уже есть документ начисления с такими параметрами!",5);
			НайденныйОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Возврат НайденныйОбъект;
		#КонецЕсли	
		
	Иначе
		Если СоздатьПриОтсутствии Тогда
			СозданныйОбъект = Документы.уб_НачислениеЗП.СоздатьДокумент();
			СозданныйОбъект.Дата = искПериод;
			СозданныйОбъект.Организация = Справочники.Организации.НайтиПоКоду("000000001");//искОрганизация;
			//	СозданныйОбъект.РасчетныйПериод = искПериод;
			Попытка 
				СозданныйОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Создан = Истина;
			Исключение
				#Если Клиент Тогда
					Сообщить("Ошибка при создании документа по "+ИскОрганизация +" за "+Формат(искПериод,"ДФ='MMMM yyyy'"));
				#КонецЕсли	
			Конецпопытки;	
			Возврат СозданныйОбъект;
		Иначе
			Возврат Неопределено
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецФункции