Перем БылоЗаполнение Экспорт;
Перем ДатыФиксации;

#Если Клиент Тогда 
/////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ И ОТРАЖЕНИЯ РАСХОЖДЕНИЙ ДОКУМЕНТА
/////////////////////////////////////////////////////////////////////////////////////////
// Процедура перезаполняет документ согласно переданным параметрам
//
//	СтруктураПараметров = Новый Структура (
//		Начисления              - перезаполнять периодические начисления
//		ВознаграждениеЗаПродажи - перезаполнять вознаграждение отдела продаж
//		ВознаграждениеКурьеров  - перезаполнять вознаграждение курьеров
//		КомментироватьРасчет    - выводить комментарии расчета
//		ВыводитьПротокол        - выводить протокол расхождений
//      Записать                - записать изменения после заполнения
Процедура Перезаполнить(СтруктураПараметров = Неопределено, ДатаСреза = Неопределено, ПротоколРасхождений = Неопределено) Экспорт
		
	//Получение настроек инициализация переменных
	//	НеЗаполнятьОП = ложь;
	Если СтруктураПараметров = Неопределено Тогда
		//Если (ТекущаяДата()- Дата)/(24*60*60)<15 Тогда
		//	НеЗаполнятьОП = Истина;
		//КонецЕсли;
		СтруктураПараметров = Новый Структура ("Начисления,ВознаграждениеЗаПродажи,ВознаграждениеКурьеров,КомментироватьРасчет,ВыводитьПротокол,Записать,ДатаРегистрацииРасчета",
		Истина,Истина,Истина,Ложь,Ложь, Истина,Неопределено);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		СтруктураПараметров.Вставить("Ошибка","Не выбран период расчета заработной платы");
		Возврат;
	Иначе
		Если Дата < Дата(2025,8,1) Тогда
			//Старые правки не изменяем
			СтруктураПараметров.Вставить("ВознаграждениеЗаПродажи",Ложь);
			СтруктураПараметров.Вставить("ВознаграждениеКурьеров",Ложь);
		КонецЕсли;
		Если Дата < Дата(2026,6,1) Тогда
			//Старые правки не изменяем
			СтруктураПараметров.Вставить("ВознаграждениеКурьеров",Ложь);
		КонецЕсли;
	КонецЕсли;	
	Если Дата < Дата(2017,1,1) Тогда
		Возврат;
	КонецЕсли;	
	Если Дата < Дата(2025,1,1) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация	= ПараметрыСеанса.уб_ОсновнаяОрганизация;
		//СтруктураПараметров.Вставить("Ошибка","Не выбрана организация для расчета заработной платы");
		//Возврат;
	КонецЕсли;	
	
	КомментироватьРасчет = СтруктураПараметров.Свойство("КомментироватьРасчет");
	Если Не КомментироватьРасчет Тогда
		СтруктураПараметров.Вставить("КомментироватьРасчет", КомментироватьРасчет);
	Иначе
		КомментироватьРасчет = СтруктураПараметров.КомментироватьРасчет;	
	КонецЕсли;	
	
	спФиксированнойСуммой = Перечисления.уб_СпособРасчетаНачисления.ФиксированнойСуммой;
	спПроцентом = Перечисления.уб_СпособРасчетаНачисления.Процентом;
	спПоМесячнойТарифнойСтавкеПоДням = Перечисления.уб_СпособРасчетаНачисления.ПоМесячнойТарифнойСтавкеПоДням;
	спПоМесячнойТарифнойСтавкеПоЧасам = Перечисления.уб_СпособРасчетаНачисления.ПоМесячнойТарифнойСтавкеПоЧасам;
	
	//Создание промежуточных таблиц 
	вспНачисления = Начисления.Выгрузить();
	вспНачисления.Очистить();
	//
	вспВознаграждениеЗаПродажи = ВознаграждениеЗаПродажи.Выгрузить();
	вспВознаграждениеЗаПродажи.Очистить();
	//
	вспВознаграждениеЗаПродажиМастер= ВознаграждениеЗаПродажи.Выгрузить();
	вспВознаграждениеЗаПродажиМастер.Очистить();
	//
	вспВознаграждениеКурьеров = ВознаграждениеКурьеров.Выгрузить();
	вспВознаграждениеКурьеров.Очистить();
	//
	вспНачисленияПоДокументам = НачисленияПоДокументам.Выгрузить();
	вспНачисленияПоДокументам.Очистить();
	
	ДатаНачала = НачалоМесяца (Дата);
	ДатаОкончания = КонецМесяца (Дата);
	
	
	Если СтруктураПараметров.Начисления Тогда
		ЗапросДляРасчетаНачислений = Новый Запрос;//("ВЫБРАТЬ
		ЗапросДляРасчетаНачислений.УстановитьПараметр("РасчетныйПериод",Дата);
		ЗапросДляРасчетаНачислений.УстановитьПараметр("Организация",Организация);
		
		//Получение данных по табелю
		Табель = Документы.уб_ТабельУчетаРабочегоВремени.ПолучитьТаблицуТабеля(Дата);
		//Получаем норму времени в днях 
		//Допущение, что все работают по пятидневке
		НормаДней = ПолучитьНормуРабочихДнейПоКалендарю(,НачалоМесяца(Дата),КонецМесяца(Дата));
		
		Если КомментироватьРасчет Тогда
			ВывестиКомментарий ("Найдены данные табеля: "+Табель.Количество());
			
			ВывестиКомментарий ("Полная норма дней = "+НормаДней,0);
		КонецЕсли;	
		
		//Получаем норму времени в часах 
		//может зависить от ставки
		НормаЧасов = НормаДней*8;
		
		Если КомментироватьРасчет Тогда
			ВывестиКомментарий ("Полная норма часов = "+НормаЧасов,0);
		КонецЕсли;
		
		Если Дата > Дата(2025,7,1) Тогда
			ЗапросДляРасчетаНачислений.Текст =  "ВЫБРАТЬ
			                                    |	Вложенные.Период КАК Объект,
			                                    |	Вложенные.СпособРасчета,
			                                    |	Вложенные.Действует,
			                                    |	Вложенные.Показатель,
			                                    |	Вложенные.Комментарий,
			                                    |	Вложенные.Выбытие
			                                    |ИЗ
			                                    |	(ВЫБРАТЬ
			                                    |		НачисленияМесяца.Начисление КАК Начисление,
			                                    |		НачисленияМесяца.Начисление.СпособРасчета КАК СпособРасчета,
			                                    |		НЕ НачисленияМесяца.НеДействует КАК Действует,
			                                    |		НачисленияМесяца.Показатель КАК Показатель,
			                                    |		НачисленияМесяца.Период КАК Период,
			                                    |		НачисленияМесяца.Сотрудник КАК Сотрудник,
			                                    |		НачисленияМесяца.Комментарий КАК Комментарий,
			                                    |		уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие КАК Выбытие
			                                    |	ИЗ
			                                    |		РегистрСведений.уб_ДействующиеНачисленияСотрудников КАК НачисленияМесяца
			                                    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
			                                    |			ПО НачисленияМесяца.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
			                                    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних2
			                                    |			ПО НачисленияМесяца.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Агент
			                                    |	ГДЕ
			                                    |		НАЧАЛОПЕРИОДА(НачисленияМесяца.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
			                                    |		И НачисленияМесяца.Организация = &Организация
			                                    |		И НЕ(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ИСТИНА
			                                    |					И уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Выбытие = ИСТИНА)
			                                    |	
			                                    |	ОБЪЕДИНИТЬ ВСЕ
			                                    |	
			                                    |	ВЫБРАТЬ
			                                    |		НачисленияНаНачало.Начисление,
			                                    |		НачисленияНаНачало.Начисление.СпособРасчета,
			                                    |		НЕ НачисленияНаНачало.НеДействует,
			                                    |		НачисленияНаНачало.Показатель,
			                                    |		НачисленияНаНачало.Период,
			                                    |		НачисленияНаНачало.Сотрудник,
			                                    |		НачисленияНаНачало.Комментарий,
			                                    |		уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие
			                                    |	ИЗ
			                                    |		РегистрСведений.уб_ДействующиеНачисленияСотрудников.СрезПоследних(НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), Организация = &Организация) КАК НачисленияНаНачало
			                                    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
			                                    |			ПО НачисленияНаНачало.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
			                                    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КОНЕЦПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних2
			                                    |			ПО НачисленияНаНачало.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Агент
			                                    |	ГДЕ
			                                    |		НЕ(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ИСТИНА
			                                    |					И уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Выбытие = ИСТИНА)) КАК Вложенные
			                                    |
			                                    |УПОРЯДОЧИТЬ ПО
			                                    |	Вложенные.Сотрудник.Наименование,
			                                    |	Вложенные.Начисление,
			                                    |	Объект
			                                    |ИТОГИ
			                                    |	ВЫБОР
			                                    |		КОГДА Вложенные.Начисление ЕСТЬ NULL
			                                    |			ТОГДА Вложенные.Сотрудник
			                                    |		ИНАЧЕ Вложенные.Начисление
			                                    |	КОНЕЦ КАК Объект
			                                    |ПО
			                                    |	Вложенные.Сотрудник,
			                                    |	Вложенные.Начисление";
		Иначе		 
			//Заполнение действующими начислениями из регистра сведений 
			ЗапросДляРасчетаНачислений.Текст = "ВЫБРАТЬ
			|	Вложенные.Период КАК Объект,
			|	Вложенные.СпособРасчета,
			|	Вложенные.Действует,
			|	Вложенные.Показатель,
			|	Вложенные.Комментарий
			|ИЗ
			|	(ВЫБРАТЬ
			|		НачисленияМесяца.Начисление КАК Начисление,
			|		НачисленияМесяца.Начисление.СпособРасчета КАК СпособРасчета,
			|		(НЕ НачисленияМесяца.НеДействует) КАК Действует,
			|		НачисленияМесяца.Показатель КАК Показатель,
			|		НачисленияМесяца.Период КАК Период,
			|		НачисленияМесяца.Сотрудник КАК Сотрудник,
			|		НачисленияМесяца.Комментарий КАК Комментарий
			|	ИЗ
			|		РегистрСведений.уб_ДействующиеНачисленияСотрудников КАК НачисленияМесяца
			|	ГДЕ
			|		НАЧАЛОПЕРИОДА(НачисленияМесяца.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
			|		И НачисленияМесяца.Организация = &Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		НачисленияНаНачало.Начисление,
			|		НачисленияНаНачало.Начисление.СпособРасчета,
			|		(НЕ НачисленияНаНачало.НеДействует),
			|		НачисленияНаНачало.Показатель,
			|		НачисленияНаНачало.Период,
			|		НачисленияНаНачало.Сотрудник,
			|		НачисленияНаНачало.Комментарий
			|	ИЗ
			|		РегистрСведений.уб_ДействующиеНачисленияСотрудников.СрезПоследних(НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ), Организация = &Организация) КАК НачисленияНаНачало) КАК Вложенные
			|
			|УПОРЯДОЧИТЬ ПО
			|	Вложенные.Сотрудник.Наименование,
			|	Вложенные.Начисление,
			|	Объект
			|ИТОГИ
			|	ВЫБОР
			|		КОГДА Вложенные.Начисление ЕСТЬ NULL 
			|			ТОГДА Вложенные.Сотрудник
			|		ИНАЧЕ Вложенные.Начисление
			|	КОНЕЦ КАК Объект
			|ПО
			|	Вложенные.Сотрудник,
			|	Вложенные.Начисление";
		КонецЕсли;
		Состояние("1,2 из 4 - Расчет плановых начислений и удержаний");
		Выборка = ЗапросДляРасчетаНачислений.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);					  
		Пока Выборка.Следующий() Цикл
			//
			Сотрудник = Выборка.Объект;
			
			ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);					  
			Если КомментироватьРасчет И ВыборкаНачисления.Количество()>0 Тогда
				ВывестиКомментарий ("Сотрудник: "+Сотрудник,0);
			КонецЕсли;
			КомментарийПериода = "";
			Пока ВыборкаНачисления.Следующий() Цикл
				
				Начисление = ВыборкаНачисления.Объект;
				Способ = Начисление.СпособРасчета;
				бФиксСуммой = Способ=спФиксированнойСуммой;
				
				ВыборкаДаты =  ВыборкаНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);					  
				НачислениеДействует = Ложь;
				ДатаНачалаПодпериода = Неопределено;
				Показатель = 0;
				Пока ВыборкаДаты.Следующий() Цикл
					
					ДатаЗаписи = ВыборкаДаты.Объект;
					
					Если ДатаЗаписи <= НачалоМесяца(Дата) Тогда
						//Изменения до начала, если действуют, то продолжают действовать в периоде
						НачислениеДействует = ВыборкаДаты.Действует;
						Если НачислениеДействует Тогда
							ДатаНачалаПодпериода = НачалоМесяца(Дата);
							Показатель = ВыборкаДаты.Показатель;
							КомментарийПериода = СокрЛП(ВыборкаДаты.Комментарий);
						Иначе
							//Не важно 
						КонецЕсли;	
					Иначе
						//Изменения в периоде
						Если НачислениеДействует Тогда
							
							НачислениеДействует = ВыборкаДаты.Действует; //Новый
							Если НачислениеДействует Тогда
								
								КомментарийПериода = СокрЛП(ВыборкаДаты.Комментарий);
								
								Если Показатель= ВыборкаДаты.Показатель Тогда
									//Действовало и не изменился показатель
								Иначе
									//Действовало и изменился показатель
									Если бФиксСуммой Тогда
										//Поскольку отмены действия нет - это изменения Показателя
										//просто меняем его
										Показатель = ВыборкаДаты.Показатель;
									Иначе	
										ДатаОкончанияПодпериода = НачалоДня(НачалоДня(ВыборкаДаты.Объект)-1); 
										Если ДатаОкончания<НачалоМесяца(Дата) Тогда
											ДатаОкончания = НачалоМесяца(Дата);
										КонецЕсли;	
										РасчитатьПоказатели(Сотрудник,Начисление,КомментарийПериода,ДатаНачалаПодпериода,ДатаОкончанияПодпериода,Показатель,вспНачисления,Табель,НормаЧасов,НормаДней,СтруктураПараметров);
										ДатаНачалаПодпериода = ВыборкаДаты.Объект;
										Показатель = ВыборкаДаты.Показатель;
									Конецесли;
								КонецЕсли;
							Иначе
								//Отмена действия ранее действующего
								ДатаОкончанияПодпериода = НачалоДня(НачалоДня(ВыборкаДаты.Объект)-1); 
								Если ДатаОкончания<НачалоМесяца(Дата) Тогда
									ДатаОкончания = НачалоМесяца(Дата);
								КонецЕсли;	
								РасчитатьПоказатели(Сотрудник,Начисление,КомментарийПериода,ДатаНачалаПодпериода,ДатаОкончанияПодпериода,Показатель,вспНачисления,Табель,НормаЧасов,НормаДней,СтруктураПараметров);
								ДатаНачалаПодпериода = Неопределено;
								Показатель = 0;
							КонецЕсли;	
							
						Иначе
							//Не действовало
							НачислениеДействует = ВыборкаДаты.Действует;
							Если НачислениеДействует Тогда
								//Начало действовать
								ДатаНачалаПодпериода = ВыборкаДаты.Объект;
								Показатель = ВыборкаДаты.Показатель;
								КомментарийПериода = СокрЛП(ВыборкаДаты.Комментарий);
							Иначе
								//Все еще не действует
								ДатаНачалаПодпериода = Неопределено;
								Показатель = 0;
							КонецЕсли;	
						Конецесли;	
					Конецесли;	
					
				КонецЦикла;	
				ДатаОкончанияПодпериода = НачалоДня(КонецМесяца(Дата));
				Если Показатель <>0 И НачислениеДействует Тогда
					РасчитатьПоказатели(Сотрудник,Начисление,КомментарийПериода,ДатаНачалаПодпериода,ДатаОкончанияПодпериода,Показатель,вспНачисления,Табель,НормаЧасов,НормаДней,СтруктураПараметров);	
				КонецЕсли;		
			КонецЦикла;	
			
		КонецЦикла;	
		Если Дата>=Дата(2017,3,1) Тогда
			ДополнитьБонусамиHR(вспНачисления);
		КонецЕсли;
		вспНачисления.Свернуть("Сотрудник,Начисление,Период","Результат");
		
		//возврат;
		//Запрос по штрафам
		Если СтруктураПараметров.Начисления Тогда
			Если Дата > Дата(2025,7,1) Тогда
				ЗапросДляРасчетаНачислений.Текст = "ВЫБРАТЬ
				|	уб_Штрафы.Физлицо КАК Сотрудник,
				|	уб_Штрафы.Штраф КАК Начисление,
				|	СУММА(-уб_Штрафы.СуммаШтрафа) КАК Результат,
				|	&РасчетныйПериод КАК Период
				|ИЗ
				|	РегистрСведений.уб_Штрафы КАК уб_Штрафы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(КонецПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних2
				|		ПО уб_Штрафы.Физлицо = уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Агент
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(НачалоПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних1
				|		ПО уб_Штрафы.Физлицо = уб_ДвижениеФизлицПоПодразделениямСрезПоследних1.Агент
				|ГДЕ
				|	уб_Штрафы.ДатаШтрафа >= НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
				|	И уб_Штрафы.ДатаШтрафа <= КОНЕЦПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
				|	И НЕ уб_Штрафы.Штраф = ЗНАЧЕНИЕ(Справочник.уб_ШтрафныеСанкции.ШтрафнойПлан)
				|	И НЕ(уб_ДвижениеФизлицПоПодразделениямСрезПоследних1.Выбытие = Истина и уб_ДвижениеФизлицПоПодразделениямСрезПоследних2.Выбытие = Истина)
				
				|СГРУППИРОВАТЬ ПО
				|	уб_Штрафы.Физлицо,
				|	уб_Штрафы.Штраф"
			Иначе	
			ЗапросДляРасчетаНачислений.Текст = "ВЫБРАТЬ
			                                   |	уб_Штрафы.Физлицо КАК Сотрудник,
			                                   |	уб_Штрафы.Штраф КАК Начисление,
			                                   |	СУММА(-уб_Штрафы.СуммаШтрафа) КАК Результат,
			                                   |	&РасчетныйПериод КАК Период
			                                   |ИЗ
			                                   |	РегистрСведений.уб_Штрафы КАК уб_Штрафы
			                                   |ГДЕ
			                                   |	уб_Штрафы.ДатаШтрафа >= НАЧАЛОПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
			                                   |	И уб_Штрафы.ДатаШтрафа <= КОНЕЦПЕРИОДА(&РасчетныйПериод, МЕСЯЦ)
			                                   |	И НЕ уб_Штрафы.Штраф = Значение(Справочник.уб_ШтрафныеСанкции.ШтрафнойПлан)
			                                   |
			                                   |СГРУППИРОВАТЬ ПО
			                                   |	уб_Штрафы.Физлицо,
			                                   |	уб_Штрафы.Штраф";
			КонецЕсли;
			ВыборкаШтрафы = ЗапросДляРасчетаНачислений.Выполнить().Выбрать();
			
			Пока ВыборкаШтрафы.Следующий() Цикл
				//
				Если ВыборкаШтрафы.Результат <>0 Тогда
					Строка = вспНачисления.Добавить();
					ЗаполнитьЗначенияСвойств(Строка,ВыборкаШтрафы);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	//Получение данных по зарплате менеджеров
	Состояние("3 из 4 - Расчет зарплаты менеджеров отдела продаж");
	
	Если СтруктураПараметров.ВознаграждениеЗаПродажи Тогда
		Обработка = Обработки.уб_РасчетВМ.Создать();//ПолноеИмяФайла ="d:\1cbases\уб_РасчетВМ.epf";ВнешниеОбработки.Создать(ПолноеИмяФайла);
		Обработка.ЗарплатныйПериод = Дата;
		Обработка.ДатаСреза = ДатаСреза;
		Обработка.ПерезаполнитьВМ = Истина; //Заполнение данных по ВМ в каждой оплате
		Обработка.КоличествоЭтапов = 6; //Заполнение данных по ВМ в каждой оплате
		ТЗ1 = Новый ТаблицаЗначений;
		ТЗАгентов = Новый ТаблицаЗначений;
		тзПодразделений = Новый ТаблицаЗначений;
		тзСхемаРасчетаДляАгентов = Новый ТаблицаЗначений; 
		
		Обработка.РассчитатьТаблицы(ТЗ1, ТЗАгентов, тзПодразделений, тзСхемаРасчетаДляАгентов,, Неопределено);
		
		Для каждого стрАгента из ТзАгентов Цикл
				
			
			ВМ           = ?(стрАгента.ВознаграждениеМенеджера = Неопределено, 0, стрАгента.ВознаграждениеМенеджера);
			ДоСП         = стрАгента.ЗПотСКВдоСуперПлана;
			СверхСП      = стрАгента.ЗПотЗаПревышениеСуперПлана+стрАгента.ЗПЗаПревышение1БП;
			ВычетСАгента = стрАгента.ВычетСАгента;
			БОНУС_КС     = стрАгента.БОНУС_КС_;
			ПоИнтервалам = стрАгента.ВМПоИнтервалам;
			ДК           = ?(стрАгента.ВознаграждениеДоп = Неопределено, 0, стрАгента.ВознаграждениеДоп);
			ВМ           =  ВМ-ДК;
			
			Попытка
				ВознПрол = стрАгента.Зп_Пролонгация;
				ВознНБ = стрАгента.Зп_НовыйБизнес;
			Исключение
				ВознПрол = 0;
				ВознНБ   = 0;
			КонецПопытки;	
			
			ПартнерскоеВознаграждение = стрАгента.ПартнерскоеВознаграждение;
			Если ДоСП<>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПрод;
				//СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ДоСП;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
				//СтрокаВознаграждения.Блокировка = Истина;
			КонецЕсли;	
			Если ДК<>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ДК;
				//СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ДК;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
				//СтрокаВознаграждения.Блокировка = Истина;
			КонецЕсли;	
			
			Если СверхСП<>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродССП;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = СверхСП;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
				//СтрокаВознаграждения.Блокировка = Истина;
			КонецЕсли;	
			
			Если ПоИнтервалам<>0 Тогда
				//
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПоИнтервалам;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ПоИнтервалам;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
			КонецЕсли;	
			
			Если ВознПрол <>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПролонгация;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ВознПрол;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
			КонецЕсли;	
			
			Если ВознНБ <>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознНовыйБизнес;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ВознНБ;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
			КонецЕсли;	
			
			Если стрАгента.ЭтотАгентЕстьВТЗ1 Тогда
				Если ВМ<>0 Тогда
					СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
					СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродВМ;
					СтрокаВознаграждения.Период = Дата;
					СтрокаВознаграждения.Результат = ВМ;
					СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
					//СтрокаВознаграждения.Блокировка = Истина;
				КонецЕсли;	
				Если ВычетСАгента<>0 Тогда
					СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
					СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВычетАгента;
					СтрокаВознаграждения.Период = Дата;
					СтрокаВознаграждения.Результат = -ВычетСАгента;
					СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
					
				КонецЕсли;	
			КонецЕсли;
			Если БОНУС_КС<>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродКС;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = БОНУС_КС;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
			КонецЕсли;	
			
			Если ПартнерскоеВознаграждение<>0 Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПартнеру;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ПартнерскоеВознаграждение;
				СтрокаВознаграждения.Сотрудник = стрАгента.Агент;
			КонецЕсли;
			//Расчитываемые данные всегда заблокированы
			//СтрокаВознаграждения.Блокировка = Истина;
			
		КонецЦикла;	
		
		Для каждого стрПодразделения из тзПодразделений Цикл
			
			Если КомментироватьРасчет  Тогда
				ВывестиКомментарий ("Подразделение: "+стрПодразделения.Подразделение,0);
			КонецЕсли;
			ОплатаРуководителяОП =  стрПодразделения.СуммаВознаграждения_РОП;//+стрПодразделения.БОНУС_РОП_КС_;
			
			//Если не рассчитана сразу пропускается
			Если ОплатаРуководителяОП = 0 Тогда
				//
				Если КомментироватьРасчет  Тогда
					ВывестиКомментарий ("Сумма ОплатаРуководителяОП = 0",1);
				КонецЕсли;
				Продолжить;
			КонецЕсли;	
			
			//Получение руководителя подразделения
			
			МЗ = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаОкончания, стрПодразделения.Подразделение);
			
			
			//Проверка на наличие руководителя
			
			Если МЗ.Сотрудник.Пустая() или МЗ.Уход Тогда
				//
				Если КомментироватьРасчет  Тогда
					ВывестиКомментарий ("Не обнаружен действующий руководитель подразделения!",1);
				КонецЕсли;
				Продолжить;
			КонецЕсли;	
			
			//Проверка на необходимость доплаты
			ПолучаетВознаграждениеЗаРуководствоОтделом = МЗ.ПолучаетВознаграждениеЗаРуководство;
			
			Если ПолучаетВознаграждениеЗаРуководствоОтделом Тогда
				
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				Если Дата>=Дата(2024,7,1) Тогда
					СтрокаВознаграждения.Начисление = ""+ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП")+" ("+СокрЛП(стрПодразделения.Подразделение)+")";
				Иначе	
					СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП");
				КонецЕсли;	
				СтрокаВознаграждения.Период = Дата;
				Попытка
					СтрокаВознаграждения.Результат = ОплатаРуководителяОП-стрПодразделения.СуммаВознаграждения_РОП_НБ-стрПодразделения.СуммаВознаграждения_РОП_Прол;
				Исключение
					СтрокаВознаграждения.Результат = ОплатаРуководителяОП;
				КонецПопытки;	
				СтрокаВознаграждения.Сотрудник = МЗ.Сотрудник;
				
				
				Попытка
					Если стрПодразделения.СуммаВознаграждения_РОП_НБ<>0 Тогда
						СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
						Если Дата>=Дата(2024,7,1) Тогда
							СтрокаВознаграждения.Начисление = ""+ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознРукНБ+" ("+СокрЛП(стрПодразделения.Подразделение)+")";
						Иначе	
							СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознРукНБ;
						КонецЕсли;
						СтрокаВознаграждения.Период = Дата;
						СтрокаВознаграждения.Результат = стрПодразделения.СуммаВознаграждения_РОП_НБ;
						СтрокаВознаграждения.Сотрудник = МЗ.Сотрудник;
					КонецЕсли;
					
					Если стрПодразделения.СуммаВознаграждения_РОП_Прол<>0 Тогда
						СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
						Если Дата>=Дата(2024,7,1) Тогда
							СтрокаВознаграждения.Начисление = ""+ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознРукПрол+" ("+СокрЛП(стрПодразделения.Подразделение)+")";
						Иначе	
							СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознРукПрол;
						КонецЕсли;	
						СтрокаВознаграждения.Период = Дата;
						СтрокаВознаграждения.Результат = стрПодразделения.СуммаВознаграждения_РОП_Прол;
						СтрокаВознаграждения.Сотрудник = МЗ.Сотрудник;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				//Расчитываемые данные всегда заблокированы
				//СтрокаВознаграждения.Блокировка = Истина;
			Иначе
				Если КомментироватьРасчет  Тогда
					ВывестиКомментарий ("У руководителя "+МЗ.Сотрудник +" не отмечено ПолучаетВознаграждениеЗаРуководство ",1);
				КонецЕсли;
			КонецЕсли;
			Если Дата>=Дата(2017,1,1) Тогда
				МЗ2 = уб_СтраховойБрокер.ПолучитьРуководителяПодразделения(ДатаОкончания, стрПодразделения.Подразделение,Истина);
				Если МЗ2.Сотрудник.Пустая() ИЛИ МЗ2.Уход Тогда
					Зам = Справочники.ФизическиеЛица.ПустаяСсылка();
					ЗамПолучаетВознаграждение = Ложь;
				Иначе
					Зам = МЗ2.Сотрудник;
					ЗамПолучаетВознаграждение = МЗ2.ПолучаетВознаграждениеЗаРуководство;
					
				КонецЕсли;
				Если ЗамПолучаетВознаграждение Тогда
					СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
					Если Дата>=Дата(2024,7,1) Тогда
						СтрокаВознаграждения.Начисление = ""+ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП")+" зам.("+СокрЛП(стрПодразделения.Подразделение)+")";
					Иначе	
						СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП");
					КонецЕсли;	
					СтрокаВознаграждения.Период = Дата;
					СтрокаВознаграждения.Результат = стрПодразделения.СуммаВознаграждения_ЗамРОП;
					СтрокаВознаграждения.Сотрудник = Зам;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		//ДРП
		ЗапросДРП = Новый Запрос;
		ЗапросДРП.Текст = "ВЫБРАТЬ
		                  |	уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.Подразделение,
		                  |	уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.Период,
		                  |	уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.НеДействует,
		                  |	уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство,
		                  |	уб_РуководителиПодразделенийСрезПоследних.Сотрудник
		                  |ИЗ
		                  |	РегистрСведений.уб_ЗП_СхемыВознагражденияРуководителейОП.СрезПоследних(&Дата, ) КАК уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних
		                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Дата, ) КАК уб_РуководителиПодразделенийСрезПоследних
		                  |		ПО уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.Подразделение = уб_РуководителиПодразделенийСрезПоследних.Подразделение
		                  |ГДЕ
		                  |	уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.СхемаВознагражденияРуководителяОП = ЗНАЧЕНИЕ(Перечисление.уб_ЗП_СхемыВознагражденияРуководителейОП.Алгоритм)
		                  |	И уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.НеДействует = ЛОЖЬ
		                  |	И уб_РуководителиПодразделенийСрезПоследних.ПолучаетВознаграждениеЗаРуководство
		                  |	И уб_РуководителиПодразделенийСрезПоследних.Сотрудник <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	   ЗапросДРП.УстановитьПараметр("Дата",ДатаНачала);
	   
	//И уб_ЗП_СхемыВознагражденияРуководителейОПСрезПоследних.Подразделение.Наименование ="ОП-Купиполис"";
		
		РезДРП = ЗапросДРП.Выполнить();
		Если НЕ РезДРП.Пустой() Тогда
			ПараметрыРасчетаЗП = Новый Структура("НачПериода,КонПериода,ВключитьЗаводы,РабочийРежим",ДатаНачала,ДатаОкончания,Ложь,Истина);
			Отчеты.СтатистикаСКВиКВ.РасчитатьЗП(ПараметрыРасчетаЗП);
		КонецЕсли;	
		
		ВыборкаДРП = РезДРП.Выбрать();
		Пока ВыборкаДРП.Следующий() Цикл
			//Сообщить("Премия ДРП "+ПараметрыРасчетаЗП.ЗП_БезОклада);
			//
			Если ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам<>0 Тогда
			СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
			СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознДРП_Авто;
			СтрокаВознаграждения.Период = Дата;
			СтрокаВознаграждения.Результат = ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_Моторам;
			СтрокаВознаграждения.Сотрудник = ВыборкаДРП.Сотрудник;
			КонецЕсли;
			//
			Если ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам<>0 Тогда
			СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
			СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознДРП_НеАвто;
			СтрокаВознаграждения.Период = Дата;
			СтрокаВознаграждения.Результат = ПараметрыРасчетаЗП.За_СКВ_До_Планки_По_НЕ_Моторам;
			СтрокаВознаграждения.Сотрудник = ВыборкаДРП.Сотрудник;
			КонецЕсли;
			//
			Если ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам<>0 Тогда
			СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
			СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознДРП_АвтоСверх;
			СтрокаВознаграждения.Период = Дата;
			СтрокаВознаграждения.Результат = ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_Моторам;
			СтрокаВознаграждения.Сотрудник = ВыборкаДРП.Сотрудник;
			КонецЕсли;
			//
			Если ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам<>0 Тогда
			СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
			СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознДРП_НеАвтоСверх;
			СтрокаВознаграждения.Период = Дата;
			СтрокаВознаграждения.Результат = ПараметрыРасчетаЗП.За_СКВ_Сверх_Планки_По_НЕ_Моторам;
			СтрокаВознаграждения.Сотрудник = ВыборкаДРП.Сотрудник;
			КонецЕсли;
			Если Дата >=Дата(2019,8,1) Тогда
				СтрокаВознаграждения = 	вспВознаграждениеЗаПродажи.Добавить();
				СтрокаВознаграждения.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПоИнтервалам;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = ПараметрыРасчетаЗП.ЗП_БезОклада;
				СтрокаВознаграждения.Сотрудник = ВыборкаДРП.Сотрудник;
			КонецЕсли;	
		КонецЦикла;
	
		
		Состояние("3 из 4 - Расчет зарплаты менеджеров отдела продаж/штрафы");
		вспВознаграждениеЗаПродажи.Свернуть("Начисление,Период,Сотрудник,Первоначальная","Результат");
		
		вспВознаграждениеЗаПродажи.Сортировать("Сотрудник,Начисление,Период");
		
		_Начисление=ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ЗаОшибки");
		ТаблицаШтрафовЗаОшибки = РегистрыСведений.уб_Ошибки.ОшибкиПериода(Дата);
		ТаблицаШтрафовЗаОшибки.Свернуть("Сотрудник,Объект","Штраф");//Ошибок может быть несколько для одного документа, но в начислении мы детально не отслеживаем
		
		Для каждого Строка из ТаблицаШтрафовЗаОшибки Цикл
			Если НЕ Строка.Сотрудник.Пустая() Тогда
				СтрокаВознаграждения = 	вспНачисленияПоДокументам.Добавить();
				СтрокаВознаграждения.Начисление = _Начисление;
				СтрокаВознаграждения.Период = Дата;
				СтрокаВознаграждения.Результат = -Строка.Штраф;
				СтрокаВознаграждения.Сотрудник = Строка.Сотрудник;
				СтрокаВознаграждения.Документ = Строка.Объект;
			КонецЕсли;	
		КонецЦикла;	
		
		//Пропуски на въезд
		ЗапросВ = Новый Запрос;
		ЗапросВ.Текст = ТекстВъезда();  
		ЗапросВ.УстановитьПараметр("Дата1",ДатаНачала);
		ЗапросВ.УстановитьПараметр("Дата2",ДатаОкончания);
		_Начисление =ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВычетЗаВъезд;
		Выборка = ЗапросВ.Выполнить().Выбрать(); 
		пока выборка.Следующий() Цикл
			
			СтрокаВознаграждения = 	вспНачисленияПоДокументам.Добавить();
			СтрокаВознаграждения.Начисление = _Начисление;
			СтрокаВознаграждения.Период     = Дата;
			СтрокаВознаграждения.Результат  = - Выборка.Стоимость;
			СтрокаВознаграждения.Сотрудник  = Выборка.Заказчик;
			СтрокаВознаграждения.Документ   = Выборка.Ссылка;
		КонецЦикла;	
		
		Если Дата>=Дата(2024,1,1) Тогда
			
			ЗапросВ = Новый Запрос;
			ЗапросВ.Текст = ТекстРекомендации();  
			ЗапросВ.УстановитьПараметр("ДатаНачала",ДатаНачала);
			ЗапросВ.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
			_Начисление =ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознЗаРекомендацию;
			_НачислениеКлуб =ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознЗаПовышенныйКВ;
			Выборка = ЗапросВ.Выполнить().Выбрать(); 
			Пока Выборка.Следующий() Цикл
				Если Выборка.Вознаграждение>0 тогда
					СтрокаВознаграждения = 	вспНачисленияПоДокументам.Добавить();
					СтрокаВознаграждения.Начисление = _Начисление;
					СтрокаВознаграждения.Период     = Дата;
					СтрокаВознаграждения.Результат  = Выборка.Вознаграждение;
					СтрокаВознаграждения.Сотрудник  = Выборка.Менеджер;
					СтрокаВознаграждения.Документ   = Выборка.Заявка;
				КонецЕсли;
				Если Выборка.ЗаКлуб30>0 тогда
					СтрокаВознаграждения = 	вспНачисленияПоДокументам.Добавить();
					Если Дата>=Дата(2025,3,1) Тогда
						СтрокаВознаграждения.Начисление = Выборка.Вид;
					Иначе
						СтрокаВознаграждения.Начисление = _НачислениеКлуб;
					КонецЕсли;	
					СтрокаВознаграждения.Период     = Дата;
					СтрокаВознаграждения.Результат  = Выборка.ЗаКлуб30;
					СтрокаВознаграждения.Сотрудник  = Выборка.Менеджер;
					СтрокаВознаграждения.Документ   = Выборка.Заявка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Конецесли;
	
	//Рассчет курьерского вознагражения
	Если СтруктураПараметров.ВознаграждениеКурьеров Тогда
		Если Дата<Дата(2016,8,1) Тогда
			
			ЗапросЗПКурьеров = Новый Запрос(
			"ВЫБРАТЬ
				|	СЗ.Заявка,
				|	СЗ.Статус
				|ПОМЕСТИТЬ ВТ_Статус
				|ИЗ
				|	РегистрСведений.уб_ИсторияСтатусовЗаявок.СрезПоследних КАК СЗ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА З.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|		ИНАЧЕ З.Менеджер
				|	КОНЕЦ КАК ИсточникФинансирования,
				|	ВЫБОР
				|		КОГДА З.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|		ИНАЧЕ З.Курьер
				|	КОНЕЦ КАК Сотрудник,
				|	СУММА(З.ВознаграждениеКурьера) КАК Результат,
				|	&РасчетныйПериод КАК Период,
				|	ВЫБОР
				|		КОГДА З.ИсточникФинансирования = ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Менеджер)
				|			ТОГДА СУММА(З.ОплатитьВКассуЗаВыездКурьера)
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК РезультатДляИсточника,
				|	З.Ссылка КАК Заявка
				|ИЗ
				|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Статус КАК ВТ_Статус
				|		ПО (ВТ_Статус.Заявка = З.Ссылка)
				|ГДЕ
				|	З.Дата >= &ДатаНач
				|	И З.Дата <= &ДатаКон
				|	И З.Проведен
				|	И З.Утверждено
				|	И НЕ З.Самовыезд
				|	И (З.Дата < ДАТАВРЕМЯ(2013, 11, 1, 0, 0, 0)
				|			ИЛИ НЕ ВТ_Статус.Статус В (ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.СтраховкаНеСостоялась), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.ЗапросНаУдаление), ЗНАЧЕНИЕ(Перечисление.уб_СтатусыЗаявок.Удалена)))
				|
				|СГРУППИРОВАТЬ ПО
				|	З.ОплатитьВКассуЗаВыездКурьера,
				|	З.Ссылка,
				|	ВЫБОР
				|		КОГДА З.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|		ИНАЧЕ З.Менеджер
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА З.Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|		ИНАЧЕ З.Курьер
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА З.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|				ИЛИ З.ИсточникФинансирования <> ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Менеджер)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|		ИНАЧЕ З.Менеджер
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА З.ИсточникФинансирования <> ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Менеджер)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|		ИНАЧЕ ВЫБОР
				|				КОГДА З.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|						ИЛИ З.ИсточникФинансирования <> ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Менеджер)
				|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|				ИНАЧЕ З.Менеджер
				|			КОНЕЦ
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА З.ИсточникФинансирования <> ЗНАЧЕНИЕ(Перечисление.уб_ИсточникиФинансирования.Менеджер)
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|		ИНАЧЕ ВЫБОР
				|				КОГДА З.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|					ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустойАгент)
				|				ИНАЧЕ З.Менеджер
				|			КОНЕЦ
				|	КОНЕЦ,
				|	З.ИсточникФинансирования
				|
				|УПОРЯДОЧИТЬ ПО
				|	Сотрудник,
			    |	ИсточникФинансирования");
	Иначе
		ЗапросЗПКурьеров = Новый Запрос;
		//Текст запроса универсальный для отчетов и документа заявки
		ЗапросЗПКурьеров.Текст = Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ТекстЗапросаВК(Дата)
		//производится суммирование
		+ Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ДопЗапросРасчетЗП();
		ЗапросЗПКурьеров.УстановитьПараметр("Заявка",Документы.уб_ЗаявкаНаЗаказВыездногоСпециалиста.ПустаяСсылка());
		ЗапросЗПКурьеров.УстановитьПараметр("Курьер",Справочники.ФизическиеЛица.ПустаяСсылка());
		ЗапросЗПКурьеров.УстановитьПараметр("ПросчитыватьСУчетомНепроведенных", Ложь);
		ЗапросЗПКурьеров.УстановитьПараметр("ПросчитыватьСУчетомНеподтвержденных", Ложь);
		Если Дата = Дата(2017,1,1) Тогда
			ЗапросЗПКурьеров.УстановитьПараметр("План250", 75);
			ЗапросЗПКурьеров.УстановитьПараметр("План200", 49);	
		Иначе
			ЗапросЗПКурьеров.УстановитьПараметр("План250", 100);
			ЗапросЗПКурьеров.УстановитьПараметр("План200", 65);	
		КонецЕсли;
	КонецЕсли;
		ЗапросЗПКурьеров.УстановитьПараметр("ДатаНач"   , 		ДатаНачала);
		ЗапросЗПКурьеров.УстановитьПараметр("ДатаКон",		ДатаОкончания);
	
		ЗапросЗПКурьеров.УстановитьПараметр("РасчетныйПериод", 	Дата);

		НеопределенныйАгент = ПараметрыСеанса.уб_Константы.НеопределенАгент;		
		Состояние("4 из 4 - Расчет зарплаты СВС");
		
		ЗапросЗПКурьеров.УстановитьПараметр("СчитатьВнешних",ЛОЖЬ);
		
		Выборка = ЗапросЗПКурьеров.Выполнить().Выбрать();
		Если КомментироватьРасчет  Тогда
			ВывестиКомментарий ("Расчет ЗП курьеров, количество в выборке = "+Выборка.Количество(),0);
		КонецЕсли;
		СчетчикЛЗ = 0;		
		Пока Выборка.Следующий() Цикл
			//
			//Если Выборка.Результат=0 Тогда
			//	Продолжить;
			//КонецЕсли;				
			СтрокаВознаграждения = вспВознаграждениеКурьеров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВознаграждения,Выборка);
			//Расчитываемые данные всегда заблокированы
			//СтрокаВознаграждения.Блокировка = Истина;
			Разница = Выборка.РезультатДляИсточника-Выборка.Результат;
			Если Разница > 0 ТОгда
				//Личная заявка или источник финансирования отличен от менеджера
				счетчикЛЗ=СчетчикЛЗ+1;
			КонецЕсли;	
			
		КонецЦикла;	
		Если КомментироватьРасчет  Тогда
			ВывестиКомментарий ("Обнаружено "+счетчикЛЗ+" личных заявок",1);
		КонецЕсли;
	КонецЕсли;
	//Если Не Подписан Тогда
	//	//Затирается полученными таблицами
	//	Начисления.Загрузить(вспНачисления);
	//	//
	//	Удержания.Загрузить(вспУдержания);
	//	//
	//	ВознаграждениеЗаПродажи.Загрузить(вспВознаграждениеЗаПродажи);
	//	//
	//	ВознаграждениеКурьеров.Загрузить(вспВознаграждениеКурьеров);
	//Иначе
	Состояние("Отражение расчетов и вывод протокола");
	Если ПротоколРасхождений = Неопределено Тогда
		ПротоколРасхождений = Новый ТабличныйДокумент;
	КонецЕсли;
	ПротоколРасхождений.НачатьАвтогруппировкуСтрок();
	Макет = ПолучитьМакет("ПротоколИзменений");
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("Заголовок");
	ЗаголовокТаблицы.Параметры.ТекущаяДата= ТекущаяДата();
	ЗаголовокТаблицы.Параметры.РасчетныйПериод = Формат(Дата,"ДФ='MMMM yyyy'") + " г.";
	ЗаголовокТаблицы.Параметры.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ПротоколРасхождений.Вывести(ЗаголовокТаблицы);
	
	СписокСотрудниковБезПерерасчета = ПолучитьЗакрытыеВзаиморасчеты();
	Если (Дата<Дата(2017,1,1) И Дата > Дата(2016,7,1)) или Дата >= Дата(2018,7,1) и дата<дата(2023,8,1) Тогда
		ПодменаСотрудников = СобратьПодмены();
	Иначе
		ПодменаСотрудников = Новый Соответствие;
	КонецЕсли;
	
	//МАСТЕР+++
	Если 
		(Дата>=Дата(2018,7,1) или
		(Дата>=Дата(2017,1,1) и Дата<Дата(2017,10,1)))
		и дата<дата(2023,8,1)
		Тогда
		СотрудникиМастера  = СобратьПодмены();
		//ВММастер =  0;
		Для Каждого СотрудникМ Из СотрудникиМастера  Цикл
			
			СтрокиНач = вспНачисления.НайтиСтроки(Новый Структура("Сотрудник",СотрудникМ.Ключ));
			Для Каждого СтрокаН Из СтрокиНач Цикл
				//ВММастер = ВММастер+СтрокаН.Результат;
				Если Дата>=Дата(2018,7,1) Тогда
					//Сторнируем всё
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					//СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = 0;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная =Истина;
				Иначе	
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = -СтрокаСводно.Результат;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная =Истина;
				КонецЕсли;
			КонецЦикла;
			
			СтрокиНач = вспВознаграждениеЗаПродажи.НайтиСтроки(Новый Структура("Сотрудник",СотрудникМ.Ключ));
			Для Каждого СтрокаН Из СтрокиНач Цикл
				Если Дата>=Дата(2018,7,1) и СтрокаН.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродВМ Тогда
					//Лички пропускаем
				ИначеЕсли Дата>=Дата(2018,7,1) Тогда
					//СТОРНО
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					//СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = 0;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная = Истина;
				Иначе	
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = - СтрокаСводно.Результат;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная = Истина;
				КонецЕсли;
			КонецЦикла;
			
			СтрокиНач = вспНачисленияПоДокументам.НайтиСтроки(Новый Структура("Сотрудник",СотрудникМ.Ключ));
			Для Каждого СтрокаН Из СтрокиНач Цикл
				Если Дата>=Дата(2018,7,1) Тогда
					//СТОРНО
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					//СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = 0;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная =Истина;
				Иначе	
					СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
					СтрокаСводно.Сотрудник = СотрудникМ.Значение;
					СтрокаСводно.Результат = -СтрокаСводно.Результат;
					СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
					СтрокаСводно.Первоначальная =Истина;
				КонецЕсли;	
			КонецЦикла;
 		
			//СтрокиНач = вспВознаграждениеКурьеров.НайтиСтроки(Новый Структура("ИсточникФинансирования",СотрудникМ.Ключ));
			//Для Каждого СтрокаН Из СтрокиНач Цикл
			//	СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
			//	СтрокаСводно.Сотрудник = СотрудникМ.Значение;
			//	СтрокаСводно.Результат = СтрокаН.РезультатДляИсточника;
			//	СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
			//СтрокаСводно.Первоначальная =Истина;
			//КонецЦикла;
			
			СтрокиНач = НачисленияРазовые.НайтиСтроки(Новый Структура("Сотрудник",СотрудникМ.Ключ));
			Для Каждого СтрокаН Из СтрокиНач Цикл
				Если СтрокаН.Результат >0 Тогда
					Если Дата>=Дата(2018,7,1) Тогда
						СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
						СтрокаСводно.Сотрудник = СотрудникМ.Значение;
						СтрокаСводно.Результат = 0;
						СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
						СтрокаСводно.Первоначальная =Истина;
					Иначе	
						
						СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСводно,СтрокаН);
						СтрокаСводно.Сотрудник = СотрудникМ.Значение;
						СтрокаСводно.Результат = -СтрокаСводно.Результат;
						СтрокаСводно.Период = Дата;//СтрокаСводно.Период = СтруктураПараметров.ДатаРегистрацииРасчета;
						СтрокаСводно.Первоначальная =Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		вспВознаграждениеЗаПродажиМастер.Свернуть("Сотрудник,Начисление,Первоначальная,Период","Результат");
		СКВМастер = ПолучитьСКВМастер();
		
		Если СотрудникиМастера.Количество()>0 Тогда
			Для Каждого СотрудникМ Из  СотрудникиМастера Цикл
				Прервать;
			КонецЦикла;
			СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Вставить(0);
			СтрокаСводно.Сотрудник = СотрудникМ.Значение;
			СтрокаСводно.Начисление     = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПоИнтервалам;
			СтрокаСводно.Первоначальная = Истина;
			СтрокаСводно.Период = Дата;//СтрокаСводно.Период         = СтруктураПараметров.ДатаРегистрацииРасчета;
			СтрокаСводно.Результат      = СКВМастер;
			//
			СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Вставить(1);
			СтрокаСводно.Сотрудник = СотрудникМ.Значение;
			СтрокаСводно.Начисление     = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПартнеру;
			СтрокаСводно.Первоначальная = Истина;
			СтрокаСводно.Период = Дата;//СтрокаСводно.Период         = СтруктураПараметров.ДатаРегистрацииРасчета;
			СтрокаСводно.Результат      = -СКВМастер*0.3;
			СтруктураДопов = ДопыМастера(?(Дата>=Дата(2017,3,1) и Дата<Дата(2018,7,1),450,200));
			Если СтруктураДопов.Мастеру<>0 Тогда
				СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Вставить(2);
				СтрокаСводно.Сотрудник = СотрудникМ.Значение;
				СтрокаСводно.Начисление     = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознЗаДК;
				СтрокаСводно.Первоначальная = Истина;
				СтрокаСводно.Период = Дата;//СтрокаСводно.Период         = СтруктураПараметров.ДатаРегистрацииРасчета;
				СтрокаСводно.Результат      = СтруктураДопов.Мастеру;
			КонецЕсли;
			Если СтруктураДопов.ВМ<>0 Тогда
				СтрокаСводно = вспВознаграждениеЗаПродажиМастер.Вставить(3);
				СтрокаСводно.Сотрудник = СотрудникМ.Значение;
				СтрокаСводно.Начисление     = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродВМ;//ВознПродВМ;
				СтрокаСводно.Первоначальная = Истина;
				СтрокаСводно.Период = Дата;//СтрокаСводно.Период         = СтруктураПараметров.ДатаРегистрацииРасчета;
				СтрокаСводно.Результат      = СтруктураДопов.ВМ;
			КонецЕсли;
			вспВознаграждениеЗаПродажиМастер.Свернуть("Сотрудник,Начисление,Первоначальная,Период","Результат");
			Для Каждого СтрокаСводно Из вспВознаграждениеЗаПродажиМастер Цикл
				СтрокаСводноДоп = вспВознаграждениеЗаПродажи.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСводноДоп,СтрокаСводно);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	//МАСТЕР---
		
	БылиРасхождения = Ложь;
	Если СтруктураПараметров.Начисления Тогда
		//Производится сравнение таблиц
		ОбластьШапки = Макет.ПолучитьОбласть("ШапкаНачисления");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаНачисления");
		СписокКлючевыхПолей = Новый Массив;
		СписокКлючевыхПолей.Добавить("Сотрудник");
		СписокКлючевыхПолей.Добавить("Начисление");
		СписокРесурсов = Новый Массив;
		СписокРесурсов.Добавить("Результат");
		
		Если отразитьПодмены(вспНачисления,ПодменаСотрудников,"Сотрудник") =Истина Тогда
			//вспНачисления.Свернуть("Сотрудник,Начисление,Первоначальная,Период","Результат");
			вспНачисления.Свернуть("Сотрудник,Начисление,Период","Результат");
		КонецЕсли;
		
			
		БылиРасхождения = ОтразитьРасхождения(
			Начисления,
			вспНачисления,
			СписокКлючевыхПолей,
			БылиРасхождения,
			ПротоколРасхождений,
			ОбластьШапки,
			ОбластьСтроки,
			СтруктураПараметров.ДатаРегистрацииРасчета,
			СписокРесурсов,
			,
			СписокСотрудниковБезПерерасчета
		);
	Конецесли;
	
	Если СтруктураПараметров.ВознаграждениеЗаПродажи Тогда
		ОбластьШапки = Макет.ПолучитьОбласть("ШапкаВознаграждениеЗаПродажи");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаВознаграждениеЗаПродажи");
		СписокКлючевыхПолей = Новый Массив;
		СписокКлючевыхПолей.Добавить("Сотрудник");
		СписокКлючевыхПолей.Добавить("Начисление");
		СписокРесурсов = Новый Массив;
		СписокРесурсов.Добавить("Результат");
		Исключения = Новый Массив;
		Исключения.Добавить(ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПродВМ);
		Если отразитьПодмены(вспВознаграждениеЗаПродажи,ПодменаСотрудников,"Сотрудник",Исключения) = Истина Тогда
			вспВознаграждениеЗаПродажи.Свернуть("Сотрудник,Начисление,Первоначальная,Период","Результат");
		КонецЕсли;
		
		БылиРасхождения = ОтразитьРасхождения(ВознаграждениеЗаПродажи,вспВознаграждениеЗаПродажи,СписокКлючевыхПолей, БылиРасхождения,ПротоколРасхождений,ОбластьШапки,ОбластьСтроки,СтруктураПараметров.ДатаРегистрацииРасчета,СписокРесурсов,,СписокСотрудниковБезПерерасчета);
		
		
		ОбластьШапки = Макет.ПолучитьОбласть("ШапкаПоДокументам");
		ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаУдержания");
		СписокКлючевыхПолей = Новый Массив;
		СписокКлючевыхПолей.Добавить("Сотрудник");
		СписокКлючевыхПолей.Добавить("Начисление"); 
		СписокКлючевыхПолей.Добавить("Документ");
		СписокРесурсов = Новый Массив;
		СписокРесурсов.Добавить("Результат");
		отразитьПодмены(вспНачисленияПоДокументам,ПодменаСотрудников,"Сотрудник");
		БылиРасхождения = ОтразитьРасхождения(НачисленияПоДокументам,вспНачисленияПоДокументам,СписокКлючевыхПолей, БылиРасхождения,ПротоколРасхождений,ОбластьШапки,ОбластьСтроки,СтруктураПараметров.ДатаРегистрацииРасчета,СписокРесурсов,,СписокСотрудниковБезПерерасчета);
	КонецЕсли;	
	Если СтруктураПараметров.ВознаграждениеКурьеров Тогда
		Если Дата > Дата(2018,1,1) Тогда
			
			
			ОбластьШапки = Макет.ПолучитьОбласть("ШапкаВознаграждениеКурьеров");
			ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаВознаграждениеКурьеров");
			СписокКлючевыхПолей = Новый Массив;
			СписокКлючевыхПолей.Добавить("Сотрудник");
			СписокКлючевыхПолей.Добавить("Начисление");
			СписокКлючевыхПолей.Добавить("ИсточникФинансирования");
			СписокКлючевыхПолей.Добавить("Заявка");
			
			СписокРесурсов = Новый Массив;
			СписокРесурсов.Добавить("Результат");
			СписокРесурсов.Добавить("РезультатДляИсточника");
			Если Дата < Дата(2018,7,1) Тогда
				БылиПодмены  = отразитьПодмены(вспВознаграждениеКурьеров,ПодменаСотрудников,"Сотрудник");
				БылиПодмены = отразитьПодмены(вспВознаграждениеКурьеров,ПодменаСотрудников,"ИсточникФинансирования") или БылиПодмены;
			КонецЕсли;	
			Если БылиПодмены = Истина Тогда
				вспВознаграждениеКурьеров.Свернуть("Сотрудник,Начисление,Первоначальная,Заявка,Период,ИсточникФинансирования","Результат,РезультатДляИсточника");
			КонецЕсли;
			
			БылиРасхождения = ОтразитьРасхождения(ВознаграждениеКурьеров, вспВознаграждениеКурьеров,СписокКлючевыхПолей, БылиРасхождения,ПротоколРасхождений,ОбластьШапки,ОбластьСтроки,СтруктураПараметров.ДатаРегистрацииРасчета,СписокРесурсов, Истина,СписокСотрудниковБезПерерасчета);
		КонецЕсли;	
	КонецЕсли;
	
	//Обнаружены и зарегистрированы расхождения
	Если БылиРасхождения Тогда
		ПротоколРасхождений.ТолькоПросмотр		= Истина;
		ПротоколРасхождений.ОтображатьЗаголовки = Ложь;
		ПротоколРасхождений.ОтображатьСетку 	= Ложь;
		ПротоколРасхождений.ЗакончитьАвтогруппировкуСтрок();
		Если СтруктураПараметров.Свойство("ВыводитьПротокол") И СтруктураПараметров.ВыводитьПротокол = Истина Тогда
			// по умолчанию не выводится протокол 
			ПротоколРасхождений.Показать("Протокол изменений в документе при перерасчете");
		Иначе
			Область = Макет.ПолучитьОбласть("ПустаяСтрока");
			ПротоколРасхождений.Вывести(Область);
		КонецЕсли;	
	КонецЕсли;	
	
	БылоЗаполнение = Истина;
	
	Если Не СтруктураПараметров.Свойство("Записать")
		Или СтруктураПараметров.Записать = Истина 
		Тогда
		//по умолчанию и по установленному параметру записываются изменения
		СжатьПравки();
		Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	КонецЕсли;
	
КонецПроцедуры	

// Процедура расчитывает показатели за переданный подпериод
Процедура РасчитатьПоказатели(
	Сотрудник,
	Начисление,
	КомментарийПериода,
	ДатаНачалаПодпериода,
	ДатаОкончанияПодпериода,
	Показатель,
	вспНачисления,
	Табель,
	НормаЧасов,
	НормаДней,
	СтруктураПараметров
	);
	
	спФиксированнойСуммой = Перечисления.уб_СпособРасчетаНачисления.ФиксированнойСуммой;
	спПроцентом = Перечисления.уб_СпособРасчетаНачисления.Процентом;
	спПоМесячнойТарифнойСтавкеПоДням = Перечисления.уб_СпособРасчетаНачисления.ПоМесячнойТарифнойСтавкеПоДням;
	спПоМесячнойТарифнойСтавкеПоЧасам = Перечисления.уб_СпособРасчетаНачисления.ПоМесячнойТарифнойСтавкеПоЧасам;
	Комент = СокрЛП(КомментарийПериода);
	Если НЕ Показатель = 0 Тогда
		Если СтруктураПараметров.Начисления Тогда
			Строка = вспНачисления.Добавить();
			Строка.Сотрудник   = Сотрудник;
			Если Комент="" Тогда
				Строка.Начисление  = Начисление;
			Иначе
				Строка.Начисление  = ""+Начисление+" / "+Комент;
			КонецЕсли;	
			Строка.Период      = Дата;//????
			//Строка.Показатель  = Показатель;
			Строка.Результат   = 0;
		Иначе
			//Не перезаполняем начисления
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметров.КомментироватьРасчет Тогда
		ВывестиКомментарий ("Начисление: "+Начисление,1);
		ВывестиКомментарий ("Способ расчета: "+Начисление.СпособРасчета,1);
		ВывестиКомментарий ("Подпериод: "+ПредставлениеПериода(ДатаНачалаПодпериода,КонецДня(ДатаОкончанияПодпериода),"ДП=истина"),2);
	КонецЕсли;
	
	//Поиск данных табелирования
	
	//ВыборкаТабелирования.Сбросить();
	
	//СтруктураПоиска = Новый Структура ("Сотрудник",Сотрудник);
	СтрокаТабеля = Табель.Найти(Сотрудник,"Сотрудник");
	Если НЕ СтрокаТабеля = Неопределено Тогда
		//
		//ФактДней  = ВыборкаТабелирования.ВсегоДней;
		//ФактЧасов = ВыборкаТабелирования.ВсегоЧасов;
		ФактДней  = 0;
		ФактЧасов = 0;
		
		УчтеннаяДата = Неопределено;
		Пока УчтеннаяДата = Неопределено ИЛИ УчтеннаяДата<=ДатаОкончанияПодпериода  Цикл
			//
			Если УчтеннаяДата = Неопределено Тогда
				УчтеннаяДата = ДатаНачалаПодпериода;
			Конецесли;
			
			ИндексДня  = День(УчтеннаяДата);
			
			ЗначениеТекущее   = СтрокаТабеля["День"+ИндексДня];
			
			Вид   = Лев(ЗначениеТекущее,2);
			
			Попытка
				Подстрока = СокрЛП(Сред(ЗначениеТекущее,3));
				Если Подстрока ="" Тогда
					Часов = 0;
				Иначе
					Часов = Число(Подстрока);
				КонецЕсли;	
			Исключение
				Часов = 0;
			Конецпопытки;
			Если Часов > 8 Тогда 
				Дней = 1 
			Иначе
				Дней = Окр(Часов/8,2);
			КонецЕсли;	
			
			ФактДней  = ФактДней+Дней;
			ФактЧасов  = ФактЧасов+Часов;
			
			УчтеннаяДата = КонецДня(УчтеннаяДата)+1;
			
		КонецЦикла;	
	Иначе
		ФактДней  = 0;
		ФактЧасов = 0;
	КонецЕсли;
	
	//НормаДней = ПолучитьНормуРабочихДнейПоКалендарю(,ДатаНачалаПодпериода,КонецДня(ДатаОкончанияПодпериода));
	
	
	//пока
	НормаЧасов = НормаДней*8;
	//Расчет показателей
	Если Начисление.СпособРасчета = спФиксированнойСуммой Тогда
		Строка.Результат = Показатель;
		
		Если СтруктураПараметров.КомментироватьРасчет Тогда
			ВывестиКомментарий ("Расчет: Результат = Показатель = "+Строка.Результат,3);
		КонецЕсли;	
		
	ИначеЕсли Начисление.СпособРасчета = спПроцентом Тогда
		
		//Получение суммы базовых начислений
		СуммаБазовая = 0;
		//Выполнение расчета 
		Строка.Результат = Показатель*СуммаБазовая/100;	
		Если СтруктураПараметров.КомментироватьРасчет Тогда
			ВывестиКомментарий ("Расчет: "+""+Показатель+"*"+СуммаБазовая+"/100 = "+Строка.Результат,3);
		КонецЕсли;	
	ИначеЕсли Начисление.СпособРасчета = спПоМесячнойТарифнойСтавкеПоДням Тогда
		
		//Выполнение расчета
		Если НормаДней = 0 Тогда
			ВывестиКомментарий ("Неверная норма дней = 0",3);
		Иначе	
			Строка.Результат = Показатель*ФактДней/НормаДней;	
			
			Если СтруктураПараметров.КомментироватьРасчет Тогда
				ВывестиКомментарий ("Расчет: "+""+Показатель+"*"+ФактДней+"/"+НормаДней+"="+Строка.Результат,3);
			КонецЕсли;
		Конецесли;
	ИначеЕсли Начисление.СпособРасчета = спПоМесячнойТарифнойСтавкеПоЧасам Тогда
		
		//Выполнение расчета
		Если НормаЧасов =0 Тогда
			ВывестиКомментарий ("Неверная норма часов =0",2);
		Иначе	
			Строка.Результат = Показатель*ФактЧасов/НормаЧасов;
			
			Если СтруктураПараметров.КомментироватьРасчет Тогда
				ВывестиКомментарий ("Расчет: "+""+Показатель+"*"+ФактЧасов+"/"+НормаЧасов+"="+Строка.Результат,3);
			КонецЕсли;
		КонецЕсли;
	Иначе
		//неизвестный способ расчета
		Строка.Результат = 0;
		Если СтруктураПараметров.КомментироватьРасчет Тогда
			ВывестиКомментарий ("Расчет: "+"Неизвестный способ расчета "+Начисление.СпособРасчета+" = "+Строка.Результат,2);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Функция возвращяет дату фиксации для физического лица
Функция ПолучитьДатуФиксации(Физлицо)
	
	Если ДатыФиксации=Неопределено Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	уб_ДатыРасчетовССотрудникамиСрезПоследних.Дата КАК ДатаФиксации,
		|	уб_ДатыРасчетовССотрудникамиСрезПоследних.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.уб_ДатыРасчетовССотрудниками.СрезПоследних КАК уб_ДатыРасчетовССотрудникамиСрезПоследних";
		//Запрос.УстановитьПараметр("ДатаСреза",ТекущаяДата());
		Выборка= Запрос.Выполнить().Выбрать();
		ДатыФиксации = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			ДатыФиксации.Вставить(Выборка.ФизическоеЛицо,Выборка.ДатаФиксации);
		КонецЦикла;	
	КонецЕсли;	
	ДатаФиксации = ДатыФиксации.Получить(Физлицо);
	Если ДатаФиксации = Неопределено Тогда
		ДатаФиксации = НачалоМесяца(Дата);
	КонецЕсли;	
	Возврат ДатаФиксации;
	
КонецФункции

// Функция отражает расхождения в табличных частях, 
// возвращает факт внесения изменений,
// выводит расхождения в протокол.
Функция ОтразитьРасхождения(
	НачТЧ,
	НовТаблица,
	СписокСвертки, 
	БылиРасхождения,
	ТабличныйДокумент,
	ОбластьШапки,
	ОбластьСтроки,
	ДатаРегистрацииРасчета,
	СписокИтогов,
	ЕстьИсточник = Ложь,
	СписокСотрудниковБезПерерасчета
	);
	
	НачТаблица = НачТЧ.Выгрузить();
	//Обновим даты фиксации заново
	ДатыФиксации = Неопределено;	
	Результат = НовТаблица.Скопировать();
	Результат.Очистить();
	Результат.Колонки.Добавить("НачСумма", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("Разница",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ВсегоКлючевыхПолей = СписокСвертки.Количество();
	Для Счетчик = 0 по ВсегоКлючевыхПолей-1 Цикл
		НачТаблица.Индексы.Добавить(СписокСвертки[Счетчик]);
	КонецЦикла;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	//МассивТипов.Добавить(Тип("Null"));
	ОписаниеТипаБулево = Новый ОписаниеТипов(МассивТипов);
	НачТаблица.Колонки.Добавить("Обработана",ОписаниеТипаБулево);	
	СтруктураПоиска = Новый Структура;
	СтруктураДопПоиска = Новый Структура;
	Для Счетчик = 0 по ВсегоКлючевыхПолей-1 Цикл
		СтруктураПоиска.Вставить(СписокСвертки[Счетчик],0);
		СтруктураДопПоиска.Вставить(СписокСвертки[Счетчик],0);
	КонецЦикла;
	СтруктураДопПоиска.Вставить("Период",0);	
	ВсегоРесурсов = СписокИтогов.Количество();	
	//Когда начисление производится до окончания месяца записываем начисления текущей датой
//	ДатаФиксацииАльтернатива= ?(ДатаРегистрацииРасчета<Дата,ДатаРегистрацииРасчета,Дата);  //неиспользуется
	Дата0 = НачалоМесяца(Дата);
	СписокРуководителейБезПерерасчета = Новый Массив;
	СписокРуководителейБезПерерасчета.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("000004976"));
	ВознРукОП = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП");
	
	Для каждого НоваяСтрока из НовТаблица Цикл		
		
		Если НЕ СписокСотрудниковБезПерерасчета.Найти(НоваяСтрока.Сотрудник) = Неопределено Тогда
			Продолжить;
		ИначеЕсли НЕ СписокРуководителейБезПерерасчета.Найти(НоваяСтрока.Сотрудник) = Неопределено и НоваяСтрока.Начисление = ВознРукОП Тогда
			Продолжить;
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,НоваяСтрока);		
		МассивСуществующихСтрок = НачТаблица.НайтиСтроки(СтруктураПоиска);
		Если МассивСуществующихСтрок.Количество()= 0 Тогда			
			бНадоДобавлять = Ложь;
			Для Счетчик = 0 по ВсегоРесурсов-1 Цикл
				ИмяИтога = СписокИтогов[Счетчик];
				ЗначениеРесурса =  НоваяСтрока[ИмяИтога];
				Если НЕ ЗначениеРесурса = 0 Тогда
					бНадоДобавлять = Истина;
				КонецЕсли;	
			КонецЦикла;			
			//Нет этой строки, добавляем
			Если бНадоДобавлять Тогда
				ДобавленнаяСтрока = НачТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,НоваяСтрока);
				Датафиксации = ПолучитьДатуФиксации(НоваяСтрока.Сотрудник);
				Если Датафиксации <= Дата0 Тогда
					Период = Дата0;
				Иначе
					//
					Период = Датафиксации + 1;
				КонецЕсли;
				ДобавленнаяСтрока.Период = Период;
				//?(ДатаРегистрацииРасчета=Неопределено или НЕ ЗначениеЗаполнено(ДатаРегистрацииРасчета),ТекущаяДата(),ДатаРегистрацииРасчета);
				ДобавленнаяСтрока.Обработана = Истина;
				ДобавленнаяСтрока.Первоначальная = Истина;
				Если ЕстьИсточник Тогда
					ДатафиксацииИсточника = ПолучитьДатуФиксации(НоваяСтрока.ИсточникФинансирования);
					Если ДатафиксацииИсточника <= Дата0 Тогда
						ПериодДляИсточника = Дата0;
					Иначе
						//
						ПериодДляИсточника = ДатафиксацииИсточника + 1;
					КонецЕсли;
					ДобавленнаяСтрока.ПериодДляИсточника = ПериодДляИсточника;
				КонецЕсли;	
				//Для протокола
				ДобавленнаяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,НоваяСтрока);
				ДобавленнаяСтрока.Период = Период;
			КонецЕсли;
		Иначе	
			КопияЭтихСтрок = НачТаблица.Скопировать(СтруктураПоиска);			
			бНадоКорректировать = Ложь;
			Для Счетчик = 0 по ВсегоРесурсов-1 Цикл
				ИмяИтога = СписокИтогов[Счетчик];
				ЗначениеИтога =  КопияЭтихСтрок.Итог(ИмяИтога);
				Если НЕ ЗначениеИтога = НоваяСтрока[ИмяИтога] Тогда
					бНадоКорректировать = Истина;
				КонецЕсли;	
			КонецЦикла;
			
			Если бНадоКорректировать Тогда
				ЗначениеИтогаДляПротокола = 0;
				ДобавленнаяСтрока = НачТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,НоваяСтрока);
				Датафиксации = ПолучитьДатуФиксации(НоваяСтрока.Сотрудник);
				Если Датафиксации <= Дата0 Тогда
					Период = Дата0;
				Иначе
					Период = Датафиксации + 1;
				КонецЕсли;
				ДобавленнаяСтрока.Период = Период;
				Для Счетчик = 0 по ВсегоРесурсов - 1 Цикл
					ИмяИтога = СписокИтогов[Счетчик];
					ЗначениеИтога =  КопияЭтихСтрок.Итог(ИмяИтога);
					Если Счетчик = 0 Тогда
						ЗначениеИтогаДляПротокола = ЗначениеИтога;
					КонецЕсли;
					ДобавленнаяСтрока[ИмяИтога] = ДобавленнаяСтрока[ИмяИтога]-ЗначениеИтога;
				КонецЦикла;
				//?(ДатаРегистрацииРасчета=Неопределено или НЕ ЗначениеЗаполнено(ДатаРегистрацииРасчета),ТекущаяДата(),ДатаРегистрацииРасчета);
				ДобавленнаяСтрока.Обработана = Истина;
				ДобавленнаяСтрока.Первоначальная = Период = Дата0;
				Если ЕстьИсточник Тогда
					ДатафиксацииИсточника = ПолучитьДатуФиксации(НоваяСтрока.ИсточникФинансирования);
					Если ДатафиксацииИсточника <= Дата0 Тогда
						ПериодДляИсточника = Дата0;
					Иначе
						ПериодДляИсточника = ДатафиксацииИсточника + 1;
					КонецЕсли;
					ДобавленнаяСтрока.ПериодДляИсточника = ПериодДляИсточника;
				КонецЕсли;	
				//Для протокола
				ДобавленнаяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, НоваяСтрока);
				ДобавленнаяСтрока.НачСумма 	= ЗначениеИтогаДляПротокола;
				ДобавленнаяСтрока.Разница 	= ДобавленнаяСтрока.Результат - ЗначениеИтогаДляПротокола;
			КонецЕсли;			
			ВсегоПроверено = МассивСуществующихСтрок.Количество();
			Для СчетчикПроверенныхСтрок = 0 по  ВсегоПроверено-1  Цикл
				СтрокаПроверенная = МассивСуществующихСтрок[СчетчикПроверенныхСтрок];
				СтрокаПроверенная.Обработана = Истина;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	//Уволенные и получившие окончательный расчет
	Для каждого Уволенный из СписокСотрудниковБезПерерасчета Цикл
		СтруктураУвол = Новый Структура("Сотрудник",Уволенный);
		МассивПоУволенным = НачТаблица.НайтиСтроки(СтруктураУвол);
		Для каждого Строка из МассивПоУволенным Цикл
			//Копируем предыдущие данные
			//Дубль = НачТаблица.Добавить();
			//ЗаполнитьЗначенияСвойств(Дубль,Строка);
			Строка.Обработана = Истина;
		КонецЦикла;	
	КонецЦикла;	
	
	СписокРуководителейБезПерерасчета.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("000004976"));
	ВознРукОП = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.НайтиПоКоду("ВознРукОП");
	Для каждого Уволенный из СписокРуководителейБезПерерасчета Цикл
		СтруктураУвол = Новый Структура("Сотрудник,Начисление",Уволенный,ВознРукОП);
		МассивПоУволенным = НачТаблица.НайтиСтроки(СтруктураУвол);
		Для каждого Строка из МассивПоУволенным Цикл
			//Копируем предыдущие данные
			//Дубль = НачТаблица.Добавить();
			//ЗаполнитьЗначенияСвойств(Дубль,Строка);
			Строка.Обработана = Истина;
		КонецЦикла;	
	КонецЦикла;	
	
	
	НачТаблица.Индексы.Очистить();
	НачТаблица.Индексы.Добавить("Обработана");
	МассивУдаляемых = НачТаблица.Скопировать(Новый Структура("Обработана",Ложь));
	ВсегоУдаляемых = МассивУдаляемых.Количество();
	Для СчетчикСтрок = 0 по  ВсегоУдаляемых - 1  Цикл
		СтрокаУдаляемая = МассивУдаляемых[СчетчикСтрок];
		Если СтрокаУдаляемая.Обработана Тогда
			Продолжить;
		КонецЕсли;	
		СтруктураПоиска = Новый Структура;
		Для Счетчик = 0 по ВсегоКлючевыхПолей-1 Цикл
			СтруктураПоиска.Вставить(СписокСвертки[Счетчик],0);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаУдаляемая);
		КопияЭтихСтрок = МассивУдаляемых.Скопировать(СтруктураПоиска);
		бНадоКорректировать = Ложь;
		Для Счетчик = 0 по ВсегоРесурсов-1 Цикл
			ИмяИтога = СписокИтогов[Счетчик];
			ЗначениеИтога =  КопияЭтихСтрок.Итог(ИмяИтога);
			Если ЗначениеИтога <> 0 Тогда
				бНадоКорректировать = Истина;
			КонецЕсли;	
		КонецЦикла;
		Если бНадоКорректировать Тогда
			ЗначениеИтогаДляПротокола = 0;
			ДобавленнаяСтрока = НачТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,СтрокаУдаляемая);
			Датафиксации = ПолучитьДатуФиксации(СтрокаУдаляемая.Сотрудник);
			Если Датафиксации <= Дата Тогда
				Период = Дата;
			Иначе
				Период = Датафиксации + 1;
			КонецЕсли;
			ДобавленнаяСтрока.Период = Период;			
			Если ЕстьИсточник Тогда
				ДатафиксацииИсточника = ПолучитьДатуФиксации(СтрокаУдаляемая.ИсточникФинансирования);
				Если ДатафиксацииИсточника <= Дата Тогда
					ПериодДляИсточника = Дата;
				Иначе
					ПериодДляИсточника = ДатафиксацииИсточника + 1;
				КонецЕсли;
				ДобавленнаяСтрока.ПериодДляИсточника = ПериодДляИсточника;
			КонецЕсли;				
			Для Счетчик = 0 по ВсегоРесурсов-1 Цикл
				ИмяИтога = СписокИтогов[Счетчик];
				ЗначениеИтога = КопияЭтихСтрок.Итог(ИмяИтога);
				Если Счетчик = 0 Тогда
					ЗначениеИтогаДляПротокола = ЗначениеИтога;
				КонецЕсли;
				ДобавленнаяСтрока[ИмяИтога] = - ЗначениеИтога;
			КонецЦикла;
			ДобавленнаяСтрока.Обработана = Истина;
			ДобавленнаяСтрока.Первоначальная = (Период = Дата И ПериодДляИсточника = Дата);
			//Для протокола
			ДобавленнаяСтрока2 = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока2, ДобавленнаяСтрока);
			ДобавленнаяСтрока2.НачСумма = ЗначениеИтогаДляПротокола;
			ДобавленнаяСтрока2.Разница 	= ДобавленнаяСтрока2.Результат - ЗначениеИтогаДляПротокола;
		КонецЕсли;		
		МассивТакихСтрок = МассивУдаляемых.НайтиСтроки(СтруктураПоиска);
		ВсегоПодобных = МассивТакихСтрок.Количество()-1;
		Для СчетчикОбработанных = 0 по ВсегоПодобных Цикл
			ОбработаннаяСтрока = МассивТакихСтрок[СчетчикОбработанных];
			ОбработаннаяСтрока.Обработана = Истина;
		КонецЦикла;	
	КонецЦикла;	
	Если Результат.Количество() > 0 Тогда
		НачТЧ.Загрузить(НачТаблица);
		БылиРасхождения = Истина;		
		ТабличныйДокумент.Вывести(ОбластьШапки,1);		
		Для каждого СтрокаРасхождения из Результат Цикл
			ОбластьСтроки.Параметры.Заполнить(СтрокаРасхождения);
			ТабличныйДокумент.Вывести(ОбластьСтроки,2);
		КонецЦикла;			
	КонецЕсли;
	Возврат БылиРасхождения;
	
КонецФункции

// Процедура выводит комментарий c переданным уровнем вложенности
Процедура ВывестиКомментарий (ТекстСообщения,Уровень=0,ВПанельСообщений=Истина)
	
	Если ВПанельСообщений Тогда
		Префикс = "";
		Для текУровень = 1 по Уровень Цикл
			Префикс = Префикс + Символы.Таб;
		КонецЦикла;
		#Если Клиент Тогда
			Сообщить(Префикс + ТекстСообщения);
		#КонецЕсли	
	КонецЕсли;
	
КонецПроцедуры	

// Функция возвращает количество рабочих дней в месяце
Функция ПолучитьНормуРабочихДнейПоКалендарю(Вид="Пятидневка",ДатаНачала,ДатаОкончания)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&ДатаОкончания,
	|	СУММА(ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.Пятидневка, 0)) КАК Пятидневка,
	|	СУММА(ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.Шестидневка, 0)) КАК Шестидневка
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.Год = &Год
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &ДатаНачала
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ДатаОкончания");
	Запрос.УстановитьПараметр("Год",Год(Дата));
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат ?(Выборка[Вид] = NULL, 0, Выборка[Вид]);	
	КонецЦикла;
	Возврат 0;
	
КонецФункции

// Процедура сворачивает табличную часть, удаляет нулевые значения и загружает в источник
Процедура СжатьТаблицу(Таблица,СтрокаСвертки,Ресурсы="Результат",Изменен)
	
	вспТаблица = Таблица.Выгрузить();
	вспТаблица.Свернуть(СтрокаСвертки,Ресурсы);
	//вспНачисления.Индексы.Добавить("Результат");
	Если Ресурсы = "Результат" Тогда
		Если Не вспТаблица.Найти(0,Ресурсы)= Неопределено Тогда 
			//удаляем пустые строки
			КоличествоСтрок = вспТаблица.Количество();
			Для СчетчикСтрок=1 по  КоличествоСтрок Цикл
				ТекСтрока = вспТаблица[КоличествоСтрок-СчетчикСтрок];
				Если ТекСтрока.Результат =0 Тогда
					вспТаблица.Удалить(ТекСтрока);
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	Иначе
		//Это курьеры
		КоличествоСтрок = вспТаблица.Количество();
		Для СчетчикСтрок=1 по  КоличествоСтрок Цикл
			ТекСтрока = вспТаблица[КоличествоСтрок-СчетчикСтрок];
			Если ТекСтрока.Результат = 0 и ТекСтрока.РезультатДляИсточника=0 Тогда
				вспТаблица.Удалить(ТекСтрока);
			КонецЕсли;	
		КонецЦикла;	
	Конецесли;
	вспТаблица.Сортировать(СтрокаСвертки);
	вспТаблица.Колонки.Добавить("Первоначальная");
	вспТаблица.ЗаполнитьЗначения(Истина,"Первоначальная");
	СтруктураПоиска = Новый Структура(СтрокаСвертки);
	Для Каждого Строка из ВспТаблица Цикл
		Если Не Строка.Первоначальная Тогда
			Продолжить;
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,Строка);
		МассивСтрок = ВспТаблица.найтиСтроки(СтруктураПоиска);
		ВсегоНайдено = МассивСтрок.Количество();
		Если ВсегоНайдено > 1 Тогда
			Для Счетчик = 1 По ВсегоНайдено Цикл
				  МассивСтрок[Счетчик].Первоначальная = Ложь;
			КонецЦикла;	
		Конецесли;	
	КонецЦикла;	
	Если Таблица.Количество()<> вспТаблица.Количество() Тогда
		Таблица.Загрузить(вспТаблица);
		Изменен = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает сжатие табличных частей, при изменении вызывает проведение
Процедура СжатьПравки(ЕстьПравки = Ложь, Записать = Истина) Экспорт
	
	ЕстьПравки = Ложь;
	Если Проведен Тогда
		СжатьТаблицу(Начисления,				"Сотрудник,Начисление,Период",, ЕстьПравки);
		СжатьТаблицу(НачисленияРазовые,			"Сотрудник,Начисление,Период",, ЕстьПравки);
		СжатьТаблицу(ВознаграждениеЗаПродажи,	"Сотрудник,Начисление,Период",, ЕстьПравки);
		СжатьТаблицу(ВознаграждениеКурьеров,	"Сотрудник,Начисление,Период,ИсточникФинансирования,Заявка,ПериодДляИсточника", "Результат,РезультатДляИсточника", ЕстьПравки);
	КонецЕсли;

КонецПроцедуры	


Процедура ДвижениеПоРегистрам()
	
	//Поле раздел: 
	//Все что до 10 Начисления, 
	//Свыше Удержание, используется при анализе движений
	
	//Отражение периодических начислений
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		// регистр уб_РасчетыСФЛПоЗП Приход
		Если ТекСтрокаНачисления.Результат=0 Тогда
			Продолжить;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТекСтрокаНачисления.Сотрудник) = Ложь Тогда
			Сообщить(""+ТекСтрокаНачисления.Начисление+" "+ТекСтрокаНачисления.Результат+" пустой сотрудник");
			продолжить;
		КонецЕсли;	
		Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//Движение.Период = Дата;
		Движение.Период = ТекСтрокаНачисления.Период; 
		Движение.Организация = Организация;
		Движение.ФизическоеЛицо = ТекСтрокаНачисления.Сотрудник;
		Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
		Если ТекСтрокаНачисления.Результат >0 Тогда
			Движение.Сумма 			= ТекСтрокаНачисления.Результат;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Раздел 		= 1;//Начисление
		Иначе
			Движение.Сумма 			= -ТекСтрокаНачисления.Результат;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Раздел 		= 11;//Удержание
		КонецЕсли;			
		Движение.РасчетныйПериод = Дата;
		//Движение.ПериодРегистрации = НачалоДня(КонецМесяца(ТекСтрокаНачисления.Период));
		Если ТекСтрокаНачисления.Первоначальная Тогда
			Движение.Описание= ТекСтрокаНачисления.Начисление;
		Иначе
			Попытка 
				Движение.Описание= "Изменение в "+НРЕГ(ТекСтрокаНачисления.Начисление);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
	КонецЦикла;
	//Отражаение разовых Начислений
	Для Каждого ТекСтрокаНачисления Из НачисленияРазовые Цикл
		Если ТекСтрокаНачисления.Результат = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаНачисления.Сотрудник) = Ложь Тогда
			Сообщить(""+ТекСтрокаНачисления.Начисление+" "+ТекСтрокаНачисления.Результат+" пустой сотрудник");
			продолжить;
		КонецЕсли;	

		// регистр уб_РасчетыСФЛПоЗП Приход
		Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();		
		Движение.Период 		= ТекСтрокаНачисления.Период; 
		Движение.Организация 	= Организация;
		Движение.ФизическоеЛицо = ТекСтрокаНачисления.Сотрудник;
		Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
		Если ТекСтрокаНачисления.Результат >0 Тогда
			Движение.Сумма 			= ТекСтрокаНачисления.Результат;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Раздел 		= 4;//Начисление
		Иначе
			Движение.Сумма 			= -ТекСтрокаНачисления.Результат;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Раздел 		= 14;//Удержание
		КонецЕсли;	
		Движение.РасчетныйПериод = Дата;
		Движение.Описание = ТекСтрокаНачисления.Начисление;
	КонецЦикла;
	//Отражение вознаграждения отдела продаж
	Для Каждого ТекСтрокаНачисления Из ВознаграждениеЗаПродажи Цикл
		// регистр уб_РасчетыСФЛПоЗП Приход
		Если ТекСтрокаНачисления.Результат = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ТекСтрокаНачисления.Сотрудник.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= ТекСтрокаНачисления.Период;
		Движение.Организация 		= Организация;
		Движение.ФизическоеЛицо 	= ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма 				= ТекСтрокаНачисления.Результат;
		Движение.РасчетныйПериод 	= Дата;
		Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
		//Движение.ПериодРегистрации = НачалоДня(КонецМесяца(ТекСтрокаНачисления.Период));
		Если ТекСтрокаНачисления.Первоначальная или ТипЗНЧ(ТекСтрокаНачисления.Начисление) = Тип("Строка") Тогда
			Движение.Описание = ТекСтрокаНачисления.Начисление;
		Иначе
			Движение.Описание = ТекСтрокаНачисления.Начисление.НаименованиеКорректирующейЗаписи;
		КонецЕсли;	
		Движение.Раздел = 2;//Начисление
	КонецЦикла;
	//Отражение вознаграждения курьерской службы
	НеопределенныйАгент = ПараметрыСеанса.уб_Константы.НеопределенАгент;
	Для Каждого ТекСтрокаНачисления Из ВознаграждениеКурьеров Цикл
		// регистр уб_РасчетыСФЛПоЗП Приход
		Если Не ТекСтрокаНачисления.Сотрудник = НеопределенныйАгент Тогда
			
			Если ЗначениеЗаполнено(ТекСтрокаНачисления.Сотрудник) = Ложь Тогда
				Сообщить("Курьерам"+" "+ТекСтрокаНачисления.Результат+" пустой сотрудник");
				продолжить;
			КонецЕсли;	

			// НеопределенныйАгент - удержания за личную заявку
			Если ТекСтрокаНачисления.Результат <> 0 Тогда	
				Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
				Движение.Период 			= ТекСтрокаНачисления.Период;
				Движение.Организация 		= Организация;
				Движение.ФизическоеЛицо 	= ТекСтрокаНачисления.Сотрудник;
				Движение.Сумма 				= ТекСтрокаНачисления.Результат;
				Движение.РасчетныйПериод 	= Дата;
				Движение.Источник			= ТекСтрокаНачисления.ИсточникФинансирования; 
				//Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
				Если ТекСтрокаНачисления.Начисление = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПечатьПолиса Тогда
					Движение.ВидНачисления  = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ПечатьПолиса;
					Движение.Описание = "Заполнение полиса курьером";
				Иначе
					Движение.ВидНачисления  = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознВыезд;
					Если ТекСтрокаНачисления.Первоначальная или ТипЗНЧ(ТекСтрокаНачисления.Начисление) = Тип("Строка") Тогда
						Движение.Описание = "Вознаграждение курьера";
					Иначе
						Движение.Описание = "Изменение в ВК";
					КонецЕсли;		
				КонецЕсли;
				
				Движение.Раздел = 3;//Начисление
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаНачисления.РезультатДляИсточника <> 0 Тогда	
			Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= ТекСтрокаНачисления.ПериодДляИсточника;
			Движение.Организация 		= Организация;
			Движение.ФизическоеЛицо 	= ТекСтрокаНачисления.ИсточникФинансирования;
			Движение.Сумма 				= ТекСтрокаНачисления.РезультатДляИсточника;
			Движение.РасчетныйПериод 	= Дата;
			Движение.Источник= ТекСтрокаНачисления.Сотрудник; 
			Если ТекСтрокаНачисления.Первоначальная Тогда
				Движение.Описание = "Удержание за курьеров";
			Иначе
				Движение.Описание = "Изменение в удержании за курьера";
			КонецЕсли;
			//Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
			Движение.ВидНачисления  = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.УдВыезд;
			//КонецЕсли;	
			Движение.Раздел = 12;//Удержание
		КонецЕсли;
	КонецЦикла;
	//Удержание по документам
	Для Каждого ТекСтрокаНачисления Из НачисленияПоДокументам Цикл
		// регистр уб_РасчетыСФЛПоЗП Приход
		Если ТекСтрокаНачисления.Результат = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ТекСтрокаНачисления.Сотрудник.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.уб_РасчетыСФЛПоЗП.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= ТекСтрокаНачисления.Период;
		Движение.Организация 		= Организация;
		Движение.ФизическоеЛицо 	= ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма 				= ТекСтрокаНачисления.Результат;
		Движение.РасчетныйПериод 	= Дата;
		Движение.ВидНачисления  = ТекСтрокаНачисления.Начисление;
		//Движение.ПериодРегистрации = НачалоДня(КонецМесяца(ТекСтрокаНачисления.Период));
		Если ТекСтрокаНачисления.Первоначальная или ТипЗНЧ(ТекСтрокаНачисления.Начисление) = Тип("Строка") Тогда
			Движение.Описание = ТекСтрокаНачисления.Начисление ;
		Иначе
			Движение.Описание = ТекСтрокаНачисления.Начисление.НаименованиеКорректирующейЗаписи;
		КонецЕсли;	
		Движение.Описание = Движение.Описание+ " ("+СокрлП(ТекСтрокаНачисления.Документ.Номер)+")";
		Движение.Раздел = 15;//Удержание
	КонецЦикла;

	Если БылоЗаполнение и ЗначениеЗаполнено(Дата) Тогда
		
		//Двигаем актуализацию 
		уб_РасчетыСМенеджерами.ЗарплатныйПериодАктуален(Дата,Новый Структура("Актуален,Объект",Истина,Ссылка));
		
		//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
		//МЗ.Актуален 		= Истина;
		//МЗ.РасчетныйПериод 	= Дата;
		//МЗ.Период 			= ТекущаяДата();
		//МЗ.Объект 			= Ссылка;
		//МЗ.Записать();
	КонецЕсли;	
	БылоЗаполнение = Ложь;
	
КонецПроцедуры

// Процедура обработчик события проведения, выполняет движения по регистрам
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДвижениеПоРегистрам();
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью", отмечает модификацию, блокирует строки, если документ подписан
Процедура ПередЗаписью(Отказ,РежимЗаписи)
	
	Если ОбменДанными.Загрузка Тогда
		//Без проверок
		ОбменДанными.Загрузка = Ложь;
		Возврат;
	КонецЕсли;	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Если ПометкаУдаления Тогда
			Возврат
		КонецЕсли;	
		Если Ссылка.Пустая() Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			//Изменяется режим проведения
			Если Не ПометкаУдаления Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				#Если Клиент Тогда
				Предупреждение("Помеченный на удаление документ не может быть изменен!",5);
				#КонецЕсли	
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	Иначе
		//Проводится
		Если ПометкаУдаления Тогда
			#Если Клиент Тогда
			Предупреждение("Помеченный на удаление документ не может быть проведен!",5);
			#КонецЕсли	
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;	
	УстановитьЗначение(Дата, НачалоМесяца(Дата));
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ИскДокумент = Документы.уб_НачислениеЗП.ПолучитьДокументНачисленияЗаПериод (Дата,Организация);
		Если ИскДокумент <> Неопределено И ИскДокумент.Ссылка <> Ссылка Тогда
			#Если Клиент Тогда
				Предупреждение("Уже есть документ начисления с такими параметрами! "+СИмволы.ПС+Дата+Символы.ПС+Организация,5);
			#КонецЕсли	
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Проведен Тогда
		//Удаление запрещено
		Отказ  = Истина;
		#Если Клиент Тогда
			Предупреждение ("Удаление проведенного документа запрещено");
		#КонецЕсли
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьЗакрытыеВзаиморасчеты()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ФизическиеЛица.Ссылка
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.ВзаиморасчетыПрекращены = ИСТИНА "+?(Дата<Дата(2018,7,1)," или ФизическиеЛица.Код = ""000051202""",""));
Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции	

Функция СобратьПодмены()
	
	Подмены  = Новый Соответствие;
	//Если Дата<Дата(2017,1,1) И Дата > Дата(2016,7,1) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПодразделенияОрганизаций.Ссылка,
		               |	ПодразделенияОрганизаций.АналитикаЗарплаты
		               |ПОМЕСТИТЬ Подразделения
		               |ИЗ
		               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		               |ГДЕ
		               |	НЕ ПодразделенияОрганизаций.АналитикаЗарплаты = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	подразделения.Ссылка КАК Ссылка,
		               |	подразделения.АналитикаЗарплаты,
		               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент,
		               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие
		               |ИЗ
		               |	Подразделения КАК подразделения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаСреза, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
		               |		ПО подразделения.Ссылка = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
		               |	&Мастер,
		               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент,
		               |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие
		               |ИЗ
		               |	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&ДатаСреза, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаСреза, ) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
		               |		ПО уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
		               |ГДЕ
		               |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = ""ЭтоМастер""
		               |	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0";
		Запрос.УстановитьПараметр("ДатаСреза",КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Мастер",Справочники.ФизическиеЛица.НайтиПоНаименованию("_Мастер Сводные"));
		Выборка = Запрос.Выполнить().Выбрать();		   
		Пока Выборка.Следующий() Цикл
			подмены.Вставить(Выборка.Агент,Выборка.АналитикаЗарплаты);
		КонецЦикла;
		
	//КонецЕсли;
	Возврат подмены;
	
КонецФункции
//
Функция отразитьПодмены(_Начисления,_ПодменыСотрудников,ИмяПоля,Исключения = Неопределено)
	флЕстьПравки = Ложь;
	Для Каждого Подмена Из _ПодменыСотрудников Цикл
		СтрокиПоСотруднику = _Начисления.НайтиСтроки(Новый Структура(ИмяПоля,Подмена.Ключ));
		Для Каждого СтрокаН Из СтрокиПоСотруднику  Цикл
			
			Если Не Исключения = Неопределено Тогда
				Если Исключения.Найти(СтрокаН.Начисление)<>Неопределено Тогда
					Продолжить;
				КонецЕсли;						
			КонецЕсли;
			
			СтрокаН[ИмяПоля] = Подмена.Значение;
		КонецЦикла;
		флЕстьПравки = флЕстьПравки = Истина или СтрокиПоСотруднику.Количество()>0;
	КонецЦикла;
	Возврат флЕстьПравки;
КонецФункции

//МАСТЕР
Функция ПолучитьСКВМастер()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",Дата);
	Запрос.УстановитьПараметр("ДатаКонца",Дата);
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) КАК ЗарплатныйПериод,
	              |	""СКВ (по отчету Мастер)"" КАК Статья,
	              |	СУММА(ВЫБОР
	              |			КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	              |					КОГДА ОП.НачисленнаяСуммаВзноса = 0
	              |						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	              |					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	              |				КОНЕЦ - ОП.КВСумма
	              |				ТОГДА 0
	              |			ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	              |					КОГДА ОП.НачисленнаяСуммаВзноса = 0
	              |						ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	              |					ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	              |				КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма - ОП.СуммаДоп
	              |		КОНЕЦ * (100 - ОП.ПроцентСКВ) / 100) КАК Сумма
	              |ИЗ
	              |	Документ.уб_ОплатаПолисов КАК ОП
	              |ГДЕ
	              |	НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) >= &ДатаНачала
	              |	И КОНЕЦПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) <= КОНЕЦПЕРИОДА(&ДатаКонца, МЕСЯЦ)
	              |	И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	              |	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	              |	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	              |	И ОП.ПометкаУдаления = ЛОЖЬ
	              |	И ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ)
	              |	И (ОП.Подразделение.Родитель.Наименование = ""ОП-Мастер""
	              |			ИЛИ ОП.Агент В
	              |				(ВЫБРАТЬ
	              |					уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник
	              |				ИЗ
	              |					РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&ДатаКонца, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
	              |				ГДЕ
	              |					уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = ""ЭтоМастер""
	              |					И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра > 0)
	              |			ИЛИ ОП.Подразделение.Наименование = ""Технопарк"")
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ)";
				  
		Выборка = Запрос.Выполнить().Выбрать();	  
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Сумма;	
		Иначе
			Возврат 0;	
		КонецЕсли;
КонецФункции
	
Функция ДопыМастера(Себестоимость)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Себестоимость",Себестоимость);
	Запрос.Текст  = "ВЫБРАТЬ
	|	СУММА(уб_ОплатаПолисовУслугиПоДокументу.Сумма) КАК СКлиента,
	|	СУММА(уб_ОплатаПолисовУслугиПоДокументу.Себестоимость - &Себестоимость) КАК Мастеру,
	|	СУММА(&Себестоимость) КАК Брокеру,
	|	МАКСИМУМ(уб_ОплатаПолисовУслугиПоДокументу.СхемаОплаты) КАК СхемаОплаты,
	|	СУММА(уб_ОплатаПолисовУслугиПоДокументу.ВМ) КАК ВМ,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Документ.уб_ОплатаПолисов.УслугиПоДокументу КАК уб_ОплатаПолисовУслугиПоДокументу
	|ГДЕ
	|	уб_ОплатаПолисовУслугиПоДокументу.Ссылка.Подразделение В
	|			(ВЫБРАТЬ
	|				Справочник.ПодразделенияОрганизаций.Ссылка
	|			ИЗ
	|				Справочник.ПодразделенияОрганизаций
	|			ГДЕ
	|				Справочник.ПодразделенияОрганизаций.Родитель.Наименование = ""ОП-Мастер"")
	|	И КОНЕЦПЕРИОДА(уб_ОплатаПолисовУслугиПоДокументу.Ссылка.ЗарплатныйПериод, МЕСЯЦ) = КОНЕЦПЕРИОДА(&ЗарплатныйПериод, МЕСЯЦ)
	|	И уб_ОплатаПолисовУслугиПоДокументу.Сумма <> 0";
	Запрос.УстановитьПараметр("ЗарплатныйПериод",Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураДопов = Новый  Структура("СКлиента,Мастеру,Брокеру,ВМ,Количество",0,0,0,0,0);
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДопов,Выборка);
	КонецЕсли;
	
	Возврат СтруктураДопов
	
	
КонецФункции	

//HR

Функция ДополнитьБонусамиHR(ТЧ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1",Дата);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ТД",ТекущаяДата());
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПервых.Агент,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период,
	                |	ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Период, уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период) КАК Уволен,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,
	                |	РАЗНОСТЬДАТ(уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период, ВЫБОР
	                |			КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ИСТИНА
	                |				ТОГДА уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Период
	                |			ИНАЧЕ &ТД
	                |		КОНЕЦ, ДЕНЬ) КАК ДлительностьРаботы,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПервых.Подразделение,
	                |	ВЫБОР
	                |		КОГДА ПОДСТРОКА(уб_ДвижениеФизлицПоПодразделениямСрезПервых.Подразделение.Наименование, 1, 4) = ""М-ОП""
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК этоМастер
	                |ПОМЕСТИТЬ Расчет
	                |ИЗ
	                |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПервых(
	                |			,
	                |			Подразделение.ТипПодразделения = ЗНАЧЕНИЕ(Перечисление.уб_ТипПодразделения.ТочкаПродаж)
	                |				И НЕ Подразделение.Наименование В (""СВС"", ""Операторы БД"", ""Агентская сеть (без оплаты выезда)"", ""Агентская сеть"", ""Дирекция"", ""Отдел маркетинга"", ""Отдел развития"",""Отдел сопровождения договоров страхования"")) КАК уб_ДвижениеФизлицПоПодразделениямСрезПервых
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	                |		ПО уб_ДвижениеФизлицПоПодразделениямСрезПервых.Агент = уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент
	                |ГДЕ
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период >= ДАТАВРЕМЯ(2016, 10, 1)
	                |	И уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период >= &Дата1
	                |	И уб_ДвижениеФизлицПоПодразделениямСрезПервых.Период <= &Дата2
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Расчет.Агент,
	                |	Расчет.Период,
	                |	Расчет.Уволен,
	                |	Расчет.Выбытие,
	                |	Расчет.ДлительностьРаботы,
	                |	Расчет.Подразделение,
	                |	ВЫБОР
	                |		КОГДА Расчет.ДлительностьРаботы > 14
	                |			ТОГДА 2000
	                |		ИНАЧЕ 0
	                |	КОНЕЦ КАК БонуcЗа14Дней,
	                |	ВЫБОР
	                |		КОГДА Расчет.ДлительностьРаботы > 91
	                |			ТОГДА 3000
	                |		ИНАЧЕ 0
	                |	КОНЕЦ КАК БонуcЗа3Месяца,
	                |	Расчет.этоМастер
	                |ИЗ
	                |	Расчет КАК Расчет
	                |ГДЕ
	                |	Расчет.ДлительностьРаботы > 14
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Расчет.Агент.Наименование";
	HR     = Справочники.ФизическиеЛица.НайтиПоНаименованию("Ященко Екатерина");
	Мастер = Справочники.ФизическиеЛица.НайтиПоНаименованию("_Мастер Сводные");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.БонуcЗа14Дней>0 и ЗначениеЗаполнено(HR) Тогда
			СтрокаН = ТЧ.Добавить();
			СтрокаН.Сотрудник   = HR;
			СтрокаН.Начисление  = "14 дней работы ["+Выборка.Агент+"]"; 
			СтрокаН.Период      = Дата;
			СтрокаН.Результат	= Выборка.БонуcЗа14Дней;
			
			Если Выборка.ЭтоМастер = Истина и ЗначениеЗаполнено(Мастер) Тогда
				СтрокаН = ТЧ.Добавить();
				СтрокаН.Сотрудник   = Мастер;
				СтрокаН.Начисление  = "За 14 дней работы/после обучения  ["+Выборка.Агент+"]"; 
				СтрокаН.Период      = Дата;
				СтрокаН.Результат	= -Выборка.БонуcЗа14Дней;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Выборка.БонуcЗа3Месяца>0 Тогда
			СтрокаН = ТЧ.Добавить();
			СтрокаН.Сотрудник   = HR;
			СтрокаН.Начисление  = "3 месяца работы ["+Выборка.Агент+"]"; 
			СтрокаН.Период      = Дата;
			СтрокаН.Результат	= Выборка.БонуcЗа3Месяца;
			
			Если Выборка.ЭтоМастер = Истина Тогда
				СтрокаН = ТЧ.Добавить();
				СтрокаН.Сотрудник   = Мастер;
				СтрокаН.Начисление  = "3 месяца/после обучения ["+Выборка.Агент+"]"; 
				СтрокаН.Период      = Дата;
				СтрокаН.Результат	= -Выборка.БонуcЗа3Месяца;
			КонецЕсли;
			
		КонецЕсли;

		
	КонецЦикла;	
	
КонецФункции

Функция ТекстВъезда()
	Возврат "ВЫБРАТЬ
	|	уб_ЗаявкаНаВъезд.Ссылка,
	|	уб_ЗаявкаНаВъезд.Стоимость,
	|	уб_ЗаявкаНаВъезд.ДатаВъезда,
	|	уб_ЗаявкаНаВъезд.ДатаВыезда,
	|	уб_ЗаявкаНаВъезд.Часов,
	|	уб_ЗаявкаНаВъезд.ТипВъезда,
	|	ВЫБОР
	|		КОГДА уб_ЗаявкаНаВъезд.ДатаВыезда = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(уб_ЗаявкаНаВъезд.ДатаВъезда, ДЕНЬ), ЧАС, 19)
	|		ИНАЧЕ уб_ЗаявкаНаВъезд.ДатаВыезда
	|	КОНЕЦ КАК ДатаВыезда,
	|	РАЗНОСТЬДАТ(уб_ЗаявкаНаВъезд.ДатаВъезда, ВЫБОР
	|			КОГДА уб_ЗаявкаНаВъезд.ДатаВыезда = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(уб_ЗаявкаНаВъезд.ДатаВъезда, ДЕНЬ), ЧАС, 19)
	|			ИНАЧЕ уб_ЗаявкаНаВъезд.ДатаВыезда
	|		КОНЕЦ, МИНУТА) КАК ЧасовФакт,
	|	уб_ЗаявкаНаВъезд.Заказчик,
	|	уб_ЗаявкаНаВъезд.Заказчик.Наименование КАК ЗаказчикСтрока,
	|	уб_ЗаявкаНаВъезд.Страхователь
	|ПОМЕСТИТЬ Выборка
	|ИЗ
	|	Документ.уб_ЗаявкаНаВъезд КАК уб_ЗаявкаНаВъезд
	|ГДЕ
	|	уб_ЗаявкаНаВъезд.ДатаВъезда >= &Дата1
	|	И уб_ЗаявкаНаВъезд.ДатаВъезда <= &Дата2
	|	И уб_ЗаявкаНаВъезд.ПометкаУдаления = ЛОЖЬ
	|	И уб_ЗаявкаНаВъезд.ТипВъезда <> 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выборка.Ссылка,
	|	Выборка.Стоимость,
	|	Выборка.ДатаВъезда,
	|	Выборка.ДатаВыезда,
	|	Выборка.Часов,
	|	ВЫБОР
	|		КОГДА Выборка.ЧасовФакт <= 125
	|			ТОГДА 2
	|		КОГДА Выборка.ЧасовФакт / 60 - (ВЫРАЗИТЬ(Выборка.ЧасовФакт / 60 КАК ЧИСЛО(10, 0))) > 0.05
	|			ТОГДА (ВЫРАЗИТЬ(Выборка.ЧасовФакт / 60 КАК ЧИСЛО(10, 0))) + 1
	|		ИНАЧЕ ВЫРАЗИТЬ(Выборка.ЧасовФакт / 60 КАК ЧИСЛО(10, 0))
	|	КОНЕЦ КАК ЧасовФакт,
	|	Выборка.ТипВъезда,
	|	Выборка.Заказчик,
	|	Выборка.ЗаказчикСтрока,
	|	Выборка.Страхователь
	|ПОМЕСТИТЬ Выборка2
	|ИЗ
	|	Выборка КАК Выборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	выборка2.Заказчик,
	|	выборка2.ЗаказчикСтрока,
	|	выборка2.Ссылка,
	|	ВЫБОР
	|		КОГДА выборка2.ЗаказчикСтрока В (""Мельханова А. А."", ""Панасова Юнона"", ""Панасов Виталий"")
	|			ТОГДА 0
	|		ИНАЧЕ 150 + (выборка2.ЧасовФакт - 2) * 100
	|	КОНЕЦ КАК Стоимость
	|ИЗ
	|	Выборка2 КАК выборка2
	|ГДЕ
	|	ВЫБОР
	|			КОГДА выборка2.ЗаказчикСтрока В (""Мельханова А. А."", ""Панасова Юнона"", ""Панасов Виталий"")
	|				ТОГДА 0
	|			ИНАЧЕ 150 + (выборка2.ЧасовФакт - 2) * 100
	|		КОНЕЦ > 0"
КонецФункции

Функция ТекстРекомендации()
	Возврат Отчеты.ОтчетПоРекомендациям2024.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НаборыДанных.НаборДанных1.Запрос;
КонецФункции	
		
БылоЗаполнение = Ложь;

#Конецесли