// Процедура обработчик события ПередЗаписью набора записей регистра сведений
Процедура ПередЗаписью(Отказ, Замещение)
	
	//ДатаЗаписи =  ЭтотОбъект.Отбор.Период.Значение;
	ДатаЗаписи = Отбор.Период.Значение;
	МассивПериодов = Новый Массив;	
	НачальнаяДата = ДатаЗаписи;
	ТекущееНачалоМесяца = НачалоМесяца(ДатаЗаписи);
	Пока ТекущееНачалоМесяца <= НачалоМесяца(ТекущаяДата()) Цикл
		ДатаНеактуальности = ТекущееНачалоМесяца;		
		//ТЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(,Новый Структура("РасчетныйПериод",ДатаНеактуальности));
		//Если ТЗ.Количество() = 0 Тогда
		//Иначе
		//	Если Не ТЗ[0].Актуален Тогда
		//		ТекущееНачалоМесяца = КонецМесяца(ТекущееНачалоМесяца)+1;
		//		Продолжить;
		//	КонецЕсли
		//КонецЕсли;
		Если НЕ уб_РасчетыСМенеджерами.ЗарплатныйПериодАктуален(ДатаНеактуальности,Новый Структура("Актуален,Объект",Ложь,"РС.Начисления")) Тогда
			ТекущееНачалоМесяца = КонецМесяца(ТекущееНачалоМесяца)+1;
			Продолжить;
		Конецесли;	
		//МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
		//МЗ.Актуален = Ложь;
		//МЗ.РасчетныйПериод = ДатаНеактуальности;
		//МЗ.Период = ТекущаяДата();
		//МЗ.Объект = "РС.Начисления";
		//Попытка
		//	МЗ.Записать();
		//Исключение
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка регистрации неактуальности периода расчета ЗП");
		//КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры
