Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	// Очистим начальный документ
	ДокументРезультат.Очистить();	
	Макет = ПолучитьМакет("Макет");	
	Запрос = Новый Запрос;
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	Запрос.УстановитьПараметр("СК", ?(СК.Пустая(),Null,СК));	
	Запрос.УстановитьПараметр("ВидБСО", ?(ВидБСО.Пустая(),Null,ВидБСО));	
	Запрос.УстановитьПараметр("СтраховойПродукт", ?(СтраховойПродукт.Пустая(),Null,СтраховойПродукт));	
	Запрос.УстановитьПараметр("Подразделение",?(Подразделение.Пустая(),Null,Подразделение));
	Запрос.УстановитьПараметр("Организация", ?(Организация.Пустая(),Null,Организация));
	Запрос.УстановитьПараметр("Агент", ?(ЗначениеНеЗаполнено(Агент),Null,Агент));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Д.СтраховойПолис КАК СтраховойПолис
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&ДатаКон,
	|			Подтверждено
	|           И ВидБСО = &ВидБСО ИЛИ &ВидБСО ЕСТЬ NULL 
	|			) КАК Д
	|ГДЕ
	|	Д.СтраховойПолис.ДатаОкончания <= &ДатаКон
	|	И (Д.СтраховойПолис.СК = &СК
	|			ИЛИ &СК ЕСТЬ NULL )
	//|	И (Д.ВидБСО = &ВидБСО
	//|			ИЛИ &ВидБСО ЕСТЬ NULL )
	|	И (Д.СтраховойПолис.СтраховойПродукт = &СтраховойПродукт
	|			ИЛИ &СтраховойПродукт ЕСТЬ NULL )
	//|	И (Д.Подразделение = &Подразделение
	//|			ИЛИ &Подразделение ЕСТЬ NULL )
	|	И (Д.ОрганизацияАгент = &Организация
	|			ИЛИ &Организация ЕСТЬ NULL )
	|	И (Д.Агент = &Агент
	|			ИЛИ &Агент ЕСТЬ NULL )";

	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтКон 	= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК		= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	ДокументРезультат.Вывести(Обл);	
	РезЗапроса 	= Запрос.Выполнить();
	Выборка 	= РезЗапроса.Выбрать();	
	ИтСтраховаяПремия = 0;
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Ном = 	Ном + 1;
		//
		СтраховойПолис				= Выборка.СтраховойПолис;
		СтраховаяПремия				=СтраховойПолис.Риски.Итог("СтраховаяПремия");
		Дата						=СтраховойПолис.ДатаОкончания;
		СтраховойПродукт			=СтраховойПолис.СтраховойПродукт;
		Страхователь				=СтраховойПолис.Страхователь;
		ОбъектСтрахования			=СтраховойПолис.ОбъектСтрахования;
		Адрес						=УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Страхователь,"Фактический");
		Телефон						=УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Страхователь);
		
		//
		Обл 										= Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном							= Ном;
		Обл.Параметры.Документ						= СтраховойПолис;
		Обл.Параметры.СтраховойПродукт				= СтраховойПродукт;
		Обл.Параметры.Страхователь					= Страхователь;
		Обл.Параметры.Дата							= Дата;
		Обл.Параметры.СтраховаяПремия				= СтраховаяПремия;
		Обл.Параметры.ОбъектСтрахования				= ОбъектСтрахования;
		Обл.Параметры.Адрес							= Адрес;
		Обл.Параметры.Телефон						= Телефон;
		//
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		//
		ИтСтраховаяПремия = ИтСтраховаяПремия+СтраховаяПремия;
	КонецЦикла;
	
	Обл 										= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтСтраховаяПремия				= ИтСтраховаяПремия;
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху      = 8;

	ДокументРезультат.Показать("Мониторинг пролонгации");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли
