
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьНаСервере()
	ПараметрыФормирования = Новый Структура();
	ПараметрыФормирования.Вставить("ДоговораРазвернуто",     Ложь);
	ПараметрыФормирования.Вставить("ДиОРазвернуто",			 Истина);
	ПараметрыФормирования.Вставить("ПоказыватьДоговора",	 Истина);
	ПараметрыФормирования.Вставить("ПоказыватьПараметрыДиО", Истина);
	ПараметрыФормирования.Вставить("ПоказыватьКонтЛица", 	 Истина);
	ПараметрыФормирования.Вставить("ПоказыватьЛимиты ",		 ЛОЖЬ);
	ПараметрыФормирования.Вставить("СК",СК);
	
	Результат = Справочники.КонтактныеЛица.Сформировать(ПараметрыФормирования);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СКПриИзменении(Элемент)
	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыОтбора = Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.Контрагенты.СтраховыеКомпании"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("Отбор",ПараметрыОтбора),Элемент);

КонецПроцедуры
