
&НаСервере
Процедура ПроверкаНаСервере()
	//Строка= уб_ВызовСервера.JSON(Массив);
	
	//ssl = Новый ЗащищенноеСоединениеOpenSSL;
	
	//Соединение = Новый httpСоединение("172.22.23.7",8081,,,,,ssl);
	Соединение = Новый httpСоединение("work.kupipolis.ru",16789,,,,,);
	//http://work.kupipolis.ru:16789/IB83/hs/json/doc
	httpЗапрос = новый httpЗапрос("IB83/hs/json/doc");
	httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
	
	Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	Сообщить(ответ.ПолучитьТелоКакСтроку());

КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	ПроверкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Строка = "{
|""apikey"": ""fce6566b-7754-4764-ade3-ac4fdff9e226"",
|""command"": ""weeklist"",
|""params"": {
|""tg_id"": 441806590
|}
|}";
КонецПроцедуры
