
Процедура ДобавитьОбщиеРеквизиты(Форма,Объект) Экспорт
	ЭлементыИмени = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы,".");
	
	Если ЭлементыИмени[0] = "Справочник" или ЭлементыИмени[0] = "Документ" Тогда
		Используется  = Метаданные.ОбщиеРеквизиты.Автор.Состав.Найти(Объект.Метаданные());
		Используется = Используется<>Неопределено и Строка(Используется.Использование) = "Использовать"; 
		ИмяОбъекта = "Объект";
	Иначе
		Используется = Ложь;
	КонецЕсли;	
	Если Используется = Истина Тогда
		Если Найти(ЭлементыИмени[3], "ФормаЭлемента")>0 Тогда
			Группа = Форма.Элементы.Добавить("ГруппаОбщиеРеквизитыПодвал",Тип("ГруппаФормы"),Форма);
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			Элемент = Форма.Элементы.Добавить("ОбщиеРеквизитыАвтор",Тип("ПолеФормы"),Группа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = ИмяОбъекта+".Автор";
			Элемент.ЦветТекста          = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаКУДА;
			
			Элемент = Форма.Элементы.Добавить("ОбщиеРеквизитыДатаСоздания",Тип("ПолеФормы"),Группа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = ИмяОбъекта+".ДатаСоздания";
			Элемент.Формат = "ДФ='dd.MM.yyyy HH:mm'";
			Элемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаКУДА;
			
			Элемент = Форма.Элементы.Добавить("ОбщиеРеквизитыМодификатор",Тип("ПолеФормы"),Группа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = ИмяОбъекта+".Модификатор";
			Элемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаКУДА;
			
			Элемент = Форма.Элементы.Добавить("ОбщиеРеквизитыДатаИзменения",Тип("ПолеФормы"),Группа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = ИмяОбъекта+".ДатаИзменения";
			Элемент.Формат = "ДФ='dd.MM.yyyy HH:mm'";
			Элемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
			Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаКУДА;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	


#Область КонтактнаяИнформация
Процедура ДобавитьКонтактнуюИнформацию(Форма,Объект,ИмяОбъекта = "Объект",Группа = Неопределено,Использование = 1) Экспорт
	ЭлементыИмени = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы,".");
	
	Если ЭлементыИмени[1] = "Организации" Тогда
		ВидыКонтактнойИнформации = УправлениеКонтактнойИнформациейВызовСервера.ВидыКонтактнойИнформации(Перечисления.ВидыОбъектовКонтактнойИнформации.Организации,Использование);
	ИначеЕсли ЭлементыИмени[1] = "Контрагенты" Тогда
		ВидыКонтактнойИнформации = УправлениеКонтактнойИнформациейВызовСервера.ВидыКонтактнойИнформации(Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты,Использование);	
	ИначеЕсли ЭлементыИмени[1] = "ФизическиеЛица" Тогда
		ВидыКонтактнойИнформации = УправлениеКонтактнойИнформациейВызовСервера.ВидыКонтактнойИнформации(Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица,Использование);		
	ИначеЕсли ЭлементыИмени[1] = "КонтактныеЛица" Тогда
		ВидыКонтактнойИнформации = УправлениеКонтактнойИнформациейВызовСервера.ВидыКонтактнойИнформации(Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица,Использование);			
	Иначе
		ВидыКонтактнойИнформации = Новый Массив;
	КонецЕсли;	
	
	Если ВидыКонтактнойИнформации.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Если Группа = Неопределено Тогда
		Группа = Форма.Элементы.Добавить("ГруппаКонтактнойИнформации",Тип("ГруппаФормы"),Форма);
		Группа.Вид         = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок   = "Контактная информация";
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;
	
	ПравоИзменения = ПравоДоступа("Изменение",Метаданные.Справочники[ЭлементыИмени[1]]);
	
	//Создание реквизитов для хранения КИ
	Для каждого ВидКонтактнойИнформации из ВидыКонтактнойИнформации Цикл
		УИД = СтрЗаменить(Строка(ВидКонтактнойИнформации.УникальныйИдентификатор()),"-","_");
		Если ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Длина = 200;
		ИначеЕсли ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Длина = 30;
		ИначеЕсли ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Длина = 50;	
		ИначеЕсли ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			Длина = 100;		
		Иначе
			Длина = 30;			
		КонецЕсли;	
		Квалификаторы  = Новый КвалификаторыСтроки(Длина,ДопустимаяДлина.Переменная);  
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("КИ_"+УИД,Новый ОписаниеТипов("Строка",,,,Квалификаторы)));
		
	КонецЦикла;	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
	//Создаем поля формы
	Для каждого ВидКонтактнойИнформации из ВидыКонтактнойИнформации Цикл
		УИД = СтрЗаменить(Строка(ВидКонтактнойИнформации.УникальныйИдентификатор()),"-","_");
		
		Элемент = Форма.Элементы.Добавить("КИ_"+УИД,Тип("ПолеФормы"),Группа);
		Элемент.Вид            = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным    = Элемент.Имя;
		Элемент.Заголовок      = ВидКонтактнойИнформации;
		Элемент.ТолькоПросмотр = НЕ ПравоИзменения;
		Если ВидКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Элемент.РастягиватьПоГоризонтали = Ложь; 
			Элемент.Ширина = 20;
		КонецЕсли;	
	КонецЦикла;	
	
	
	
	//Заполнение значениями из базы
	Значения = УправлениеКонтактнойИнформациейВызовСервера.ПрочитатьКонтактнуюИнформацию(Форма[ИмяОбъекта].Ссылка);	
	Для каждого ВидКонтактнойИнформации из ВидыКонтактнойИнформации Цикл
		нСтроки = Значения.НайтиСтроки(Новый Структура("Вид",ВидКонтактнойИнформации));
		Для каждого ЗначениеКИ из нСтроки Цикл
			Если Не ПустаяСтрока(ЗначениеКИ.Представление) Тогда
				УИД              = СтрЗаменить(Строка(ВидКонтактнойИнформации.УникальныйИдентификатор()),"-","_");
				Форма["КИ_"+УИД] = ЗначениеКИ.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	
КонецПроцедуры

//Считываем из базы значения, переписываем их значениями из формы и записываем в базу
Процедура ЗаписатьКонтактнуюИнформацию(Форма,ИмяОбъекта = "Объект",Отказ) Экспорт
	
	Значения = УправлениеКонтактнойИнформациейВызовСервера.ПрочитатьКонтактнуюИнформацию(Форма[ИмяОбъекта].Ссылка);	
	Для каждого Значение из Значения Цикл
		Попытка 
			Значение.Представление = Форма["КИ_"+СтрЗаменить(Строка(Значение.Вид.УникальныйИдентификатор()),"-","_")];
		Исключение
		КонецПопытки;	
	КонецЦикла;	
	
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Значения);
	
	УправлениеКонтактнойИнформациейВызовСервера.ЗаписатьКонтактнуюИнформацию(НаборЗаписей,Форма[ИмяОбъекта].Ссылка,Отказ);
КонецПроцедуры 	


Функция ДайКонтактнуюИнформациюФизлица(ФизЛицо, ВидКИ, Предупреждать = Ложь) Экспорт 
	
	Если ЗначениеНеЗаполнено(ФизЛицо) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Установить(ФизЛицо);
	НаборЗаписейКИ.Отбор.Вид.Установить(ВидКИ);
	НаборЗаписейКИ.Прочитать();
	Если Предупреждать И НаборЗаписейКИ.Количество() = 0 Тогда
		//#Если Клиент тогда
		//	Заг = "Необходимо указать """ + ВидКИ.Наименование + """ физ. лица!";
		//	СОО = "Не найден """ + ВидКИ.Наименование + """ физ. лица '" + Строка(ФизЛицо)  + "'
		//	|
		//	|Зайдите в справочник физлиц и внесите необходимые данные.
		//	|
		//	|Открыть форму физлица?";
		//	Ответ = Вопрос(СОО, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Заг);
		//	Если Ответ = КодВозвратаДиалога.Да Тогда
		//		Форма = ФизЛицо.ПолучитьФорму();
		//		Форма.ЭлементыФормы.Панель1.ТекущаяСтраница = Форма.ЭлементыФормы.Панель1.Страницы.Дополнительно;
		//		Форма.ТекущийЭлемент = Форма.ЭлементыФормы.КонтактнаяИнформация;
		//		Форма.ТекущийЭлемент.ТекущаяКолонка =  Форма.ТекущийЭлемент.Колонки.Представление;
		//		Форма.ОткрытьМодально();			
		//		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		//		НаборЗаписейКИ.Отбор.Объект.Установить(ФизЛицо);
		//		НаборЗаписейКИ.Отбор.Вид.Установить(ВидКИ);
		//		НаборЗаписейКИ.Прочитать();
		//	КонецЕсли;
		//#КонецЕсли
	КонецЕсли;
	Если НаборЗаписейКИ.Количество() <> 0 Тогда 
		Возврат НаборЗаписейКИ[0].Представление;
	Иначе
		Возврат ""
	КонецЕсли;
	
КонецФункции //



#КонецОбласти

#Область ОтборыСписков
//Для форм списка
Процедура ОтборПоПолю(Форма,ИмяПоля,ВыбВидсравнения = Неопределено,ИмяПоляДанные="")Экспорт
	ЕСли ИмяПоляДанные ="" Тогда
		ИмяПоляДанные = ИмяПоля;
	КонецЕсли;	
	Если ВыбВидсравнения = Неопределено Тогда  
		ВыбВидсравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;	
	флНайден = Ложь;
	ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяПоляДанные);
	ДЛя каждого Эл из Форма.Список.Отбор.Элементы Цикл 
		Если Эл.ЛевоеЗначение = ИскомоеПоле тогда
			элНаим = Эл;
			флНайден = истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Если флНайден = Ложь тогда
		элНаим = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		элНаим.ЛевоеЗначение  = ИскомоеПоле;
	КонецЕсли;
	Поле = Форма[ИмяПоля];
	элНаим.ПравоеЗначение = Поле;
	элНаим.Использование = ЗначениеЗаполнено(Поле);
	
Конецпроцедуры

Процедура УстановитьОтборыСписка(Список,Отборы,ЭтоИЛИ = ЛОЖЬ) Экспорт
	Для каждого Отбор из Отборы Цикл
		ОтборВидСравнения = Неопределено;
		Если НЕ Отбор.Свойство("ВидСравнения",ОтборВидСравнения) Тогда;
			ОтборВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;	
		ОтборПредставление = "";
		Если НЕ Отбор.Свойство("Представление",ОтборПредставление) Тогда;
			ОтборПредставление = "";
		КонецЕсли;	
		
		УстановитьОтборСписка(Список,Отбор.ИмяПоля, Отбор.Значение,ОтборВидСравнения,Отбор.Использование,ОтборПредставление,ЭтоИЛИ);
	КонецЦикла;	
КонецПроцедуры		


Процедура УстановитьОтборСписка(Список,ИмяПоляДанные, Значение,ВыбВидсравнения = Неопределено,Использование = Неопределено,Представление = "",ЭтоИЛИ = ЛОЖЬ) Экспорт
	Если ВыбВидсравнения = Неопределено Тогда  
		ВыбВидсравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;	
	
	Если ЭтоИли = Истина Тогда
		НайденаГруппа = Ложь;
		Группа = Неопределено;
		ДЛя каждого Элемент из Список.Отбор.Элементы Цикл 
			Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") 
				и  Элемент.ТипГруппы= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли
				Тогда
				Группа = Элемент;
				НайденаГруппа = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
		Если НайденаГруппа = Ложь Тогда
			Группа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			Группа.ТипГруппы= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			Группа.Использование = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	
	ОтборНайден = Ложь;
	ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяПоляДанные);
	Если ЭтоИли = Истина Тогда
		МестоПоиска = Группа.Элементы;
	Иначе
		МестоПоиска = Список.Отбор.Элементы;
	КонецЕсли;	
	ДЛя каждого Элемент из МестоПоиска  Цикл 
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.ЛевоеЗначение = ИскомоеПоле и Элемент.Представление = Представление тогда
				ОтборНайден = истина;
				Прервать
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ОтборНайден = Ложь тогда
		Элемент = МестоПоиска.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение  = ИскомоеПоле;
		Элемент.Представление  = Представление;
	КонецЕсли;
	
	Элемент.ВидСравнения = ВыбВидсравнения;
	Если Использование = Неопределено Тогда
		Элемент.Использование = ЗначениеЗаполнено(Значение);
	Иначе
		Элемент.Использование = Использование;
	КонецЕсли;	
	
	Элемент.ПравоеЗначение = Значение;
	
Конецпроцедуры
#КонецОбласти

#Область КнопкиПечати

Процедура УстановитьКнопкиПечати(
	Форма,
	Ссылка										= Неопределено,
	ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля = Истина,
	УстановитьПодменюПечати                     = Истина,
	УстановитьПечатьПоУмолчанию					= Истина,
	ИмяНадписиАвтор								= "НадписьАвтор",
	ДобавлятьСубагентскиеПФ						= Ложь
	) Экспорт
	
	ОсновныеДействияФормы	= Форма.Элементы.Найти("ОсновныеДействияФормы");
	Если ОсновныеДействияФормы = Неопределено Тогда
		ОсновныеДействияФормы = Форма.Элементы.Добавить("ОсновныеДействияФормы",Тип("ГруппаФормы"),Форма.КоманднаяПанель);
		ОсновныеДействияФормы.Вид       = ВидГруппыФормы.ГруппаКнопок;
		ОсновныеДействияФормы.Заголовок = "Печать";
		
		ОсновныеДействияФормыПодменю = Форма.Элементы.Добавить("ОсновныеДействияФормыПодменю",Тип("ГруппаФормы"),Форма.КоманднаяПанель);
		ОсновныеДействияФормыПодменю.Вид       = ВидГруппыФормы.Подменю;
		ОсновныеДействияФормыПодменю.Заголовок = "Печать";
		
		
		//Индекс = 1;
		//УИД    = Индекс;
		//ИмяКоманды = "ВыполнитьКомандуПечати_"+УИД;
		//Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		//	КомандаПечати = Форма.Команды.Добавить(ИмяКоманды);
		//	КомандаПечати.Действие = "ВыполнитьКомандуПечати";
		//КонецЕсли;	
		////Это печать по умолчанию
		//КнопкаПечати = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),ОсновныеДействияФормы);
		//КнопкаПечати.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
		//КнопкаПечати.Заголовок  = "Печать "+Индекс;
		//КнопкаПечати.ИмяКоманды = ИмяКоманды;
		////Это остальные формы
		//Индекс = 2;
		//КнопкаПечати = Форма.Элементы.Добавить(ИмяКоманды+"Подменю",Тип("КнопкаФормы"),ОсновныеДействияФормыПодменю);
		//КнопкаПечати.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
		//КнопкаПечати.Заголовок  = "Печать "+Индекс;
		//КнопкаПечати.ИмяКоманды = ИмяКоманды;
		
	КонецЕсли;
	ОсновныеДействияФормыПодменю = Форма.Элементы.Найти("ОсновныеДействияФормыПодменю");
	
	Объект = Форма.Объект;
	ОбъектОбъекта = Форма.РеквизитФормыВЗначение("Объект");
	Если Ссылка = Неопределено Тогда
		Ссылка = Объект.Ссылка;
	КонецЕсли;
	МаксимальноеКоличествоКнопокПоУмолчанию = 3;
	
	
	
	//Если МаксимальноеКоличествоКнопокПоУмолчанию > 1 И Форма.ТабПФ <> Неопределено Тогда
	//!!! отключено исходим из того, что  формы инициализируются только при открытии
	//	УдалитьСтарыеКнопкиПоУмолчанию(Форма, ОсновныеДействияФормы);
	//КонецЕсли;
	//Форма.ТабПФ = ?(ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля, уб_ПФ.ПолучитьСтруктуруПечатныхФорм(Объект), Форма.ПолучитьСтруктуруПечатныхФорм());
	ДобавитьТаблицуПечатныхФорм(Форма);
	
	Если ПолучатьСтруктуруПечатныхФормИзОбщегоМодуля Тогда
		Форма.ПечатныеФормы.Загрузить(уб_ПФ.ПолучитьСтруктуруПечатныхФорм(Объект.Ссылка,, ДобавлятьСубагентскиеПФ));
	Иначе
		Форма.ПечатныеФормы.Загрузить(ОбъектОбъекта.ПолучитьСтруктуруПечатныхФорм());
	КонецЕсли;
	
	ДобавитьДополнительныеФормы(Ссылка, Форма.ПечатныеФормы);
	
	Для каждого ПечатнаяФорма из Форма.ПечатныеФормы Цикл
		//Индекс = 1;
		//УИД    = Индекс;
		ИмяКоманды = "ВыполнитьКомандуПечати_"+ПечатнаяФорма.КодПФ;
		Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
			КомандаПечати = Форма.Команды.Добавить(ИмяКоманды);
			КомандаПечати.Действие = "ВыполнитьКомандуПечати";
		КонецЕсли;	
		
		Если ПечатнаяФорма.ПоУмолчанию Тогда
			ЦелеваяГруппа = ОсновныеДействияФормы;
		Иначе
			ЦелеваяГруппа = ОсновныеДействияФормыПодменю
		КонецЕсли;	
		КнопкаПечати = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),ЦелеваяГруппа);
		КнопкаПечати.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаПечати.Заголовок  = ПечатнаяФорма.Наименование;
		КнопкаПечати.ИмяКоманды = ИмяКоманды;
			
		
	КонецЦикла;
	//мДеревоМакетов = ПолучитьДеревоМакетов(Ссылка,Форма.ПечатныеФормы);//РаботаСДиалогами.ПолучитьДеревоМакетовПечати(Ссылка, Форма.ТабПФ, Новый Действие("ОсновныеДействияФормыПечать"), Новый Действие("ОсновныеДействияФормыУстановитьПечатьПоУмолчанию"), Не МаксимальноеКоличествоКнопокПоУмолчанию > 1);
	Возврат;
	//Для каждого СтрокаДерева из мДеревоМакетов.Строки Цикл
	//	Если СтрокаДерева.ТипКнопки = "Действие" Тогда
	//		Если Форма.ТабПФ.НайтиСтроки(Новый Структура("КодПФ",СтрокаДерева.Имя)).Количество() = 0 Тогда
	//			//СтрТабПФ = Форма.ТабПФ.Добавить();
	//			//СтрТабПФ.КодПФ			= СтрокаДерева.Имя;
	//			//СтрТабПФ.Наименование	= СтрокаДерева.Текст;
	//			//СтрТабПФ.ПоУмолчанию = Истина;
	//			//СтрТабПФ.Действовала = Ложь;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//Если УстановитьПодменюПечати Тогда
	//	//проверяем есть ли уже созданная кнопка печати по умолчанию для правильного расположения подменю и печати по умолчанию
	//	//!!РаботаСДиалогами.УстановитьПодменюПечати(Форма.мПодменюПечати, ОсновныеДействияФормы, Форма.мДеревоМакетов.Строки.Количество() > 0);
	//	Если Форма.мПодменюПечати <> Неопределено Тогда
	//		//!!РаботаСДиалогами.СформироватьПодменю(Форма.мДеревоМакетов, Форма.мПодменюПечати, Истина, Истина, Не МаксимальноеКоличествоКнопокПоУмолчанию > 1);
	//	КонецЕсли;
	//Иначе
	//	//удаляем подменю если есть
	//	Кнопки = ОсновныеДействияФормы.Кнопки;
	//	Кнопка = КнопкаПечатиИзКнопокКП(Кнопки, "Подменю");
	//	Если Кнопка <> Неопределено Тогда
	//		Индекс = Кнопки.Индекс(Кнопка);
	//		Кнопки.Удалить(Индекс);
	//		//удаляем связанный разделитель
	//		Если Кнопки[Индекс].ТипКнопки = "Разделитель" Тогда
	//			Кнопки.Удалить(Индекс);
	//		КонецЕсли;
	//	КонецЕсли;
	//	Форма.мПодменюПечати = Неопределено;
	//КонецЕсли;
	//Если УстановитьПечатьПоУмолчанию Тогда
	//	Если МаксимальноеКоличествоКнопокПоУмолчанию > 1 Тогда
	//		//!!РаботаСДиалогами.УстановитьКнопкиПечатьПоУмолчанию(ОсновныеДействияФормы, Форма.мДеревоМакетов, Объект.Метаданные().Имя, "ОсновныеДействияФормыПечатьПоУмолчанию", МаксимальноеКоличествоКнопокПоУмолчанию, Форма);
	//	Иначе
	//		//!!РаботаСДиалогами.УстановитьПечатьПоУмолчанию(Форма.мПечатьПоУмолчанию, ОсновныеДействияФормы, Форма.мДеревоМакетов, Объект.Метаданные().Имя, "ОсновныеДействияФормыПечатьПоУмолчанию");
	//	КонецЕсли;
	//Иначе
	//	//удаляем печать по умолчанию если есть
	//	Кнопки = ОсновныеДействияФормы.Кнопки;
	//	Кнопка = КнопкаПечатиИзКнопокКП(Кнопки, "ПоУмолчанию");
	//	Если Кнопка <> Неопределено Тогда
	//		Индекс = Кнопки.Индекс(Кнопка);
	//		Кнопки.Удалить(Индекс);
	//		//удаляем связанный разделитель
	//		Если Кнопки[Индекс].ТипКнопки = "Разделитель" Тогда
	//			Кнопки.Удалить(Индекс);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьТаблицуПечатныхФорм(Форма)
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ПечатныеФормы",Новый ОписаниеТипов("ТаблицаЗначений"),""));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("КодПФ",Новый ОписаниеТипов("Строка"),"ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Наименование",Новый ОписаниеТипов("Строка"),"ПечатныеФормы"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Новый ОписаниеТипов("СправочникСсылка.ВнешниеОбработки"));
	МассивТипов.Добавить(Новый ОписаниеТипов("СправочникСсылка.уб_ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("СсылкаПФ",Новый ОписаниеТипов(МассивТипов),"ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ДобавлятьВМенюПечати",Новый ОписаниеТипов("Булево"),"ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Статус",Новый ОписаниеТипов("Строка"),"ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Действовала",Новый ОписаниеТипов("Булево"),"ПечатныеФормы"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ПоУмолчанию",Новый ОписаниеТипов("Булево"),"ПечатныеФормы"));
	
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
КонецПроцедуры	

//Функция ПолучитьДеревоМакетов(СсылкаОбъекта,ВнутренниеПечатныеФормы)
//	ДеревоМакетов = ВнутренниеПечатныеФормы.Скопировать();
//	
//	ДобавитьДополнительныеФормы(ДеревоМакетов, СсылкаОбъекта, ВнутренниеПечатныеФормы);
//	
//	Возврат ДеревоМакетов;
//КонецФункции	
&НаСервере
Процедура ДобавитьДополнительныеФормы(СсылкаОбъекта, ВнутренниеПечатныеФормы, ОтборПоНаименованию = Неопределено)
	
	Если ТипЗнч(СсылкаОбъекта) = Тип("ОбъектМетаданных") Тогда
		Возврат;
	КонецЕсли; 	
	МетаданныеОбъекта = СсылкаОбъекта.Метаданные();
	Запрос = Новый Запрос;
	Если ОтборПоНаименованию = Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешниеОбработкиПринадлежность.Ссылка КАК Ссылка,
		|	ВнешниеОбработкиПринадлежность.Ссылка.Наименование КАК Наименование,
		|	ВнешниеОбработкиПринадлежность.НастройкиПостроителяДляОтбора КАК НастройкиПостроителяДляОтбора,
		|	ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма КАК ЗаменяемаяПечатнаяФорма,
		|	ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки КАК ВидОбработки,
		|	ВнешниеОбработкиПринадлежность.НомерСтроки
		|ИЗ
		|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
		|ГДЕ
		|	
		|	ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &Ссылка
		|	И (ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработкиПечатнаяФорма)
		|	И (НЕ ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма ССЫЛКА Справочник.ВнешниеОбработки)
		|	И (НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления)
		|ИТОГИ ПО
		|	ЗаменяемаяПечатнаяФорма,
		|	Ссылка";
	Иначе
		//Если СтрокиДерева.Количество() Тогда
		//	ВставкаВЗапрос = "ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма = &ЗаменяемаяПечатнаяФорма";
		//	Запрос.УстановитьПараметр("ЗаменяемаяПечатнаяФорма", СтрокиДерева[0].Имя);
		//Иначе
			ВставкаВЗапрос = "ВнешниеОбработкиПринадлежность.Ссылка.Наименование = &ПредставлениеПечатнойФормы";
		//КонецЕсли; 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешниеОбработкиПринадлежность.Ссылка КАК Ссылка,
		|	ВнешниеОбработкиПринадлежность.Ссылка.Наименование КАК Наименование,
		|	ВнешниеОбработкиПринадлежность.НастройкиПостроителяДляОтбора КАК НастройкиПостроителяДляОтбора,
		|	ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма КАК ЗаменяемаяПечатнаяФорма,
		|	ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки КАК ВидОбработки,
		|	ВнешниеОбработкиПринадлежность.НомерСтроки
		|ИЗ
		|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
		|ГДЕ
		|	(НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления)
		|	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &Ссылка
		|	И (ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработкиПечатнаяФорма)
		|	И " + ВставкаВЗапрос + "
		|ИТОГИ ПО
		|	ЗаменяемаяПечатнаяФорма,
		|	Ссылка";
		Запрос.УстановитьПараметр("ПредставлениеПечатнойФормы", ОтборПоНаименованию);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидОбработкиПечатнаяФорма", Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма);
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Документы[МетаданныеОбъекта.Имя].ПустаяСсылка());
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("Ссылка", Справочники[МетаданныеОбъекта.Имя].ПустаяСсылка());
	Иначе
		Возврат;
	КонецЕсли;
	БылРазделитель = Истина;//Не СтрокиДерева.Количество() ;
	ВыборкаЗаменяемыхФорм = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаменяемыхФорм.Следующий() Цикл
		ЭтоЗаменяемаяФорма = ЗначениеЗаполнено(ВыборкаЗаменяемыхФорм.ЗаменяемаяПечатнаяФорма);
		НаименованиеПечатнойФормы = "";
		Если ЭтоЗаменяемаяФорма Тогда
			Если ТипЗНЧ(ВнутренниеПечатныеФормы) = Тип("ТаблицаЗначений") Тогда
				СтрокаВнутреннейПечатнойФормы = ВнутренниеПечатныеФормы.Найти(ВыборкаЗаменяемыхФорм.ЗаменяемаяПечатнаяФорма, "КодПФ");
				Если СтрокаВнутреннейПечатнойФормы = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НаименованиеПечатнойФормы = СтрокаВнутреннейПечатнойФормы.Наименование;
			ИначеЕсли ТипЗНЧ(ВнутренниеПечатныеФормы) = Тип("Структура") Тогда
				Если Не ВнутренниеПечатныеФормы.Свойство(ВыборкаЗаменяемыхФорм.ЗаменяемаяПечатнаяФорма, НаименованиеПечатнойФормы) Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;			
		КонецЕсли;
		ПодменятьВстроеннуюФорму = Истина;
		ВыборкаСсылок = ВыборкаЗаменяемыхФорм.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСсылок.Следующий() Цикл			
			Если Не ЭтоЗаменяемаяФорма Тогда
				НаименованиеПечатнойФормы = ВыборкаСсылок.Наименование;
			КонецЕсли;
			Выборка = ВыборкаСсылок.Выбрать();
			Пока Выборка.Следующий() Цикл
				// Проверим, удовлетворяет ли подключаемый отчет указанным в нем условиям
				НастройкиПостроителя = Выборка.НастройкиПостроителяДляОтбора.Получить();
				Если ТипЗнч(НастройкиПостроителя) = Тип("НастройкиПостроителяОтчета") Тогда
					ПостроительОтчета = ИнициализироватьПостроительДопПечатныхФорм(МетаданныеОбъекта.ПолноеИмя(), МетаданныеОбъекта.Представление());
					ПостроительОтчета.Параметры.Вставить("Ссылка", СсылкаОбъекта);
					ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя, Истина, Ложь, Ложь, Ложь, Ложь);
					ПостроительОтчета.Выполнить();
					Если ПостроительОтчета.Результат.Пустой() Тогда
						Продолжить;
					КонецЕсли;
					Подсказка = ", Отбор: " + Строка(ПостроительОтчета.Отбор);
				Иначе
					Подсказка = "";
				КонецЕсли;
				СтруктураРасшифровки = Новый Структура;
				СтруктураРасшифровки.Вставить("ВидПечатнойФормы", 			Выборка.ВидОбработки);
				СтруктураРасшифровки.Вставить("СсылкаНаВнешнююОбработку",   ВыборкаСсылок.Ссылка);
				СтруктураРасшифровки.Вставить("ЗаменяемаяПечатнаяФорма",   	Выборка.ЗаменяемаяПечатнаяФорма);
				СтруктураРасшифровки.Вставить("НомерСтроки",   				Выборка.НомерСтроки);
				СтруктураРасшифровки.Вставить("Наименование",				ВыборкаСсылок.Наименование);
				Если ЭтоЗаменяемаяФорма Тогда					
					СтрокаДерева = ВнутренниеПечатныеФормы.НайтиСтроки(Новый Структура("Наименование",Выборка.ЗаменяемаяПечатнаяФорма));
					//!!!Добавить Удаление
					//Подсказка = "Печатная форма заменена подключаемой" + Подсказка;
					//Если ПодменятьВстроеннуюФорму Тогда
					//	СтрокаДерева = ВнутренниеПечатныеФормы.НайтиСтроки(Новый Структура("Имя",Выборка.ЗаменяемаяПечатнаяФорма);
					//	Если СтрокаДерева.Количество() = 0 Тогда
					//		Продолжить;
					//	КонецЕсли;
					//	ПодменятьВстроеннуюФорму = Ложь;
					//	СтрокаДерева.Расшифровка = СтруктураРасшифровки;
					//	СтрокаДерева.Подсказка = Подсказка;						
					//	Если ОтборПоНаименованию = Неопределено Тогда
					//		Продолжить;
					//	Иначе
					//		Возврат;
					//	КонецЕсли;
					//КонецЕсли;
				Иначе
					Подсказка = "Подключаемая печатная форма" + Подсказка;
				КонецЕсли;
				
				СуществующаяСтрока= ВнутренниеПечатныеФормы.НайтиСтроки(Новый Структура("Наименование",НаименованиеПечатнойФормы));
				Если СуществующаяСтрока.Количество() = 0 Тогда
					НоваяФорма = ВнутренниеПечатныеФормы.Добавить();
					НоваяФорма.Действовала          = Истина;
					НоваяФорма.ДобавлятьВМенюПечати = Истина;
					НоваяФорма.КодПФ         = Выборка.Ссылка.Код;
					НоваяФорма.Наименование  = НаименованиеПечатнойФормы;
					НоваяФорма.ПоУмолчанию   = Ложь;
					НоваяФорма.СсылкаПФ      = Выборка.Ссылка
					//НоваяФорма.Статус        = 
				КонецЕсли;	
				//СуществующаяСтрока = СтрокиДерева.Найти(ПолноеНаименованиеПечатнойФормы, "Текст");
				//Счетчик = 1;
				//Пока Не СуществующаяСтрока = Неопределено Цикл
				//	Счетчик = Счетчик + 1;
				//	ПолноеНаименованиеПечатнойФормы = НаименованиеПечатнойФормы + "(" + Счетчик + ")";
				//	ИндексСтрокиДереваЗаменяемойПечатнойФормы = ?(ЭтоЗаменяемаяФорма, СтрокиДерева.Индекс(СуществующаяСтрока) + 1,Неопределено);
				//	СуществующаяСтрока = СтрокиДерева.Найти(ПолноеНаименованиеПечатнойФормы, "Текст");
				//КонецЦикла; 
				//ДобавитьСтрокуВДеревоКнопок(ДеревоМакетов, Строка(Новый УникальныйИдентификатор), "Действие", ПолноеНаименованиеПечатнойФормы, Неопределено, СтруктураРасшифровки, , Подсказка, , );
				//Если Не ОтборПоНаименованию = Неопределено Тогда
				//	Возврат;
				//КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ДобавитьДополнительныеФормы()

Функция ДобавитьСтрокуВДеревоКнопок(СтрокаПодменю, Имя, Знач ТипКнопки = Неопределено ,Текст = "", Действие = Неопределено, Расшифровка = Неопределено, Пометка = Ложь, Подсказка = "", Картинка = Неопределено, ИзменяетДанные = Ложь)
	
	//Если ТипКнопки = Неопределено Тогда	
	//	ТипКнопки = ТипКнопкиКоманднойПанели.Действие;		 
	//КонецЕсли; 	
	СтрокаКнопки             	= СтрокаПодменю.Строки.Добавить();	
	СтрокаКнопки.Имя         	= Имя;
	//СтрокаКнопки.ТипКнопки   	= ТипКнопки;
	СтрокаКнопки.Текст       	= Текст;
	//СтрокаКнопки.Действие    	= Действие;
	СтрокаКнопки.Картинка    	= Картинка;
	СтрокаКнопки.Подсказка   	= Подсказка;
	СтрокаКнопки.Пометка     	= Пометка;	
	СтрокаКнопки.ИзменяетДанные = ИзменяетДанные;	
	СтрокаКнопки.Расшифровка    = Расшифровка;
	Возврат СтрокаКнопки;
	
КонецФункции

// Функция заполняет начальные параметры построителю отчета, который
//  используется для настройки отбора в мезанизме подключения внешних печатных форм.
//
// Параметры
//  ИмяТаблицы     - Строка, имя таблицы БД к которой необходимо определить запрос
//  СинонимТаблицы - Строка, синоним таблицы БД к которой необходимо определить запрос
//
// Возвращаемое значение:
//   ПостроительОтчета
//

Функция ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицы, СинонимТаблицы) Экспорт

	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Объект.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяТаблицы + " КАК Объект
	|ГДЕ
	|	Объект.Ссылка = &Ссылка
	|{ГДЕ
	|	Объект.Ссылка.*}
	|";
	
	ПолеОбъекта = ПостроительОтчета.ДоступныеПоля.Найти("Ссылка");
	ПолеОбъекта.Представление = ?(НЕ ЗначениеЗаполнено(СинонимТаблицы), ИмяТаблицы, СинонимТаблицы);
	
	Возврат ПостроительОтчета;

КонецФункции // ()

Процедура УдалитьСтарыеКнопкиПоУмолчанию(Форма, ОсновныеДействияФормы)
	
	ТабПФ = Форма.ТабПФ;
	КоличествоСтрок = ТабПФ.Количество();
	Для Счетчик = 1 По КоличествоСтрок Цикл
		СтрокаТЗ = ТабПФ[КоличествоСтрок - Счетчик];
		Если СтрокаТЗ.ПоУмолчанию = Истина Или СтрокаТЗ.СсылкаПФ = Неопределено Тогда
			Элемент = ОсновныеДействияФормы.Кнопки.Найти(СтрокаТЗ.КодПФ);
			Если Элемент <> Неопределено Тогда
				ОсновныеДействияФормы.Кнопки.Удалить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//получает подменю печати или кнопку печати по умолчанию
//Кнопки - кнопки командной панели
//ТипРезультата. Неопределено - возвращает структурой, либо определить "Подменю" Или "ПоУмолчанию"
Функция КнопкаПечатиИзКнопокКП(Кнопки, ТипРезультата = Неопределено) Экспорт
	
	Если ТипРезультата = Неопределено Тогда
		ИскатьПодменю 		= Истина;
		ИскатьПоУмолчанию   = Истина;
		КнопкаПоУмолчанию	= Неопределено;
		КнопкаПодменю 		= Неопределено;
	ИначеЕсли ТипРезультата = "Подменю" Тогда
		ИскатьПодменю		= Истина;
		ИскатьПоУмолчанию	= Ложь;
		КнопкаПодменю 		= Неопределено;
	ИначеЕсли ТипРезультата = "ПоУмолчанию" Тогда
		ИскатьПодменю		= Ложь;
		ИскатьПоУмолчанию	= Истина;
		КнопкаПоУмолчанию	= Неопределено;
	КонецЕсли;
	Если ИскатьПодменю Или ИскатьПоУмолчанию Тогда
		Для Каждого Кнопка Из Кнопки Цикл
			Если ИскатьПодменю И Кнопка.Подсказка = "Меню выбора печатных форм" Тогда
				Если КнопкаПодменю = Неопределено Тогда
					КнопкаПодменю = Кнопка
				Иначе
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Дублирование подменю печати", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина)
				КонецЕсли;
				Если Не ИскатьПоУмолчанию Или КнопкаПоУмолчанию <> Неопределено Тогда
					Прервать
				КонецЕсли;
			КонецЕсли;
			Если ИскатьПоУмолчанию И Кнопка.Подсказка = "Печать по умолчанию" Тогда
				Если КнопкаПоУмолчанию = Неопределено Тогда
					КнопкаПоУмолчанию = Кнопка
				Иначе	
					//TODO проверить, сейчас несколько кнопок, и дублирование вполне нормально?	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Дублирование печати по умолчанию", "НеСообщать", Истина)
				КонецЕсли;
				Если Не ИскатьПодменю Или КнопкаПодменю <> Неопределено Тогда
					Прервать
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ТипРезультата = Неопределено Тогда
			//возвращаем структуру
			Результат = Новый Структура("Подменю, ПоУмолчанию", КнопкаПодменю, КнопкаПоУмолчанию)
		ИначеЕсли ТипРезультата = "Подменю" Тогда
			Результат = КнопкаПодменю
		ИначеЕсли ТипРезультата = "ПоУмолчанию" Тогда
			Результат = КнопкаПоУмолчанию
		КонецЕсли
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // КнопкаПечати()

#КонецОбласти

#Область Файлы

//Устаревшая, сейчас элемент уже должен быть создан на форме
Функция ГенерацияСпискаФайлов(пСписокФайлов,КакДерево = Истина) Экспорт
	пСписокФайлов.ПолучитьЭлементы().Очистить();	
КонецФункции	
Процедура ОбновитьСписок(пСписокФайлов,Документ,эуСписокФайлов,эуИнфо,ПараметрыОбновления = Неопределено,ВидДокумента = "уб_СтраховойПолис",ТекстОтборПоТЧ="1 = 1") Экспорт
	
	Если ПараметрыОбновления=Неопределено Тогда
		ПараметрыОбновления = Новый Структура;
		ПараметрыОбновления.Вставить("ПоказыватьВсе",Истина);
		ПараметрыОбновления.Вставить("ИнойСтрахователь",Неопределено);
		ПараметрыОбновления.Вставить("ПоказыватьДСП",Ложь);
		ПараметрыОбновления.Вставить("ВидГруппировки",0);
		ПараметрыОбновления.Вставить("ОбъектСтрахования",Неопределено);
		ПараметрыОбновления.Вставить("ВсеОбъекты",Истина);
		ПараметрыОбновления.Вставить("ФильтроватьВиды",Ложь);
		ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Истина);
		ПараметрыОбновления.Вставить("ФильтроватьАрхив",Истина);
		
	Иначе
		//Дополнение отсутствующих
		Если ПараметрыОбновления.Свойство("ПоказыватьВсе") = Ложь Тогда
			ПараметрыОбновления.Вставить("ПоказыватьВсе",Истина);
		КонецЕсли;	
		Если ПараметрыОбновления.Свойство("ИнойСтрахователь") = Ложь Тогда
			ПараметрыОбновления.Вставить("ИнойСтрахователь",Неопределено);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ПоказыватьДСП") = Ложь Тогда
			ПараметрыОбновления.Вставить("ПоказыватьДСП",Ложь);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ВидГруппировки") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВидГруппировки",0);
		КонецЕсли;		
		Если ПараметрыОбновления.Свойство("ОбъектСтрахования") = Ложь Тогда
			ПараметрыОбновления.Вставить("ОбъектСтрахования",Неопределено);
		КонецЕсли;
		Если ПараметрыОбновления.Свойство("ВсеОбъекты") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВсеОбъекты", Истина);
		КонецЕсли;
		Если ПараметрыОбновления.Свойство("ФильтроватьВиды") = Ложь Тогда
			ПараметрыОбновления.Вставить("ФильтроватьВиды", Ложь);
		КонецЕсли;
		
		Если ПараметрыОбновления.Свойство("ВсеПоСтрахователю") = Ложь Тогда
			ПараметрыОбновления.Вставить("ВсеПоСтрахователю",Истина);
		КонецЕсли;
		
		Если ПараметрыОбновления.Свойство("ФильтроватьАрхив") = Ложь Тогда
			ПараметрыОбновления.Вставить("ФильтроватьАрхив",Истина);
		КонецЕсли;	
		
	КонецЕсли;
	
	//тзСписокФайлов = пСписокФайлов;//ГенерацияСпискаФайлов(пСписокФайлов);
	
	какСправочник = ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА;
	
	СписокФайлов  = Документ.Ссылка.СписокФайлов;//!!
	Ссылка        = Документ.Ссылка;
	Страхователь  = Документ.Страхователь; 
	Попытка
		ОбъектСтрахования = Документ.ОбъектСтрахования	
	Исключение
		ОбъектСтрахования = Справочники.уб_ОбъектыСтрахования.ПустаяСсылка();
	КонецПопытки;
	
	Если НЕ эуСписокФайлов.ТекущаяСтрока = Неопределено тогда
		мПозиционирование = эуСписокФайлов.ТекущаяСтрока;
	Иначе
		мПозиционирование = Неопределено;
	КонецЕсли;
	ПозиционированиеСтрока = Неопределено;
	
	мСтрахователь = Новый СписокЗначений;
	Если ЗначениеЗаполнено(ПараметрыОбновления.ИнойСтрахователь) Тогда 
		мСтрахователь.Добавить(ПараметрыОбновления.ИнойСтрахователь);
	КонецЕсли;
	
	мПусто = Новый СписокЗначений;
	мПусто.Добавить(Справочники.ФизическиеЛица.ПустаяСсылка());
	мПусто.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	мПусто.Добавить(Неопределено);
	
	Отбор = Новый Структура;
	Отбор.Вставить("СсылкаСправочника",); 
	Если ТекстОтборПоТЧ="1 = 1" Тогда
	Иначе
		Если Найти(ТекстОтборПоТЧ,"УидСтроки")>0 Тогда
			Отбор.Вставить("УидСтроки",Сред(ТекстОтборПоТЧ,Найти(ТекстОтборПоТЧ,"=""")+2,36)); 
		КонецЕсли;	
	КонецЕсли;	
	Текст = "";
	ЗапросФайлов = Новый Запрос;
	
	//TODO реализовать по другому
	//Если ПоказыватьВсе = Истина тогда					
	//	ТекстПоОбъекту = "ВЫБОР
	//	|КОГДА уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования
	//	|	ТОГДА ИСТИНА
	//	|ИНАЧЕ уб_ФайлыКПолисам.ОбъектСтрахования = &ОбъектСтрахования
	//	|КОНЕЦ";
	//	ЗапросФайлов.УстановитьПараметр("ОбъектСтрахования", ОбъектСтрахования);
	//	эуИнфоЗаголовок = "Отбор по Объекту страхования";
	//Иначе 
		ТекстПоОбъекту = "2 = 2";
		эуИнфоЗаголовок = "Нет отбора по Объекту страхования";		
	//КонецЕсли;
	
	Если не эуИнфо = Неопределено Тогда
		эуИнфо.Заголовок = эуИнфоЗаголовок;
	КонецЕсли;
	
	Если какСправочник Тогда
		ВТ = "ВЫБРАТЬ
		     |	СписокФайлов.СсылкаСправочника КАК УИД,
		     |	ВЫБОР
		     |		КОГДА СписокФайлов.СсылкаСправочника.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ВЫБОР
		     |					КОГДА НЕ СписокФайлов.Ссылка ССЫЛКА Документ.уб_СтраховойПолис
		     |						ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |					ИНАЧЕ СписокФайлов.Ссылка.ОбъектСтрахования
		     |				КОНЕЦ
		     |		ИНАЧЕ СписокФайлов.СсылкаСправочника.ОбъектСтрахования
		     |	КОНЕЦ КАК ОбъектСтрахования
		     |ПОМЕСТИТЬ ВТ_Файлы
		     |ИЗ
		     |	Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
		     |ГДЕ
		     |	СписокФайлов.Ссылка = &Ссылка
		     |	И 1 = 1
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.Ссылка,
		     |	уб_ФайлыКПолисам.ОбъектСтрахования
		     |ИЗ
		     |	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Архив = ЛОЖЬ
		     |	И уб_ФайлыКПолисам.Страхователь В(&Страхователь)
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)
		     |	И 2 = 2
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.Ссылка,
		     |	уб_ФайлыКПолисам.ОбъектСтрахования
		     |ИЗ
		     |	Справочник.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Страхователь В(&ИнойСтрахователь)
		     |	И ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)"
		 Иначе
			 
		ВТ = "ВЫБРАТЬ
		     |	СписокФайлов.СсылкаСправочника КАК УИД,
		     |	ВЫБОР
		     |		КОГДА СписокФайлов.СсылкаСправочника.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ВЫБОР
		     |					КОГДА ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка) = ТИП(Документ.уб_СтраховойПолис)
		     |						ТОГДА СписокФайлов.Ссылка.ОбъектСтрахования
			 |					КОГДА 8 = 9
			 |		                ТОГДА 989
		     |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |				КОНЕЦ
		     |		ИНАЧЕ СписокФайлов.СсылкаСправочника.ОбъектСтрахования
		     |	КОНЕЦ КАК ОбъектСтрахования
		     |ПОМЕСТИТЬ ВТ_Файлы
		     |ИЗ
		     |	Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
		     |ГДЕ
		     |	СписокФайлов.Ссылка = &Ссылка
		     |	И 1 = 1
		     |
			 |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	
		     |	 уб_ФайлыКПолисам.УИД В (&УИДЫ)
		     |	И 5 = 5
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И уб_ФайлыКПолисам.Страхователь В(&Страхователь)
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)
		     |	И 2 = 2
		     |
		     |ОБЪЕДИНИТЬ ВСЕ
		     |
		     |ВЫБРАТЬ
		     |	уб_ФайлыКПолисам.УИД,
		     |	ВЫБОР
		     |		КОГДА уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования ЕСТЬ NULL 
		     |			ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ОбъектыСтрахования.ПустаяСсылка)
		     |		ИНАЧЕ уб_ФайлыКПолисам.СтраховойПолис.ОбъектСтрахования
		     |	КОНЕЦ
		     |ИЗ
		     |	РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
		     |ГДЕ
		     |	уб_ФайлыКПолисам.Страхователь В(&ИнойСтрахователь)
		     |	И ВЫБОР
		     |			КОГДА &ФильтроватьАрхив = ИСТИНА
		     |					И уб_ФайлыКПолисам.Архив = ИСТИНА
		     |				ТОГДА ЛОЖЬ
		     |			ИНАЧЕ ИСТИНА
		     |		КОНЕЦ
		     |	И НЕ уб_ФайлыКПолисам.Страхователь В (&ПустойСправочник)"
		 КонецЕсли;
	ЗапросФайлов.УстановитьПараметр("ФильтроватьАрхив",ПараметрыОбновления.ФильтроватьАрхив);
	
	Если Найти(ТекстОтборПоТЧ,"УидСтроки")>0 Тогда
		//чтобы включить вновь добавленные, но еще не записанные		
		ЗапросФайлов.УстановитьПараметр("УИДЫ",Документ.Ссылка.СписокФайлов.Выгрузить(Новый Структура("УидСтроки",Отбор.УидСтроки)).ВыгрузитьКолонку("СсылкаСправочника"));
	Иначе
		ЗапросФайлов.УстановитьПараметр("УИДЫ",Новый Массив);
	КонецЕсли;	
		
	
	ЗапросФайлов.Текст = ВТ+" ; "+"ВЫБРАТЬ
	                              |	уб_ФайлыКПолисам.УИД КАК СсылкаСправочника,
	                              |	ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПубликации,
	                              |	уб_ФайлыКПолисам.ВидФайлаB2B КАК ВидФайлаB2B,
	                              |	уб_ФайлыКПолисам.ФайлИмя КАК Имя,
	                              |	уб_ФайлыКПолисам.Хранилище.Путь КАК ХранилищеПуть,
	                              |	уб_ФайлыКПолисам.ПутьКПапке КАК ПутьКПапке,
	                              |	уб_ФайлыКПолисам.Страхователь КАК Страхователь,
	                              |	уб_ФайлыКПолисам.Размещен КАК Опубликован,
								  |	уб_ФайлыКПолисам.Архив КАК Архив,
	                              |	уб_ФайлыКПолисам.СтраховойПолис КАК СтраховойПолис,
	                              |	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """") КАК СтраховойПолисНомер,
	                              |	ВЫБОР
	                              |		КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ЛОЖЬ
	                              |	КОНЕЦ КАК ЭтотОбъект,
	                              |	ЗаписьСправочник.ОбъектСтрахования,
	                              |	ВЫБОР
	                              |		КОГДА &ВсеОбъекты = ИСТИНА
	                              |				ИЛИ уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования = ИСТИНА
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ВЫБОР
	                              |				КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ
	                              |	КОНЕЦ КАК УсловноЭтотОбъект,
	                              |	уб_ФайлыКПолисам.ВидДокумента
	                              |ИЗ
	                              |	(ВЫБРАТЬ
								  |    ВТ_Файлы.УИД КАК УИД,
								  |    МАКСИМУМ(ВТ_Файлы.ОбъектСтрахования) КАК ОбъектСтрахования
								  |  ИЗ
								  |	   ВТ_Файлы КАК ВТ_Файлы
								  |
								  |СГРУППИРОВАТЬ ПО
								  |	ВТ_Файлы.УИД) КАК ЗаписьСправочник
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам КАК уб_ФайлыКПолисам
	                              |		ПО ЗаписьСправочник.УИД = уб_ФайлыКПолисам.УИД
								  |	И ВЫБОР
								  |			КОГДА &ФильтроватьАрхив = ИСТИНА
								  |					И уб_ФайлыКПолисам.Архив = ИСТИНА
								  |				ТОГДА ЛОЖЬ
								  |			ИНАЧЕ ИСТИНА
								  |		КОНЕЦ
	                              |			И (&ПоказыватьДСП = ИСТИНА
	                              |				ИЛИ (уб_ФайлыКПолисам.Размещен = ИСТИНА
	                              |					ИЛИ НЕ(уб_ФайлыКПолисам.ВидФайлаB2B = ЗНАЧЕНИЕ(Перечисление.уб_ВидыФайловB2B.ДСП)
	                              |							И уб_ФайлыКПолисам.СтраховойПолис <> &Ссылка)))
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			СписокФайлов.СсылкаСправочника КАК СсылкаСправочника,
	                              |			СписокФайлов.ДатаПубликации КАК ДатаПубликации,
	                              |			СписокФайлов.Размещен КАК Размещен,
	                              |			СписокФайлов.Опубликован КАК Опубликован
	                              |		ИЗ
	                              |			Документ.уб_СтраховойПолис.СписокФайлов КАК СписокФайлов
	                              |		ГДЕ
	                              |			СписокФайлов.Ссылка = &Ссылка
	                              |			И 1 = 1) КАК ПолисДатаРазм
	                              |		ПО ЗаписьСправочник.УИД = ПолисДатаРазм.СсылкаСправочника
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	уб_ФайлыКПолисам.УИД,
	                              |	уб_ФайлыКПолисам.ВидФайлаB2B,
	                              |	уб_ФайлыКПолисам.ФайлИмя,
	                              |	уб_ФайлыКПолисам.Хранилище.Путь,
	                              |	уб_ФайлыКПолисам.ПутьКПапке,
	                              |	уб_ФайлыКПолисам.Страхователь,
	                              |	уб_ФайлыКПолисам.Размещен,
								  |	уб_ФайлыКПолисам.Архив,
	                              |	уб_ФайлыКПолисам.СтраховойПолис,
	                              |	ЗаписьСправочник.ОбъектСтрахования,
	                              |	ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """"),
	                              |	ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	                              |	ВЫБОР
	                              |		КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ЛОЖЬ
	                              |	КОНЕЦ,
	                              |	ВЫБОР
	                              |		КОГДА &ВсеОбъекты = ИСТИНА
	                              |				ИЛИ уб_ФайлыКПолисам.ВидДокумента.НеСвязанСОбъектомСтрахования = ИСТИНА
	                              |			ТОГДА ИСТИНА
	                              |		ИНАЧЕ ВЫБОР
	                              |				КОГДА ЗаписьСправочник.ОбъектСтрахования = &ОбъектСтрахования
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ
	                              |	КОНЕЦ,
	                              |	уб_ФайлыКПолисам.ВидДокумента
								  |Упорядочить по Выбор Когда уб_ФайлыКПолисам.ВидДокумента = Значение(Справочник.уб_ВидыДокументовКПолисам.ПустаяСсылка) Тогда Ложь Иначе Истина Конец УБЫВ,ЕСТЬNULL(ПолисДатаРазм.ДатаПубликации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) убыв";
								  
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"Документ.уб_СтраховойПолис.СписокФайлов","Документ."+ВидДокумента+".СписокФайлов");
	Если ВидДокумента = "уб_ЗаявкаНаЗаказВыездногоСпециалиста" Тогда
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"8 = 9","ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка) = ТИП(Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста)  и ТИПЗНАЧЕНИЯ(СписокФайлов.Ссылка.НомерДоговора)= ТИП(Документ.уб_СтраховойПолис)");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"989","СписокФайлов.Ссылка.НомерДоговора.ОбъектСтрахования");
	КонецЕсли;
	
	Если какСправочник Тогда
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ФайлыКПолисам","ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ФайлыКПолисам");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.Размещен","уб_ФайлыКПолисам.Опубликован");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.СтраховойПолис ","&Ссылка");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"уб_ФайлыКПолисам.СтраховойПолис,","&Ссылка");
		ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"ЕСТЬNULL(уб_ФайлыКПолисам.СтраховойПолис.Номер, """")","""""");
		
	КонецЕсли;	
	
	Если ПараметрыОбновления.ВсеПоСтрахователю  = Истина Тогда
		
	Иначе
		ТекстПоОбъекту = "2 = 1";
	КонецЕсли;
	
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"2 = 2",ТекстПоОбъекту);
	ЗапросФайлов.Текст = СтрЗаменить(ЗапросФайлов.Текст,"1 = 1",ТекстОтборПоТЧ);
	
	ЗапросФайлов.УстановитьПараметр("Страхователь", Страхователь);
	ЗапросФайлов.УстановитьПараметр("ИнойСтрахователь", мСтрахователь);
	ЗапросФайлов.УстановитьПараметр("ПоказыватьДСП", ПараметрыОбновления.ПоказыватьДСП);//Показываются только выбранные или дсп текущего документа (сканы квитанций, других полисов)
	ЗапросФайлов.УстановитьПараметр("ВсеОбъекты", ПараметрыОбновления.ВсеОбъекты);
	ЗапросФайлов.УстановитьПараметр("ОбъектСтрахования", ПараметрыОбновления.ОбъектСтрахования);
	ЗапросФайлов.УстановитьПараметр("ПустойСправочник", мПусто);
	ЗапросФайлов.УстановитьПараметр("Ссылка", Ссылка);
	ФильтроватьВиды = ПараметрыОбновления.ФильтроватьВиды<>Ложь;
	
	АвтоРазмещение = ТипЗнч(Ссылка) = Тип("ДокументСсылка.уб_СтраховойПолис");  
	Выборка = ЗапросФайлов.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		
		УжеРазмещен = ЛОЖЬ;
		Для каждого ТекЭлемент из СписокФайлов Цикл
			ВсёСовпало = Истина;
			Для каждого ЭлементОтбора из отбор Цикл
				Если НЕ ТекЭлемент[ЭлементОтбора.Ключ] = ЭлементОтбора.Значение Тогда
					ВсёСовпало = Ложь;
				КонецЕсли;	
			КонецЦикла;	
			Если ВсёСовпало = Истина Тогда
				УжеРазмещен = Истина;
			КонецЕсли;	
		КонецЦикла;	
		//Массив = СписокФайлов.НайтиСтроки(Отбор);
		//
		//УжеРазмещен = Массив.Количество()>0;
		Если УжеРазмещен = Ложь и ФильтроватьВиды = Истина Тогда
			Если ПараметрыОбновления.ФильтроватьВиды.Найти(Выборка.ВидДокумента) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		//Список в объекте не изменяем
		//Если АвтоРазмещение и Выборка.Опубликован и Выборка.СтраховойПолис = Ссылка Тогда
		//	Если УжеРазмещен = Ложь Тогда
		//		УжеРазмещен = Истина;
		//		ТЧСтрокаДокумента = СписокФайлов.Добавить();
		//		ЗаполнитьЗначенияСвойств(ТЧСтрокаДокумента,Выборка);		
		//		ТЧСтрокаДокумента.ДатаПубликации = Выборка.ДатаПубликации;
		//		ТЧСтрокаДокумента.Размещен = ИСТИНА;
		//		ТЧСтрокаДокумента.СсылкаСправочника = Выборка.СсылкаСправочника;
		//		ТЧСтрокаДокумента.Опубликован = Выборка.Опубликован;
		//		//Попытка
		//		//	ТЧСтрокаДокумента.Архив = Выборка.Архив;				
		//		//Исключение
		//		//КонецПопытки;	
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ПараметрыОбновления.ПоказыватьВсе = Ложь и УжеРазмещен = Ложь Тогда
			Продолжить;
		КонецЕсли;	
		Если Выборка.УсловноЭтотОбъект = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = пСписокФайлов.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Размещен = УжеРазмещен;
		НоваяСтрока.УидСтроки = Отбор.УидСтроки;
		
		//Если НЕ ЗначениеЗаполнено(Выборка.ВидФайлаB2B) тогда
		//	ПутьКФайлу = Выборка.ПутьКПапке + "\" + Выборка.Имя;
		//Иначе
		//	ПутьКФайлу = Выборка.ХранилищеПуть +"\"+ Выборка.ПутьКПапке + "\" + Выборка.Имя;
		//КонецЕсли;
		ПутьКФайлу  = ?(ПустаяСтрока(Выборка.ХранилищеПуть),"",Выборка.ХранилищеПуть+"\")+
					  ?(ПустаяСтрока(Выборка.ПутьКПапке),"",Выборка.ПутьКПапке+"\")+Выборка.Имя;
		НоваяСтрока.ПолноеИмя = ПутьКФайлу;
		
		
	КонецЦикла;
	//Формирование дерева
	Если ПараметрыОбновления.ВидГруппировки = 0  Тогда
		//эуСписокФайлов.
		//тзСписокФайлов.Сортировать("Размещен убыв,Имя");
		//дзСписокФайлов = ГенерацияСпискаФайлов(Истина);
		//Для каждого СтрокаФайла Из тзСписокФайлов Цикл
		//	Строка1 = дзСписокФайлов.ПолучитьЭлементы().Добавить();
		//	ЗаполнитьЗначенияСвойств(Строка1,СтрокаФайла);
		//	Если СтрокаФайла.СсылкаСправочника = мПозиционирование Тогда
		//		мПозиционированиеСтрока = Строка1;
		//	КонецЕсли;
		//КонецЦикла;
		//дзСписокФайлов.Строки.Сортировать("Размещен убыв,Имя");
	Иначе
		Если ПараметрыОбновления.ВидГруппировки = 1 Тогда
			ИмяГруппировки = "СтраховойПолис";
		ИначеЕсли ПараметрыОбновления.ВидГруппировки = 2 Тогда
			ИмяГруппировки = "ВидФайлаB2B";
		ИначеЕсли ПараметрыОбновления.ВидГруппировки = 3 Тогда
			ИмяГруппировки = "ОбъектСтрахования";	
		КонецЕсли;
		 
		//тзГруппировки = тзСписокФайлов.Скопировать(,ИмяГруппировки); 
		//тзГруппировки.Свернуть(ИмяГруппировки);
		//Если ПараметрыОбновления.ВидГруппировки = 1 Тогда
		//	тзГруппировки.Колонки.Добавить("ЭтотПолис");
		//	Для каждого стрГруппировки Из тзГруппировки Цикл
		//		стрГруппировки.ЭтотПолис = стрГруппировки.СтраховойПолис = Ссылка; 
		//	КонецЦикла;	
		//	тзГруппировки.Сортировать("ЭтотПолис УБЫВ,СтраховойПолис");	//Текущий полис вверх
		//Иначе
		//	тзГруппировки.Сортировать(ИмяГруппировки);	
		//КонецЕсли;
		//
		//дзСписокФайлов = ГенерацияСпискаФайлов(Истина);
		//Для каждого стрГруппировки Из тзГруппировки Цикл
		//	Строка0 = дзСписокФайлов.ПолучитьЭлементы().Добавить();
		//	Строка0.Имя = стрГруппировки[ИмяГруппировки];
		//	Если ИмяГруппировки = "СтраховойПолис" Тогда //Для раскраскки при выводе
		//		Строка0.СтраховойПолис = стрГруппировки[ИмяГруппировки];
		//		Строка0.СтраховойПолисНомер = стрГруппировки[ИмяГруппировки].Номер;
		//	КонецЕсли;	
		//	Для каждого СтрокаФайла Из тзСписокФайлов.Скопировать(Новый Структура(ИмяГруппировки,Строка0.Имя)) Цикл
		//		Строка1 = Строка0.ПолучитьЭлементы().Добавить();
		//		ЗаполнитьЗначенияСвойств(Строка1,СтрокаФайла);
		//		Если СтрокаФайла.СсылкаСправочника = мПозиционирование Тогда
		//			мПозиционированиеСтрока = Строка1;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЦикла;
		//пСписокФайлов = дзСписокФайлов;
		
	КонецЕсли;	
	
	//пСписокФайлов = дзСписокФайлов;
	//Если Не мПозиционирование = Неопределено Тогда 
	//	Если Не мПозиционированиеСтрока = Неопределено Тогда
	//		эуСписокФайлов.ТекущаяСтрока = мПозиционированиеСтрока;
	//	КонецЕсли;	
	////	СтрокаПозиционирования = мСписокФайлов.Найти(мПозиционирование, "СсылкаСправочника");
	////	Если НЕ СтрокаПозиционирования = Неопределено Тогда 
	////		эуСписокФайлов.ТекущаяСтрока = СтрокаПозиционирования;
	////	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьСтруктуруДанныхФормы(ДанныеФормы) Экспорт
    Массив = Новый Массив;
    Массив.Добавить(ДанныеФормы);
    Запись = Новый ЗаписьFastInfoset;
    Запись.УстановитьДвоичныеДанные();
    СериализаторXDTO.ЗаписатьXML(Запись, Массив);
    
    Чтение = Новый ЧтениеFastInfoset;
    Чтение.УстановитьДвоичныеДанные(Запись.Закрыть());
    Результат = Новый Структура;
    
    Пока Чтение.Прочитать() Цикл
        Если Чтение.Имя = "field" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            ИмяПоля = Чтение.ЗначениеАтрибута("nameRu");
            Если ИмяПоля = Неопределено Тогда
                ИмяПоля = Чтение.ЗначениеАтрибута("name");
            КонецЕсли;
            
			Если ИмяПоля <> Неопределено 
				И ИмяПоля <> "СтандартнаяКартинкаСтроки"
      			И ИмяПоля <> "СтрокаДинамическогоСписка.ГруппировкаСтроки"
				Тогда
                Результат.Вставить(ИмяПоля,ДанныеФормы[ИмяПоля]);
            КонецЕсли;                
        КонецЕсли;
    КонецЦикла;
    
    Возврат Результат
КонецФункции

Функция ВидыДокументовКПолисам() Экспорт 
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	виды.Ссылка
	               |ИЗ
	               |	Справочник.уб_ВидыДокументовКПолисам КАК виды
	               |ГДЕ
	               |	виды.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ виды.Наименование ПОДОБНО ""я%""
	               |	И виды.НеИспользуется = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	виды.Наименование";
	Сз = Новый СписокЗначений;
	Сз.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СЗ;

КонецФункции	
#КонецОбласти