&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элемент = Элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент0;
	//Элемент.Ширина = 45;
	//Элемент.РастягиватьПоГоризонтали = Ложь;
	
	УстановитьОтбор();

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если День(ТекущаяДата())>10 Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	Иначе
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	КонецЕсли;
		
	
	ПараметрыФункции = Неопределено;
	уб_СС.ПодчиненныеРуководителя(, ТекущаяДата(), ПараметрыФункции);
	Если РольДоступна("ПолныеПрава") Тогда
		СписокСотрудников = 	уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(ТекущаяДата());
	Иначе
		СписокСотрудников = ПараметрыФункции.СписокСотрудников;
		Элементы.НастройкиОтчета.Доступность = Ложь;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если СписокСотрудников.Количество() = 0 Тогда
			СписокСотрудников.Добавить(ПараметрыСеанса.уб_ТекущееФизЛицо);
		КонецЕсли;	
	КонецЕсли;	
	Если СписокСотрудников.Количество() = 1 Тогда
		Менеджер = СписокСотрудников[0].Значение ;
		Элементы.Менеджер.ТолькоПросмотр = Истина;
		Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(СписокСотрудников.ВыгрузитьЗначения());

	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(уб_temp.ПолучитьСписокАктуальныхПодразделений().ВыгрузитьЗначения());

	
КонецПроцедуры


&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Обработка = РеквизитФормыВЗначение("Отчет");
	
	
	СписокСотрудников = Элементы.Менеджер.СписокВыбора.ВыгрузитьЗначения();	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Менеджер");
	Настройка = Обработка.КомпоновщикНастроек.Настройки;
	
	ТекПараметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ТекПараметр.Использование = Истина;
	ТекПараметр.Значение      = Период.ДатаНачала;
	//
	ТекПараметр = Настройка.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	ТекПараметр.Использование = Истина;
	ТекПараметр.Значение      = Период.ДатаОкончания;
	
	//Отбор по доступным менеджера 
	Если  СписокСотрудников.Количество()>0 Тогда
		
		ФлЕстьОтбор = Ложь;
		Для каждого ЭлементОтбора из Настройка.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
				и ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке Тогда
				ФлЕстьОтбор = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;	
		Если ФлЕстьОтбор = ЛОЖЬ Тогда
			ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;	
		ЭлементОтбора.ЛевоеЗначение		= ПолеОтбора;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование 	= Истина;
		//ЭлементОтбора.ПравоеЗначение 	= Справочники.ФизическиеЛица.ПустаяСсылка();
		ЭлементОтбора.Представление		= ""+СписокСотрудников;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		
		
	КонецЕсли;	
	
	
	//Отбор по менеджеру
	ФлЕстьОтбор = Ложь;
	Для каждого ЭлементОтбора из Настройка.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
			и ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно Тогда
			ФлЕстьОтбор = Истина;
			Прервать
		КонецЕсли;
	КонецЦикла;	
	Если ФлЕстьОтбор = ЛОЖЬ Тогда
		ЭлементОтбора = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= ЗначениеЗаполнено(Менеджер);
	//ЭлементОтбора.Представление		= Поставщик;
	ЭлементОтбора.ПравоеЗначение	= Менеджер;
	ЗначениеВРеквизитФормы(Обработка,"Отчет");
КонецПроцедуры	

