Функция ПоследнееСообщение(Получатель,ИмяКанала) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	уб_Чат_Сообщения.Период КАК Период,
	 |	уб_Чат_Сообщения.Отправитель,
	 |	уб_Чат_Сообщения.Получатель,
	 |	уб_Чат_Сообщения.ИмяКанала,
	 |	уб_Чат_Сообщения.ИДСообщения,
	 |	уб_Чат_Сообщения.Заголовок,
	 |	уб_Чат_Сообщения.Сообщение
	 |ИЗ
	 |	РегистрСведений.уб_Чат_Сообщения КАК уб_Чат_Сообщения
	 |ГДЕ
	 |	уб_Чат_Сообщения.ИмяКанала = &ИмяКанала
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Период УБЫВ";
	 Запрос.УстановитьПараметр("ИмяКанала",ИмяКанала);
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Возврат Выборка.Сообщение;
	 Иначе
		 Возврат ""
	 КонецЕсли;
	 
	 УстановитьПривилегированныйРежим(Ложь);
	 
КонецФункции	