#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураПараметров = уб_ФормыВызовСервера.ПолучитьСтруктуруДанныхФормы(Параметры);
	//ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураПараметров);
	Для каждого Параметр из СтруктураПараметров Цикл
		Попытка
			Объект[Параметр.Ключ] = Параметр.Значение;
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
	ОбновитьСписокМенеджеров();
	Если Параметры.Свойство("Сформровать") Тогда
		ТабДок = Новый ТабличныйДокумент;
		СформироватьОтчетНаСервере(, , , , ТабДок);
		ДокументРезультат = ТабДок;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ТекПользователь = ПолучитьПараметрСеансаТекущийПользователь();
	ФизЛицоТекущийПользователь = ТекПользователь.ФизЛицо;
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод)Тогда		
		//Невнешнее открытие
		Объект.ЗарплатныйПериод 						= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ЗарплатныйПериод");
		Объект.ВидСП 									= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ВидСП");
		Если уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Тогда
			Объект.ПересчитыватьСуммыВОплатах = ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ПересчитыватьСуммыВОплатах");
		КонецЕсли;	
		Объект.ВыводитьПримечанияКВМВячейки 			= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ВыводитьПримечанияКВМВячейки");
		Объект.СкрыватьКолонкиДСП 						= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","СкрыватьКолонкиДСП");
		Объект.ОтображатьКолонкиДляСхемыПланПоСКВ 		= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ОтображатьКолонкиДляСхемыПланПоСКВ");
		Объект.ОтображатьТолькоФамилии 					= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ОтображатьТолькоФамилии");
		Объект.ПоказатьТолькоОплатыНеИзЭтогоЗППериода 	= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ПоказатьТолькоОплатыНеИзЭтогоЗППериода");
		Объект.ОтображатьОплатыИсключенныеИзРасчетаЗП 	= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","ОтображатьОплатыИсключенныеИзРасчетаЗП");		
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод) Тогда
		Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(ТекущаяДата()));
	КонецЕсли;
	
	Элементы.ПересчитыватьСуммыВОплатах.Доступность = уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ");
	
	ОбновитьПредставлениеЗППериода();
	РежимОтчета = РежимОтчета;
	УправлениеВидимостью();	
	Если  уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
		Объект.Менеджер 		= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","Менеджер");
		Объект.Подразделение 	= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","Подразделение");
		Объект.Организация 		= ЗагрузитьИзХранилищаНастроек("Обработка_РасчетЗПМенеджерамОП","Организация");
	КонецЕсли;
	Отказ = ПриИзмененииУсловий();
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет доступа!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СохранитьЗначенияРеквизитов();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РежимОтчетаПриИзменении(Элемент)
	
	УправлениеВидимостью();
	Если Объект.РежимОтчета = 1 Тогда
		Объект.ТолькоСОтличиями = Истина;
	//	Элементы.рПериодЗП.Ширина = 17;
	//	Элементы.Менеджер.Ширина = 24;
	//Иначе
	//	Элементы.рПериодЗП.Ширина = 18;
	//	Элементы.Менеджер.Ширина = 23;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УправлениеВидимостью()
	
	бСравнение = Объект.РежимОтчета = 1;
	//Одиночное
	Элементы.Подразделение.Видимость = НЕ бСравнение;
	Элементы.ДатаСреза.Видимость = НЕ бСравнение;
	Элементы.ПересчитыватьСуммыВОплатах.Видимость = НЕ бСравнение и уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ");
	//Сравнение
	Элементы.ОткрытьОтчетОбИзмененияхВОплатах.Видимость =  бСравнение;
	Элементы.ТолькоСОтличиями.Видимость = бСравнение;
	Элементы.ДатаСреза1.Видимость = бСравнение;
	Элементы.ДатаСреза2.Видимость = бСравнение;
	
КонецПроцедуры

// Процедура устанавливает значение расчетного периода и его представление в реквизит формы
&НаКлиенте
Процедура ОбновитьПредставлениеЗППериода(ЗначениеЗпПериода = Неопределено) Экспорт
	
	Если ЗначениеЗпПериода = Неопределено Тогда
		ЗначениеЗпПериода = ДайЗарплатныйПериод();
	КонецЕсли;
	Объект.ЗарплатныйПериод = ЗначениеЗпПериода;
	УстановитьОтображениеМесячногоПериода("рПериодЗП",Объект.ЗарплатныйПериод);
	
КонецПроцедуры

&НаКлиенте
Функция ДайЗарплатныйПериод()
	Возврат НачалоМесяца(Объект.ЗарплатныйПериод);	
КонецФункции

&НаКлиенте
Процедура УстановитьОтображениеМесячногоПериода(Элемент,Реквизит)
	
	мФорматМесячногоПериода = "ДФ='ММММ гггг'";
	ЭтаФорма[Элемент] = Формат(Реквизит, мФорматМесячногоПериода);
	Если Реквизит = НачалоДня(КонецМесяца(ТекущаяДата())) Тогда
		Элементы[Элемент].ЦветТекста = Новый Цвет(164, 40, 190);	
	ИначеЕсли Реквизит > НачалоДня(КонецМесяца(ТекущаяДата())) Тогда
		Элементы[Элемент].ЦветТекста = ПолучитьЦветСтиля("ЦветОтрицательногоЧисла");
	Иначе
		Элементы[Элемент].ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветСтиля(Цвет)
	Возврат ЦветаСтиля[Цвет];
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрСеансаТекущийПользователь()
	Структура = Новый Структура;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекПользователь);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.ФизЛицо,
	|	Пользователи.Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Структура.Вставить("ФизЛицо", Выборка.ФизЛицо);
		Структура.Вставить("Представление", Выборка.Представление);
	Иначе
		Структура.Вставить("ФизЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
		Структура.Вставить("Представление", "");
	КонецЕсли;
	Возврат Структура;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустоеПодразделение()
	Возврат Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура ОбновитьСписокМенеджеров()
	СписокВыбора = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.ЗарплатныйПериод);
	Элементы.Менеджер.СписокВыбора.Очистить();
	Для Каждого Элемент Из СписокВыбора Цикл
		Элементы.Менеджер.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьВХранилищеНастроек(КлючОбъекта, КлючНастроек, Настройки)
	ХранилищеПользовательскихНастроекОтчетов.Сохранить(КлючОбъекта, КлючНастроек, Настройки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзХранилищаНастроек(КлючОбъекта, КлючНастроек)
	Возврат ХранилищеПользовательскихНастроекОтчетов.Загрузить(КлючОбъекта, КлючНастроек);
КонецФункции

&НаКлиенте
Процедура СохранитьЗначенияРеквизитов()
	
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ЗарплатныйПериод", 						Объект.ЗарплатныйПериод);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "Менеджер", 								Объект.Менеджер);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ВидСП", 									Объект.ВидСП);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "Подразделение", 							Объект.Подразделение);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "Организация", 							Объект.Организация);
	Если  уб_КЭШируемые.ДоступностьРоли("уб_ЗП_ПолныйДоступ") Тогда
		СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ПересчитыватьСуммыВОплатах", 			Объект.ПересчитыватьСуммыВОплатах);
	КонецЕсли;	
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ВыводитьПримечанияКВМВячейки", 			Объект.ВыводитьПримечанияКВМВячейки);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "СкрыватьКолонкиДСП", 					Объект.СкрыватьКолонкиДСП);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ОтображатьКолонкиДляСхемыПланПоСКВ", 	Объект.ОтображатьКолонкиДляСхемыПланПоСКВ);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ОтображатьТолькоФамилии", 				Объект.ОтображатьТолькоФамилии);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ПоказатьТолькоОплатыНеИзЭтогоЗППериода", Объект.ПоказатьТолькоОплатыНеИзЭтогоЗППериода);
	СохранитьВХранилищеНастроек("Обработка_РасчетЗПМенеджерамОП", "ОтображатьОплатыИсключенныеИзРасчетаЗП", Объект.ОтображатьОплатыИсключенныеИзРасчетаЗП);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИзмененияхВОплатах(Команда)
	ОткрытьОтчетОбИзмененияхВОплатахНаКлиенте(Объект.ДатаСреза1, Объект.ДатаСреза2, Объект.Менеджер, Объект.ЗарплатныйПериод);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОбИзмененияхВОплатахНаКлиенте(ДатаСреза1, ДатаСреза2, Менеджер, ЗарплатныйПериод)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Форма = Отчеты.уб_ОтчетПоПравкамОплатДляЗП.ПолучитьФорму();
	ПриведеннаяДатаСреза1 = ДатаСреза1;
	ПриведеннаяДатаСреза2 = ДатаСреза2;
	ТД = ТекущаяДата();
	Если НЕ ЗначениеЗаполнено(ПриведеннаяДатаСреза1) Тогда
		ПриведеннаяДатаСреза1 = ТД;
	Конецесли;
	Если НЕ ЗначениеЗаполнено(ПриведеннаяДатаСреза2) Тогда
		ПриведеннаяДатаСреза2 = ТД;
	Конецесли;
	Минимум = Мин(ПриведеннаяДатаСреза1,ПриведеннаяДатаСреза2);
	Максимум = Макс(ПриведеннаяДатаСреза1,ПриведеннаяДатаСреза2);
	
	//Ограничение по дате началаведения истории
	Минимум = Макс(Минимум,Дата(2011,12,25,1,1,1));
	Максимум = Макс(Максимум,Дата(2011,12,25,1,1,1));
	
	Форма.НачПериода = Минимум;
	Форма.КонПериода = Максимум;
	
	Форма.Менеджер = Менеджер;
	Форма.РасчетныйПериод = ЗарплатныйПериод;
	Форма.ФильтрПоПериоду = Истина;
	Форма.Открыть();
	#Иначе
	//!Пока не работает так как нужно нарисовать управляемую форму!
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Отчет об изменениях в оплатах временно не работает в тонком клиенте.";
	Сообщение.Сообщить();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура рПериодЗПНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Объект.ЗарплатныйПериод, ЭтаФорма);
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, НачальноеЗначение = Неопределено);
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Формат(НачалоМесяцаЗаполнения, "ДФ='MMMM yyyy'"));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли;
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, ВыбранныйЭлемент.Значение);
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = ВыбранныйЭлемент.Значение;
	ЭтаФорма[Элемент.Имя] = Формат(ПериодРегистрации, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаКлиенте
Процедура рПериодЗПРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод) Тогда
		ОбновитьПредставлениеЗППериода();
		Возврат;
	КонецЕсли;
	Если Направление = 1 Тогда // увеличиваем значение
		Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(КонецМесяца(Объект.ЗарплатныйПериод) + 1));
	Иначе // = -1 - уменьшаем значение
		Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(НачалоМесяца(Объект.ЗарплатныйПериод) - 1));
	КонецЕсли;
	ОбновитьПредставлениеЗППериода(Объект.ЗарплатныйПериод);
	СтандартнаяОбработка = Ложь;
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ЭтаФорма.ДокументРезультат.Напечатать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСразу(Команда)
	ЭтаФорма.ДокументРезультат.Напечатать();
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ДокументРезультат;
	ШелСкрипт = Новый COMОбъект("WScript.Shell");
	ШелСкрипт.SendKeys("%");
	ШелСкрипт.SendKeys("{DOWN}");
	ШелСкрипт.SendKeys("{RIGHT}");
	Для к = 1 по 7 Цикл
		ШелСкрипт.SendKeys("{DOWN}");
	КонецЦикла;
	ШелСкрипт.SendKeys("~");
	ШелСкрипт = Null;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСтраницы(Команда)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ДокументРезультат;
	ШелСкрипт = Новый COMОбъект("WScript.Shell");
	ШелСкрипт.SendKeys("%");
	ШелСкрипт.SendKeys("{DOWN}");
	ШелСкрипт.SendKeys("{RIGHT}");
	Для к = 1 по 8 Цикл
		ШелСкрипт.SendKeys("{DOWN}");
	КонецЦикла;
	ШелСкрипт.SendKeys("~");
	ШелСкрипт = Null;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Расшифровка.Ссылка.ПолучитьФорму().Открыть();
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатПриАктивизацииОбласти(Элемент)
	
	Элемент.КонтекстноеМеню.ПодчиненныеЭлементы.ПосмотретьКС.Доступность = Элемент.ТекущаяОбласть.Имя = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьКС(Команда)
	;
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	//СохранитьЗначенияРеквизитов();
	Массив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	СтрокаПрефикс = "" + Массив[0] + "." + Массив[1] + "." + Массив[2] + ".";
	Если ОткрытьФормуМодально(СтрокаПрефикс + "ФормаНастройкиУправляемая",,ЭтаФорма) = Истина Тогда
		
	КонецЕсли;
	ОбновитьПредставлениеЗППериода();
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоЗП(Команда = Неопределено, Знач фТЗОплат = Неопределено, Знач фТЗАгентов=Неопределено, Знач фтзПодразделений = Неопределено, Знач фтзСхемаРасчетаДляАгентов=Неопределено) Экспорт
	
	Если Объект.РежимОтчета = 1 И Не ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Предупреждение("В режиме сравнения менеджер должен быть заполнен!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод) Или СокрЛП(ЭтаФорма.рПериодЗП) = "" Тогда
		Предупреждение("Не выбран период");
		Возврат;
	КонецЕсли;
	ТабДок = Новый ТабличныйДокумент;
	СформироватьОтчетНаСервере(фТЗОплат, фТЗАгентов, фтзПодразделений, фтзСхемаРасчетаДляАгентов, ТабДок);
	ДокументРезультат = ТабДок;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(Знач фТЗОплат, Знач фТЗАгентов, Знач фтзПодразделений, Знач фтзСхемаРасчетаДляАгентов, ДокументРезультат)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СформироватьОтчет(фТЗОплат, фТЗАгентов, фтзПодразделений, фтзСхемаРасчетаДляАгентов, ДокументРезультат);
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииУсловийСервер(НовыйПериод = Неопределено, СписокВыбораМенеджеров = Неопределено, СписокВыбораПодразделений = Неопределено)

	Перем Парам;
	////
	Отказ = Ложь;
	Если Не уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") Тогда
		Элементы.Менеджер.КнопкаВыбора 		= Ложь;
		Элементы.Подразделение.КнопкаВыбора	= Ложь;
		уб_СС.ПодчиненныеРуководителя(, ?(НовыйПериод = Неопределено, Объект.ЗарплатныйПериод, НовыйПериод), Парам);
		КоличествоВСписке = Парам.ТЗ.Количество();
		Если КоличествоВСписке = 0 Тогда
			Отказ = Истина;
			Элементы.Менеджер.Доступность = Ложь;
			Объект.СписокМенеджеров.Очистить();
			Элементы.Менеджер.КнопкаСпискаВыбора   		= Ложь;
			Элементы.Подразделение.Доступность 			= Ложь;
			Элементы.Подразделение.КнопкаСпискаВыбора	= Ложь;
		Иначе
			Если Парам.ТЗПодразделений.Количество() = 1 Тогда
				Объект.Подразделение = Парам.ТЗПодразделений[0].Значение;
				Элементы.Подразделение.Доступность 			= Ложь;
				Элементы.Подразделение.КнопкаСпискаВыбора 	= Ложь;
			Иначе
				Элементы.Подразделение.Доступность			= Истина;
				Элементы.Подразделение.КнопкаСпискаВыбора	= Истина;
				СписокВыбораПодразделений = Парам.ТЗПодразделений;
				Если Элементы.Подразделение.СписокВыбора.НайтиПоЗначению(Объект.Подразделение) = Неопределено Тогда
					Объект.Подразделение = Неопределено
				КонецЕсли;
			КонецЕсли;
			Если КоличествоВСписке > 1 Тогда
				Элементы.Менеджер.Доступность			= Истина;
				Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
					СЗ = Новый СписокЗначений;
					Для Каждого СтрокаТЗ Из Парам.ТЗ Цикл
						Если СтрокаТЗ.Подразделение = Объект.Подразделение Тогда
							СЗ.Добавить(СтрокаТЗ.Сотрудник);
						КонецЕсли;
					КонецЦикла;
				Иначе
					СЗ = Парам.СписокСотрудников;
				КонецЕсли;
				СписокВыбораМенеджеров = СЗ;
				Объект.СписокМенеджеров = СЗ;
				Элементы.Менеджер.КнопкаСпискаВыбора  	= Истина;
			Иначе
				Объект.Менеджер = Парам.ТЗ[0].Сотрудник;
				Элементы.Менеджер.Доступность = Ложь;
				Объект.СписокМенеджеров.Очистить();
				Элементы.Менеджер.КнопкаСпискаВыбора	= Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			СписокВыбораМенеджеров = Новый СписокЗначений;
			СписокВыбораМенеджеров.ЗагрузитьЗначения(уб_КЭШируемые.СписокСотрудниковПодразделения(Объект.Подразделение, ?(НовыйПериод = Неопределено, Объект.ЗарплатныйПериод, НовыйПериод)));
			Объект.СписокМенеджеров = СписокВыбораМенеджеров.Скопировать();
			Элементы.Менеджер.КнопкаСпискаВыбора = Истина;
		Иначе
			Объект.СписокМенеджеров.Очистить();
			СписокВыбораМенеджеров = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.ЗарплатныйПериод);
		КонецЕсли;
	КонецЕсли;
	Возврат Отказ;

КонецФункции // ПриИзмененииУсловий()

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Функция ПриИзмененииУсловий(СтруктураСписковВыбора = Неопределено) Экспорт
	
	СписокВыбораМенеджеров = Новый СписокЗначений;
	СписокВыбораПодразделений = Новый СписокЗначений;
	Отказ = ПриИзмененииУсловийСервер(, СписокВыбораМенеджеров, СписокВыбораПодразделений);
	Элементы.Менеджер.СписокВыбора.Очистить();
	Элементы.Подразделение.СписокВыбора.Очистить();
	Для Каждого Элемент Из СписокВыбораМенеджеров Цикл
		Элементы.Менеджер.СписокВыбора.Добавить(Элемент.Значение);
	КонецЦикла;
	Для Каждого Элемент Из СписокВыбораПодразделений Цикл
		Элементы.Подразделение.СписокВыбора.Добавить(Элемент.Значение);
	КонецЦикла;
	СтруктураСписковВыбора = Новый Структура;
	СтруктураСписковВыбора.Вставить("Менеджер", 		Элементы.Менеджер.СписокВыбора.Скопировать());
	СтруктураСписковВыбора.Вставить("Подразделение", 	Элементы.Подразделение.СписокВыбора.Скопировать());
	Возврат Отказ;
	
КонецФункции

