Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 
    //SS TODO KV
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	Макет       = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	Запрос.УстановитьПараметр("СК", СК);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтраховойПолис.Ссылка,
	|	СтраховойПолис.Подразделение,
	|	СтраховойПолис.СтраховаяСумма,
	|	СУММА(СтраховойПолисРиски.КВСумма) КАК КВСумма
	|ИЗ
	|	Документ.уб_СтраховойПолис.Риски КАК СтраховойПолисРиски
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК СтраховойПолис
	|		ПО СтраховойПолисРиски.Ссылка = СтраховойПолис.Ссылка
	|ГДЕ
	|	СтраховойПолис.Дата >= &ДатаНач
	|	И СтраховойПолис.Дата <= &ДатаКон
	|	"+?(СК.Пустая(),"","И СтраховойПолис.СК = &СК")+"
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховойПолис.Ссылка,
	|	СтраховойПолис.Подразделение,
	|	СтраховойПолис.СтраховаяСумма";
	
	
	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтНач 	= Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДтКон 	= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК		= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	ДокументРезультат.Вывести(Обл);
	
	РезЗапроса 	= Запрос.Выполнить();
	Выборка 	= РезЗапроса.Выбрать();
	
	ИтСтрСумма = 0;
	ИтСуммаКВ = 0;
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Ном = 	Ном + 1;

		Обл 						= Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном			= Ном;
		Обл.Параметры.Документ		= Выборка.Ссылка;
		Обл.Параметры.Подразделение	= Выборка.Подразделение;
		Обл.Параметры.СтрСумма		= Выборка.СтраховаяСумма;
		Обл.Параметры.СуммаКВ		= Выборка.КВСумма;
		
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		
		ИтСтрСумма = ИтСтрСумма + Выборка.СтраховаяСумма;
		ИтСуммаКВ = ИтСуммаКВ + Выборка.КВСумма;
	КонецЦикла;
	
	Обл 						= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтСтрСумма	= ИтСтрСумма;
	Обл.Параметры.ИтСуммаКВ		= ИтСуммаКВ;
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;

	ДокументРезультат.Показать("Реестр заполненных полисов");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли 
