&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СкрыватьМусор =Истина;
	Если Параметры.Отбор.Свойство("Родитель") Тогда
		Элементы.Список.ТекущийРодитель = Параметры.Отбор.Родитель;
		Параметры.Отбор.Очистить();
	КонецЕсли;	
	СкрытьМусорНасервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекущийЭлементСписка) Тогда
		Элементы.Список.ТекущаяСтрока = ТекущийЭлементСписка;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьМусорПриИзменении(Элемент)
	СкрытьМусорНасервере()
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если уб_ВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрока,"ЭтоГруппа") = Истина Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		ОповеститьОВыборе(ТекущаяСтрока);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура СкрытьМусорНасервере()
	уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", уб_ВызовСервера.КонтрагентыГруппаМусор(), ВидСравненияКомпоновкиДанных.НеВИерархии,,СкрыватьМусор);	
	уб_сс.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", ЛОЖЬ, ВидСравненияКомпоновкиДанных.Равно,,СкрыватьМусор);	
КонецПроцедуры	


