Функция ПолучитьТаблицуТабеля (Ссылка_Месяц) Экспорт
	ЭтоДокумент = ТипЗнч(Ссылка_Месяц)=Тип("ДокументСсылка.уб_ТабельУчетаРабочегоВремени");
	Если ЭтоДокумент Тогда
		ВсегоДней = День(КонецМесяца(Ссылка_Месяц.РасчетныйПериод));
		ТаблицаЗанятости = Ссылка_Месяц.Занятость.Выгрузить();
	Иначе
		ВсегоДней = День(КонецМесяца(Ссылка_Месяц));
		ЗапросЗанятостьТабеля = Новый Запрос("ВЫБРАТЬ
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.Ссылка,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.НомерСтроки,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.Сотрудник,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.Подразделение,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.НомерДня,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.ВидЗанятости,
		                      |	уб_ТабельУчетаРабочегоВремениЗанятость.Часов
		                      |ИЗ
		                      |	Документ.уб_ТабельУчетаРабочегоВремени.Занятость КАК уб_ТабельУчетаРабочегоВремениЗанятость
		                      |ГДЕ
		                      |	НАЧАЛОПЕРИОДА(уб_ТабельУчетаРабочегоВремениЗанятость.Ссылка.Дата, МЕСЯЦ) = &РасчетныйПериод");
		ЗапросЗанятостьТабеля.УстановитьПараметр("РасчетныйПериод",НачалоМесяца(Ссылка_Месяц));					  
		ТаблицаЗанятости = ЗапросЗанятостьТабеля.Выполнить().Выгрузить();
	Конецесли;	
		
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник");
	ТЗ.Колонки.Добавить("Подразделение");
	
	Для счетчик = 1 по ВсегоДней Цикл
		ТЗ.Колонки.Добавить("День"+счетчик);
	КонецЦикла;	
	
	ТЗ.Колонки.Добавить("ВсегоДней");
	//
	ТЗ.Колонки.Добавить("ВсегоЧасов");
	ТекСтрока = Неопределено;
	
	Для каждого Строка Из ТаблицаЗанятости Цикл
		ТекСтрока = ПолучитьСтрокуСотрудника(ТЗ,Строка,ТекСтрока);
		ТекСтрока["День"+Строка.НомерДня]=""+Строка.ВидЗанятости+?(Строка.Часов=0,"",""+Строка.Часов);
	КонецЦикла;	
	
	Для каждого СтрокаТабеля из ТЗ Цикл
		ОбновитьДниЧасыПоСтроке(СтрокаТабеля,Документы.уб_ТабельУчетаРабочегоВремени.ПустаяСсылка(),ВсегоДней);
	КонецЦикла;	
    Возврат ТЗ;
КонецФункции

Функция ПолучитьСтрокуСотрудника(ТЗ,Строка,ТекСтрока) Экспорт
	Если ТекСтрока = Неопределено Тогда
		ТекСтрока = ТЗ.Добавить();		
		ТекСтрока.Сотрудник = Строка.Сотрудник;
		ТекСтрока.Подразделение = Строка.Подразделение;
		Возврат ТекСтрока;
	Иначе
		Если ТекСтрока.Сотрудник = Строка.Сотрудник 
			И ТекСтрока.Подразделение = Строка.Подразделение Тогда
			Возврат ТекСтрока;
		Иначе
			МассивСтрок = ТЗ.НайтиСтроки(Новый Структура("Сотрудник,Подразделение",Строка.Сотрудник,Строка.Подразделение));
			ВсегоСтрок =МассивСтрок.Количество();
			Если ВсегоСтрок = 0 Тогда
				ТекСтрока = ТЗ.Добавить();		
				ТекСтрока.Сотрудник = Строка.Сотрудник;
				ТекСтрока.Подразделение = Строка.Подразделение;
				Возврат ТекСтрока;
			ИначеЕсли ВсегоСтрок = 1 Тогда
				Возврат МассивСтрок[0];
			Иначе
				Сообщить("Количество строк по "+Строка.Сотрудник+"/"+Строка.Подразделение+" больше одной сообщите в отдел разработки");
				Возврат МассивСтрок[0];
			Конецесли;	
		КонецЕсли;	
	Конецесли;	
КонецФункции

Процедура ОбновитьДниЧасыПоСтроке(Строка,Ссылка,ВсегоДнейВмесяце = 0) Экспорт
	
	Если ВсегоДнейВмесяце = 0  Тогда
		ВсегоДнейВМесяце = День(КонецМесяца(Ссылка.РасчетныйПериод));
	КонецЕсли;		
	мВсегоДней  = 0;
	мВсегоЧасов = 0;	
	Для ИндексДня = 1 по ВсегоДнейВМесяце Цикл
		//
		ИмяКолонки = "День"+ИндексДня;
		ЗначениеТекущее = Строка[ИмяКолонки];
		
		Вид   = Лев(ЗначениеТекущее,2);
		
		Попытка
			Подстрока = СокрЛП(Сред(ЗначениеТекущее,3));
			Если Подстрока ="" Тогда
				Часов = 0;
			Иначе
				Часов = Число(Сред(ЗначениеТекущее,3));
			КонецЕсли;
		Исключение
			Часов = 0;
		Конецпопытки;
		Если Часов > 8 Тогда 
			Дней = 1 
		Иначе
			Дней = Окр(Часов/8,2);
		КонецЕсли;	
		мВсегоДней  = мВсегоДней+Дней;
		мВсегоЧасов  = мВсегоЧасов+Часов;
		
	КонецЦикла;	
	Строка.ВсегоДней =Окр (мВсегоДней);
	Строка.ВсегоЧасов = Окр (мВсегоЧасов);
	
КонецПроцедуры
