
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТУ.Ссылка
	|ИЗ
	|	Документ.уб_ТабельУчетаРабочегоВремени КАК ТУ
	|ГДЕ
	|	ТУ.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ТУ.Дата, ДЕНЬ) = &Дата
	|	И ТУ.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Организация",	Организация);					  
	Запрос.УстановитьПараметр("Дата",			НачалоМесяца(Дата));					  
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	    КраткийСоставДокумента = уб_temp.ЗаполнитьКраткийСоставДокумента(Занятость,, "Сотрудник");
	Иначе
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Уже есть документы с таким же расчетным периодом и организацией", "Предупреждение");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры
