Перем СоотвКурсы;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

Процедура ЗаполнитьКурсыВалют()
	СоотвКурсы = Новый Соответствие;
	СтрОтбора = Новый Структура("Валюта",Валюта);
	Дт = НачалоДня(ДатаНач);
	Пока Дт <= НачалоДня(ДатаКон) Цикл
		РезТЗ = РегистрыСведений.КурсыВалют.СрезПоследних(Дт, СтрОтбора);
		Если РезТЗ.Количество()=0 Тогда
			СоотвКурсы.Вставить(Дт,1);
		Иначе
			СоотвКурсы.Вставить(Дт,РезТЗ[0].Курс);
		КонецЕсли;
		Дт = Дт + 60*60*24; // плюс 1 день
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСписокПодразделений()
//SS TODO ранее было подразделение МестоОформления в полисе. А осталось только подразделение
//надо подправить код...
	СписокПодр = Новый СписокЗначений;
	Если ВидОтбора = 1 Тогда
		Если НЕ ЗначениеНеЗаполнено(ТочкаПродаж) Тогда
			СписокПодр.Добавить(ТочкаПродаж);
			Возврат СписокПодр;
		КонецЕсли;
		// если по всем точкам продаж, надо получить все точки продаж
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.УчетБСО";
		
		Результат = Запрос.Выполнить();
		СписокПодр.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Возврат СписокПодр;
	Иначе
		Если НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
			СписокПодр.Добавить(Подразделение);
			Возврат СписокПодр;
		КонецЕсли;
		// если по всем подразделениям, надо получить все подразделения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПодразделенияОрганизаций.Ссылка
		               |ИЗ
		               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		               |ГДЕ
		               |	ПодразделенияОрганизаций.ИспользованиеВМониторинге";
		
		Результат = Запрос.Выполнить();
		СписокПодр.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));
		Возврат СписокПодр;
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьЗапросПоПодразделению(Подр)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ТочкаПродаж", Подр);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	О.СтраховойПолис.Дата КАК ДатаВыдачи,
	               |	О.СтраховойПолис.Номер КАК Номер,
	               |	О.СтраховойПолис.СК КАК СК,
	               |	О.СтраховойПолис.Страхователь КАК Страхователь,
	               |	О.СтраховойПолис.СтраховойПродукт КАК СтраховойПродукт,
	               |	О.СтраховойПолис.ОбъектСтрахования КАК ОбъектСтрахования,
	               |	О.СтраховойПолис.Ответственный КАК Ответственный,
	               |	О.СтраховойПолис.ВидУчетаСтраховки КАК ВидУчетаСтраховки,
	               |	О.СтраховойПолис.ЕстьКредитныйДоговор КАК Кредитный,
	               |	О.СтраховойПолис.ЕстьЛизинговыйДоговор КАК Лизинговый,
	               |	О.СтраховойПолис.Подразделение КАК Подразделение,
	               |	О.СтраховойПолис,
	               |	О.ДатаМониторинга,
	               |	О.Дата КАК ДатаОплаты,
	               |	О.НомерВзноса,
	               |	О.НачисленнаяСуммаВзноса,
	               |	О.КВСумма,
	               |	О.ФормаОплаты,
	               |	О.Комментарий,
	               |	О.Автор
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК О
	               |ГДЕ
				   |	НЕ О.ПометкаУдаления
	               |	И О.ДатаМониторинга >= &ДатаНач
	               |	И О.ДатаМониторинга <= &ДатаКон
	               |	И О.СтраховойПолис.Подразделение = &ТочкаПродаж
	               |	И О.СтраховойПолис.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМониторинга,
	               |	ДатаВыдачи
				   |";
	
	
	РезЗапроса 	= Запрос.Выполнить();
	Возврат РезЗапроса;
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат) Экспорт 
//SS TODO KV
	#Если Клиент Тогда
	Если ДатаНач = '00010101000000' Тогда
		Предупреждение("Необходимо установить начальную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ДатаКон = '00010101000000' Тогда
		Предупреждение("Необходимо установить конечную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Валюта) Тогда
		Предупреждение("Не выбрана валюта.");
		//Предупреждение("Не установлена валюта для мониторинга. Установка валюты в меню 'Настройка учета страхового брокера'");
		Возврат;
	КонецЕсли;
	#КонецЕсли
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	ЗаполнитьКурсыВалют();
	
	Макет       = ПолучитьМакет("Макет");
	
	Обл 		= Макет.ПолучитьОбласть("Шапка");
	
	ВыводитьОбщийИтог = Ложь;
	ПечПодр = "";
	Если ВидОтбора = 1 Тогда
		Если ЗначениеНеЗаполнено(ТочкаПродаж) Тогда
			ПечПодр = "По всем точкам продаж.";
			ВыводитьОбщийИтог = Истина;
		Иначе
			ПечПодр = "По точке продаж: "+ТочкаПродаж;
		КонецЕсли;
	Иначе
		Если ЗначениеНеЗаполнено(Подразделение) Тогда
			ПечПодр = "По всем подразделениям.";
			ВыводитьОбщийИтог = Истина;
		Иначе
			ПечПодр = "По подразделению: "+Подразделение;
		КонецЕсли;
	КонецЕсли;
	Обл.Параметры.ПечОтбор = ПечПодр;
	Обл.Параметры.ДатаНач = Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДатаКон = Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	ДокументРезультат.Вывести(Обл);
	
	ОбщИтНачисленнаяСуммаВзноса = 0;
	ОбщИтКВСумма = 0;
	
	СписокПодр = ПолучитьСписокПодразделений();
	Для Каждого ЭлементСЗ из СписокПодр Цикл
		Подр = ЭлементСЗ.Значение;
		РезЗапроса 	= ВыполнитьЗапросПоПодразделению(Подр);
		
		Если РезЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;
			
		//----------------------------------------------
		// Мониторинг по каждому подразделению из списка
		
		Обл 		= Макет.ПолучитьОбласть("ЗаголовокГруппировки");
		Обл.Параметры.ПечГруппировка = Подр;
		ДокументРезультат.Вывести(Обл);
		
		ИтНачисленнаяСуммаВзноса = 0;
		ИтКВСумма = 0;
		Ном = 0;
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Обл 		= Макет.ПолучитьОбласть("Строка");
			Ном = Ном + 1;
			
			Обл.Параметры.Заполнить(Выборка);
			//Керим
			Обл.Параметры.ПроцентКомиссии=?(Выборка.НачисленнаяСуммаВзноса=0,0,Выборка.КВСумма*100/Выборка.НачисленнаяСуммаВзноса);
			//
			Обл.Параметры.Ном = Ном;
			Обл.Параметры.ЗначРасшифровки = Выборка.СтраховойПолис;
			
			ТекКурс = СоотвКурсы.Получить(Выборка.ДатаМониторинга);
			НачисленнаяСуммаВзноса = Выборка.НачисленнаяСуммаВзноса / ТекКурс;
			КВСумма = Выборка.КВСумма / ТекКурс;
			Обл.Параметры.НачисленнаяСуммаВзноса = НачисленнаяСуммаВзноса;
			Обл.Параметры.КВСумма = КВСумма;
			Обл.Параметры.Валюта = Валюта;
			Обл.Параметры.Пролонгация = ?(Выборка.ВидУчетаСтраховки = Перечисления.уб_ВидыУчетаСтраховок.Пролонгация,"П","");
			Обл.Параметры.Кредитный = ?(Выборка.Кредитный,"К","");
			Обл.Параметры.Лизинговый = ?(Выборка.Лизинговый,"Л","");
			Обл.Параметры.Очередной = ?(Выборка.НомерВзноса > 1,"О","");
			
			ИтНачисленнаяСуммаВзноса = ИтНачисленнаяСуммаВзноса + НачисленнаяСуммаВзноса;
			ИтКВСумма = ИтКВСумма + КВСумма;
			
			ДокументРезультат.Вывести(Обл);
			
		КонецЦикла;
		
		Обл 		= Макет.ПолучитьОбласть("ИтогГруппировки");
		Обл.Параметры.НачисленнаяСуммаВзноса 	= ИтНачисленнаяСуммаВзноса;
		Обл.Параметры.КВСумма = ИтКВСумма;
		ДокументРезультат.Вывести(Обл);
		//----------------------------------------------
		
		ОбщИтНачисленнаяСуммаВзноса = ОбщИтНачисленнаяСуммаВзноса + ИтНачисленнаяСуммаВзноса;
		ОбщИтКВСумма = ОбщИтКВСумма + ИтКВСумма;
		
	КонецЦикла;
	
	Если ВыводитьОбщийИтог Тогда
		Обл 		= Макет.ПолучитьОбласть("ОбщийИтог");
		Обл.Параметры.НачисленнаяСуммаВзноса 	= ОбщИтНачисленнаяСуммаВзноса;
		Обл.Параметры.КВСумма = ОбщИтКВСумма;
		ДокументРезультат.Вывести(Обл);
	КонецЕсли;

	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 5;
	ДокументРезультат.ФиксацияСлева		= 0;

	//ДокументРезультат.Показать("Мониторинг");
	
КонецПроцедуры
