
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ЭтаФорма.ВладелецФормы.Объект,,"ЗП");
	КонецЕсли;
	Если Не (уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")  ) Тогда	
		Элементы.ПересчитыватьСуммыВОплатах.Доступность = Ложь;
		Элементы.СкрыватьКолонкиДСП.Доступность = Ложь;
		//Элементы.ПоказатьТолькоОплатыНеИзЭтогоЗППериода.Доступность = Ложь;
		Элементы.ОтображатьОплатыИсключенныеИзРасчетаЗП.Доступность = Ложь;	
	КонецЕсли;
	ТекПользователь = ПолучитьПараметрСеансаТекущийПользователь();
	ФизЛицоТекущийПользователь = ТекПользователь.ФизЛицо;
	Если уб_КЭШируемые.ДоступностьРоли("уб_МенеджерНаТочке") И НЕ (уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")) Тогда
		Объект.Менеджер = ФизЛицоТекущийПользователь;
		Элементы.Менеджер.Доступность = Ложь;
		Объект.Подразделение = ПолучитьПустоеПодразделение();
		Элементы.Подразделение.Доступность = Ложь;
	ИначеЕсли уб_КЭШируемые.ДоступностьРоли("уб_СтаршийМенеджерНаТочке") И НЕ (уб_КЭШируемые.ДоступностьРоли("ПолныеПрава")) Тогда
		Объект.Подразделение = уб_СС.ПолучитьПодразделениеАгента(ФизЛицоТекущийПользователь);
		Элементы.Подразделение.Доступность = Ложь;
	КонецЕсли;
	УстановитьЗначениеЗППериода();
	//ОбновитьСписокМенеджеров();
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПустоеПодразделение()
	Возврат Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрСеансаТекущийПользователь()
	Структура = Новый Структура;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекПользователь);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.ФизЛицо,
	|	Пользователи.Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Структура.Вставить("ФизЛицо", Выборка.ФизЛицо);
		Структура.Вставить("Представление", Выборка.Представление);
	Иначе
		Структура.Вставить("ФизЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
		Структура.Вставить("Представление", "");
	КонецЕсли;
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеЗППериода(ЗначениеЗпПериода = Неопределено) Экспорт
	
	Если ЗначениеЗпПериода = Неопределено Тогда
		ЗначениеЗпПериода = ДайЗарплатныйПериод();
	КонецЕсли;
	Объект.ЗарплатныйПериод = ЗначениеЗпПериода;
	УстановитьОтображениеМесячногоПериода("рПериодЗП",Объект.ЗарплатныйПериод);
	
КонецПроцедуры

&НаКлиенте
Функция ДайЗарплатныйПериод()
	Возврат НачалоМесяца(Объект.ЗарплатныйПериод);	
КонецФункции

&НаКлиенте
Процедура УстановитьОтображениеМесячногоПериода(Элемент,Реквизит)
	
	мФорматМесячногоПериода = "ДФ='ММММ гггг'";
	ЭтаФорма[Элемент] = Формат(Реквизит, мФорматМесячногоПериода);
	Если Реквизит = НачалоДня(КонецМесяца(ТекущаяДата())) Тогда
		Элементы[Элемент].ЦветТекста = Новый Цвет(164, 40, 190);	
	ИначеЕсли Реквизит > НачалоДня(КонецМесяца(ТекущаяДата())) Тогда
		Элементы[Элемент].ЦветТекста = ПолучитьЦветСтиля("ЦветОтрицательногоЧисла");
	Иначе
		Элементы[Элемент].ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветСтиля(Цвет)
	Возврат ЦветаСтиля[Цвет];
КонецФункции

//&НаКлиенте
//Процедура ОбновитьСписокМенеджеров()
//	
//	//СписокВыбора = уб_СС.ПолучитьСписокСотрудниковАктуальныхВМесяце(Объект.ЗарплатныйПериод);
//	//Для Каждого Элемент Из СписокВыбора Цикл
//	//	Элементы.Менеджер.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
//	//КонецЦикла;
//	
//	СписокВыбора = ПолучитьСписокАгентов(Объект.ЗарплатныйПериод);
//	Элементы.Менеджер.СписокВыбора.Очистить();
//	Для Каждого ЭлементСписка Из СписокВыбора Цикл
//		Элементы.Менеджер.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
//	КонецЦикла;
//	
//КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокАгентов(ЗарплатныйПериод)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уб_ОплатаПолисов.Агент,
	|	уб_ОплатаПолисов.Агент.Наименование КАК Наименование
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	уб_ОплатаПолисов.ЗарплатныйПериод = &ЗарплатныйПериод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	Запрос.УстановитьПараметр("ЗарплатныйПериод",НачалоДня(КонецМесяца(ЗарплатныйПериод)));
	Выборка = Запрос.Выполнить().Выбрать();
	Список = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Агент, Выборка.Наименование);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура рПериодЗПНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Объект.ЗарплатныйПериод, ЭтаФорма);
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУсловий()

	Структура = Неопределено;
	ВладелецФормы.ПриИзмененииУсловий(Структура);
	Элементы.Менеджер.СписокВыбора.Очистить();
	Элементы.Подразделение.СписокВыбора.Очистить();
	Для Каждого Элемент Из Структура.Менеджер Цикл
		Элементы.Менеджер.СписокВыбора.Добавить(Элемент.Значение);
	КонецЦикла;
	Для Каждого Элемент Из Структура.Подразделение Цикл
		Элементы.Подразделение.СписокВыбора.Добавить(Элемент.Значение);
	КонецЦикла;
	Если Элементы.Менеджер.СписокВыбора.Количество() > 1 Тогда
		Элементы.Менеджер.Доступность			= Истина;
		Элементы.Менеджер.КнопкаСпискаВыбора  	= Истина;
	Иначе
		Элементы.Менеджер.Доступность			= Ложь;
		Элементы.Менеджер.КнопкаСпискаВыбора	= Ложь;
	КонецЕсли;
	Если Элементы.Подразделение.СписокВыбора.Количество() < 2 Тогда
		Элементы.Подразделение.Доступность 			= Ложь;
		Элементы.Подразделение.КнопкаСпискаВыбора 	= Ложь;
	Иначе
		Элементы.Подразделение.Доступность			= Истина;
		Элементы.Подразделение.КнопкаСпискаВыбора	= Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, НачальноеЗначение = Неопределено);
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Формат(НачалоМесяцаЗаполнения, "ДФ='MMMM yyyy'"));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли;
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, ВыбранныйЭлемент.Значение);
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = ВыбранныйЭлемент.Значение;
	ЭтаФорма[Элемент.Имя] = Формат(ПериодРегистрации, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаКлиенте
Процедура рПериодЗПРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ЗарплатныйПериод) Тогда
		УстановитьЗначениеЗППериода();
		Возврат;
	Иначе	
	    Если Направление = 1 Тогда // увеличиваем значение
			Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(КонецМесяца(Объект.ЗарплатныйПериод) + 1));
		Иначе // = -1 - уменьшаем значение
			Объект.ЗарплатныйПериод = НачалоДня(КонецМесяца(НачалоМесяца(Объект.ЗарплатныйПериод) - 1));
		КонецЕсли;
		УстановитьЗначениеЗППериода(Объект.ЗарплатныйПериод);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	ПриИзмененииУсловий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ВладелецФормы.Объект, Объект,,"ЗП");
	КонецЕсли;
КонецПроцедуры
