                     
Функция DDПолучитьСтруктуруОбъекта(ОбъектИстории, ДатаВерсииИсторииОбъекта = Неопределено) Экспорт
	
	СтруктураОбъектаИстории = Новый Структура();
	//Если дата пустая получаем структуру текущего документа
	Если ЗначениеЗаполнено(ДатаВерсииИсторииОбъекта) Тогда
		DDПолучитьДанныеОбъектаИзИстории(ОбъектИстории, ДатаВерсииИсторииОбъекта, СтруктураОбъектаИстории);
	Иначе
		DDПолучитьТекущиеДанныеОбъекта(ОбъектИстории, СтруктураОбъектаИстории);
	КонецЕсли;
	Возврат СтруктураОбъектаИстории;
	
КонецФункции

//TO DD Выбирать только реквизиты у которых стоит флаг фиксировать? сейчас делает срез последних из уб_ИсторияРевизита
Функция DDПолучитьДанныеОбъектаИзИстории(ОбъектИстории, ДатаВерсииИсторииОбъекта, СтруктураОбъектаИстории) Экспорт
	
	СтруктураОбъектаИстории.Вставить("ДатаВерсииСтруктуры",ДатаВерсииИсторииОбъекта);
	ЭтоОтчетПоставщику = ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	//Получаем значение реквизитов объекта из регистра ИсторияРеквизитов
	//ТаблицаЗначенийРеквизитов = РегистрыСведений.уб_ИсторияРеквизит.СрезПоследних(ДатаВерсииИсторииОбъекта,  Новый Структура("ОбъектИстории", ОбъектИстории));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уб_ИсторияРеквизитСрезПоследних.Период,
	|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории,
	|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
	|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&ДатаВерсииИсторииОбъекта, ОбъектИстории = &ОбъектИстории И НЕ РеквизитОбъекта = ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК уб_ИсторияРеквизитСрезПоследних";
	Запрос.УстановитьПараметр("ДатаВерсииИсторииОбъекта", ДатаВерсииИсторииОбъекта);
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);
	//ТаблицаЗначенийРеквизитов = Запрос.Выполнить().Выгрузить();
	Если ЭтоОтчетПоставщику Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК ОплатаПолиса
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&ДатаВерсииИсторииОбъекта, РеквизитОбъекта.Наименование = ""ОтчетПоставщику"") КАК уб_ИсторияРеквизитСрезПоследних
		|ГДЕ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита = &ОбъектИстории";
	КонецЕсли;	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Выборка = РезультатПакета[0].Выбрать();
	//Заполняем структуру данными из регистра уб_ИсторияРеквизит
	Пока Выборка.Следующий() Цикл
		СтруктураОбъектаИстории.Вставить(Выборка.НаименованиеРеквизита, Выборка.ЗначениеРеквизита);
	КонецЦикла;
	//Если это отчет поставщику, получаем данные всех оплат и вставляем в 
	Если ЭтоОтчетПоставщику Тогда
		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
		//Получаем список оплат из регистра уб_ИсторияРеквизит, на момент истории входящих в Отчет Поставщику
		//СписокОплат = Запрос.Выполнить().Выгрузить();
		Оплата = РезультатПакета[1].Выбрать();
		//Для каждой оплаты получаем структуру ее значений и добавляем в таблицу подчиненных документов
		Пока Оплата.Следующий() Цикл
			СтруктураОплаты = Новый Структура();
			DDПолучитьДанныеОбъектаИзИстории(Оплата.ОплатаПолиса, ДатаВерсииИсторииОбъекта, СтруктураОплаты);
			НовСтр = ТаблицаПодчиненныхДокументов.Добавить();
			НовСтр.ПодчиненныйДокументСсылка	= Оплата.ОплатаПолиса;
			НовСтр.ПодчиненныйДокументСтруктура	= СтруктураОплаты;
		КонецЦикла;
		//Вставляем таблицу подчиненных документов в структуру Отчета поставщику
		СтруктураОбъектаИстории.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
	КонецЕсли;
	
КонецФункции

Функция DDПолучитьТекущиеДанныеОбъекта(ОбъектИстории, СтруктураОбъектаИстории)
	
	СтруктураОбъектаИстории.Вставить("ДатаВерсииСтруктуры", Дата(1,1,1));
	//Получим список реквизитов объекта, по которым ведется история
	ЭтоОтчетПоставщику = ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	ИмяМета = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектИстории)).Имя;
	ИменаРеквизитов = ИменаРеквизитов(ИмяМета);
	Запрос = Новый Запрос("ВЫБРАТЬ "+ИменаРеквизитов+" ИЗ Документ." + ИмяМета + " КАК Документ ГДЕ	Документ.Ссылка = &Ссылка
	|
	|;
	|///////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование Как НаименованиеРеквизита 
	|ИЗ
	|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
	|ГДЕ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
	|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код");
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектИстории);
	Если ЭтоОтчетПоставщику Тогда
		ИменаРеквизитов = ИменаРеквизитов("уб_ОплатаПолисов");
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ "+ИменаРеквизитов+" ИЗ Документ.уб_ОплатаПолисов КАК Документ ГДЕ Документ.ОтчетПоставщику = &Ссылка
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование Как НаименованиеРеквизита 
		|ИЗ
		|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
		|ГДЕ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
		|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &КодОплатаПолисов";
		Запрос.УстановитьПараметр("КодОплатаПолисов","уб_ОплатаПолисов");//Метаданные.Документы.уб_ОплатаПолисов.Имя
		Запрос.УстановитьПараметр("Код", "уб_ОтчетПоставщику");
	Иначе
		Запрос.УстановитьПараметр("Код", ОбъектИстории.Метаданные().Имя);
	КонецЕсли;
	РезультатПакета = Запрос.ВыполнитьПакет();
	Выборка = РезультатПакета[0].Выбрать();
	Выборка.Следующий();
	ВыборкаРеквизитов = РезультатПакета[1].Выбрать();
	//Получаем значение реквизитов объекта из текущего объекта
	Пока ВыборкаРеквизитов.Следующий() Цикл
		ЗначениеРевизита = Выборка[ВыборкаРеквизитов.НаименованиеРеквизита];
		СтруктураОбъектаИстории.Вставить(ВыборкаРеквизитов.НаименованиеРеквизита, ЗначениеРевизита);
	КонецЦикла;
	//Если это отчет поставщику, получаем данные всех оплат и вставляем в
	Если ЭтоОтчетПоставщику Тогда
		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
		Оплата = РезультатПакета[2].Выбрать();
		ВыборкаРеквизитов = РезультатПакета[3].Выбрать();
		Пока Оплата.Следующий() Цикл
			СтруктураОплаты = Новый Структура();
			ВыборкаРеквизитов.Сбросить();
			Пока ВыборкаРеквизитов.Следующий() Цикл
				ЗначениеРевизита = Оплата[ВыборкаРеквизитов.НаименованиеРеквизита];
				СтруктураОплаты.Вставить(ВыборкаРеквизитов.НаименованиеРеквизита, ЗначениеРевизита);
			КонецЦикла;
			НовСтр = ТаблицаПодчиненныхДокументов.Добавить();
			НовСтр.ПодчиненныйДокументСсылка	= Оплата.Ссылка;
			НовСтр.ПодчиненныйДокументСтруктура	= СтруктураОплаты;
		КонецЦикла;
		//Вставляем таблицу подчиненных документов в структуру Отчета поставщику
		СтруктураОбъектаИстории.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
	КонецЕсли;

КонецФункции

Функция DDПолучитьТаблицуРазличий(ОбъектИстории, ЛеваяСторона, ПраваяСторона, СписокРеквизитовОбъекта = Неопределено, ТолькоРазличающиесяЗначения = Истина) Экспорт
	
	СтруктураИзменений = Новый Соответствие();	
	//Если переданы не структуры, возвращаем пустую структуру
	//Если ТипЗнч(ЛеваяСторона) <> Тип("Структура") Или ТипЗнч(ПраваяСторона) <> Тип("Структура") ИЛИ НЕ ЗначениеЗаполнено(ОбъектИстории) Или Не ЗначениеЗаполнено(ПраваяСторона) Или Не ЗначениеЗаполнено(ЛеваяСторона) Тогда
	//	Сообщить("Переданы некорректные параметры!!!");
	//	Возврат СтруктураИзменений;
	//КонецЕсли;
	ЭтоОтчетПоставщику = ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику");
	КоличествоВСтруктуре = ?(ЭтоОтчетПоставщику, 2, 1);
	//Если Не ЗначениеЗаполнено(СписокРеквизитовОбъекта) Тогда
	Если СписокРеквизитовОбъекта = Неопределено Тогда
		СписокРеквизитовОбъекта = ПолучитьСписокРеквизитов(ОбъектИстории);
	КонецЕсли;
	//Перебор реквизитов объекта истории
	ЛеваяСторонаЗаполнена 	= ЛеваяСторона <> Неопределено И ЛеваяСторона.Количество() > КоличествоВСтруктуре;
	ПраваяСторонаЗаполнена  = ПраваяСторона <> Неопределено И ПраваяСторона.Количество() > КоличествоВСтруктуре;
	Для Каждого Реквизит Из СписокРеквизитовОбъекта.Реквизиты Цикл
		НаименованиеРеквизита = Реквизит.НаименованиеРеквизита;
		//Если левая сторона незаполнена - истории не было
		Если ЛеваяСторонаЗаполнена Тогда
			//Если ЛеваяСторона.Свойство(НаименованиеРеквизита) Тогда
			//	ЛевоеЗначение = ЛеваяСторона[НаименованиеРеквизита];
			//Иначе
			//	//левого значения с этим реквизитом не было, поэтому заполним его пустым значениям по описанию типов метаданных
			//	//ОписаниеТиповТипы = ОбъектИстории.Метаданные().Реквизиты[НаименованиеРеквизита].Тип.Типы();
			//	//Если ОписаниеТиповТипы.Количество() > 1 Тогда
			//	//	//составной тип
			//	//	ЛеваяСторона = Неопределено;
			//	//Иначе
			//	//	ЛеваяСторона = ОбщегоНазначения.ПустоеЗначениеТипа(ОписаниеТиповТипы[0]);
			//	//КонецЕсли;
			//	ЛевоеЗначение = "<Пустое значение>";
			//КонецЕсли;
			ЛевоеЗначение = Неопределено;
			Если Не ЛеваяСторона.Свойство(НаименованиеРеквизита, ЛевоеЗначение) Тогда
				ЛевоеЗначение = "<Пустое значение>";
			КонецЕсли;
		КонецЕсли;
		//Если левая сторона незаполнена - истории не было
		Если ПраваяСторонаЗаполнена Тогда
			//Если ПраваяСторона.Свойство(НаименованиеРеквизита) Тогда
			//	ПравоеЗначение = ПраваяСторона[НаименованиеРеквизита];
			//Иначе
			//	ПравоеЗначение = "<Пустое значение>";
			//КонецЕсли;
			
			ПравоеЗначение = Неопределено;
			Если Не ПраваяСторона.Свойство(НаименованиеРеквизита, ПравоеЗначение) Тогда
				ПравоеЗначение = "<Пустое значение>";
			КонецЕсли;
		КонецЕсли;
		Если ТолькоРазличающиесяЗначения = Ложь Или ЛевоеЗначение <> ПравоеЗначение Тогда
			//СтруктураЗначенияРеквизиты = Новый Структура("ЛевоеЗначение, ПравоеЗначение", ЛевоеЗначение, ПравоеЗначение);
			//СтруктураИзменений.Вставить(Реквизит, СтруктураЗначенияРеквизиты);
			СтруктураИзменений.Вставить(Реквизит, Новый Структура("ЛевоеЗначение, ПравоеЗначение", ЛевоеЗначение, ПравоеЗначение));
		КонецЕсли;
	КонецЦикла;
	Если ЭтоОтчетПоставщику Тогда
		СписокРеквизитовОбъектаОплаты = ПолучитьСписокРеквизитов(Документы.уб_ОплатаПолисов.ПустаяСсылка());
		ЛеваяТаблицаДокументов	= ЛеваяСторона["ПодчиненныеДокументы"];
		ПраваяТаблицаДокументов	= ПраваяСторона["ПодчиненныеДокументы"];
		//Перебираем правую таблицу
		Для Каждого ПраваяСтрока Из ПраваяТаблицаДокументов Цикл
			НайденнаяСтрокаСлева = ЛеваяТаблицаДокументов.Найти(ПраваяСтрока.ПодчиненныйДокументСсылка, "ПодчиненныйДокументСсылка");
			СтруктураСправа = ПраваяСтрока.ПодчиненныйДокументСтруктура;
			Если НайденнаяСтрокаСлева = Неопределено Тогда
				//Получаем данные оплаты из истории
				//СтруктураСлева = Новый Структура();
				//DDПолучитьДанныеОбъектаИзИстории(ПраваяСтрока.ПодчиненныйДокументСсылка, ЛеваяСторона.ДатаВерсииСтруктуры, СтруктураСлева);
				
				СтруктураСлева		  = Новый Структура;
				СписокРеквизитов	  = Новый Структура;
				СтруктураПараметров   = Новый Структура;
				СтруктураПараметров.Вставить("Объект", ПраваяСтрока.ПодчиненныйДокументСсылка);
				СтруктураПараметров.Вставить("ДатаПредВерсии", ЛеваяСторона.ДатаВерсииСтруктуры);
				СтруктураПараметров.Вставить("ДатаВерсии", Неопределено);
				СтруктураПараметров.Вставить("ВключитьПодчиненныеДокументы",Истина);
				уб_ИсторияИзмененияОбъектов.ЗаполнитьСтруктурыДляСравнения(СтруктураПараметров, СтруктураСлева, Неопределено, СписокРеквизитов);
				
			Иначе
				СтруктураСлева = НайденнаяСтрокаСлева.ПодчиненныйДокументСтруктура;
			КонецЕсли;
			РазличияОплаты = DDПолучитьТаблицуРазличий(ПраваяСтрока.ПодчиненныйДокументСсылка, СтруктураСлева, СтруктураСправа, СписокРеквизитовОбъектаОплаты);
			Если РазличияОплаты.Количество() > 0 Тогда
				Если СтруктураИзменений["ПодчиненныеДокументы"] = Неопределено Тогда
					ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
					ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
					ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументДействие");
					ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
					ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументРазличия");
					СтруктураИзменений.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
				КонецЕсли;
				НовСтр = ТаблицаПодчиненныхДокументов.Добавить();
				НовСтр.ПодчиненныйДокументСсылка = ПраваяСтрока.ПодчиненныйДокументСсылка;
				Если НайденнаяСтрокаСлева = Неопределено Тогда
					НовСтр.ПодчиненныйДокументДействие = "Добавлена";
				Иначе
					НовСтр.ПодчиненныйДокументДействие = "Изменена";
				КонецЕсли;
				НовСтр.ПодчиненныйДокументРазличия 	= РазличияОплаты;
				НовСтр.ПодчиненныйДокументСтруктура = СтруктураСлева;
			КонецЕсли;
		КонецЦикла;
		//Перебираем левую таблицу
		Для Каждого ЛеваяСтрока Из ЛеваяТаблицаДокументов Цикл
			НайденнаяСтрокаСправа = ПраваяТаблицаДокументов.Найти(ЛеваяСтрока.ПодчиненныйДокументСсылка, "ПодчиненныйДокументСсылка");
			Если НайденнаяСтрокаСправа = Неопределено Тогда
				СтруктураСлева = ЛеваяСтрока.ПодчиненныйДокументСтруктура;
				//Получаем данные оплаты из истории
				//СтруктураСправа = Новый Структура();
				//DDПолучитьДанныеОбъектаИзИстории(ЛеваяСтрока.ПодчиненныйДокументСсылка, ПраваяСторона.ДатаВерсииСтруктуры, СтруктураСправа);
				
				СтруктураСправа		  = Новый Структура;
				СписокРеквизитов	  = Новый Структура;
				СтруктураПараметров   = Новый Структура;
				СтруктураПараметров.Вставить("Объект", ЛеваяСтрока.ПодчиненныйДокументСсылка);
				СтруктураПараметров.Вставить("ДатаПредВерсии", ПраваяСторона.ДатаВерсииСтруктуры);
				СтруктураПараметров.Вставить("ДатаВерсии", Неопределено);
				СтруктураПараметров.Вставить("ВключитьПодчиненныеДокументы",Истина);
				уб_ИсторияИзмененияОбъектов.ЗаполнитьСтруктурыДляСравнения(СтруктураПараметров, СтруктураСправа, Неопределено, СписокРеквизитов);				
				
				РазличияОплаты = DDПолучитьТаблицуРазличий(ЛеваяСтрока.ПодчиненныйДокументСсылка, СтруктураСлева, СтруктураСправа, СписокРеквизитовОбъектаОплаты);
				Если РазличияОплаты.Количество() > 0 Тогда
					Если СтруктураИзменений["ПодчиненныеДокументы"] = Неопределено Тогда
						ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
						ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
						ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументДействие");
						ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
						ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументРазличия");
						СтруктураИзменений.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
					КонецЕсли;
					//TODO зачем??
					НовСтр = ТаблицаПодчиненныхДокументов.Добавить();
					НовСтр.ПодчиненныйДокументСсылка	= ЛеваяСтрока.ПодчиненныйДокументСсылка;
					НовСтр.ПодчиненныйДокументДействие	= "Удалена";
					НовСтр.ПодчиненныйДокументРазличия	= РазличияОплаты;
					НовСтр.ПодчиненныйДокументСтруктура	= СтруктураСправа;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СтруктураИзменений;
	
КонецФункции

//Проверяем менялись ли реквизиты которые фиксируются историей,
//Если да пишем новую версию ИсторииОбъекта и пишем новые значения реквизитов
Функция ЗаписатьНовуюВерсиюИсторииОбъекта(ОбъектИстории, Комментарий = "", ТихийРежим = Ложь, Актуальна = Ложь, ВозвращатьТекущееСостояние = Истина) Экспорт 
	////Исправление. получение истории из одной функции.
	
	//Запрос = уб_ИсторияИзмененияОбъектов.ПолучитьЗапросСравненияВерсийОбъекта(ОбъектИстории, , , , , Истина, Истина);
	//ТаблицаЗначений = Новый ТаблицаЗначений;
	//ТаблицаЗначений.Колонки.Добавить("СсылкаРеквизита");
	//ТаблицаЗначений.Колонки.Добавить("ЛевоеЗначение");
	//ТаблицаЗначений.Колонки.Добавить("ПравоеЗначение");
	//Пакет = Запрос.ВыполнитьПакет();
	//ВыборкаСравнения = Пакет[3].Выбрать();
	//Пока ВыборкаСравнения.Следующий() Цикл
	//	НоваяСтрока = ТаблицаЗначений.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСравнения);
	//КонецЦикла;
		
	ДатаПоследнейВерсии = ПолучитьДатуПоследнейВерсии(ОбъектИстории);
	//Если ДатаПоследнейВерсии = Дата(1,1,1) Тогда //Истории еще нет
	//	СтруктураПоследнейВерсии = Новый Структура();
	//	СтруктураПоследнейВерсии.Вставить("ДатаВерсииСтруктуры",Дата(1,1,1));
	//	Если ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
	//		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
	//		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
	//		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
	//		СтруктураПоследнейВерсии.Вставить("ПодчиненныеДокументы",ТаблицаПодчиненныхДокументов);
	//	КонецЕсли;
	//Иначе
	//	СтруктураПоследнейВерсии = DDПолучитьСтруктуруОбъекта(ОбъектИстории, ДатаПоследнейВерсии);
	//КонецЕсли;
	//СтруктураТекущейВерсии = DDПолучитьСтруктуруОбъекта(ОбъектИстории);
	
	СтруктураПоследнейВерсии = Новый Структура;
	СтруктураТекущейВерсии	 = Новый Структура;
	СписокРеквизитов	  	 = Новый Структура;
	Параметры = Новый Структура;
	Параметры.Вставить("Объект",						ОбъектИстории);
	Параметры.Вставить("ДатаПредВерсии",				ДатаПоследнейВерсии);
	Параметры.Вставить("ДатаВерсии",					Неопределено);
	Параметры.Вставить("ВключитьПодчиненныеДокументы",	Истина);
	уб_ИсторияИзмененияОбъектов.ЗаполнитьСтруктурыДляСравнения(Параметры, СтруктураПоследнейВерсии, СтруктураТекущейВерсии, СписокРеквизитов);
	СтруктураРазличий = уб_ИсторияИзмененияОбъектов.DDПолучитьТаблицуРазличий(ОбъектИстории, СтруктураПоследнейВерсии, СтруктураТекущейВерсии, СписокРеквизитов);
	//отладка
	//ТЗ = СтруктураРазличий.Получить("ПодчиненныеДокументы");
	//Для Каждого СтрокаТЗ Из ТЗ Цикл
	//	Для Каждого СтрокаСоот Из СтрокаТЗ.ПодчиненныйДокументРазличия Цикл
	//		аа = 12
	//	КонецЦикла;
	//КонецЦикла;
	//отладка
	Если СтруктураРазличий.Количество() > 0 Тогда
		Добавить = Ложь;
		Если Не ТихийРежим Тогда
			#Если Клиент Тогда
				Ответ = Вопрос("Добавить новую версию сейчас (новый регламент)?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Последняя версия истории отличается от текущей версии докумета");
				Добавить = Ответ = КодВозвратаДиалога.Да;
			#КонецЕсли
		КонецЕсли;
		Если Добавить = Истина ИЛИ ТихийРежим Тогда
			НоваяВерсияОбъекта = ЗаписатьВерсиюИсторииВРегистр(ОбъектИстории, СтруктураРазличий, Комментарий, Актуальна,ДатаПоследнейВерсии);
			//НоваяВерсияОбъекта = ЗаписатьВерсиюИсторииВРегистр(ОбъектИстории, ТаблицаЗначений, Комментарий, Актуальна);
			Если Не ТихийРежим Тогда
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Добавлена новая версия истории объекта: " + ОбъектИстории + " версия №" + НоваяВерсияОбъекта.НомерВерсии + " от " + НоваяВерсияОбъекта.Период);
			КонецЕсли;
		КонецЕсли;
		Возврат НоваяВерсияОбъекта;
	Иначе
		Если ВозвращатьТекущееСостояние = Истина Тогда
			СрезПоследних = РегистрыСведений.уб_ИсторияОбъект.СрезПоследних(, Новый Структура("ОбъектИстории", ОбъектИстории));
			Если СрезПоследних.Количество() > 0 Тогда
				Возврат СрезПоследних[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецФункции

//Функция получает список реквизитов по которым необходимо хранить историю
Функция ПолучитьСписокРеквизитов(ОбъектИстории) Экспорт

	СтруктураРеквизитов	= Новый Структура();
	СписокРеквизитов	= Новый СписокЗначений;
	
	//НайденныйДокумент = Справочники.уб_СписокОбъектовИстории.НайтиПоКоду(ОбъектИстории.Метаданные().Имя);
	//Если НЕ ЗначениеЗаполнено(НайденныйДокумент) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//СписокРеквизитов = НайденныйДокумент.СписокРеквизитов.Выгрузить(Новый Структура("ФиксироватьИзменения", Истина)).ВыгрузитьКолонку("НаименованиеРеквизита");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Синоним КАК СинонимРеквизита,
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта КАК Реквизит
	|ИЗ
	|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
	|ГДЕ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
	|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код";
	Запрос.УстановитьПараметр("Код",ОбъектИстории.Метаданные().Имя);
	ТабЗнач = Запрос.Выполнить().Выгрузить();
	//СписокРеквизитов = ТабЗнач.ВыгрузитьКолонку("НаименованиеРеквизита");
	//TO DD Неактуально
	//СписокРеквизитовТЧ = НайденныйДокумент.СписокРеквизитовТЧ.Выгрузить(Новый Структура("ФиксироватьИзменения", Истина));
	//СтруктураРеквизитов.Вставить("РеквизитыТЧ", СписокРеквизитовТЧ);
	СтруктураРеквизитов.Вставить("Реквизиты", ТабЗнач);
	Возврат СтруктураРеквизитов;
	
КонецФункции

Функция УстановитьВерсиюАктуальной(ОбъектИстории, ДатаВерсии) Экспорт
	
	НЗ = РегистрыСведений.уб_ИсторияОбъект.СоздатьНаборЗаписей();
	НЗ.Отбор.ОбъектИстории.Установить(ОбъектИстории);
	НЗ.Прочитать();	
	Для Каждого СтрокаНЗ Из НЗ Цикл
		Если  ДатаВерсии = СтрокаНЗ.Период Тогда
			СтрокаНЗ.ВерсияАктуальна = Истина;
		Иначе
			СтрокаНЗ.ВерсияАктуальна = Ложь;
		КонецЕсли;
	КонецЦикла;	
	НЗ.Записать();
	
КонецФункции

Функция ТекущаяВерсияДокументаАктуальна(ОбъектИстории) Экспорт
	
	ПоследняяВерсия = РегистрыСведений.уб_ИсторияОбъект.ПолучитьПоследнее(, Новый Структура("ОбъектИстории", ОбъектИстории));	
	Если Не ПоследняяВерсия.ВерсияАктуальна Тогда		
		Возврат Ложь;
	Иначе
		ДатаАктуальнойВерсии = ПолучитьДатуАктуальнойВерсии(ОбъектИстории);
		//СтруктураАктуальнойВерсии	= DDПолучитьСтруктуруОбъекта(ОбъектИстории, ДатаАктуальнойВерсии);
		//СтруктураТекущейВерсии		= DDПолучитьСтруктуруОбъекта(ОбъектИстории);
		СписокРеквизитов 		  = Новый Структура;		
		СтруктураТекущейВерсии 	  = Новый Структура;
		СтруктураАктуальнойВерсии = Новый Структура;
		СтруктураПараметров 	  = Новый Структура;
		СтруктураПараметров.Вставить("Объект", ОбъектИстории);
		СтруктураПараметров.Вставить("ДатаПредВерсии", ДатаАктуальнойВерсии);
		СтруктураПараметров.Вставить("ДатаВерсии", Неопределено);
		СтруктураПараметров.Вставить("ВключитьПодчиненныеДокументы", Истина);
		уб_ИсторияИзмененияОбъектов.ЗаполнитьСтруктурыДляСравнения(СтруктураПараметров, СтруктураАктуальнойВерсии, СтруктураТекущейВерсии, СписокРеквизитов);
		СтруктураРазличий 		  = уб_ИсторияИзмененияОбъектов.DDПолучитьТаблицуРазличий(ОбъектИстории, СтруктураАктуальнойВерсии, СтруктураТекущейВерсии, СписокРеквизитов);
		//аа = СтруктураРазличий.Получить("ПодчиненныеДокументы");//???
		Если СтруктураРазличий.Количество() > 0 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//Формируем список версий истории объекта
Функция ПолучитьВерсииИсторииОбъекта(ОбъектИстории) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ИсторияОбъект.Период КАК ДатаВерсии,
	|	уб_ИсторияОбъект.НомерВерсии КАК НомерВерсии,
	|	уб_ИсторияОбъект.ВерсияАктуальна КАК АктуальностьВерсии,
	|	уб_ПередачаОтчетаПоставщикуВБухгалтерию.ДатаПередачи КАК ПереданВБухгалтерию,
	|	уб_ИсторияОбъект.Комментарий,
	|	уб_ИсторияОбъект.НезначительныеИзменения,
	|	уб_ИсторияОбъект.Пользователь КАК Автор,
	|	уб_ПринятыеКОплатеОтчетыПоставщику.ДатаПринятия КАК ПринятВБухгалтерии,
	|	уб_ПринятыеКОплатеОтчетыПоставщику.Пользователь КАК ПринялПользователь
	|ИЗ
	|	РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ПередачаОтчетаПоставщикуВБухгалтерию КАК уб_ПередачаОтчетаПоставщикуВБухгалтерию
	|		ПО уб_ИсторияОбъект.ОбъектИстории = уб_ПередачаОтчетаПоставщикуВБухгалтерию.ОтчетПоставщику
	|			И уб_ИсторияОбъект.Период = уб_ПередачаОтчетаПоставщикуВБухгалтерию.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ПринятыеКОплатеОтчетыПоставщику КАК уб_ПринятыеКОплатеОтчетыПоставщику
	|		ПО уб_ИсторияОбъект.ОбъектИстории = уб_ПринятыеКОплатеОтчетыПоставщику.ОтчетПоставщику
	|			И уб_ИсторияОбъект.Период = уб_ПринятыеКОплатеОтчетыПоставщику.Период
	|ГДЕ
	|	уб_ИсторияОбъект.ОбъектИстории = &ОбъектИстории");	
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);	
	СписокВерсий = Запрос.Выполнить().Выгрузить();	
	СписокВерсий.Колонки.Добавить("ИтогОС_НачисленнаяСуммаВзноса");
	СписокВерсий.Колонки.Добавить("ИтогОС_КВ");
	СписокВерсий.Колонки.Добавить("КоличествоСтрокОплат");	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ИтогОС_НачисленнаяСуммаВзноса");
	МассивРеквизитов.Добавить("ИтогОС_КВ");
	МассивРеквизитов.Добавить("КоличествоСтрокОплат");	
	Для Каждого Строка Из СписокВерсий Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование Как НаименованиеРеквизита
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&Дата,
		|			ОбъектИстории = &ОбъектИстории
		|				И РеквизитОбъекта.Наименование В (&МассивРеквизитов)) КАК уб_ИсторияРеквизитСрезПоследних";
		Запрос.УстановитьПараметр("ОбъектИстории",ОбъектИстории);
		Запрос.УстановитьПараметр("МассивРеквизитов",МассивРеквизитов);	
		Запрос.УстановитьПараметр("Дата",Строка.ДатаВерсии);	
		Выборка = Запрос.Выполнить().Выбрать();                                     
		Пока Выборка.Следующий() Цикл
			Строка[Выборка.НаименованиеРеквизита] = Выборка.ЗначениеРеквизита;
		КонецЦикла;		
		//Строка.ИтогОС_НачисленнаяСуммаВзноса = РегистрыСведений.уб_ИсторияРеквизит.ПолучитьПоследнее(Строка.ДатаВерсии, Новый Структура("ОбъектИстории, НаименованиеРеквизита", ОбъектИстории, "ИтогОС_НачисленнаяСуммаВзноса")).ЗначениеРеквизита;
		//Строка.ИтогОС_КВ					 = РегистрыСведений.уб_ИсторияРеквизит.ПолучитьПоследнее(Строка.ДатаВерсии, Новый Структура("ОбъектИстории, НаименованиеРеквизита", ОбъектИстории, "ИтогОС_КВ")).ЗначениеРеквизита;
		//Строка.КоличествоСтрокОплат			 = РегистрыСведений.уб_ИсторияРеквизит.ПолучитьПоследнее(Строка.ДатаВерсии, Новый Структура("ОбъектИстории, НаименованиеРеквизита", ОбъектИстории, "КоличествоСтрокОплат")).ЗначениеРеквизита;
	КонецЦикла;	
	//Если ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
	//	НоваяСтр = СписокВерсий.Добавить();
	//	НоваяСтр.ДатаВер = Дата(1,1,1);
	//	НоваяСтр.Версия = 0;
	//	НоваяСтр.АктуальностьВерсии = Ложь;
	//КонецЕсли;	
	Возврат СписокВерсий;
	
КонецФункции

Функция ПолучитьДатуАктуальнойВерсии(ОбъектИстории) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ИсторияОбъект.Период КАК ДатаВер,
	|	уб_ИсторияОбъект.НомерВерсии КАК Версия
	|ИЗ
	|	РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
	|ГДЕ
	|	уб_ИсторияОбъект.ОбъектИстории = &ОбъектИстории
	|	И уб_ИсторияОбъект.ВерсияАктуальна");						  
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаВер;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуПоследнейВерсии(ОбъектИстории) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ИсторияОбъект.Период КАК ДатаВер,
	|	уб_ИсторияОбъект.НомерВерсии КАК Версия
	|ИЗ
	|	РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
	|ГДЕ
	|	уб_ИсторияОбъект.ОбъектИстории = &ОбъектИстории
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВер УБЫВ");						  
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаВер;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

//!!!Добавить ТЧ и подчиненные документы
Функция ЗаписатьВерсиюИсторииВРегистр(ОбъектИстории, СтруктураРазличий, Комментарий, Актуальна = Ложь,ДатаПоследнейВерсии) Экспорт 
	
	//Инициализируем дату версии
	ДатаИстории = ТекущаяДата();	
	Если ДатаПоследнейВерсии = ДатаИстории Тогда
		ДатаИстории = ДатаИстории+1;//Итерация периода записи, при очень быстрой повторной записи может возникать проблема 
	КонецЕсли;	
	//Добавляем запись в регистр о новой версии
	НомерПоследнейВерсии = РегистрыСведений.уб_ИсторияОбъект.ПолучитьПоследнее(, Новый Структура("ОбъектИстории", ОбъектИстории)).НомерВерсии;
	НачатьТранзакцию();
	МЗИсторияОбъекта = РегистрыСведений.уб_ИсторияОбъект.СоздатьМенеджерЗаписи();
	МЗИсторияОбъекта.Период = ДатаИстории;
	МЗИсторияОбъекта.ВерсияАктуальна = Актуальна;
	МЗИсторияОбъекта.ОбъектИстории = ОбъектИстории;
	МЗИсторияОбъекта.НомерВерсии = ?(ЗначениеЗаполнено(НомерПоследнейВерсии), НомерПоследнейВерсии + 1, 1);
	МЗИсторияОбъекта.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МЗИсторияОбъекта.Записать();	
	НаборЗаписейИсторияРеквизит = РегистрыСведений.уб_ИсторияРеквизит.СоздатьНаборЗаписей();
	НаборЗаписейИсторияРеквизит.Отбор.ОбъектИстории.Установить(ОбъектИстории);
	НаборЗаписейИсторияРеквизит.Отбор.Период.Установить(ДатаИстории);
	НаборЗаписейИсторияРеквизит.Прочитать();
	НаборЗаписейИсторияРеквизитТЧ = РегистрыСведений.уб_ИсторияРеквизитТЧ.СоздатьНаборЗаписей();
	НаборЗаписейИсторияРеквизитТЧ.Отбор.ОбъектИстории.Установить(ОбъектИстории);
	НаборЗаписейИсторияРеквизитТЧ.Отбор.Период.Установить(ДатаИстории);
    НаборЗаписейИсторияРеквизитТЧ.Прочитать();		
	КэшРеквизитов = Новый Массив;
	Для Каждого СтрокаРазличий Из СтруктураРазличий Цикл	
		Если СтрокаРазличий.Ключ = "ПлатежныйДокумент" Тогда
			//Пишем различия ТЧ
			Для каждого Строка из СтрокаРазличий.Значение Цикл
				//МЗРеквизитыОбъекта = РегистрыСведений.уб_ИсторияРеквизитТЧ.СоздатьМенеджерЗаписи();
				Реквизит 		= Строка.Значение.НаименованиеРеквизитаТЧ;
				ИмяДокумента    = ОбъектИстории.Метаданные().Имя;
				
				РеквизитОбъекта = НайтиРеквизитОбъекта(Реквизит, ИмяДокумента);
				Если НЕ РеквизитОбъекта = Неопределено Тогда
					МЗРеквизитыОбъекта = НаборЗаписейИсторияРеквизитТЧ.Добавить();
					МЗРеквизитыОбъекта.Период 				= ДатаИстории;
					МЗРеквизитыОбъекта.ОбъектИстории 		= ОбъектИстории;
					МЗРеквизитыОбъекта.НаименованиеТЧ 		= СтрокаРазличий.Ключ;
					МЗРеквизитыОбъекта.УИДСтрокиТЧ 			= Строка.Значение.УИДСтроки;				
					МЗРеквизитыОбъекта.РеквизитОбъекта 		= РеквизитОбъекта;
					МЗРеквизитыОбъекта.ЗначениеРеквизита 	= Строка.Значение.ПравоеЗначение;
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ЗаписатьВерсиюИсторииВРегистр(): записана история с пустым реквизитом: '" + Реквизит + "', имя документа: '" + ИмяДокумента + "'", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина);
				Иначе
					Сообщить("Не найден реквизит "+Реквизит+" /// "+ИмяДокумента);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли СтрокаРазличий.Ключ = "ПодчиненныеДокументы" Тогда
			//Для подчиненного документа история уже записалась при записи самого подчиненного документа
			//но, для реквизитов - которых не было раньше, но нет сейчас - не отрабатывает
			//если нашлись изменения, то нужно писать версию, и все будет ок
			Для Каждого Строка из СтрокаРазличий.Значение Цикл
				ПодчиненныйДокумент = Строка.ПодчиненныйДокументСсылка;
				НомерПоследнейВерсииПодчиненного = РегистрыСведений.уб_ИсторияОбъект.ПолучитьПоследнее(, Новый Структура("ОбъектИстории", ПодчиненныйДокумент)).НомерВерсии;
				МЗИсторияПодчДок = РегистрыСведений.уб_ИсторияОбъект.СоздатьМенеджерЗаписи();
				МЗИсторияПодчДок.Период = ДатаИстории;
				МЗИсторияПодчДок.ВерсияАктуальна = Ложь;
				МЗИсторияПодчДок.ОбъектИстории = ПодчиненныйДокумент;
				МЗИсторияПодчДок.НомерВерсии = ?(ЗначениеЗаполнено(НомерПоследнейВерсииПодчиненного), НомерПоследнейВерсииПодчиненного + 1, 1);
				МЗИсторияПодчДок.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				МЗИсторияПодчДок.Записать();
				Для каждого ПодСтрокаРазличий из строка.ПодчиненныйДокументРазличия Цикл
					Если НЕ КэшРеквизитов.Найти(ПодСтрокаРазличий.Ключ.Реквизит) = Неопределено Тогда
						Продолжить;
					Иначе
						КэшРеквизитов.Добавить(ПодСтрокаРазличий.Ключ.Реквизит);
					КонецЕсли;	
					МЗРеквизитыОбъекта = РегистрыСведений.уб_ИсторияРеквизит.СоздатьМенеджерЗаписи();
					МЗРеквизитыОбъекта.Период = ДатаИстории;
					МЗРеквизитыОбъекта.ОбъектИстории = ПодчиненныйДокумент;
					ИмяДокумента = ПодчиненныйДокумент.Метаданные().Имя;
					МЗРеквизитыОбъекта.РеквизитОбъекта = ПодСтрокаРазличий.Ключ.Реквизит;//НайтиРеквизитОбъекта(ПодСтрокаРазличий.Ключ, ИмяДокумента); 
					МЗРеквизитыОбъекта.ЗначениеРеквизита = ПодСтрокаРазличий.Значение.ПравоеЗначение;
					Если НЕ ЗначениеЗаполнено(ПодСтрокаРазличий.Ключ.Реквизит) Тогда
						Сообщить(ПодСтрокаРазличий.Значение.ПравоеЗначение);
					КонецЕсли;	
					МЗРеквизитыОбъекта.Записать();
				КонецЦикла;
			КонецЦикла;
		Иначе
			Если НЕ КэшРеквизитов.Найти(СтрокаРазличий.Ключ.Реквизит) = Неопределено Тогда
				Продолжить;
			Иначе
				КэшРеквизитов.Добавить(СтрокаРазличий.Ключ.Реквизит);
			КонецЕсли;	
			МЗРеквизитыОбъекта = НаборЗаписейИсторияРеквизит.Добавить();
			МЗРеквизитыОбъекта.Период = ДатаИстории;
			МЗРеквизитыОбъекта.ОбъектИстории = ОбъектИстории;
			ИмяДокумента = ОбъектИстории.Метаданные().Имя;
			МЗРеквизитыОбъекта.РеквизитОбъекта = СтрокаРазличий.Ключ.Реквизит;
			Если НЕ ЗначениеЗаполнено(СтрокаРазличий.Ключ.Реквизит) Тогда
				Сообщить(СтрокаРазличий.Значение.ПравоеЗначение);
			КонецЕсли;	
			МЗРеквизитыОбъекта.ЗначениеРеквизита = СтрокаРазличий.Значение.ПравоеЗначение;			
		КонецЕсли;		
	КонецЦикла;
	//Сообщить(""+ОбъектИстории+ДатаИстории);
	Попытка
		Если НаборЗаписейИсторияРеквизит.Количество() > 0 Тогда
			НаборЗаписейИсторияРеквизит.Записать();
		КонецЕсли;	
	Исключение
		Сообщить(ОписаниеОшибки());
		//Сообщить(ПолучитьДатуПоследнейВерсии(ОбъектИстории.Ссылка));
		
		
	//	Для каждого СтрокаРазличий из СтруктураРазличий Цикл
	//		
	//		Если ЗначениеЗаполнено(СтрокаРазличий.Ключ.Реквизит) Тогда
	//		Иначе	
	//			Сообщить(СтрокаРазличий.Значение.ПравоеЗначение);
	//		КонецЕсли;	
	//	КонецЦикла;	
	КонецПопытки;	
	Если НаборЗаписейИсторияРеквизитТЧ.Количество() > 0 Тогда
		НаборЗаписейИсторияРеквизитТЧ.Записать();
	КонецЕсли;			
	ЗафиксироватьТранзакцию();
	Возврат МЗИсторияОбъекта;
	
	//
	//Для Каждого СтрокаРазличий Из СтруктураРазличий Цикл
	//	МЗРеквизитыОбъекта = НаборЗаписейИсторияРеквизит.Добавить();
	//	МЗРеквизитыОбъекта.Период = ДатаИстории;
	//	МЗРеквизитыОбъекта.ОбъектИстории = ОбъектИстории;		
	//	МЗРеквизитыОбъекта.РеквизитОбъекта = СтрокаРазличий.СсылкаРеквизита;
	//	МЗРеквизитыОбъекта.ЗначениеРеквизита = СтрокаРазличий.ПравоеЗначение;
	//КонецЦикла;
	//
		
КонецФункции

//Получаем последнюю версию объекта
//Возврат:
//	Если версия не надена - Неопределено
//	Иначе Структура значений последней версии объекта
Функция ПолучитьПоследнююВерсиюОбъекта(ОбъектИстории) Экспорт
	
	СрезПоледних = РегистрыСведений.уб_ИсторияОбъект.СрезПоследних(, Новый Структура("ОбъектИстории", ОбъектИстории));
	Если СрезПоледних.Количество() > 0 Тогда
		Возврат ПолучитьДанныеОбъектаНаДату(ОбъектИстории, СрезПоледних[0].Период);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

//ТОДО Заменить на новую функцию в ЗП потом убрать

//Получаем версию объекта на заданную дату	!!!Добавить ТЧ и подчиненные документы
//Возврат:
//	
Функция ПолучитьДанныеОбъектаНаДату(ОбъектИстории, ДатаОбъектаИстории) Экспорт
	
	СтруктураОбъектаИстории = Новый Структура();	
	Если ЗначениеЗаполнено(ДатаОбъектаИстории) Тогда 	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИР.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	ИР.ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаОбъектаИстории,
		|			ОбъектИстории = &ОбъектИстории
		|				И РеквизитОбъекта <> ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК ИР");
		Запрос.УстановитьПараметр("ДатаОбъектаИстории", ДатаОбъектаИстории);
		Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);
		Выборка = Запрос.Выполнить().Выбрать();		
		//Получаем значение всех реквизитов
	 	Пока Выборка.Следующий() Цикл
			СтруктураОбъектаИстории.Вставить(Выборка.НаименованиеРеквизита, Выборка.ЗначениеРеквизита)
		КонецЦикла;			
	Иначе
		//Получаем структуру текущей версии объекта
		Реквизиты = ПолучитьСписокРеквизитов(ОбъектИстории);
		Для Каждого Реквизит Из Реквизиты.Реквизиты Цикл
			ЗначениеРеквизита = ОбъектИстории[Реквизит.НаименованиеРеквизита];
			СтруктураОбъектаИстории.Вставить(Реквизит, ЗначениеРеквизита);
		КонецЦикла;                             
	КонецЕсли;	
	//!!!Получаем значение подчиненного документа ОплатаПолиса
	Если ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК ОплатаПолиса
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&ДатаОбъектаИстории, РеквизитОбъекта.Наименование = ""ОтчетПоставщику"") КАК уб_ИсторияРеквизитСрезПоследних
		|ГДЕ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита = &ОтчетПоставщику");
		Запрос.УстановитьПараметр("ДатаОбъектаИстории", ДатаОбъектаИстории);
		Запрос.УстановитьПараметр("ОтчетПоставщику", ОбъектИстории);
		Выборка = Запрос.Выполнить().Выбрать();		
		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");		
		Пока Выборка.Следующий() Цикл
			НовСтр = ТаблицаПодчиненныхДокументов.Добавить();
			НовСтр.ПодчиненныйДокументСсылка = Выборка.ОплатаПолиса;
			НовСтр.ПодчиненныйДокументСтруктура = ПолучитьДанныеОбъектаНаДату(Выборка.ОплатаПолиса, ДатаОбъектаИстории);
		КонецЦикла;		
		СтруктураОбъектаИстории.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);		
	КонецЕсли;	
	//!!!Получаем значение ТЧ ПлатежныйДокумент
	//Если ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
	//	
	//	ТЧ = "ПлатежныйДокумент";
	//	
	//	СписокРеквизитовОбъекта = ПолучитьСписокРеквизитов(ОбъектИстории);
	//	СписокРеквизитовТЧ = СписокРеквизитовОбъекта.РеквизитыТЧ.Скопировать(Новый Структура("НаименованиеТЧ",ТЧ));
	//	
	//	ТаблицаТЧ = Новый ТаблицаЗначений();
	//	
	//	//Создаем таблицу. Колонки как в докумнте
	//	Для Каждого РеквизитТЧ Из СписокРеквизитовТЧ Цикл 
	//		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.НаименованиеРеквизита);
	//	КонецЦикла;
	//	
	//	//Добавляем колонку УИДСтроки
	//	//ТаблицаТЧ.Колонки.Добавить("УИДСтроки","Строка",,);
	//	
	//	//Заполняем таблицу
	//	ТЗтч = РегистрыСведений.уб_ИсторияРеквизитТЧ.СрезПоследних(ДатаОбъектаИстории,  Новый Структура("ОбъектИстории,НаименованиеТЧ", ОбъектИстории, ТЧ));
	//	
	//	ПредЗНЧ = "";
	//	Для Каждого СтрокаТЧ Из ТЗтч Цикл 
	//		//Если нет значения - нет строки
	//		//!!!Добавить сортировку по УИДу
	//		Если ЗначениеЗаполнено(СтрокаТЧ.ЗначениеРеквизита) Тогда
	//			
	//			//Если УИД сменился - новая строка
	//			Если ПредЗНЧ <> СтрокаТЧ.УИДСтрокиТЧ Тогда
	//				НовСтр = ТаблицаТЧ.Добавить();
	//				НовСтр.УИДСтроки = СтрокаТЧ.УИДСтрокиТЧ;
	//				ПредЗНЧ = СтрокаТЧ.УИДСтрокиТЧ;
	//			КонецЕсли;
	//			
	//			//Пишем в строку значения столбцов
	//			НовСтр[СтрокаТЧ.НаименованиеРеквизита] = СтрокаТЧ.ЗначениеРеквизита;
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	//Вставляем таблицу в структура объекта
	//	//Если ТаблицаТЧ.Количество() > 0 Тогда
	//		СтруктураОбъектаИстории.Вставить(ТЧ, ТаблицаТЧ);
	//	//КонецЕсли;
	//	
	//	
	//КонецЕсли;	
	Возврат СтруктураОбъектаИстории;
	
КонецФункции

Функция НайтиРеквизитОбъекта(Реквизит, ИмяДокумента) Экспорт
	
	Если ТипЗнч(Реквизит) = Тип("Строка") И Реквизит <> "" И ТипЗнч(ИмяДокумента) = Тип("Строка") И ИмяДокумента <> "" Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РО.Ссылка
		|ИЗ
		|	Справочник.уб_РеквизитыОбъектов КАК РО
		|ГДЕ
		|	РО.Наименование = &Реквизит
		|	И РО.ИмяДокумента = &ИмяДокумента
		|	И НЕ РО.ПометкаУдаления";
		Запрос.УстановитьПараметр("Реквизит",		Реквизит);
		Запрос.УстановитьПараметр("ИмяДокумента",	ИмяДокумента);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;	
		КонецЕсли;					
		Если Результат = Неопределено Тогда //если не найдено, то создаем новый			
			НовыйОбъект = Справочники.уб_РеквизитыОбъектов.СоздатьЭлемент();
			НовыйОбъект.Наименование = СокрЛП(Реквизит);
			НовыйОбъект.ИмяДокумента = СокрЛП(ИмяДокумента);
			НовыйОбъект.Записать();
			Результат = НовыйОбъект.Ссылка;
		КонецЕсли;	
		Возврат Результат;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Процедура ПриЗаписиДокументаИсторияПриЗаписи(Источник, Отказ) Экспорт
	
	//Если стоит флаг загрузка, не создаем новую версию в итории
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ДополнительныеСвойства.Свойство("НеЗаписыватьИсторию") И Источник.ДополнительныеСвойства.НеЗаписыватьИсторию Тогда
		Возврат;
	КонецЕсли;	
	Если Не Отказ Тогда
		Попытка
			НастройкиДокумента = Справочники.уб_СписокОбъектовИстории.НайтиПоКоду(Источник.Метаданные().Имя);		
			Если ЗначениеЗаполнено(НастройкиДокумента) Тогда
				ЗаписатьНовуюВерсиюИсторииОбъекта(Источник.Ссылка, "Автоматическая регистрация изменений", НастройкиДокумента.ФиксироватьАвтоматически,,Ложь);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Функция ОткрытьФормуДокумент(НаименованиеДокумента, ПараметрыВерсии, ДокументОбъект) Экспорт
	
	//Транзакция открывается для отмены создания нового документа
	НачатьТранзакцию();
	//для менеджера документов обязательно требуется имя открываемой формы
	Форма = Документы[НаименованиеДокумента].ПолучитьФорму("ФормаДокументаУпрощение");	
	Форма.Открыть();	
	Форма.АвтоЗаголовок = Ложь;
	Форма.Заголовок = НаименованиеДокумента + ". История v." + ПараметрыВерсии.Версия + " от " + Формат(ПараметрыВерсии.ДатаВер, "ДЛФ=ДД") + ?(ПараметрыВерсии.АктуальностьВерсии,"/Актальная", "");
	Форма.Панель.ЦветФона = Новый Цвет(239, 247, 248);	
	//Обрабатываем элементы формы
	Для Каждого Элемент Из Форма.ЭлементыФормы Цикл
		//Чистим значения полей
		Если Тип(Элемент) = Тип("ПолеВвода") Тогда
			Элемент.Значение = Неопределено;
			Элемент.ТолькоПросмотр = Истина;
			Элемент.АвтоОтметкаНезаполненного = Ложь;
		ИначеЕсли Тип(Элемент) = Тип("Надпись") Тогда
			//TO BD DO проверить откуда берется, есть ли данные
			Если ЗначениеЗаполнено(Элемент.Данные) Тогда
				Элемент.Значение = Неопределено;
			КонецЕсли;
		ИначеЕсли Тип(Элемент) = Тип("ТабличноеПоле") Тогда
			//Элемент.ТолькоПросмотр = Истина;
			//Если Тип(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
			//ИначеЕсли Тип(Элемент.Значение) = Тип("ДокументТабличнаяЧасть.уб_ОтчетПоставщику.ПлатежныйДокумент") Тогда
			//ИначеЕсли Тип(Элемент.Значение) = Тип("ДокументСписок.уб_ОплатаПолисов") Тогда
			//КонецЕсли;
		ИначеЕсли Тип(Элемент) = Тип("Кнопка") ИЛИ Тип(Элемент) = Тип("КоманднаяПанель") ИЛИ Тип(Элемент) = Тип("Флажок") Тогда
			//Отключаем кнопки
			Элемент.Доступность = Ложь;
		Иначе
			//Сообщить(Элемент);
		КонецЕсли;
	КонецЦикла;
	ОтменитьТранзакцию();	
	уб_ИсторияИзмененияОбъектов.ЗаполнитьФормуДанными(Форма, ПараметрыВерсии, ДокументОбъект);	
	Возврат Форма;
	
КонецФункции

Функция ЗаполнитьФормуДанными(Форма, ПараметрыВерсии, СсылкаНаОбъект) Экспорт
	
	ДанныеОбъекта = уб_ИсторияИзмененияОбъектов.ПолучитьДанныеОбъектаНаДату(СсылкаНаОбъект, ПараметрыВерсии.ДатаВер);	
	Для Каждого Элемент Из Форма.ЭлементыФормы Цикл
		//Чистим значения полей
		Если ЗначениеЗаполнено(Элемент.Данные) Тогда
			Если Тип(Элемент) = Тип("ПолеВвода") ИЛИ Тип(Элемент) = Тип("Надпись") Тогда
				Попытка
					Элемент.Значение = ДанныеОбъекта[Элемент.Данные];
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			ИначеЕсли Тип(Элемент) = Тип("ТабличноеПоле") Тогда
				Если ТипЗнч(Форма.ДокументОбъект) = Тип("ДокументОбъект.уб_ОтчетПоставщику") И Элемент.Данные = "ПлатежныйДокумент" Тогда
					ОтчетПоставщикуЗаполнитьПлатежныйДокумент(Форма, ДанныеОбъекта, СсылкаНаОбъект);
				КонецЕсли;
				
				Если ТипЗнч(Форма.ДокументОбъект) = Тип("ДокументОбъект.уб_ОтчетПоставщику") И Элемент.Данные = "ОплатыСписок" Тогда
					ОтчетПоставщикуЗаполнитьОплатыСписок(Форма, ДанныеОбъекта, СсылкаНаОбъект);
				КонецЕсли;
			Иначе
				Сообщить(Элемент);
			КонецЕсли;				
		КонецЕсли;
	КонецЦикла;		
	Форма.Модифицированность = Ложь;
	
КонецФункции
	
Функция ОтчетПоставщикуЗаполнитьПлатежныйДокумент(Форма, ДанныеОбъекта, СсылкаНаОбъект)
	
	// Вывести платежные документы на дату версии
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ИсторияРеквизитТЧ.УИДСтрокиТЧ,
	|	уб_ИсторияРеквизитТЧ.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
	|	уб_ИсторияРеквизитТЧ.ЗначениеРеквизита,
	|	уб_ИсторияРеквизитТЧ.СтрокаУдалена
	|ИЗ
	|	РегистрСведений.уб_ИсторияРеквизитТЧ КАК уб_ИсторияРеквизитТЧ
	|ГДЕ
	|	уб_ИсторияРеквизитТЧ.Период <= &Период
	|	И уб_ИсторияРеквизитТЧ.ОбъектИстории = &ОбъектИстории
	|	И уб_ИсторияРеквизитТЧ.НаименованиеТЧ = &НаименованиеТЧ");
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектИстории",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("НаименованиеТЧ","ПлатежныйДокумент");
	Выборка = Запрос.Выполнить().Выбрать();
	УИДСтрокиТЧ = "";	
	Пока Выборка.Следующий() Цикл
		Если УИДСтрокиТЧ <> Выборка.УИДСтрокиТЧ Тогда 
			НоваяСтрока = Форма.ПлатежныйДокумент.Добавить();
		КонецЕсли;
		НоваяСтрока[Выборка.НаименованиеРеквизита] = Выборка.ЗначениеРеквизита;
		УИДСтрокиТЧ = Выборка.УИДСтрокиТЧ;
	КонецЦикла;
	Форма.ЭлементыФормы.ПлатежныйДокумент.ТолькоПросмотр = Истина;
	
КонецФункции

Функция ОтчетПоставщикуЗаполнитьОплатыСписок(Форма, ДанныеОбъекта, СсылкаНаОбъект)
	
	ТаблицаОплат = Новый ТаблицаЗначений;
	НоваяСтрока = ТаблицаОплат.Добавить();
	Форма.ЭлементыФормы.ОплатыСписок.Данные = "";
	Форма.ЭлементыФормы.ОплатыСписок.ТипЗначения = Новый ОписаниеТипов("ТаблицаЗначений");
	ФормаПустая = Документы.уб_ОтчетПоставщику.ПолучитьФорму();	
	Для Каждого Колонка Из ФормаПустая.ЭлементыФормы.ОплатыСписок.Колонки Цикл		
		НоваяКолонка = ТаблицаОплат.Колонки.Добавить(Колонка.Имя);
		НоваяКолонка = Колонка;        
	КонецЦикла;	
	Форма.ЭлементыФормы.ОплатыСписок.Значение = ТаблицаОплат;
	Форма.ЭлементыФормы.ОплатыСписок.СоздатьКолонки();	
	Для Каждого Колонка Из ФормаПустая.ЭлементыФормы.ОплатыСписок.Колонки Цикл
		НоваяКолонка = Форма.ЭлементыФормы.ОплатыСписок.Колонки.Найти(Колонка.Имя);
		НоваяКолонка.Положение = Колонка.Положение;        
	КонецЦикла;			
	Форма.ЭлементыФормы.ОплатыСписок.ТолькоПросмотр = Ложь;
	
КонецФункции

Функция ПолучитьЗапросСравненияВерсийОбъекта(
		ОбъектИстории, 		
		ТаблицаЛевыхРеквизитов = Неопределено, 
		ТаблицаПравыхРеквизитов = Неопределено, 
		ДатаЗапросаЛевая = Неопределено, 
		ДатаЗапросаПравая = Неопределено, 
		ТолькоИзмененныеРеквизиты = Истина, 
		ТолькоРезультатСравнения = Истина) Экспорт
	
	//НомераПакетов = Новый Структура;
	//Если ТолькоРезультатСравнения Тогда
	//	НомераПакетов.Вставить("РезультатСравнения", 3);
	//Иначе
	//	НомераПакетов.Вставить("СписокРеквизитов", 1);
	//	НомераПакетов.Вставить("ЛеваяТаблица", 3);
	//	НомераПакетов.Вставить("ПраваяТаблица", 5);
	//	НомераПакетов.Вставить("РезультатСравнения", 6);
	//КонецЕсли;
	ИмяМетаданныхОбъектаИстории = ОбъектИстории.Метаданные().Имя;	
	ЗаполнитьЛевуюТаблицу = Не ЗначениеЗаполнено(ТаблицаЛевыхРеквизитов);
	ЗаполнитьПравуюТаблицу = Не ЗначениеЗаполнено(ТаблицаПравыхРеквизитов);
	
	Если ЗаполнитьЛевуюТаблицу И ДатаЗапросаЛевая = Неопределено Тогда
		ДатаЗапросаЛевая = ПолучитьДатуПоследнейВерсии(ОбъектИстории);
	КонецЕсли;
	
	Если ЗаполнитьПравуюТаблицу И ДатаЗапросаПравая = Неопределено Тогда
		ЗаполнитьПравуюТаблицу = Ложь;
		ЗапросПравойТаблицы = Новый Запрос;		
		ИменаРеквизитов = ИменаРеквизитов(ИмяМетаданныхОбъектаИстории);
		ЗапросПравойТаблицы.Текст = "ВЫБРАТЬ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта КАК СсылкаРеквизита,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Синоним Как СинонимРеквизита,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита
		|Поместить ВТ_СписокРеквизитов
		|ИЗ
		|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
		|ГДЕ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код
		|	И уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|Выбрать
		|	ВТ_СписокРеквизитов.НаименованиеРеквизита,
		|	ВТ_СписокРеквизитов.СинонимРеквизита,
		|	ВТ_СписокРеквизитов.СсылкаРеквизита
		|	Из ВТ_СписокРеквизитов Как ВТ_СписокРеквизитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ "+ ИменаРеквизитов+" ИЗ Документ." + ИмяМетаданныхОбъектаИстории + " КАК Документ ГДЕ Документ.Ссылка = &ОбъектИстории";
		ЗапросПравойТаблицы.УстановитьПараметр("Код", ИмяМетаданныхОбъектаИстории);
		ЗапросПравойТаблицы.УстановитьПараметр("ОбъектИстории", ОбъектИстории);
		Пакет = ЗапросПравойТаблицы.ВыполнитьПакет();
		Выборка = Пакет[2].Выбрать();
		Если Выборка.Следующий() Тогда
			ТаблицаПравыхРеквизитов = Пакет[1].Выгрузить();
			ТаблицаПравыхРеквизитов.Колонки.Добавить("ЗначениеРеквизита", Метаданные.РегистрыСведений.уб_ИсторияРеквизит.Ресурсы.ЗначениеРеквизита.Тип);
			Для Каждого СтрокаТЗ Из ТаблицаПравыхРеквизитов Цикл
				СтрокаТЗ.ЗначениеРеквизита = Выборка[СтрокаТЗ.НаименованиеРеквизита];
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта КАК РеквизитОбъекта,
	|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита
	|Поместить ВТ_СписокРеквизитов
	|ИЗ
	|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
	|ГДЕ
	|	уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код
	|	И уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения";
	Если Не ТолькоРезультатСравнения Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + "Выбрать
		|ВТ_СписокРеквизитов.НаименованиеРеквизита,
		|ВТ_СписокРеквизитов.РеквизитОбъекта
		|Из ВТ_СписокРеквизитов Как ВТ_СписокРеквизитов";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Код",ИмяМетаданныхОбъектаИстории);			
		
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+ ПолучитьТекстЗапросаЛевойТаблицы(ЗаполнитьЛевуюТаблицу, ТаблицаЛевыхРеквизитов, Запрос, ТолькоРезультатСравнения) + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+ ПолучитьТекстЗапросаПравойТаблицы(ЗаполнитьПравуюТаблицу, ТаблицаПравыхРеквизитов, Запрос, ТолькоРезультатСравнения) + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + ПолучитьТекстЗапросаСравненияТаблиц();
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаЗапросаПравая",Новый Граница(ДатаЗапросаПравая, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаЗапросаЛевая", Новый Граница(ДатаЗапросаЛевая, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);
	Запрос.УстановитьПараметр("ТолькоИзмененныеРеквизиты", ТолькоИзмененныеРеквизиты);
	Возврат Запрос;
	
КонецФункции


Функция ПолучитьТекстЗапросаЛевойТаблицы(ЗаполнитьТаблицу, Таблица, Запрос, ТолькоРезультатСравнения)
	Если ЗаполнитьТаблицу Тогда
		Текст = "ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта Как СсылкаРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Синоним Как СинонимРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование Как НаименованиеРеквизита
		|Поместить ВТ_ЛеваяТаблица
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаЗапросаЛевая,
		|			ОбъектИстории = &ОбъектИстории
		|				И РеквизитОбъекта В (Выбрать Т.РеквизитОбъекта ИЗ ВТ_СписокРеквизитов Как Т)) КАК уб_ИсторияРеквизитСрезПоследних";
	Иначе
		Текст = "ВЫБРАТЬ
		|	ЛеваяТаблица.СсылкаРеквизита,
		|	ЛеваяТаблица.НаименованиеРеквизита,
		|	ЛеваяТаблица.СинонимРеквизита,
		|	ЛеваяТаблица.ЗначениеРеквизита
		|Поместить ВТ_ЛеваяТаблица
		|ИЗ
		|	&ЛеваяТаблица КАК ЛеваяТаблица";
		Запрос.УстановитьПараметр("ЛеваяТаблица", Таблица);
	КонецЕсли;
	Если Не ТолькоРезультатСравнения Тогда
		Текст = Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + "Выбрать
		|ВТ_ЛеваяТаблица.НаименованиеРеквизита,
		|ВТ_ЛеваяТаблица.СсылкаРеквизита,
		|ВТ_ЛеваяТаблица.СинонимРеквизита,
		|ВТ_ЛеваяТаблица.ЗначениеРеквизита
		|Из ВТ_ЛеваяТаблица Как ВТ_ЛеваяТаблица";
	КонецЕсли;
	Возврат Текст;
КонецФункции

Функция ПолучитьТекстЗапросаПравойТаблицы(ЗаполнитьТаблицу, Таблица, Запрос, ТолькоРезультатСравнения)
	Если ЗаполнитьТаблицу Тогда		
		Текст = "ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта Как СсылкаРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Синоним Как СинонимРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование Как НаименованиеРеквизита
		|Поместить ВТ_ПраваяТаблица
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(
		|			&ДатаЗапросаПравая,
		|			ОбъектИстории = &ОбъектИстории
		|				И РеквизитОбъекта В (Выбрать Т.РеквизитОбъекта ИЗ ВТ_СписокРеквизитов Как Т)) КАК уб_ИсторияРеквизитСрезПоследних";				
	Иначе
		Текст = "ВЫБРАТЬ
		|	ПраваяТаблица.НаименованиеРеквизита,
		|	ПраваяТаблица.СсылкаРеквизита,
		|	ПраваяТаблица.СинонимРеквизита,
		|	ПраваяТаблица.ЗначениеРеквизита
		|Поместить ВТ_ПраваяТаблица
		|ИЗ
		|	&ПраваяТаблица КАК ПраваяТаблица";
		Запрос.УстановитьПараметр("ПраваяТаблица", Таблица);
	КонецЕсли;
	Если Не ТолькоРезультатСравнения Тогда
		Текст = Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + "Выбрать
		|ВТ_ПраваяТаблица.НаименованиеРеквизита,
		|ВТ_ПраваяТаблица.СсылкаРеквизита,
		|ВТ_ПраваяТаблица.СинонимРеквизита,
		|ВТ_ПраваяТаблица.ЗначениеРеквизита
		|Из ВТ_ПраваяТаблица Как ВТ_ПраваяТаблица";
	КонецЕсли;
	Возврат Текст;
КонецФункции

Функция ПолучитьТекстЗапросаСравненияТаблиц()
	
	Возврат 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ЛеваяТаблица.НаименованиеРеквизита, ВТ_ПраваяТаблица.НаименованиеРеквизита) КАК Реквизит,
	|	ЕСТЬNULL(ВТ_ЛеваяТаблица.СсылкаРеквизита, ВТ_ПраваяТаблица.СсылкаРеквизита) КАК СсылкаРеквизита,
	|	ЕСТЬNULL(ВТ_ЛеваяТаблица.СинонимРеквизита, ВТ_ПраваяТаблица.СинонимРеквизита) КАК СинонимРеквизита,
	|	ЕСТЬNULL(ВТ_ЛеваяТаблица.ЗначениеРеквизита, ""<Пустое значение>"") КАК ЛевоеЗначение,
	|	ЕСТЬNULL(ВТ_ПраваяТаблица.ЗначениеРеквизита, ""<Пустое значение>"") КАК ПравоеЗначение
	|ИЗ
	|	ВТ_ЛеваяТаблица КАК ВТ_ЛеваяТаблица
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПраваяТаблица КАК ВТ_ПраваяТаблица
	|		ПО ВТ_ЛеваяТаблица.СсылкаРеквизита = ВТ_ПраваяТаблица.СсылкаРеквизита
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоИзмененныеРеквизиты
	|				ТОГДА ЕСТЬNULL(ВТ_ЛеваяТаблица.ЗначениеРеквизита, ""<Пустое значение>"") <> ЕСТЬNULL(ВТ_ПраваяТаблица.ЗначениеРеквизита, ""<Пустое значение>"")
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СинонимРеквизита,
	|	Реквизит";	
	
КонецФункции	

Процедура ЗаполнитьСтруктурыДляСравнения(Параметры, СтруктураЛевая, СтруктураПравая = Неопределено, СписокРеквизитов, МассивЗапрещенныхРеквизитов = Неопределено) Экспорт
	
	//+до оптимизации
	//1//СписокРеквизитов = уб_ИсторияИзмененияОбъектов.ПолучитьСписокРеквизитов(Параметры.Объект);
	//2//СтруктураЛевая	  = уб_ИсторияИзмененияОбъектов.DDПолучитьСтруктуруОбъекта(Параметры.Объект, Параметры.ДатаПредВерсии);
	//3//СтруктураПравая  = уб_ИсторияИзмененияОбъектов.DDПолучитьСтруктуруОбъекта(Параметры.Объект, Параметры.ДатаВерсии);
	//-до оптимизации
	ТекстЗапроса = "";
	ЗапросПоДаннымИстории = Новый Запрос;
	СтруктураПакетов = Новый Структура;
	СтруктураПакетов.Вставить("НомерСледующегоПакета", 0);
	
	ДополнитьТекстЗапросаСписокРеквизитов(ЗапросПоДаннымИстории, СтруктураПакетов, Параметры.Объект, МассивЗапрещенныхРеквизитов);
	ДополнитьТекстЗапросаИсториейОбъекта(ЗапросПоДаннымИстории, СтруктураПакетов, Параметры.Объект, Параметры.ДатаПредВерсии, "ДатаЛевая", Параметры.ВключитьПодчиненныеДокументы, МассивЗапрещенныхРеквизитов);
	Если СтруктураПравая <> Неопределено Тогда
		ДополнитьТекстЗапросаИсториейОбъекта(ЗапросПоДаннымИстории, СтруктураПакетов, Параметры.Объект, Параметры.ДатаВерсии, "ДатаПравая", Параметры.ВключитьПодчиненныеДокументы, МассивЗапрещенныхРеквизитов);
	КонецЕсли;
	Пакет = ЗапросПоДаннымИстории.ВыполнитьПакет();
	//////1
	СписокРеквизитов = Новый Структура();
	ТабЗнач = Пакет[СтруктураПакетов.СписокРеквизитов].Выгрузить();
	СписокРеквизитов.Вставить("Реквизиты", ТабЗнач);
	//////2
	СтруктураЛевая = ПолучитьСтруктуруИзПакета(Пакет, СтруктураПакетов, Параметры.ДатаПредВерсии, "ДатаЛевая", Параметры.Объект, Параметры.ВключитьПодчиненныеДокументы, СписокРеквизитов);
	//////3
	Если СтруктураПравая <> Неопределено Тогда
		СтруктураПравая = ПолучитьСтруктуруИзПакета(Пакет, СтруктураПакетов, Параметры.ДатаВерсии, "ДатаПравая", Параметры.Объект, Параметры.ВключитьПодчиненныеДокументы, СписокРеквизитов);
	КонецЕсли;	
	//////
	
	//Если СтруктураЛевая.Количество() = 0 Тогда //Истории еще нет		
	//	СтруктураЛевая.Вставить("ДатаВерсииСтруктуры",Дата(1,1,1));
	//	Если ТипЗнч(Параметры.Объект) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
	//		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
	//		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
	//		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
	//		СтруктураЛевая.Вставить("ПодчиненныеДокументы",ТаблицаПодчиненныхДокументов);
	//	КонецЕсли;
	//КонецЕсли;
		
КонецПроцедуры

Процедура ДополнитьТекстЗапросаСписокРеквизитов(Запрос, СтруктураПакетов, ОбъектИстории, МассивЗапрещенныхРеквизитов = Неопределено)
	
	Если Запрос.Текст <> "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	Если МассивЗапрещенныхРеквизитов = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта КАК Реквизит,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.СинонимРеквизита
		|ИЗ
		|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
		|ГДЕ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
		|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код";
	Иначе
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта КАК Реквизит,
		|	уб_СписокОбъектовИсторииСписокРеквизитов.СинонимРеквизита
		|ПОМЕСТИТЬ ВТ_СписокРеквизитов
		|ИЗ
		|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
		|ГДЕ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
		|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код
		|	И НЕ уб_СписокОбъектовИсторииСписокРеквизитов.НаименованиеРеквизита В (&МассивЗапрещенныхРеквизитов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокРеквизитов.НаименованиеРеквизита,
		|	ВТ_СписокРеквизитов.Реквизит,
		|	ВТ_СписокРеквизитов.СинонимРеквизита
		|ИЗ
		|	ВТ_СписокРеквизитов КАК ВТ_СписокРеквизитов";
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
		Запрос.УстановитьПараметр("МассивЗапрещенныхРеквизитов", МассивЗапрещенныхРеквизитов);
	КонецЕсли;
	Запрос.УстановитьПараметр("Код",ОбъектИстории.Метаданные().Имя);
	СтруктураПакетов.Вставить("СписокРеквизитов",СтруктураПакетов.НомерСледующегоПакета);
	СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаИсториейОбъекта(Запрос, СтруктураПакетов, ОбъектИстории, ДатаВерсииИсторииОбъекта = Неопределено, ИмяПараметраДаты, ВключитьПодчиненныеДокументы = Истина, МассивЗапрещенныхРеквизитов = Неопределено)
	
	Если ДатаВерсииИсторииОбъекта <> Неопределено Тогда
		ДополнитьТекстЗапросаДанныхОбъектаИзИстории(Запрос, СтруктураПакетов, ОбъектИстории, ДатаВерсииИсторииОбъекта, ИмяПараметраДаты, ВключитьПодчиненныеДокументы, МассивЗапрещенныхРеквизитов);
	Иначе
		ДополнитьТекстЗапросаТекущихДанныеОбъекта(Запрос, СтруктураПакетов, ОбъектИстории, ИмяПараметраДаты, ВключитьПодчиненныеДокументы);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруИзПакета(Пакет, СтруктураПакетов, ДатаВерсииИсторииОбъекта, ИмяПараметраДаты, ОбъектИстории, ВключитьПодчиненныеДокументы = Истина, СписокРеквизитов)
	
	СтруктураОбъектаИстории = Новый Структура();
	//Если ЗначениеЗаполнено(ДатаВерсииИсторииОбъекта) Тогда
	Если ДатаВерсииИсторииОбъекта <> Неопределено Тогда
		СтруктураОбъектаИстории.Вставить("ДатаВерсииСтруктуры",ДатаВерсииИсторииОбъекта);		
		Выборка = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ИсторияОбъекта"]].Выбрать();
		//Заполняем структуру данными из регистра уб_ИсторияРеквизит
		Пока Выборка.Следующий() Цикл
			СтруктураОбъектаИстории.Вставить(Выборка.НаименованиеРеквизита, Выборка.ЗначениеРеквизита);
		КонецЦикла;
		//получаем данные всех оплат и вставляем в 				
		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
		Если ВключитьПодчиненныеДокументы И ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
			//Получаем список оплат из регистра уб_ИсторияРеквизит, на момент истории входящих в Отчет Поставщику		
			Оплата = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_СписокОплатИзИстории"]].Выбрать();//документы оплаты		
			ВыборкаОплат = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ИсторияРеквизитовСпискаОплатИстория"]].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);//выборка истории для оплат
			//Для каждой оплаты получаем структуру ее значений и добавляем в таблицу подчиненных документов
			Пока Оплата.Следующий() Цикл
				//уб_ИсторияИзмененияОбъектов.DDПолучитьДанныеОбъектаИзИстории(Оплата.ОплатаПолиса, ДатаВерсииИсторииОбъекта, СтруктураОплаты);
				СтруктураОплаты = Новый Структура();
				ПолучитьСтруктуруОплаты(Оплата.ОплатаПолиса, ДатаВерсииИсторииОбъекта, СтруктураОплаты, ВыборкаОплат);
				НовСтр								= ТаблицаПодчиненныхДокументов.Добавить();
				НовСтр.ПодчиненныйДокументСсылка	= Оплата.ОплатаПолиса;
				НовСтр.ПодчиненныйДокументСтруктура	= СтруктураОплаты;
			КонецЦикла;
			СтруктураОбъектаИстории.Вставить("ВыборкаДанныхСтраховыхПолисов", Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ТекущиеДанныеСтраховыхПолисовСпискаОплатИстории"]].Выбрать());
		КонецЕсли;
		//Вставляем таблицу подчиненных документов в структуру Отчета поставщику
		СтруктураОбъектаИстории.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
	Иначе
		СтруктураОбъектаИстории.Вставить("ДатаВерсииСтруктуры",Дата(1,1,1));
		Выборка = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ТекущиеДанныеОбъекта"]].Выбрать();
		Выборка.Следующий();
		//ВыборкаРеквизитов = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_СписокРеквизитов"]].Выбрать();
		////Получаем значение реквизитов объекта из текущего объекта
		//Пока ВыборкаРеквизитов.Следующий() Цикл
		//	ЗначениеРевизита = Выборка[ВыборкаРеквизитов.НаименованиеРеквизита];
		//	СтруктураОбъектаИстории.Вставить(ВыборкаРеквизитов.НаименованиеРеквизита, ЗначениеРевизита);
		//КонецЦикла;
		Для Каждого СтрокаСпискаРеквизитов Из СписокРеквизитов.Реквизиты Цикл
			ЗначениеРевизита = Выборка[СтрокаСпискаРеквизитов.НаименованиеРеквизита];
			СтруктураОбъектаИстории.Вставить(СтрокаСпискаРеквизитов.НаименованиеРеквизита, ЗначениеРевизита);
		КонецЦикла;
			
		ТаблицаПодчиненныхДокументов = Новый ТаблицаЗначений();
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСсылка");
		ТаблицаПодчиненныхДокументов.Колонки.Добавить("ПодчиненныйДокументСтруктура");
		Если ВключитьПодчиненныеДокументы И ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда//Если это отчет поставщику, получаем данные всех оплат и вставляем в
			Оплата = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ТекущиеДанныеОплатПолисов"]].Выбрать();
			ВыборкаРеквизитов = Пакет[СтруктураПакетов[ИмяПараметраДаты + "_СписокРеквизитовДокументаОплаты"]].Выбрать();
			Пока Оплата.Следующий() Цикл
				СтруктураОплаты = Новый Структура();
				ВыборкаРеквизитов.Сбросить();
				Пока ВыборкаРеквизитов.Следующий() Цикл
					СтруктураОплаты.Вставить(ВыборкаРеквизитов.НаименованиеРеквизита, Оплата[ВыборкаРеквизитов.НаименованиеРеквизита]);
				КонецЦикла;
				НовСтр								= ТаблицаПодчиненныхДокументов.Добавить();
				НовСтр.ПодчиненныйДокументСсылка	= Оплата.Ссылка;
				НовСтр.ПодчиненныйДокументСтруктура	= СтруктураОплаты;
			КонецЦикла;
			СтруктураОбъектаИстории.Вставить("ВыборкаДанныхСтраховыхПолисов", Пакет[СтруктураПакетов[ИмяПараметраДаты + "_ТекущиеДанныеСтраховыхПолисовТекущегоСпискаОплат"]].Выбрать());
		КонецЕсли;
		//Вставляем таблицу подчиненных документов в структуру Отчета поставщику
		СтруктураОбъектаИстории.Вставить("ПодчиненныеДокументы", ТаблицаПодчиненныхДокументов);
	КонецЕсли;
	Возврат СтруктураОбъектаИстории;
	
КонецФункции

Процедура ДополнитьТекстЗапросаДанныхОбъектаИзИстории(Запрос, СтруктураПакетов, ОбъектИстории, ДатаВерсииИсторииОбъекта, ИмяПараметраДаты, ВключитьПодчиненныеДокументы = Истина, МассивЗапрещенныхРеквизитов = Неопределено)
	
	//ИмяПараметраТекущаяДата = "ТекущаяДата";
	//ТекущаяДата = ТекущаяДата();
	Если Запрос.Текст <> "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
	|	уб_ИсторияРеквизитСрезПоследних.Период,
	|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории,
	|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
	|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&" + ИмяПараметраДаты + ", ОбъектИстории = &ОбъектИстории" + ?(МассивЗапрещенныхРеквизитов <> Неопределено,"
					|		И РеквизитОбъекта В
					|		(ВЫБРАТЬ
					|			Т.Реквизит
					|		ИЗ
					|  			ВТ_СписокРеквизитов КАК Т)"," И НЕ РеквизитОбъекта = ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)") + ") КАК уб_ИсторияРеквизитСрезПоследних";
	//здесь берется не дата последней версии, а текущая дата
	Запрос.УстановитьПараметр(ИмяПараметраДаты, ДатаВерсииИсторииОбъекта);
	Запрос.УстановитьПараметр("ОбъектИстории", ОбъектИстории);

	СтруктураПакетов.Вставить(ИмяПараметраДаты + "_ИсторияОбъекта", СтруктураПакетов.НомерСледующегоПакета);
	СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
	Если ВключитьПодчиненныеДокументы И ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории КАК ОплатаПолиса
		|   Поместить ВТ_ОплатыПолисов" + ИмяПараметраДаты + " 
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&" + ИмяПараметраДаты + ", РеквизитОбъекта.Наименование = ""ОтчетПоставщику"") КАК уб_ИсторияРеквизитСрезПоследних
		|ГДЕ
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита = &ОбъектИстории
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОплатыПолисов.ОплатаПолиса КАК ОплатаПолиса
		|Из 
		|	ВТ_ОплатыПолисов" + ИмяПараметраДаты + " Как ВТ_ОплатыПолисов";
		
		СтруктураПакетов.Вставить(ИмяПараметраДаты + "_СписокОплатИзИстории", СтруктураПакетов.НомерСледующегоПакета+1);
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 2;
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_ИсторияРеквизитСрезПоследних.Период,
		|	уб_ИсторияРеквизитСрезПоследних.ОбъектИстории Как ОплатаПолиса,
		|	уб_ИсторияРеквизитСрезПоследних.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
		|	уб_ИсторияРеквизитСрезПоследних.ЗначениеРеквизита
		|Поместить ВТ_ИсторияОплатПолисов" + ИмяПараметраДаты + "
		|ИЗ
		|	РегистрСведений.уб_ИсторияРеквизит.СрезПоследних(&" + ИмяПараметраДаты + ", ОбъектИстории В (Выбрать Т.ОплатаПолиса Из ВТ_ОплатыПолисов" + ИмяПараметраДаты + " Как Т) 
		|	И НЕ РеквизитОбъекта = ЗНАЧЕНИЕ(Справочник.уб_РеквизитыОбъектов.ПустаяСсылка)) КАК уб_ИсторияРеквизитСрезПоследних
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсторияОплатПолисов.Период КАК Период,
		|	ВТ_ИсторияОплатПолисов.ОплатаПолиса Как ОплатаПолиса,
		|	ВТ_ИсторияОплатПолисов.НаименованиеРеквизита КАК НаименованиеРеквизита,
		|	ВТ_ИсторияОплатПолисов.ЗначениеРеквизита
		|Из 
		|	ВТ_ИсторияОплатПолисов" + ИмяПараметраДаты + " Как ВТ_ИсторияОплатПолисов
		|Итоги По ОплатаПолиса
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	ВТ_ИсторияОплатПолисов.ЗначениеРеквизита
		|Поместить ВТ_СтраховыеПолисыИзОплат" + ИмяПараметраДаты + "
		|Из 
		|	ВТ_ИсторияОплатПолисов" + ИмяПараметраДаты + " Как ВТ_ИсторияОплатПолисов
		|ГДЕ
		|	ВТ_ИсторияОплатПолисов.НаименованиеРеквизита = ""СтраховойПолис""
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	уб_СтраховойПолис.Ссылка,
		|	уб_СтраховойПолис.Страхователь,
		|	уб_СтраховойПолис.Поставщик,
		|	уб_СтраховойПолис.Дата,
		|	уб_СтраховойПолис.Номер,
		|	уб_СтраховойПолис.ДатаНачала,
		|	уб_СтраховойПолис.ДатаОкончания,
		|	уб_СтраховойПолис.СтраховаяПремия,
		|	уб_СтраховойПолис.БСО.(
		|		Ссылка,
		|		НомерСтроки,
		|		ВидБСО,
		|		НомерБСО,
		|		НомерПолиса,
		|		Обязательно,
		|		Оформлен,
		|		НазначениеБСО,
		|		Агент,
		|		ВидБСО.ТипУчетаБСО КАК ТипУчетаБСО
		|	) КАК БСО
		|ИЗ
		|	ВТ_СтраховыеПолисыИзОплат" + ИмяПараметраДаты + " КАК ВТ_СтраховыеПолисыИзОплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|		ПО (ВТ_СтраховыеПолисыИзОплат.ЗначениеРеквизита = уб_СтраховойПолис.Ссылка)";
		СтруктураПакетов.Вставить(ИмяПараметраДаты+"_ИсторияРеквизитовСпискаОплатИстория", СтруктураПакетов.НомерСледующегоПакета+1);
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 2;
		СтруктураПакетов.Вставить(ИмяПараметраДаты+"_ТекущиеДанныеСтраховыхПолисовСпискаОплатИстории", СтруктураПакетов.НомерСледующегоПакета+1);
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 2;
		//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	КонецЕсли;
КонецПроцедуры

Процедура ДополнитьТекстЗапросаТекущихДанныеОбъекта(Запрос, СтруктураПакетов, ОбъектИстории, ИмяПараметраДаты, ВключитьПодчиненныеДокументы = Истина)
	
	Если Запрос.Текст <> "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|";
	КонецЕсли;
	
	
	ИмяМета = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектИстории)).Имя;
	ИменаРеквизитов =  ИменаРеквизитов(ИмяМета);
	
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ "+ ИменаРеквизитов +" ИЗ Документ." + ИмяМета +" КАК Документ ГДЕ	Документ.Ссылка = &Ссылка";
	//|
	//|;
	//|///////////////////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование Как НаименованиеРеквизита 
	//|ИЗ
	//|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
	//|ГДЕ
	//|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
	//|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &Код";
	//Запрос.УстановитьПараметр("Код",ОбъектИстории.Метаданные().Имя);
	Запрос.УстановитьПараметр("Ссылка", ОбъектИстории);
	СтруктураПакетов.Вставить(ИмяПараметраДаты + "_ТекущиеДанныеОбъекта", СтруктураПакетов.НомерСледующегоПакета);
	СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
	//СтруктураПакетов.Вставить(ИмяПараметраДаты + "_СписокРеквизитов", СтруктураПакетов.НомерСледующегоПакета);
	//СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
	Если ВключитьПодчиненныеДокументы И ТипЗнч(ОбъектИстории) = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		ИменаРеквизитов = ИменаРеквизитов("уб_ОплатаПолисов");//"*";
		
		Запрос.Текст = Запрос.Текст + "
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|" + "ВЫБРАТЬ "+ИменаРеквизитов+"
		|Поместить ВТ_ТекущиеДанныеОплатПолисов
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК Документ ГДЕ Документ.ОтчетПоставщику = &Ссылка
		|
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|Выбрать * Из ВТ_ТекущиеДанныеОплатПолисов Как ВТ_ТекущиеДанныеОплатПолисов
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	уб_СтраховойПолис.Ссылка,
		|	уб_СтраховойПолис.Страхователь,
		|	уб_СтраховойПолис.Поставщик,
		|	уб_СтраховойПолис.Дата,
		|	уб_СтраховойПолис.Номер,
		|	уб_СтраховойПолис.ДатаНачала,
		|	уб_СтраховойПолис.ДатаОкончания,
		|	уб_СтраховойПолис.СтраховаяПремия,
		|	уб_СтраховойПолис.БСО.(
		|		Ссылка,
		|		НомерСтроки,
		|		ВидБСО,
		|		НомерБСО,
		|		НомерПолиса,
		|		Обязательно,
		|		Оформлен,
		|		НазначениеБСО,
		|		Агент,
		|		ВидБСО.ТипУчетаБСО КАК ТипУчетаБСО
		|	) КАК БСО
		|ИЗ
		|	ВТ_ТекущиеДанныеОплатПолисов КАК ВТ_ТекущиеДанныеОплатПолисов
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
		|ПО ВТ_ТекущиеДанныеОплатПолисов.СтраховойПолис = уб_СтраховойПолис.Ссылка
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование Как НаименованиеРеквизита
		|ИЗ
		|	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
		|ГДЕ
		|	уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения
		|	И уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &КодОплатаПолисов";
		Запрос.УстановитьПараметр("КодОплатаПолисов","уб_ОплатаПолисов");//Метаданные.Документы.уб_ОплатаПолисов.Имя
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
		СтруктураПакетов.Вставить(ИмяПараметраДаты + "_ТекущиеДанныеОплатПолисов", СтруктураПакетов.НомерСледующегоПакета);
		
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
		СтруктураПакетов.Вставить(ИмяПараметраДаты + "_ТекущиеДанныеСтраховыхПолисовТекущегоСпискаОплат", СтруктураПакетов.НомерСледующегоПакета);
		
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
		СтруктураПакетов.Вставить(ИмяПараметраДаты + "_СписокРеквизитовДокументаОплаты", СтруктураПакетов.НомерСледующегоПакета);
		СтруктураПакетов.НомерСледующегоПакета = СтруктураПакетов.НомерСледующегоПакета + 1;
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьСтруктуруОплаты(ОплатаПолиса, ДатаВерсииИсторииОбъекта,СтруктураОплаты, ВыборкаОплат);

	СтруктураОплаты.Вставить("ДатаВерсииСтруктуры",ДатаВерсииИсторииОбъекта);
	ВыборкаОплат.Сбросить();
	Отбор = Новый Структура("ОплатаПолиса", ОплатаПолиса);
	Если ВыборкаОплат.НайтиСледующий(Отбор) Тогда
		ДетальныеЗаписи = ВыборкаОплат.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл
			СтруктураОплаты.Вставить(ДетальныеЗаписи.НаименованиеРеквизита, ДетальныеЗаписи.ЗначениеРеквизита);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ИменаРеквизитов(ИмяМета)
	//Исходи из того, что имена актуальны в справочнике, в том числе и общие реквизиты
	Запрос = Новый Запрос ("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	уб_СписокОбъектовИсторииСписокРеквизитов.РеквизитОбъекта.Наименование как НаименованиеРеквизита
	                       |ИЗ
	                       |	Справочник.уб_СписокОбъектовИстории.СписокРеквизитов КАК уб_СписокОбъектовИсторииСписокРеквизитов
	                       |ГДЕ
	                       |	уб_СписокОбъектовИсторииСписокРеквизитов.Ссылка.Код = &ИмяМета
	                       |	И уб_СписокОбъектовИсторииСписокРеквизитов.ФиксироватьИзменения = ИСТИНА");
	Запрос.УстановитьПараметр("ИмяМета",ИмяМета);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоВВыборке = Выборка.Количество();
	ИменаРеквизитов = "";
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик+1;
		Если Счетчик = 1 Тогда
			ИменаРеквизитов = "Ссылка, ";
		КонецЕсли;	
		ИменаРеквизитов = ИменаРеквизитов+""+Выборка.НаименованиеРеквизита+?(Счетчик=КоличествоВВыборке,"",", ");
	КонецЦикла;
	Если КоличествоВВыборке >0 Тогда
		
		ЗапросТест = Новый Запрос;
		ЗапросТест.Текст = "Выбрать Первые 1 "+ИменаРеквизитов +" из Документ."+ИмяМета;
		Попытка
			Выборка2 = ЗапросТест.Выполнить();	
		Исключение
			ИменаРеквизитов = "";
		КонецПопытки;
		
	КонецЕсли;
	Возврат ?(ИменаРеквизитов="","*",ИменаРеквизитов);
КонецФункции
