//
Функция СравнитьСкорректироватьТаблицу(ПредыдущиеРасчеты,НовыеРасчеты,ЕстьИзменения =  Ложь, КлючевыеПараметры = "Вид,УидСтроки,Уточнение") Экспорт
	ЕстьИзменения =  Ложь;
	врРасчетыПоЗаявке = ПредыдущиеРасчеты.Скопировать();
	ПредыдущиеРасчеты.Колонки.Добавить("Учтено",Новый ОписаниеТипов("Булево"));
	врРасчетыПоЗаявке.Очистить();
	//.Очистить();
	
	СтруктураПоиска = Новый Структура(КлючевыеПараметры);
	ЕстьИзменения = Ложь;
	Для каждого СтрокаР Из НовыеРасчеты Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаР);
		ПредыдущиеСтроки = ПредыдущиеРасчеты.НайтиСтроки(СтруктураПоиска);
		ИтСуммаКлиент   = 0;
		ИтСуммаМенеджер = 0;
		ИтСуммаБрокер   = 0;
		ИтСуммаБрокерВС   = 0;
		Для каждого СтрокаПР Из ПредыдущиеСтроки Цикл
			//Копирование уже существующих
			СтрокаРПЗ = врРасчетыПоЗаявке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРПЗ,СтрокаПР);
			ИтСуммаКлиент   = ИтСуммаКлиент   + СтрокаПР.СуммаКлиент;
			ИтСуммаМенеджер = ИтСуммаМенеджер + СтрокаПР.СуммаМенеджер;
			ИтСуммаБрокер   = ИтСуммаБрокер   + СтрокаПР.СуммаБрокер;
			ИтСуммаБрокерВС   = ИтСуммаБрокерВС  + СтрокаПР.СуммаБрокерВС;
			СтрокаПР.Учтено  = Истина;
		КонецЦикла;
		
		//Корректировка или создание новой записи расчетов (НР)
		Если ИтСуммаКлиент <> СтрокаР.СуммаКлиент 
			ИЛИ ИтСуммаМенеджер <> СтрокаР.СуммаМенеджер
			ИЛИ ИтСуммаБрокер <> СтрокаР.СуммаБрокер 
			ИЛИ ИтСуммаБрокерВС<> СтрокаР.СуммаБрокерВС Тогда
			СтрокаНР = врРасчетыПоЗаявке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНР,СтрокаР);
			СтрокаНР.СуммаКлиент   = СтрокаР.СуммаКлиент-ИтСуммаКлиент;
			СтрокаНР.СуммаМенеджер = СтрокаР.СуммаМенеджер-ИтСуммаМенеджер;
			СтрокаНР.СуммаБрокер   = СтрокаР.СуммаБрокер-ИтСуммаБрокер;
			СтрокаНР.СуммаБрокерВС = СтрокаР.СуммаБрокерВС-ИтСуммаБрокерВС;
			
			Попытка
			СтрокаНР.ВремяРегистрации = ТекущаяДата();
			СтрокаНР.Автор = ПараметрыСеанса.ТекущийПользователь;
			Исключение
			КонецПопытки;
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	//Отработка удаленных расчетов
	СтруктураПоиска = Новый Структура("Учтено",Ложь);
	ПредыдущиеСтроки = ПредыдущиеРасчеты.Скопировать(СтруктураПоиска);
	ПредыдущиеСтроки.Свернуть(КлючевыеПараметры,"СуммаКлиент,СуммаМенеджер,СуммаБрокер,СуммаБрокерВС");
	Для каждого СтрокаПР Из ПредыдущиеСтроки Цикл
		
		СтруктураПоискаПР = Новый Структура(КлючевыеПараметры);
		ЗаполнитьЗначенияСвойств(СтруктураПоискаПР,СтрокаПР);
		Для каждого СтрокаТекПР Из ПредыдущиеРасчеты.НайтиСтроки(СтруктураПоискаПР) Цикл
			//Копирование уже существующих 
			// с периодами правки
			СтрокаРПЗ = врРасчетыПоЗаявке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРПЗ,СтрокаТекПР);
			СтрокаТекПР.Учтено  = Истина;
		КонецЦикла;
		
		//Сторнирующие расчеты
		Если 0 <> СтрокаПР.СуммаКлиент 
			ИЛИ 0 <> СтрокаПР.СуммаМенеджер
			ИЛИ 0 <> СтрокаПР.СуммаБрокер
			ИЛИ 0 <> СтрокаПР.СуммаБрокерВС Тогда
			СтрокаСР = врРасчетыПоЗаявке.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСР,СтрокаПР);
			СтрокаСР.СуммаКлиент   = 0-СтрокаПР.СуммаКлиент;
			СтрокаСР.СуммаМенеджер = 0-СтрокаПР.СуммаМенеджер;
			СтрокаСР.СуммаБрокер   = 0-СтрокаПР.СуммаБрокер;
			СтрокаСР.СуммаБрокерВС = 0-СтрокаПР.СуммаБрокерВС;
			Попытка
				СтрокаСР.ВремяРегистрации = ТекущаяДата();
				СтрокаСР.Автор = ПараметрыСеанса.ТекущийПользователь;
			Исключение
			КонецПопытки;
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		
	КонецЦикла;
	Если ЕстьИзменения = Истина  
		ИЛИ врРасчетыПоЗаявке.Итог("СуммаКлиент")   <> ПредыдущиеРасчеты.Итог("СуммаКлиент")
		ИЛИ врРасчетыПоЗаявке.Итог("СуммаМенеджер") <> ПредыдущиеРасчеты.Итог("СуммаМенеджер")
		ИЛИ врРасчетыПоЗаявке.Итог("СуммаБрокер")   <> ПредыдущиеРасчеты.Итог("СуммаБрокер")
		ИЛИ врРасчетыПоЗаявке.Итог("СуммаБрокерВС") <> ПредыдущиеРасчеты.Итог("СуммаБрокерВС")
		Тогда
		//
		ЕстьИзменения = Истина;
		//РасчетыПоЗаявке.Загрузить(врРасчетыПоЗаявке);
	КонецЕсли;	
	Возврат врРасчетыПоЗаявке
КонецФункции	

Процедура ПроверитьСтроку(Строка) Экспорт
	Если ПустаяСтрока(Строка.УидСтроки) Тогда
		Строка.УидСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;	
КонецПроцедуры


//СТАРЫЙ ПРОЕКТ

//Формирует временную таблицу регистра взаиморасчетов по документу и его движениям
Функция ЗапросПоВзаиморасчетамДокумента(Документ,КлючОперации=Неопределено) Экспорт
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы,
	                      |	уб_ВзаиморасчетыПоДоговору.Операция КАК Операция,
						  |	уб_ВзаиморасчетыПоДоговору.КлючОперации КАК КлючОперации,
	                      |	уб_ВзаиморасчетыПоДоговору.Сумма КАК Сумма,
	                      |	уб_ВзаиморасчетыПоДоговору.Документ КАК Документ,
	                      |	уб_ВзаиморасчетыПоДоговору.ИДОперации КАК ИДОперации,
	                      |	уб_ВзаиморасчетыПоДоговору.Страхователь,
	                      |	уб_ВзаиморасчетыПоДоговору.Поставщик,
	                      |	уб_ВзаиморасчетыПоДоговору.Агент,
	                      |	уб_ВзаиморасчетыПоДоговору.ДатаОперации,
	                      |	уб_ВзаиморасчетыПоДоговору.ОрганизацияАгент,
	                      |	уб_ВзаиморасчетыПоДоговору.ТипОперации
	                      |ПОМЕСТИТЬ ДвиженияДокументаПоОперации
	                      |ИЗ
	                      |	РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	                      |ГДЕ
	                      |	уб_ВзаиморасчетыПоДоговору.Документ = &Документ"+
	                      ?(КлючОперации=Неопределено,""," И уб_ВзаиморасчетыПоДоговору.КлючОперации = &КлючОперации");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;					  
	Запрос.УстановитьПараметр("Документ",Документ);
	Запрос.УстановитьПараметр("КлючОперации",КлючОперации);
	Запрос.Выполнить();
    Возврат Запрос;
КонецФункции	

//Отражает операцию в регистре взаиморасчетов, если операция с заданными параметрами есть, добивает до указаной операции суммой  
Функция ОтразитьОперациюВзаиморасчета(
	КлючОперации, 
	ВидОперации				= Неопределено,
	Документ,
	ЗначениеОтбора,
	Знач СуммаОперации,
	СтруктураПараметров,
	ИДГруппы				= Неопределено,
	Запрос 					= Неопределено
	) Экспорт
	
	Если НЕ ПараметрыСеанса.уб_Константы.ВестиВзаиморасчетыПоОперациям = Истина Тогда
		Возврат Ложь;
	КонецЕсли;	
	Если ВидОперации = Неопределено Тогда
		Если КлючОперации = "КВСумма" Тогда 
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера;
		ИначеЕсли КлючОперации = "ВычетСАгента"	 Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.УдержаниеИзВМ;
		ИначеЕсли КлючОперации = "СкидкаВыплаченаяКлиенту" Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту;
		ИначеЕсли КлючОперации = "НачислениеВМ"  Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.НачислениеВМ;
		ИначеЕсли КлючОперации = "НачисленнаяСуммаВзноса"  Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса;
		ИначеЕсли КлючОперации = "УдержаноМенеджеромИзДСКлиента" Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.УдержаноМенеджеромИзДСКлиента;
			//---Скидка Клиенту		
		ИначеЕсли КлючОперации = "СкидкаКлиентуИзДБ" Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ;
		ИначеЕсли КлючОперации = "СуммовыеОтклоненияВПриемке" Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.СуммовыеОтклоненияВПриемке;	
		ИначеЕсли КлючОперации = "СозданиеСтраховогоПолиса" Тогда
			ВидОперации = Справочники.уб_ВидыРасчетныхОпераций.СозданиеСтраховогоПолиса;		
		Иначе
			#Если Клиент Тогда
				Сообщить("Не определен вид операции для ключа: "+КлючОперации);
			#КонецЕсли	
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;		
    Если Запрос = Неопределено Тогда
		//Получить все, что ранее уже отражено по данному документу
		Запрос = ЗапросПоВзаиморасчетамДокумента(Документ);	
	КонецЕсли;		
    //Определение ранее отраженной суммы по виду операции 
	ТекстЗапроса = "
               |Выбрать * из ДвиженияДокументаПоОперации
			   |;
			   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
               |	уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы,
               |	уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК КоличествоГрупп,
               |	уб_ВзаиморасчетыПоДоговору.Операция,
			   |	уб_ВзаиморасчетыПоДоговору.КлючОперации,
               |	уб_ВзаиморасчетыПоДоговору.ИДОперации КАК ИДОперации,
               |	уб_ВзаиморасчетыПоДоговору.Сумма КАК Сумма,
               |	уб_ВзаиморасчетыПоДоговору.Документ,
               |	уб_ВзаиморасчетыПоДоговору.Страхователь,
               |	уб_ВзаиморасчетыПоДоговору.Поставщик,
               |	уб_ВзаиморасчетыПоДоговору.Агент,
               |	уб_ВзаиморасчетыПоДоговору.ДатаОперации КАК ДатаОперации,
               |	уб_ВзаиморасчетыПоДоговору.ОрганизацияАгент,
               |	уб_ВзаиморасчетыПоДоговору.ТипОперации
               |ИЗ
               |	ДвиженияДокументаПоОперации КАК уб_ВзаиморасчетыПоДоговору
               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
			   |		ВЫБРАТЬ РАЗЛИЧНЫЕ 
			   |			ИДГруппы 
			   |		ИЗ 
			   |			ДвиженияДокументаПоОперации 
			   |        ГДЕ 
			   |           ДвиженияДокументаПоОперации.Операция =&Операция 
			   |           И ДвиженияДокументаПоОперации.КлючОперации = &КлючОперации 
			   |           И (1 = 1)) КАК УИДГруппы
               |		ПО уб_ВзаиморасчетыПоДоговору.ИДГруппы = УИДГруппы.ИДГруппы
               |			 И уб_ВзаиморасчетыПоДоговору.Операция =&Операция
			   |			 И уб_ВзаиморасчетыПоДоговору.КлючОперации = &КлючОперации
               |УПОРЯДОЧИТЬ ПО ДатаОперации
			   |ИТОГИ
               |	МАКСИМУМ(ИДГруппы),
               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоГрупп),
               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИДОперации),
               |	СУММА(Сумма),
               |	МАКСИМУМ(ДатаОперации)
               |ПО
               |	ОБЩИЕ
			   | ";
		//ОтборПоУИД = ТипЗНЧ(значениеОтбора)=Тип("Строка");
		//
		//Если ОтборПоУИД Тогда
		//	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"ДвиженияДокументаПоОперации.КлючОперации = &КлючОперации","(ДвиженияДокументаПоОперации.ИДОперации=&ЗначениеОтбора ИЛИ ДвиженияДокументаПоОперации.ИДГруппы=&ЗначениеОтбора")+" ";
		//КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"1 = 1","ДвиженияДокументаПоОперации.Документ=&ЗначениеОтбора")+" ";
	Запрос.УстановитьПараметр("ЗначениеОтбора",ЗначениеОтбора);
	Запрос.УстановитьПараметр("Операция",ВидОперации);
	Запрос.УстановитьПараметр("КлючОперации",КлючОперации);	
	//ВыборкаПоДокументу = Запрос.ВыполнитьПакет()[0].Выбрать();//Для отладки
	ВыборкаОтраженных = Запрос.Выполнить().Выбрать();					 	
	//Строка итогов
	Если ВыборкаОтраженных.Следующий() Тогда
		СуммаОтразить = СуммаОперации - ВыборкаОтраженных.Сумма;
		Если СуммаОтразить <> 0 Тогда
			Если ВыборкаОтраженных.КоличествоГрупп = 1 Тогда
			Иначе
				//Операция взаиморасчетов не должна проходить по нескольким группам (либо это ошибка, либо группы должны слиться в одну)
				//TODO задание либо информирование пользователя о необходимости слияния
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибочное количество групп ("+ВыборкаОтраженных.КоличествоГрупп+") по строке в "+Документ+" КлючОперации:"+КлючОперации,"",Истина,,,Документ,"Взаиморасчеты.Error");
				Возврат Ложь;
			КонецЕсли;	
			ИДГруппы = ВыборкаОтраженных.ИДГруппы;
			ДатаОперации = 
			//?(ВыборкаОтраженных.ДатаОперации=СтруктураПараметров.Дата И ВыборкаОтраженных.ИДОперации <=1,//Если дата не поменялась TODO подумать как отслеживать правку суммы после отвязки от подтвержденного ОК
			//  СтруктураПараметров.Дата,
			  ?(НачалоДня(ТекущаяДата())= НачалоДня(ВыборкаОтраженных.ДатаОперации),//Корректировки внутри дня схлапываются
			    ВыборкаОтраженных.ДатаОперации,
			    ТекущаяДата()
				)
				//)
				;
			СуммаПоДате = 0;
			РанееОтраженоОпераций = 0;
			ИДОперации  = Неопределено;
			Пока ВыборкаОтраженных.Следующий() Цикл
				//Поиск УИД соответствующего выбранной дате операции
				Если ВыборкаОтраженных.ДатаОперации = ДатаОперации Тогда
					Если ИДОперации  = Неопределено Тогда
						ИДОперации = ВыборкаОтраженных.ИДОперации;
					КонецЕсли;
					Если ИДОперации = ВыборкаОтраженных.ИДОперации Тогда
						СуммаПоДате = СуммаПоДате+ВыборкаОтраженных.Сумма;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;		
			Если ИДОперации  = Неопределено Тогда
				//По этой дате операции еще не записывались
				ИДОперации = Строка(Новый УникальныйИдентификатор);	
				ТипОперации = "Основная";
			Иначе	
				ТипОперации = "Корректировка";
			КонецЕсли;	
			СуммаПоДате = СуммаОтразить+СуммаПоДате;
			//Если СуммаПоДате + СуммаОтразить = Сумма Тогда
			//	// Контроль контроль отражения суммы
			//	//Все операции при совпадающей дате должны проходить по одному ИДОперации
			//	Сообщить("Множественные УИД ");
			//КонецЕсли;	
		КонецЕсли;
	Иначе
		//Еще не отражалась, такая сумма Генерируем новую группу 
		СуммаОтразить = СуммаОперации;
		СуммаПоДате   = СуммаОтразить;
		ИДГруппы = ?(ИДГруппы=Неопределено,Строка(Новый УникальныйИдентификатор),ИДГруппы);
		ДатаОперации = СтруктураПараметров.Дата;
		//Первая операция записывается по
		//ИДОперации  = ?(ОтборПоУИД,ЗначениеОтбора,Строка(Новый УникальныйИдентификатор));;
		ИДОперации  = Строка(Новый УникальныйИдентификатор);
		ТипОперации = "Основная";
	КонецЕсли;
	Если СуммаОтразить <> 0 
		ИЛИ (СуммаОперации = 0 и ТипЗнч(Документ)=Тип("ДокументСсылка.уб_СтраховойПолис"))  //По нему запись пустышка TODO Параметром?
		Тогда
		Запись = РегистрыСведений.уб_ВзаиморасчетыПоДоговору.СоздатьМенеджерЗаписи();
		//Измерения
		Запись.ИДОперации = ИДОперации;
		//Ресурсы
		Запись.ИДГруппы     	= ИДГруппы;
		Запись.Операция     	= ВидОперации;
		Запись.КлючОперации 	= КлючОперации;
		Запись.Сумма        	= СуммаПоДате;
		Запись.Документ     	= Документ;
		Запись.Страхователь 	= СтруктураПараметров.Страхователь; //TODO 
		Запись.Поставщик    	= СтруктураПараметров.Поставщик;
		Запись.Агент        	= СтруктураПараметров.агент;
		Запись.ДатаОперации 	= ДатаОперации; //TODO
		Запись.ОрганизацияАгент = СтруктураПараметров.ОрганизацияАгент;
		//Реквизиты
		Запись.ТипОперации = ТипОперации;
		Попытка
			Запись.Записать();
		Исключение
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи движения взаиморасчета "+Документ+" КлючОперации:"+КлючОперации+"/"+ОписаниеОшибки(),"",Истина,,,Документ,"Взаиморасчеты.Error");
		КонецПопытки;	
		Возврат Истина;//Успешно
	КонецЕсли;	
	Возврат Ложь;//Операция не произведена
	//---Взаиморасчеты по Группе полисов
	
КонецФункции

//Показывает взаиморасчеты связанные с указанными документом или УИД операции 
Функция ПоказатьВзаиморасчеты(Ссылка,Владелец = Неопределено) Экспорт
	Форма = ПолучитьОбщуюФорму("уб_ВзаиморасчетыПоГруппеПолисов");
	Форма.ОбъектВзаиморасчетов = Ссылка;
	Если НЕ Владелец = Неопределено Тогда
		Форма.ВладелецФормы = Владелец;
	КонецЕсли;	
	Форма.Открыть();
КонецФункции	

//Возвращает строку состояния взаиморасчетов по Отчету поставщику или в виде запроса с сформированной временной таблицей
//TODO Убрать 
Функция ПолучитьСостояниеОтчетаПоставщику(ОтчетПоставщику,ВТ = "нет", ИмяВТ = "ВТ_СостояниеОП", ДатаАктуальностиОтчетов = '20110101000000', ВидВзаиморасчетов = Неопределено, Знач Поставщик = Неопределено) Экспорт
	
	//ОтчетПоставщику  - отчет поставщику или ДВОУ/штраф
	//ФактЗадолженность - общая задолженность за минусом КВ в независимости от вида удержания
	//КоэфОплаченности - коэффициент оплаченности по общей задолженности <=1
	//КоэфОплаченностиВзноса - коэффициент оплаченности взносов поставщику <=1
	//КоэфОплаченностиКВ - коэффициент оплаченности КВ поставщиком <=1
	//Задолженность - задолженность по взносам/по штрафам, при виде взаиморасчетов с удержанием за минусом КВ с учетом оплаты поставщику
	//ЗадолженностьПоКВ - задолженность по КВ/ДВОУ, при виде взаиморасчетов с удержанием = 0 с учетом оплаты взносов
	//Начислено - задолженность по взносам, при виде взаиморасчетов с удержанием за минусом КВ
	//НачисленоПоКВ - задолженность по КВ/ДВОУ, при виде взаиморасчетов с удержанием = 0
	//НачисленоПоКВДляОтчета задолженность по КВ по реквизиту кв для отчета, при виде взаиморасчетов с удержанием = 0
	//Оплачено   - сумма платежей по направлению взаиморасчетов ПеречислениеПоставщику/ПеречислениеПоставщикуСтрахователем
	//ОплаченоКВ - сумма платежей по направлению взаиморасчетов ПоступлениеКВОтПоставщика 
	//Дата  - дата последнего платежа в независимости от направления,
	//АльтернативноеУдержаниеДопКВ - признак альтернативного удержания доп КВ (перебрасывается/уточнить), устанавливается в карточке поставщику,
	//Баланс_Брокер_Поставщик - итог по полям оплат полисов/при отрицательном сигнализирует, что преимущественно в отчете оплата поставщику напрямую,
	//НачисленнаяСуммаВзноса - итог по полю ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику оплат полисов,
	//КВСуммаДляОтчета - итог по полю КВСуммаДляОтчета,
	//КВСумма - итог по полю КВСумма,
	//ДопКВ - итог по полю КВСумма-КВСуммаДляОтчета,
	//ОтчетПоставщикуДата -  Дата отчета поставщику,
	//ОтчетПоставщикуНомер - Системный номер
	//НомерОтчетаПоставщику - номер для поставщика,
	//ВидВзаиморасчета  - вид взаиморасчетов по отчету   
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Итоги.ОтчетПоставщику,
	|	СУММА(Итоги.Задолженность - Итоги.ЗадолженностьПоКВ) КАК ФактЗадолженность,
	|	СУММА(Итоги.Задолженность) КАК Задолженность,
	|	СУММА(Итоги.ЗадолженностьПоКВ) КАК ЗадолженностьПоКВ,
	|	СУММА(Итоги.Начислено) КАК Начислено,
	|	СУММА(Итоги.НачисленоПоКВ) КАК НачисленоПоКВ,
	|	СУММА(Итоги.НачисленоПоКВДляОтчета) КАК НачисленоПоКВДляОтчета,
	|	СУММА(Итоги.Оплачено) КАК Оплачено,
	|	СУММА(Итоги.ОплаченоКВ) КАК ОплаченоКВ,
	|	СУММА(Итоги.ОплаченоФакт) КАК ОплаченоКлиентомФакт,
	|	СУММА(Итоги.СкидкаКлиенту) КАК СкидкаКлиенту,
	|	МАКСИМУМ(Итоги.Дата) КАК Дата,
	|	МАКСИМУМ(Итоги.ОтчетПоставщику.Поставщик.АльтернативноеУдержаниеДопКВ) КАК АльтернативноеУдержаниеДопКВ,
	|	СУММА(Итоги.Баланс_Брокер_Поставщик) КАК Баланс_Брокер_Поставщик,
	|	СУММА(Итоги.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	СУММА(Итоги.КВСуммаДляОтчета) КАК КВСуммаДляОтчета,
	|	СУММА(Итоги.КВСумма) КАК КВСумма,
	|	МАКСИМУМ(Итоги.ОтчетПоставщикуДата) КАК ОтчетПоставщикуДата,
	|	МАКСИМУМ(Итоги.ОтчетПоставщикуНомер) КАК ОтчетПоставщикуНомер,
	|	ЕСТЬNULL(Итоги.ОтчетПоставщику.НомерОтчетаПоставщику, """") КАК НомерОтчетаПоставщику,
	|	ЕСТЬNULL(Итоги.ОтчетПоставщику.ВидВзаиморасчета, """") КАК ВидВзаиморасчета
	|ПОМЕСТИТЬ ВТ_СостояниеПромежуточная
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОплатыПолисов.ОтчетПоставщику КАК ОтчетПоставщику,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	|						ТОГДА ОплатыПолисов.КВСумма
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	|						ТОГДА 0
	|					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	|						ТОГДА ОплатыПолисов.КВСумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК Задолженность,
	|		СУММА(ОплатыПолисов.ОплаченоФакт) КАК ОплаченоФакт,
	|		СУММА(ОплатыПолисов.АВилиСкидкаСумма) КАК СкидкаКлиенту,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма - ВЫБОР
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	|						ТОГДА ОплатыПолисов.КВСумма
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	|						ТОГДА 0
	|					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	|						ТОГДА ОплатыПолисов.КВСумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоКВ,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	|						ТОГДА ОплатыПолисов.КВСумма
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	|						ТОГДА 0
	|					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	|						ТОГДА ОплатыПолисов.КВСумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК Начислено,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику) КАК ЧИСЛО(15, 2)) КАК НачисленнаяСуммаВзноса,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма - ВЫБОР
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	|						ТОГДА ОплатыПолисов.КВСумма
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	|						ТОГДА 0
	|					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СУдержаниемКВ)
	|						ТОГДА ОплатыПолисов.КВСумма
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК НачисленоПоКВ,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСуммаДляОтчета - ВЫБОР
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ИСТИНА
	|						ТОГДА ОплатыПолисов.КВСуммаДляОтчета
	|					КОГДА &ВидВзаиморасчетовСУдержаниемКВ = ЛОЖЬ
	|						ТОГДА 0
	|					КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	|						ТОГДА ОплатыПолисов.КВСуммаДляОтчета
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК НачисленоПоКВДляОтчета,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСумма) КАК ЧИСЛО(15, 2)) КАК КВСумма,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.КВСуммаДляОтчета) КАК ЧИСЛО(15, 2)) КАК КВСуммаДляОтчета,
	|		0 КАК Оплачено,
	|		0 КАК ОплаченоКВ,
	|		ВЫРАЗИТЬ(СУММА(ОплатыПолисов.Баланс_Брокер_Поставщик) КАК ЧИСЛО(15, 2)) КАК Баланс_Брокер_Поставщик,
	|		NULL КАК Дата,
	|		МАКСИМУМ(ОплатыПолисов.ОтчетПоставщику.Номер) КАК ОтчетПоставщикуНомер,
	|		МАКСИМУМ(ОплатыПолисов.ОтчетПоставщику.Дата) КАК ОтчетПоставщикуДата
	|	ИЗ
	|		Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	|	ГДЕ
	|		НЕ ОплатыПолисов.ПометкаУдаления
	|		И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
	|		И НЕ ОплатыПолисов.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	|		И &УсловиеГде1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОплатыПолисов.ОтчетПоставщику
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлатежныеВедомости.ОтчетПоставщику,
	|		ВЫБОР
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	|				ТОГДА -ПлатежныеВедомости.Сумма
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	|				ТОГДА ПлатежныеВедомости.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	|				ТОГДА -ПлатежныеВедомости.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	|				ТОГДА ПлатежныеВедомости.Сумма
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
	|				ТОГДА -ПлатежныеВедомости.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	|				ТОГДА ПлатежныеВедомости.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		ПлатежныеВедомости.Ссылка.Дата,
	|		ПлатежныеВедомости.ОтчетПоставщику.Номер,
	|		ПлатежныеВедомости.ОтчетПоставщику.Дата
	|	ИЗ
	|		Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
	|	ГДЕ
	|		НЕ ПлатежныеВедомости.Ссылка.ПометкаУдаления
	|		И НЕ ПлатежныеВедомости.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	|		И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
	|		И ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	|		И &УсловиеГде2
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДВОУ.Ссылка,
	|		ВЫБОР
	|			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	|				ТОГДА ДВОУ.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	|				ТОГДА ДВОУ.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
	|				ТОГДА ДВОУ.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		ВЫБОР
	|			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	|				ТОГДА ДВОУ.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ДВОУ)
	|				ТОГДА ДВОУ.СуммаДокумента
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ДВОУ.Ссылка.Дата,
	|		ДВОУ.ВнешнийНомер,
	|		ДВОУ.Дата
	|	ИЗ
	|		Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
	|	ГДЕ
	|		НЕ ДВОУ.Ссылка.ПометкаУдаления
	|		И &УсловиеГде3) КАК Итоги
	|
	|СГРУППИРОВАТЬ ПО
	|	Итоги.ОтчетПоставщику,
	|	ЕСТЬNULL(Итоги.ОтчетПоставщику.НомерОтчетаПоставщику, """"),
	|	ЕСТЬNULL(Итоги.ОтчетПоставщику.ВидВзаиморасчета, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СостояниеОП.ОтчетПоставщику,
	|	ВТ_СостояниеОП.ФактЗадолженность,
	|	ВЫБОР
	|		КОГДА ВТ_СостояниеОП.ФактЗадолженность = 0
	|				ИЛИ ВТ_СостояниеОП.Начислено - ВТ_СостояниеОП.НачисленоПоКВ = 0
	|			ТОГДА 1
	|		ИНАЧЕ (ВТ_СостояниеОП.Оплачено - ВТ_СостояниеОП.ОплаченоКВ) / (ВТ_СостояниеОП.Начислено - ВТ_СостояниеОП.НачисленоПоКВ)
	|	КОНЕЦ КАК КоэфОплаченности,
	|	ВЫБОР
	|		КОГДА ВТ_СостояниеОП.Задолженность = 0
	|				ИЛИ ВТ_СостояниеОП.Начислено = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_СостояниеОП.Оплачено / ВТ_СостояниеОП.Начислено
	|	КОНЕЦ КАК КоэфОплаченностиВзноса,
	|	ВЫБОР
	|		КОГДА ВТ_СостояниеОП.ЗадолженностьПоКВ = 0
	|				ИЛИ ВТ_СостояниеОП.НачисленоПоКВ = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_СостояниеОП.ОплаченоКВ / ВТ_СостояниеОП.НачисленоПоКВ
	|	КОНЕЦ КАК КоэфОплаченностиКВ,
	|	ВТ_СостояниеОП.Задолженность,
	|	ВТ_СостояниеОП.ЗадолженностьПоКВ,
	|	ВТ_СостояниеОП.Начислено,
	|	ВТ_СостояниеОП.НачисленоПоКВ,
	|	ВТ_СостояниеОП.НачисленоПоКВДляОтчета,
	|	ВТ_СостояниеОП.Оплачено,
	|	ВТ_СостояниеОП.ОплаченоКВ,
	|	ВТ_СостояниеОП.Дата,
	|	ВТ_СостояниеОП.АльтернативноеУдержаниеДопКВ,
	|	ВТ_СостояниеОП.Баланс_Брокер_Поставщик,
	|	ВТ_СостояниеОП.НачисленнаяСуммаВзноса,
	|	ВТ_СостояниеОП.КВСуммаДляОтчета,
	|	ВТ_СостояниеОП.КВСумма,
	|	ВТ_СостояниеОП.КВСумма - ВТ_СостояниеОП.КВСуммаДляОтчета КАК ДопКВ,
	|	ВТ_СостояниеОП.ОтчетПоставщикуДата,
	|	ВТ_СостояниеОП.ОтчетПоставщикуНомер,
	|	ВТ_СостояниеОП.НомерОтчетаПоставщику,
	|	ВТ_СостояниеОП.ВидВзаиморасчета,
	|	ВТ_СостояниеОП.ОплаченоКлиентомФакт,
	|	ВТ_СостояниеОП.СкидкаКлиенту
	|ИЗ
	|	ВТ_СостояниеПромежуточная КАК ВТ_СостояниеОП";
	Если НЕ ВТ="нет" Тогда
		ПозПервогоИЗ = Найти(ТекстЗапроса,"ИЗ
	|	ВТ_СостояниеПромежуточная");
		ТекстЗапроса = Лев(ТекстЗапроса, ПозПервогоИЗ-1)+"ПОМЕСТИТЬ " + ИмяВТ + " 
		|ИЗ"+Сред(ТекстЗапроса,ПозПервогоИЗ+2);
	КонецЕсли;
	Если ОтчетПоставщику = Неопределено Тогда
		СтрокаЗамены1 = "ОплатыПолисов.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	|		И ОплатыПолисов.ОтчетПоставщику.Дата > &ДатаАктуальностиОтчетов";
		СтрокаЗамены2 = "ПлатежныеВедомости.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
	|		И ПлатежныеВедомости.ОтчетПоставщику.Дата > &ДатаАктуальностиОтчетов";
		СтрокаЗамены3 = "ДВОУ.Дата > &ДатаАктуальностиОтчетов"
	Иначе
		СтрокаЗамены1 = "&ОтчетПоставщику = ВЫБОР КОГДА &ЭтоПоставщикДляОтчетаПоКарточкам = ИСТИНА
			|		ТОГДА ОплатыПолисов.ОтчетПоКарточкам.Ссылка
			|	ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Ссылка
			|КОНЕЦ";
		СтрокаЗамены2 = "ПлатежныеВедомости.ОтчетПоставщику = &ОтчетПоставщику";
		СтрокаЗамены3 = "ДВОУ.Ссылка = &ОтчетПоставщику";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде1", 	СтрокаЗамены1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде2", 	СтрокаЗамены2);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеГде3", 	СтрокаЗамены3);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОтчетПоставщику", ОтчетПоставщику);
	Если ОтчетПоставщику <> Неопределено Тогда
		Если Поставщик = Неопределено Тогда
			Поставщик = ОтчетПоставщику.Поставщик;
		КонецЕсли;
		Запрос.УстановитьПараметр("ЭтоПоставщикДляОтчетаПоКарточкам", Поставщик = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам);
	КонецЕсли;
	//В объекте может быть другой вид взаиморасчетов в отличии от ссылки
	Если ЗначениеЗаполнено(ВидВзаиморасчетов) Тогда
		Запрос.УстановитьПараметр("ВидВзаиморасчетовСУдержаниемКВ", ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.СудержаниемКВ);
	Иначе
		Запрос.УстановитьПараметр("ВидВзаиморасчетовСУдержаниемКВ", Неопределено);
	КонецЕсли;
	//Если ОтчетПоставщику = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаАктуальностиОтчетов",ДатаАктуальностиОтчетов);//раньше не актуально
	//КонецЕсли;
	Если ВТ = "нет" Тогда
		Таблица = Запрос.Выполнить().Выгрузить();		
		Если ОтчетПоставщику <> Неопределено Тогда
			Если Таблица.Количество() = 0 Тогда
				Таблица.Добавить();
			КонецЕсли;
			Результат = Таблица[0];
		Иначе
			Результат = Таблица;
		КонецЕсли;
	ИначеЕсли ВТ = "да" Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Результат = Запрос.Выполнить();
	Иначе
		//не выполняем запрос
		Результат = Запрос;
	КонецЕсли;
	Возврат Результат;

КонецФункции	

Функция ПолучитьУИДГруппыПоКлючуОперации (КлючОперации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ Различные
	              |	уб_ВзаиморасчетыПоДоговору.ИДГруппы
	              |ИЗ
	              |	РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	              |ГДЕ
	              |	уб_ВзаиморасчетыПоДоговору.КлючОперации = &КлючОперации";
	Запрос.УстановитьПараметр("КлючОперации",КлючОперации);			  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Количество()>1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По переданному КлючОперации: " + КлючОперации+" обнаружено несколько групп взаиморасчетов!";
			Сообщение.Сообщить();		
		КонецЕсли;	
		Возврат Выборка.ИДГруппы;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьУИДГруппыПоДокументу (Документ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	Группы.ИДГруппы
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы
	              |	ИЗ
	              |		РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	              |	ГДЕ
	              |		уб_ВзаиморасчетыПоДоговору.Документ = &Документ
	              |	
	              |	ОБЪЕДИНИТЬ ВСЕ
	              |	
	              |	ВЫБРАТЬ
	              |		уб_ВзаиморасчетыПоДоговору.ИДГруппы
	              |	ИЗ
	              |		РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
	              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	              |			ПО уб_КвитовкаОплат.УИДСтрокиТЧ = уб_ВзаиморасчетыПоДоговору.ИДОперации
	              |	ГДЕ
	              |		(уб_КвитовкаОплат.ОплатаПолиса = &Документ
	              |				ИЛИ уб_КвитовкаОплат.ПриемОплаты = &Документ)) КАК Группы";
	Запрос.УстановитьПараметр("Документ",Документ);			  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Количество()>1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По переданному документу: " + Документ+" обнаружено несколько групп взаиморасчетов!";
			Сообщение.КлючДанных = Документ.Ссылка;
			Сообщение.Сообщить();		
		КонецЕсли;	
		Возврат Выборка.ИДГруппы;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	
	
Функция СлияниеГрупп(УИДПриемник,УИДИсточник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ * 
	                      |ИЗ
	                      |	РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	                      |ГДЕ
	                      |	уб_ВзаиморасчетыПоДоговору.ИДГруппы = &ИДГруппы");
	Запрос.УстановитьПараметр("ИДГруппы",УИДИсточник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Счетчик = 0;
	Запись		= РегистрыСведений.уб_ВзаиморасчетыПоДоговору.СоздатьМенеджерЗаписи(); 
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик+1;
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.ИДГруппы = УИДПриемник;
			Попытка
				Запись.Записать()
			Исключение
				Возврат -1;
			КонецПопытки;	
        КонецЕсли;
			
	КонецЦикла;	
	Возврат Счетчик;
КонецФункции	

Функция ТекстЗапросаВзаиморасчеты2(Расчетно)
	ТекстЗапроса= ?(Расчетно , "ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	К.УИДСтрокиТЧ КАК УИДСтрокиТЧ,
						  |	К.ОплатаПолиса.Ссылка КАК ОплатаПолиса,
						  |	K2.Ведущая
						  |ПОМЕСТИТЬ ВедомыеСВедущими
						  |ИЗ
						  |	РегистрСведений.уб_КвитовкаОплат КАК К
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |			К2.ОплатаПолиса КАК ОплатаПолиса,
						  |			К3.Ведущий КАК Ведущая
						  |		ИЗ
						  |			РегистрСведений.уб_КвитовкаОплат КАК К2
						  |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |					К3.УИДСтрокиТЧ КАК УИДСтрокиТЧ,
						  |					К4.УИДСтрокиТЧ КАК Ведущий
						  |				ИЗ
						  |					РегистрСведений.уб_КвитовкаОплат КАК К3
						  |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_КвитовкаОплат КАК К4
						  |						ПО К3.ОплатаПолиса = К4.ОплатаПолиса
						  |							И (К4.ОплатаПолиса = &ОплатаПолиса
						  |								ИЛИ К4.ОплатаПолиса.СтраховойПолис = &СтраховойПолис)) КАК К3
						  |				ПО К2.УИДСтрокиТЧ = К3.УИДСтрокиТЧ) КАК K2
						  |		ПО К.ОплатаПолиса = K2.ОплатаПолиса
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	Квитовки.УИДСтрокиТЧ,
						  |	Квитовки.ОплатаПолиса,
						  |	Квитовки.Ведущая КАК Ведущая,
						  |	Квитовки.ОплатаПолиса.ОплаченоФакт КАК ОплаченоФакт,
						  |	Квитовки.ОплатаПолиса.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
						  |	Квитовки.ОплатаПолиса.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
						  |	ВЫБОР
						  |		КОГДА Квитовки.ОплатаПолиса.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоАВ)
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК ПоАВ,
						  |	Квитовки.ОплатаПолиса.СкидкаВыплаченаяКлиенту КАК СкидкаВыплаченаяКлиенту,
						  |	Приемки.Сумма КАК СуммаПриемка,
						  |	Приемки.Ссылка КАК Приемка
						  |ПОМЕСТИТЬ КвитовкиИСуммы
						  |ИЗ
						  |	ВедомыеСВедущими КАК Квитовки
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |			МИНИМУМ(Квитовки.УИДСтрокиТЧ) КАК УИДСтрокиТЧ,
						  |			Квитовки.Ведущая КАК Ведущая
						  |		ИЗ
						  |			ВедомыеСВедущими КАК Квитовки
						  |		
						  |		СГРУППИРОВАТЬ ПО
						  |			Квитовки.Ведущая) КАК ЗаменаВедущегоНаМИНИМУМ
						  |		ПО (ЗаменаВедущегоНаМИНИМУМ.УИДСтрокиТЧ = Квитовки.Ведущая)
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_ПриемкаОплат.Полисы КАК Приемки
						  |		ПО (Приемки.УИДСтроки = Квитовки.УИДСтрокиТЧ)
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
						  |	СжатыеПоГруппам.Ведущая КАК Ведущая,
						  |	СжатыеПоГруппам.Операция,
						  |	СжатыеПоГруппам.Сумма,
						  |	СжатыеПоГруппам.Документ,
						  |	ВЫБОР
						  |		КОГДА ВЫБОР
						  |				КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |					ТОГДА СжатыеПоГруппам.Документ.СостояниеПолиса
						  |				КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  |					ТОГДА СжатыеПоГруппам.Документ.СтраховойПолис.СостояниеПолиса
						  |			КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК Аннулирован,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.СостояниеПолиса
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  |			ТОГДА СжатыеПоГруппам.Документ.СтраховойПолис.СостояниеПолиса
						  |	КОНЕЦ КАК Состояние,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Страхователь
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Страхователь
						  |	КОНЕЦ КАК Страхователь,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.СтраховаяПремия
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.СтраховаяПремия
						  |	КОНЕЦ КАК СтраховаяПремия,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис
						  |	КОНЕЦ КАК СтраховойПолис,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Поставщик
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Поставщик
						  |	КОНЕЦ КАК ПоставщикСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.ОрганизацияАгент
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.ОрганизацияАгент
						  |	КОНЕЦ КАК ОрганизацияАгентСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Агент
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Агент
						  |	КОНЕЦ КАК АгентСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Дата
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Дата
						  |	КОНЕЦ КАК ДатаСП,
						  |	СжатыеПоГруппам.Документ.Поставщик КАК Поставщик,
						  |	СжатыеПоГруппам.Документ.ОрганизацияАгент КАК ОрганизацияАгент,
						  |	СжатыеПоГруппам.Документ.Агент КАК Агент,
						  |	СжатыеПоГруппам.Документ.Дата КАК ДатаОперации
						  |ПОМЕСТИТЬ ВзаиморасчетыПОУИД
						  |ИЗ
						  |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая КАК Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса) КАК Операция,
						  |		КвитовкиИСуммы.НачисленнаяСуммаВзноса КАК Сумма,
						  |		КвитовкиИСуммы.ОплатаПолиса.Ссылка КАК Документ
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ВЫБОР
						  |			КОГДА КвитовкиИСуммы.ПоАВ
						  |				ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.УдержаноМенеджеромИзДСКлиента)
						  |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ)
						  |		КОНЕЦ,
						  |		ВЫБОР
						  |			КОГДА КвитовкиИСуммы.ПоАВ
						  |				ТОГДА КвитовкиИСуммы.НачисленнаяСуммаВзноса - КвитовкиИСуммы.ОплатаПолиса.ОплаченоФакт
						  |			ИНАЧЕ КвитовкиИСуммы.АВилиСкидкаСумма
						  |		КОНЕЦ,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.АВилиСкидкаСумма <> 0
						  |		И КвитовкиИСуммы.НачисленнаяСуммаВзноса - КвитовкиИСуммы.ОплатаПолиса.ОплаченоФакт <> 0
						  |		И НЕ(НЕ КвитовкиИСуммы.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
						  |					И КвитовкиИСуммы.ОплатаПолиса.СтраховойПолис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
						  |					И КвитовкиИСуммы.ОплатаПолиса.ОплаченоФакт = 0)
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса),
						  |		-ВЫБОР
						  |			КОГДА КвитовкиИСуммы.ПоАВ
						  |				ТОГДА КвитовкиИСуммы.НачисленнаяСуммаВзноса
						  |			ИНАЧЕ КвитовкиИСуммы.АВилиСкидкаСумма
						  |		КОНЕЦ,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.АВилиСкидкаСумма <> 0
						  |		И НЕ КвитовкиИСуммы.ОплатаПолиса.НеВключатьВОтчетыПоставщикам
						  |		И КвитовкиИСуммы.ОплатаПолиса.СтраховойПолис.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
						  |		И КвитовкиИСуммы.ОплатаПолиса.ОплаченоФакт = 0
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеВМ),
						  |		КвитовкиИСуммы.АВилиСкидкаСумма,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.АВилиСкидкаСумма <> 0
						  |		И КвитовкиИСуммы.ПоАВ
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту),
						  |		КвитовкиИСуммы.СкидкаВыплаченаяКлиенту,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.СкидкаВыплаченаяКлиенту <> 0
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ВЫБОР
						  |			КОГДА КвитовкиИСуммы.Приемка.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)
						  |				ТОГДА ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаПоставщиком)
						  |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером)
						  |		КОНЕЦ,
						  |		КвитовкиИСуммы.СуммаПриемка,
						  |		КвитовкиИСуммы.Приемка
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.СуммаПриемка <> 0
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера),
						  |		КвитовкиИСуммы.ОплатаПолиса.КВСумма,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.ОплатаПолиса.КВСумма > 0
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.УдержаниеИзВМ),
						  |		КвитовкиИСуммы.ОплатаПолиса.ВычетСАгента,
						  |		КвитовкиИСуммы.ОплатаПолиса
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		КвитовкиИСуммы.ОплатаПолиса.ВычетСАгента > 0
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |		КвитовкиИСуммы.Ведущая,
						  |		ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СозданиеСтраховогоПолиса),
						  |		0,
						  |		КвитовкиИСуммы.ОплатаПолиса.СтраховойПолис
						  |	ИЗ
						  |		КвитовкиИСуммы КАК КвитовкиИСуммы
						  |	ГДЕ
						  |		НЕ КвитовкиИСуммы.ОплатаПолиса.СтраховойПолис = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)) КАК СжатыеПоГруппам
						  |;
						  |",
						  ///////////////////////////////////////Второй запрос
						  "ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	Группы.ИДГруппы
						  |ПОМЕСТИТЬ УИДГРУППЫ
						  |ИЗ
						  |	(ВЫБРАТЬ
						  |		уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы
						  |	ИЗ
						  |		РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
						  |	ГДЕ
						  |		уб_ВзаиморасчетыПоДоговору.Документ = &Документ
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |	
						  |	ВЫБРАТЬ
						  |		уб_ВзаиморасчетыПоДоговору.ИДГруппы
						  |	ИЗ
						  |		РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
						  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
						  |			ПО уб_КвитовкаОплат.УИДСтрокиТЧ = уб_ВзаиморасчетыПоДоговору.ИДОперации
						  |	ГДЕ
						  |		(уб_КвитовкаОплат.ОплатаПолиса = &Документ
						  |				ИЛИ уб_КвитовкаОплат.ПриемОплаты = &Документ)) КАК Группы
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
						  |	СжатыеПоГруппам.ИДОперации КАК Ведущая,
						  |	СжатыеПоГруппам.Операция,
						  |	СжатыеПоГруппам.Сумма,
						  |	СжатыеПоГруппам.Документ,
						  |	ВЫБОР
						  |		КОГДА ВЫБОР
						  |				КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |					ТОГДА СжатыеПоГруппам.Документ.СостояниеПолиса
						  |				КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  |					ТОГДА СжатыеПоГруппам.Документ.СтраховойПолис.СостояниеПолиса
						  |			КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК Аннулирован,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.СостояниеПолиса
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  |			ТОГДА СжатыеПоГруппам.Документ.СтраховойПолис.СостояниеПолиса
						  |	КОНЕЦ КАК Состояние,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Страхователь
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Страхователь
						  |	КОНЕЦ КАК Страхователь,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.СтраховаяПремия
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.СтраховаяПремия
						  |	КОНЕЦ КАК СтраховаяПремия,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис
						  |	КОНЕЦ КАК СтраховойПолис,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Поставщик
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Поставщик
						  |	КОНЕЦ КАК ПоставщикСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.ОрганизацияАгент
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.ОрганизацияАгент
						  |	КОНЕЦ КАК ОрганизацияАгентСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Агент
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Агент
						  |	КОНЕЦ КАК АгентСП,
						  |	ВЫБОР
						  |		КОГДА СжатыеПоГруппам.Документ ССЫЛКА Документ.уб_СтраховойПолис
						  |			ТОГДА СжатыеПоГруппам.Документ.Дата
						  |		ИНАЧЕ СжатыеПоГруппам.Документ.СтраховойПолис.Дата
						  |	КОНЕЦ КАК ДатаСП,
						  |	СжатыеПоГруппам.Документ.Поставщик КАК Поставщик,
						  |	СжатыеПоГруппам.Документ.ОрганизацияАгент КАК ОрганизацияАгент,
						  |	СжатыеПоГруппам.Документ.Агент КАК Агент,
						  |	СжатыеПоГруппам.ДатаОперации КАК ДатаОперации
						  |ПОМЕСТИТЬ ВзаиморасчетыПОУИД
						  |ИЗ
						  |	РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК СжатыеПоГруппам
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УИДГРУППЫ КАК УИДГРУППЫ
						  |		ПО СжатыеПоГруппам.ИДГруппы = УИДГРУППЫ.ИДГруппы
						  |;
						  |");
	Запрос = Новый Запрос(ТекстЗапроса+
						  "////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	ВзаиморасчетыПоУИД.ДатаОперации КАК ДатаОперации,
						  | ВзаиморасчетыПоУИД.Ведущая,
						  |	ВзаиморасчетыПоУИД.Операция,
						  |	ВзаиморасчетыПоУИД.Сумма,
						  |	ВзаиморасчетыПоУИД.Документ,
						  |	ВзаиморасчетыПоУИД.Страхователь,
						  |	ВзаиморасчетыПоУИД.Поставщик,
						  |	ВзаиморасчетыПоУИД.Агент,
						  |	ВзаиморасчетыПоУИД.ОрганизацияАгент,
						  |	ЕСТЬNULL(ВзаиморасчетыПоУИД.Документ.НеВключатьВОтчетыПоставщикам, ЛОЖЬ) КАК НеВключатьВОтчетыПоставщикам,
						  |	ВзаиморасчетыПоУИД.Документ.НеВключатьВОтчетыПоставщикам,
						  |	ЕСТЬNULL(ВзаиморасчетыПоУИД.Документ.ИсключитьИзРасчетаЗП, ЛОЖЬ) КАК ИсключитьИзРасчетаЗП,
						  |	ВзаиморасчетыПоУИД.Аннулирован КАК Аннулирован,
						  |	ВзаиморасчетыПоУИД.Состояние КАК Состояние,
						  |	ВзаиморасчетыПоУИД.Операция.Клиент КАК ВзКлиент,
						  |	ВзаиморасчетыПоУИД.Операция.Поставщик КАК ВзПоставщик,
						  |	ВзаиморасчетыПоУИД.Операция.Агент КАК ВзАгент,
						  |	ВзаиморасчетыПоУИД.Операция.Касса КАК ВзКасса,
						  |	ВзаиморасчетыПоУИД.Операция.ДоходБрокера КАК ВзДоходБрокера,
						  |	ВЫБОР
						  |		КОГДА ВзаиморасчетыПоУИД.Документ.НеВключатьВОтчетыПоставщикам
						  |				И ВзаиморасчетыПоУИД.Операция.ИсключатьПриИсклОП
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК ИсключатьПриИсклОП,
						  |	ЕСТЬNULL(ВзаиморасчетыПоУИД.Документ.ОтчетПоставщику, ЛОЖЬ) КАК ОтчетПоставщику
						  |ПОМЕСТИТЬ Взаиморасчеты
						  |ИЗ
						  |	ВзаиморасчетыПОУИД КАК ВзаиморасчетыПоУИД
						  |;
						  |
						  //Заложить опционально
						  
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ РАЗЛИЧНЫЕ
						  //|	Взаиморасчеты.ОтчетПоставщику КАК ОтчетПоставщику
						  //|ПОМЕСТИТЬ ОтчетыПоставщику
						  //|ИЗ
						  //|	Взаиморасчеты КАК Взаиморасчеты
						  //|ГДЕ
						  //|	Взаиморасчеты.ОтчетПоставщику ССЫЛКА Документ.уб_ОтчетПоставщику
						  //|	И НЕ Взаиморасчеты.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
						  //|;
						  //|
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						  //|	Итоги.ОтчетПоставщику,
						  //|	СУММА(Итоги.Задолженность) КАК Задолженность,
						  //|	СУММА(Итоги.ЗадолженностьПоКВ) КАК ЗадолженностьКВ,
						  //|	СУММА(Итоги.Начислено) КАК Начислено,
						  //|	СУММА(Итоги.НачисленоПоКВ) КАК НачисленоКВ,
						  //|	СУММА(Итоги.Оплачено) КАК Оплачено,
						  //|	СУММА(Итоги.ОплаченоКВ) КАК ОплаченоКВ,
						  //|	МАКСИМУМ(Итоги.Дата) КАК Дата
						  //|ПОМЕСТИТЬ СостояниеОП
						  //|ИЗ
						  //|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
						  //|		ОплатыПолисов.ОтчетПоставщику КАК ОтчетПоставщику,
						  //|		СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
						  //|				КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
						  //|					ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
						  //|				ИНАЧЕ 0
						  //|			КОНЕЦ) КАК Задолженность,
						  //|		СУММА((ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))) - ВЫБОР
						  //|				КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
						  //|					ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
						  //|				ИНАЧЕ 0
						  //|			КОНЕЦ) КАК ЗадолженностьПоКВ,
						  //|		СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - ВЫБОР
						  //|				КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
						  //|					ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
						  //|				ИНАЧЕ 0
						  //|			КОНЕЦ) КАК Начислено,
						  //|		СУММА((ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))) - ВЫБОР
						  //|				КОГДА ОплатыПолисов.ОтчетПоставщику.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
						  //|					ТОГДА ВЫРАЗИТЬ(ОплатыПолисов.КВСумма КАК ЧИСЛО(15, 2))
						  //|				ИНАЧЕ 0
						  //|			КОНЕЦ) КАК НачисленоПоКВ,
						  //|		0 КАК Оплачено,
						  //|		0 КАК ОплаченоКВ,
						  //|		ДАТАВРЕМЯ(1, 1, 1) КАК Дата
						  //|	ИЗ
						  //|		ОтчетыПоставщику КАК ОтчетыПоставщику
						  //|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК ОплатыПолисов
						  //|			ПО (ОплатыПолисов.ОтчетПоставщику = ОтчетыПоставщику.ОтчетПоставщику)
						  //|	ГДЕ
						  //|		НЕ ОплатыПолисов.ПометкаУдаления
						  //|		И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
						  //|		И ВЫБОР
						  //|				КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
						  //|					ТОГДА ИСТИНА
						  //|				ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
						  //|			КОНЕЦ
						  //|	
						  //|	СГРУППИРОВАТЬ ПО
						  //|		ОплатыПолисов.ОтчетПоставщику
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		ПлатежныеВедомости.ОтчетПоставщику,
						  //|		ВЫБОР
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
						  //|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
						  //|				ТОГДА -ПлатежныеВедомости.Сумма
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
						  //|				ТОГДА ПлатежныеВедомости.Сумма
						  //|			ИНАЧЕ 0
						  //|		КОНЕЦ,
						  //|		ВЫБОР
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
						  //|				ТОГДА -ПлатежныеВедомости.Сумма
						  //|			ИНАЧЕ 0
						  //|		КОНЕЦ,
						  //|		0,
						  //|		0,
						  //|		ВЫБОР
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
						  //|					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
						  //|				ТОГДА ПлатежныеВедомости.Сумма
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
						  //|				ТОГДА -ПлатежныеВедомости.Сумма
						  //|			ИНАЧЕ 0
						  //|		КОНЕЦ,
						  //|		ВЫБОР
						  //|			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
						  //|				ТОГДА ПлатежныеВедомости.Сумма
						  //|			ИНАЧЕ 0
						  //|		КОНЕЦ,
						  //|		ПлатежныеВедомости.Ссылка.Дата
						  //|	ИЗ
						  //|		ОтчетыПоставщику КАК ОтчетыПоставщику
						  //|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
						  //|			ПО (ПлатежныеВедомости.ОтчетПоставщику = ОтчетыПоставщику.ОтчетПоставщику)
						  //|	ГДЕ
						  //|		НЕ ПлатежныеВедомости.Ссылка.ПометкаУдаления
						  //|		И ВЫБОР
						  //|				КОГДА ПлатежныеВедомости.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
						  //|					ТОГДА ИСТИНА
						  //|				ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Поставщик.ДатаВеденияВзаиморасчётов
						  //|			КОНЕЦ
						  //|		И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов) КАК Итоги
						  //|
						  //|СГРУППИРОВАТЬ ПО
						  //|	Итоги.ОтчетПоставщику
						  //|;
						  //|
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|УНИЧТОЖИТЬ ОтчетыПоставщику
						  //|;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
						  |	Взаиморасчеты.ДатаОперации КАК ДатаОперации,
						  | Взаиморасчеты.Ведущая,
						  |	Взаиморасчеты.Операция,
						  |	Взаиморасчеты.Сумма,
						  |	Взаиморасчеты.Документ,
						  |	Представление(Взаиморасчеты.Документ) как ДокументСтрока,
						  |	Взаиморасчеты.Документ.МоментВремени как МоментВремени,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ИсключатьПриИсклОП
						  |			ТОГДА 0
						  |		ИНАЧЕ Взаиморасчеты.Сумма * Взаиморасчеты.ВзКлиент
						  |	КОНЕЦ КАК ВзКлиент,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ИсключатьПриИсклОП
						  |			ТОГДА 0
						  |		ИНАЧЕ Взаиморасчеты.Сумма * Взаиморасчеты.ВзАгент
						  |	КОНЕЦ КАК ВзАгент,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ИсключатьПриИсклОП
						  |			ТОГДА 0
						  |		ИНАЧЕ Взаиморасчеты.Сумма * Взаиморасчеты.ВзКасса
						  |	КОНЕЦ КАК ВзКасса,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ИсключатьПриИсклОП
						  |			ТОГДА 0
						  |		ИНАЧЕ Взаиморасчеты.Сумма * Взаиморасчеты.ВзДоходБрокера
						  |	КОНЕЦ КАК ВзДоходБрокера,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ИсключатьПриИсклОП
						  |			ТОГДА 0
						  |		ИНАЧЕ Взаиморасчеты.Сумма * Взаиморасчеты.ВзПоставщик
						  |	КОНЕЦ КАК ВзПоставщик,
						  |	Взаиморасчеты.Страхователь,
						  |	Взаиморасчеты.Поставщик,
						  |	Взаиморасчеты.Агент,
						  |	Взаиморасчеты.ОрганизацияАгент,
						  |	Взаиморасчеты.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
						  |	Взаиморасчеты.Документ.НеВключатьВОтчетыПоставщикам,
						  |	Взаиморасчеты.ИсключитьИзРасчетаЗП КАК ИсключитьИзРасчетаЗП,
						  |	Взаиморасчеты.Аннулирован КАК Аннулирован,
						  |	Взаиморасчеты.Состояние,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  |				И Взаиморасчеты.Документ.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК НетОП,
						  |	Взаиморасчеты.ОтчетПоставщику,
						  |	NULL КАК ОтчетПоставщику1,
						  |	NULL КАК Задолженность,
						  |	NULL КАК ЗадолженностьКВ,
						  |	NULL КАК Начислено,
						  |	NULL КАК НачисленоКВ,
						  |	NULL КАК Оплачено,
						  |	NULL КАК ОплаченоКВ,
						  |	NULL КАК Дата,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ВзКлиент <> 0
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК флКлиент,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ВзПоставщик <> 0
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК флПоставщик,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ВзАгент <> 0
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК флАгент,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ВзКасса <> 0
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК флКасса,
						  |	ВЫБОР
						  |		КОГДА Взаиморасчеты.ВзДоходБрокера <> 0
						  |			ТОГДА ИСТИНА
						  |		ИНАЧЕ ЛОЖЬ
						  |	КОНЕЦ КАК флДоходБрокера
						  |ИЗ
						  |	Взаиморасчеты КАК Взаиморасчеты
						  |
						  //|ОБЪЕДИНИТЬ ВСЕ
						  //|
						  //|ВЫБРАТЬ РАЗЛИЧНЫЕ
						  //|	ЕСТЬNULL(СостояниеОП.Дата, Взаиморасчеты.ДатаОперации),
						  //| Взаиморасчеты.Ведущая,
						  //|	ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПеречисленоПоставщику),
						  //|	Взаиморасчеты.Сумма,
						  //|	Взаиморасчеты.Документ,
						  //|	Представление(Взаиморасчеты.Документ) как ДокументСтрока,
						  //|	Взаиморасчеты.Документ.МоментВремени как МоментВремени,
						  //|	0,
						  //|	0,
						  //|	ВЫБОР
						  //|		КОГДА СостояниеОП.Задолженность = 0
						  //|			ТОГДА Взаиморасчеты.Сумма - ВЫБОР
						  //|					КОГДА СостояниеОП.НачисленоКВ = 0
						  //|						ТОГДА Взаиморасчеты.Документ.КВСумма
						  //|					ИНАЧЕ 0
						  //|				КОНЕЦ
						  //|		ИНАЧЕ ВЫРАЗИТЬ(СостояниеОП.Оплачено * (Взаиморасчеты.Сумма - ВЫБОР
						  //|					КОГДА СостояниеОП.НачисленоКВ = 0
						  //|						ТОГДА Взаиморасчеты.Документ.КВСумма
						  //|					ИНАЧЕ 0
						  //|				КОНЕЦ) / СостояниеОП.Начислено КАК ЧИСЛО(15, 2))
						  //|	КОНЕЦ,
						  //|	0,
						  //|	ВЫБОР
						  //|		КОГДА СостояниеОП.Задолженность = 0
						  //|			ТОГДА -(Взаиморасчеты.Сумма - ВЫБОР
						  //|					КОГДА СостояниеОП.НачисленоКВ = 0
						  //|						ТОГДА Взаиморасчеты.Документ.КВСумма
						  //|					ИНАЧЕ 0
						  //|				КОНЕЦ)
						  //|		ИНАЧЕ -(ВЫРАЗИТЬ(СостояниеОП.Оплачено * (Взаиморасчеты.Сумма - ВЫБОР
						  //|					КОГДА СостояниеОП.НачисленоКВ = 0
						  //|						ТОГДА Взаиморасчеты.Документ.КВСумма
						  //|					ИНАЧЕ 0
						  //|				КОНЕЦ) / СостояниеОП.Начислено КАК ЧИСЛО(15, 2)))
						  //|	КОНЕЦ,
						  //|	Взаиморасчеты.Страхователь,
						  //|	Взаиморасчеты.Поставщик,
						  //|	Взаиморасчеты.Агент,
						  //|	Взаиморасчеты.ОрганизацияАгент,
						  //|	Взаиморасчеты.НеВключатьВОтчетыПоставщикам,
						  //|	Взаиморасчеты.Документ.НеВключатьВОтчетыПоставщикам,
						  //|	Взаиморасчеты.ИсключитьИзРасчетаЗП,
						  //|	Взаиморасчеты.Аннулирован,
						  //|	Взаиморасчеты.Состояние,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  //|				И Взаиморасчеты.Документ.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	Взаиморасчеты.ОтчетПоставщику,
						  //|	СостояниеОП.ОтчетПоставщику,
						  //|	СостояниеОП.Задолженность,
						  //|	СостояниеОП.ЗадолженностьКВ,
						  //|	СостояниеОП.Начислено,
						  //|	СостояниеОП.НачисленоКВ,
						  //|	СостояниеОП.Оплачено,
						  //|	СостояниеОП.ОплаченоКВ,
						  //|	СостояниеОП.Дата,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзКлиент <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзПоставщик <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзАгент <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзКасса <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзДоходБрокера <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ
						  //|ИЗ
						  //|	Взаиморасчеты КАК Взаиморасчеты
						  //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СостояниеОП КАК СостояниеОП
						  //|		ПО Взаиморасчеты.ОтчетПоставщику = СостояниеОП.ОтчетПоставщику
						  //|ГДЕ
						  //|	Взаиморасчеты.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса)
						  //|	И Взаиморасчеты.Сумма > 0
						  //|	И НЕ СостояниеОП.Оплачено = 0
						  
						  //Заложить опционально
						  
						  //|
						  //|ОБЪЕДИНИТЬ ВСЕ
						  //|
						  //|ВЫБРАТЬ РАЗЛИЧНЫЕ
						  //|	ЕСТЬNULL(СостояниеОП.Дата, Взаиморасчеты.ДатаОперации),
						  //| Взаиморасчеты.Ведущая,
						  //|	ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПоставщикВыплатилКВ),
						  //|	Взаиморасчеты.Сумма,
						  //|	Взаиморасчеты.Документ,
						  //|	Представление(Взаиморасчеты.Документ) как ДокументСтрока,
						  //|	Взаиморасчеты.Документ.МоментВремени как МоментВремени,
						  //|	0,
						  //|	0,
						  //|	ВЫБОР
						  //|		КОГДА СостояниеОП.НачисленоКВ = 0
						  //|				И СостояниеОП.ОплаченоКВ = 0
						  //|			ТОГДА 0
						  //|		КОГДА СостояниеОП.ЗадолженностьКВ = 0
						  //|			ТОГДА -Взаиморасчеты.Сумма
						  //|		КОГДА СостояниеОП.НачисленоКВ = 0
						  //|			ТОГДА 0
						  //|		ИНАЧЕ -(ВЫРАЗИТЬ(СостояниеОП.ОплаченоКВ * Взаиморасчеты.Сумма / СостояниеОП.НачисленоКВ КАК ЧИСЛО(15, 2)))
						  //|	КОНЕЦ,
						  //|	0,
						  //|	ВЫБОР
						  //|		КОГДА СостояниеОП.НачисленоКВ = 0
						  //|				И СостояниеОП.ОплаченоКВ = 0
						  //|			ТОГДА 0
						  //|		КОГДА СостояниеОП.ЗадолженностьКВ = 0
						  //|			ТОГДА Взаиморасчеты.Сумма
						  //|		КОГДА СостояниеОП.НачисленоКВ = 0
						  //|			ТОГДА 0
						  //|		ИНАЧЕ ВЫРАЗИТЬ(СостояниеОП.ОплаченоКВ * Взаиморасчеты.Сумма / СостояниеОП.НачисленоКВ КАК ЧИСЛО(15, 2))
						  //|	КОНЕЦ,
						  //|	Взаиморасчеты.Страхователь,
						  //|	Взаиморасчеты.Поставщик,
						  //|	Взаиморасчеты.Агент,
						  //|	Взаиморасчеты.ОрганизацияАгент,
						  //|	Взаиморасчеты.НеВключатьВОтчетыПоставщикам,
						  //|	Взаиморасчеты.Документ.НеВключатьВОтчетыПоставщикам,
						  //|	Взаиморасчеты.ИсключитьИзРасчетаЗП,
						  //|	Взаиморасчеты.Аннулирован,
						  //|	Взаиморасчеты.Состояние,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_ОплатаПолисов
						  //|				И Взаиморасчеты.Документ.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	Взаиморасчеты.ОтчетПоставщику,
						  //|	СостояниеОП.ОтчетПоставщику,
						  //|	СостояниеОП.Задолженность,
						  //|	СостояниеОП.ЗадолженностьКВ,
						  //|	СостояниеОП.Начислено,
						  //|	СостояниеОП.НачисленоКВ,
						  //|	СостояниеОП.Оплачено,
						  //|	СостояниеОП.ОплаченоКВ,
						  //|	СостояниеОП.Дата,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзКлиент <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзПоставщик <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзАгент <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзКасса <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ,
						  //|	ВЫБОР
						  //|		КОГДА Взаиморасчеты.ВзДоходБрокера <> 0
						  //|			ТОГДА ИСТИНА
						  //|		ИНАЧЕ ЛОЖЬ
						  //|	КОНЕЦ
						  //|ИЗ
						  //|	Взаиморасчеты КАК Взаиморасчеты
						  //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СостояниеОП КАК СостояниеОП
						  //|		ПО Взаиморасчеты.ОтчетПоставщику = СостояниеОП.ОтчетПоставщику
						  //|ГДЕ
						  //|	Взаиморасчеты.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера)
						  //|	И Взаиморасчеты.Сумма > 0
						  //|	И НЕ(СостояниеОП.НачисленоКВ = 0
						  //|				И СостояниеОП.ОплаченоКВ = 0)
						  |");
	Возврат ТекстЗапроса;
КонецФункции	

//Основной запрос по группе взаиморасчетов
//В дальнейшем по нему же должны анализироваться взаиморасчеты по компании/области взаиморасчетов в целом

Функция ТекстЗапросаВзаиморасчеты(Расчетно)
	ТекстЗапроса =  "ВЫБРАТЬ
	                |	Взаиморасчеты.ИДГруппы,
	                |	Взаиморасчеты.КлючОперации,
	                |	Взаиморасчеты.Операция,
	                |	Взаиморасчеты.ИДОперации,
	                |	Взаиморасчеты.Сумма,
	                |	Взаиморасчеты.Документ,
	                |	Взаиморасчеты.Страхователь,
	                |	Взаиморасчеты.Поставщик,
	                |	Взаиморасчеты.Агент,
	                |	Взаиморасчеты.ДатаОперации,
	                |	Взаиморасчеты.ОрганизацияАгент,
	                |	Взаиморасчеты.ТипОперации,
	                |	ВЫБОР
	                |		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_ОплатаПолисов
	                |			ТОГДА 0
	                |		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_СтраховойПолис
	                |			ТОГДА 1
	                |		КОГДА Взаиморасчеты.Документ ССЫЛКА Документ.уб_ПриемкаОплат
	                |			ТОГДА 2
	                |	КОНЕЦ КАК ТипДокумента,
	                |	рПолиса.СостояниеПолиса КАК СостояниеПолисаСП,
	                |	рПолиса.Страхователь КАК СтраховательСП,
	                |	рПолиса.Агент КАК АгентСП,
	                |	рПолиса.Поставщик КАК ПоставщикСП,
	                |	рПолиса.ОрганизацияАгент КАК ОрганизацияАгентСП,
	                |	рПолиса.СтраховаяПремия КАК СтраховаяПремияСП,
	                |	рПолиса.Дата КАК ДатаСП,
	                |	рПолисаОплаты.СостояниеПолиса КАК СостояниеПолисаСП2,
	                |	рПолисаОплаты.Страхователь КАК СтраховательСП2,
	                |	рПолисаОплаты.Поставщик КАК ПоставщикСП2,
	                |	рПолисаОплаты.Агент КАК АгентСП2,
	                |	рПолисаОплаты.ОрганизацияАгент КАК ОрганизацияАгентСП2,
	                |	рПолисаОплаты.СтраховаяПремия КАК СтраховаяПремияСП2,
	                |	рПолисаОплаты.Дата КАК ДатаСП2,
	                |	рПолиса.МоментВремени КАК МоментВремениСП,
	                |	рОплаты.ОтчетПоставщику КАК ОтчетПоставщику,
	                |	рОплаты.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
	                |	рОплаты.ИсключитьИзРасчетаЗП КАК ИсключитьИзРасчетаЗП,
	                |	рОплаты.МоментВремени КАК МоментВремениОП,
	                |	рОплаты.Агент КАК АгентОП,
	                |	рОплаты.СтраховойПолис КАК СтраховойПолисОП
	                |ПОМЕСТИТЬ ВзаиморасчетыРегистр
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		уб_ВзаиморасчетыПоДоговору.ИДОперации КАК ИДОперации,
	                |		уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы,
	                |		уб_ВзаиморасчетыПоДоговору.КлючОперации КАК КлючОперации,
	                |		уб_ВзаиморасчетыПоДоговору.Операция КАК Операция,
	                |		уб_ВзаиморасчетыПоДоговору.Документ КАК Документ,
	                |		уб_ВзаиморасчетыПоДоговору.Сумма КАК Сумма,
	                |		уб_ВзаиморасчетыПоДоговору.Страхователь КАК Страхователь,
	                |		уб_ВзаиморасчетыПоДоговору.Поставщик КАК Поставщик,
	                |		уб_ВзаиморасчетыПоДоговору.Агент КАК Агент,
	                |		уб_ВзаиморасчетыПоДоговору.ДатаОперации КАК ДатаОперации,
	                |		уб_ВзаиморасчетыПоДоговору.ОрганизацияАгент КАК ОрганизацияАгент,
	                |		уб_ВзаиморасчетыПоДоговору.ТипОперации КАК ТипОперации
	                |	ИЗ
	                |		РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору) КАК Взаиморасчеты
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК рПолиса
	                |		ПО (рПолиса.Ссылка = Взаиморасчеты.Документ)
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_ОплатаПолисов КАК рОплаты
	                |		ПО (рОплаты.Ссылка = Взаиморасчеты.Документ)
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК рПолисаОплаты
	                |		ПО Взаиморасчеты.Документ.СтраховойПолис = рПолисаОплаты.Ссылка
	                |ГДЕ
	                |	Взаиморасчеты.ИДГруппы В
	                |			(ВЫБРАТЬ
	                |				уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы
	                |			ИЗ
	                |				РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	                |			ГДЕ
	                |				уб_ВзаиморасчетыПоДоговору.Документ = &Документ)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВзаиморасчетыИРеквизиты.ИДГруппы,
	                |	ВзаиморасчетыИРеквизиты.КлючОперации,
	                |	ВзаиморасчетыИРеквизиты.Операция,
	                |	ВзаиморасчетыИРеквизиты.ИДОперации,
	                |	ВзаиморасчетыИРеквизиты.Сумма,
	                |	ВзаиморасчетыИРеквизиты.Документ,
	                |	ВзаиморасчетыИРеквизиты.Страхователь,
	                |	ВзаиморасчетыИРеквизиты.Поставщик,
	                |	ВзаиморасчетыИРеквизиты.Агент,
	                |	ВзаиморасчетыИРеквизиты.ДатаОперации,
	                |	ВзаиморасчетыИРеквизиты.ОрганизацияАгент,
	                |	ВзаиморасчетыИРеквизиты.ТипОперации,
	                |	ВзаиморасчетыИРеквизиты.ТипДокумента,
	                |	ВзаиморасчетыИРеквизиты.СостояниеПолисаСП,
	                |	ВзаиморасчетыИРеквизиты.СтраховательСП,
	                |	ВзаиморасчетыИРеквизиты.АгентСП,
	                |	ВзаиморасчетыИРеквизиты.ПоставщикСП,
	                |	ВзаиморасчетыИРеквизиты.ОрганизацияАгентСП,
	                |	ВзаиморасчетыИРеквизиты.СтраховаяПремияСП,
	                |	ВзаиморасчетыИРеквизиты.ДатаСП,
	                |	ВзаиморасчетыИРеквизиты.СостояниеПолисаСП2,
	                |	ВзаиморасчетыИРеквизиты.СтраховательСП2,
	                |	ВзаиморасчетыИРеквизиты.ПоставщикСП2,
	                |	ВзаиморасчетыИРеквизиты.АгентСП2,
	                |	ВзаиморасчетыИРеквизиты.ОрганизацияАгентСП2,
	                |	ВзаиморасчетыИРеквизиты.СтраховаяПремияСП2,
	                |	ВзаиморасчетыИРеквизиты.ДатаСП2,
	                |	ВзаиморасчетыИРеквизиты.МоментВремениСП,
	                |	ВзаиморасчетыИРеквизиты.ОтчетПоставщику,
	                |	ВзаиморасчетыИРеквизиты.НеВключатьВОтчетыПоставщикам,
	                |	ВзаиморасчетыИРеквизиты.ИсключитьИзРасчетаЗП,
	                |	ВзаиморасчетыИРеквизиты.МоментВремениОП,
	                |	ВзаиморасчетыИРеквизиты.АгентОП,
	                |	ВзаиморасчетыИРеквизиты.СтраховойПолисОП
	                |ПОМЕСТИТЬ ВзаиморасчетыИРеквизиты
	                |ИЗ
	                |	ВзаиморасчетыРегистр КАК ВзаиморасчетыИРеквизиты
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ВЗ.ИДГруппы,
	                |	""Распределение оплаты взноса"",
	                |	ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПеречисленоПоставщику),
	                |	СостояниеОП.Дата,
	                |	СУММА(ВЗ.Сумма * СостояниеОП.КоэфОплаченностиВзноса),
	                |	""Платеж"",
	                |	ВЗ.Страхователь,
	                |	ВЗ.Поставщик,
	                |	ВЗ.Агент,
	                |	СостояниеОП.Дата,
	                |	ВЗ.ОрганизацияАгент,
	                |	ВЗ.ТипОперации,
	                |	ВЗ.ТипДокумента,
	                |	ВЗ.СостояниеПолисаСП,
	                |	ВЗ.СтраховательСП,
	                |	ВЗ.АгентСП,
	                |	ВЗ.ПоставщикСП,
	                |	ВЗ.ОрганизацияАгентСП,
	                |	ВЗ.СтраховаяПремияСП,
	                |	ВЗ.ДатаСП,
	                |	ВЗ.СостояниеПолисаСП2,
	                |	ВЗ.СтраховательСП2,
	                |	ВЗ.ПоставщикСП2,
	                |	ВЗ.АгентСП2,
	                |	ВЗ.ОрганизацияАгентСП2,
	                |	ВЗ.СтраховаяПремияСП2,
	                |	ВЗ.ДатаСП2,
	                |	ВЗ.МоментВремениСП,
	                |	ВЗ.ОтчетПоставщику,
	                |	ВЗ.НеВключатьВОтчетыПоставщикам,
	                |	ВЗ.ИсключитьИзРасчетаЗП,
	                |	ВЗ.МоментВремениОП,
	                |	ВЗ.АгентОП,
	                |	ВЗ.СтраховойПолисОП
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ВЗ.ИДГруппы КАК ИДГруппы,
	                |		ВЗ.КлючОперации КАК КлючОперации,
	                |		ВЗ.Операция КАК Операция,
	                |		ВЗ.ИДОперации КАК ИДОперации,
	                |		ВЫБОР
	                |			КОГДА ВЗ.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера)
	                |				ТОГДА -ВЗ.Сумма
	                |			ИНАЧЕ ВЗ.Сумма
	                |		КОНЕЦ КАК Сумма,
	                |		ВЗ.Документ КАК Документ,
	                |		ВЗ.Страхователь КАК Страхователь,
	                |		ВЗ.Поставщик КАК Поставщик,
	                |		ВЗ.Агент КАК Агент,
	                |		ВЗ.ДатаОперации КАК ДатаОперации,
	                |		ВЗ.ОрганизацияАгент КАК ОрганизацияАгент,
	                |		ВЗ.ТипОперации КАК ТипОперации,
	                |		ВЗ.ТипДокумента КАК ТипДокумента,
	                |		ВЗ.СостояниеПолисаСП КАК СостояниеПолисаСП,
	                |		ВЗ.СтраховательСП КАК СтраховательСП,
	                |		ВЗ.АгентСП КАК АгентСП,
	                |		ВЗ.ПоставщикСП КАК ПоставщикСП,
	                |		ВЗ.ОрганизацияАгентСП КАК ОрганизацияАгентСП,
	                |		ВЗ.СтраховаяПремияСП КАК СтраховаяПремияСП,
	                |		ВЗ.ДатаСП КАК ДатаСП,
	                |		ВЗ.СостояниеПолисаСП2 КАК СостояниеПолисаСП2,
	                |		ВЗ.СтраховательСП2 КАК СтраховательСП2,
	                |		ВЗ.ПоставщикСП2 КАК ПоставщикСП2,
	                |		ВЗ.АгентСП2 КАК АгентСП2,
	                |		ВЗ.ОрганизацияАгентСП2 КАК ОрганизацияАгентСП2,
	                |		ВЗ.СтраховаяПремияСП2 КАК СтраховаяПремияСП2,
	                |		ВЗ.ДатаСП2 КАК ДатаСП2,
	                |		ВЗ.МоментВремениСП КАК МоментВремениСП,
	                |		ВЗ.ОтчетПоставщику КАК ОтчетПоставщику,
	                |		ВЗ.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
	                |		ВЗ.ИсключитьИзРасчетаЗП КАК ИсключитьИзРасчетаЗП,
	                |		ВЗ.МоментВремениОП КАК МоментВремениОП,
	                |		ВЗ.АгентОП КАК АгентОП,
	                |		ВЗ.СтраховойПолисОП КАК СтраховойПолисОП
	                |	ИЗ
	                |		ВзаиморасчетыРегистр КАК ВЗ
	                |	ГДЕ
	                |		ВЗ.Сумма <> 0
	                |		И ВЗ.Документ.ФормаОплаты <> ЗНАЧЕНИЕ(Перечисление.уб_ФормыОплаты.Поставщику)) КАК ВЗ
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостояниеОП КАК СостояниеОП
	                |		ПО ВЗ.ОтчетПоставщику = СостояниеОП.ОтчетПоставщику
	                |			И (СостояниеОП.КоэфОплаченностиВзноса <> 0)
	                |			И (ВЗ.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса)
	                |				ИЛИ ВЗ.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера)
	                |					И СостояниеОП.ВидВзаиморасчета = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ))
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВЗ.ИДГруппы,
	                |	СостояниеОП.Дата,
	                |	ВЗ.Страхователь,
	                |	ВЗ.Поставщик,
	                |	ВЗ.Агент,
	                |	СостояниеОП.Дата,
	                |	ВЗ.ОрганизацияАгент,
	                |	ВЗ.ТипОперации,
	                |	ВЗ.ТипДокумента,
	                |	ВЗ.СостояниеПолисаСП,
	                |	ВЗ.СтраховательСП,
	                |	ВЗ.АгентСП,
	                |	ВЗ.ПоставщикСП,
	                |	ВЗ.ОрганизацияАгентСП,
	                |	ВЗ.СтраховаяПремияСП,
	                |	ВЗ.ДатаСП,
	                |	ВЗ.СостояниеПолисаСП2,
	                |	ВЗ.СтраховательСП2,
	                |	ВЗ.ПоставщикСП2,
	                |	ВЗ.АгентСП2,
	                |	ВЗ.ОрганизацияАгентСП2,
	                |	ВЗ.СтраховаяПремияСП2,
	                |	ВЗ.ДатаСП2,
	                |	ВЗ.МоментВремениСП,
	                |	ВЗ.ОтчетПоставщику,
	                |	ВЗ.НеВключатьВОтчетыПоставщикам,
	                |	ВЗ.ИсключитьИзРасчетаЗП,
	                |	ВЗ.МоментВремениОП,
	                |	ВЗ.АгентОП,
	                |	ВЗ.СтраховойПолисОП
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ВЗ.ИДГруппы,
	                |	""Распределение оплаты КВ"",
	                |	ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПоставщикВыплатилКВ),
	                |	СостояниеОП.Дата,
	                |	ВЗ.Сумма * СостояниеОП.КоэфОплаченностиКВ,
	                |	""Платеж"",
	                |	ВЗ.Страхователь,
	                |	ВЗ.Поставщик,
	                |	ВЗ.Агент,
	                |	СостояниеОП.Дата,
	                |	ВЗ.ОрганизацияАгент,
	                |	ВЗ.ТипОперации,
	                |	ВЗ.ТипДокумента,
	                |	ВЗ.СостояниеПолисаСП,
	                |	ВЗ.СтраховательСП,
	                |	ВЗ.АгентСП,
	                |	ВЗ.ПоставщикСП,
	                |	ВЗ.ОрганизацияАгентСП,
	                |	ВЗ.СтраховаяПремияСП,
	                |	ВЗ.ДатаСП,
	                |	ВЗ.СостояниеПолисаСП2,
	                |	ВЗ.СтраховательСП2,
	                |	ВЗ.ПоставщикСП2,
	                |	ВЗ.АгентСП2,
	                |	ВЗ.ОрганизацияАгентСП2,
	                |	ВЗ.СтраховаяПремияСП2,
	                |	ВЗ.ДатаСП2,
	                |	ВЗ.МоментВремениСП,
	                |	ВЗ.ОтчетПоставщику,
	                |	ВЗ.НеВключатьВОтчетыПоставщикам,
	                |	ВЗ.ИсключитьИзРасчетаЗП,
	                |	ВЗ.МоментВремениОП,
	                |	ВЗ.АгентОП,
	                |	ВЗ.СтраховойПолисОП
	                |ИЗ
	                |	ВзаиморасчетыРегистр КАК ВЗ
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостояниеОП КАК СостояниеОП
	                |		ПО ВЗ.ОтчетПоставщику = СостояниеОП.ОтчетПоставщику
	                |			И (ВЗ.Сумма <> 0)
	                |			И (СостояниеОП.КоэфОплаченностиКВ <> 0)
	                |			И (СостояниеОП.НачисленоПоКВ <> 0)
	                |			И (ВЗ.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеКВБрокера))
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СжатыеПоГруппам.ИДОперации КАК Ведущая,
	                |	СжатыеПоГруппам.Операция,
	                |	СжатыеПоГруппам.КлючОперации,
	                |	СжатыеПоГруппам.Сумма,
	                |	СжатыеПоГруппам.Документ,
	                |	ВЫБОР
	                |		КОГДА ВЫБОР
	                |				КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |					ТОГДА СжатыеПоГруппам.СостояниеПолисаСП
	                |				КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |					ТОГДА СжатыеПоГруппам.СостояниеПолисаСП2
	                |				ИНАЧЕ ЛОЖЬ
	                |			КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Аннулирован,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.СостояниеПолисаСП
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.СостояниеПолисаСП2
	                |	КОНЕЦ КАК Состояние,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.СтраховательСП
	                |		ИНАЧЕ СжатыеПоГруппам.СтраховательСП2
	                |	КОНЕЦ КАК Страхователь,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.СтраховаяПремияСП
	                |		ИНАЧЕ СжатыеПоГруппам.СтраховаяПремияСП2
	                |	КОНЕЦ КАК СтраховаяПремия,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.Документ
	                |		ИНАЧЕ СжатыеПоГруппам.СтраховойПолисОП
	                |	КОНЕЦ КАК СтраховойПолис,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.ПоставщикСП
	                |		ИНАЧЕ СжатыеПоГруппам.ПоставщикСП2
	                |	КОНЕЦ КАК ПоставщикСП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.ОрганизацияАгентСП
	                |		ИНАЧЕ СжатыеПоГруппам.ОрганизацияАгентСП2
	                |	КОНЕЦ КАК ОрганизацияАгентСП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.АгентСП
	                |		ИНАЧЕ СжатыеПоГруппам.АгентСП2
	                |	КОНЕЦ КАК АгентСП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.ДатаСП
	                |		ИНАЧЕ СжатыеПоГруппам.ДатаСП2
	                |	КОНЕЦ КАК ДатаСП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.ПоставщикСП
	                |		ИНАЧЕ СжатыеПоГруппам.Поставщик
	                |	КОНЕЦ КАК Поставщик,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.ОрганизацияАгентСП
	                |		ИНАЧЕ СжатыеПоГруппам.ОрганизацияАгент
	                |	КОНЕЦ КАК ОрганизацияАгент,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.НеВключатьВОтчетыПоставщикам
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК НеВключатьВОтчетыПоставщикам,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.ИсключитьИзРасчетаЗП
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ИсключитьИзРасчетаЗП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.НеВключатьВОтчетыПоставщикам
	                |				И сОперации.ИсключатьПриИсклОП
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ИсключатьПриИсклОП,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.АгентСП
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.АгентОП
	                |		ИНАЧЕ СжатыеПоГруппам.Агент
	                |	КОНЕЦ КАК Агент,
	                |	СжатыеПоГруппам.ДатаОперации КАК ДатаОперации,
	                |	сОперации.Клиент КАК ВзКлиент,
	                |	сОперации.Поставщик КАК ВзПоставщик,
	                |	сОперации.Агент КАК ВзАгент,
	                |	сОперации.Касса КАК ВзКасса,
	                |	сОперации.ДоходБрокера КАК ВзДоходБрокера,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.ОтчетПоставщику
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ОтчетПоставщику,
	                |	ПРЕДСТАВЛЕНИЕ(СжатыеПоГруппам.Документ) КАК ДокументСтрока,
	                |	ВЫБОР
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 1
	                |			ТОГДА СжатыеПоГруппам.МоментВремениСП
	                |		КОГДА СжатыеПоГруппам.ТипДокумента = 0
	                |			ТОГДА СжатыеПоГруппам.МоментВремениОП
	                |		ИНАЧЕ СжатыеПоГруппам.ДатаОперации
	                |	КОНЕЦ КАК МоментВремени,
	                |	СжатыеПоГруппам.ИДГруппы
	                |ПОМЕСТИТЬ ВзаиморасчетыИОперации
	                |ИЗ
	                |	ВзаиморасчетыИРеквизиты КАК СжатыеПоГруппам
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уб_ВидыРасчетныхОпераций КАК сОперации
	                |		ПО (сОперации.Ссылка = СжатыеПоГруппам.Операция)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПодготовленныеРасчеты.ДатаОперации КАК ДатаОперации,
	                |	ПодготовленныеРасчеты.Ведущая,
	                |	ПодготовленныеРасчеты.ИДГруппы,
	                |	ПодготовленныеРасчеты.КлючОперации,
	                |	ПодготовленныеРасчеты.Операция,
	                |	ПодготовленныеРасчеты.Сумма,
	                |	ПодготовленныеРасчеты.Документ,
	                |	ПодготовленныеРасчеты.ДокументСтрока КАК ДокументСтрока,
	                |	ПодготовленныеРасчеты.МоментВремени КАК МоментВремени,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ИсключатьПриИсклОП
	                |			ТОГДА 0
	                |		ИНАЧЕ ПодготовленныеРасчеты.Сумма * ПодготовленныеРасчеты.ВзКлиент
	                |	КОНЕЦ КАК ВзКлиент,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ИсключатьПриИсклОП
	                |			ТОГДА 0
	                |		ИНАЧЕ ПодготовленныеРасчеты.Сумма * ПодготовленныеРасчеты.ВзАгент
	                |	КОНЕЦ КАК ВзАгент,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ИсключатьПриИсклОП
	                |			ТОГДА 0
	                |		ИНАЧЕ ПодготовленныеРасчеты.Сумма * ПодготовленныеРасчеты.ВзКасса
	                |	КОНЕЦ КАК ВзКасса,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ИсключатьПриИсклОП
	                |			ТОГДА 0
	                |		ИНАЧЕ ПодготовленныеРасчеты.Сумма * ПодготовленныеРасчеты.ВзДоходБрокера
	                |	КОНЕЦ КАК ВзДоходБрокера,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ИсключатьПриИсклОП
	                |			ТОГДА 0
	                |		ИНАЧЕ ПодготовленныеРасчеты.Сумма * ПодготовленныеРасчеты.ВзПоставщик
	                |	КОНЕЦ КАК ВзПоставщик,
	                |	ПодготовленныеРасчеты.Страхователь,
	                |	ПодготовленныеРасчеты.Поставщик,
	                |	ПодготовленныеРасчеты.Агент,
	                |	ПодготовленныеРасчеты.ОрганизацияАгент,
	                |	ПодготовленныеРасчеты.НеВключатьВОтчетыПоставщикам КАК НеВключатьВОтчетыПоставщикам,
	                |	ПодготовленныеРасчеты.ИсключитьИзРасчетаЗП КАК ИсключитьИзРасчетаЗП,
	                |	ПодготовленныеРасчеты.Аннулирован КАК Аннулирован,
	                |	ПодготовленныеРасчеты.Состояние,
	                |	ВЫБОР
	                |		КОГДА НЕ ПодготовленныеРасчеты.ОтчетПоставщику = ЛОЖЬ
	                |				И ПодготовленныеРасчеты.ОтчетПоставщику = ЗНАЧЕНИЕ(Документ.уб_ОтчетПоставщику.ПустаяСсылка)
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК НетОП,
	                |	ПодготовленныеРасчеты.ОтчетПоставщику,
	                |	NULL КАК ОтчетПоставщику1,
	                |	NULL КАК Задолженность,
	                |	NULL КАК ЗадолженностьКВ,
	                |	NULL КАК Начислено,
	                |	NULL КАК НачисленоКВ,
	                |	NULL КАК Оплачено,
	                |	NULL КАК ОплаченоКВ,
	                |	NULL КАК Дата,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ВзКлиент <> 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК флКлиент,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ВзПоставщик <> 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК флПоставщик,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ВзАгент <> 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК флАгент,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ВзКасса <> 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК флКасса,
	                |	ВЫБОР
	                |		КОГДА ПодготовленныеРасчеты.ВзДоходБрокера <> 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК флДоходБрокера
	                |ИЗ
	                |	ВзаиморасчетыИОперации КАК ПодготовленныеРасчеты
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДатаОперации";
	Возврат ТекстЗапроса
КонецФункции	

Функция ПолучитьТаблицуВзаиморасчетов(ОбъектВзаиморасчетов,Расчетно = Истина) Экспорт
	
	Если ЗначениеЗаполнено(ОбъектВзаиморасчетов)= Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//Далее Двурежимный запрос
	ТекстЗапроса = ТекстЗапросаВзаиморасчеты(Расчетно);
	
	ЗапросТабВзаиморасчетов = ПолучитьСостояниеОтчетаПоставщику(,"ВТ без запроса");//Получаем запрос с итогами задолженностей по отчетам поставщику
	
	//Запрос = Новый Запрос;
	
	ТипОбъекта= ТипЗнч(ОбъектВзаиморасчетов);							   
	Если ТипОбъекта = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		ЗапросТабВзаиморасчетов.УстановитьПараметр("СтраховойПолис",ОбъектВзаиморасчетов.СтраховойПолис);
		ЗапросТабВзаиморасчетов.УстановитьПараметр("ОплатаПолиса",ОбъектВзаиморасчетов.Ссылка);//?(ОбъектВзаиморасчетов.ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка));
	ИначеЕсли ТипОбъекта = Тип("Строка") Тогда	//Приемка оплат или поиск по подоперации
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"уб_ВзаиморасчетыПоДоговору.Документ = &Документ",
												"уб_ВзаиморасчетыПоДоговору.КлючОперации = &УИДСтрокиТЧ");
												
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"К4.ОплатаПолиса = &ОплатаПолиса
		//						  |								ИЛИ К4.ОплатаПолиса.СтраховойПолис = &СтраховойПолис","К4.УИДСтрокиТЧ=&УИДСтрокиТЧ");
		ЗапросТабВзаиморасчетов.УстановитьПараметр("УИДСтрокиТЧ",ОбъектВзаиморасчетов);
	Иначе
		ЗапросТабВзаиморасчетов.УстановитьПараметр("СтраховойПолис",ОбъектВзаиморасчетов.Ссылка);
		ЗапросТабВзаиморасчетов.УстановитьПараметр("ОплатаПолиса",ОбъектВзаиморасчетов.Ссылка);//?(ОбъектВзаиморасчетов.ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка));
	КонецЕсли;	
	ЗапросТабВзаиморасчетов.УстановитьПараметр("Документ",ОбъектВзаиморасчетов);		
	
	//В запросе уже есть ВТ с задолженностью
	ЗапросТабВзаиморасчетов.Текст = ЗапросТабВзаиморасчетов.Текст +";
	|"+ ТекстЗапроса;
	
	Взаиморасчеты = ЗапросТабВзаиморасчетов.Выполнить().Выгрузить();
	//Взаиморасчеты.Сортировать("ДатаОперации");
	
	Возврат Взаиморасчеты;
КонецФункции	

Функция ВернутьСписокДействийДляОперации(Операция,ТекущиеДанные,ИмяПоля,Объект,ДоступноРедактирование = Ложь) Экспорт
	
	СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	СписокДействий = Новый СписокЗначений;
	Уровень = ТекущиеДанные.Уровень();
	Если Уровень>0 Тогда
		ТекущиеДанные = ТекущиеДанные.Родитель;
	КонецЕсли;	
	ИмяОперации = Справочники.уб_ВидыРасчетныхОпераций.ПолучитьИмяПредопределенного(ТекущиеДанные.Операция);
	
	ЭтоОперацияОткрытогоДокумента = ТекущиеДанные.Документ = Объект.Ссылка;
	Если ЭтоОперацияОткрытогоДокумента   Тогда
		Если ДоступноРедактирование Тогда
			подОперация = Найти("НачислениеСтраховогоВзноса,СкидкаКлиентуИзДБ",ИмяОперации); 
			Если подОперация>0 Тогда
				СписокДействий.Добавить("ИзменитьСкидкуСуммуВзноса", "Изменить начисленный взнос, скидку");	
			КонецЕсли;	
			Если подОперация = 1 Тогда
				//
				Если ТекущиеДанные.Сумма>0 Тогда
					СписокДействий.Добавить("АннулироватьВзнос", "Аннулировать взнос, скидку");	
					Если СистемаНаправлениеПлатежа Тогда
						Если Объект.НаправлениеПлатежа = Перечисления.уб_НаправленияПлатежа.Поставщику Тогда
							СписокДействий.Добавить("ОтразитьВыплатуКлиенту", "Отразить выплату клиенту скидки");
						КонецЕсли;
					Иначе
						Если Объект.ФормаОплаты = Перечисления.уб_ФормыОплаты.Поставщику Тогда
							СписокДействий.Добавить("ОтразитьВыплатуКлиенту", "Отразить выплату клиенту скидки");	
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
				
			ИначеЕсли подОперация >0 Тогда
				//Скидка
				Если ТекущиеДанные.Сумма>0 Тогда
					СписокДействий.Добавить("ОтменитьСкидку", "Отменить скидку");	
				ИначеЕсли ТекущиеДанные.Сумма<0 Тогда
					СписокДействий.Добавить("ОтменитьСкидку", "Отменить наценку");		
				КонецЕсли;
			ИначеЕсли Найти("НачислениеВМ,УдержаноМенеджеромИзДСКлиента",ИмяОперации) > 0 Тогда
				СписокДействий.Добавить("ОтразитьУдержаниеИзВМ", "Отразить вычет из вознаграждения");	
			КонецЕсли;
		КонецЕсли;
	Иначе	
		//СписокДействий.Добавить("ОткрытьСвязанныйДокумент", "Открыть связанный с операцией документ");	
		СписокДействий.Добавить("ОткрытьСвязанныйДокумент", "Открыть документ """+ТекущиеДанные.ДокументСтрока+"""");	
	КонецЕсли;
	Если СписокДействий.Количество()>0 Тогда
		СписокДействий.Добавить("Разделитель");
	КонецЕсли;	
	СписокДействий.Добавить("ОткрытьТаблицуВсехВзаиморасчетов", "Открыть форму просмотра всех связанных взаиморасчетов");
	СписокДействий.Добавить("ОткрытьФормуОбъединенияГрупп", "Открыть форму объединения групп взаиморасчетов");
	
	Возврат СписокДействий;
	
КонецФункции	

//Общие действия
Процедура ВыполнитьДействие(ДанныеПоСтроке, ИмяКоманды,Владелец) Экспорт
	Документ = ДанныеПоСтроке.Документ;
	ТипДокумента = ТипЗнч(Документ);
	
	Если ИмяКоманды = "ОткрытьСвязанныйДокумент" Тогда
		
		Если ТипДокумента = Тип("ДокументСсылка.уб_ПриемкаОплат") Тогда
			//ОткрытьПриемкуОплат(Документ,ПолучитьУИДСтрокиПоДокументам(Документ,Ссылка));
			фФорма = Документ.ПолучитьФорму(,Владелец);
			фФорма.СтруктураИскомойСтроки = Новый Структура("УИДСтроки",ДанныеПоСтроке.КлючОперации); 
			фФорма.Открыть(); 
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.уб_СтраховойПолис") Тогда
			Документ.ПолучитьФорму().Открыть();
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
			Документ.ПолучитьФорму().Открыть();	
		КонецЕсли;	
	ИначеЕсли ИмяКоманды = "ОткрытьТаблицуВсехВзаиморасчетов" Тогда
		уб_Взаиморасчеты.ПоказатьВзаиморасчеты(ДанныеПоСтроке[?(ТипДокумента = Тип("ДокументСсылка.уб_ПриемкаОплат"),"Ведущая","Документ")],Владелец);
	ИначеЕсли ИмяКоманды = "ОткрытьФормуОбъединенияГрупп" Тогда
		Форма = Обработки.уб_ОбъединениеГруппВзаиморасчетов.ПолучитьФорму(,);
		Форма.Документ1 = ДанныеПоСтроке[?(ТипДокумента = Тип("ДокументСсылка.уб_ПриемкаОплат"),"Ведущая","Документ")];
		Форма.Открыть();
	ИначеЕсли ИмяКоманды = "ОтразитьУдержаниеИзВМ" Тогда
		_СуммаУдержания = 0;
		#Если Клиент Тогда
		Если ВвестиЧисло(_СуммаУдержания,"Удержать с менеджера",15,2) Тогда
			ЗапросВзаиморасчеты = уб_Взаиморасчеты.ЗапросПоВзаиморасчетамДокумента(Документ);
			ИДГруппыВзаиморасчетов = уб_Взаиморасчеты.ПолучитьУИДГруппыПоДокументу(Документ);
			СтруктураПараметров = Новый Структура("Дата,Агент,Страхователь,Поставщик,ОрганизацияАгент",ТекущаяДата(),Документ.Агент,Документ.СтраховойПолис.Страхователь,Документ.Поставщик,Документ.ОрганизацияАгент,Документ.Дата,ЗапросВзаиморасчеты);
			ИДОперации = Строка(Новый УникальныйИдентификатор);//Разовые операции не самосторнирующиеся
			уб_Взаиморасчеты.ОтразитьОперациюВзаиморасчета(Строка(Новый УникальныйИдентификатор()),
		Справочники.уб_ВидыРасчетныхОпераций.УдержаниеИзВМ,Документ,ИДОперации,_СуммаУдержания,СтруктураПараметров,ИДГруппыВзаиморасчетов,ЗапросВзаиморасчеты);
	        Оповестить("ИзмененаГруппаВзаиморасчетов",ИДГруппыВзаиморасчетов);
		КонецЕсли;	
		#КонецЕсли
	Иначе	
		Сообщить("Неизвестное действие по взаиморасчетам "+ИмяКоманды+" для "+Документ);	
	Конецесли;	
	
КонецПроцедуры	

Процедура СтатусОтСуммы(эу,Баланс,н0,нПлюс,нМинус,ц0,цПлюс,цМинус,к0,кПлюс=Неопределено,кМинус=Неопределено) Экспорт
	
	Если Баланс = 0 Тогда
		эу.Заголовок  = н0;
		эу.ЦветТекста = Новый Цвет;
		эу.Картинка = Картинка(к0);
	ИначеЕсли Баланс >0 Тогда
		эу.Заголовок  = нПлюс+Формат(Баланс,"ЧЦ=15; ЧДЦ=2");
		эу.ЦветТекста = Новый Цвет(200,0,0);
		эу.Картинка = Картинка(кПлюс);
	Иначе
		эу.Заголовок  = нМинус+Формат(-Баланс,"ЧЦ=15; ЧДЦ=2");
		эу.ЦветТекста = Новый Цвет(50,180,0);
		эу.Картинка = Картинка(кМинус);
	КонецЕсли;	
КонецПроцедуры	

Функция Картинка(Картинка)
	Если Картинка = Неопределено Тогда
		Возврат Новый Картинка;
	ИначеЕсли ТипЗнч(Картинка)=Тип("Строка") Тогда
		Попытка 
			_Картинка = БиблиотекаКартинок[Картинка];
			Возврат _Картинка;
		Исключение
			Возврат Новый Картинка;
		КонецПопытки;	
	ИначеЕсли ТипЗнч("Картинка")=Тип("Картинка") Тогда
		Возврат Картинка;
	Иначе
			Возврат Новый Картинка;
	КонецЕсли;	
КонецФункции	

Функция ПоказателиГруппы(ОбъектВзаиморасчетов) Экспорт
	//Премия
	//НачисленнаяСуммаВзноса
	//ПринятаяСумма
	//СкидкаКлиенту
	//СкидкаКлиентуПроцент //Расчетный
	//ВыплатаКлиенту -Скидка выплаченная клиенту после перечисления безналом
	//АВ 
	//АВПроцент
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Группы.ИДГруппы
	               |ПОМЕСТИТЬ УИДГРУППЫ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		уб_ВзаиморасчетыПоДоговору.ИДГруппы КАК ИДГруппы
	               |	ИЗ
	               |		РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
	               |	ГДЕ
	               |		уб_ВзаиморасчетыПоДоговору.Документ = &Документ
	               |	
	               //|	ОБЪЕДИНИТЬ ВСЕ
	               //|	
				   //|	ВЫБРАТЬ
				   //|		уб_ВзаиморасчетыПоДоговору.ИДГруппы
				   //|	ИЗ
				   //|		РегистрСведений.уб_КвитовкаОплат КАК уб_КвитовкаОплат
				   //|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК уб_ВзаиморасчетыПоДоговору
				   //|			ПО уб_КвитовкаОплат.УИДСтрокиТЧ = уб_ВзаиморасчетыПоДоговору.ИДОперации
				   //|	ГДЕ
				   //|		(уб_КвитовкаОплат.ОплатаПолиса = &Документ
				   //|				ИЛИ уб_КвитовкаОплат.ПриемОплаты = &Документ)
				   |) КАК Группы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СозданиеСтраховогоПолиса)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПоказателиГруппы.Документ.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоказателиГруппы.Документ.СтраховаяПремия, 0)
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК Премия,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК НачисленнаяСуммаВзноса,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ
	               |							И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером)
	               |						ИЛИ ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаПоставщиком)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК ПринятаяСумма,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ)
	               |						И ПоказателиГруппы.Документ.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоСхеме)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК СкидкаКлиенту,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК ВыплатаКлиенту,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ = &Документ И ПоказателиГруппы.Документ.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоАВ)
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.УдержаноМенеджеромИзДСКлиента) //НачислениеВМ
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК АВ,
				   |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СозданиеСтраховогоПолиса)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПоказателиГруппы.Документ.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоказателиГруппы.Документ.СтраховаяПремия, 0)
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гПремия,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.НачислениеСтраховогоВзноса)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гНачисленнаяСуммаВзноса,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаБрокером)
	               |						ИЛИ ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ПриемкаОтКлиентаПоставщиком)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гПринятаяСумма,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СкидкаКлиентуИзДБ)
	               |						И ПоказателиГруппы.Документ.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоСхеме)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гСкидкаКлиенту,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.ВыплатаКлиенту)
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гВыплатаКлиенту,
	               |	ЕСТЬNULL(СУММА(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Документ.ВидРасчетаСАгентом = ЗНАЧЕНИЕ(Перечисление.уб_ВидыРасчетовСАгентом.ПоАВ)
	               |						И ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.УдержаноМенеджеромИзДСКлиента)//НачислениеВМ
	               |					ТОГДА ПоказателиГруппы.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ), 0) КАК гАВ,
	               |	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	               |				КОГДА ПоказателиГруппы.Операция = ЗНАЧЕНИЕ(Справочник.уб_ВидыРасчетныхОпераций.СозданиеСтраховогоПолиса)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПоказателиГруппы.Документ.СостояниеПолиса В (ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированПолностью), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированЗаменаБланка), ЗНАЧЕНИЕ(Перечисление.уб_СостоянияПолиса.АннулированВыписанНовый))
	               |								ТОГДА ИСТИНА
	               |							ИНАЧЕ ЛОЖЬ
	               |						КОНЕЦ
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ), ЛОЖЬ) КАК Аннулирован
	               |ИЗ
	               |	РегистрСведений.уб_ВзаиморасчетыПоДоговору КАК ПоказателиГруппы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УИДГРУППЫ КАК УИДГРУППЫ
	               |		ПО ПоказателиГруппы.ИДГруппы = УИДГРУППЫ.ИДГруппы
	               |			И (ПоказателиГруппы.Сумма <> 0)";
						  
						  //Если ТолькоПоОбъекту = Истина Тогда
						  //	ТекстЗапроса=ТекстЗапроса+" И ПоказателиГруппы.Документ = &Документ";
						  //КонецЕсли;	  
	ЗапросПоказателиГруппы = Новый Запрос(ТекстЗапроса);
	
	ЗапросПоказателиГруппы.УстановитьПараметр("Документ",ОбъектВзаиморасчетов);
	Структура = Новый Структура("Премия,НачисленнаяСуммаВзноса,ПринятаяСумма,СкидкаКлиенту,СкидкаКлиентуПроцент,ВыплатаКлиенту,АВ,АВПроцент,гПремия,гНачисленнаяСуммаВзноса,гПринятаяСумма,гСкидкаКлиенту,гСкидкаКлиентуПроцент,гВыплатаКлиенту,гАВ,гАВПроцент,Аннулирован",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,ЛОЖЬ);
	Выборка = ЗапросПоказателиГруппы.Выполнить().Выбрать();;
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЕсли;
	Если Структура.НачисленнаяСуммаВзноса>0 Тогда
		Структура.СкидкаКлиентуПроцент = Окр(100*Структура.СкидкаКлиенту/Структура.НачисленнаяСуммаВзноса,2);
		Если Структура.АВ<>0 Тогда
			Структура.АВПроцент = Окр(100*Структура.АВ/Структура.НачисленнаяСуммаВзноса,2);
		КонецЕсли;	
	КонецЕсли;	
	Возврат Структура;
КонецФункции	

Функция ТаблицаПлатежейПоДокументу(Ссылка, УИДСтроки = "", НаправлениеРасчетов = Неопределено, ВидСравненияНаправлениеРасчетов = "Равно") Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Вз.Ссылка,
	|	Вз.НомерСтроки,
	|	Вз.Сумма
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Вз
	|ГДЕ
	|	Вз.ОтчетПоставщику = &Ссылка
	|	И Вз.Ссылка.Проведен
	|	И Вз.УИДСтроки = &УИДСтроки";
	Запрос.УстановитьПараметр("УИДСтроки", 	УИДСтроки);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Если НаправлениеРасчетов <> Неопределено Тогда
		Если НРег(ВидСравненияНаправлениеРасчетов) = "равно" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ Вз.Ссылка.НаправлениеРасчетов = &НаправлениеРасчетов";
		КонецЕсли;
		Запрос.УстановитьПараметр("НаправлениеРасчетов", НаправлениеРасчетов);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ТаблицаПлатежейПоДокументу()

Процедура УстановитьДатуИНомерОснованияПлатежа(ОбъектПриемки, ДокументВзаиморасчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уб_ВзаиморасчетСПоставщиком.ДатаВходящегоДокумента,
	|	уб_ВзаиморасчетСПоставщиком.НомерВходящегоДокумента
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
	|ГДЕ
	|	уб_ВзаиморасчетСПоставщиком.Ссылка = &ДокументВзаиморасчета";
	Запрос.УстановитьПараметр("ДокументВзаиморасчета", ДокументВзаиморасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерВходящегоДокумента = Выборка.НомерВходящегоДокумента;
		ДатаВходящегоДокумента = Выборка.ДатаВходящегоДокумента;
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерВходящегоДокумента) Или ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		ТекстВопроса = "Заменить ";
		Если ЗначениеЗаполнено(ОбъектПриемки.НомерОбосновывающегоДокумента) И ОбъектПриемки.НомерОбосновывающегоДокумента <> НомерВходящегоДокумента Тогда
			ТекстВопроса = ТекстВопроса + "номер обосновывающего документа (текущее значение: " + ОбъектПриемки.НомерОбосновывающегоДокумента + ", новое значение: " + НомерВходящегоДокумента + "), ";
		КонецЕсли;
		Если ЗначениеЗаполнено(ОбъектПриемки.ДатаОбосновывающегоДокумента) И ОбъектПриемки.ДатаОбосновывающегоДокумента <> ДатаВходящегоДокумента Тогда
			ТекстВопроса = ТекстВопроса + "дату обосновывающего документа (текущее значение: " + Формат(ОбъектПриемки.ДатаОбосновывающегоДокумента, "ДФ=dd.MM.yyyy") + ", новое значение: " + Формат(ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") + "), ";
		КонецЕсли;
		Если ТекстВопроса <> "Заменить " Тогда
			#Если Клиент Тогда
				Ответ = Вопрос(Лев(ТекстВопроса, СтрДлина(ТекстВопроса) - 2), РежимДиалогаВопрос.ДаНет);
				Заменять = Ответ = КодВозвратаДиалога.Да;
			#Иначе
				Заменять = Истина;
			#КонецЕсли
		Иначе
			Заменять = Истина;
		КонецЕсли;
		Если Заменять Тогда
			#Если Клиент Тогда
				уб_Клиент._УстановитьЗначение(ОбъектПриемки,"НомерОбосновывающегоДокумента", НомерВходящегоДокумента);
				уб_Клиент._УстановитьЗначение(ОбъектПриемки,"ДатаОбосновывающегоДокумента", ДатаВходящегоДокумента);
			#Иначе
				уб_ВызовСервера._УстановитьЗначение(ОбъектПриемки,"НомерОбосновывающегоДокумента", НомерВходящегоДокумента);
				уб_ВызовСервера._УстановитьЗначение(ОбъектПриемки,"ДатаОбосновывающегоДокумента", ДатаВходящегоДокумента);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//Для отчета с отрицательным доп КВ возвращает список отчетов с положительным Доп КВ, которые еще не задействованы в распределении
//работает только в этом направлении
Функция ДанныеДопКВ(ОтчетПоставщику) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уб_ОтчетПоставщику.Ссылка,
	|	уб_ОтчетПоставщику.Поставщик,
	|	уб_ОтчетПоставщику.ИтогОС_КПеречислениюПоставщику,
	|	уб_ОтчетПоставщику.ИтогОС_КВДоп КАК КРаспределению,
	|	ВЫБОР
	|		КОГДА уб_ОтчетПоставщику.ИтогОС_КВДоп > 0
	|			ТОГДА -1
	|		КОГДА уб_ОтчетПоставщику.ИтогОС_КВДоп < 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Множитель
	|ПОМЕСТИТЬ Источник
	|ИЗ
	|	Документ.уб_ОтчетПоставщику КАК уб_ОтчетПоставщику
	|ГДЕ
	|	уб_ОтчетПоставщику.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отражения.ОтчетПоставщику,
	|	СУММА(Отражения.Сумма) КАК Сумма
	|ПОМЕСТИТЬ Распределения
	|ИЗ
	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Отражения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Источник КАК Источник
	|		ПО (Источник.Поставщик = Отражения.Ссылка.Поставщик)
	|ГДЕ
	|	Отражения.Ссылка.СуммаДокумента = 0
	|	И Отражения.Ссылка.ИсключитьИзВзаиморасчетов = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Отражения.ОтчетПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уб_ОтчетПоставщику.Ссылка,
	|	уб_ОтчетПоставщику.ИтогОС_КВДоп,
	|	уб_ОтчетПоставщику.ИтогОС_КВ,
	|	уб_ОтчетПоставщику.Поставщик,
	|	Источник.КРаспределению,
	|	ЕСТЬNULL(Распределения.Сумма, 0) КАК Распределено,
	|	уб_ОтчетПоставщику.ИтогОС_КВДоп - ЕСТЬNULL(Распределения.Сумма, 0) КАК Осталось
	|ИЗ
	|	Документ.уб_ОтчетПоставщику КАК уб_ОтчетПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Источник КАК Источник
	|		ПО (Источник.Поставщик = уб_ОтчетПоставщику.Поставщик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Распределения КАК Распределения
	|		ПО уб_ОтчетПоставщику.Ссылка = Распределения.ОтчетПоставщику
	|ГДЕ
	|	(уб_ОтчетПоставщику.ИтогОС_КВДоп * Источник.Множитель > 0 ИЛИ уб_ОтчетПоставщику.Ссылка = &Ссылка)
	|	И уб_ОтчетПоставщику.ИтогОС_КВДоп <> 0
	|	И уб_ОтчетПоставщику.ПометкаУдаления = ЛОЖЬ
	|	И уб_ОтчетПоставщику.ИтогОС_КВДоп - ЕСТЬNULL(Распределения.Сумма, 0) <> 0");
	Запрос.УстановитьПараметр("Ссылка", ОтчетПоставщику);
	
	Возврат Запрос.Выполнить();
	
КонецФункции	

Функция СвязатьОтчеты(Отчет1,Отчет2,ДанныеПоОтчетам) Экспорт
	МассивСтрок = ДанныеПоОтчетам.НайтиСтроки(Новый Структура("Ссылка",Отчет2));
		Если МассивСтрок.Количество()>0  Тогда
			_Осталось = МассивСтрок[0].Осталось;
		Иначе 
			_Осталось = 0;
		КонецЕсли;	
		МассивСтрок = ДанныеПоОтчетам.НайтиСтроки(Новый Структура("Ссылка",Отчет1.Ссылка));
		_кРаспределению = 0 ;
		Если МассивСтрок.Количество()>0  Тогда
			_кРаспределению = МассивСтрок[0].Осталось;
		КонецЕсли;
		Если _Осталось>0 и _кРаспределению<0 Тогда
			_кРаспределениюВрем = - _кРаспределению;
			_кРаспределениюВрем = Мин(_Осталось,_кРаспределениюВрем);
			Док = Документы.уб_ВзаиморасчетСПоставщиком.СоздатьДокумент();
			Док.Дата = ТекущаяДата();
			Док.ВалютаДокумента = ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета;
			//Док.ДатаВходящегоДокумента  = В.ОплатаПлатежныйДокумент_Дата;
			//Док.НомерВходящегоДокумента = В.ОплатаПлатежныйДокумент_Номер;
			Док.ДокументИсточникОтсутствует = Истина;
			Док.ИсключитьИзВзаиморасчетов   = Ложь;
			Док.Категория     = Перечисления.уб_КатегорияЗадолженности.ЕстьОтчетПоставщику;
			Док.Комментарий   = "Перенос ДопКВ";
			Док.Контрагент    = Отчет1.Поставщик;
			Док.Поставщик     = Отчет1.Поставщик;
			Док.НаправлениеРасчетов = Перечисления.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика;
			Док.НеИзменятьПриЗагрузке = Ложь;
			Док.СуммаДокумента = 0;
			//Док.НераспределеныйОстаток = Оплата.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику;
			Док.ОрганизацияАгент = Отчет1.ОрганизацияАгент;
			Док.Ответственный    = ПараметрыСеанса.ТекущийПользователь;
			Док.ФормаОплаты      = Перечисления.уб_ФормаОплатыВзаиморасчеты.Безналично;
			СтрокаРаспределения = Док.Распределение.Добавить();
			СтрокаРаспределения.ОтчетПоставщику = Отчет1.Ссылка;
			СтрокаРаспределения.Сумма = -_кРаспределениюВрем;
			СтрокаРаспределения = Док.Распределение.Добавить();
			СтрокаРаспределения.ОтчетПоставщику = Отчет2;
			СтрокаРаспределения.Сумма = _кРаспределениюВрем;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);		
				Возврат Истина;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при проведении связки: "+Отчет1.Ссылка+"/"+Отчет2+"/"+ОписаниеОшибки();
				Сообщение.Сообщить();						
			Конецпопытки;	
		КонецЕсли;	
		Возврат ЛОЖЬ;
КонецФункции			

//Функция возвращаяет задолженность по отчету поставщику/ДВОУ
Функция ПолучитьЗадолженностьПоОтчетуПоставщика(ОтчетПоставщику,КатегорияЗадолженности = Неопределено ) Экспорт
	Запрос = Новый Запрос;
	
	Если КатегорияЗадолженности = "Наша" Тогда
		ТекстЗапроса = "";
	ИначеЕсли КатегорияЗадолженности = "Нам" Тогда	
		ТекстЗапроса = "";
	Иначе	
		ТекстЗапроса = "ВЫБРАТЬ
		               |	СуммыПоОтчету.ОтчетПоставщику,
		               |	СУММА(СуммыПоОтчету.Задолженность) КАК Задолженность
		               |ИЗ
		               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		ОплатыПолисов.ОтчетПоставщику КАК ОтчетПоставщику,
		               |		СУММА(ОплатыПолисов.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику - (ВЫРАЗИТЬ(ОплатыПолисов.КВСуммаДляОтчета КАК ЧИСЛО(15, 2)))) КАК Задолженность
		               |	ИЗ
		               |		Документ.уб_ОплатаПолисов КАК ОплатыПолисов
		               |	ГДЕ
		               |		НЕ ОплатыПолисов.ПометкаУдаления
		               |		И НЕ ОплатыПолисов.НеВключатьВОтчетыПоставщикам
		               |		И ВЫБОР
		               |				КОГДА ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ОплатыПолисов.ОтчетПоставщику.Дата >= ОплатыПолисов.Поставщик.ДатаВеденияВзаиморасчётов
		               |			КОНЕЦ
		               |		И ОплатыПолисов.ОтчетПоставщику = &ОтчетПоставщику
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ОплатыПолисов.ОтчетПоставщику
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ПлатежныеВедомости.ОтчетПоставщику,
		               |		ВЫБОР
		               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
		               |				ТОГДА ПлатежныеВедомости.Сумма
		               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
		               |					ИЛИ ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
		               |				ТОГДА -ПлатежныеВедомости.Сумма
		               |			КОГДА ПлатежныеВедомости.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.НачальныйОстаток)
		               |				ТОГДА ПлатежныеВедомости.Сумма
					   |			ИНАЧЕ 0
		               |		КОНЕЦ
		               |	ИЗ
		               |		Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ПлатежныеВедомости
		               |	ГДЕ
		               |		НЕ ПлатежныеВедомости.Ссылка.ПометкаУдаления
		               |		И ПлатежныеВедомости.ОтчетПоставщику = &ОтчетПоставщику
		               |		И ВЫБОР
		               |				КОГДА ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ПлатежныеВедомости.Ссылка.Дата >= ПлатежныеВедомости.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов
		               |			КОНЕЦ
		               |	    И НЕ ПлатежныеВедомости.Ссылка.ИсключитьИзВзаиморасчетов
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ДВОУ.Ссылка,
		               |		ВЫБОР
		               |			КОГДА ДВОУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.Штраф)
		               |				ТОГДА -ДВОУ.СуммаДокумента
		               |			ИНАЧЕ ДВОУ.СуммаДокумента
		               |		КОНЕЦ
		               |	ИЗ
		               |		Документ.уб_ДополнительныеРасчетыСПоставщикомДВОУШтрафы КАК ДВОУ
		               |	ГДЕ
		               |		ДВОУ.Проведен
		               |		И ДВОУ.Ссылка = &ОтчетПоставщику
		               |		И ВЫБОР
		               |				КОГДА ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов = ДАТАВРЕМЯ(1, 1, 1)
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ДВОУ.Дата >= ДВОУ.Поставщик.ДатаВеденияВзаиморасчётов
		               |			КОНЕЦ) КАК СуммыПоОтчету
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СуммыПоОтчету.ОтчетПоставщику";
	Конецесли;
	Запрос.Текст = ТекстЗапроса;				  
	Запрос.УстановитьПараметр("ОтчетПоставщику",ОтчетПоставщику);						  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Задолженность;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции 	

//Сделано на основе Ценообразование.ОкруглитьЦену из УТ
Функция ОкруглитьДоПорядка(Число, ПорядокОкругления=0.01 , ОкруглятьВБольшуюСторону) Экспорт

    Перем Результат;

    // Преобразуем порядок округления числа. 
    // Если передали пустое значение порядка, то округлим до копеек.  
    Порядок = Число(ПорядокОкругления);
        
    // вычислим количество интервалов, входящих в число 
    КоличествоИнтервал    = Число / Порядок;
        
    // вычислим целое количество интервалов. 
    КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
        
    Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
        
        // Числа поделились нацело. Округлять не нужно. 
        Результат    = Число;
    Иначе
        Если ОкруглятьВБольшуюСторону Тогда
            
            // При порядке округления "0.05" 0.371 должно округлитья до 0.4 
            Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
        Иначе

            // При порядке округления "0.05" 0.371 должно округлитья до 0.35, 
            // а 0.376 до 0.4 
            Результат = Порядок * Окр(КоличествоИнтервал,0,РежимОкругления.Окр15как20);
        КонецЕсли; 
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции // ОкруглитьДоПорядка()

