Перем ПараметрыОбмена Экспорт;

Процедура ВыполнитьОбмен() Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	ВыгрузитьИзмененияСКВ(ПараметрыОбмена.Дата1,ПараметрыОбмена.Дата2);
	
КонецПроцедуры


Процедура ИнициализироватьПараметры() Экспорт 
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("Дата1",ТекущаяДата()-3600*24);
	ПараметрыОбмена.Вставить("Дата2",ТекущаяДата());
КонецПроцедуры	


Функция ВыгрузитьИзмененияСКВ(Дата1,Дата2) Экспорт
	
	Запрос  = Новый Запрос ("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	уб_ИсторияРеквизит.ОбъектИстории КАК Оплата,
	                        |	уб_ИсторияРеквизит.РеквизитОбъекта.Наименование КАК НаименованиеРеквизита,
	                        |	уб_ИсторияРеквизит.ЗначениеРеквизита,
	                        |	уб_ИсторияРеквизит.Период,
	                        |	уб_ИсторияРеквизит.РеквизитОбъекта.Синоним
	                        |ПОМЕСТИТЬ ИзмененыеОплаты
	                        |ИЗ
	                        |	РегистрСведений.уб_ИсторияРеквизит КАК уб_ИсторияРеквизит
	                        |ГДЕ
	                        |	уб_ИсторияРеквизит.Период >= &ДатаНачала
	                        |	И уб_ИсторияРеквизит.Период <= &ДатаКонца
	                        |	И уб_ИсторияРеквизит.ОбъектИстории ССЫЛКА Документ.уб_ОплатаПолисов
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	Вложенный.НомерЗаявки КАК id,
	                        |	Вложенный.СКВ как SKV,
	                        |	ВЫРАЗИТЬ(ВЫБОР
	                        |			КОГДА Вложенный.НачисленнаяСуммаВзноса = Вложенный.СтраховойПолисСтраховаяПремия
	                        |				ТОГДА Вложенный.СКВ
	                        |			ИНАЧЕ ВЫБОР
	                        |					КОГДА Вложенный.НачисленнаяСуммаВзноса = 0
	                        |						ТОГДА Вложенный.СКВ
	                        |					ИНАЧЕ Вложенный.СКВ * Вложенный.СтраховойПолисСтраховаяПремия / Вложенный.НачисленнаяСуммаВзноса
	                        |				КОНЕЦ
	                        |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК SKV_plan,
	                        |	Вложенный.КВСумма как KV,
	                        |	ВЫРАЗИТЬ(ВЫБОР
	                        |			КОГДА Вложенный.НачисленнаяСуммаВзноса = Вложенный.СтраховойПолисСтраховаяПремия
	                        |				ТОГДА Вложенный.КВСумма
	                        |			ИНАЧЕ ВЫБОР
	                        |					КОГДА Вложенный.НачисленнаяСуммаВзноса = 0
	                        |						ТОГДА Вложенный.КВСумма
	                        |					ИНАЧЕ Вложенный.КВСумма * Вложенный.СтраховойПолисСтраховаяПремия / Вложенный.НачисленнаяСуммаВзноса
	                        |				КОНЕЦ
	                        |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК KV_plan,
	                        |	Вложенный.СтраховойПолис как polis_str,
	                        |	Вложенный.НачисленнаяСуммаВзноса как premia,
	                        |	Вложенный.СтраховойПолисСтраховаяПремия как premia_plan 
	                        |ИЗ
	                        |	(ВЫБРАТЬ
	                        |		СУММА(ВЫБОР
	                        |				КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	                        |						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	                        |							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	                        |						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	                        |					КОНЕЦ - ОП.КВСумма
	                        |					ТОГДА 0
	                        |				ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	                        |						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	                        |							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	                        |						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	                        |					КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	                        |			КОНЕЦ) КАК СКВ,
	                        |		СУММА(ОП.КВСумма) КАК КВСумма,
	                        |		МАКСИМУМ(ОП.СтраховойПолис.НомерЗаявки) КАК НомерЗаявки,
	                        |		ОП.СтраховойПолис КАК СтраховойПолис,
	                        |		ОП.СтраховойПолис.СтраховойПродукт.Вид КАК ВидСП,
	                        |		СУММА(ОП.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	                        |		ОП.СтраховойПолис.СтраховаяПремия КАК СтраховойПолисСтраховаяПремия
	                        |	ИЗ
	                        |		Документ.уб_ОплатаПолисов КАК ОП
	                        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |				ИзмененыеОплаты.Оплата КАК Оплата,
	                        |				уб_ИсторияОбъект.ОбъектИстории.СтраховойПолис.НомерЗаявки КАК ОбъектИсторииСтраховойПолисНомерЗаявки,
	                        |				уб_ИсторияОбъект.ОбъектИстории.СтраховойПолис КАК СтраховойПолис
	                        |			ИЗ
	                        |				ИзмененыеОплаты КАК ИзмененыеОплаты
	                        |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ИсторияОбъект КАК уб_ИсторияОбъект
	                        |					ПО ИзмененыеОплаты.Оплата = уб_ИсторияОбъект.ОбъектИстории
	                        |						И ИзмененыеОплаты.Период = уб_ИсторияОбъект.Период
	                        |			ГДЕ
	                        |				ИзмененыеОплаты.НаименованиеРеквизита В (""ОплаченоФакт"", ""СкидкаВыплаченаяКлиенту"", ""НачисленнаяСуммаВзноса"", ""КВСуммаДляАгента"", ""КВСумма"", ""ПолисАннулирован"", ""Проведен"", ""ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"", ""ПометкаУдаления"")
	                        |				И ТИПЗНАЧЕНИЯ(уб_ИсторияОбъект.ОбъектИстории.СтраховойПолис.НомерЗаявки) = ТИП(ЧИСЛО)) КАК Измененные
	                        |			ПО ОП.СтраховойПолис = Измененные.СтраховойПолис
	                        |	ГДЕ
	                        |		ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	                        |		И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	                        |		И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	                        |		И ОП.ПометкаУдаления = ЛОЖЬ
	                        |		И ОП.СтраховойПолис.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Личная)
							|       И ОП.СтраховойПолис.НомерЗаявки <> ЗНАЧЕНИЕ(Перечисление.уб_ВидыЗаявок.Агентская)
	                        |		И ОП.СтраховойПолис.СтраховойПродукт.Вид = ЗНАЧЕНИЕ(Перечисление.уб_ВидыСтраховыхПродуктов.Каско)
	                        |	
	                        |	СГРУППИРОВАТЬ ПО
	                        |		ОП.СтраховойПолис,
	                        |		ОП.СтраховойПолис.СтраховойПродукт.Вид,
	                        |		ОП.СтраховойПолис.СтраховаяПремия) КАК Вложенный
	                        |
	                        |УПОРЯДОЧИТЬ ПО
	                        |	НомерЗаявки");
							
	Запрос.УстановитьПараметр("ДатаНачала", Дата1);
	Запрос.УстановитьПараметр("ДатаКонца", Дата2);
	ТаблицаОплат = Запрос.Выполнить().Выгрузить();
	ВсегоСтрок = ТаблицаОплат.Количество();
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("xml");
	КоличествоСтрокВпорции = 100;
	Отправлено = 0;
	НомерПорции = 0;
	Пока Отправлено < ВсегоСтрок Цикл
		//НачалоИнтервала = Отправлено+1;
		КонецИнтервала = Мин(Отправлено+КоличествоСтрокВпорции,ВсегоСтрок);
		МассивСтрок = Новый Массив;
		Для НачалоИнтервала  = (Отправлено+1) по КонецИнтервала Цикл
			МассивСтрок.Добавить(ТаблицаОплат[НачалоИнтервала-1]);
		КонецЦикла;	
		Порция = ТаблицаОплат.Скопировать(МассивСтрок);
		НомерПорции = НомерПорции+1;
		Строкаjson = уб_B2B.JSON(Порция);
		
		Строка = "<?xml version=""1.0"" encoding=""UTF-8""?>
		|<rq type='skv' comp_name='"+ИмяКомпьютера()+"' sessid='' uid='"+УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID")+"' hash='"+уб_СЕРВЕРные.SID()+"' info_skv='"+Строкаjson+"'/>";
		Текст = Новый ТекстовыйДокумент;
		Текст.ДобавитьСтроку(Строка);
		Текст.Записать(ИмяФайлаОтправки);
		//Сообщить(ИмяФайлаОтправки);
		
		Сервер = "www.sluice";
		Порт = 80 ;
		
		HTTP = Новый HTTPСоединение(Сервер, Порт);
		
		ИмяПолученногоФайла = ПолучитьИмяВременногоФайла("tmp");
		
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "text/xml;");
		
		Попытка
			HTTP.ОтправитьДляОбработки(ИмяФайлаОтправки, "", ИмяПолученногоФайла, ЗаголовокHTTP);
		Исключение
			
			//уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить(СформироватьТекстОшибки(ОписаниеОшибки()),"Предупреждение");
		КонецПопытки;
		УдалитьФайлы(ИмяФайлаОтправки,);

		#Если Клиент Тогда
			Текст = Новый ТекстовыйДокумент; 
			Текст.Прочитать(ИмяПолученногоФайла,"windows-1251"); 
			Сообщить("Порция "+НомерПорции+Символы.ПС+Текст.ПолучитьТекст());
		#КонецЕсли
		
		Отправлено = КонецИнтервала;
	КонецЦикла;	

	
	//ОбъектXML = Новый ЗаписьXML;
	//ОбъектXML.ОткрытьФайл(ИмяФайлаОтправки, "UTF-8");
	//ОбъектXML.ЗаписатьОбъявлениеXML();
	//
	//ОбъектXML.ЗаписатьНачалоЭлемента("rq");
	////ОбъектXML.ЗаписатьАтрибут("task_id", Формат(task_id,"ЧГ=0"));
	//ОбъектXML.ЗаписатьАтрибут("info_skv", Строкаjson );
	////ОбъектXML.ЗаписатьАтрибут("hash", "b22be856-b27a-4ee2-beae-2491403c2a85");//УИД ЖЕЛЕЗА ВРЕМЕННЫЙ!!!
	//ОбъектXML.ЗаписатьАтрибут("hash", уб_СЕРВЕРные.SID());
	//ОбъектXML.ЗаписатьАтрибут("uid", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "MarkerUsrID"));
	//ОбъектXML.ЗаписатьАтрибут("sessid", "");
	//ОбъектXML.ЗаписатьАтрибут("comp_name", ИмяКомпьютера());              ,
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	//ОбъектXML.ЗаписатьБезОбработки("");
	//ОбъектXML.Закрыть();
	
	
	УдалитьФайлы(ИмяФайлаОтправки,);
	УдалитьФайлы(ИмяПолученногоФайла,);
	
//	Возврат Текст;
КонецФункции	