
Функция Сформировать(СтруктураПараметров,СоздатьСписок = Истина) Экспорт
	
	СтруктураПараметров.Вставить("Макет", Справочники.КонтактныеЛица.ПолучитьМакет("Макет"));

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СтруктураПараметров.Макет.ПолучитьОбласть("ШапкаТаб"));
	ТабличныйДокумент.ФиксацияСверху = 1;
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();	
	//
	//ВыборкаКонтактныеЛица = Неопределено;    
	//ВыборкаДоговоров = Неопределено;
	//ВыборкаПараметровДиО = Неопределено;
	//КонтактнаяИнформацияСК = Неопределено;//страховых компаний
	//КонтактнаяИнформацияКЛ = Неопределено;//контактных лиц
	//Для Каждого СтрокаСК Из ДайСписокСК(СоздатьСписок) Цикл
//	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыборкаКонтактныеЛица", Неопределено);
	СтруктураПараметров.Вставить("ВыборкаДоговоров", Неопределено);
	СтруктураПараметров.Вставить("ВыборкаПараметровДиО", Неопределено);
	СтруктураПараметров.Вставить("КонтактнаяИнформацияСК", Неопределено);
	СтруктураПараметров.Вставить("КонтактнаяИнформацияКЛ", Неопределено);
	СтруктураПараметров.Вставить("ЛимитыСтрахования", Неопределено);
	
	Для Каждого СтрокаСК Из ДайСписокСК(Ложь, СтруктураПараметров) Цикл	
		ВыводитьСК 			= Истина;
		ЕстьДоговора 		= Ложь;
		ЕстьКонтЛица 		= Ложь;
		ЕстьПараметрыДиО    = Ложь;		
		ЕстьЛимиты          = ЛОЖЬ;
		
		//выборка договоров
		ВыборкаДоговоровПоСК = Неопределено;
		Если СтруктураПараметров.ВыборкаДоговоров <> Неопределено Тогда
			Поиск = Новый Структура("СК");
			Поиск.СК = СтрокаСК.СК;
			СтруктураПараметров.ВыборкаДоговоров.Сбросить();
			Если СтруктураПараметров.ВыборкаДоговоров.НайтиСледующий(Поиск) Тогда
				ЕстьДоговора = Истина;
				ВыборкаДоговоровПоСК = СтруктураПараметров.ВыборкаДоговоров.Выбрать();
			Конецесли;	
		КонецЕсли;	
		//выборка контактных лиц
		ВыборкаКонтактныеЛицаПоСК = Неопределено;
		Если СтруктураПараметров.ВыборкаКонтактныеЛица <> Неопределено Тогда
			Поиск = Новый Структура("СК");
			Поиск.СК = СтрокаСК.СК;
			СтруктураПараметров.ВыборкаКонтактныеЛица.Сбросить();
			Если СтруктураПараметров.ВыборкаКонтактныеЛица.НайтиСледующий(Поиск) Тогда
				ЕстьКонтЛица = Истина;
				ВыборкаКонтактныеЛицаПоСК = СтруктураПараметров.ВыборкаКонтактныеЛица.Выбрать();
			Конецесли;	
		КонецЕсли;
		//выборка параметры ДиО
		ВыборкаПараметрыДиОПоСК = Неопределено;
		Если СтруктураПараметров.ВыборкаПараметровДиО <> Неопределено Тогда
			Поиск = Новый Структура("СК");
			Поиск.СК = СтрокаСК.СК;
			СтруктураПараметров.ВыборкаПараметровДиО.Сбросить();
			Если СтруктураПараметров.ВыборкаПараметровДиО.НайтиСледующий(Поиск) Тогда
				ЕстьПараметрыДиО = Истина;
				ВыборкаПараметрыДиОПоСК = СтруктураПараметров.ВыборкаПараметровДиО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Конецесли;	
		КонецЕсли;
		
		//выборка лимиты страхования
		ЛимитыСтрахованияПоСК = Неопределено;
		Если СтруктураПараметров.ЛимитыСтрахования <> Неопределено Тогда
			Поиск = Новый Структура("СК");
			Поиск.СК = СтрокаСК.СК;
			СтруктураПараметров.ЛимитыСтрахования.Сбросить();
			Если СтруктураПараметров.ЛимитыСтрахования.НайтиСледующий(Поиск) Тогда
				ЕстьЛимиты = Истина;
				ЛимитыСтрахованияПоСК = СтруктураПараметров.ЛимитыСтрахования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Конецесли;	
		КонецЕсли;
		
		Если ЕстьДоговора Или ЕстьКонтЛица Тогда			
			ЗаполнитьПараметрыСтраховойКомпании(СтрокаСК.СК, СтрокаСК.Наименование, СтрокаСК.ДатаВеденияВзаиморасчётов, СтруктураПараметров.КонтактнаяИнформацияСК,ТабличныйДокумент,СтруктураПараметров);
		КонецЕсли;
		
		Если ЕстьДоговора Тогда
			ЗаполнитьДоговора(ВыборкаДоговоровПоСК,ТабличныйДокумент,СтруктураПараметров);						
		КонецЕсли;	
		Если ЕстьПараметрыДиО Тогда
			ЗаполнитьПараметрыДиО(ВыборкаПараметрыДиОПоСК, СтрокаСК.СК,ТабличныйДокумент,СтруктураПараметров);						
		КонецЕсли;
		Если ЕстьКонтЛица Тогда
			ЗаполнитьПараметрыСтроки(ВыборкаКонтактныеЛицаПоСК, СтруктураПараметров.КонтактнаяИнформацияКЛ, СтрокаСК.СК,ТабличныйДокумент,СтруктураПараметров);
		КонецЕсли;	
		Если ЕстьЛимиты Тогда
			ЗаполнитьПараметрыСтрокиЛимиты(ЛимитыСтрахованияПоСК, СтруктураПараметров.ЛимитыСтрахования, СтрокаСК.СК,ТабличныйДокумент,СтруктураПараметров);
		КонецЕсли;	
		
	КонецЦикла;
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат ТабличныйДокумент
КонецФункции
Функция ПолучитьТекстЗапросаЛимитыСтрахования()
	Возврат "ВЫБРАТЬ
	        |	СК_БезПовторяющихся.СК КАК СК,
	        |	СК_БезПовторяющихся.Наименование КАК СКНаименование,
	        |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.УсловиеПрименения,
	        |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.ТипЛимита,
	        |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Лимит,
	        |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.Комментарий,
	        |	уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.СК.Андеррайтер
	        |ИЗ
	        |	СК_БезПовторяющихся КАК СК_БезПовторяющихся
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ЛимитыРазрешенийНаСтрахование.СрезПоследних(&Дата, ) КАК уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних
	        |		ПО СК_БезПовторяющихся.СК = уб_ЛимитыРазрешенийНаСтрахованиеСрезПоследних.СК
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	СКНаименование
	        |ИТОГИ ПО
	        |	СК"; 
КонецФункции
		
Процедура ЗаполнитьПараметрыСтрокиЛимиты(СтрокаТЗ, ВыборкаЛимитыСтрахования, СК,ТабличныйДокумент,СтруктураПараметров)
		
	Если СтрокаТЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЗ.Следующий();
    Андеррайтер = СтрокаТЗ.СКАндеррайтер;
	Если СтрокаТЗ.ТипЛимита = NULL Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаТЗ.Сбросить();
	
	//Выводим заголовок лимиты страхования	
	ОбластьЛимитыСтрахования = СтруктураПараметров.Макет.ПолучитьОбласть("ЛимитыСтрахования");
	ОбластьЛимитыСтрахования.Параметры.СКСсылка = СК;
	ОбластьЛимитыСтрахования.Параметры.Андеррайтер = Андеррайтер;
	ТабличныйДокумент.Вывести(ОбластьЛимитыСтрахования, 2, "ЛимитыСтрахования");		
	//Выводим строки лимиты страхования	
	Пока СтрокаТЗ.Следующий() Цикл
		ОбластьСтрока = СтруктураПараметров.Макет.ПолучитьОбласть("СтрокаЛимиты");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЗ);
		ОбластьСтрока.Параметры.СКСсылка = СК;
		ТабличныйДокумент.Вывести(ОбластьСтрока, 3, "СтрокаЛимиты");
	КонецЦикла;
	
КонецПроцедуры


Функция ДайСписокСК(СоздатьСписок,СтруктураПараметров)
	
	НомераПакетов = Новый Структура;	
	//эуСК_Текст = СокрЛП(ЭлементыФормы.эуСК.text);
	//эуСК_Текст = ?(СтрДлина(эуСК_Текст) > 2, эуСК_Текст, "");
	ЗапросСК = Новый Запрос;
	ЗапросСК.Текст = "ВЫБРАТЬ
	|	КонтактныеЛица.ОбъектВладелец КАК СК,
	|	КонтактныеЛица.ОбъектВладелец.Наименование КАК Наименование,
	|	isnull(КонтактныеЛица.ОбъектВладелец.ДатаВеденияВзаиморасчётов,ДатаВремя(1,1,1)) Как ДатаВеденияВзаиморасчётов
	|ПОМЕСТИТЬ СтраховыеКомпании
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.ОбъектВладелец.Родитель.Наименование <> ""НЕ АКТИВНЫЕ""
	|	И НЕ КонтактныеЛица.ПометкаУдаления
	|	"+ ?(Не ЗначениеЗаполнено(СтруктураПараметров.СК), "", " И КонтактныеЛица.ОбъектВладелец =  &СКСсылка ") +"
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Владелец.Наименование,
	|	ДоговорыКонтрагентов.Владелец.ДатаВеденияВзаиморасчётов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Наименование <> ""Основной договор""
	|	И Не ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Наименование <> ""---""
	|	И ДоговорыКонтрагентов.Владелец.Родитель.Наименование <> ""НЕ АКТИВНЫЕ""
	//|	"+ ?(Не ЗначениеЗаполнено(эуСК_Текст) Или ТипЗнч(ВыбранноеСК) = Тип("СправочникСсылка.Контрагенты"), "", "И (ДоговорыКонтрагентов.Владелец.Наименование ПОДОБНО &СК ИЛИ ДоговорыКонтрагентов.Владелец.Наименование ПОДОБНО &СКПеревод)") +"
	|	"+ ?(Не ЗначениеЗаполнено(СтруктураПараметров.СК), "", " И ДоговорыКонтрагентов.Владелец = &СКСсылка ") +	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеКомпании.СК,
	|	СтраховыеКомпании.Наименование,
	|	СтраховыеКомпании.ДатаВеденияВзаиморасчётов
	|ПОМЕСТИТЬ СК_БезПовторяющихся
	|ИЗ
	|	СтраховыеКомпании КАК СтраховыеКомпании ГДЕ  СтраховыеКомпании.СК В ИЕРАРХИИ(Значение(Справочник.Контрагенты.СтраховыеКомпании)) или СтраховыеКомпании.СК В(Значение(Справочник.Контрагенты.СтраховыеКомпании))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СК_БезПовторяющихся.СК,
	|	СК_БезПовторяющихся.Наименование,
	|	СК_БезПовторяющихся.ДатаВеденияВзаиморасчётов
	|ИЗ
	|	СК_БезПовторяющихся КАК СК_БезПовторяющихся
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	СК_БезПовторяющихся.СК
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СК_БезПовторяющихся КАК СК_БезПовторяющихся
	|		ПО КонтактнаяИнформация.Объект = СК_БезПовторяющихся.СК
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресКонтрагентаФактический)
	|				ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|ИТОГИ ПО
	|	СК";		
	Если ТипЗнч(СтруктураПараметров.СК) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЗапросСК.УстановитьПараметр("СКСсылка", СтруктураПараметров.СК);
	//ИначеЕсли ЗначениеЗаполнено(эуСК_Текст) Тогда
	//	ЗапросСК.УстановитьПараметр("СК", "%" + эуСК_Текст + "%");
	//	ЗапросСК.УстановитьПараметр("СКПеревод", "%" + уб_Фильтры.ПеревестиСтроку(эуСК_Текст) + "%");
	КонецЕсли;
	СчетчикПакетов = 3;
	Если СтруктураПараметров.ПоказыватьКонтЛица Тогда
		ЗапросСК.Текст = ЗапросСК.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + ПолучитьТекстЗапросаКонтактныхЛиц();
		ЗапросСК.УстановитьПараметр("Роль", 										Справочники.РолиКонтактныхЛиц.НеРаботает);
		ЗапросСК.УстановитьПараметр("ЕстьПравоПросмотраОграниченных",				Не ПараметрыСеанса.уб_ЭтоМенеджер);
		ЗапросСК.УстановитьПараметр("ЕстьПравоОтображатьТолькоДляУполномоченных",   уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоПросмотраСкрытыхКонтактов, Ложь));
		СчетчикПакетов = СчетчикПакетов + 2;
		НомераПакетов.Вставить("ВыборкаКонтактныеЛица",СчетчикПакетов);
						
		СчетчикПакетов = СчетчикПакетов + 1;
		НомераПакетов.Вставить("КонтактнаяИнформацияКЛ",СчетчикПакетов);
		
	КонецЕсли;
	
	Если СтруктураПараметров.ПоказыватьДоговора Тогда
		ЗапросСК.Текст = ЗапросСК.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + ПолучитьТекстЗапросаДоговоры();
		СчетчикПакетов = СчетчикПакетов + 1;
		НомераПакетов.Вставить("ВыборкаДоговоров", СчетчикПакетов);				
	КонецЕсли;
	
	Если СтруктураПараметров.ПоказыватьПараметрыДиО Тогда
		ЗапросСК.Текст = ЗапросСК.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + ПолучитьТекстЗапросаПараметрыДиО();
		СчетчикПакетов = СчетчикПакетов + 1;
		НомераПакетов.Вставить("ВыборкаПараметровДиО",СчетчикПакетов);				
	КонецЕсли;
	
	//чкн
	Если СтруктураПараметров.ПоказыватьЛимиты Тогда
		ЗапросСК.Текст = ЗапросСК.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|" + ПолучитьТекстЗапросаЛимитыСтрахования();
		СчетчикПакетов = СчетчикПакетов + 1;
		НомераПакетов.Вставить("ЛимитыСтрахования", СчетчикПакетов);				
	КонецЕсли;
	//чкн
	ЗапросСК.УстановитьПараметр("ОсновнаяОрганизация", ПараметрыСеанса.уб_ОсновнаяОрганизация);
	ЗапросСК.УстановитьПараметр("Дата", ТекущаяДата());
	Пакет = ЗапросСК.ВыполнитьПакет();
	ВыборкаСК = Пакет[2].Выгрузить();
	СтруктураПараметров.КонтактнаяИнформацияСК = Пакет[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если СтруктураПараметров.ПоказыватьКонтЛица Тогда 
		СтруктураПараметров.ВыборкаКонтактныеЛица = Пакет[НомераПакетов.ВыборкаКонтактныеЛица].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СтруктураПараметров.КонтактнаяИнформацияКЛ = Пакет[НомераПакетов.КонтактнаяИнформацияКЛ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;	
	
	Если СтруктураПараметров.ПоказыватьДоговора Тогда
		СтруктураПараметров.ВыборкаДоговоров = Пакет[НомераПакетов.ВыборкаДоговоров].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	Если СтруктураПараметров.ПоказыватьПараметрыДиО Тогда
		//ВыборкаПараметровДиО = ЗапросПараметровДиО.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		СтруктураПараметров.ВыборкаПараметровДиО = Пакет[НомераПакетов.ВыборкаПараметровДиО].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	Если СтруктураПараметров.ПоказыватьЛимиты тогда
		СтруктураПараметров.ЛимитыСтрахования = Пакет[НомераПакетов.ЛимитыСтрахования].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	//ВыбранноеСК = Неопределено;
	/////////////////////////
	//// выпадающий список //
	//Если СоздатьСписок Тогда
	//	Если ЗначениеЗаполнено(эуСК_Текст) Тогда
	//		//стираем список
	//		ВыпадающийСписок.Clear();
	//		_ВыпадающийСписок = Новый Массив;
	//		Выборка = ВыборкаСК.ВыгрузитьКолонку("СК");
	//		Индекс = 0;
	//		//если строка начата английскими, добавляем в список перевод
	//		Перевод = уб_Фильтры.ПеревестиСтроку(эуСК_Текст,,"ru");
	//		Если Перевод <> эуСК_Текст Тогда
	//			ВыпадающийСписок.AddItem("""" + Перевод + """");
	//			_ВыпадающийСписок.Добавить(Перевод);
	//		КонецЕсли;
	//		//добавляем значения в список
	//		Для Каждого Элемент Из Выборка Цикл
	//			Если НРег(Элемент.Наименование) <> эуСК_Текст И НРег(Элемент.Наименование) <> Перевод Тогда
	//				ВыпадающийСписок.AddItem(Элемент.Наименование);
	//				_ВыпадающийСписок.Добавить(Элемент);
	//			КонецЕсли;
	//		КонецЦикла;
	//		//видимость выпадающего списка
	//		ВыпадающийСписок.Видимость = ?(ВыпадающийСписок.ListCount() > 0, Истина, Ложь);
	//		ВыпадающийСписок.Высота = Окр(ВыпадающийСписок.ListCount() *13.5) + 3;
	//	Иначе
	//		//скрываем
	//		ВыпадающийСписок.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат ВыборкаСК;
	
КонецФункции



Функция ЗаполнитьПараметрыСтраховойКомпании(СК, Наименование, ДатаВеденияВзаиморасчетов, КонтактнаяИнформацияСК,ТабличныйДокумент,СтруктураПараметров)
	
	ОбластьСК = СтруктураПараметров.Макет.ПолучитьОбласть("СК");
	//++Кожевников С.А.
	//ОбластьСК.Параметры.СК 			= Строка(СК);
	ОбластьСК.Параметры.СК 			= Наименование;
	//--Кожевников С.А.
	ОбластьСК.Параметры.СКСсылка 	= СК;	
	// для установки примечаний с датой взаиморасчета для СК
	ОбластьСКСК = ОбластьСК.Область(1,1,3,1);
	Примечание  = ПолучитьПримечание(ДатаВеденияВзаиморасчетов);
	ОбластьСКСК.Примечание.Текст = Примечание;
	//контактная информация СК	
	Если КонтактнаяИнформацияСК <> Неопределено Тогда
		Поиск = Новый Структура("СК");
		Поиск.СК = СК;
		КонтактнаяИнформацияСК.Сбросить();
		Если КонтактнаяИнформацияСК.НайтиСледующий(Поиск) Тогда			
			СтрокаКИ = КонтактнаяИнформацияСК.Выбрать();
			Пока СтрокаКИ.Следующий() Цикл
				Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресКонтрагентаФактический Тогда
					ОбластьСК.Параметры.АдресФактический = СтрокаКИ.Представление;
				ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
					ОбластьСК.Параметры.Телефон = СтрокаКИ.Представление;
				КонецЕсли;
			КонецЦикла;
		Конецесли;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьСК, 1, "СК");
	
КонецФункции

Процедура ЗаполнитьДоговора(СтрокаТЗ,ТабличныйДокумент,СтруктураПараметров)
	
	Если СтрокаТЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ТекущаяДата = ТекущаяДата();
	//Выводим заголовок Договора
	ОбластьДоговор = СтруктураПараметров.Макет.ПолучитьОбласть("Договор");
	ТабличныйДокумент.Вывести(ОбластьДоговор, 2, "Договор");		
	Пока СтрокаТЗ.Следующий() Цикл
		//Выводим строки Договора
		//Для Каждого СтрокаТЗ Из ВыборкаДоговоров Цикл
		ОбластьСтрокаДоговор = СтруктураПараметров.Макет.ПолучитьОбласть("СтрокаДоговор");		
		ОбластьСтрокаДоговор.Параметры.СК 					= СтрокаТЗ.СКНаименование;
		ОбластьСтрокаДоговор.Параметры.ОргАгент 			= СокрЛП(СтрокаТЗ.ОргАгентНаименование);				
		ОбластьСтрокаДоговор.Параметры.НомерДоговора 		= СокрЛП(СтрокаТЗ.НомерДоговора);
		ОбластьСтрокаДоговор.Параметры.ДатаЗаключения 		= Формат(СтрокаТЗ.ДатаЗаключения, "ДФ='dd.MM.yyyy'");
		ОбластьСтрокаДоговор.Параметры.ДатаОкончания 		= ?(Не ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончания), "Бессрочный", Формат(СтрокаТЗ.ДатаОкончания, "ДФ='dd.MM.yyyy'"));
		ОбластьСтрокаДоговор.Параметры.ДопХарактеристика 	= СокрЛП(СтрокаТЗ.ДопХарактеристика);
		ОбластьСтрокаДоговор.Параметры.ДоговорСсылка 		= СтрокаТЗ.Ссылка;		
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ДатаОкончания) Тогда
			ОбластьСтрокаДоговор.ТекущаяОбласть.ЦветФона = Новый Цвет(255, 255, 185);
		ИначеЕсли СтрокаТЗ.ДатаОкончания < ТекущаяДата() Тогда
			ОбластьСтрокаДоговор.ТекущаяОбласть.ЦветФона = Новый Цвет(255, 140, 140);
		ИначеЕсли СтрокаТЗ.ДатаОкончания - 604800 < ТекущаяДата() Тогда //60*60*24*7
			ОбластьСтрокаДоговор.ТекущаяОбласть.ЦветФона = Новый Цвет(255, 220, 220);	
		КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьСтрокаДоговор, 3, "СтрокаДоговор", ?(СтруктураПараметров.ДоговораРазвернуто, Истина, Ложь));
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыДиО(Строка, СК,ТабличныйДокумент,СтруктураПараметров);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Выводим заголовок Параметры договоров и отчетов
	ОбластьПараметрыДиО = СтруктураПараметров.Макет.ПолучитьОбласть("ПараметрыДиО");
	ОбластьПараметрыДиО.Параметры.РасшифровкаПараметров = СК;
	ТабличныйДокумент.Вывести(ОбластьПараметрыДиО, 2, "ПараметрыДиО"); 	
	//Выводим строку Параметров договоров и отчетов
	Область = СтруктураПараметров.Макет.ПолучитьОбласть("СтрокаПараметрыДиО");
	ПараметрДиО = "";	
	Индекс 		= 0;
	ПараметрДиО = "";
	Если Строка.Следующий() Тогда		
		ФИО = СокрЛП(Строка.Фамилия + " " + Строка.Имя + " " + Строка.Отчество);
		Если ПустаяСтрока(ФИО) Тогда
			ФИО = СокрЛП(Строка.НаименованиеКонтактногоЛица);
		КонецЕсли;
		Если Не ПустаяСтрока(ФИО) Тогда
			ПараметрДиО = ПараметрДиО + "ФИО: " + ФИО;
			ПараметрДиО = ПараметрДиО + ?(Прав(ПараметрДиО,1) = "."," ",". ");
		КонецЕсли;
		Если Не ПустаяСтрока(Строка.Должность) Тогда
			ПараметрДиО = ПараметрДиО + "Должность: " + СокрЛП(Строка.Должность);
			ПараметрДиО = ПараметрДиО + ?(Прав(ПараметрДиО,1) = "."," ",". ");
		КонецЕсли;
		Если Не ПустаяСтрока(Строка.ОснованиеДействия) Тогда
			ПараметрДиО = ПараметрДиО + "Основание действия: " + СокрЛП(Строка.ОснованиеДействия);
			ПараметрДиО = ПараметрДиО + ?(Прав(ПараметрДиО,1) = "."," ",". ");
		КонецЕсли;
		Если Не ПустаяСтрока(Строка.Доверенность) Тогда
			ПараметрДиО = ПараметрДиО + "Доверенность агента: " + СокрЛП(Строка.Доверенность);
			ПараметрДиО = ПараметрДиО + ?(Прав(ПараметрДиО,1) = ".","",".");
		КонецЕсли;
	КонецЕсли;
	ПараметрДиО = СокрЛП(ПараметрДиО);
	Область.Параметры.ПараметрДиО = ПараметрДиО;
	Область.Параметры.РасшифровкаПараметров = СК;
	ТабличныйДокумент.Вывести(Область, 3, "СтрокаПараметрыДиО", ?(СтруктураПараметров.ДиОРазвернуто, Истина, Ложь));
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСтроки(СтрокаТЗ, КонтактнаяИнформацияКЛ, СК,ТабличныйДокумент,СтруктураПараметров)
	
	ДоступККонтактам = Не ПараметрыСеанса.уб_ЭтоМенеджер;
	Если СтрокаТЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	//Выводим заголовок Контактные лица
	ОбластьКонтактныеЛица = СтруктураПараметров.Макет.ПолучитьОбласть("КонтактныеЛица");
	ОбластьКонтактныеЛица.Параметры.КонтактныеЛицаРасшифровка = СК;
	ТабличныйДокумент.Вывести(ОбластьКонтактныеЛица, 2, "КонтактныеЛица");		
	//Выводим строки Контактных лиц	
	Пока СтрокаТЗ.Следующий() Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ОсновноеКонтактноеЛицо) И СтрокаТЗ.ОсновноеКонтактноеЛицо = СтрокаТЗ.Ссылка Тогда
			//ОбластьСтрока.Области.Строка.Шрифт = Новый Шрифт(ОбластьСтрока.Области.Строка.Шрифт,,,Истина);
			//ОбластьСтрока.Область(1,3).Шрифт = Новый Шрифт(ОбластьСтрока.Области.Строка.Шрифт,,,Истина);
			ОбластьСтрока = СтруктураПараметров.Макет.ПолучитьОбласть("СтрокаОсновногоКонтактногоЛица");
		Иначе
			ОбластьСтрока = СтруктураПараметров.Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЗ.КонтактноеЛицоДляПечатныхФорм) И СтрокаТЗ.КонтактноеЛицоДляПечатныхФорм = СтрокаТЗ.Ссылка Тогда
			ОбластьСтрока.Рисунки[0].Картинка = БиблиотекаКартинок.Печать;
			ОбластьСтрока.Параметры.ФИО 	= "     " + СтрокаТЗ.ФИО;
		Иначе
			ОбластьСтрока.Рисунки.Удалить(ОбластьСтрока.Рисунки[0]);
			ОбластьСтрока.Параметры.ФИО 	= СтрокаТЗ.ФИО;
		КонецЕсли;
		//ОбластьСтрока.Параметры.СК 			= СтрокаТЗ.СК;
		ОбластьСтрока.Параметры.СК 			= СтрокаТЗ.СКНаименование;
		ОбластьСтрока.Параметры.Должность 	= СтрокаТЗ.Должность;		
		//ОбластьСтрока.Параметры.СК	= СтрокаТЗ.СК;
		ОбластьСтрока.Параметры.СКСсылка	= СтрокаТЗ.СК;		
		ОбластьСтрока.Параметры.ФИОСсылка 	= СтрокаТЗ.Ссылка;
		//ВыводитьКонтакты = ?(ДоступККонтактам = Ложь И СтрокаТЗ.Ссылка.СкрытьКонтактыДляОграниченныхПрав, Ложь, Истина);
		ВыводитьКонтакты = ?(ДоступККонтактам = Ложь И СтрокаТЗ.СсылкаСкрытьКонтактыДляОграниченныхПрав, Ложь, Истина);				
		Если КонтактнаяИнформацияКЛ <> Неопределено Тогда
			Поиск = Новый Структура("Ссылка");
			Поиск.Ссылка = СтрокаТЗ.Ссылка;
			КонтактнаяИнформацияКЛ.Сбросить();
			Если КонтактнаяИнформацияКЛ.НайтиСледующий(Поиск) Тогда			
				СтрокаКИ = КонтактнаяИнформацияКЛ.Выбрать();
				Пока СтрокаКИ.Следующий() Цикл
					Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаРабочий Тогда
						ОбластьСтрока.Параметры.НомерТелефонаРабочий = ?(ВыводитьКонтакты,СтрокаКИ.Представление,"**********");
					ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтактногоЛица Тогда
						ОбластьСтрока.Параметры.АдресЭлектроннойПочты = СтрокаКИ.Представление;	
					ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаМобильный Тогда
						ОбластьСтрока.Параметры.НомерТелефонаМобильный = ?(ВыводитьКонтакты,СтрокаКИ.Представление,"**********");
					ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресКонтактногоЛица Тогда
						ОбластьСтрока.Параметры.Адрес = ?(ВыводитьКонтакты,СтрокаКИ.Представление,"**********");
					КонецЕсли;
				КонецЦикла;
			Конецесли;	
		КонецЕсли;		
		ТабличныйДокумент.Вывести(ОбластьСтрока, 3, "Строка");
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьПримечание(Дата)

	Если Дата <> '00010101' Тогда
		Возврат "Дата начала взаиморасчетов: " + Формат(Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;

КонецФункции // ПолучитьНачалоВзаиморасчетов()



Функция ПолучитьТекстЗапросаКонтактныхЛиц()
	
	Возврат 
	"ВЫБРАТЬ
	|	КонтактныеЛица.Наименование КАК НаименованиеКонтактногоЛица,
	|	КонтактныеЛица.Ссылка КАК Ссылка,
	|	СК_БезПовторяющихся.СК КАК СК,
	|	СК_БезПовторяющихся.Наименование КАК СКНаименование,
	|	КонтактныеЛица.Ссылка.СкрытьКонтактыДляОграниченныхПрав КАК СсылкаСкрытьКонтактыДляОграниченныхПрав,
	|	КонтактныеЛица.Должность КАК Должность,
	|	КонтактныеЛица.Представление КАК ФИО,
	|	Контрагенты.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицо,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОсновноеКонтактноеЛицо = КонтактныеЛица.Ссылка
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ОснЛицо,
	|	уб_ПараметрыДоговоровИОтчетовСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицоДляПечатныхФорм
	|ПОМЕСТИТЬ КонтактныеЛица
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СК_БезПовторяющихся КАК СК_БезПовторяющихся
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ПараметрыДоговоровИОтчетов.СрезПоследних(
	|					&Дата,
	|					ОрганизацияАгент = &ОсновнаяОрганизация
	|						И Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК уб_ПараметрыДоговоровИОтчетовСрезПоследних
	|			ПО (уб_ПараметрыДоговоровИОтчетовСрезПоследних.Поставщик = СК_БезПовторяющихся.СК)
	|		ПО КонтактныеЛица.ОбъектВладелец = СК_БезПовторяющихся.СК
	|			И (КонтактныеЛица.Роль <> &Роль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтактныеЛица.ОбъектВладелец = Контрагенты.Ссылка
	|			И (НЕ КонтактныеЛица.ПометкаУдаления)
	|ГДЕ
	|	НЕ КонтактныеЛица.ПометкаУдаления
	|	И (&ЕстьПравоПросмотраОграниченных
	|			ИЛИ НЕ КонтактныеЛица.СкрытьКонтактыДляОграниченныхПрав)
	|	И (&ЕстьПравоОтображатьТолькоДляУполномоченных
	|			ИЛИ НЕ КонтактныеЛица.ОтображатьТолькоДляУполномоченных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактныеЛица.НаименованиеКонтактногоЛица КАК НаименованиеКонтактногоЛица,
	|	КонтактныеЛица.Ссылка КАК Ссылка,
	|	КонтактныеЛица.СК КАК СК,
	|	КонтактныеЛица.СКНаименование КАК СКНаименование,
	|	КонтактныеЛица.СсылкаСкрытьКонтактыДляОграниченныхПрав,
	|	КонтактныеЛица.Должность КАК Должность,
	|	КонтактныеЛица.ФИО КАК ФИО,
	|	КонтактныеЛица.ОсновноеКонтактноеЛицо,
	|	КонтактныеЛица.ОснЛицо КАК ОснЛицо,
	|	КонтактныеЛица.КонтактноеЛицоДляПечатныхФорм
	|ИЗ
	|	КонтактныеЛица КАК КонтактныеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОснЛицо,
	|	НаименованиеКонтактногоЛица,
	|	ФИО,
	|	КонтактныеЛица.СК,
	|	Ссылка,
	|	Должность
	|ИТОГИ ПО
	|	СК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактныеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтактныеЛица КАК КонтактныеЛица
	|		ПО КонтактнаяИнформация.Объект = КонтактныеЛица.Ссылка
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаРабочий)
	|				ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтактногоЛица)
	|				ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛицаМобильный)
	|				ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресКонтактногоЛица))
	|ИТОГИ ПО
	|	Ссылка";
	
КонецФункции	

Функция ПолучитьТекстЗапросаДоговоры()
	
	Возврат 
	"ВЫБРАТЬ
	|	ДК.Ссылка,
	|	СК_БезПовторяющихся.СК КАК СК,
	|	СК_БезПовторяющихся.Наименование КАК СКНаименование,
	|	ДК.Организация.Наименование КАК ОргАгентНаименование,
	|	ДК.Организация КАК ОргАгент,
	|	ДК.Наименование КАК НомерДоговора,
	|	ДК.ДатаЗаключенияДоговора КАК ДатаЗаключения,
	|	ДК.ДатаОкончанияДействияДоговора КАК ДатаОкончания,
	|	ДК.ДопХарактеристика
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СК_БезПовторяющихся КАК СК_БезПовторяющихся
	|		ПО ДК.Владелец = СК_БезПовторяющихся.СК
	|			И (НЕ ДК.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СКНаименование,
	|	ДК.Организация.Наименование,
	|	ДатаЗаключения
	|ИТОГИ ПО
	|	СК";
					
КонецФункции

Функция ПолучитьТекстЗапросаПараметрыДиО()
	
	Возврат 
	"ВЫБРАТЬ
	|	ПД.Период КАК Период,
	|	ПД.Поставщик КАК СК,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.Наименование, """") КАК НаименованиеКонтактногоЛица,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.Должность, """") КАК Должность,
	|	ЕСТЬNULL(ПД.КонтактноеЛицо.ОснованиеДействия, """") КАК ОснованиеДействия,
	|	ЕСТЬNULL(ПД.Поставщик.Доверенность, """") КАК Доверенность,
	|	ПД.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	РегистрСведений.уб_ПараметрыДоговоровИОтчетов.СрезПоследних(
	|			,
	|			Поставщик В
	|				(ВЫБРАТЬ
	|					Т.СК
	|				ИЗ
	|					СК_БезПовторяющихся КАК Т)) КАК ПД
	|ГДЕ
	|	НЕ ПД.КонтактноеЛицо.ПометкаУдаления
	|ИТОГИ ПО
	|	СК";
	
КонецФункции	

