
// вызывать только с полными правами или ЗП_Полный доступ (права на чтение Начисление ЗП)
Процедура ИзменениеАктуальностиПоСрочнымОшибкам(ЗарплатныйПериод = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	А.РасчетныйПериод
	|ПОМЕСТИТЬ ВТ_АктуальныеПериоды
	|ИЗ
	|	РегистрСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(, &УсловиеВТ) КАК А
	|ГДЕ
	|	А.Актуален
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(О.Объект.Дата, МЕСЯЦ) КАК ЗарплатныйПериод,
	|	СУММА(ВЫБОР
	|			КОГДА ТекущееСостояние.Статус.Родитель = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.Решено)
	|				ТОГДА ТекущееСостояние.Штраф
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ТекущаяДата <= О.КритическаяДата
	|						ТОГДА 0
	|					КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(О.КритическаяДата, &ТекущаяДата, СЕКУНДА) / 86400 - 0.5 КАК ЧИСЛО(15, 0))) * &СуммаШтрафаЗаДень + О.Штраф > 1000
	|						ТОГДА 1000
	|					ИНАЧЕ (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(О.КритическаяДата, &ТекущаяДата, СЕКУНДА) / 86400 - 0.5 КАК ЧИСЛО(15, 0))) * &СуммаШтрафаЗаДень + О.Штраф
	|				КОНЕЦ
	|		КОНЕЦ) КАК Штраф,
	|	ТекущееСостояние.Менеджер КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Штрафы
	|ИЗ
	|	РегистрСведений.уб_Ошибки.СрезПоследних(
	|			,
	|			Статус = ЗНАЧЕНИЕ(Справочник.уб_СостоянияОшибок.ПереданоАгенту)
	|				И Срочно) КАК О
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_Ошибки.СрезПоследних(, ) КАК ТекущееСостояние
	|		ПО О.УИД = ТекущееСостояние.УИД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеПериоды КАК ВТ_АктуальныеПериоды
	|		ПО (НАЧАЛОПЕРИОДА(О.Объект.Дата, МЕСЯЦ) = ВТ_АктуальныеПериоды.РасчетныйПериод)
	|ГДЕ
	|	О.Менеджер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущееСостояние.Менеджер,
	|	НАЧАЛОПЕРИОДА(О.Объект.Дата, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Н.Ссылка.Дата, МЕСЯЦ) КАК ЗарплатныйПериод,
	|	Н.Сотрудник КАК Сотрудник,
	|	-СУММА(Н.Результат) КАК Штраф
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	Документ.уб_НачислениеЗП.НачисленияПоДокументам КАК Н
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеПериоды КАК ВТ_АктуальныеПериоды
	|		ПО (НАЧАЛОПЕРИОДА(Н.Ссылка.Дата, МЕСЯЦ) = ВТ_АктуальныеПериоды.РасчетныйПериод)
	|ГДЕ
	|	НЕ Н.Ссылка.ПометкаУдаления
	|	И (ВЫРАЗИТЬ(Н.Начисление КАК ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций)) = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ЗаОшибки)
	|	И Н.Сотрудник <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Н.Ссылка.Дата, МЕСЯЦ),
	|	Н.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Начисления.ЗарплатныйПериод КАК РасчетныйПериод
	|ИЗ
	|	ВТ_Штрафы КАК ВТ_Штрафы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
	|		ПО (ВТ_Начисления.ЗарплатныйПериод = ВТ_Штрафы.ЗарплатныйПериод)
	|			И (ВТ_Начисления.Сотрудник = ВТ_Штрафы.Сотрудник)
	|			И (ВТ_Начисления.Штраф <> ВТ_Штрафы.Штраф)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Штрафы.ЗарплатныйПериод
	|ИЗ
	|	ВТ_Штрафы КАК ВТ_Штрафы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
	|		ПО (ВТ_Начисления.ЗарплатныйПериод = ВТ_Штрафы.ЗарплатныйПериод)
	|			И ВТ_Штрафы.Сотрудник = ВТ_Начисления.Сотрудник
	|ГДЕ
	|	ВТ_Начисления.Сотрудник ЕСТЬ NULL 
	|	И ВТ_Штрафы.Штраф <> 0";
	Если ЗарплатныйПериод = Неопределено Тогда
		УсловиеВТ = "ИСТИНА"
	Иначе
		УсловиеВТ = "РасчетныйПериод = НАЧАЛОПЕРИОДА(&ЗарплатныйПериод, МЕСЯЦ)";
		Запрос.УстановитьПараметр("ЗарплатныйПериод", ЗарплатныйПериод);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеВТ", УсловиеВТ);
	СуммаШтрафаЗаДень = ПараметрыСеанса.уб_Константы.СуммаШтрафаПоСрочнойОшибкеЗаДень;
	Если ТипЗнч(СуммаШтрафаЗаДень) <> Тип("Число") Тогда
		СуммаШтрафаЗаДень = 50;
	КонецЕсли;
	ТекущаяДата = ТекущаяДата();
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата);
	Запрос.УстановитьПараметр("СуммаШтрафаЗаДень",  СуммаШтрафаЗаДень);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
			Запись.РасчетныйПериод 	= Выборка.РасчетныйПериод;
			Запись.Актуален			= Ложь;
			Запись.Объект			= "Авт. изменение актуальности по срочным ошибкам";
			Запись.Период			= ТекущаяДата;
			Запись.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ИзменениеАктуальностиПоСрочнымОшибкам()
