Перем мТаблицаДанных Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

Процедура ВыполнитьВыборкуДанных() Экспорт 
//SS TODO KV
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("ПустоеНаправление", Справочники.уб_Направления.ПустаяСсылка());
	Запрос.УстановитьПараметр("Каско", Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	//!!!Запрос не работает поскольку некоторые рквизиты в СП отсутствуют
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОплатыПолисов.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	               |	СУММА(ОплатыПолисов.КВСумма) КАК КВСумма,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.СтраховойПолис.Пролонгация
	               |				ИЛИ ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор
	               |					И ОплатыПолисов.НомерВзноса > 1
	               |			ТОГДА ""2Пролонгация""
	               |		КОГДА (НЕ ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор)
	               |			ТОГДА ""1Прямой""
	               |		ИНАЧЕ ""3Кредитный""
	               |	КОНЕЦ КАК РазделМониторинга,
	               |	ОплатыПолисов.СтраховойПолис.СК КАК СК,
	               |	ОплатыПолисов.СтраховойПолис.Направление КАК Направление,
	               |	ОплатыПолисов.ДатаМониторинга КАК ДатаМониторинга,
	               |	ОплатыПолисов.СтраховойПолис,
	               |	ОплатыПолисов.Период КАК ДатаОплаты,
				   |	ОплатыПолисов.Подразделение КАК Подразделение,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ОплатыПолисов.СтраховойПолис.СтраховойПродукт.Вид = &Каско
	               |					И (НЕ((НЕ ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор)
	               |							И ОплатыПолисов.НомерВзноса > 1))
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КолМашин
	               |ИЗ
	               |	Документ.уб_ОплатаПолисов КАК ОплатыПолисов
	               |ГДЕ
				   |	НЕ ОплатыПолисов.ПометкаУдаления
	               |	И ОплатыПолисов.ДатаМониторинга >= &ДатаНач
	               |	И ОплатыПолисов.ДатаМониторинга <= &ДатаКон
	               |	И (НЕ ОплатыПолисов.СтраховойПолис.ЕстьЛизинговыйДоговор)
				   |"
				   +?(ЗначениеНеЗаполнено(Направление),"	И ОплатыПолисов.СтраховойПолис.Направление <> &ПустоеНаправление ","	И ОплатыПолисов.СтраховойПолис.Направление = &Направление ")+
				   "
 				   |	И ОплатыПолисов.СтраховойПолис.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатыПолисов.ДатаМониторинга,
	               |	ОплатыПолисов.СтраховойПолис,
	               |	ОплатыПолисов.СтраховойПолис.СК,
	               |	ОплатыПолисов.СтраховойПолис.Направление,
	               |	ВЫБОР
	               |		КОГДА ОплатыПолисов.СтраховойПолис.Пролонгация
	               |				ИЛИ ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор
	               |					И ОплатыПолисов.НомерВзноса > 1
	               |			ТОГДА ""2Пролонгация""
	               |		КОГДА (НЕ ОплатыПолисов.СтраховойПолис.ЕстьКредитныйДоговор)
	               |			ТОГДА ""1Прямой""
	               |		ИНАЧЕ ""3Кредитный""
	               |	КОНЕЦ,
	               |	ОплатыПолисов.Период,
	               |	ОплатыПолисов.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Направление,
	               |	РазделМониторинга,
	               |	СК,
	               |	ДатаМониторинга
				   |";
				   //|ИТОГИ
				   //|	СУММА(НачисленнаяСуммаВзноса),
				   //|	СУММА(КВСумма),
				   //|	СУММА(КолМашин)
				   //|ПО
				   //|	РазделМониторинга,
				   //|	СК,
				   //|	ДатаМониторинга";
	
				   
	РезЗапроса 	= Запрос.Выполнить();
	
	ТипЧ = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	мТаблицаДанных = РезЗапроса.Выгрузить();
	мТаблицаДанных.Колонки.Добавить("Курс");
	мТаблицаДанных.Колонки.Добавить("НачисленнаяСуммаВзносаВал",ТипЧ);
	мТаблицаДанных.Колонки.Добавить("КВСуммаВал",ТипЧ);
	
	СоотвКурсы = Новый Соответствие;
	СтрОтбора = Новый Структура("Валюта",Валюта);
	Дт = НачалоДня(ДатаНач);
	Пока Дт <= НачалоДня(ДатаКон) Цикл
		РезТЗ = РегистрыСведений.КурсыВалют.СрезПоследних(Дт, СтрОтбора);
		Если РезТЗ.Количество()=0 Тогда
			СоотвКурсы.Вставить(Дт,1);
		Иначе
			СоотвКурсы.Вставить(Дт,РезТЗ[0].Курс);
		КонецЕсли;
		Дт = Дт + 60*60*24; // плюс 1 день
	КонецЦикла;
	
	Для Каждого СтрокаТЗ из мТаблицаДанных Цикл
		СтрокаТЗ.Курс = СоотвКурсы.Получить(СтрокаТЗ.ДатаМониторинга);
		СтрокаТЗ.НачисленнаяСуммаВзносаВал = СтрокаТЗ.НачисленнаяСуммаВзноса / СтрокаТЗ.Курс;
		СтрокаТЗ.КВСуммаВал = СтрокаТЗ.КВСумма / СтрокаТЗ.Курс;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокНаправлений()
	
	СписокНаправлений = Новый СписокЗначений;
	ВремТЗ = Новый ТаблицаЗначений;
	ВремТЗ.Колонки.Добавить("Направление",Новый ОписаниеТипов("СправочникСсылка.уб_Направления"));
	Масс = мТаблицаДанных.ВыгрузитьКолонку("Направление");
	Для х=1	по Масс.Количество() Цикл
		ВремТЗ.Добавить();
	КонецЦикла;
	ВремТЗ.ЗагрузитьКолонку(Масс,"Направление");
	ВремТЗ.Свернуть("Направление","");
	СписокНаправлений.ЗагрузитьЗначения(ВремТЗ.ВыгрузитьКолонку("Направление"));
	Возврат СписокНаправлений;
	
КонецФункции

Процедура ВывестиТаблицуПолученныхКомиссий(ДокументРезультат, ТекНаправление)
//SS TODO KV
	Построитель = Новый ПостроительЗапроса;
	
	мТаблицаДанных.Колонки.Сдвинуть(мТаблицаДанных.Колонки.СК,+1);
	ДанныеИсточника = Новый ОписаниеИсточникаДанных(мТаблицаДанных);
	Построитель.ИсточникДанных = ДанныеИсточника;
	
	Если НЕ ЗначениеНеЗаполнено(ТекНаправление) Тогда
		Отбор = Построитель.Отбор.Добавить("Направление");
		Отбор.Использование = Истина;
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = ТекНаправление;
	КонецЕсли;
	
	Построитель.ИсточникДанных.Колонки.РазделМониторинга.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.СК.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.ДатаМониторинга.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзносаВал.Итог = "Сумма(НачисленнаяСуммаВзносаВал)";
	Построитель.ИсточникДанных.Колонки.КВСуммаВал.Итог = "Сумма(КВСуммаВал)";
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзноса.Итог = "Сумма(НачисленнаяСуммаВзноса)";
	Построитель.ИсточникДанных.Колонки.КВСумма.Итог = "Сумма(КВСумма)";
	Построитель.ИсточникДанных.Колонки.КолМашин.Итог = "Сумма(КолМашин)";
	
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	РезЗапроса = Построитель.Результат;
	//РезТаблица = РезЗапроса.Выгрузить();
	

	Макет       = ПолучитьМакет("Макет");
	
	СоотвСумма	= Новый Соответствие;
	СоотвКол	= Новый Соответствие;
	//СоотвРасшифровка = Новый Соответствие;
	//СоотвРасшифровка.Вставить("Раздел","");
	//СоотвРасшифровка.Вставить("СК","");
	//СоотвРасшифровка.Вставить("День","");
	
	// Выводим шапку
	
	Обл 						= Макет.ПолучитьОбласть("Шапка|Общая");
	Обл.Параметры.Период	 	= "с "+ Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-")+" по "+Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	//Обл.Параметры.Направление	= ТекНаправление;
	Обл.Параметры.Направление	= ?(ЗначениеНеЗаполнено(ТекНаправление),"<ВСЕ направления>",ТекНаправление);
	Обл.Параметры.Валюта		= Валюта;
	ДокументРезультат.Вывести(Обл);
	Дт = НачалоДня(ДатаНач);
	Пока Дт <= НачалоДня(ДатаКон) Цикл
		Обл 						= Макет.ПолучитьОбласть("Шапка|День");
		Обл.Параметры.День		 	= Формат(Дт,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
		ДокументРезультат.Присоединить(Обл);
		Дт = Дт + 60*60*24; // плюс 1 день
	КонецЦикла;
	Обл 						= Макет.ПолучитьОбласть("Шапка|Всего");
	ДокументРезультат.Присоединить(Обл);
	
	
	//------------------------------
	// Выводим Разделы мониторинга
	РезТабл = РезЗапроса.Выгрузить();
	
	ВыборкаОбщий = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыборкаОбщий.Следующий();
	ДокументРезультат.ИтогиСправа = Истина;
	ДокументРезультат.НачатьАвтогруппировкуКолонок();
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ВыборкаРазделы = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаРазделы.Следующий() Цикл
		
		ИтСумма = ВыборкаРазделы.КВСуммаВал;
		ИтКол 	= ВыборкаРазделы.КолМашин;
		// Проинициализируем соответствия
		Дт = НачалоДня(ДатаНач);
		Пока Дт <= НачалоДня(ДатаКон) Цикл
			СоотвСумма.Вставить(Дт,0);
			СоотвКол.Вставить(Дт,0);
			Дт = Дт + 60*60*24; // плюс 1 день
		КонецЦикла;
		
		НаимОбласти = "";
		Если СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Прямой")>0 Тогда
			НаимОбласти = "Прямые"	;
		ИначеЕсли СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Пролонгация")>0 Тогда
			НаимОбласти = "Пролонгации"	;
		ИначеЕсли СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Кредитный")>0 Тогда
			НаимОбласти = "Кредитные"	;
		КонецЕсли;
		ОблРаздел = Макет.ПолучитьОбласть(НаимОбласти+"|Общая");
		ДокументРезультат.Вывести(ОблРаздел,1);
		
		// Необходимо вывести итоги по датам, для этого предварительно переберем выборку
		// и суммируем итоги по датам, результат запомним в соответствиях
		ВыборкаСК = ВыборкаРазделы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаСК.Следующий() Цикл
			ВыборкаДни = ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаДни.Следующий() Цикл
				Дт = ВыборкаДни.ДатаМониторинга;
				СоотвСумма.Вставить(Дт,СоотвСумма.Получить(Дт)+ВыборкаДни.КВСуммаВал);
				СоотвКол.Вставить(Дт,СоотвКол.Получить(Дт)+ВыборкаДни.КолМашин);
			КонецЦикла;
		КонецЦикла;
		
		Дт = НачалоДня(ДатаНач);
		Пока Дт <= НачалоДня(ДатаКон) Цикл
			ОблРаздел = Макет.ПолучитьОбласть(НаимОбласти+"|День");
			Сумма = СоотвСумма.Получить(Дт);
			Кол = СоотвКол.Получить(Дт);
			Если Сумма=0 и Кол=0 Тогда
				ОблРаздел.Параметры.Сумма 	= "";
				ОблРаздел.Параметры.Кол		= "";
			Иначе
				ОблРаздел.Параметры.Сумма = Сумма;
				ОблРаздел.Параметры.Кол = Кол;
				// добавим расшифровку
				СоотвРасшифровка = Новый Соответствие;
				СоотвРасшифровка.Вставить("Направление",ТекНаправление);
				СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
				СоотвРасшифровка.Вставить("СК","");
				СоотвРасшифровка.Вставить("День",Дт);
				ОблРаздел.Параметры.ЗначРасшифровки = СоотвРасшифровка;
			КонецЕсли;
			
			ДокументРезультат.Присоединить(ОблРаздел,2);
			Дт = Дт + 60*60*24; // плюс 1 день
		КонецЦикла;
		ОблРаздел 					= Макет.ПолучитьОбласть(НаимОбласти+"|Всего");
		ОблРаздел.Параметры.Сумма 	= ИтСумма;
		ОблРаздел.Параметры.Кол		= ИтКол;
		// добавим расшифровку
		СоотвРасшифровка = Новый Соответствие;
		СоотвРасшифровка.Вставить("Направление",ТекНаправление);
		СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
		СоотвРасшифровка.Вставить("СК","");
		СоотвРасшифровка.Вставить("День","");
		ОблРаздел.Параметры.ЗначРасшифровки = СоотвРасшифровка;
		
		ДокументРезультат.Присоединить(ОблРаздел,1);
		
		//----------------------
		// Выводим по строкам СК
		ВыборкаСК = ВыборкаРазделы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаСК.Следующий() Цикл
			ИтСумма = ВыборкаСК.КВСуммаВал;
			ИтКол 	= ВыборкаСК.КолМашин;
			
			ОблСК = Макет.ПолучитьОбласть("СК|Общая");
			ОблСК.Параметры.СК = ВыборкаСК.СК;
			ДокументРезультат.Вывести(ОблСК,2);
			ВыборкаДни = ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			Дт = НачалоДня(ДатаНач);
			Пока Дт <= НачалоДня(ДатаКон) Цикл
				ОблСК 							= Макет.ПолучитьОбласть("СК|День");

				СтрПоиска = Новый Структура("ДатаМониторинга",Дт);
				Найдена = ВыборкаДни.НайтиСледующий(СтрПоиска);
				Если Найдена Тогда
					ОблСК.Параметры.Сумма 	= ВыборкаДни.КВСуммаВал;
					ОблСК.Параметры.Кол		= ВыборкаДни.КолМашин;
					
					// добавим расшифровку
					СоотвРасшифровка = Новый Соответствие;
					СоотвРасшифровка.Вставить("Направление",ТекНаправление);
					СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
					СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
					СоотвРасшифровка.Вставить("День",Дт);
					ОблСК.Параметры.ЗначРасшифровки = СоотвРасшифровка;
					
				Иначе
					ОблСК.Параметры.Сумма 	= "";
					ОблСК.Параметры.Кол		= "";
				КонецЕсли;
				
				ДокументРезультат.Присоединить(ОблСК,2);
				Дт = Дт + 60*60*24; // плюс 1 день
			КонецЦикла;
			ОблСК 						= Макет.ПолучитьОбласть("СК|Всего");
			ОблСК.Параметры.Сумма 	= ИтСумма;
			ОблСК.Параметры.Кол		= ИтКол;
			// добавим расшифровку
			СоотвРасшифровка = Новый Соответствие;
			СоотвРасшифровка.Вставить("Направление",ТекНаправление);
			СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
			СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
			СоотвРасшифровка.Вставить("День","");
			ОблСК.Параметры.ЗначРасшифровки = СоотвРасшифровка;
				
			ДокументРезультат.Присоединить(ОблСК,1);
			
		КонецЦикла;
			
		
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ЗакончитьАвтогруппировкуКолонок();
	
КонецПроцедуры

Процедура ВывестиИтогиКомиссийИПремий(ДокументРезультат, ТекНаправление)
	
	Построитель = Новый ПостроительЗапроса;
	
	ДанныеИсточника = Новый ОписаниеИсточникаДанных(мТаблицаДанных);
	Построитель.ИсточникДанных = ДанныеИсточника;
	
	Если НЕ ЗначениеНеЗаполнено(ТекНаправление) Тогда
		Отбор = Построитель.Отбор.Добавить("Направление");
		Отбор.Использование = Истина;
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = ТекНаправление;
	КонецЕсли;
	
	//мТаблицаДанных.Колонки.Сдвинуть(мТаблицаДанных.Колонки.СК,-1);
	Построитель.ИсточникДанных.Колонки.ДатаМониторинга.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзносаВал.Итог = "Сумма(НачисленнаяСуммаВзносаВал)";
	Построитель.ИсточникДанных.Колонки.КВСуммаВал.Итог = "Сумма(КВСуммаВал)";
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзноса.Итог = "Сумма(НачисленнаяСуммаВзноса)";
	Построитель.ИсточникДанных.Колонки.КВСумма.Итог = "Сумма(КВСумма)";
	Построитель.ИсточникДанных.Колонки.КолМашин.Итог = "Сумма(КолМашин)";
	
	Построитель.ЗаполнитьНастройки();
	Построитель.Порядок.Установить("ДатаМониторинга");
	Построитель.Выполнить();
	РезЗапроса = Построитель.Результат;
	
	//РезТаблица = РезЗапроса.Выгрузить();

	Макет       = ПолучитьМакет("Макет");
	
	//---------------------------
	// Выведем общие суммы комиссий
	Обл 						= Макет.ПолучитьОбласть("ВсегоКомиссии|Общая");
	ДокументРезультат.Вывести(Обл);
	
	ВыборкаОбщ = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыборкаОбщ.Следующий();
	ИтСумма = ВыборкаОбщ.КВСуммаВал;
	ИтКол = ВыборкаОбщ.КолМашин;
	ВыборкаДни = ВыборкаОбщ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дт = НачалоДня(ДатаНач);
	Пока Дт <= НачалоДня(ДатаКон) Цикл
		Обл 						= Макет.ПолучитьОбласть("ВсегоКомиссии|День");
		
		СтрПоиска = Новый Структура("ДатаМониторинга",Дт);
		Найдена = ВыборкаДни.НайтиСледующий(СтрПоиска);
		Если Найдена Тогда
			Обл.Параметры.Сумма 	= ВыборкаДни.КВСуммаВал;
			Обл.Параметры.Кол		= ВыборкаДни.КолМашин;
					
			// добавим расшифровку
			СоотвРасшифровка = Новый Соответствие;
			СоотвРасшифровка.Вставить("Направление",ТекНаправление);
			СоотвРасшифровка.Вставить("Раздел","");
			СоотвРасшифровка.Вставить("СК","");
			СоотвРасшифровка.Вставить("День",Дт);
			Обл.Параметры.ЗначРасшифровки = СоотвРасшифровка;
					
		Иначе
			Обл.Параметры.Сумма 	= "";
			Обл.Параметры.Кол		= "";
		КонецЕсли;
		
		ДокументРезультат.Присоединить(Обл);
		Дт = Дт + 60*60*24; // плюс 1 день
	КонецЦикла;
	Обл 						= Макет.ПолучитьОбласть("ВсегоКомиссии|Всего");
	Обл.Параметры.Сумма 	= ИтСумма;
	Обл.Параметры.Кол		= ИтКол;
	// добавим расшифровку
	СоотвРасшифровка = Новый Соответствие;
	СоотвРасшифровка.Вставить("Направление",ТекНаправление);
	СоотвРасшифровка.Вставить("Раздел","");
	СоотвРасшифровка.Вставить("СК","");
	СоотвРасшифровка.Вставить("День","");
	Обл.Параметры.ЗначРасшифровки = СоотвРасшифровка;
	
	ДокументРезультат.Присоединить(Обл);
	
	
	
	//---------------------------
	// Выведем общие суммы премий
	Обл 						= Макет.ПолучитьОбласть("ПолученоПремий|Общая");
	ДокументРезультат.Вывести(Обл);
	
	ВыборкаОбщ = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыборкаОбщ.Следующий();
	ИтСумма = ВыборкаОбщ.НачисленнаяСуммаВзносаВал;
	ИтКол = ВыборкаОбщ.КолМашин;
	ВыборкаДни = ВыборкаОбщ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дт = НачалоДня(ДатаНач);
	Пока Дт <= НачалоДня(ДатаКон) Цикл
		Обл 						= Макет.ПолучитьОбласть("ПолученоПремий|День");
		
		СтрПоиска = Новый Структура("ДатаМониторинга",Дт);
		Найдена = ВыборкаДни.НайтиСледующий(СтрПоиска);
		Если Найдена Тогда
			Обл.Параметры.Сумма 	= ВыборкаДни.НачисленнаяСуммаВзносаВал;
			Обл.Параметры.Кол		= ВыборкаДни.КолМашин;
					
			// добавим расшифровку
			СоотвРасшифровка = Новый Соответствие;
			СоотвРасшифровка.Вставить("Направление",ТекНаправление);
			СоотвРасшифровка.Вставить("Раздел","");
			СоотвРасшифровка.Вставить("СК","");
			СоотвРасшифровка.Вставить("День",Дт);
			Обл.Параметры.ЗначРасшифровки = СоотвРасшифровка;
					
		Иначе
			Обл.Параметры.Сумма 	= "";
			Обл.Параметры.Кол		= "";
		КонецЕсли;
		
		ДокументРезультат.Присоединить(Обл);
		Дт = Дт + 60*60*24; // плюс 1 день
	КонецЦикла;
	Обл 						= Макет.ПолучитьОбласть("ПолученоПремий|Всего");
	Обл.Параметры.Сумма 	= ИтСумма;
	Обл.Параметры.Кол		= ИтКол;
	// добавим расшифровку
	СоотвРасшифровка = Новый Соответствие;
	СоотвРасшифровка.Вставить("Направление",ТекНаправление);
	СоотвРасшифровка.Вставить("Раздел","");
	СоотвРасшифровка.Вставить("СК","");
	СоотвРасшифровка.Вставить("День","");
	Обл.Параметры.ЗначРасшифровки = СоотвРасшифровка;
	
	ДокументРезультат.Присоединить(Обл);
	
	
КонецПроцедуры

Процедура ВывестиТаблицуПолученныхПремий(ДокументРезультат, ТекНаправление)
//SS TODO KV
	Макет       = ПолучитьМакет("Макет");
	//---------------------------
	// нужен новый запрос

	Построитель = Новый ПостроительЗапроса;
	
	мТаблицаДанных.Колонки.Сдвинуть(мТаблицаДанных.Колонки.СК,-1);
	ДанныеИсточника = Новый ОписаниеИсточникаДанных(мТаблицаДанных);
	Построитель.ИсточникДанных = ДанныеИсточника;
	
	Если НЕ ЗначениеНеЗаполнено(ТекНаправление) Тогда
		Отбор = Построитель.Отбор.Добавить("Направление");
		Отбор.Использование = Истина;
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = ТекНаправление;
	КонецЕсли;
	
	Построитель.ИсточникДанных.Колонки.СК.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.РазделМониторинга.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.ДатаМониторинга.Измерение = Истина;
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзносаВал.Итог = "Сумма(НачисленнаяСуммаВзносаВал)";
	Построитель.ИсточникДанных.Колонки.КВСуммаВал.Итог = "Сумма(КВСуммаВал)";
	Построитель.ИсточникДанных.Колонки.НачисленнаяСуммаВзноса.Итог = "Сумма(НачисленнаяСуммаВзноса)";
	Построитель.ИсточникДанных.Колонки.КВСумма.Итог = "Сумма(КВСумма)";
	Построитель.ИсточникДанных.Колонки.КолМашин.Итог = "Сумма(КолМашин)";
	
	Построитель.ЗаполнитьНастройки();
	Построитель.Порядок.Установить("СК, РазделМониторинга, ДатаМониторинга");
	Построитель.Выполнить();
	РезЗапроса = Построитель.Результат;
	РезТаблица = РезЗапроса.Выгрузить();
	

	СоотвСумма	= Новый Соответствие;
	СоотвКол	= Новый Соответствие;
	
	//-----------------------------
	// Выведем суммы премий по СК
	ВыборкаОбщий = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыборкаОбщий.Следующий();
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ВыборкаСК = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаСК.Следующий() Цикл
		
		ИтСумма = ВыборкаСК.НачисленнаяСуммаВзносаВал;
		ИтКол 	= ВыборкаСК.КолМашин;
		// Проинициализируем соответствия
		Дт = НачалоДня(ДатаНач);
		Пока Дт <= НачалоДня(ДатаКон) Цикл
			СоотвСумма.Вставить(Дт,0);
			СоотвКол.Вставить(Дт,0);
			Дт = Дт + 60*60*24; // плюс 1 день
		КонецЦикла;
		
		ВыборкаРазделы = ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаРазделы.Следующий() Цикл
			ВыборкаДни = ВыборкаРазделы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаДни.Следующий() Цикл
				Дт = ВыборкаДни.ДатаМониторинга;
				СоотвСумма.Вставить(Дт,СоотвСумма.Получить(Дт)+ВыборкаДни.НачисленнаяСуммаВзносаВал);
				СоотвКол.Вставить(Дт,СоотвКол.Получить(Дт)+ВыборкаДни.КолМашин);
			КонецЦикла;
		КонецЦикла;
		
		ОблСК = Макет.ПолучитьОбласть("СК2|Общая");
		ОблСК.Параметры.СК = ВыборкаСК.СК;
		ДокументРезультат.Вывести(ОблСК,1);
		
		Дт = НачалоДня(ДатаНач);
		Пока Дт <= НачалоДня(ДатаКон) Цикл
			ОблСК = Макет.ПолучитьОбласть("СК2|День");
			Сумма = СоотвСумма.Получить(Дт);
			Кол = СоотвКол.Получить(Дт);
			Если Сумма=0 и Кол=0 Тогда
				ОблСК.Параметры.Сумма 	= "";
				ОблСК.Параметры.Кол		= "";
			Иначе
				ОблСК.Параметры.Сумма = Сумма;
				ОблСК.Параметры.Кол = Кол;
				// добавим расшифровку
				СоотвРасшифровка = Новый Соответствие;
				СоотвРасшифровка.Вставить("Направление",ТекНаправление);
				СоотвРасшифровка.Вставить("Раздел","");
				СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
				СоотвРасшифровка.Вставить("День",Дт);
				ОблСК.Параметры.ЗначРасшифровки = СоотвРасшифровка;
			КонецЕсли;
			
			ДокументРезультат.Присоединить(ОблСК);
			Дт = Дт + 60*60*24; // плюс 1 день
		КонецЦикла;
		ОблСК 					= Макет.ПолучитьОбласть("СК2|Всего");
		ОблСК.Параметры.Сумма 	= ИтСумма;
		ОблСК.Параметры.Кол		= ИтКол;
		// добавим расшифровку
		СоотвРасшифровка = Новый Соответствие;
		СоотвРасшифровка.Вставить("Направление",ТекНаправление);
		СоотвРасшифровка.Вставить("Раздел","");
		СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
		СоотвРасшифровка.Вставить("День","");
		ОблСК.Параметры.ЗначРасшифровки = СоотвРасшифровка;
		
		ДокументРезультат.Присоединить(ОблСК);
		
		
		
		//----------------------
		// Выводим строки по Разделам
		ВыборкаРазделы = ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаРазделы.Следующий() Цикл
			ИтСумма = ВыборкаРазделы.НачисленнаяСуммаВзносаВал;
			ИтКол 	= ВыборкаРазделы.КолМашин;
			
			НаимОбласти = "";
			Если СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Прямой")>0 Тогда
				НаимОбласти = "Прямые2"	;
			ИначеЕсли СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Пролонгация")>0 Тогда
				НаимОбласти = "Пролонгации2";
			ИначеЕсли СтрЧислоВхождений(ВыборкаРазделы.РазделМониторинга,"Кредитный")>0 Тогда
				НаимОбласти = "Кредитные2";
			КонецЕсли;
			ОблРаздел = Макет.ПолучитьОбласть(НаимОбласти+"|Общая");
			ДокументРезультат.Вывести(ОблРаздел,2);
			
			ВыборкаДни = ВыборкаРазделы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			Дт = НачалоДня(ДатаНач);
			Пока Дт <= НачалоДня(ДатаКон) Цикл
				ОблРаздел	= Макет.ПолучитьОбласть(НаимОбласти+"|День");

				СтрПоиска = Новый Структура("ДатаМониторинга",Дт);
				Найдена = ВыборкаДни.НайтиСледующий(СтрПоиска);
				Если Найдена Тогда
					ОблРаздел.Параметры.Сумма 	= ВыборкаДни.НачисленнаяСуммаВзносаВал;
					ОблРаздел.Параметры.Кол		= ВыборкаДни.КолМашин;
					
					// добавим расшифровку
					СоотвРасшифровка = Новый Соответствие;
					СоотвРасшифровка.Вставить("Направление",ТекНаправление);
					СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
					СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
					СоотвРасшифровка.Вставить("День",Дт);
					ОблРаздел.Параметры.ЗначРасшифровки = СоотвРасшифровка;
					
				Иначе
					ОблРаздел.Параметры.Сумма 	= "";
					ОблРаздел.Параметры.Кол		= "";
				КонецЕсли;
				
				ДокументРезультат.Присоединить(ОблРаздел);
				Дт = Дт + 60*60*24; // плюс 1 день
			КонецЦикла;
			ОблРаздел 						= Макет.ПолучитьОбласть(НаимОбласти+"|Всего");
			ОблРаздел.Параметры.Сумма 	= ИтСумма;
			ОблРаздел.Параметры.Кол		= ИтКол;
			// добавим расшифровку
			СоотвРасшифровка = Новый Соответствие;
			СоотвРасшифровка.Вставить("Направление",ТекНаправление);
			СоотвРасшифровка.Вставить("Раздел",ВыборкаРазделы.РазделМониторинга);
			СоотвРасшифровка.Вставить("СК",ВыборкаСК.СК);
			СоотвРасшифровка.Вставить("День","");
			ОблРаздел.Параметры.ЗначРасшифровки = СоотвРасшифровка;
				
			ДокументРезультат.Присоединить(ОблРаздел);
			
		КонецЦикла;
			
		
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры


Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	#Если Клиент Тогда
	Если ДатаНач = '00010101000000' Тогда
		Предупреждение("Необходимо установить начальную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ДатаКон = '00010101000000' Тогда
		Предупреждение("Необходимо установить конечную дату отчета",30);
		Возврат;
	КонецЕсли;
	Если ЗначениеНеЗаполнено(Валюта) Тогда
		Предупреждение("Не выбрана валюта.");
		//Предупреждение("Не установлена валюта для мониторинга. Установка валюты в меню 'Настройка учета страхового брокера'");
		Возврат;
	КонецЕсли;
	#КонецЕсли
	ВыполнитьВыборкуДанных();
	мТаблицаДанных.Колонки.Сдвинуть(мТаблицаДанных.Колонки.СК,-1);
	
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	СписокНаправлений = ПолучитьСписокНаправлений();
	Для Каждого ЭлементСЗ из СписокНаправлений Цикл
		ТекНаправление = ЭлементСЗ.Значение;
		
		ВывестиТаблицуПолученныхКомиссий(ДокументРезультат, ТекНаправление);
		ВывестиИтогиКомиссийИПремий(ДокументРезультат, ТекНаправление);
		ВывестиТаблицуПолученныхПремий(ДокументРезультат, ТекНаправление);
		
	КонецЦикла;
	
	Если СписокНаправлений.Количество()>1 Тогда
		// Надо вывести итоговую таблицу
		
		ТекНаправление = "";
		
		ВывестиТаблицуПолученныхКомиссий(ДокументРезультат, ТекНаправление);
		ВывестиИтогиКомиссийИПремий(ДокументРезультат, ТекНаправление);
		ВывестиТаблицуПолученныхПремий(ДокументРезультат, ТекНаправление);
		
	КонецЕсли;

	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 0;
	ДокументРезультат.ФиксацияСлева		= 2;

	//ДокументРезультат.Показать("Мониторинг");
	
КонецПроцедуры
