Перем мЭтоУдалениеПроведения;
Перем Открывать Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок)

	СтруктураОбязательныхПолей = Новый Структура("ВидБСО");
	ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "БСО", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры



Процедура ДвиженияПоРегистрам(Отказ, Заголовок)

	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Дата", Дата);
	//СтруктураПараметров.Вставить("ДатаСреза", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	//СтруктураПараметров.Вставить("АгентВТЧДокумента", Ложь);
	//СтруктураПараметров.Вставить("АгентОтправительВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Агент", Неопределено);//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
	//СтруктураПараметров.Вставить("АгентОтправитель", Неопределено);//если агент в тч, то имя колонки, если в шапке, то ссылку на агента. неопределено - пустой агент
//	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	//СтруктураПараметров.Вставить("Движения", Движения);
	СтруктураПараметров.Вставить("КодОперации", Перечисления.уб_КодыОперацийБСО.ПередачаБСОПоставщику);
	//СтруктураПараметров.Вставить("СостояниеПоУмолчанию", Неопределено);
	//СтруктураПараметров.Вставить("НеКонтролироватьНаличиеБСОПриПроведении", Ложь);
	//СтруктураПараметров.Вставить("ИмяКолонкиВТЧТипСписания", Неопределено);
	//СтруктураПараметров.Вставить("НаОсновеБумажногоДокумента", НаОсновеБумажногоДокумента);
	СтруктураПараметров.Вставить("СделатьДвиженияПоКоличественнымБСО", Истина);
	СтруктураПараметров.Вставить("ВидДвиженияНакопленияОстаткиБСО", ВидДвиженияНакопления.Расход);
	СтруктураПараметров.Вставить("ПоставщикВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("ОрганизацияАгентВТЧДокумента", Ложь);
	СтруктураПараметров.Вставить("Поставщик", Поставщик);
	СтруктураПараметров.Вставить("ОрганизацияАгент", ОрганизацияАгент);
	СтруктураПараметров.Вставить("ПоложениеПоУмолчанию ", Перечисления.уб_ПоложенияБСО.ПереданВСК);
	//СтруктураПараметров.Вставить("ПроверкаПоложения", Истина);
	//СтруктураПараметров.Вставить("СКВТЧДокумента", Истина);
	//СтруктураПараметров.Вставить("СК", Неопределено);
	//СтруктураПараметров.Вставить("СделатьДвиженияПоБлокировкамБСО", Ложь);
	СтруктураПараметров.Вставить("ИмяКолонкиСостояниеБСО", "СостояниеБСО");
	
	ДвиженияПоРегиструДвиженияБСО(Отказ, Заголовок, ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок)		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	мЭтоУдалениеПроведения = Истина;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ПараметрыСеанса.уб_Константы.ОчищатьСообщенияПриЗаписиДокументов = Истина Тогда
		ОчиститьСообщения();
	КонецЕсли;
	#КонецЕсли

	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";

	СтруктураОбязательныхПолей = Новый Структура("Поставщик, ОрганизацияАгент");
	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	
	ПроверитьЗаполнениеТабличнойЧастиБСО(Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ И Не Проведен Тогда
		ДвиженияПоРегистрам(Отказ, Заголовок);
	//ИначеЕсли Отказ И Не Проведен Тогда
	//	Отказ = Ложь;
	КонецЕсли;
	
	Если Отказ И мЭтоУдалениеПроведения Тогда
		Отказ = Ложь;
	КонецЕсли;
	
	мЭтоУдалениеПроведения = Ложь;
КонецПроцедуры

#Если Клиент Тогда
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Тип = ТипЗнч(Основание);
	Если Тип = Тип("Структура") И Основание.Свойство("ТихийРежим") Тогда
		ТихийРежим 	= Основание.ТихийРежим;
		Основание	= Основание.Ссылка;
		Тип = ТипЗнч(Основание);
	Иначе
		ТихийРежим 	= Ложь;
	КонецЕсли;
	Если Тип = Тип("ДокументСсылка.уб_ОтчетПоставщику") Тогда
		Открывать = Ложь;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОП.ЕстьКвитанция,
		|	ОП.НомерКвитанции,
		|	ОП.СтраховойПолис.СтраховойПродукт,
		|	ОП.СтраховойПолис
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП
		|ГДЕ
		|	ОП.ОтчетПоставщику = &Основание
		|	И НЕ ОП.ПометкаУдаления");
		Запрос.УстановитьПараметр("Основание", Основание);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Если Не ТихийРежим Тогда
				Предупреждение("Нет строк в табличной части " + Основание);
			КонецЕсли;	
		Иначе
			// Заполнение шапки
			Поставщик 			= Основание.Поставщик;
			ОрганизацияАгент 	= Основание.ОрганизацияАгент;
			Агент 				= Основание.ОтветственныйБСО;
			ВидОперации 		= Перечисления.уб_ВидыОперацииПередачиБСОвСК.ПередачаБСО;
			Комментарий 		= "";
			СозданНаОсновании 	= Основание;
			СЗПередачБСО		= Новый СписокЗначений;
			//Формируем полный список БСО
			// По каждой оплате может передаваться:
			// - Квитанция
			// - БСО полиса, и прочее БСО 
			//      если оно имеет НазначениеБСО - "Остается" (в отличие от ДляКлиена и ДляБанка)
			//      и помечено как оформленное 
			// Исключаем БСО договора купиполиса
			// Исключаем БСО, в дижениях которого уже есть проведенная передача поставщику
			пОформлен = Перечисления.уб_СостоянияБСО.Оформлен;
			пОстается = Перечисления.уб_НазначенияБСО.Остается;
			Отступ = Символы.Таб;
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл			
				ОплатаДобавлена = Ложь;		
				ДобавлятьКвитанцию = Истина;
				// Смотрим, есть ли в оплате квитанция и добавляем
				Если Не (Выборка.ЕстьКвитанция И Выборка.НомерКвитанции <> "") Тогда
					ДобавлятьКвитанцию = Ложь;
				КонецЕсли;
				оБСОквА7 = уб_СС.ПолучитьБСОТипаКвА7дляСтраховогоПродукта(Выборка.СтраховойПолисСтраховойПродукт);	
				НомерБСО = Выборка.НомерКвитанции; 
				Если Не оБСОквА7.Существует Тогда
					ДобавлятьКвитанцию = Ложь;
				Иначе
					ВидБСО 	= оБСОквА7.ВидБСО;
					СК 		= ВидБСО.Владелец;
					СтруктураБСО = ПолучитьСостояниБСОИПроверитьВозможностьДобавления(СК, ВидБСО, НомерБСО);
					Если Не СтруктураБСО.МожноПередаватьПоставщику Тогда//Или (СтруктураБСО.Свойство("Блокировка") И СтруктураБСО.Блокировка)
						ДобавлятьКвитанцию = Ложь;
					Иначе
						Если СтруктураБСО.Свойство("Блокировка") И СтруктураБСО.Блокировка Тогда							
							ТекстВопроса = "БСО " + Строка(ВидБСО) + ?(ЗначениеЗаполнено(НомерБСО)," с номером '" + НомерБСО + "'","") +", СК: " + Строка(СК) + " заблокирован.
							|Передать БСО поставщику?";
							Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
							Если Ответ = КодВозвратаДиалога.Нет Тогда
								ДобавлятьКвитанцию = Ложь;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
				ИскомаяСтрокаДубля = БСО.Найти(НомерБСО, "НомерБСО");
				Если Не ЗначениеНеЗаполнено(ИскомаяСтрокаДубля) Тогда
					//Сообщить(Отступ + " ----- БСО квитанции № " + НомерБСО + " уже есть в табличном поле документа. Строка " + ИскомаяСтрокаДубля.НомерСтроки);
					ДобавлятьКвитанцию = Ложь;
				КонецЕсли;
				Если ДобавлятьКвитанцию Тогда
					СтрокаБСО = БСО.Добавить();
					СтрокаБСО.Подтверждено 	= Истина;
					СтрокаБСО.СК 			= СК;
					СтрокаБСО.ВидБСО 		= ВидБСО;
					СтрокаБСО.НомерБСО 		= НомерБСО;
					СтрокаБСО.НомерПолиса 	= СтруктураБСО.НомерПолиса;
					СтрокаБСО.Количество 	= 1;
					СтрокаБСО.Агент 		= СтруктураБСО.Агент;
					СтрокаБСО.СостояниеБСО 	= пОформлен;
					//
					ОплатаДобавлена = Истина;
				КонецЕсли;
				//Ищем БСО, сопутствующее полису
				Для Каждого СтрокаТЧ Из Выборка.СтраховойПолис.БСО Цикл
					ВидБСО 		= СтрокаТЧ.ВидБСО;
					НомерБСО 	= СтрокаТЧ.НомерБСО; 
					Если Не (СтрокаТЧ.Оформлен //И СтрокаТЧ.НазначениеБСО = пОстается
						) Тогда
						Продолжить;	
					КонецЕсли;
					СК = Выборка.СтраховойПолис.СК;//ВидБСО.Владелец;
					СтруктураБСО = ПолучитьСостояниБСОИПроверитьВозможностьДобавления(СК, ВидБСО, НомерБСО);
					ИскомаяСтрокаДубля = БСО.Найти(НомерБСО, "НомерБСО");					
					МожноПередаватьПоставщику = СтруктураБСО.МожноПередаватьПоставщику Или ТихийРежим;					
					Если МожноПередаватьПоставщику И СтруктураБСО.Свойство("Блокировка") И СтруктураБСО.Блокировка Тогда							
						ТекстВопроса = "БСО " + Строка(ВидБСО) + ?(ЗначениеЗаполнено(НомерБСО)," с номером '" + НомерБСО + "'","") +", СК: " + Строка(СК) + " заблокирован.
						|Передать БСО поставщику?";
						Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
						Если Ответ = КодВозвратаДиалога.Нет Тогда
							МожноПередаватьПоставщику = Ложь;
						КонецЕсли;
					КонецЕсли;
					
					Если МожноПередаватьПоставщику
						И СтруктураБСО.Поставщик = Поставщик
						И ЗначениеНеЗаполнено(ИскомаяСтрокаДубля) Тогда
						СтрокаБСО = БСО.Добавить();
						СтрокаБСО.Подтверждено 	= Истина;
						СтрокаБСО.СК 			= СК;
						СтрокаБСО.ВидБСО 		= ВидБСО;
						СтрокаБСО.НомерБСО 		= НомерБСО;
						СтрокаБСО.НомерПолиса 	= СтруктураБСО.НомерПолиса;
						СтрокаБСО.Количество 	= 1;
						СтрокаБСО.Агент 		= СтруктураБСО.Агент;
						СтрокаБСО.СостояниеБСО 	= пОформлен;
						//
						ОплатаДобавлена = Истина;
					ИначеЕсли СтруктураБСО.ПередачаБСОПоставщику <> Неопределено Тогда
						//найдена уже существующая передача БСО - добавляем в список
						Если Не ТихийРежим Тогда
							Если СЗПередачБСО.НайтиПоЗначению(СтруктураБСО.ПередачаБСОПоставщику) = Неопределено Тогда
								СЗПередачБСО.Добавить(СтруктураБСО.ПередачаБСОПоставщику)
							КонецЕсли;
						Иначе
							ИскомаяСтрокаДубля.Подтверждено 	= Истина;
							ИскомаяСтрокаДубля.СК 			= СК;
							ИскомаяСтрокаДубля.ВидБСО 		= ВидБСО;
							ИскомаяСтрокаДубля.НомерБСО 		= НомерБСО;
							ИскомаяСтрокаДубля.НомерПолиса 	= СтруктураБСО.НомерПолиса;
							ИскомаяСтрокаДубля.Количество 	= 1;
							ИскомаяСтрокаДубля.Агент 		= СтруктураБСО.Агент;
							ИскомаяСтрокаДубля.СостояниеБСО 	= пОформлен;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ОплатаДобавлена Тогда
					Открывать = Истина
				КонецЕсли;
			КонецЦикла;
			//открываем список задействованных передач
			Если СЗПередачБСО.Количество() > 0 Тогда
				Текст = ?(Открывать, "Часть бланков ", "Все бланки ");
				Текст = Текст + "уже переданы. 
				|Открыть список передач БСО?";
				Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Форма = ПолучитьОбщуюФорму("уб_ФормаПросмотраТЗ");
					Форма.ТаблицаЗначений 	= ОбщегоНазначения.СЗвТЗ(СЗПередачБСО, "ПередачаБСО", "Передача БСО");
					Форма.Заголовок 		= "Список уже переданных передач БСО поставщику по " + Основание;
					Форма.ТолькоПросмотр 	= Истина;
					Форма.Открыть();
					Открывать = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Тип = Тип("ДокументСсылка.уб_ПеремещениеБСО") Тогда		
		ТЗПоставщиков = Основание.БСО.Выгрузить();
		ТЗПоставщиков.Свернуть("Поставщик,ОрганизацияАгент","");
		ТЗПоставщиков.Сортировать("Поставщик");
		Если ТЗПоставщиков.Количество() = 1 Тогда
			ВыбСтрока = ТЗПоставщиков[0];
		ИначеЕсли ТЗПоставщиков.Количество() > 1 Тогда
			ВыбСтрока = ТЗПоставщиков.ВыбратьСтроку("Выберите поставщика и организацию-агента:",ТЗПоставщиков[0]);
		Иначе	
			ВыбСтрока = Неопределено;
		КонецЕсли;	                
		Если ВыбСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		СозданНаОсновании = Основание.Ссылка;
		Поставщик         = ВыбСтрока.Поставщик;
		ОрганизацияАгент  = ВыбСтрока.ОрганизацияАгент;
		Агент             = Основание.АгентКуда;
		ВидОперации       = Перечисления.уб_ВидыОперацииПередачиБСОвСК.ПередачаИспорченыхБСО;
		Для каждого СтрокаБСО Из Основание.БСО Цикл
			Если Поставщик = СтрокаБСО.Поставщик и ОрганизацияАгент = СтрокаБСО.ОрганизацияАгент Тогда
				НоваяСтрока = БСО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаБСО);
				НоваяСтрока.СостояниеБСО = Перечисления.уб_СостоянияБСО.Испорчен;
				НоваяСтрока.Агент = Агент;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

Функция ПолучитьСостояниБСОИПроверитьВозможностьДобавления(СК, ВидБСО, НомерБСО)
	
	СтруктураБСО = Новый Структура("МожноПередаватьПоставщику, СК, ВидБСО, НомерБСО, Агент, НомерПолиса, ПередачаБСОПоставщику, Поставщик, ОрганизацияАгент",Ложь, СК, ВидБСО, НомерБСО);
	//Если проведенной передачи поставщику не было, то подчитываем Агента, номер Полиса, Поставщика и ОргАгента
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Исключая);
	//тзРег = РегистрыСведений.уб_ДвиженияБСО.СрезПоследних(Граница, Новый Структура("СК, ВидБСО, НомерБСО, Подтверждено", СК, ВидБСО, НомерБСО, Истина));//, ДокПроведен  , Истина
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&Период,
	|			ВидБСО = &ВидБСО
	|				И НомерБСО = &НомерБСО
	|				И Подтверждено) КАК уб_ДвиженияБСОСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
	Запрос.УстановитьПараметр("Период", Граница);
	тзРег = Запрос.Выполнить().Выгрузить();
	
	Если тзРег.Количество() > 0 Тогда
		тз = тзРег[0];
	КонецЕсли;	
	//Проверяем, есть ли уже передача БСО поставщику?
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ДБС.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодПоступления
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&Период,
	|			ВидБСО = &ВидБСО
	|				И НомерБСО = &НомерБСО
	|				И Подтверждено
	|				И Регистратор ССЫЛКА Документ.уб_ПоступлениеБСО) КАК ДБС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Д.СК,
	|	Д.ВидБСО,
	|	Д.НомерБСО,
	|	Д.Агент,
	|	Д.НомерПолиса,
	|	Д.Регистратор КАК ПередачаБСОПоставщику,
	|	Д.Поставщик,
	|	Д.ОрганизацияАгент
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО КАК Д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодПоступления КАК ВТ_ПериодПоступления
	|		ПО (Д.Период >= ЕСТЬNULL(ВТ_ПериодПоступления.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)))
	|ГДЕ
	|	Д.ВидБСО = &ВидБСО
	|	И Д.НомерБСО = &НомерБСО
	|	И Д.Подтверждено
	|	И Д.Активность
	|	И Д.Регистратор ССЫЛКА Документ.уб_ПередачаБСОПоставщику
	|	И Д.Период < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Д.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &НеИспользоватьБлокировкиБСО = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ уб_БлокировкаБСОСрезПоследних.Блокировка
	|	КОНЕЦ КАК Блокировка
	|ИЗ
	|	РегистрСведений.уб_БлокировкаБСО.СрезПоследних(
	|			,
	|			ВидБСО = &ВидБСО
	|				И НомерБСО = &НомерБСО) КАК уб_БлокировкаБСОСрезПоследних";
	Запрос.УстановитьПараметр("ВидБСО", 	ВидБСО);
	Запрос.УстановитьПараметр("НомерБСО", 	НомерБСО);
	Запрос.УстановитьПараметр("Период",		Дата);
	НеИспользоватьБлокировкиБСО = ПараметрыСеанса.уб_Константы.уб_НеИспользоватьБлокировкиБСО = Истина;
	Запрос.УстановитьПараметр("НеИспользоватьБлокировкиБСО",НеИспользоватьБлокировкиБСО);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		СтруктураБСО.ПередачаБСОПоставщику	= Выборка.ПередачаБСОПоставщику;
		СтруктураБСО.Поставщик 				= Выборка.Поставщик;
		СтруктураБСО.ОрганизацияАгент		= Выборка.ОрганизацияАгент;
		//?
		СтруктураБСО.НомерПолиса = Выборка.НомерПолиса;
		//?
		Возврат СтруктураБСО;
	КонецЕсли;
	СтруктураБСО.МожноПередаватьПоставщику = Истина;
	Если НеИспользоватьБлокировкиБСО <> Истина Тогда
		ВыборкаБлокировки = Пакет[2].Выбрать();
		Если ВыборкаБлокировки.Следующий() Тогда
			СтруктураБСО.Вставить("Блокировка", ВыборкаБлокировки.Блокировка);
		КонецЕсли;
	КонецЕсли;	
	//Если проведенной передачи поставщику не было, то подчитываем Агента, номер Полиса, Поставщика и ОргАгента
	Если тз <> Неопределено Тогда
		СтруктураБСО.НомерПолиса		= тз.НомерПолиса;
		СтруктураБСО.Агент				= тз.Агент;
		СтруктураБСО.Поставщик			= тз.Поставщик;
		СтруктураБСО.ОрганизацияАгент	= тз.ОрганизацияАгент;
	КонецЕсли;
	Возврат СтруктураБСО;
	
КонецФункции

мЭтоУдалениеПроведения = Ложь;
Открывать = Истина;