#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	

	Если Найти(ИсточникВыбора.Заголовок, "Место рожд")>0 Тогда
		//Представление места рождения
		МестоРожденияФизЛица = РегламентированнаяОтчетность.ПредставлениеМестаРождения(ВыбранноеЗначение);
		
		Объект.МестоРождения = МестоРожденияФизЛица;
	ИначеЕсли ВыбранноеЗначение = Объект.Ссылка и Найти(ИсточникВыбора.Заголовок, "Паспортные данные физического лица")>0 Тогда
		ПрочитатьПаспортныеДанные();	
	ИначеЕсли Найти(ИсточникВыбора.Заголовок, "Фамилия, имя, отчество")>0 Тогда	
		Данные  = ПоследниеДанныеФИО(Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Данные,"Фамилия,Имя,Отчество");
		Объект.Наименование = ВыбранноеЗначение;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЭтоНовый Тогда
		уб_ФормыВызовСервера.ЗаписатьКонтактнуюИнформацию(ЭтаФорма,"Объект",Отказ);	
	КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоНовый Тогда
		Отказ = ЛОжь;
		уб_ФормыВызовСервера.ЗаписатьКонтактнуюИнформацию(ЭтаФорма,"Объект",Отказ);	
	КонецЕсли;	
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма.ДвижениеПоПодразделениям,"Агент",ТекущийОбъект.Ссылка,,ИСТИНА);
	
	ЭтоНовый = ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ;
	Если Не ПустаяСтрока (ДокументСерия) или ПустаяСтрока (ДокументНомер) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПаспортныеДанныеФизЛицСрезПоследних.*
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
		Запрос.УстановитьПараметр("ФизЛицо",Объект.Ссылка);
		
		Паспорт = Запрос.Выполнить().Выбрать();
		Если Паспорт.Следующий() Тогда		
			Если не ДокументДатаВыдачи = Паспорт.ДокументДатаВыдачи
				или НЕ	ДокументНомер = Паспорт.ДокументНомер
				или НЕ	ДокументСерия = Паспорт.ДокументСерия Тогда
				НоваяЗапись = Истина;
			КонецЕсли;	
		Иначе
			НоваяЗапись = Истина;
		КонецЕсли;	
		Если НоваяЗапись = Истина Тогда
			МЗ = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();	
			МЗ.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
			МЗ.ФизЛицо = Объект.Ссылка;
			МЗ.ДокументДатаВыдачи = ДокументДатаВыдачи;
			МЗ.ДокументНомер = ДокументНомер;
			МЗ.ДокументСерия = ДокументСерия;
			МЗ.Период = ТекущаяДата();
			МЗ.Записать();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ЭтоСотрудник и ПустаяСтрока(Объект.tg_name) Тогда
		Объект.tg_name = Объект.Наименование; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВозможныхНаименований = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Фамилия) Тогда
		СписокВозможныхНаименований.Добавить(Фамилия);
		Если ЗначениеЗаполнено(Имя) Тогда
			СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя));
			СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя,1) + ".");
			Если ЗначениеЗаполнено(Отчество) Тогда
				СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВозможныхНаименований.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя,1) + ". " + Лев(Отчество,1)+ ".");
 			КонецЕсли;
		 КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Имя) Тогда
			СписокВозможныхНаименований.Добавить(Имя);
			Если ЗначениеЗаполнено(Отчество) Тогда
				СписокВозможныхНаименований.Добавить(СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВозможныхНаименований.Добавить(СокрЛП(Имя) + ". " + Лев(Отчество,1)+ ".");
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Отчество) Тогда
				СписокВозможныхНаименований.Добавить(Отчество);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
    ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПриВыбореНаименования",ЭтаФорма,Новый Структура),СписокВозможныхНаименований,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореНаименования(Значение,ДопПараметры) Экспорт
	Если Не Значение = Неопределено Тогда
		Объект.Наименование = Значение.Значение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//	Элемент.СписокВыбора.ЗагрузитьЗначения( СписокВозможныхНаименований);

КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияФизлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		мФормаВводаМестаРождения = ПолучитьОбщуюФорму("ФормаВводаМестаРождения", ЭтаФорма, "ФизЛицо"+Объект.Код);
		мФормаВводаМестаРождения.МестоРожденияСтрокой = Объект.МестоРождения;
		мФормаВводаМестаРождения.ЗаголовокФормы       = "Место рождения физ. лица: "+Объект.Наименование;
		мФормаВводаМестаРождения.Открыть();
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Ложь;
		ФормаВвода	 			= ПолучитьОбщуюФорму("РедактированиеДокументаУдостоверяющегоЛичность", ЭтаФорма);
		ФормаВвода.ФизЛицоПриОткрытии = Объект.Ссылка;
		//ФормаВвода.НаборЗаписей = мНаборЗаписейДокументаУдостоверяющегоЛичность;
		ФормаВвода.Открыть();
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКомандуПечати(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.ЗагрузитьЗначения(уб_СЛ.СписокДоступныхОрганизаций());
	
	Описание = новый ОписаниеОповещения("ПослеВыбораОрганизации",ЭтаФорма,Новый Структура("Команда",Команда));
	
	ПоказатьВыборИзСписка(Описание,СписокВыбора);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораОрганизации(РезультатВыбора,ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		ПараметрыПечати = Неопределено;
	Иначе
		ПараметрыПечати = Новый Структура("Организация",РезультатВыбора.Значение);
	КонецЕсли;	
	Уб_Клиент.ПечатьПоКнопке(ЭтаФорма,ДополнительныеПараметры.Команда,ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьСотрудника(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала создайте физлицо и запишите объект!", 10);
		Возврат;
	КонецЕсли;	
	
	ТаблицаРезультатов  = СобратьДанные(Объект.Ссылка);
	Если ТаблицаРезультатов.Количество()>0 Тогда 
		Если ТаблицаРезультатов[0].Выбытие=Ложь Тогда
			ПоказатьПредупреждение(,"Сотрудник уже работает!", 10);
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	ФормаВвода = ИнициализироватьФормуДвижения("Прием",ТаблицаРезультатов);	
	ФормаВвода.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиСотрудника(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала создайте физлицо и запишите объект!", 10);
		Возврат;
	КонецЕсли;
	//
	ТаблицаРезультатов  = СобратьДанные(Объект.Ссылка);
	
	Если ТаблицаРезультатов.Количество()>0 Тогда 
		Если ТаблицаРезультатов[0].Выбытие=Истина Тогда
			ПоказатьПредупреждение(,"Сотрудник уже уволен! Его можно только принять", 10);
			Возврат;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Сотрудник еще не принят!", 10);
		Возврат;
	КонецЕсли;
	
	ФормаВвода = ИнициализироватьФормуДвижения("Перемещение",ТаблицаРезультатов);	
	
	ФормаВвода.Открыть(); 

КонецПроцедуры

&НаКлиенте
Процедура УволитьСотрудника(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала создайте физлицо и запишите объект!", 10);
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультатов  = СобратьДанные(Объект.Ссылка);
	Если ТаблицаРезультатов.Количество()>0 Тогда 
		Если ТаблицаРезультатов[0].Выбытие=Истина Тогда
			ПоказатьПредупреждение(,"Сотрудник уже уволен! Его можно только принять", 10);
			Возврат;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Сотрудник еще не принят!", 10);
		Возврат;
	КонецЕсли; 
	
	
	ФормаВвода = ИнициализироватьФормуДвижения("Выбытие",ТаблицаРезультатов);	
	ФормаВвода.Открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	ЭтоНовый = ЗначениеЗаполнено(Объект.Ссылка) = ЛОЖЬ;
	Если ЭтоНовый Тогда
		Объект.Наименование      = "";
		Объект.tg_name           = "";
		Объект.tg_id             = "";
		Объект.СтраховойНомерПФР = "";
	КонецЕсли;
	
	ПравоУправлениеПерсоналом =  (уб_КЭШируемые.ДоступностьРоли("ПолныеПрава") или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя("УправлениеПерсоналом", Ложь)); 
	
	Параметры.Свойство("ЭтоСотрудник",ЭтоСотрудник);
	Если ЭтоСотрудник = ЛОЖЬ и ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтоСотрудник = уб_ВызовСервера.ЭтоНашСотрудник(Объект.Ссылка) или Объект.Ссылка.ПринадлежитЭлементу(Справочники.ФизическиеЛица.Сотрудники);
	КонецЕсли;	
	ПрочитатьМестоРождения();
	ПрочитатьПаспортныеДанные();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ПоследниеДанныеФИО(Объект.Ссылка),"Фамилия,Имя,Отчество");
	
	ВидимостьКонтактнойИнформации = 2;
	уб_ФормыВызовСервера.ДобавитьКонтактнуюИнформацию(ЭтаФорма,Объект.Ссылка,"Объект",Элементы.КонтактнаяИнформация,ВидимостьКонтактнойИнформации);
	уб_ФормыВызовСервера.ДобавитьОбщиеРеквизиты(ЭтаФорма,Объект.Ссылка);	
	
	уб_ФормыВызовСервера.УстановитьОтборСписка(ЭтаФорма.ДвижениеПоПодразделениям,"Агент",Объект.Ссылка,,ИСТИНА);
	
	уб_ФормыВызовСервера.УстановитьКнопкиПечати(ЭтаФорма,,Ложь);
	#Область ВидимостьИДоступность
	//ПравоИзменения = ПравоДоступа("Изменение",Метаданные.Справочники.ФизическиеЛица);
	//Если ПравоИзменения = ЛОЖЬ Тогда
	//КонецЕсли;	
	
	Элементы.Сотрудники.Видимость                         = ЭтоСотрудник и ПравоУправлениеПерсоналом;
	Элементы.СотрудникиИнтеграция.Видимость               = ЭтоСотрудник и ПравоУправлениеПерсоналом;
	Элементы.СотрудникиНастройкиВыплатыЗарплаты.Видимость = ЭтоСотрудник и ПравоУправлениеПерсоналом;
	//Элементы.ПраваяКолонка.Видимость                      = ЭтоСотрудник и ПравоУправлениеПерсоналом;
	Элементы.СтраховойНомерПФР.Видимость                  = ЭтоСотрудник и ПравоУправлениеПерсоналом;

	Элементы.ГруппаИзмененияФото.Доступность = ПравоУправлениеПерсоналом;
	
	Если ЭтоСотрудник или уб_ВызовСервера.ЭтоНашСотрудник(Объект.Ссылка) Тогда
		//Удостоверение
		Элементы.ГруппаУдостоверениеЛичности.Видимость = ПравоУправлениеПерсоналом;
		Если НЕ  ПравоУправлениеПерсоналом Тогда
			Элементы.Страницы.ТолькоПросмотр    = Истина;
			Элементы.Комментарий.ТолькоПросмотр = Истина;
		КонецЕсли;	
	Иначе
		Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава,уб_СотрудникОтделаБСО") = ЛОЖЬ Тогда
			Элементы.ГруппаУдостоверениеЛичности.Видимость = Истина;
			Элементы.ГруппаНаименованиеКод.ТолькоПросмотр = Истина;
			Элементы.ФИО.ТолькоПросмотр                   = Истина;
			Элементы.Имя.ТолькоПросмотр                   = Истина;
			Элементы.Отчество.ТолькоПросмотр              = Истина;
			Элементы.Наименование.ТолькоПросмотр          = Истина;
			//Элементы.ДатаРождения.ТолькоПросмотр          = ЗначениеЗаполнено(Объект.ДатаРождения);
			Элементы.Пол.ТолькоПросмотр                   = ЗначениеЗаполнено(Объект.Пол);
			Элементы.Родитель.ТолькоПросмотр              = Истина;			
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	Если уб_КЭШируемые.ДоступностьРоли("ПолныеПрава,уб_СотрудникОтделаБСО") = ЛОЖЬ Тогда
		Элементы.ВнешнийУИД.ТолькоПросмотр            = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПрочитатьМестоРождения()

	МестоРожденияФизЛица = РегламентированнаяОтчетность.ПредставлениеМестаРождения(Объект.МестоРождения);
	//Если НЕ ЗначениеЗаполнено(МестоРожденияФизЛица) тогда
	//	Элементы.МестоРождения = "Ввести место рождения";
	////	ЭлементыФормы.МестоРождения.ЦветТекстаПоля = Новый Цвет(255, 0, 0);
	////Иначе
	//	ЭлементыФормы.МестоРождения.ЦветТекстаПоля = Новый Цвет;
	//КонецЕсли;
	
КонецПроцедуры // ПрочитатьМестоРождения

&НаСервере
Процедура ПрочитатьПаспортныеДанные()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПаспортныеДанныеФизЛицСрезПоследних.*
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо",Объект.Ссылка);
	
	Паспорт = Запрос.Выполнить().Выбрать();
	Если Паспорт.Следующий() Тогда
		_УдостоверениеЛичности = "" + Паспорт.ДокументВид.НаименованиеКратко + ", серия: " + Паспорт.ДокументСерия + ", № " + Паспорт.ДокументНомер 
		+ ", выдан: " + Формат(Паспорт.ДокументДатаВыдачи,"ДФ='дд ММММ гггг'; ДП='Не указано'") + " г, " 
		+ Паспорт.ДокументКемВыдан  
		//+ ", № подр. " + Паспорт.ДокументКодПодразделения 
		//+ Символы.Таб + "Дата регистрации по месту жительства: " + Формат(Паспорт.ДатаРегистрацииПоМестуЖительства,"ДФ='дд ММММ гггг'; ДП='Не указано'")
		+ "";
		
		УдостоверениеЛичности = СтрЗаменить(_УдостоверениеЛичности,"Не указано","...");
		ДокументДатаВыдачи = Паспорт.ДокументДатаВыдачи;
		ДокументНомер      = Паспорт.ДокументНомер;
		ДокументСерия      = Паспорт.ДокументСерия;
	КонецЕсли;

КонецПроцедуры	

&НаСервереБезКонтекста
Функция СобратьДанные(ФизическоеЛицо)
	Запрос= Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	С.Выбытие,
	|	С.Подразделение,
	|	С.Организация,
	|	С.Должность
	|ИЗ
	|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(, Агент = &Агент) КАК С";
	
	Запрос.УстановитьПараметр("Агент", ФизическоеЛицо);
	МассивДанных = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДанных.Добавить(Новый Структура("Выбытие,Подразделение,Организация,Должность",Выборка.Выбытие,Выборка.Подразделение,Выборка.Организация,Выборка.Должность));
	КонецЦикла;	
	Возврат МассивДанных;
КонецФункции	

&НаКлиенте
Функция ИнициализироватьФормуДвижения(Режим,ТаблицаРезультатов)
	ФормаВвода = ПолучитьФорму("РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.Форма.ФормаЗаписиУправляемая",,ЭтаФорма);
	ФормаВвода.Параметры.ФормаОткрытаИзФормыФизлица = Истина;
	
	ФормаВвода.Запись.Агент = Объект.Ссылка;	
	
	ЭлементыЗаписи = ФормаВвода.Элементы;
	
	ЭлементыЗаписи.Агент.Доступность = Ложь;
	Если Режим = "Перемещение" или Режим = "Прием" Тогда
		ФормаВвода.Запись.Период = НачалоДня(ТекущаяДата());
		ФормаВвода.Запись.Организация = уб_ВызовСервера.ПолучитьЗначениеКонстанты("ОсновнаяОрганизация");//ТаблицаРезультатов[0].Организация;
		Если Режим = "Перемещение" Тогда
			ФормаВвода.Запись.Должность = ТаблицаРезультатов[0].Должность;
			ФормаВвода.Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Переместить и закрыть";
			ФормаВвода.ТекущийЭлемент = ЭлементыЗаписи.Подразделение
		Иначе
			ФормаВвода.Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Принять и закрыть";
			ФормаВвода.ТекущийЭлемент = ЭлементыЗаписи.Период;
		КонецЕсли;	
		ФормаВвода.Запись.Выбытие = Ложь;
		ЭлементыЗаписи.Подразделение.Доступность = Истина;
		ЭлементыЗаписи.Выбытие.Видимость = Ложь;
	ИначеЕсли Режим = "Выбытие" Тогда	
		ФормаВвода.Запись.Период = КонецДня(ТекущаяДата());
		ФормаВвода.Запись.Выбытие = Истина;
		ФормаВвода.Запись.Организация = ТаблицаРезультатов[0].Организация;
		ФормаВвода.Запись.Подразделение = ТаблицаРезультатов[0].Подразделение;
		ЭлементыЗаписи.Выбытие.Доступность = Ложь;
		//Эл.Организация.Доступность = Ложь;//Скрыто
		ЭлементыЗаписи.Подразделение.Доступность = Ложь;
		ЭлементыЗаписи.Должность.Доступность = Ложь;
		ЭлементыЗаписи.Выбытие.Видимость = Истина;
		ФормаВвода.Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Уволить и закрыть";
	КонецЕсли;
	
	Возврат ФормаВвода;
	
КонецФункции	

&НаКлиенте
Процедура ИзменитьФИО(Команда)
	
	Данные = ПоследниеДанныеФИО(Объект.Ссылка);
	
	ФормаРегистра = Получитьформу("РегистрСведений.ФИОФизЛиц.Форма.ФормаЗаписиДополнительная",Данные,ЭтаФорма);
	ФормаРегистра.ФизЛицо = Объект.Ссылка;
	ФормаРегистра.Период   = Данные.Период;
	ФормаРегистра.Фамилия  = Данные.Фамилия;
	ФормаРегистра.Имя      = Данные.Имя;
	ФормаРегистра.Отчество = Данные.Отчество;
	ФормаРегистра.Открыть();
	
	//ФормаРегистра = РегистрыСведений.ФИОФизЛиц.ПолучитьФорму("ФормаЗаписиДополнительная", ЭтаФорма);
	//ФормаРегистра.Физлицо  = Ссылка;
	//	
	//ТаблицаРегистра = РегистрыСведений.ФИОФизЛиц.СрезПоследних(, Новый Структура("ФизЛицо",Ссылка));

	//Если ТаблицаРегистра.Количество() > 0 Тогда
	//	
	//	ФормаРегистра.Период   = ТаблицаРегистра[0].Период;
	//	ФормаРегистра.Фамилия  = ТаблицаРегистра[0].Фамилия;
	//	ФормаРегистра.Имя      = ТаблицаРегистра[0].Имя;
	//	ФормаРегистра.Отчество = ТаблицаРегистра[0].Отчество;
	//
	//Иначе
	//	ФормаРегистра.Период   = '19000101';
	//	ФИО = Наименование;
	//	ФормаРегистра.Фамилия  = ОбщегоНазначения.ВыделитьСлово(ФИО);
	//	ФормаРегистра.Имя	   = ОбщегоНазначения.ВыделитьСлово(ФИО);
	//	ФормаРегистра.Отчество = ОбщегоНазначения.ВыделитьСлово(ФИО);
	//КонецЕсли;
	//
	//ФормаРегистра.Открыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследниеДанныеФИО(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФИОФизЛицСрезПоследних.Фамилия,
	               |	ФИОФизЛицСрезПоследних.Имя,
	               |	ФИОФизЛицСрезПоследних.Отчество,
	               |	ФИОФизЛицСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		_Фамилия    = Выборка.Фамилия;
	    _Имя        = Выборка.Имя;
	    _Отчество   = Выборка.Отчество;
	    _Период     = Выборка.Период;
	Иначе
		ДанныеФио = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Ссылка.Наименование," ");
		Если ДанныеФио.Количество()>0 Тогда
			_Фамилия = ДанныеФио[0];
		КонецЕсли;	
		Если ДанныеФио.Количество()>1 Тогда
			_Имя = ДанныеФио[1];
		КонецЕсли;	
		Если ДанныеФио.Количество()>2 Тогда
			_Отчество = ДанныеФио[2];
		КонецЕсли;	
		_Период = Ссылка.ДатаРождения;
		Если _Период = Дата(1,1,1) Тогда
			_Период = Дата(2000,1,1);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Новый Структура("Период,Фамилия,Имя,Отчество",_Период,_Фамилия,_Имя,_Отчество);
КонецФункции	



&НаСервереБезКонтекста
Процедура ВыгрузитьВТелеграмНаСервере()
	
	Структура = Новый Структура;
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка КАК Ссылка,
	               |	ФизическиеЛица.Наименование КАК fio,
	               |	ФизическиеЛица.tg_id КАК tg_id,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛица.tg_name = """"
	               |			ТОГДА ФизическиеЛица.Наименование
	               |		ИНАЧЕ ФизическиеЛица.tg_name
	               |	КОНЕЦ КАК tg_name,
	               |	ВЫБОР
	               |		КОГДА НЕ ФизическиеЛица.Роль = """"
	               |			ТОГДА ФизическиеЛица.Роль
	               |		КОГДА ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Наименование, """") = ""СВС""
	               |			ТОГДА ""Курьер""
	               |		ИНАЧЕ ""Менеджер""
	               |	КОНЕЦ КАК role,
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК Фамилия,
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК Имя,
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК Отчество,
	               |	ФизическиеЛица.Родитель КАК Родитель,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛица.Родитель.tg_name = """"
	               |			ТОГДА ФизическиеЛица.Родитель.Наименование
	               |		ИНАЧЕ ФизическиеЛица.Родитель.tg_name
	               |	КОНЕЦ КАК РодительКод,
	               |	ЕСТЬNULL(КонтактыМобильный.Представление, """") КАК phone,
	               |	ЕСТЬNULL(КонтактыИмейл.Представление, """") КАК email,
	               |	ЕСТЬNULL(КонтактыКПП.Представление, """") КАК personal_link,
	               |	ФизическиеЛица.КодCRM КАК amo_id
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	               |		ПО (уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент = ФизическиеЛица.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	               |		ПО (ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактыМобильный
	               |		ПО (КонтактыМобильный.Объект = ФизическиеЛица.Ссылка)
	               |			И (КонтактыМобильный.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактыИмейл
	               |		ПО (КонтактыИмейл.Объект = ФизическиеЛица.Ссылка)
	               |			И (КонтактыИмейл.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыФизЛица))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактыКПП
	               |		ПО (КонтактыКПП.Объект = ФизическиеЛица.Ссылка)
	               |			И (КонтактыКПП.Вид.Код = ""00032"")
	               |ГДЕ
	               |	ФизическиеЛица.tg_id <> """"
	               |	И ЕСТЬNULL(уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие, ЛОЖЬ) = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Массив.Добавить(Новый Структура("fio,tg_id,role",Выборка.fio,Выборка.tg_id,Выборка.role));
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("fio",Выборка.fio);
		Соответствие.Вставить("tg_id",Выборка.tg_id);
		Соответствие.Вставить("amo_id",Выборка.amo_id);
		Соответствие.Вставить("role",Выборка.role);
		Соответствие.Вставить("1name",Выборка.Фамилия);
		Соответствие.Вставить("2name",Выборка.Имя);
		Соответствие.Вставить("3name",Выборка.Отчество);
		Соответствие.Вставить("group",Выборка.РодительКод);
		Соответствие.Вставить("email",Выборка.email);
		Соответствие.Вставить("phone",Выборка.phone);
		Соответствие.Вставить("tg_name",Выборка.tg_name);
		Соответствие.Вставить("personal_link",Выборка.personal_link);
		
		
		ОбъектФЛ = Выборка.Ссылка.ПолучитьОбъект();
		Фото = ОбъектФЛ.Фотография.Получить();
		Если Фото = Неопределено или Фото.Количество() = 0 Тогда
			Соответствие.Вставить("foto",ложь);
		Иначе
			Соответствие.Вставить("foto",Истина);
		КонецЕсли;	
		Массив.Добавить(Соответствие);
	КонецЦикла;
	
	Структура.Вставить("Сотрудники",Массив);
	
	
	Структура.Вставить("СК",СК());
	
	Строка = уб_ВызовСервера.JSON(Структура);
	
	
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый httpСоединение("kupipolis.ru",,,,,,ssl);
	httpЗапрос = новый httpЗапрос("webhook.php?set=true");
	httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
	
	
	Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	Сообщить(Ответ.ПолучитьТелоКакСтроку());
	//https://osago.app/rest/1cdata
	ssl = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый httpСоединение("osago.app",,,,,,ssl);
	httpЗапрос = новый httpЗапрос("/rest/1cdata");
	httpЗапрос.УстановитьТелоИзСтроки(Строка,КодировкаТекста.UTF8);
	httpЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	
	Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	Сообщить(Ответ.ПолучитьТелоКакСтроку());
	
	//httpЗапрос.УстановитьТелоИзСтроки("Отправлено из 1С Кривая Строка",КодировкаТекста.UTF8);
	//httpЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	
	//Ответ = Соединение.ОтправитьДляОбработки(httpЗапрос);
	//Сообщить(Ответ.ПолучитьТелоКакСтроку());
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция СК()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка,
	               |	Контрагенты.Наименование КАК SK,
	               |	Контрагенты.ВидыСП.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ПРЕДСТАВЛЕНИЕ(Контрагенты.ВидыСП.ВидСП) КАК ВидСП,
	               |		Организация КАК Организация
	               |	) КАК ВидыСП,
	               |	ПРЕДСТАВЛЕНИЕ(Контрагенты.Андеррайтер) КАК Андеррайтер,
	               |	Контрагенты.Андеррайтер.tg_id КАК Андеррайтерtg_id,
	               |	Контрагенты.Андеррайтер.tg_name КАК Андеррайтерtg_name
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ЛОЖЬ
	               |	И Контрагенты.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.СтраховыеКомпании))
	               |	И НЕ Контрагенты.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Контрагенты.НЕАКТИВНЫЕ))
	               |	И НЕ Контрагенты.Наименование = ""--КупиПолис--""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагенты.Наименование";
	Ответ = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокБСО = Новый Массив;
		Для Каждого БСо Из Выборка.ВидыСп.Выгрузить()  Цикл
			Если СписокБСО.Найти(БСО.ВидСп) = Неопределено Тогда
				СписокБСО.Добавить(БСО.ВидСп);
			КонецЕсли;
		КонецЦикла;
		Соответствие = Новый Структура;
		Соответствие.Вставить("sk",Выборка.sk);
		Если СписокБСО.Количество()>0 Тогда
			Соответствие.Вставить("bso",СписокБСО);
		КонецЕсли;
		
		Соответствие.Вставить("owner",Выборка.Андеррайтер);
		Соответствие.Вставить("owner_id",Выборка.Андеррайтерtg_id);
		Соответствие.Вставить("owner_name",Выборка.Андеррайтерtg_name);
		Ответ.Добавить(Соответствие);
		
	КонецЦикла;	
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВТелеграм(Команда)
	ВыгрузитьВТелеграмНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбытиеСотрудника" и Параметр = Объект.Ссылка Тогда
		//Объект.tg_id = "";
		//ЭтаФорма.Модифицированность = Истина;
		//Записать();
		ВыгрузитьВТелеграмНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьФотоНаСервере(СтруктураФайла)
	//ДД
	Фото = ПолучитьИзВременногоХранилища(СтруктураФайла.АдресФайла);
	//Массив
	Фотографии = ПолучитьИзВременногоХранилища(АдресХранилищаФотографий);
	ИндексКартинки = 0;
	Фотографии.Вставить(ИндексКартинки,Новый Структура("Фото,Расширение",Фото,СтруктураФайла.Расширение));
	ТекущаяФотография = ПоместитьВоВременноеХранилище(Фотографии[ИндексКартинки].Фото,Новый УникальныйИдентификатор);
	АдресХранилищаФотографий = ПоместитьВоВременноеХранилище(Фотографии,Новый УникальныйИдентификатор);
	Модифицированность  = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = ЛОЖЬ;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите фото'; en = 'Select file'");
   	ПараметрыДиалога.Фильтр = уб_temp.ПолучитьФильтрКартинок();
	
    ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеПомещениеФайлаНаСервер", ЭтотОбъект,Новый Структура);
	//ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	//ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
    НачатьПомещениеФайловНаСервер(ЗавершениеОбратныйВызов,,,,УникальныйИдентификатор);

КонецПроцедуры
&НаКлиенте
Процедура ЗавершениеПомещениеФайлаНаСервер(ОписанияПомещенногоФайла, СтруктураЗаполнения) Экспорт
	//Сообщить("Отладка 1");
	Если ОписанияПомещенногоФайла = Неопределено Тогда
		//Сообщить("Отладка 2");
		Возврат
	КонецЕсли;
	ЕстьИзменения = ЛОжь;
	Для каждого ОписаниеПомещенногоФайла из ОписанияПомещенногоФайла Цикл
		Попытка
			ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
			//Сообщить(ИмяФайла);
			//ИмяФайлаПолное = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
			
			СтруктураЗаполнения.Вставить("АдресФайла",ОписаниеПомещенногоФайла.Адрес);
			СтруктураЗаполнения.Вставить("Расширение",ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
			СтруктураЗаполнения.Вставить("Имя",ИмяФайла);
			//СтруктураЗаполнения.Вставить("ПолноеИмяФайла",ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.Имя);
			
			ДобавитьФотоНаСервере(СтруктураЗаполнения);
		Исключение
			Сообщить(ОписаниеОшибки());
			//Сообщить(ТипЗнч(ОписаниеПомещенногоФайла.СсылкаНаФайл));
		КонецПопытки;	

	КонецЦикла;
КонецПроцедуры	  



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Фотографии = ТекущийОбъект.Фотография.Получить();
	Если Фотографии = Неопределено Тогда
		Фотографии = Новый Массив;
	КонецЕсли;	
	АдресХранилищаФотографий = ПоместитьВоВременноеХранилище(Фотографии,Новый УникальныйИдентификатор);
	ИндексКартинки = -1;
	Для Счетчик = 0 по Фотографии.Количество()-1 Цикл
		ИндексКартинки  = Счетчик;
		Попытка
			ТекущаяФотография = ПоместитьВоВременноеХранилище(Фотографии[ИндексКартинки].Фото,Новый УникальныйИдентификатор);
		Исключение
			ТекущаяФотография = ПоместитьВоВременноеХранилище(Фотографии[ИндексКартинки],Новый УникальныйИдентификатор);
		КонецПопытки;	
		Прервать;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция УстановитьФотоПоИндексу(Индекс)
	Фотографии = ПолучитьИзВременногоХранилища(АдресХранилищаФотографий);
	ИндексКартинки = Мин(Фотографии.Количество()-1,ИндексКартинки);
	ТекущаяФотография = ПоместитьВоВременноеХранилище(Фотографии[ИндексКартинки].Фото,Новый УникальныйИдентификатор);
	
КонецФункции	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресХранилищаФотографий) Тогда
		Фотографии = ПолучитьИзВременногоХранилища(АдресХранилищаФотографий);
		ТекущийОбъект.Фотография = Новый ХранилищеЗначения(Фотографии);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)
	УдалитьФотоНаСервере();
КонецПроцедуры
&НаСервере
Процедура УдалитьФотоНаСервере()
	//Массив
	Фотографии = ПолучитьИзВременногоХранилища(АдресХранилищаФотографий);
	Фотографии.Удалить(ИндексКартинки);
	ИндексКартинки = Макс(Фотографии.Количество()-1,-1);
	Если ИндексКартинки<>-1 Тогда
		ТекущаяФотография = ПоместитьВоВременноеХранилище(Фотографии[ИндексКартинки].Фот,Новый УникальныйИдентификатор);
	Иначе
		ТекущаяФотография = "";
	КонецЕсли;	
	АдресХранилищаФотографий = ПоместитьВоВременноеХранилище(Фотографии,Новый УникальныйИдентификатор);
	Модифицированность  = Истина;
КонецПроцедуры




#КонецОбласти
