Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	// Очистим начальный документ
	ДокументРезультат.Очистить();	
	Макет = ПолучитьМакет("Макет");	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Если ДатаКон = '00010101000000' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '29990101000000');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	Запрос.УстановитьПараметр("СК", ?(СК.Пустая(),Null,СК));	
	Запрос.УстановитьПараметр("СтраховойПродукт", ?(СтраховойПродукт.Пустая(),Null,СтраховойПродукт));	
	Запрос.УстановитьПараметр("ПоложениеБСО", ?(ТолькоНеПереданныеВСКПолисы,Перечисления.уб_ПоложенияБСО.ПереданВСК,Null));	
	Запрос.УстановитьПараметр("НомерПолиса", ?(СокрЛП(НомерПолиса)="",Null,СокрЛП(НомерПолиса)));	
	Запрос.УстановитьПараметр("Агент", ?(СокрЛП(Агент)="",Null,Агент));	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОП.СтраховойПолис КАК СтраховойПолис,
	|	СУММА(ОП.АВилиСкидкаСумма) КАК АВилиСкидкаСумма,
	|	СУММА(ОП.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	ПОДСТРОКА(ОП.Комментарий, 1, 30) КАК Комментарий,
	|	ОП.НомерВзноса,
	|	ОП.Дата КАК ДатаОплаты
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК ОП
	|ГДЕ
	|	НЕ ОП.ПометкаУдаления
	|	И ОП.Дата >= &ДатаНач
	|	И ОП.Дата <= &ДатаКон
	|	И (ОП.СтраховойПолис.СК = &СК
	|			ИЛИ &СК ЕСТЬ NULL )
	|	И (ОП.СтраховойПолис.СтраховойПродукт = &СтраховойПродукт
	|			ИЛИ &СтраховойПродукт ЕСТЬ NULL )
	|	И (ОП.СтраховойПолис.Номер = &НомерПолиса
	|			ИЛИ &НомерПолиса ЕСТЬ NULL )
	|	И (ОП.СтраховойПолис.Агент = &Агент
	|			ИЛИ &Агент ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	ОП.СтраховойПолис,
	|	ОП.НомерВзноса,
	|	ОП.Дата,
	|	ПОДСТРОКА(ОП.Комментарий, 1, 30)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.СтраховойПолис,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(
	|			&ДатаНач,
	|			Подтверждено
	//|				И ДокПроведен
	|			) КАК Д
	|ГДЕ
	|	(Д.ПоложениеБСО = &ПоложениеБСО
	|			ИЛИ &ПоложениеБСО ЕСТЬ NULL )
	|	И Д.НомерПолиса = Д.СтраховойПолис.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты,
	|	СтраховойПолис";
	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтНач 	= Формат(ДатаНач,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ДтКон 	= Формат(ДатаКон,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	Обл.Параметры.ПечСК		= ?(ЗначениеНеЗаполнено(СК),"все компании",СК);
	ДокументРезультат.Вывести(Обл);	
	РезЗапроса 	= Запрос.Выполнить();
	Выборка 	= РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ИтАВилиСкидкаСумма = 0;
	//ИтНачисленнаяСтраховаяПремия = 0;
	ИтСтраховаяПремия = 0;
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Ном = 	Ном + 1;
		//
		СтраховойПолис				= Выборка.СтраховойПолис;
		Если СтраховойПолис.Дата>=ДатаНач И СтраховойПолис.Дата<=ДатаКон Тогда
			СтраховаяСумма = СтраховойПолис.СтраховаяСумма;
		Иначе
			СтраховаяСумма=0;
		КонецЕсли;
		//НачисленнаяСтраховаяПремия=СтраховойПолис.Риски.Итог("СтраховаяПремия");
		НомераКвитанций="";
		Для Каждого БСО из СтраховойПолис.БСО Цикл
			Если Найти(ВРег(БСО.ВидБСО),"КВИТАНЦ")>0 Тогда
				НомераКвитанций=НомераКвитанций+СокрЛП(БСО.НомерБСО)+" ";
			КонецЕсли;
		КонецЦикла;
		//
		Обл 										= Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Ном							= Ном;
		Обл.Параметры.Документ						= СтраховойПолис;
		Обл.Параметры.СтраховойПродукт				= СтраховойПолис.СтраховойПродукт;
		Обл.Параметры.Страхователь					= СтраховойПолис.Страхователь;
		Обл.Параметры.Агент							= СтраховойПолис.Агент;
		Обл.Параметры.Номер							= СтраховойПолис.Номер;
		Обл.Параметры.Дата							= СтраховойПолис.Дата;
		Обл.Параметры.ДатаНачала					= СтраховойПолис.ДатаНачала;
		Обл.Параметры.ДатаОкончания					= СтраховойПолис.ДатаОкончания;
		Обл.Параметры.НомерПлатежногоДокумента		= НомераКвитанций;
		Обл.Параметры.ДатаПлатежногоДокумента		= Выборка.ДатаОплаты;
		Обл.Параметры.СтраховаяСумма				= СтраховаяСумма;
		Обл.Параметры.ПроцентАгента					= ?(Выборка.НачисленнаяСуммаВзноса=0,0,Окр(Выборка.АВилиСкидкаСумма*100/Выборка.НачисленнаяСуммаВзноса,2));
		Обл.Параметры.АВилиСкидкаСумма					= Выборка.АВилиСкидкаСумма;
		//Обл.Параметры.НачисленнаяСтраховаяПремия	= НачисленнаяСтраховаяПремия;
		Обл.Параметры.СтраховаяПремия				= Выборка.НачисленнаяСуммаВзноса;
		Обл.Параметры.Комментарий					= Выборка.Комментарий;
		Обл.Параметры.ПризнакПлатежа				= ?(Выборка.НомерВзноса > 1,"Очередной","");
		//
		ДокументРезультат.Вывести(Обл,1,,Ложь);
		//
		ИтАВилиСкидкаСумма = ИтАВилиСкидкаСумма + Выборка.АВилиСкидкаСумма;
		//ИтНачисленнаяСтраховаяПремия = ИтНачисленнаяСтраховаяПремия+НачисленнаяСтраховаяПремия;
		ИтСтраховаяПремия = ИтСтраховаяПремия+Выборка.НачисленнаяСуммаВзноса;
	КонецЦикла;
	
	Обл 										= Макет.ПолучитьОбласть("Итог");
	Обл.Параметры.ИтАВилиСкидкаСумма				= ИтАВилиСкидкаСумма;
	//Обл.Параметры.ИтНачисленнаяСтраховаяПремия	= ИтНачисленнаяСтраховаяПремия;
	Обл.Параметры.ИтСтраховаяПремия				= ИтСтраховаяПремия;
	ДокументРезультат.Вывести(Обл,1,,Ложь);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху      = 8;

	ДокументРезультат.Показать("Отчет о продажах для страховых компаний");
	
КонецПроцедуры

#Если Клиент Тогда
НП = Новый НастройкаПериода;
#КонецЕсли
