
////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ ОТЧЕТА

Процедура СформироватьОтчет(ДокументРезультат) Экспорт 

	Если ЗначениеНеЗаполнено(ДатаОтчета) Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	// Очистим начальный документ
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКон", ДатаОтчета);
	Запрос.УстановитьПараметр("СК", СК);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ВидБСО", ВидБСО);
	Запрос.УстановитьПараметр("ОрганизацияАгент", ОрганизацияАгент);
	Запрос.УстановитьПараметр("ПоложениеБСО", ПоложениеБСО);
	//Запрос.УстановитьПараметр("ПереданныеВСК", Перечисления.уб_ПоложенияБСО.ПереданВСК);
	Запрос.УстановитьПараметр("СостояниеБСО", СостояниеБСО);
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.УстановитьПараметр("НомерБСО", ?(СокрЛП(НомерБСО)="",NULL,СокрЛП(НомерБСО)));
	
	//СписокПоложений = Новый СписокЗначений;
	//СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПолученИзСК);
	//СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенИзСК);
	//СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ПереданНаТочку);
	//СписокПоложений.Добавить(Перечисления.уб_ПоложенияБСО.ВозвращенСТочки);
	//Запрос.УстановитьПараметр("СписокПоложений", СписокПоложений);
	
	уиД = "";
	уД  = " ГДЕ ИСТИНА ";
	уиО = "";
	
	Если НЕ ЗначениеНеЗаполнено(СК) Тогда
		уиД = уиД + "И СК = &СК ";
		уиО = уиО + " И уб_ОстаткиБСО.СК = &СК ";
	КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(ВидБСО) Тогда
		уиД = уиД + "И ВидБСО = &ВидБСО ";
		уиО = уиО + " И уб_ОстаткиБСО.ВидБСО = &ВидБСО ";
	КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(НомерБСО) Тогда
		уиД = уиД + "И Д.НомерБСО = &НомерБСО ";
	КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(Поставщик) Тогда
		уиД = уиД + "И Поставщик = &Поставщик ";
		уиО = уиО + " И уб_ОстаткиБСО.Поставщик = &Поставщик ";
	КонецЕсли;
	//Если НЕ ЗначениеНеЗаполнено(Организация) Тогда
	//	уиД = уиД + " И Организация = &Организация ";
	//	уиО = уиО + " И уб_ОстаткиБСО.Организация = &Организация ";
	//КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда
		уиД = уиД + " И ОрганизацияАгент = &ОрганизацияАгент ";
		уиО = уиО + " И уб_ОстаткиБСО.ОрганизацияАгент = &ОрганизацияАгент ";
	КонецЕсли;

	
	//Если НЕ ЗначениеНеЗаполнено(Подразделение) Тогда
	//	уиО = уиО + "И уб_ОстаткиБСО.Подразделение = &Подразделение ";
	//	уД  = уД  + "И Подразделение = &Подразделение ";
	//КонецЕсли;
	Если НЕ ЗначениеНеЗаполнено(Агент) Тогда
		уиО = уиО + "И уб_ОстаткиБСО.Агент = &Агент ";
		уД  = уД  + "И Агент = &Агент ";
	КонецЕсли;
	
	Если ПоложениеБСО.Количество() > 0 Тогда
		уД = уД + " И Д.ПоложениеБСО В (&ПоложениеБСО) ";
	КонецЕсли;
		
	Если СостояниеБСО.Количество() > 0 Тогда
		уД = уД + " И Д.СостояниеБСО В (&СостояниеБСО) ";
	КонецЕсли;

	Запрос.Текст ="ВЫБРАТЬ
	|	Д.ОрганизацияАгент КАК ОрганизацияАгент,
	|	Д.Агент КАК Агент,
	|	Д.СК КАК СК,
	|	Д.ВидБСО КАК ВидБСО,
	|	Д.ВидБСО.Наименование КАК НаимВидБСО,
	|	Д.НомерБСО КАК НомерБСО,
	|	Д.ПоложениеБСО,
	|	Д.СостояниеБСО,
	|	Д.Поставщик КАК Поставщик,
	|	Д.ДатаВозврата,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	РегистрСведений.уб_ДвиженияБСО.СрезПоследних(&ДатаКон, ИСТИНА " + уиД + " И Подтверждено 
	//|	И ДокПроведен
	|	) КАК Д
	|" + уД + "
	|
	|СГРУППИРОВАТЬ ПО
	|	Д.ОрганизацияАгент,
	|	Д.Агент,
	|	Д.СК,
	|	Д.ВидБСО,
	|	Д.ВидБСО.Наименование,
	|	Д.НомерБСО,
	|	Д.ПоложениеБСО,
	|	Д.СостояниеБСО,
	|	Д.ДатаВозврата,
	//|   Д.ДокПроведен,
	|   Д.Подтверждено,
	|	Д.Поставщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   
	|	ВложенныйЗапрос.ОрганизацияАгент,
	|	ВложенныйЗапрос.Агент,
	|	ВложенныйЗапрос.СК,
	|	ВложенныйЗапрос.ВидБСО,
	|	ВложенныйЗапрос.ВидБСО.Наименование,
	|	""<без номера>"",
	|	NULL,
	|	""<Пустые бланки>"",
	|	ВложенныйЗапрос.Поставщик,
	|	NULL,
	|	СУММА(ВложенныйЗапрос.Количество)
	|ИЗ
	|	(ВЫБРАТЬ
	|		уб_ОстаткиБСО.СК КАК СК,
	|		уб_ОстаткиБСО.ВидБСО КАК ВидБСО,
	|		уб_ОстаткиБСО.Агент КАК Агент,
	|		уб_ОстаткиБСО.ОрганизацияАгент КАК ОрганизацияАгент,
	|		уб_ОстаткиБСО.Поставщик КАК Поставщик,
	|		СУММА(ВЫБОР
	|				КОГДА уб_ОстаткиБСО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА уб_ОстаткиБСО.Количество
	|				ИНАЧЕ 0 - уб_ОстаткиБСО.Количество
	|			КОНЕЦ) КАК Количество
	|	ИЗ
	|		РегистрНакопления.уб_ОстаткиБСО КАК уб_ОстаткиБСО
	|	ГДЕ
	|		уб_ОстаткиБСО.Период < &ДатаКон
	|" + уиО + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		уб_ОстаткиБСО.СК,
	|		уб_ОстаткиБСО.ВидБСО,
	|		уб_ОстаткиБСО.Агент,
	|		уб_ОстаткиБСО.Поставщик,
	|		уб_ОстаткиБСО.ОрганизацияАгент) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Количество <> 0
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ОрганизацияАгент,
	|	ВложенныйЗапрос.Агент,
	|	ВложенныйЗапрос.СК,
	|	ВложенныйЗапрос.ВидБСО,
	|	ВложенныйЗапрос.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацияАгент,
	|	Агент,
	|	СК,
	|	Поставщик,
	|	НаимВидБСО,
	|	НомерБСО
	|ИТОГИ
	|	СУММА(Количество)
	|ПО 
	//ОБЩИЕ,
	|	ОрганизацияАгент,
	|	Агент,
	|	СК,
	|	ВидБСО";
	
	
	РезЗапроса 	= Запрос.Выполнить();
	//РезТаблица = РезЗапроса.Выгрузить();
	
	Обл 					= Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДтКон 	= Формат(ДатаОтчета,"ЧЦ=19; ЧДЦ=2; ЧРД=.; ДФ=dd.MM.yyyy; ДП=-");
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	
	Если ЗначениеНеЗаполнено(ВидБСО) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоВидБСО"),Смещать);
	Иначе
		Обл.Параметры.ПечВидБСО	= ВидБСО;
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Агент) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоАгент"),Смещать);
	Иначе
		Обл.Параметры.ПечАгент = Агент;
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(Подразделение) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоПодр"),Смещать);
	Иначе
		Обл.Параметры.ПечПодр = Подразделение;
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(СК) Тогда
		Обл.УдалитьОбласть(Макет.Область("ИнфоСК"),Смещать);
	Иначе
		Обл.Параметры.ПечСК	= СК;
	КонецЕсли;
	
	ДокументРезультат.Вывести(Обл);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	СчВида = 0;
	ВыборкаОрг 	= РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаОрг.Следующий() Цикл
		Обл 					= Макет.ПолучитьОбласть("Орг");
		//Обл.Параметры.Орг		= ВыборкаОрг.Организация;
		Обл.Параметры.Кол		= ВыборкаОрг.Количество;
		ДокументРезультат.Вывести(Обл,1,,Истина);
		ВыборкаОргАгент 	= ВыборкаОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаОргАгент.Следующий() Цикл
			Обл 					= Макет.ПолучитьОбласть("ОргАгент");
			Обл.Параметры.ОргАгент	= ВыборкаОргАгент.ОрганизацияАгент;
			Обл.Параметры.Кол		= ВыборкаОргАгент.Количество;
			ДокументРезультат.Вывести(Обл,1,,Истина);
			ВыборкаПодр 	= ВыборкаОргАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			Пока ВыборкаПодр.Следующий() Цикл
				Обл 					= Макет.ПолучитьОбласть("Подр");
				//Обл.Параметры.Подр		= ВыборкаПодр.Подразделение;
				Обл.Параметры.Кол		= ВыборкаПодр.Количество;
				ДокументРезультат.Вывести(Обл,2,,Истина);
				ВыборкаАгент 	= ВыборкаПодр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				Пока ВыборкаАгент.Следующий() Цикл
					Обл 					= Макет.ПолучитьОбласть("Агент");
					Обл.Параметры.Агент		= ВыборкаАгент.Агент;
					Обл.Параметры.Кол		= ВыборкаАгент.Количество;
					ДокументРезультат.Вывести(Обл,3,,Истина);
					ВыборкаСК	 	= ВыборкаАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
					Пока ВыборкаСК.Следующий() Цикл
						Обл 					= Макет.ПолучитьОбласть("СК");
						Обл.Параметры.СК		= "    "+ВыборкаСК.СК;
						Обл.Параметры.Кол		= ВыборкаСК.Количество;
						ДокументРезультат.Вывести(Обл,4,,Истина);
						
						ВыборкаВиды	 	= ВыборкаСК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
						
						Пока ВыборкаВиды.Следующий() Цикл
							СчВида = 	СчВида + 1;
							
							ОблВида 						= Макет.ПолучитьОбласть("ВидБСО");
							//ОблВида.Параметры.Ном			= СчВида;
							ОблВида.Параметры.ВидБСО		= "        "+ВыборкаВиды.ВидБСО;
							ОблВида.Параметры.Кол			= ВыборкаВиды.Количество;
							ДокументРезультат.Вывести(ОблВида,5,,Истина);
							
							СчНомера = 0;
							ВыборкаНомера 	= ВыборкаВиды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
							Пока ВыборкаНомера.Следующий() Цикл
								СчНомера = 	СчНомера + 1;
								Обл 						= Макет.ПолучитьОбласть("Строка");
								Обл.Параметры.Ном			= СчНомера;
								Обл.Параметры.НомерБСО		= ВыборкаНомера.НомерБСО;
								
								Обл.Параметры.ЗначРасшифровки = Новый Структура("НомерБСО, ВидБСО", ВыборкаНомера.НомерБСО, ВыборкаНомера.ВидБСО);;
								
								Обл.Параметры.ПоложениеБСО	= ВыборкаНомера.ПоложениеБСО;
								Обл.Параметры.СостояниеБСО	= ВыборкаНомера.СостояниеБСО;
								Обл.Параметры.Поставщик		= ВыборкаНомера.Поставщик;
								Обл.Параметры.ДатаВозврата	= ?(ВыборкаНомера.ДатаВозврата = Дата("00010101000000"), "-", Формат(ВыборкаНомера.ДатаВозврата, "ДЛФ=Д"));
								
								дДатаВозврата = ?(ТипЗнч(ВыборкаНомера.ДатаВозврата) = Тип("Дата"),ВыборкаНомера.ДатаВозврата,Дата("00010101000000"));	
								
								Если дДатаВозврата < ТекущаяДата() и НЕ дДатаВозврата = Дата("00010101000000") Тогда
									Обл.Области.ДатаВозврата.ЦветФона = WebЦвета.СветлоКоралловый;
								КонецЕсли;	
								Обл.Параметры.Кол			= ВыборкаНомера.Количество;
								ДокументРезультат.Вывести(Обл,5,ВыборкаВиды.ВидБСО,Истина);
							КонецЦикла;							
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	//Обл 					= Макет.ПолучитьОбласть("Итого");
	//Обл.Параметры.Сумма 	= ИтСумма;
	//ТабДокумент.Вывести(Обл);
	
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ФиксацияСверху	= 7;
	ДокументРезультат.ФиксацияСлева		= 0;

	ДокументРезультат.Показать("Остатки БСО");
	
	//Построитель = Новый ПостроительОтчета(Запрос.Текст);
	

КонецПроцедуры
