
Функция ПолучитьСуммыПеречисленийПоОтчету(ОтчетПоставщику)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Взаиморасчет.Ссылка.Поставщик КАК Поставщик,
	                      |	Взаиморасчет.Ссылка.ОрганизацияАгент КАК ОргАгент,
	                      |	Взаиморасчет.Ссылка.ФормаОплаты КАК ФормаОплаты,
	                      |	Взаиморасчет.Ссылка.СуммаДокумента КАК СуммаДокумента,
	                      |	Взаиморасчет.Ссылка.НаправлениеРасчетов КАК НаправлениеРасчетов,
	                      |	ВЫБОР
	                      |		КОГДА Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	                      |			ТОГДА Взаиморасчет.Ссылка.СуммаДокумента
	                      |	КОНЕЦ КАК СуммаКВ,
	                      |	ВЫБОР
	                      |		КОГДА Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	                      |			ТОГДА Взаиморасчет.Ссылка.СуммаДокумента
	                      |	КОНЕЦ КАК ЗадолженностьПередПоставщиком,
	                      |	Взаиморасчет.Ссылка.ДокументБух,
	                      |	Взаиморасчет.Ссылка.НомерВходящегоДокумента КАК ВходящийНомер,
	                      |	Взаиморасчет.Ссылка.ДатаВходящегоДокумента КАК ВходящийДата,
	                      |	Взаиморасчет.Ссылка КАК ВзаиморасчетСПоставщиком
	                      |ИЗ
	                      |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Взаиморасчет
	                      |ГДЕ
	                      |	Взаиморасчет.ОтчетПоставщику = &ОтчетПоставщику");
						  
	Запрос.УстановитьПараметр("ОтчетПоставщику", ОтчетПоставщику);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ПеречисленноПоставщику	= Выборка.Итог("ЗадолженностьПередПоставщиком");
	ПолученноОтПоставщика	= Выборка.Итог("СуммаКВ");
	
	Возврат Новый Структура("ПеречисленноПоставщику, ПолученноОтПоставщика", ПолученноОтПоставщика, ПолученноОтПоставщика);
	
КонецФункции


Процедура ОтправкаСообщенияПоОтчетамПоставщикам(ДниВСекундахОтсрочки, ДниВСекундахДляПовтора, ДопустимаяСуммаЗадолженности) Экспорт

		Таблица = уб_Взаиморасчеты.ПолучитьСостояниеОтчетаПоставщику(Неопределено, ЛОЖЬ);
		Если Таблица.Количество() > 0 Тогда			
			ТекДата = ТекущаяДата();
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	НастройкиПользователей.Значение.МОЛпоБСО
			|ПОМЕСТИТЬ ВТ_МОЛ
			|ИЗ
			|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
			|ГДЕ
			|	НастройкиПользователей.Пользователь = &Пользователь
			|	И НастройкиПользователей.Настройка = &Настройка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КонтактнаяИнформация.Объект,
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОЛ КАК ВТ_МОЛ
			|		ПО КонтактнаяИнформация.Объект = ВТ_МОЛ.ЗначениеМОЛпоБСО
			|ГДЕ
			|	КонтактнаяИнформация.Тип = &Тип
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уб_ОтправленныеСообщенияСрезПоследних.Основание,
			|	уб_ОтправленныеСообщенияСрезПоследних.ДатаОтправления,
			|	уб_ОтправленныеСообщенияСрезПоследних.Получатель
			|ИЗ
			|	РегистрСведений.уб_ОтправленныеСообщения.СрезПоследних(&ТекДата, Основание В (&МассивОтчетов)) КАК уб_ОтправленныеСообщенияСрезПоследних";
			Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.Robot);
			Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделениеОрганизации);
			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Запрос.УстановитьПараметр("МассивОтчетов", Таблица.ВыгрузитьКолонку("ОтчетПоставщику"));
			Запрос.УстановитьПараметр("ТекДата", ТекДата);
			Результат = Запрос.ВыполнитьПакет();
			Выборка = Результат[1].Выбрать();
			ВыборкаОтправленныхСообщений = Результат[2].Выбрать();		
			Получатели = Новый Массив;
			Если Выборка.Следующий() Тогда
				Получатели.Добавить(Выборка.Представление);
			КонецЕсли;			
			Если Получатели.Количество() > 0 Тогда					
				Таблица.Сортировать("ОтчетПоставщикуНомер");
				Набор = РегистрыСведений.уб_ОтправленныеСообщения.СоздатьНаборЗаписей();
				Набор.Отбор.Период.Использование = Истина;
				Набор.Отбор.Период.ВидСравнения = ВидСравнения.Равно;
				Набор.Отбор.Период.Значение = ТекДата;
				Набор.Прочитать();
				Текст = "";				
				Отбор = Новый Структура("Основание");
				Для Каждого СтрокаТЗ Из Таблица Цикл
					Если СтрокаТЗ.ЗадолженностьПоКВ > ДопустимаяСуммаЗадолженности Тогда
						Отбор.Основание = СтрокаТЗ.ОтчетПоставщику;
						ВыборкаОтправленныхСообщений.Сбросить();
						Отправить = Ложь;
						Если ТекДата > СтрокаТЗ.ОтчетПоставщикуДата + ДниВСекундахОтсрочки Тогда
							Отправлялось = ВыборкаОтправленныхСообщений.НайтиСледующий(Отбор);
							Если Отправлялось Тогда							
								Если ДниВСекундахДляПовтора > 0 И ТекДата > ВыборкаОтправленныхСообщений.ДатаОтправления + ДниВСекундахДляПовтора Тогда
									Отправить = Истина;
								КонецЕсли;
							Иначе
								Отправить = Истина;
							КонецЕсли;
						КонецЕсли;
						
						Если Не Отправить Тогда
							Продолжить;
						КонецЕсли;
						
						Текст = Текст + Символы.ПС + "Отчет поставщику " + СтрокаТЗ.ОтчетПоставщикуНомер + " от " + СтрокаТЗ.ОтчетПоставщикуДата;
						Движение = Набор.Добавить();
						Движение.Период = ТекДата;
						Движение.ДатаОтправления = ТекДата;
						Движение.Основание = СтрокаТЗ.ОтчетПоставщику;
						Движение.Получатель = Выборка.Объект;
					КонецЕсли;
				КонецЦикла;
				Если Текст <> "" Тогда
					Параметры = уб_ОбменДанными.ПараметрыСообщенияEMailПоУмолчанию();
					Параметры.Получатели 	= Получатели;
					Параметры.Тема			= "Отсутствует возврат КВ по следующим отчетам поставщикам";
					Параметры.Сообщение		= "Отсутствует возврат КВ по следующим отчетам поставщикам: " + Текст + Символы.ПС;
					уб_ОбменДанными.SendMail(Параметры);
					Набор.Записать();
				КонецЕсли;
			Иначе
				ЗаписьЖурналаРегистрации("Не удалось получить адрес электронной почты при выполнении процедуры уб_ОтправкаСообщенийПоНеоплаченнымОтчетамПоставщикам",
				УровеньЖурналаРегистрации.Предупреждение);
			КонецЕсли;
		КонецЕсли;
	
КонецПроцедуры
//Функция СтруктураБлокировкиОтчетаПоставщику(Ссылка) Экспорт

//	Структура = Новый Структура;
//	Структура.Вставить("ЕстьПравоРазблокировки", уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПравоРедактированияЗаблокированных, Ложь));
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ИСТИНА КАК НеПустой
//	|ИЗ
//	|	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК ВЗ
//	|ГДЕ
//	|	ВЗ.ОтчетПоставщику = &Ссылка
//	|	И ВЗ.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)");
//	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
//	Запрос.УстановитьПараметр("ЕстьПравоРазблокировки", Структура.ЕстьПравоРазблокировки);
//	Результат = Запрос.Выполнить();
//	Структура.Вставить("ЕстьПеречисление", 	Не Результат.Пустой());
//	Структура.Вставить("Заблокирован",		Структура.ЕстьПеречисление И Не Структура.ЕстьПравоРазблокировки И РегистрыСведений.уб_РазблокировкаОбъектов.СостояниеБлокировки(Ссылка,, ПараметрыСеанса.ТекущийПользователь));
//	Возврат Структура;
//	
//КонецФункции


Функция ПолучитьИтогиВзаиморасчетов(ОтчетыПоставщику) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Взаиморасчет.Ссылка.Поставщик КАК Поставщик,
	               |	Взаиморасчет.Ссылка.ОрганизацияАгент КАК ОргАгент,
	               |	Взаиморасчет.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	Взаиморасчет.Ссылка.СуммаДокумента КАК СуммаДокумента,
	               |	Взаиморасчет.Ссылка.НаправлениеРасчетов КАК НаправлениеРасчетов,
	               |	ВЫБОР
	               |		КОГДА Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПоступлениеКВОтПоставщика)
	               |			ТОГДА Взаиморасчет.Сумма
	               |	КОНЕЦ КАК СуммаКВ,
	               |	ВЫБОР
	               |		КОГДА Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщику)
	               |				ИЛИ Взаиморасчет.Ссылка.НаправлениеРасчетов = ЗНАЧЕНИЕ(Перечисление.уб_ВидОперацииВзаиморасчетов.ПеречислениеПоставщикуСтрахователем)
	               |			ТОГДА Взаиморасчет.Сумма
	               |	КОНЕЦ КАК ЗадолженностьПередПоставщиком,
	               |	Взаиморасчет.Ссылка.ДокументБух,
	               |	Взаиморасчет.Ссылка.НомерВходящегоДокумента КАК ВходящийНомер,
	               |	Взаиморасчет.Ссылка.ДатаВходящегоДокумента КАК ВходящийДата,
	               |	Взаиморасчет.Ссылка КАК ВзаиморасчетСПоставщиком,
	               |	Взаиморасчет.Сумма,
	               |	ВЫБОР
	               |		КОГДА Взаиморасчет.Ссылка.ИсключитьИзВзаиморасчетов
	               |			ТОГДА ИСТИНА
	               |		КОГДА НЕ Взаиморасчет.Ссылка.Проведен
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ИсключитьИзВзаиморасчетов,
	               |	Взаиморасчет.Ссылка.Дата КАК Дата,
	               |	ЕСТЬNULL(Взаиморасчет.Ссылка.Контрагент.ДатаВеденияВзаиморасчётов, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВеденияВзаиморасчётов,
	               |	ВЫБОР
	               |		КОГДА Взаиморасчет.Ссылка.Контрагент.ОсновнойДоговорКонтрагента.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ВидыВзаиморасчетов.СудержаниемКВ)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК СУдержанием,
	               |	Взаиморасчет.ОтчетПоставщику
	               |ИЗ
	               |	Документ.уб_ВзаиморасчетСПоставщиком.Распределение КАК Взаиморасчет
	               |ГДЕ
	               |	Взаиморасчет.ОтчетПоставщику В(&ОтчетыПоставщику)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Взаиморасчет.Ссылка.МоментВремени";
	Запрос.УстановитьПараметр("ОтчетыПоставщику",ОтчетыПоставщику);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	