Перем ПоставщикДляОтчетаПоКарточкам;

Функция ПолучитьИмяРевизитаОтбора(ЗначениеПоставщик) Экспорт
	Возврат ?(ЗначениеПоставщик = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам, "ОтчетПоКарточкам","ОтчетПоставщику")
КонецФункции

Процедура ПодборГраницПериодаОтчета() Экспорт
	
	ТЗОплат = уб_ПФ.ОП_ПолучитьТЗОплат(Новый Структура("Объект", ЭтотОбъект));
	Если НачалоОтчетногоПериода = Дата(1,1,1) Тогда	
		НачалоОтчетногоПериода = ДобавитьМесяц(Дата, -1); 
	КонецЕсли;	
	Если КонецОтчетногоПериода = Дата(1,1,1) Тогда	
		КонецОтчетногоПериода = Дата;
	КонецЕсли;		
	Для Каждого оОплата из ТЗОплат Цикл
		Если оОплата.Дата < НачалоОтчетногоПериода Тогда
			НачалоОтчетногоПериода = оОплата.Дата;
		КонецЕсли;	
		Если оОплата.Дата > КонецОтчетногоПериода Тогда
			КонецОтчетногоПериода = оОплата.Дата;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверкаЗаполнения()
	
	СтатусСооб = СтатусСообщения.Важное;		
	Рез = Истина;
	Если ЗначениеНеЗаполнено(Номер) Тогда 
		УстановитьНовыйНомер();
	КонецЕсли; 
	Если ЗначениеНеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли; 
	Если ЗначениеНеЗаполнено(НачалоОтчетногоПериода) ИЛИ ЗначениеНеЗаполнено(КонецОтчетногоПериода) Тогда 
		ПодборГраницПериодаОтчета();
	КонецЕсли; 
	Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда 
		Если Не Проведен Тогда
			oАг = уб_СС.ПолучКонтрагентаИлиФизлицоПоПльзователю(ПараметрыСеанса.ТекущийПользователь);
			Если oАг <> Неопределено Тогда
				ОрганизацияАгент = oАг;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеНеЗаполнено(ОрганизацияАгент) Тогда 
			Сообщить("Не заполнено поле 'Организация агент'!",СтатусСооб);
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли; 
	//Если ОтветственныйБСО.Пустая() Тогда 
	//	Если Не Проведен Тогда
	//		МОЛпоБСО = уб_КЭШируемые.ПолучитьМОЛпоБСОДляПользователя(ПараметрыСеанса.ТекущийПользователь);
	//		Если МОЛпоБСО <> Неопределено Тогда
	//			ОтветственныйБСО = МОЛпоБСО;
	//		КонецЕсли;
	//	КонецЕсли; 
	//	Если ЗначениеНеЗаполнено(ОтветственныйБСО) Тогда 
	//		Сообщить("Не заполнено поле 'ОтветственныйБСО'!",СтатусСооб);
	//		Рез = Ложь;
	//	КонецЕсли;
	//КонецЕсли; 
	//Если ОтветственныйФинансы.Пустая() Тогда 
	//	Если Не Проведен Тогда			
	//		ОтветственныйФинансы = уб_СС.ПолучитьФИНОтветственного();
	//	КонецЕсли; 
	//	Если ЗначениеНеЗаполнено(ОтветственныйФинансы) Тогда 
	//		Сообщить("Не заполнено поле 'Фин. Ответственный'!",СтатусСооб);
	//		Рез = Ложь;
	//	КонецЕсли;
	//КонецЕсли; 

	
	Возврат Рез;	
КонецФункции

Функция ПолучитьСтруктуруФормы(ФормаДокумента) Экспорт
	
	СтруктураФормы = Новый Структура("Ссылка",Ссылка);
	Элементы = ФормаДокумента.ЭлементыФормы;
	Для Каждого Элем из Элементы Цикл
		Если ТипЗнч(Элем) = Тип("ПолеВвода") или ТипЗнч(Элем) = Тип("ТабличноеПоле") Тогда
			СтруктураФормы.Вставить(Элем.Имя,Элем.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураФормы;
	
КонецФункции

//Функция ОП_ПолучитьТЗОплат(ТекущийПоставщик = Неопределено) Экспорт
//	
//	//возвращает таблицу - список оплат, отсортированных по дате платежа
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	О.*,
//	|	О.ПолнаяСтраховаяПремия КАК ПолнаяПремия,
//	|	О.Дата КАК ДатаОплатыСтраховогоВзноса,
//	|	О.СтраховойПолис.Номер КАК НомерПолиса,
//	|	О.СтраховойПолис.Дата КАК ДатаОформленияПолиса,
//	|	О.СтраховойПолис.ДатаНачала КАК НачалоДействияПолиса,
//	|	О.СтраховойПолис.ДатаОкончания КАК ОкончаниеДействияПолиса,
//	|	О.СтраховойПолис.Страхователь КАК Страхователь,
//	|	О.СтраховойПолис.Страхователь.Наименование КАК НаименованиеСтрахователя,
//	|	О.СтраховойПолис.СтраховойПродукт.Вид КАК ВидСтраховогоПродукта,
//	|	О.СтраховойПолис.СтраховаяСумма КАК СтраховаяСумма,
//	|	ВЫБОР
//	|		КОГДА О.ПолнаяСтраховаяПремия - О.НачисленнаяСуммаВзноса / ВЫБОР
//	|				КОГДА О.Курс = 0
//	|					ТОГДА 1
//	|				ИНАЧЕ О.Курс
//	|			КОНЕЦ МЕЖДУ -0.1 И 0.1
//	|			ТОГДА 0
//	|		ИНАЧЕ О.НомерВзноса
//	|	КОНЕЦ КАК ПризнакПлатежа,
//	|	О.СтраховойПолис.БСО.(
//	|		Ссылка КАК Ссылка,
//	|		НомерСтроки КАК НомерСтроки,
//	|		ВидБСО КАК ВидБСО,
//	|		НомерБСО КАК НомерБСО,
//	|		НомерПолиса КАК НомерПолиса,
//	|		Обязательно КАК Обязательно,
//	|		Оформлен КАК Оформлен,
//	|		НазначениеБСО КАК НазначениеБСО,
//	|		Агент КАК Агент
//	|	) КАК БСО
//	|ИЗ
//	|	Документ.уб_ОплатаПолисов КАК О
//	|ГДЕ
//	|	НЕ О.ПометкаУдаления
//	|	И О." + ПолучитьИмяРевизитаОтбора(?(текущийПоставщик = Неопределено, Поставщик, текущийПоставщик)) + " = &ОтчетПоставщику
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НаименованиеСтрахователя,Дата";
//	Запрос.УстановитьПараметр("ОтчетПоставщику", ?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка));
//	ТЗОплат = Запрос.Выполнить().Выгрузить();
//	ТЗОплат.Колонки.Добавить("НомерБСО");
//	//нужен параметр НомерБСО
//	Для Каждого СтрокаТЗ Из ТЗОплат Цикл
//		СтрокаТЗ.НомерБСО = уб_СС.ДайНомерБСОПоСП(СтрокаТЗ.СтраховойПолис,,СтрокаТЗ.БСО);
//	КонецЦикла;
//	Возврат ТЗОплат;
//	
//КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//SS TODO При проведении проверять, проведены ли квитанции.
// Если не проведены - отказ и уведомление, что надо сначала провести соответствующий страховой полис.

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПравоПроведенияОА = ПравоДоступа("Проведение", Метаданные());
	ДокументОК = ПроверкаЗаполнения();	
	Отказ = НЕ (ДокументОК И ПравоПроведенияОА);	
	Возврат;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = НЕ ПравоДоступа("ОтменаПроведения", Метаданные());
	Возврат;	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Оповестить("ПриЗаписиОтчетаПоставщику", Проведен, ЭтотОбъект);
	#КонецЕсли	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновитьКоличествоСтрокОплат();
	
	Если ВидОперации.Пустая() Тогда
		ВидОперации = Перечисления.уб_ВидОперацииВзаиморасчетов.ОтчетПоставщику;
	КонецЕсли;	
	
	Если Не Отказ И Не ЭтоНовый() Тогда
		Если ОрганизацияАгент <> Ссылка.ОрганизацияАгент Тогда
			//если изменился орг. агент, то в автооплатах заменить
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уб_ОплатаПолисов.Ссылка
			|ИЗ
			|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
			|ГДЕ
			|	уб_ОплатаПолисов.ОтчетПоставщику = &ОтчетПоставщику";
			Запрос.УстановитьПараметр("ОтчетПоставщику", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Массив = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Массив.Добавить(Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			КонецЦикла;	
			ЗапросВзаиморасчетов = Новый Запрос;
			ЗапросВзаиморасчетов.Текст = "ВЫБРАТЬ
			|	уб_ВзаиморасчетСПоставщиком.Ссылка
			|ИЗ
			|	Документ.уб_ВзаиморасчетСПоставщиком КАК уб_ВзаиморасчетСПоставщиком
			|ГДЕ
			|	ВЫРАЗИТЬ(уб_ВзаиморасчетСПоставщиком.IDизБухДок КАК СТРОКА(36)) В (&Массив)";
			ЗапросВзаиморасчетов.УстановитьПараметр("Массив", Массив);
			ВыборкаВзаиморасчетов = ЗапросВзаиморасчетов.Выполнить().Выбрать();
			Пока ВыборкаВзаиморасчетов.Следующий() Цикл
				Объект = ВыборкаВзаиморасчетов.Ссылка.ПолучитьОбъект();
				Объект.ОрганизацияАгент = ОрганизацияАгент;
				Объект.Записать();
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьКоличествоСтрокОплат() Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	КОЛИЧЕСТВО(*) КАК Кол
	//			   |ИЗ
	//			   |	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	//			   |ГДЕ
	//			   |    НЕ уб_ОплатаПолисов.ПометкаУдаления 
	//			   |	И уб_ОплатаПолисов." + ПолучитьИмяРевизитаОтбора(Поставщик) + " = &ОтчетПоставщику";
	//Запрос.УстановитьПараметр("ОтчетПоставщику", ?(ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка));
	//Выборка = Запрос.Выполнить().Выбрать();
	//Выборка.Следующий();
	//Кол = Выборка.Кол;
	//Если КоличествоСтрокОплат <> Кол Тогда
	//	КоличествоСтрокОплат = Кол;
	//КонецЕсли;
	//ПоставщикДляОтчетаПоКарточкам = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Кол
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	НЕ уб_ОплатаПолисов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &Поставщик <> (ВЫРАЗИТЬ(&ПоставщикДляОтчетаПоКарточкам КАК Справочник.Контрагенты))
	|				ТОГДА уб_ОплатаПолисов.ОтчетПоставщику = &ОтчетПоставщику
	|			ИНАЧЕ уб_ОплатаПолисов.ОтчетПоКарточкам = &ОтчетПоставщику
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ОтчетПоставщику", ?(ЭтоНовый(),ПолучитьСсылкуНового(),Ссылка));
	Запрос.УстановитьПараметр("ПоставщикДляОтчетаПоКарточкам",ПоставщикДляОтчетаПоКарточкам);
	Запрос.УстановитьПараметр("Поставщик",Поставщик);	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Кол = Выборка.Кол;
	Если КоличествоСтрокОплат <> Кол Тогда
		КоличествоСтрокОплат = Кол;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеАктуальногоОтчетаПоставщику() Экспорт
	
	СтруктураАктуальногоОП = Новый Структура();
	СтруктураАктуальногоОП.Вставить("НомерОтчетаПоставщику",НомерОтчетаПоставщику);
	СтруктураАктуальногоОП.Вставить("Дата",Дата);
	СтруктураАктуальногоОП.Вставить("ИтогОС_КПеречислениюПоставщику",ИтогОС_КПеречислениюПоставщику);
	
	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить("НомерОтчетаПоставщику");
	СписокРеквизитов.Добавить("Дата");
	СписокРеквизитов.Добавить("ИтогОС_КПеречислениюПоставщику");
	
	//Пипец как тормозит! Невозможно распечатать сверку! 
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	уб_ИсторияСрезПоследних.Реквизит,
	//					  |	уб_ИсторияСрезПоследних.Значение
	//					  |ИЗ
	//					  |	РегистрСведений.уб_История.СрезПоследних КАК уб_ИсторияСрезПоследних
	//					  |ГДЕ
	//					  //|	уб_ИсторияСрезПоследних.АктуальностьВерсии
	//					  |	уб_ИсторияСрезПоследних.ОбъектИстории = &ОбъектИстории
	//					  |	И уб_ИсторияСрезПоследних.Реквизит В(&СписокРеквизитов)");
	//Запрос.УстановитьПараметр("ОбъектИстории", ЭтотОбъект.Ссылка);
	//Запрос.УстановитьПараметр("СписокРеквизитов", СписокРеквизитов);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СтруктураАктуальногоОП[Выборка.Реквизит] = Выборка.Значение;
	//КонецЦикла;
	
	//!!!Пока актуальная версия не работает, возвращаем данные из документа
	СтруктураАктуальногоОП.НомерОтчетаПоставщику = НомерОтчетаПоставщику;
	СтруктураАктуальногоОП.Дата = Дата;
	СтруктураАктуальногоОП.ИтогОС_КПеречислениюПоставщику = ИтогОС_КПеречислениюПоставщику;
	//!!!Конец
	Возврат СтруктураАктуальногоОП;
КонецФункции

//СтруктураЗначенийДоИзменения - структура-результат, хранящая прошлые значения реквизитов


Функция ПересчетИтоговМодуль(СтруктураЗначенийДоИзменения = Неопределено,ЕстьИзменения = Ложь) Экспорт

	СтруктураЗначенийДоИзменения = Новый Структура;
	СтруктураЗначенийДоИзменения.Вставить("ИтогОС_НачисленнаяСуммаВзноса",ИтогОС_НачисленнаяСуммаВзноса);
	СтруктураЗначенийДоИзменения.Вставить("ИтогОС_КПеречислениюПоставщику",ИтогОС_КПеречислениюПоставщику);
	СтруктураЗначенийДоИзменения.Вставить("ИтогОС_КВ",ИтогОС_КВ);
	СтруктураЗначенийДоИзменения.Вставить("ИтогОС_КВДоп",ИтогОС_КВДоп);	
	ЕстьИзменения = Ложь;
	Выборка = уб_Взаиморасчеты.ПолучитьСостояниеОтчетаПоставщику(?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка),,,Дата, ВидВзаиморасчета, Поставщик);
	Если Выборка.ОтчетПоставщику = Неопределено Тогда//если нет оплат
		//Возврат;
		_ИтогОС_КПеречислениюПоставщику	= 0;
		_ИтогОС_КВСуммаДляОтчета		= 0;
		_ИтогОС_НачисленнаяСуммаВзноса	= 0;
		_ИтогОС_КВДоп		            = 0;
	Иначе
		Если ЗначениеЗаполнено(ДатаСогласования) И Дата < '20130801000000' Тогда
			ЕстьИзменения = Ложь;
			#Если Клиент Тогда
				Предупреждение("Это старый документ, итоги не пересчитываются, пока заполнена дата согласования.");
			#КонецЕсли	
			
			Возврат Выборка;
			//Возврат ПолучитьСостояниеОтчетаПоставщику2(ОтчетПоставщику, ВТ, ИмяВТ, ДатаАктуальностиОтчетов, ВидВзаиморасчетов, Поставщик)
		КонецЕсли;
		_ИтогОС_КПеречислениюПоставщику	= Выборка.Баланс_Брокер_Поставщик;
		_ИтогОС_КВСуммаДляОтчета		= Выборка.КВСуммаДляОтчета;
		_ИтогОС_НачисленнаяСуммаВзноса	= Выборка.НачисленнаяСуммаВзноса;
		_ИтогОС_КВДоп		            = Выборка.ДопКВ;
	КонецЕсли;
	ЗначениеДоИзменения = Неопределено;
	ЕстьИзменения = Макс(УстановитьЗначение(ИтогОС_НачисленнаяСуммаВзноса, _ИтогОС_НачисленнаяСуммаВзноса, ЗначениеДоИзменения), ЕстьИзменения);
	СтруктураЗначенийДоИзменения.ИтогОС_НачисленнаяСуммаВзноса = ЗначениеДоИзменения;
	ЗначениеДоИзменения = Неопределено;
	ЕстьИзменения = Макс(УстановитьЗначение(ИтогОС_КПеречислениюПоставщику, _ИтогОС_КПеречислениюПоставщику, ЗначениеДоИзменения), ЕстьИзменения);
	СтруктураЗначенийДоИзменения.ИтогОС_КПеречислениюПоставщику = ЗначениеДоИзменения;
	ЗначениеДоИзменения = Неопределено;
	ЕстьИзменения = Макс(УстановитьЗначение(ИтогОС_КВ, _ИтогОС_КВСуммаДляОтчета, ЗначениеДоИзменения), ЕстьИзменения);
	СтруктураЗначенийДоИзменения.ИтогОС_КВ = ЗначениеДоИзменения;
	ЗначениеДоИзменения = Неопределено;
	ЕстьИзменения = Макс(УстановитьЗначение(ИтогОС_КВДоп, _ИтогОС_КВДоп, ЗначениеДоИзменения), ЕстьИзменения);
	СтруктураЗначенийДоИзменения.ИтогОС_КВДоп = ЗначениеДоИзменения;
	Возврат Выборка;

КонецФункции

//чкн
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
	ПустойДокумент = Документы.уб_ОтчетПоставщику.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПустойДокумент);
	
	ЭтотОбъект.Поставщик = ОбъектКопирования.Поставщик;
	ЭтотОбъект.ОрганизацияАгент = ОбъектКопирования.ОрганизацияАгент;
	ЭтотОбъект.НачалоОтчетногоПериода = ОбъектКопирования.НачалоОтчетногоПериода;
	ЭтотОбъект.КонецОтчетногоПериода = ОбъектКопирования.КонецОтчетногоПериода;
	ЭтотОбъект.ВидВзаиморасчета = ОбъектКопирования.ВидВзаиморасчета;
	
КонецПроцедуры
//чкн

ПоставщикДляОтчетаПоКарточкам = ПараметрыСеанса.уб_Константы.ПоставщикДляОтчетаПоКарточкам;