Перем ПутьКФайлам;
Перем Convert;
Перем Hidec;
Перем ConvertBat;

//Определяет
Функция ПолучитьФильтрИзображений() Экспорт
	
	Возврат "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат jpeg (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат tiff (*.tif)|*.tif|"
	+ "Формат gif (*.gif)|*.gif|"
	+ "Формат png (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|";
	
КонецФункции

//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//
//					Дополнительные функции
//
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//Функция получает менеджер записи регистра уб_ФайлыКПолису
Функция ПолучитьЗаписьРС_ФайлКПолису(ЗначениеСвойствЗаписиРС)
		
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда
		Если ТипЗнч(ЗначениеСвойствЗаписиРС) = Тип("ВыборкаИзРезультатаЗапроса") Тогда 
			Возврат ЗначениеСвойствЗаписиРС;
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		МЗФайлыКПолису = РегистрыСведений.уб_ФайлыКПолисам.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗФайлыКПолису, ЗначениеСвойствЗаписиРС);
		МЗФайлыКПолису.Прочитать();
		
		Если МЗФайлыКПолису.Выбран() Тогда
			Возврат МЗФайлыКПолису;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецФункции

//Функция получает полное имя файла
//	Параметры:
//		МЗФайлыКПолису - (Менеджер записи регистра сведений уб_ФайлыКПолсу)
//	Возвращает:
//		(Строка) Полный путь до файла
Функция ПолучитьПолноеИмяФайла(МЗФайлыКПолису)
	
	ПутьДоХранилища	= МЗФайлыКПолису.Хранилище.Путь + ?(Прав(МЗФайлыКПолису.Хранилище.Путь, 1)	= "\", "", "\");
	ПутьДоФайла		= МЗФайлыКПолису.ПутьКПапке		+ ?(Прав(МЗФайлыКПолису.ПутьКПапке, 1) 		= "\", "", "\");	
	Возврат ПутьДоХранилища + ПутьДоФайла + МЗФайлыКПолису.ФайлИмя;
	
КонецФункции

//Функция проверяет существование файла
//	Параметры:
//		ПолноеИмяФайла - (Строка) Полный путь до файла
//	Возвращает:
//		(Файл)			если файл существует
//		(Неопределено)	если файл не существует

Функция ОбработатьИзображение(ПолноеИмяФайла, ДатаПубликации = Неопределено, МассивТолькоЧтение = Неопределено, ДатаНачалаПроверки = '00010101')
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если НЕ Файл.Существует() Тогда
		//непонятно, для чего нужно не писать ошибку по новым файлам. закомментировано
		//Если ДатаПубликации=Неопределено Тогда 
		//ИначеЕсли (ТекущаяДата()- ДатаПубликации)<(3600*24*3) Тогда
		//	Возврат "";
		//КонецЕсли;	
		Если ДатаПубликации = Неопределено Или Не ЗначениеЗаполнено(ДатаНачалаПроверки) Или ДатаПубликации >= ДатаНачалаПроверки Тогда
			Возврат "Файл " + ПолноеИмяФайла + " не существует!"
		КонецЕсли;
	ИначеЕсли Файл.ПолучитьТолькоЧтение() Тогда
		Если МассивТолькоЧтение = Неопределено Тогда
			МассивТолькоЧтение = Новый Массив;
		КонецЕсли;
		МассивТолькоЧтение.Добавить(ПолноеИмяФайла);
		Возврат "У файла " + ПолноеИмяФайла + " выставлен атрибут только для чтения!"
	Иначе		
		Попытка 
			Ком = Новый COMObject("wScript.Shell");
		Исключение
			Возврат ОписаниеОшибки()
		КонецПопытки;
		Если Ком <> Неопределено Тогда
			ВременныйФайл = ПолучитьИмяВременногоФайла(Файл.Расширение);
			КопироватьФайл(Файл.ПолноеИмя, ВременныйФайл);	
			Текст = Новый ЗаписьТекста(ConvertBat, КодировкаТекста.ANSI);
			Текст.ЗаписатьСтроку("@Echo off");
			Текст.ЗаписатьСтроку(Символ(34) + Convert + Символ(34) + "  " + Символ(34) + ВременныйФайл + Символ(34) + " -quality " + Строка(quality) + " " + Символ(34) + ВременныйФайл + Символ(34) + Символы.ПС);
			Текст.ЗаписатьСтроку("exit");
			Текст.Закрыть();
			Попытка
				Ком.Run("cmd /C """ + ConvertBat  + """", 0, Истина);
				Успешно = Истина;
			Исключение
				Успешно = Ложь;
				УдалитьФайлы(ВременныйФайл);
				Возврат ОписаниеОшибки();
			КонецПопытки;
			Если Успешно Тогда
				ПереместитьФайл(ВременныйФайл, Файл.ПолноеИмя);
				Возврат Файл.Размер();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//
//					Дополнительные функции
//
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

Функция ImageResize(ПереданныйПараметр,ТекстОшибки = "", МассивТолькоЧтение = Неопределено, ДатаНачалаПроверки = '00010101') Экспорт
	
	//Если переданный параметр выборка из регистра уб_ФайлыКПолисам
	ТипЗнчПараметра = ТипЗнч(ПереданныйПараметр);
	Если МассивТолькоЧтение = Неопределено Тогда
		МассивТолькоЧтение = Новый Массив;
	КонецЕсли;
	Если ТипЗнчПараметра = Тип("СтрокаТаблицыЗначений") Или ТипЗнчПараметра = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		МЗФайлыКПолису = ПолучитьЗаписьРС_ФайлКПолису(ПереданныйПараметр);		
		Если МЗФайлыКПолису <> Неопределено Тогда
			ПолноеИмяФайла	= ПолучитьПолноеИмяФайла(МЗФайлыКПолису);
			Результат		= ОбработатьИзображение(ПолноеИмяФайла, МЗФайлыКПолису.ДатаПубликации, МассивТолькоЧтение, ДатаНачалаПроверки);
			ТипЗнчРезультат = ТипЗнч(Результат);
			Если ТипЗнчРезультат = Тип("Строка") Тогда
				//описание ошибки
				Возврат Результат;
			ИначеЕсли ТипЗнчРезультат = Тип("Число") Тогда
				//файл обработан
				Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда
					Справочник = МЗФайлыКПолису.УИД;
					сОбъект = Справочник.ПолучитьОбъект();
					сОбъект.Обработан = ИСТИНА;
					Попытка
						сОбъект.Записать();
					Исключение
						Возврат ОписаниеОшибки();
					КонецПопытки;
				Иначе 
					МЗФайлыКПолису.Обработан = Истина;
					МЗФайлыКПолису.ФайлРазмер = Результат;
					Попытка
						МЗФайлыКПолису.Записать()
					Исключение
						Возврат ОписаниеОшибки()
					КонецПопытки;
				КонецЕсли;
				Возврат Истина;
			Иначе
				//Неопределено
				//ошибку возвращать не требуется, файл не обработан
			КонецЕсли;
		Иначе
			#Если Клиент ТОгда
				// всегда попадает сюда из клиента, если файл не обработан из формы просмотра и отправки на e-mail
				//Сообщить("Не удалось получить менеджер записи уб_ФайлыКПолисам!");
			#Иначе
				Возврат "Не удалось получить менеджер записи уб_ФайлыКПолисам!"
			#КонецЕсли
		КонецЕсли;
		//Если переданный параметр полный путь до файла
	ИначеЕсли ТипЗнчПараметра = Тип("Строка") Тогда
		Результат = ОбработатьИзображение(ПереданныйПараметр);
		Возврат Результат;
	Иначе
		#Если Клиент Тогда
			Сообщить("Переданный параметр не определен! " + ПереданныйПараметр);
		#Иначе
			Возврат "Переданный параметр не определен! " + ПереданныйПараметр 
		#КонецЕсли
	КонецЕсли;
	
КонецФункции

Функция ImageResizeКомандойСистемы(ИмяФайла, quality = 50) Экспорт
	
	Расширение = уб_СЛ.ОпределитьРасширениеФайла(ИмяФайла);
	ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
	КопироватьФайл(ИмяФайла, ВременныйФайл);
	
	ТекстКоманды = Символ(34) + Convert + Символ(34) + "  " + Символ(34) + ИмяФайла + Символ(34) + " -quality " + Строка(quality) + " " + Символ(34) + ВременныйФайл + Символ(34); //+ Символы.ПС
	#Если Клиент Тогда
	КомандаСистемы(ТекстКоманды,"/C");
	#КонецЕсли
	Возврат ВременныйФайл;
	
КонецФункции

//Распакуем из макетов ImageMagic
КаталогImageMagic = Новый Файл(КаталогВременныхФайлов()+"1C.ImageMagic\"); 

//Создадим папку
Если НЕ КаталогImageMagic.Существует() Тогда
	СоздатьКаталог(КаталогImageMagic.ПолноеИмя);
КонецЕсли;

Convert		=	КаталогImageMagic.ПолноеИмя + "\convert.exe";
Dll 		=	КаталогImageMagic.ПолноеИмя + "\vcomp100.dll";
Hidec		=	КаталогImageMagic.ПолноеИмя + "\hidec.exe";
ConvertBat	=	КаталогImageMagic.ПолноеИмя + "\convert.bat";

Если уб_temp.СистемаХ86() Тогда
    ПолучитьОбщийМакет("Convert_x86").Записать(Convert);
	ПолучитьОбщийМакет("Dll_x86").Записать(Dll);
Иначе
	ПолучитьОбщийМакет("Convert").Записать(Convert);
	ПолучитьОбщийМакет("Dll").Записать(Dll);
КонецЕсли;
ПолучитьОбщийМакет("Hidec").Записать(Hidec);

//Параметр quality уровень сжатия
quality = 50;