
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	СЗ = Элементы.Маска.СписокВыбора;
	СЗ.Добавить("8(999)999-9999", "8(XXX)XXX-XXXX");
	СЗ.Добавить("8(9999)999-9999", "8(XXXX)XXX-XXXX");
	СЗ.Добавить("8(9999)99-9999", "8(XXXX)XX-XXXX");
	Маска = сз[0].Значение;
	Элементы.Номер.Маска = Маска;
	//ТекстНадписиРассылка();
	ЭтаФорма.ТекущийЭлемент = Элементы.Номер;
КонецПроцедуры



&НаКлиенте
Процедура МаскаПриИзменении(Элемент)
	Элементы.Номер.Маска = Маска;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ОповеститьОВыборе(Номер);
КонецПроцедуры
