
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если ПараметрыСеанса.уб_Константы.ИспользоватьДляФайловПолисовСправочник = ИСТИНА тогда
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = "ВЫБРАТЬ
		|	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Автор КАК Автор,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.Ссылка) КАК КолвоДокументов,
		|	НАЧАЛОПЕРИОДА(уб_СтраховойПолисСписокФайлов.ДатаПубликации, МЕСЯЦ) КАК Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уб_СтраховойПолисСписокФайлов.СсылкаСправочника) КАК КолвоФайлов
		|ИЗ
		|	Документ.уб_СтраховойПолис.СписокФайлов КАК уб_СтраховойПолисСписокФайлов
		|
		|СГРУППИРОВАТЬ ПО
		|	уб_СтраховойПолисСписокФайлов.СсылкаСправочника.Автор,
		|	НАЧАЛОПЕРИОДА(уб_СтраховойПолисСписокФайлов.ДатаПубликации, МЕСЯЦ)";
	КонецЕсли;
КонецПроцедуры
