Перем ПараметрыОбмена Экспорт;

Процедура ВыполнитьОбмен() Экспорт
	
	Если ПараметрыОбмена = Неопределено  Тогда
		ИнициализироватьПараметры();
	КонецЕсли;
	
	ВыполнитьОбновлениеКурсовВалют();
	
КонецПроцедуры


Процедура ИнициализироватьПараметры() Экспорт 
	ПараметрыОбмена = Новый Структура;
	
КонецПроцедуры	

//		*********************************************************************************
//      *																				*
//      *						ЗАГРУЗКА КУРСА ВАЛЮТ С РБК								*
//      *																				*
//		>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//Функция получения курса валюты на дату. Использует сайт РБК
Функция ЗагрузитьФайлСДаннымиСРБКЗаДень(Валюта, ДатаКурса, История=Ложь)
	Попытка
		ПроверкаУспешно = Истина;
		Текст = Новый ТекстовыйДокумент();
		
		//Временный католог (создадим проверим и тп)
		ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
		СоздатьКаталог(ВремКаталог);
		УдалитьФайлы(ВремКаталог,"*.*");
		
		Если История Тогда 
			СтрокаПараметраПолучения = "tsv/cb/" + Прав(Валюта.Код,3) + ".tsv";
			ИмяВходящегоФайла = ВремКаталог + "\" + "Curses" + Валюта.Наименование + "_history.txt";
		Иначе
			//Формирует строку даты курса (для сайта)
			ДатаДляСайта   = "/"+Формат(Год(ДатаКурса),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(ДатаКурса),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(ДатаКурса),"ЧЦ=2;ЧДЦ=0;ЧВН=");
			СтрокаПараметраПолучения = "tsv/" + Прав(Валюта.Код,3) + ДатаДляСайта + ".tsv";
			ИмяВходящегоФайла = ВремКаталог + "\" + уб_temp.УбратьСимволы("Curses" + Валюта.Наименование + "_" + ДатаКурса + ".txt");
		КонецЕсли;
		
		Если уб_РаботаСИнтернетРесурсами.ЗапроситьФайлыССервера("cbrates.rbc.ru", СтрокаПараметраПолучения, ИмяВходящегоФайла) Тогда
			//Получили файл начинаем его разбирать
			Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.ANSI);
			
			//Если файл истории - проверяем курсы за предыдущий месяц
			//Иначе - создаем запись в регистре курсов валют
			Если История Тогда 
				МесяцНазад = НачалоМесяца(НачалоДня(ДатаКурса)-1);
				КолСтрок = Текст.КоличествоСтрок();
				
				Для Инд = 1 По КолСтрок Цикл
					Стр = Текст.ПолучитьСтроку(Инд);
					
					//Преобразуем дату из файла, в тип Дата
					ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
					ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
					
					Если ДатаКурса > КонецМесяца(МесяцНазад) Тогда
						Прервать;
					КонецЕсли;
					
					Если ДатаКурса < МесяцНазад Тогда 
						Продолжить;
					КонецЕсли;
					
					//Получаем кратность и курс валюты
					Кратность = Число(ВыделитьПодСтроку(Стр));
					Курс      = Число(ВыделитьПодСтроку(Стр));
					
					//Проверяем совпадение записей
					Если НЕ ПрочитатьЗаписьКурсаВалют(Валюта, ДатаКурса, Курс, Кратность) Тогда
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Внимание!!! На - " + ДатаКурса + " валюта: " + Валюта + " Курсы различаются!!!",, Истина, , Валюта.Метаданные(), Валюта);
						ПроверкаУспешно = Ложь;
					КонецЕсли;
				КонецЦикла;
				Если ПроверкаУспешно Тогда 
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("За " + Месяц(МесяцНазад) + " проверка курсов валют прошла успешно!", , Истина, УровеньЖурналаРегистрации.Примечание, Валюта.Метаданные(), Валюта);
				КонецЕсли;
			Иначе
				Стр = Текст.ПолучитьСтроку(1);
				Кратность = Число(ВыделитьПодСтроку(Стр));
				Курс      = Число(ВыделитьПодСтроку(Стр));
				Если СоздатьЗаписьКурсаВалют(Валюта, ДатаКурса, Курс, Кратность) Тогда
					
					уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Загрузка курса для: " + Валюта +" прошла успешно :). " + ДатаКурса, , Истина, УровеньЖурналаРегистрации.Примечание, Валюта.Метаданные(), Валюта);
				КонецЕсли;
			КонецЕсли;	
		Иначе	
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не удалось загрузить ресурс для валюты " + СокрЛП(Валюта.Наименование) + " (код " + Валюта.Код + ") на дату: " + ДатаКурса + ". Курс для валюты не загружен.", , Истина, , Валюта.Метаданные(), Валюта);
		КонецЕсли; 
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При загрузки валюты возникла ошибка! " + СокрЛП(Валюта.Наименование) + " (код " + Валюта.Код + ").", , Истина, , Валюта.Метаданные(), Валюта, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции//ЗагрузитьФайлСДаннымиСРБКЗаДень

//Создает запись курса валют в регистре сведений
//
//Параметры:
//	Валюта		- Справочник.Валюты
//	ДатаКурса	- Дата
//	Курс		- Число
//	Кратность	- Число
Функция СоздатьЗаписьКурсаВалют(Валюта, ДатаКурса, Курс, Кратность)
	
	Попытка
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
		ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьКурсовВалют.Валюта    = Валюта;
		ЗаписьКурсовВалют.Период    = ДатаКурса;
		ЗаписьКурсовВалют.Курс      = Курс;
		ЗаписьКурсовВалют.Кратность = Кратность;
		ЗаписьКурсовВалют.Записать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При записи курса валюты возникла ошибка! " + СокрЛП(Валюта.Наименование) + " (код " + Валюта.Код + ").", , Истина, , Валюта.Метаданные(), Валюта, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции//СоздатьЗаписьКурсаВалют

//Читает запись курса валют в регистре сведений
//Если значение из регистра совпадает с переданным значением - Истина
//Параметры:
//	Валюта		- Справочник.Валюты
//	ДатаКурса	- Дата
//	Курс		- Число
//	Кратность	- Число
Функция ПрочитатьЗаписьКурсаВалют(Валюта, ДатаКурса, Курс, Кратность)
	
	Попытка
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
		ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьКурсовВалют.Валюта    = Валюта;
		ЗаписьКурсовВалют.Период    = ДатаКурса;
		ЗаписьКурсовВалют.Прочитать();
		Если ЗаписьКурсовВалют.Курс = Курс И ЗаписьКурсовВалют.Кратность = Кратность Тогда
			Возврат Истина
		Иначе
			Возврат Ложь
		КонецЕсли;
	Исключение
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("При чтении курса валюты возникла ошибка! " + СокрЛП(Валюта.Наименование) + " (код " + Валюта.Код + ").", , Истина, , Валюта.Метаданные(), Валюта, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции//ПрочитатьЗаписьКурсаВалют

//Считывает значения из файла данных с РБК
//При считывании обрезает сроку
Функция ВыделитьПодСтроку(ИсходнаяСтрока)
	//Перем ПодСтрока;
	
	Поз = Найти(ИсходнаяСтрока,Символы.Таб);
	Если Поз > 0 Тогда
		ПодСтрока = Лев(ИсходнаяСтрока,Поз-1);
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,Поз+1);
	Иначе
		ПодСтрока = ИсходнаяСтрока;
		ИсходнаяСтрока = "";
	КонецЕсли;
	
	Возврат ПодСтрока;
КонецФункции//ВыделитьПодСтроку

//Формируем список валют за исключением рублей
//
Функция ПолучитьСписокВалют()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	(НЕ Валюты.ПометкаУдаления)
	|	И (НЕ Валюты.Наименование ПОДОБНО ""%руб.%"")");
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции//ПолучитьСписокВалют

//Формируем таблицу Дата - Валюта для интервала дат
//
//Параметры:
//	НачДата - дата начала периода
//	КонДата - дата окончания периода
Функция ПолучитьТаблицуДатаВалюта(НачДата, КонДата)
	ТЗ=Новый ТаблицаЗначений();
	//Колонки должны быть типизированы
	ТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	СписокВалют = ПолучитьСписокВалют();
	
	//Заполняем таблицу данными
	Дата = НачДата;
	Пока Дата <= КонДата И КонДата >= НачДата Цикл
		Для Каждого Валюта из СписокВалют Цикл
			Стр=ТЗ.Добавить();
			Стр.Дата = Дата;
			Стр.Валюта = Валюта.Валюта;
		КонецЦикла;
		// + день
		Дата = Дата + 60*60*24;
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции//ПолучитьТаблицуДатаВалюта

//Формируем таблицу Дата - Валюта. В таблицу попадают отсутвующие записи регистра
//
//Параметры:
//	НачДата - дата начала периода
//	КонДата - дата окончания периода
Функция ПолучитьОтсутствующиеЗаписиКурсаВалют(ДатаНач, ДатаКон)
	//Загружаем таблицу значений в менеджер временных таблиц запроса
	Запрос=Новый Запрос("Выбрать * ПОМЕСТИТЬ ВТТаб Из &Таб Как Т");
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таб",ПолучитьТаблицуДатаВалюта(НачалоДня(ДатаНач), НачалоДня(ДатаКон)));
	Запрос.Выполнить();
	
	//Получаем таблицу из менеджера временных таблиц запроса 
	//И выбираем те записи, которых нет в регистре :)
	ЗапросТМП=Новый Запрос("ВЫБРАТЬ
	|	ВТТаб.Дата КАК Дата,
	|	ВТТаб.Валюта КАК Валюта
	|ИЗ
	|	ВТТаб КАК ВТТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТТаб.Дата = КурсыВалют.Период
	|			И ВТТаб.Валюта = КурсыВалют.Валюта
	|ГДЕ
	|	КурсыВалют.Валюта ЕСТЬ NULL ");
	
	ЗапросТМП.МенеджерВременныхТаблиц=Запрос.МенеджерВременныхТаблиц; 
	ТЗ = ЗапросТМП.Выполнить().Выгрузить();
	Запрос.Текст = "УНИЧТОЖИТЬ ВТТаб";
	Запрос.Выполнить();	
	Возврат ТЗ;
КонецФункции//ПолучитьОтсутствующиеЗаписиКурсаВалют

//Процедура получения курса валют с сайта РБК
Функция ВыполнитьОбновлениеКурсовВалют() Экспорт
	
	//В первый день месяца проверяем корректность курсов за прошедший месяц
	Если НачалоДня(ТекущаяДата())=НачалоМесяца(ТекущаяДата()) Тогда
		Для Каждого Строка Из ПолучитьСписокВалют() Цикл
			ЗагрузитьФайлСДаннымиСРБКЗаДень(Строка.Валюта, ТекущаяДата(), Истина);
		КонецЦикла;
	КонецЕсли;
	//Проверяем последние N дней. Если каких то записей не хватает - загружаем.
	//Количество дней берем из констант
	КоличествоДней = ПараметрыСеанса.уб_Константы.КурсВалютКоличествоДней;
	Если ТипЗнч(КоличествоДней) = Тип("Число") Тогда
		Для Каждого Строка из ПолучитьОтсутствующиеЗаписиКурсаВалют(ТекущаяДата()-60*60*24*КоличествоДней, ТекущаяДата()) Цикл
			ЗагрузитьФайлСДаннымиСРБКЗаДень(Строка.Валюта, Строка.Дата);
		КонецЦикла;
	Иначе
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибочный тип константы КурсВалютКоличествоДней: " + ТипЗнч(КоличествоДней), ?(ПараметрыСеанса.уб_РежимОтладки > 0, "Сообщить", "НеСообщать"), Истина);
	КонецЕсли;
	
КонецФункции

