Процедура СтандартнаяОбработкаФильтров(
	Форма, 
	СтруктураФильтров, 
	ЭтоТабличнаяЧасть = Ложь) Экспорт
	
	СтруктураФильтров.СостояниеОбработки = 2;//Выполняется
	ЭлементыФормы 	= Форма.ЭлементыФормы;
	ТЗФильтров		= СтруктураФильтров.ТЗФильтров;
	//Подготовка фильтров в зависимости от необходимости обработки одного/нескольких полей(изменения) или всего списка (при открытии формы или принудительном обновлении)
	Если СтруктураФильтров.АктуальноеИмяПоля <> Неопределено Тогда
		//Могут вподряд измениться несколько полей, например при програмном задании нескольких полей фильтров 
		Если ТипЗнч(СтруктураФильтров.АктуальноеИмяПоля) = Тип("Массив") Тогда
			Для Каждого Элемент из СтруктураФильтров.АктуальноеИмяПоля Цикл
				ПодготовкаФильтра(Форма, ЭлементыФормы[Элемент], СтруктураФильтров);	
			КонецЦикла;	
		Иначе//Старый вариант использования: изменилось одно поле, а  не массив, не должно использоваться
			ПодготовкаФильтра(Форма, ЭлементыФормы[СтруктураФильтров.АктуальноеИмяПоля], СтруктураФильтров);
		КонецЕсли;	
	Иначе
		//Полная отработка всех фильтров
		Для Каждого СтрокаТЗ Из СтруктураФильтров.ТЗФильтров Цикл
			ИмяПоля = СтрокаТЗ.Данные;
			Элемент = Неопределено;
			Если СтрокаТЗ.ЕстьЧастныйЗапрос Тогда
				Для Каждого ЭлементСтруктурыПолей Из СтрокаТЗ.ЧастныйЗапрос.СтруктураПолей Цикл
					ИмяПоляЭлементаФормы = ЭлементСтруктурыПолей.Ключ;
					Элемент = ЭлементыФормы.Найти(ИмяПоляЭлементаФормы);
					Если ТипЗнч(Элемент) <> Тип("ActiveX") Тогда
						Прервать;
					Иначе
						Элемент = Неопределено;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ИмяПоля = СтрокаТЗ.ИмяПоля;
				Элемент = ЭлементыФормы.Найти(ИмяПоля);
				Если ТипЗнч(Элемент) = Тип("ActiveX") Тогда
					Если Элемент.Значение <> "" Тогда
						СтрокаТЗ.Состояние 	= "Заполнен";
						СтрокаТЗ.Значение 	= Элемент.Значение;
						ПодготовкаФильтра(Форма, ЭлементыФормы[ИмяПоля], СтруктураФильтров);
					КонецЕсли;
					Элемент = Неопределено;
					ИмяПоля = Неопределено;
				КонецЕсли;
			КонецЕсли;
			Если Элемент <> Неопределено И ИмяПоля <> Неопределено Тогда
				ПодготовкаФильтра(Форма, Элемент, СтруктураФильтров);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	ПакетныйЗапрос			= Новый Запрос;
	ТекстПакетногоЗапроса 	= "";
	ТЗФильтровКоличество	= ТЗФильтров.Количество();
	Если Не ЭтоТабличнаяЧасть Тогда
		Отбор = Форма[СтруктураФильтров.ИмяСписка].Отбор;
	Иначе     
		Отбор = Форма.ЭлементыФормы[СтруктураФильтров.ИмяСписка].ОтборСтрок;
	КонецЕсли;
	МассивИндексов = Новый Массив;
	ЕстьРезультат = Ложь;
	Для Индекс = 0 По ТЗФильтровКоличество - 1 Цикл
		СтрокаТЗ 	= ТЗФильтров[Индекс];
		Если СтрокаТЗ.НеОбрабатывать = Истина Тогда
			Продолжить;
		ИначеЕсли СтрокаТЗ.НеОбрабатыватьПоУсловию  = Истина Тогда	//2017
			Если Вычислить(СтрокаТЗ.КодУсловия) = Истина Тогда
				//Продолжить;
				СтрокаТЗ.Состояние = "НеИспользовать";
			КонецЕсли;	
		Иначе	
			
		КонецЕсли;
		Отказ		= Ложь;
		текОтбор 	= Отбор[СтрокаТЗ.Данные];
		текОтбор.ВидСравнения   = ВидСравнения[СтрокаТЗ.ВидСравнения];
		Если СтрокаТЗ.Состояние = "Заполнен" Или СтрокаТЗ.ЗаполненВсегда Тогда
			ЕстьРезультат = Истина;
			Если СтрокаТЗ.ЕстьЗапрос Тогда
				//Установка параметров запроса
				Если СтрокаТЗ.ЕстьЧастныйЗапрос Тогда
					//частные условия запросов - задаются в форме списка
					ЧастныйЗапрос = СтрокаТЗ.ЧастныйЗапрос;
					ТекстЗапросаДляПакетного = СтрЗаменить(СтрокаТЗ.Запрос.Текст, "&Значение", ЧастныйЗапрос.Условие);
					Для Каждого КлючИЗначение Из ЧастныйЗапрос.Параметры Цикл
						ПакетныйЗапрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
					КонецЦикла;
				Иначе
					ТекстЗапросаДляПакетного = СтрЗаменить(СтрокаТЗ.Запрос.Текст, "&Значение", "&Значение" + Индекс);
					Если СтрокаТЗ.Подобно Тогда
						ТекстЗапросаДляПакетного = СтрЗаменить(ТекстЗапросаДляПакетного, "&Перевод", "&Перевод" + Индекс);
						ПакетныйЗапрос.УстановитьПараметр("Значение" + Индекс, 	"%" + СтрокаТЗ.Значение + "%");
						ПакетныйЗапрос.УстановитьПараметр("Перевод" + Индекс,	"%" + ПеревестиСтроку(СтрокаТЗ.Значение) + "%");
					Иначе
						ПакетныйЗапрос.УстановитьПараметр("Значение" + Индекс, 	СтрокаТЗ.Значение)
					КонецЕсли;
				КонецЕсли;
				//Добавление подзапроса в текст пакетного запроса
				ТекстПакетногоЗапроса = ТекстПакетногоЗапроса+?(МассивИндексов.Количество()>0,";
				|
				|","") + ТекстЗапросаДляПакетного;
				МассивИндексов.Добавить(Индекс);
			Иначе
				ВидЗначенияОтбора = ?(ЗначениеЗаполнено(СтрокаТЗ.ВидЗначенияОтбора), СтрокаТЗ.ВидЗначенияОтбора, "Значение");
				Если текОтбор.ВидСравнения = ВидСравнения.Равно И Не текОтбор.ТипЗначения.СодержитТип(ТипЗнч(СтрокаТЗ.Значение)) Тогда
					текОтбор.Использование = Ложь;
				Иначе
					текОтбор[ВидЗначенияОтбора] = СтрокаТЗ.Значение;
					текОтбор.Использование = Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаТЗ.ЕстьСписокЗначений = Истина и СтрокаТЗ.Состояние <> "НеИспользовать" Тогда
			//
			ЕстьРезультат = Истина;
			текОтбор = Отбор[СтрокаТЗ.Данные];
			текОтбор.Использование 	= Истина;
			текОтбор.ВидСравнения = ВидСравнения.ВСписке;
			текОтбор.Значение = СтрокаТЗ.СписокЗначений;
		Иначе
			текОтбор.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстПакетногоЗапроса) Тогда
		//Есть пакетный запрос
		ПакетныйЗапрос.Текст = ТекстПакетногоЗапроса;
		МассивРезультатаПакетногоЗапроса = ПакетныйЗапрос.ВыполнитьПакет();
		текМассивИндекс = 0;
		Для Каждого ПодЗапрос Из МассивРезультатаПакетногоЗапроса Цикл
			текИндексТЗ = МассивИндексов[текМассивИндекс];
			СтрокаТЗ = ТЗФильтров[текИндексТЗ];
			МассивЗначений = ПодЗапрос.Выгрузить().ВыгрузитьКолонку("Значение");
			Значение = Новый СписокЗначений;
			текОтбор = Отбор[СтрокаТЗ.Данные];
			текОтбор.Использование 	= Истина;
			Если СтрокаТЗ.ЕстьСписокЗначений = Истина Тогда
				ВидЗначенияОтбора = "Значение";	
				Для каждого ЭлМассива из МассивЗначений Цикл
					Если НЕ СтрокаТЗ.СписокЗначений.НайтиПозначению(ЭлМассива) = Неопределено Тогда
						Значение.Добавить(ЭлМассива);
					КонецЕсли;	
				КонецЦикла;	
			Иначе	
				Значение.ЗагрузитьЗначения(МассивЗначений);
				ВидЗначенияОтбора = ?(ЗначениеЗаполнено(СтрокаТЗ.ВидЗначенияОтбора),СтрокаТЗ.ВидЗначенияОтбора,"Значение");
			КонецЕсли;				
			текОтбор[ВидЗначенияОтбора] = Значение;
			Если МассивЗначений.Количество() = 0 Тогда
				Прервать
			КонецЕсли;
			текМассивИндекс = текМассивИндекс + 1;
		КонецЦикла;
	КонецЕсли;
	Если СтруктураФильтров.Свойство("ПослеОбработкиФильтраЧастныйКод") Тогда
		Выполнить(СтруктураФильтров.ПослеОбработкиФильтраЧастныйКод);
	КонецЕсли;
	ПослеОбработкиФильтров(СтруктураФильтров);//
КонецПроцедуры




//общая процедура обработки фильтров
//TODO возможность передавать список значений для нужной раскраски в частных случаях
//если ИмяПроцедуры = Неопределено, тогда просто раскрашиваем поле без вызова обработчика фильтров формы
Процедура ОбработатьФильтр(
	Форма, 
	ИмяПоля, 
	ИмяПроцедуры 		= "ОбработатьФильтр",
	МинКолвоСимволов 	= 1, 	//только для быстрых фильтров
	Знач Интервал		= 0.5  //только для быстрых фильтров
	) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("ФонЗаполненногоФильтра");
	Массив.Добавить("ФонНезаполненногоФильтра");
	ТЗЦветов = ЦветаСправочникаЦветов(Массив);
	ЕстьТЗЦветов = ТЗЦветов <> Неопределено;
	Если ЕстьТЗЦветов Тогда
		СтрокаТЗФонЗаполненногоФильтра		= ТЗЦветов.Найти("ФонЗаполненногоФильтра", 	"Имя");
		СтрокаТЗФонНезаполненногоФильтра  	= ТЗЦветов.Найти("ФонНезаполненногоФильтра","Имя");
		Если СтрокаТЗФонНезаполненногоФильтра = Неопределено Или СтрокаТЗФонЗаполненногоФильтра = Неопределено Тогда
			ЕстьТзЦветов = Ложь
		КонецЕсли;
	КонецЕсли;
	Поле 		= Форма.ЭлементыФормы[ИмяПоля];
	Значение    = Поле.Значение;
	Если ТипЗнч(Поле) = Тип("ActiveX") Тогда
		Если ЕстьТЗЦветов Тогда
			Поле.BackColor = ?(СтрДлина(Значение) >= МинКолвоСимволов, СтрокаТЗФонЗаполненногоФильтра.Абсолютный, СтрокаТЗФонНезаполненногоФильтра.Абсолютный); //см. функцию АбсолютныйЦвет
		КонецЕсли;
	Иначе
		Если ЕстьТЗЦветов Тогда
			Если ЗначениеЗаполнено(Значение) Тогда
				Красный = СтрокаТЗФонЗаполненногоФильтра.Красный;
				Зеленый = СтрокаТЗФонЗаполненногоФильтра.Зеленый;
				Синий	= СтрокаТЗФонЗаполненногоФильтра.Синий;
			Иначе
				Красный = СтрокаТЗФонНезаполненногоФильтра.Красный;
				Зеленый = СтрокаТЗФонНезаполненногоФильтра.Зеленый;
				Синий	= СтрокаТЗФонНезаполненногоФильтра.Синий;
			КонецЕсли;
			Поле.ЦветФонаПоля = Новый Цвет(Красный, Зеленый, Синий);
		КонецЕсли;
		Интервал = 0.01;
	КонецЕсли;
	ТипЗнчИмяПроцедуры = ТипЗнч(ИмяПроцедуры);
	Если ТипЗнчИмяПроцедуры = Тип("СтрокаТаблицыЗначений") Тогда
		//ОбработатьСтрокуТЗФильтров(ИмяПроцедуры, Э
	ИначеЕсли ТипЗнчИмяПроцедуры = Тип("Строка") Тогда
		Если ИмяПроцедуры = "СтандартнаяОбработкаФильтров" Тогда
			уб_СтраховойБрокер.ВыполнитьОтложенноеДействие(Форма, "СтандартнаяОбработкаФильтров", Интервал)
		Иначе
			уб_СтраховойБрокер.ВыполнитьОтложенноеДействие(Форма, ИмяПроцедуры, Интервал)
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры


Процедура ОбработатьСтрокуТЗФильтров(СтрокаТЗ, Отбор, Поле)
	
	Значение = Поле.Значение;
	//Если СтрокаТЗ.ВЧисло Тогда
	//	Попытка
	//		Значение = Число(Поле.Значение)
	//	Исключение
	//		текОтбор.Использование = Ложь;
	//		Возврат;
	//	КонецПопытки
	//КонецЕсли;
	Отказ = Ложь;
	Если Не ПустаяСтрока(СтрокаТЗ.ЧастныйКод) Тогда
		Выполнить(СтрокаТЗ.ЧастныйКод)
	КонецЕсли;
	Если Не Отказ Тогда
		ActiveX = ТипЗнч(Поле) = Тип("ActiveX");
		Если (ActiveX И СтрДлина(Значение) >= СтрокаТЗ.ИндексЗапуска) Или (Не ActiveX И ЗначениеЗаполнено(Значение)) Тогда
			Отбор.ВидСравнения = ВидСравнения[СтрокаТЗ.ТипСравнения];
			Запрос = СтрокаТЗ.Запрос;
			Если Не ПустаяСтрока(Запрос.Текст) Тогда
				Если СтрокаТЗ.Подобно Тогда
					Значение = "%" + Значение + "%";
					Запрос.УстановитьПараметр("Перевод", "%" + ПеревестиСтроку(Значение) + "%")
				КонецЕсли;
				Запрос.УстановитьПараметр("Значение", Значение);
				Значение = Новый СписокЗначений;
				Значение.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
			КонецЕсли;
			Отбор.Значение 		= Значение;
			Отбор.Использование	= Истина;
		Иначе
			Отбор.Использование	= Ложь
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьТЗФильтров(ТЗФильтров, СтрокаТипов, ИмяОбъекта = "", ПараметрыФормы = Неопределено) Экспорт
	
	МассивТиповПолей = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаТипов);
	Для Каждого ЭлементМассива Из МассивТиповПолей Цикл
		Тип = СокрЛП(НРег(ЭлементМассива));
		Структура = Новый Структура;
		Если Тип = "поставщик" Тогда
			Структура.Вставить("ИмяПоля", 		"эуПоискПоставщик");
			Структура.Вставить("ИндексЗапуска",	3);
			Структура.Вставить("Данные",		"Поставщик");
			Структура.Вставить("ВидСравнения",	"ВСписке");
			Структура.Вставить("Подобно",		Истина);
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Контрагенты.Ссылка КАК Значение
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(Контрагенты.Наименование ПОДОБНО &Значение
			|			ИЛИ Контрагенты.Наименование ПОДОБНО &Перевод)";
			Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
			
			ЕстьОграничения = ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыФормы, "ОграниченияСтруктурыФильтров", Тип("Структура"), Истина);
			Если ЕстьОграничения И ПараметрыФормы.ОграниченияСтруктурыФильтров.Свойство("Поставщик") Тогда
				Структура.Вставить("ЕстьСписокЗначений", Истина);
				Структура.Вставить("СписокЗначений", ПараметрыФормы.ОграниченияСтруктурыФильтров.Поставщик);
			КонецЕсли;
		ИначеЕсли Тип = "агент" Тогда
			Структура.Вставить("ИмяПоля",		"эуПоискАгент");
			Структура.Вставить("ИндексЗапуска", 3);
			Структура.Вставить("Данные",		"Агент");
			Структура.Вставить("ВидСравнения",	"ВСписке");
			Структура.Вставить("Подобно",		Истина);
			//TODO сделать включая выбывших по умолчанию Истина?
			Если уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПросмотрВсехПолисовИЗаявок, Ложь)
				или уб_кэшируемые.ДоступностьРоли("ПолныеПрава,уб_СотрудникОтделаБСО") Тогда
			Иначе
				//
				//		Если ПараметрыСеанса.уб_ЭтоМенеджер 
				//			И Не уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ПросмотрВсехПолисовИЗаявок, Ложь) 
				//			Тогда
				Структура.Вставить("ЕстьСписокЗначений", Истина);
				//Параметры = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
				//Параметры.ВключаяВыбывших = Истина;
				//СписокСотрудников = уб_СС.ПодчиненныеРуководителя(,, Параметры);
				//уб_temp.ДополнитьСписокСотрудниковПредшественниками(СписокСотрудников);
				Структура.Вставить("СписокЗначений", уб_СтраховойБрокер.Подчиненные(ПараметрыСеанса.уб_ТекущееФизЛицо));
			КонецЕсли;
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Значение
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(Контрагенты.Наименование ПОДОБНО &Значение
			|			ИЛИ Контрагенты.Наименование ПОДОБНО &Перевод)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка КАК Значение
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	(ФизическиеЛица.Наименование ПОДОБНО &Значение
			|			ИЛИ ФизическиеЛица.Наименование ПОДОБНО &Перевод)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПодразделенияОрганизаций.Ссылка КАК Значение
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|ГДЕ
			|	(ПодразделенияОрганизаций.Наименование ПОДОБНО &Значение
			|			ИЛИ ПодразделенияОрганизаций.Наименование ПОДОБНО &Перевод)";
			Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
		ИначеЕсли Тип = "номер" Тогда
			Структура.Вставить("ИмяПоля", 			"эуПоискНомер");
			Структура.Вставить("ИндексЗапуска",		1);
			Структура.Вставить("Данные",			"Номер");
			Структура.Вставить("ВидСравнения",		"Равно");
			Структура.Вставить("ДопустимыеСимволы",	"0123456789");
			Структура.Вставить("ЧастныйКод",		"Попытка Значение = Число(СтрокаТЗ.ИсхЗначение); Исключение Значение = Неопределено; КонецПопытки;");
		ИначеЕсли Тип = "номерквитанции" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискНомерКвитанции");
			Структура.Вставить("Данные",			"НомерКвитанции");
			Структура.Вставить("ВидСравнения",		"Содержит");
			Структура.Вставить("ИндексЗапуска",		2);
		ИначеЕсли Тип = "комментарий" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискКомментарий");
			Структура.Вставить("Данные",			"Комментарий");
			Структура.Вставить("ВидСравнения",		"Содержит");
			Структура.Вставить("ИндексЗапуска",		3);
		ИначеЕсли Тип = "формаоплаты" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискФормаОплаты");
			Структура.Вставить("Данные",			"ФормаОплаты");
			Структура.Вставить("ВидСравнения",		"Равно");
		ИначеЕсли Тип = "ск" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискСК");
			Структура.Вставить("Данные",			"СК");
			Структура.Вставить("ИндексЗапуска",		3);
			Структура.Вставить("ВидСравнения",		"ВСписке");
			Структура.Вставить("Подобно",			Истина);
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Объект.СК КАК Значение
			|ИЗ
			|	&Объект КАК Объект
			|ГДЕ
			|	(Объект.СК.Наименование ПОДОБНО &Значение
			|			ИЛИ Объект.СК.Наименование ПОДОБНО &Перевод)";
			Если ИмяОбъекта = "" Тогда
				ИмяОбъекта = "Документ.уб_ПоступлениеБСО.БСО";
			КонецЕсли;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Объект", ИмяОбъекта);
			Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
		ИначеЕсли Тип = "отчетпоставщику" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискОтчетПоставщику");
			Структура.Вставить("ИндексЗапуска",		3);
			Структура.Вставить("Данные",			"ОтчетПоставщику");
			Структура.Вставить("ВидСравнения",		"ВСписке");
			Структура.Вставить("Подобно",			Истина);
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ОП.Ссылка КАК Значение
			|ИЗ
			|	Документ.уб_ОтчетПоставщику КАК ОП
			|ГДЕ
			|	ОП.НомерОтчетаПоставщику ПОДОБНО &Значение";
			Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
		ИначеЕсли Тип = "страхователь" Тогда
			Если Не ПустаяСтрока(ИмяОбъекта) Тогда
				Структура.Вставить("ИмяПоля",			"эуПоискСтрахователь");
				Структура.Вставить("Данные",			"Страхователь");
				Структура.Вставить("ИндексЗапуска",		4);
				Структура.Вставить("ВидСравнения",		"ВСписке");
				Структура.Вставить("Подобно",			Истина);
				ТекстЗапроса = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Объект.Страхователь КАК Значение
				|ИЗ
				|	&Объект КАК Объект
				|ГДЕ
				|	(Объект.Страхователь.Наименование ПОДОБНО &Значение
				|			ИЛИ Объект.Страхователь.Наименование ПОДОБНО &Перевод)";
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Объект", ИмяОбъекта);
				Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
			КонецЕсли;
		ИначеЕсли Тип = "организацияагент" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискОрганизацияАгент");
			Структура.Вставить("Данные",			"ОрганизацияАгент");
			Структура.Вставить("ИндексЗапуска",		3);
			Структура.Вставить("ВидСравнения",		"ВСписке");
			Структура.Вставить("Подобно",			Истина);
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Организации.Ссылка КАК Значение
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	(Организации.Наименование ПОДОБНО &Значение
			|			ИЛИ Организации.Наименование ПОДОБНО &Перевод)";
			Структура.Вставить("ТекстЗапроса", ТекстЗапроса);
		ИначеЕсли Тип = "наименование" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискНаименование");
			Структура.Вставить("ИндексЗапуска",		3);
			Структура.Вставить("Данные",			"Наименование");
			Структура.Вставить("ВидСравнения",		"Содержит");
			Структура.Вставить("Подобно",			Истина);
		ИначеЕсли Тип = "неактуальная" Тогда
			Структура.Вставить("ИмяПоля",			"эуНеактуальная");
			Структура.Вставить("Данные",			"Неактуальная");
			Структура.Вставить("ВидСравнения",		"Равно");
			ЧастныйКод 	= "Если СтрокаТЗ.ИсхЗначение = Истина Тогда
			|	Значение = Ложь;
			|Иначе
			|	Значение = Неопределено;
			|КонецЕсли;";
			Структура.Вставить("ЧастныйКод", ЧастныйКод);
		ИначеЕсли Тип = "контрагент" Или Тип = "физлицо" Тогда
			Структура.Вставить("ИмяПоля",			"эуПоискНаименование");
			Структура.Вставить("Данные",			"Ссылка");
			Структура.Вставить("ИндексЗапуска",		3);
			Структура.Вставить("ВидСравнения",		"ВСписке");
			//Структура.Вставить("ИмяСледующегоЭлементаВПорядкеОбхода",		"СправочникСписок");
			//Структура.Вставить("ИмяПредыдущегоЭлементаВПорядкеОбхода",		"СправочникСписок");
			ЧастныйКод =
			"Значение = Неопределено;
			|Если СтрДлина(СтрокаТЗ.ИсхЗначение) >= СтрокаТЗ.ИндексЗапуска Тогда
			|	Запрос = Новый Запрос;
			|	Запрос.Текст = ""ВЫБРАТЬ первые 15
			|	|	Спр.Ссылка КАК Значение
			|	|ИЗ
			|	|	&Объект КАК Спр
			|	|ГДЕ
			|	|	&Условие"";
			|	ТекстУсловия = ""Истина"";
			|   ЭлементРодительВерхнегоУровня = ЭлементыФормы.Найти(""РодительВерхнегоУровня"");
			|   Если ЭлементРодительВерхнегоУровня <> Неопределено Тогда
			|   	ЗначениеРодителя = ЭлементРодительВерхнегоУровня.Значение;
			|		Если ЗначениеЗаполнено(ЗначениеРодителя) Тогда
			|			ТекстУсловия = ТекстУсловия + "" И Спр.Ссылка В ИЕРАРХИИ(&РодительВерхнегоУровня) "";
			|			Запрос.УстановитьПараметр(""РодительВерхнегоУровня"", ЗначениеРодителя);
			|		КонецЕсли;
			|	КонецЕсли;
			|	ТекстУсловия = ТекстУсловия + "" И Спр.Наименование ПОДОБНО &Наименование "";
			|	Запрос.УстановитьПараметр(""Наименование"", ""%"" + СтрокаТЗ.ИсхЗначение + ""%"");
			|   Запрос.Текст = СтрЗаменить(Запрос.Текст, ""&Условие"", ТекстУсловия);
			|	РезультатЗапроса = Запрос.Выполнить();
			|	Если Не РезультатЗапроса.Пустой() Тогда
			|		Выборка = РезультатЗапроса.Выбрать();
			|		Значение = Новый СписокЗначений;
			|		Пока Выборка.Следующий() Цикл
			|			Значение.Добавить(Выборка.Значение);
			|		КонецЦикла;
			|	КонецЕсли;
			|КонецЕсли;";
			
			Если Тип = "контрагент" Тогда
				ЧастныйКод = СтрЗаменить(ЧастныйКод, "&Объект", "Справочник.Контрагенты");
			ИначеЕсли Тип = "физлицо" Тогда
				ЧастныйКод = СтрЗаменить(ЧастныйКод, "&Объект", "Справочник.ФизическиеЛица");
				
				ЕстьОграничения = ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыФормы, "ОграниченияСтруктурыФильтров", Тип("Структура"), Истина);
				Если ЕстьОграничения И ПараметрыФормы.ОграниченияСтруктурыФильтров.Свойство("ФизЛицо") Тогда
					Структура.Вставить("ЕстьСписокЗначений", Истина);
					Структура.Вставить("СписокЗначений", ПараметрыФормы.ОграниченияСтруктурыФильтров.ФизЛицо);
				КонецЕсли;
				
			КонецЕсли;
			
			Структура.Вставить("ЧастныйКод", ЧастныйКод);
		КонецЕсли;
		Если Структура.Количество() > 0 Тогда
			СтрокаТЗ = ТЗФильтров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Структура);
			Если Структура.Свойство("ТекстЗапроса") Тогда
				СтрокаТЗ.Запрос.Текст = Структура.ТекстЗапроса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
КонецФункции // ЗаполнитьСтрокуТЗФильтров()


//Настройка всплывающих списков
//Подготовка условия частных запросов
//раскраска полей в зависимости от их заполненности

Процедура ПодготовкаФильтра(
	Форма, 
	Элемент, 
	СтруктураФильтров) Экспорт
	
	ЭлементыФормы = Форма.ЭлементыФормы;
	СтруктураПараметровВсплывающегоСписка = СтруктураФильтров.СтруктураПараметровВсплывающегоСписка;
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("ИндексЗапуска");
	МассивНастроек.Добавить("ИмяСправочника");
	МассивНастроек.Добавить("ИмяВСтруктуреПараметровВсплывающегоСписка");
	МассивНастроек.Добавить("ИмяСпискаДляОтбораПоВладельцу");
	МассивНастроек.Добавить("ИмяПоля");
	СтруктураЗначениеНастроек = ПолучитьНастройкиПоля(СтруктураФильтров.ТЗФильтров, НРег(Элемент.Имя), МассивНастроек);
	ИндексЗапускаПоля = СтруктураЗначениеНастроек.ИндексЗапуска;
	ИндексЗапускаПоля = ?(ИндексЗапускаПоля = Неопределено, 1, ИндексЗапускаПоля);
	ИмяСправочника    = СтруктураЗначениеНастроек.ИмяСправочника;
	ИмяВСтруктуреПараметровВсплывающегоСписка = СтруктураЗначениеНастроек.ИмяВСтруктуреПараметровВсплывающегоСписка;
	ИмяСпискаДляОтбораПоВладельцу = СтруктураЗначениеНастроек.ИмяСпискаДляОтбораПоВладельцу;
	ИмяПоля = НРег(СтруктураЗначениеНастроек.ИмяПоля);
	ТекстПоиска = Элемент.Значение;
	
	Если ЗначениеЗаполнено(ИмяВСтруктуреПараметровВсплывающегоСписка) Тогда
		Если СтруктураПараметровВсплывающегоСписка.ВыбранныйЭлементТекущегоСписка = Неопределено Тогда
			ОтборПоВладельцу = Неопределено;
			Если ЗначениеЗаполнено(ИмяСпискаДляОтбораПоВладельцу) Тогда
				СтруктураПараметровВсплывающегоСписка.Свойство(ИмяСпискаДляОтбораПоВладельцу,ОтборПоВладельцу);
			КонецЕсли;
			СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка] = ОбщегоНазначения.ПолучитьСписокЭлементовСправочникаПоОтборуСТранслитом(ТекстПоиска, ИмяСправочника,ОтборПоВладельцу,,ИндексЗапускаПоля);
		Иначе
			СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка] = Новый СписокЗначений;
			СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка].Добавить(СтруктураПараметровВсплывающегоСписка.ВыбранныйЭлементТекущегоСписка, СтруктураПараметровВсплывающегоСписка.ПредставлениеВыбранныйЭлементТекущегоСписка);
			СтруктураПараметровВсплывающегоСписка.ВыбранныйЭлементТекущегоСписка = Неопределено;
			СтруктураПараметровВсплывающегоСписка.ПредставлениеВыбранныйЭлементТекущегоСписка = Неопределено;
		КонецЕсли;
		ЭлементСписок = СтруктураПараметровВсплывающегоСписка.ЭлементСписок;
		Если ТипЗнч(Элемент) = Тип("ActiveX") Тогда
			ЭлементСписок.Clear();
		Иначе	
			Попытка
				ЭлементСписок.Значение.Очистить();	
			Исключение
			КонецПопытки;
			
		КонецЕсли;	
		Если СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка] = Неопределено Тогда
			КоличествоЭлементовДляВсплывающегоСписка = 0;
		Иначе
			КоличествоЭлементовДляВсплывающегоСписка = СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка].Количество();
		КонецЕсли;
		Если КоличествоЭлементовДляВсплывающегоСписка > 0 Тогда
			Если КоличествоЭлементовДляВсплывающегоСписка = 1 Тогда
				ЭлементСписок.Видимость = Ложь;
				Если СтруктураПараметровВсплывающегоСписка.АктивироватьАвтоПодсказку <> Ложь Тогда
					Длина = СтрДлина(Элемент.Значение);
					Если ТипЗнч(Элемент) = Тип("ActiveX") Тогда
						Если Элемент.SelStart > 0 И Элемент.SelStart < Длина Тогда
							Длина = Элемент.SelStart;
						КонецЕсли;
					КонецЕсли;
					АвтоТекст = СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка][0].Представление;
					ДлинаАвтоТекста = СтрДлина(АвтоТекст);
					ВыделенныйТекст = Сред(АвтоТекст, Длина + 1);
					Если ТипЗнч(Элемент) = Тип("ActiveX") Тогда
						Если Элемент.SelText <> ВыделенныйТекст Тогда
							Элемент.SelText = ВыделенныйТекст;
						КонецЕсли;
						Элемент.SelStart = Длина;
						Элемент.SelLength = ДлинаАвтоТекста - Длина;
					КонецЕсли;
					СтруктураПараметровВсплывающегоСписка.АктивироватьАвтоПодсказку = Истина;
				КонецЕсли;
				СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
				СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
			Иначе
				
				Если ТипЗнч(ЭлементСписок) = Тип("ActiveX") Тогда
					Для Каждого ЭлементаСписка Из СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка] Цикл
						ЭлементСписок.AddItem(ЭлементаСписка.Представление);
					КонецЦикла;
				Иначе
					Для Каждого ЭлементаСписка Из СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка] Цикл
						ЭлементСписок.Значение.Добавить(ЭлементаСписка.Представление);
					КонецЦикла;
				КонецЕсли;
				//ЭлементСписок.Видимость = Истина;
				ЭлементСписок.Лево = Элемент.Лево + 7;
				ЭлементСписок.Ширина = Элемент.Ширина + 22;
				//ЭлементСписок.Верх = Элемент.Верх - ЭлементСписок.Высота - 3;
				Если Форма.ТекущийЭлемент = Элемент Тогда
					СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Элемент;
					СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка];
					уб_СтраховойБрокер.ВыполнитьОтложенноеДействие(Форма, "УстановитьВидимостьВсплывающегоСписка", 0.01);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЭлементСписок.Видимость = Ложь;
			СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
			СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Данные", ИмяПоля);
	СтрокиТЗ = СтруктураФильтров.ТЗФильтров.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
		Если СтрокаТЗ.ЕстьЧастныйЗапрос Тогда
			ЕстьФильтр = Ложь;
			Условие = "ИСТИНА";
			Параметры = Новый Структура;
			
			СтруктураПолей = Неопределено;
			Если СтрокаТЗ.ЧастныйЗапрос.Свойство("СтруктураПолей", СтруктураПолей) Тогда
				Для Каждого ЭлементСтруктуры Из СтруктураПолей Цикл
					ЭлементФормы = Форма.ЭлементыФормы[ЭлементСтруктуры.Ключ];
					ЗначениеВПоле = ЭлементФормы.Значение;
					ИндексЗапускаВПоле = Неопределено;
					ЭлементСтруктуры.Значение.Свойство("ИндексЗапуска", ИндексЗапускаВПоле);
					//RT+ 2017
					Если ЗначениеЗаполнено(ЗначениеВПоле) = ложь и ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.ВСписке Тогда
						Попытка
							ЗначениеВПоле = ЭлементФормы.СписокВыбора;
							Если ЗначениеВПоле.Количество()= 0 Тогда
								ЗначениеВПоле = ЭлементФормы.Значение;
							КонецЕсли;	
						Исключение
							ЗначениеВПоле = ЭлементФормы.Значение;
						КонецПопытки;	
					КонецЕсли;
					//RT- 2017
					ИндексЗапускаВПоле = ?(ИндексЗапускаВПоле = Неопределено, 1, ИндексЗапускаВПоле);
					Если (ЗначениеЗаполнено(ЗначениеВПоле) И (ТипЗнч(ЗначениеВПоле) <> Тип("Строка") Или СтрДлина(ЗначениеВПоле) >= ИндексЗапускаВПоле))
						Или ЭлементСтруктуры.Значение.Свойство("РазрешитьОтборПоПустомуЗначению") И ЭлементСтруктуры.Значение.РазрешитьОтборПоПустомуЗначению Тогда
						НовоеУсловие = "";
						Если ЭлементСтруктуры.Значение.Свойство("ЧастныйКодУстановкиПараметра") Тогда
							ЗначениеФильтра = Неопределено;
							Выполнить(ЭлементСтруктуры.Значение.ЧастныйКодУстановкиПараметра);
							Если ЗначениеЗаполнено(ЗначениеФильтра) Тогда
								Параметры.Вставить(ЭлементСтруктуры.Ключ, ЗначениеФильтра);
							Иначе
								Продолжить;
							КонецЕсли;
						ИначеЕсли ЭлементСтруктуры.Значение.Свойство("ИмяВСтруктуреПараметровВсплывающегоСписка") Тогда
							СписокВСтруктуреВсплывающегоСписка = СтруктураПараметровВсплывающегоСписка[ЭлементСтруктуры.Значение.ИмяВСтруктуреПараметровВсплывающегоСписка];
							Если СписокВСтруктуреВсплывающегоСписка = Неопределено Или СписокВСтруктуреВсплывающегоСписка.Количество() = 0 Тогда
								Продолжить;
							КонецЕсли;
							Параметры.Вставить(ЭлементСтруктуры.Ключ, СписокВСтруктуреВсплывающегоСписка);
						ИначеЕсли ЭлементСтруктуры.Значение.Свойство("ТипЧисло") И ЭлементСтруктуры.Значение.ТипЧисло = Истина Тогда
							Попытка
								ЗначениеФильтра = Число(ЗначениеВПоле);
							Исключение
								Продолжить;
							КонецПопытки;
							Параметры.Вставить(ЭлементСтруктуры.Ключ, ЗначениеФильтра);
						Иначе
							Параметры.Вставить(ЭлементСтруктуры.Ключ, ЗначениеВПоле);
						КонецЕсли;
						
						ЗначениеПараметра = Неопределено;
						Если ЭлементСтруктуры.Значение.Свойство("ПолеДополнительногоУсловияИЛИ", ЗначениеПараметра) Тогда
							ЕстьДопУсловиеИли = Истина;
							ПолеДополнительногоУсловияИЛИ = ЗначениеПараметра;
							ИмяПараметраДопУсловиеИли = ?(ЭлементСтруктуры.Значение.Свойство("ИмяПараметраДополнительногоУсловияИЛИ",ЗначениеПараметра),ЗначениеПараметра,ЭлементСтруктуры.Ключ);
							Если ЭлементСтруктуры.Значение.Свойство("ЗначениеПараметраДополнительногоУсловияИЛИ",ЗначениеПараметра) Тогда
								Параметры.Вставить(ИмяПараметраДопУсловиеИли, ЗначениеПараметра);
							КонецЕсли;
						Иначе
							ЕстьДопУсловиеИли = Ложь;
						КонецЕсли;
						
						ИмяПоляВТаблице = ЭлементСтруктуры.Значение.ИмяРеквизитаДляОтбора;
						
						Если ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.ВСписке Тогда
							НовоеУсловие = НовоеУсловие + " И " + ?(ЕстьДопУсловиеИли,"(","") + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ИмяПоляВТаблице + " В (&" + ЭлементСтруктуры.Ключ + ") ";
							Если ЕстьДопУсловиеИли Тогда
								НовоеУсловие = НовоеУсловие + " ИЛИ " + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ПолеДополнительногоУсловияИЛИ + " В (&" + ИмяПараметраДопУсловиеИли + ")) ";
							КонецЕсли;
						ИначеЕсли ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.Равно Или ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.БольшеИлиРавно Или ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.МеньшеИлиРавно Или ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.Больше Или ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.Меньше Или ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.НеРавно Тогда
							ЗнакРавенства = ПолучитьЗнакРавенстваПоВидуСравнения(ЭлементСтруктуры.Значение.ВидСравнения);
							НовоеУсловие = НовоеУсловие + " И " + ?(ЕстьДопУсловиеИли,"(","") + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ИмяПоляВТаблице + " " + ЗнакРавенства + " &" + ЭлементСтруктуры.Ключ + " ";
							Если ЕстьДопУсловиеИли Тогда
								НовоеУсловие = НовоеУсловие + " ИЛИ " + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ПолеДополнительногоУсловияИЛИ + " " + ЗнакРавенства + " &" + ИмяПараметраДопУсловиеИли + ") ";
							КонецЕсли;
						ИначеЕсли ЭлементСтруктуры.Значение.ВидСравнения = ВидСравнения.Содержит Тогда
							НовоеУсловие = НовоеУсловие + " И " + ?(ЕстьДопУсловиеИли,"(","") + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ИмяПоляВТаблице + " Подобно ""%"" + &" + ЭлементСтруктуры.Ключ + " + ""%"" ";
							Если ЕстьДопУсловиеИли Тогда
								НовоеУсловие = НовоеУсловие + " ИЛИ " + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + "." + ПолеДополнительногоУсловияИЛИ + " Подобно ""%"" + &" + ИмяПараметраДопУсловиеИли + " + ""%"") ";
							КонецЕсли;
						КонецЕсли;
						Если ЭлементСтруктуры.Значение.Свойство("СписокЗначений") Тогда
							//2017
							//+ дополнительный принудительный фильттр
							ИмяПараметра = "ПринудительныйФильтр" + ЭлементСтруктуры.Значение.Имя;
							//НовоеУсловие = НовоеУсловие + " И " + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе + " В(&" + ИмяПараметра + ") ";
							НовоеУсловие = НовоеУсловие + " И (" + ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе+"." + ИмяПоляВТаблице + " В(&" + ИмяПараметра + ") "
							                                     + ?(ЕстьДопУсловиеИли," ИЛИ "+ЭлементСтруктуры.Значение.ИмяТаблицыВЗапросе+"." + ПолеДополнительногоУсловияИЛИ + " В(&" + ИмяПараметра + ") ","")+
																 ")";
							Параметры.Вставить(ИмяПараметра, ЭлементСтруктуры.Значение.СписокЗначений);
						КонецЕсли;
						Условие = Условие + НовоеУсловие;
						ЕстьФильтр = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если СтрокаТЗ.СтруктураДопНастроек <> Неопределено И СтрокаТЗ.СтруктураДопНастроек.Свойство("ЧастныйКод") Тогда
				Выполнить(СтрокаТЗ.СтруктураДопНастроек.ЧастныйКод);
			КонецЕсли;
			СтрокаТЗ.ЧастныйЗапрос.Условие 		= Условие;
			СтрокаТЗ.ЧастныйЗапрос.Параметры    = Параметры;
			СтрокаТЗ.ЧастныйЗапрос.ЕстьФильтр	= ЕстьФильтр;
			Если ЕстьФильтр Тогда
				СтрокаТЗ.Состояние = "Заполнен";
			Иначе
				СтрокаТЗ.Состояние = "НеЗаполнен";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если СтруктураПараметровВсплывающегоСписка <> Неопределено И ЗначениеЗаполнено(ИмяВСтруктуреПараметровВсплывающегоСписка) Тогда
		СтруктураПоиска = Новый Структура("ИмяПоля", ИмяПоля);
		СтрокиТЗ = СтруктураФильтров.ТЗФильтров.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
			СтрокаТЗ.Значение = СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуреПараметровВсплывающегоСписка];
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИмяПоля", ИмяПоля);
	СтрокиТЗ = СтруктураФильтров.ТЗФильтров.НайтиСтроки(СтруктураПоиска);
	//СтрокаТЗ = СтруктураФильтров.ТЗФильтров.Найти(ИмяПоля, "ИмяПоля");
	
	//Изменение фона элементов полей в зависимости от заполненности
	//TODO унифицировать:  почему СтруктураФильтров.Свойство("Цвета") используется только с частным запросом. сделать более линейным
	Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
		Если СтрокаТЗ.ЕстьЧастныйЗапрос Тогда
			
			//Изменение фона элементов полей в зависимости от заполненности
			Если СтруктураФильтров.Свойство("Цвета") Тогда
				//Для Каждого Поле Из СтрокаТЗ.ЧастныйЗапрос.МассивПолей Цикл
				//	ИндексЗапускаФильтраВПоле = ИндексЗапуска;
				//	Поле = ЭлементыФормы[Поле];
				Для Каждого ЭлементСтруктурыПолей Из СтрокаТЗ.ЧастныйЗапрос.СтруктураПолей Цикл
					Поле = ЭлементыФормы[ЭлементСтруктурыПолей.Ключ];
					ВыполненоУсловиеИндексаЗапуска = Истина;
					Если ТипЗнч(Поле.Значение) = Тип("Строка") Тогда
						ИндексЗапускаФильтраВПоле = ?(ЭлементСтруктурыПолей.Значение.Свойство("ИндексЗапуска",ИндексЗапускаФильтраВПоле), ИндексЗапускаФильтраВПоле, 1);
						Если СтрДлина(СокрЛП(Поле.Значение)) < ИндексЗапускаФильтраВПоле Тогда
							ВыполненоУсловиеИндексаЗапуска = Ложь;
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗаполнено(Поле.Значение) И ВыполненоУсловиеИндексаЗапуска
						Или ЭлементСтруктурыПолей.Значение.Свойство("РазрешитьОтборПоПустомуЗначению") И ЭлементСтруктурыПолей.Значение.РазрешитьОтборПоПустомуЗначению И Поле.Значение <> Неопределено Тогда
						Состояние = "Заполнен";
						СтруктураПараметровВсплывающегоСписка = СтруктураФильтров.СтруктураПараметровВсплывающегоСписка;
						Если СтруктураПараметровВсплывающегоСписка <> Неопределено И ЗначениеЗаполнено(ИмяВСтруктуреПараметровВсплывающегоСписка) И Элемент <> Неопределено Тогда
							Если Поле = Элемент Тогда
								Если КоличествоЭлементовДляВсплывающегоСписка = 0 Тогда
									Состояние = "ПустойРезультатФильтра";
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					Иначе
						Состояние = "НеЗаполнен";
					КонецЕсли;
					Цвета = СтруктураФильтров.Цвета;
					Если Состояние = "ПустойРезультатФильтра" Тогда
						Красный = Цвета.ПустойРезультатФильтра.Красный;
						Зеленый = Цвета.ПустойРезультатФильтра.Зеленый;
						Синий	= Цвета.ПустойРезультатФильтра.Синий;
					ИначеЕсли Состояние = "Заполнен" Тогда
						Красный = Цвета.ФонЗаполненногоФильтра.Красный;
						Зеленый = Цвета.ФонЗаполненногоФильтра.Зеленый;
						Синий	= Цвета.ФонЗаполненногоФильтра.Синий;
					Иначе
						Красный = Цвета.ФонНезаполненногоФильтра.Красный;
						Зеленый = Цвета.ФонНезаполненногоФильтра.Зеленый;
						Синий	= Цвета.ФонНезаполненногоФильтра.Синий;
					КонецЕсли;
					Если ТипЗнч(Поле) = Тип("ActiveX") Тогда //Если СтрокаТЗ.ActiveX Тогда
						Если Состояние = "ПустойРезультатФильтра" Тогда
							НовыйЦвет = Цвета.ПустойРезультатФильтра.Абсолютный;
						Иначе
							НовыйЦвет = ?(Состояние = "Заполнен", Цвета.ФонЗаполненногоФильтра.Абсолютный, Цвета.ФонНезаполненногоФильтра.Абсолютный);
						КонецЕсли;
						Если Поле.BackColor <> НовыйЦвет Тогда
							Поле.BackColor = НовыйЦвет;
						КонецЕсли;
					Иначе	
						Поле.ЦветФонаПоля = Новый Цвет(Красный, Зеленый, Синий);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//СтрокаТЗ.Состояние = Состояние;
		Иначе
			Отказ = Ложь;
			Поле = ЭлементыФормы.Найти(ИмяПоля);
			Если Поле <> Неопределено Тогда
				СтрокаТЗ.ИсхЗначение = Поле.Значение;
			КонецЕсли;
			Если СтрокаТЗ.ВидСравнения = "ВСписке" И ТипЗнч(СтрокаТЗ.Значение) = Тип("СписокЗначений") Тогда
				Значение = СтрокаТЗ.Значение;
			ИначеЕсли СтрокаТЗ.Подобно Тогда
				Значение = СокрЛП(СтрокаТЗ.ИсхЗначение);
			Иначе
				Значение = СтрокаТЗ.ИсхЗначение;
			КонецЕсли;
			Если СтрокаТЗ.ЕстьЧастныйКод Тогда
				Выполнить(СтрокаТЗ.ЧастныйКод);
			КонецЕсли;
			СтрокаТЗ.Значение = Значение;
			Состояние = СостояниеПоляФильтра(СтрокаТЗ);
			Если Отказ И Состояние = "Заполнен" Тогда
				Состояние = "НеПолностью";
			КонецЕсли;
			СтрокаТЗ.Состояние = Состояние;
			Если Поле <> Неопределено И СтруктураФильтров.Свойство("Цвета") Тогда
				Цвета = СтруктураФильтров.Цвета;
				ЗаполненоИсходноеЗначение = ЗначениеЗаполнено(СтрокаТЗ.ИсхЗначение);
				Если СтрокаТЗ.ActiveX Тогда
					Если Состояние = "ПустойРезультатФильтра" И ЗаполненоИсходноеЗначение Тогда
						Поле.BackColor = Цвета.ПустойРезультатФильтра.Абсолютный;
					Иначе
						Поле.BackColor = ?(Состояние = "Заполнен" И ЗаполненоИсходноеЗначение, Цвета.ФонЗаполненногоФильтра.Абсолютный, Цвета.ФонНезаполненногоФильтра.Абсолютный);
					КонецЕсли;
				Иначе
					//TODO создать частную проверку заполнения фильтра
					Если Состояние = "ПустойРезультатФильтра" И ЗаполненоИсходноеЗначение Тогда
						Красный = Цвета.ПустойРезультатФильтра.Красный;
						Зеленый = Цвета.ПустойРезультатФильтра.Зеленый;
						Синий	= Цвета.ПустойРезультатФильтра.Синий;
					ИначеЕсли Состояние = "Заполнен" И (ЗаполненоИсходноеЗначение Или СтрокаТЗ.РазрешитьОтборПоЗначению0 = Истина И  СтрокаТЗ.Значение = 0) Тогда
						Красный = Цвета.ФонЗаполненногоФильтра.Красный;
						Зеленый = Цвета.ФонЗаполненногоФильтра.Зеленый;
						Синий	= Цвета.ФонЗаполненногоФильтра.Синий;
					Иначе
						Красный = Цвета.ФонНезаполненногоФильтра.Красный;
						Зеленый = Цвета.ФонНезаполненногоФильтра.Зеленый;
						Синий	= Цвета.ФонНезаполненногоФильтра.Синий;
					КонецЕсли;
					Поле.ЦветФонаПоля = Новый Цвет(Красный, Зеленый, Синий);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура KeyDownПоляФильтра(Элемент, KeyCode, Shift, ЭтаФорма, СтруктураФильтров = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураФильтров) Тогда
		МассивНастроек = Новый Массив;
		МассивНастроек.Добавить("ИмяСледующегоЭлементаВПорядкеОбхода");
		МассивНастроек.Добавить("ИмяПредыдущегоЭлементаВПорядкеОбхода");
		МассивНастроек.Добавить("ДопустимыеСимволы");
		СтруктураЗначениеНастроек = ПолучитьНастройкиПоля(СтруктураФильтров.ТЗФильтров, НРег(Элемент.Имя), МассивНастроек);
		ИмяСледующегоЭлемента = СтруктураЗначениеНастроек.ИмяСледующегоЭлементаВПорядкеОбхода;
		ИмяПредыдущегоЭлемента = СтруктураЗначениеНастроек.ИмяПредыдущегоЭлементаВПорядкеОбхода;
		ДопустимыеСимволы = СтруктураЗначениеНастроек.ДопустимыеСимволы;
		СтруктураПараметровВсплывающегоСписка = СтруктураФильтров.СтруктураПараметровВсплывающегоСписка;
		Если СтруктураПараметровВсплывающегоСписка <> Неопределено Тогда
			ЭлементВсплывающегоСписка = СтруктураПараметровВсплывающегоСписка.ЭлементСписок;
		КонецЕсли;
		ИмяСписка = СтруктураФильтров.ИмяСписка;
	КонецЕсли;
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	KeyCodeValue = KeyCode.Value;
	Если Shift = 2 И KeyCodeValue = 13 Тогда//ctrl+enter
		Если ИмяСписка <> Неопределено И ЭтаФорма.РежимВыбора = Истина И ЗначениеЗаполнено(ЭлементыФормы[ИмяСписка].ТекущаяСтрока) Тогда
			ЭтаФорма.ОповеститьОВыборе(ЭлементыФормы[ИмяСписка].ТекущаяСтрока.Ссылка);
		КонецЕсли;
	ИначеЕсли  (Shift <> 1 И KeyCodeValue = 9 Или KeyCodeValue = 13) Тогда//если таб без шифта или enter
		Если ЗначениеЗаполнено(ИмяСледующегоЭлемента) Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[ИмяСледующегоЭлемента];
			//Подмена символа чтобы отключить последующую обработку
			KeyCode.Value = 19;
		ИначеЕсли KeyCode.Value = 13 Тогда
			//
			//KeyCode.Value = 19;
			
			ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[СтруктураФильтров.ИмяСписка];
			АвтоПеребросФокусаВвода = Истина;
			ШелСкрипт = Новый COMОбъект("WScript.Shell");
			ШелСкрипт.SendKeys("{ENTER}");
			СтруктураФильтров.ВернутьФокусВПоле = Элемент.Имя;
			KeyCode.Value = 19;
			
			//СтруктураФильтров.ВернутьФокусВПоле = Элемент.Имя;

			//Если СтруктураФильтров.ИмяСписка Тогда
			//	СтруктураФильтров.ИмяСписка
			//КонецЕсли;
		КонецЕсли;
		
		Если ЭлементВсплывающегоСписка <> Неопределено Тогда
			ЭлементВсплывающегоСписка.Видимость = Ложь;
			СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
			СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
		КонецЕсли;
	ИначеЕсли Shift = 1 И KeyCodeValue = 9  Тогда//если таб с шифтом
		Если ЗначениеЗаполнено(ИмяПредыдущегоЭлемента) Тогда
			KeyCode.Value = 19;
			ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[ИмяПредыдущегоЭлемента];
		КонецЕсли;
	ИначеЕсли Shift = 2 И (KeyCodeValue = 86 Или KeyCodeValue = 65 Или KeyCodeValue = 67) Или //если нажаты ctrl + V или ctrl + A или ctrl + C
		Shift = 1 И KeyCodeValue = 45 Тогда//если нажаты shift + ins
		;
	ИначеЕсли Shift = 0 И KeyCodeValue = 45	Тогда
		
			ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[СтруктураФильтров.ИмяСписка];
			АвтоПеребросФокусаВвода = Истина;
			ШелСкрипт = Новый COMОбъект("WScript.Shell");
			ШелСкрипт.SendKeys("{INSERT}");
			СтруктураФильтров.ВернутьФокусВПоле = Элемент.Имя;
			KeyCode.Value = 19;
			
	ИначеЕсли KeyCodeValue = 38 Или KeyCodeValue = 40 Тогда//верх или вниз
		Если ЭлементВсплывающегоСписка <> Неопределено И ЭлементВсплывающегоСписка.Видимость Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементВсплывающегоСписка;
			ЭлементВсплывающегоСписка.ListIndex = 0;
		Иначе
			Если СтруктураФильтров <> Неопределено И СтруктураФильтров.ВернутьФокусВПоле = Неопределено Тогда
				ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[ИмяСписка];
				АвтоПеребросФокусаВвода = Истина;
				ШелСкрипт = Новый COMОбъект("WScript.Shell");
				ШелСкрипт.SendKeys(?(KeyCodeValue = 40,"{DOWN}","{UP}"));
				СтруктураФильтров.ВернутьФокусВПоле = Элемент.Имя;
				KeyCode.Value = 19;
			Иначе
				СтруктураФильтров.ВернутьФокусВПоле = Неопределено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли KeyCodeValue = 27 И ЭлементВсплывающегоСписка <> Неопределено И ЭлементВсплывающегоСписка.Видимость Тогда//esc	
		ЭлементВсплывающегоСписка.Видимость = Ложь;
		СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
		СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
		KeyCode.Value = 19;
	ИначеЕсли ЗначениеЗаполнено(ДопустимыеСимволы) Тогда
		
		МассивУправляющихСимволов = Новый Массив;
		МассивУправляющихСимволов.Добавить(8);//backspace
		//МассивУправляющихСимволов.Добавить(9);//tab//уже отработано выше
		//МассивУправляющихСимволов.Добавить(13);//enter//уже отработано выше
		МассивУправляющихСимволов.Добавить(16);//shift
		МассивУправляющихСимволов.Добавить(17);//ctrl
		МассивУправляющихСимволов.Добавить(35);//end
		МассивУправляющихСимволов.Добавить(36);//home
		МассивУправляющихСимволов.Добавить(37);//←
		МассивУправляющихСимволов.Добавить(38);//↑
		МассивУправляющихСимволов.Добавить(39);//→
		МассивУправляющихСимволов.Добавить(40);//↓
		МассивУправляющихСимволов.Добавить(45);//ins
		МассивУправляющихСимволов.Добавить(46);//del
		МассивУправляющихСимволов.Добавить(112);//F1
		МассивУправляющихСимволов.Добавить(113);//F2
		МассивУправляющихСимволов.Добавить(114);//F3
		МассивУправляющихСимволов.Добавить(115);//F4
		
		Если ДопустимыеСимволы = "0123456789." Тогда
			Если KeyCodeValue = 188 Или KeyCodeValue = 190 Или KeyCodeValue = 191 Тогда
				KeyCode.Value = 110;
				KeyCodeValue = 110;
			КонецЕсли;
			Если KeyCodeValue = 110 Тогда
				Если Найти(Элемент.Значение, ".") <> 0 Тогда
					KeyCode.Value = 19;
				КонецЕсли;
			КонецЕсли;
			МассивУправляющихСимволов.Добавить(110);//.
		КонецЕсли;
		
		Если МассивУправляющихСимволов.Найти(KeyCodeValue) = Неопределено Тогда
			
			ЭтоЦифра = Не ((KeyCodeValue < 48 Или KeyCodeValue > 57) И (KeyCodeValue < 96 Или KeyCodeValue > 105));//И Код <> 8 И Код <> 13 И Код <> 9
			Если Не ЭтоЦифра Тогда
				KeyCode.Value = 19;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПараметровВсплывающегоСписка <> Неопределено Тогда
		Если KeyCodeValue = 8 Или KeyCodeValue = 46 Или KeyCodeValue = 36 Или KeyCodeValue = 37 Или KeyCodeValue = 39 Тогда//backspace или delete или home или ← → 
			СтруктураПараметровВсплывающегоСписка.АктивироватьАвтоПодсказку = Ложь;
		Иначе
			СтруктураПараметровВсплывающегоСписка.АктивироватьАвтоПодсказку = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура BeforeDropOrPasteПоляФильтра(Элемент, Cancel, Action, Data, X, Y, Effect, Shift, СтруктураФильтров, УдалитьПарамтр = Ложь, УдалитьПарамтр2 = "0123456789") Экспорт
	Если Action = 2 Тогда//если вставка
		СтруктураФильтров.ЭтоВставкаТекста = Истина;
		МассивНастроек = Новый Массив;
		МассивНастроек.Добавить("ДопустимыеСимволы");
		СтруктураЗначениеНастроек = ПолучитьНастройкиПоля(СтруктураФильтров.ТЗФильтров, НРег(Элемент.Имя), МассивНастроек);
		ДопустимыеСимволы = СтруктураЗначениеНастроек.ДопустимыеСимволы;
		Если ЗначениеЗаполнено(ДопустимыеСимволы) Тогда
			Cancel.Value = Истина;//СтандартнаяОбработка = Ложь;
			ТекстВставки = Data.GetText();
			ИтоговыйТекстВПоле = Элемент.Значение;
			Если Элемент.SelLength > 0 Тогда
				ЛеваяЧасть = Лев(ИтоговыйТекстВПоле,Элемент.SelStart);
				ПраваяЧасть = Сред(ИтоговыйТекстВПоле, Элемент.SelStart + Элемент.SelLength + 1);
				ИтоговыйТекстВПоле = ЛеваяЧасть + ТекстВставки + ПраваяЧасть;
			Иначе
				ИтоговыйТекстВПоле = ИтоговыйТекстВПоле + ТекстВставки;
			КонецЕсли;
			уб_temp.УдалитьБуквыИзСтроки(ИтоговыйТекстВПоле, ДопустимыеСимволы);
			Элемент.Значение = ИтоговыйТекстВПоле;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНастройкиПоля(ТЗФильтров, ИмяПоля, Настройки)
	
	СтрокаТЗ = ТЗФильтров.Найти(ИмяПоля, "ИмяПоля");
	Результат = Новый Структура;
	Для Каждого ЭлементНастройки Из Настройки Цикл
		Результат.Вставить(ЭлементНастройки);
	КонецЦикла;
	ЗначениеВСтруктуре = Неопределено;
	Если СтрокаТЗ = Неопределено Тогда//элемент - один из списка нескольких элементов, которые накладывают на один реквизит объекта
		Для Каждого СтрокаТЗ Из ТЗФильтров Цикл
			Если СтрокаТЗ.ЕстьЧастныйЗапрос Тогда
				Если СтрокаТЗ.ЧастныйЗапрос.СтруктураПолей.Свойство(ИмяПоля, ЗначениеВСтруктуре) Тогда
					Для Каждого ЭлементНастройки Из Настройки Цикл
						ЗначениеНастройки = Неопределено;
						Если ЭлементНастройки = "ИмяПоля" Тогда
							Результат[ЭлементНастройки] = СтрокаТЗ[ЭлементНастройки];
						ИначеЕсли ЗначениеВСтруктуре.Свойство(ЭлементНастройки, ЗначениеНастройки) Тогда
							Результат[ЭлементНастройки] = ЗначениеНастройки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементНастройки Из Настройки Цикл
			Результат[ЭлементНастройки] = СтрокаТЗ[ЭлементНастройки];
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ChangeПоляФильтра(Элемент, ЭтаФорма, СтруктураФильтров) Экспорт
	
	ИнтервалЗапускаОтбора = 0.01;
	//Если Не Элемент = Неопределено Тогда
	//	Элемент.Значение = СтрЗаменить(Элемент.Значение,Символы.НПП,"");
	//КонецЕсли;
		
	Если Не СтруктураФильтров.ЭтоВставкаТекста Тогда
		Если ТипЗнч(Элемент) = Тип("ActiveX") Тогда
			ТекстПоиска = Элемент.Значение;
			Если ТекстПоиска = " " Тогда
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(ТекстПоиска) Тогда
				ИнтервалЗапускаОтбора = 0.5;
			КонецЕсли;
		Иначе
			ИнтервалЗапускаОтбора = 0.3;
		КонецЕсли;
	Иначе
		СтруктураФильтров.ЭтоВставкаТекста = Ложь;
	КонецЕсли;
	
	Если (СтруктураФильтров.СостояниеОбработки = 1
		И СтруктураФильтров.АктуальноеИмяПоля = Неопределено) //Ожидается обработка всех фильтров
		ИЛИ Элемент = Неопределено Тогда //Вызывается обработка всех фильтров
		//Будут обработаны все фильтры
		СтруктураФильтров.АктуальноеИмяПоля = Неопределено;
	Иначе
		Если СтруктураФильтров.АктуальноеИмяПоля = Неопределено Тогда
			СтруктураФильтров.АктуальноеИмяПоля = Новый Массив;
		КонецЕсли;
		ИмяЭлемента = Элемент.Имя;
		Если ТипЗнч(СтруктураФильтров.АктуальноеИмяПоля) = Тип ("Массив") 
			И СтруктураФильтров.АктуальноеИмяПоля.Найти(ИмяЭлемента) = Неопределено Тогда
			СтруктураФильтров.АктуальноеИмяПоля.Добавить(ИмяЭлемента);	
		КонецЕсли;	
	КонецЕсли;	
	
	СтруктураФильтров.СостояниеОбработки = 1;//Ожидание
	
	
	уб_СтраховойБрокер.ВыполнитьОтложенноеДействие(ЭтаФорма, "СтандартнаяОбработкаФильтров", ИнтервалЗапускаОтбора);
	
КонецПроцедуры

Процедура ПослеОбработкиФильтров(СтруктураФильтров) Экспорт
	СтруктураФильтров.СостояниеОбработки = 0;
	СтруктураФильтров.АктуальноеИмяПоля = Неопределено;
КонецПроцедуры	



//возвращает состояние заполнения поля фильтра для обработки и окраски
Функция СостояниеПоляФильтра(СтрокаТЗ)
	
	Если СтрокаТЗ.ActiveX Тогда
		Длина = СтрДлина(СтрокаТЗ.Значение);
		//Если СтрДлина(СокрЛП(СтрокаТЗ.ИсхЗначение)) > 1 И Длина = 0 Тогда
		Если СтрДлина(СокрЛП(СтрокаТЗ.ИсхЗначение)) >= СтрокаТЗ.ИндексЗапуска И Длина = 0 Тогда
			Результат = "ПустойРезультатФильтра";
		ИначеЕсли Длина = 0 Тогда
			Результат = "НеЗаполнен";
		ИначеЕсли Длина >= СтрокаТЗ.ИндексЗапуска Тогда
			Результат = "Заполнен";
		Иначе
			Результат = "НеПолностью";
		КонецЕсли;
	Иначе
		ЗначениеВПолеЗаполнено = ЗначениеЗаполнено(СтрокаТЗ.ИсхЗначение);
		ЗначениеОтбораЗаполнено = ЗначениеЗаполнено(СтрокаТЗ.Значение) Или (СтрокаТЗ.Значение = 0 И СтрокаТЗ.РазрешитьОтборПоЗначению0 = Истина);
		Если СтрокаТЗ.СтруктураДопНастроек <> Неопределено И СтрокаТЗ.СтруктураДопНастроек.Свойство("РазрешитьПустойРезультатФильтра") И СтрокаТЗ.СтруктураДопНастроек.РазрешитьПустойРезультатФильтра = Истина 
			Или СтрокаТЗ.РазрешитьОтборПоЗначению0 = Истина И СтрокаТЗ.Значение = 0 Тогда
			Результат = "Заполнен";
		ИначеЕсли ЗначениеВПолеЗаполнено И Не ЗначениеОтбораЗаполнено И СтрДлина(СокрЛП(СтрокаТЗ.ИсхЗначение)) >= СтрокаТЗ.ИндексЗапуска Тогда
			Результат = "ПустойРезультатФильтра";
		ИначеЕсли ЗначениеОтбораЗаполнено Тогда
			Результат = "Заполнен";
		Иначе
			Результат = "НеЗаполнен";
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // СостояниеПоляФильтра()

Функция ПолучитьЗнакРавенстваПоВидуСравнения(ТекВидСравнения)
	
	Если ТекВидСравнения = ВидСравнения.Больше Тогда
		Возврат ">";
	ИначеЕсли ТекВидСравнения = ВидСравнения.БольшеИлиРавно Тогда
		Возврат ">=";
	ИначеЕсли ТекВидСравнения = ВидСравнения.ВИерархии Тогда
		Возврат "В ИЕРАРХИИ";
	ИначеЕсли ТекВидСравнения = ВидСравнения.ВСписке Тогда
		Возврат "В";
	ИначеЕсли ТекВидСравнения = ВидСравнения.Меньше Тогда
		Возврат "<";
	ИначеЕсли ТекВидСравнения = ВидСравнения.МеньшеИлиРавно Тогда
		Возврат "<=";
	ИначеЕсли ТекВидСравнения = ВидСравнения.НеРавно Тогда
		Возврат "<>";
	ИначеЕсли ТекВидСравнения = ВидСравнения.Равно Тогда
		Возврат "=";
	ИначеЕсли ТекВидСравнения = ВидСравнения.Содержит Тогда
		Возврат "ПОДОБНО";
	КонецЕсли;
	
КонецФункции


// TODO дубль в уб_КЭШируемые
//возвращает цвет или тз цветов (если вместо строки передан массив или список значений)
//Параметры:
//Цвета - строка. Имя предопределенного элемента справочника цветов
//		- ссылка справочника цветов
//		- массив имен предопределенных элементов справочника цветов
//ИскатьПоРодителю - если Истина, параметр Цвета определяет родителя (или массив родителей). Игнорируется параметр ПроверятьКоличество
//TODO искать не только предопределенные и учесть пометку удаления (игнорировать пометку для предопределенных)
Функция ЦветаСправочникаЦветов(Знач Цвета, ПроверятьКоличество = Истина, ИскатьПоРодителю = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ц.Красный,
	|	Ц.Зеленый,
	|	Ц.Синий,
	|	Ц.Абсолютный,
	|	Ц.Ссылка,
	|	ВЫБОР
	|		КОГДА Ц.Web = """"
	|			ТОГДА ""000000""
	|		ИНАЧЕ Ц.Web
	|	КОНЕЦ КАК Web
	|ИЗ
	|	Справочник.уб_Цвета КАК Ц
	|ГДЕ
	|	Ц.Предопределенный
	|	И &Условие");
	ТипЗнчЦвета = ТипЗнч(Цвета);
	ИмяСправочника  = "Ц";
	ИмяПоляЗамены 	= ?(ИскатьПоРодителю, "Родитель", "Ссылка");
	Если ТипЗнчЦвета = Тип("Строка") Тогда
		Условие = Справочники.уб_Цвета[Цвета];
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " = &Условие";
		Если Не ИскатьПоРодителю Тогда
			Количество = 1
		КонецЕсли;
	ИначеЕсли ТипЗнчЦвета = Тип("СправочникСсылка.уб_Цвета") Тогда
		Условие = Цвета;
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " = &Условие";
		Если Не ИскатьПоРодителю Тогда
			Количество = 1
		КонецЕсли;
	Иначе
		//массив или список значений
		Массив = Новый Массив;
		Для Каждого Элемент Из Цвета Цикл
			Массив.Добавить(Справочники.уб_Цвета[Элемент])
		КонецЦикла;
		Условие = Массив;
		Замена = ИмяСправочника + "." + ИмяПоляЗамены + " В (&Условие)";
		Если Не ИскатьПоРодителю Тогда
			Количество = Цвета.Количество()
		КонецЕсли;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Замена);
	Запрос.УстановитьПараметр("Условие", Условие);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ПроверятьКоличество И Количество <> Неопределено И ТЗ.Количество() <> Количество Тогда
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не найдены все необходимые данные справочника цветов!", ?(ПараметрыСеанса.уб_РежимОтладки > 4, "Сообщить", "НеСообщать"), Истина)
	Иначе
		ТЗ.Колонки.Добавить("Имя");
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			СтрокаТЗ.Имя = Справочники.уб_Цвета.ПолучитьИмяПредопределенного(СтрокаТЗ.Ссылка)
		КонецЦикла;
		Возврат ТЗ
	КонецЕсли;
	
КонецФункции // ЦветаСправочникаЦветов()


//получает символы алфавитов rus и en в массиве
Функция МассивАлфавит(ДлинаМассива = Неопределено) Экспорт
	
	RUS = Новый Массив;
	EN = Новый Массив;
	
	RUS.Добавить("й"); EN.Добавить("q");
	RUS.Добавить("ц"); EN.Добавить("w");
	RUS.Добавить("у"); EN.Добавить("e");
	RUS.Добавить("к"); EN.Добавить("r");
	RUS.Добавить("е"); EN.Добавить("t");
	RUS.Добавить("н"); EN.Добавить("y");
	RUS.Добавить("г"); EN.Добавить("u");
	RUS.Добавить("ш"); EN.Добавить("i");
	RUS.Добавить("щ"); EN.Добавить("o");
	RUS.Добавить("з"); EN.Добавить("p");
	RUS.Добавить("х"); EN.Добавить("[");
	RUS.Добавить("ъ"); EN.Добавить("]");
	RUS.Добавить("ф"); EN.Добавить("a");
	RUS.Добавить("ы"); EN.Добавить("s");
	RUS.Добавить("в"); EN.Добавить("d");
	RUS.Добавить("а"); EN.Добавить("f");
	RUS.Добавить("п"); EN.Добавить("g");
	RUS.Добавить("р"); EN.Добавить("h");
	RUS.Добавить("о"); EN.Добавить("j");
	RUS.Добавить("л"); EN.Добавить("k");
	RUS.Добавить("д"); EN.Добавить("l");
	RUS.Добавить("ж"); EN.Добавить(";");
	RUS.Добавить("э"); EN.Добавить("'");
	RUS.Добавить("я"); EN.Добавить("z");
	RUS.Добавить("ч"); EN.Добавить("x");
	RUS.Добавить("с"); EN.Добавить("c");
	RUS.Добавить("м"); EN.Добавить("v");
	RUS.Добавить("и"); EN.Добавить("b");
	RUS.Добавить("т"); EN.Добавить("n");
	RUS.Добавить("ь"); EN.Добавить("m");
	RUS.Добавить("б"); EN.Добавить(",");
	RUS.Добавить("ю"); EN.Добавить(".");
	RUS.Добавить("Й"); EN.Добавить("Q");
	RUS.Добавить("Ц"); EN.Добавить("W");
	RUS.Добавить("У"); EN.Добавить("E");
	RUS.Добавить("К"); EN.Добавить("R");
	RUS.Добавить("Е"); EN.Добавить("T");
	RUS.Добавить("Н"); EN.Добавить("Y");
	RUS.Добавить("Г"); EN.Добавить("U");
	RUS.Добавить("Ш"); EN.Добавить("I");
	RUS.Добавить("Щ"); EN.Добавить("O");
	RUS.Добавить("З"); EN.Добавить("P");
	RUS.Добавить("Х"); EN.Добавить("{");
	RUS.Добавить("Ъ"); EN.Добавить("}");
	RUS.Добавить("Ф"); EN.Добавить("A");
	RUS.Добавить("Ы"); EN.Добавить("S");
	RUS.Добавить("В"); EN.Добавить("D");
	RUS.Добавить("А"); EN.Добавить("F");
	RUS.Добавить("П"); EN.Добавить("G");
	RUS.Добавить("Р"); EN.Добавить("H");
	RUS.Добавить("О"); EN.Добавить("J");
	RUS.Добавить("Л"); EN.Добавить("K");
	RUS.Добавить("Д"); EN.Добавить("L");
	RUS.Добавить("Ж"); EN.Добавить(":");
	RUS.Добавить("Э"); EN.Добавить("""");
	RUS.Добавить("Я"); EN.Добавить("Z");
	RUS.Добавить("Ч"); EN.Добавить("X");
	RUS.Добавить("С"); EN.Добавить("C");
	RUS.Добавить("М"); EN.Добавить("V");
	RUS.Добавить("И"); EN.Добавить("B");
	RUS.Добавить("Т"); EN.Добавить("N");
	RUS.Добавить("Ь"); EN.Добавить("M");
	RUS.Добавить("Б"); EN.Добавить("<");
	RUS.Добавить("Ю"); EN.Добавить(">");
	
	Результат = Новый Массив;
	Результат.Добавить(EN);
	Результат.Добавить(RUS);
	ДлинаEN	 = EN.Количество();
	ДлинаRUS = RUS.Количество();
	Если ДлинаEN = ДлинаRUS Тогда
		ДлинаМассива = ДлинаRUS - 1;
		Возврат Результат;
	КонецЕсли;		
	
КонецФункции // МассивАлфавит()

//переводит строку в режиме другого языка ввода (rus/eng).
//ПоПервым = 0, для полного инвертирования доступных символов
//НаКакой = "EN" "RU" - Если Неопределено - определяет язык перевода
Функция ПеревестиСтроку(Строка, ПоПервым = 3, НаКакой = "") Экспорт//, Транслит = Ложь
	
	Строка = СокрЛП(Строка);
	ДлинаМассива = Неопределено;
	//Если Транслит Тогда
	//	Массив = МассивАлфавитТранслит(ДлинаМассива);
	//Иначе
	//	Массив = МассивАлфавит(ДлинаМассива);
	//КонецЕсли;
	
	Массив = МассивАлфавит(ДлинаМассива);
	
	Если СтрДлина(Строка) >= ПоПервым Тогда
		Если Массив = Неопределено Тогда
			Возврат Строка;
		КонецЕсли;
		Если ПоПервым <> 0 Тогда
			// определяем доминирующий язык
			Если Найти(НаКакой, "ru") <> 0 Тогда
				ЯзыкОбработки = 0;
			ИначеЕсли Найти(НаКакой, "en") <> 0 Тогда
				ЯзыкОбработки = 1;
			Иначе
				ИндексПоиска = 1;
				МассивПоПервым = Новый Массив;
				МассивПоПервым.Добавить(0);
				МассивПоПервым.Добавить(0);
				// для определения языка первого значимого символа при равенстве количеств символов языков
				ПервыйВСписке = Неопределено;
				Для Индекс = 1 По ПоПервым Цикл
					ЯзыкСимвола = НайтиСимволВМассивАлфавит(Массив, Сред(Строка, Индекс, 1), ИндексПоиска, ДлинаМассива);
					Если ЯзыкСимвола <> Неопределено Тогда
						МассивПоПервым[ИндексПоиска] = МассивПоПервым[ИндексПоиска] + 1;
						Если ПервыйВСписке = Неопределено Тогда
							ПервыйВСписке = ИндексПоиска;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если МассивПоПервым[0] = 0 И МассивПоПервым[1] = 0 Тогда
					//если только символы - не меняем строку
					Возврат Строка;
				ИначеЕсли МассивПоПервым[0] = МассивПоПервым[1] Тогда
					//кол-во символов совпадает
					ЯзыкОбработки = ПервыйВСписке;
				Иначе 
					ЯзыкОбработки = ?(МассивПоПервым[0] > МассивПоПервым[1], 0, 1);
				КонецЕсли;
			КонецЕсли;			
			//переводим
			Перевод = "";
			ЯзыкПеревода = ?(ЯзыкОбработки = 1, 0, 1);
			Для Счетчик = 1 По СтрДлина(Строка) Цикл
				ИндексСимвола = Неопределено;
				Символ = Сред(Строка, Счетчик, 1);
				// Находим символ в колонке языка массива
				Для Индекс = 0 По ДлинаМассива Цикл
					Если Массив[ЯзыкОбработки][Индекс] = Символ Тогда
						ИндексСимвола = Индекс;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ИндексСимвола <> Неопределено Тогда
					Перевод = Перевод + Массив[ЯзыкПеревода][ИндексСимвола];
				Иначе
					Перевод = Перевод + Символ;
				КонецЕсли;
			КонецЦикла;
		Иначе
			//инвертируем все доступные символы
			ИндексПоиска = 1;
			Перевод = "";
			Для Счетчик = 1 По СтрДлина(СТрока) Цикл
				Символ = Сред(Строка, Счетчик, 1);
				Индекс = НайтиСимволВМассивАлфавит(Массив, Символ, ИндексПоиска, ДлинаМассива);
				Если Индекс <> Неопределено Тогда
					ЯзыкПеревода = ?(ИндексПоиска = 1, 0, 1);
					Перевод = Перевод + Массив[ЯзыкПеревода][Индекс];
				Иначе
					Перевод = Перевод + Символ;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Возврат Строка;
	КонецЕсли;
	
	Возврат Перевод;			
КонецФункции

//возвращает индекс символа в массиве алфавитов
//счетчиком вызовов можно запретить рекурсию
Функция НайтиСимволВМассивАлфавит(Массив, Символ, ИндексПоиска, ДлинаМассива, СчетчикВызовов = 0) Экспорт
	
	Результат = Неопределено;
	
	Для Индекс = 0 По ДлинаМассива Цикл
		Если Массив[ИндексПоиска][Индекс] = Символ Тогда
			Результат = Индекс;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Неопределено И СчетчикВызовов <> Неопределено Тогда
		СчетчикВызовов = СчетчикВызовов + 1;
		ИндексПоиска = ?(ИндексПоиска = 1, 0, 1);
		Если СчетчикВызовов < 2 Тогда
			Результат = НайтиСимволВМассивАлфавит(Массив, Символ, ИндексПоиска, ДлинаМассива, СчетчикВызовов);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НайтиСимволВМассивАлфавит()		


Процедура ВыпадающийСписокKeyDown(Элемент, KeyCode, Shift, ЭтаФорма, ЭлементДляАктивизации, СтруктураПараметровВсплывающегоСписка) Экспорт
	
	KeyCodeValue = KeyCode.Value;
	Если KeyCodeValue = 38 Тогда//верх
		Элемент.ListIndex = Макс(Элемент.ListIndex - 1, 0);
	ИначеЕсли KeyCodeValue = 40 Тогда//низ
		Элемент.ListIndex = Мин(Элемент.ListIndex + 1,Элемент.ListCount - 1);
	ИначеЕсли KeyCodeValue = 13 Тогда//enter
		уб_Фильтры.ОбработататьВыбранныйЭлементВыпадающегоСписка(Элемент, ЭтаФорма, ЭлементДляАктивизации, СтруктураПараметровВсплывающегоСписка);
	ИначеЕсли KeyCodeValue = 9 Или KeyCodeValue = 27 Тогда//tab Или esc
		Элемент.Видимость = Ложь;
		СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
		СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
		Если KeyCodeValue = 27 Тогда
			//Подмена символа чтобы отключить последующую обработку
			KeyCode.Value = 19;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПараметровВсплывающегоСписка() Экспорт
	Возврат Новый Структура("СписокМарокТС, СписокМоделейТС, ВладелецВсплывающегоСписка, ТекущийСписокВсплывающегоСписка, ВыбранныйЭлементТекущегоСписка, ПредставлениеВыбранныйЭлементТекущегоСписка, АктивироватьАвтоПодсказку, ЭлементСписок");
КонецФункции

Процедура ОчиститьФильтр(Элемент, Структура = Неопределено, КлючВСтруктуре = Неопределено) Экспорт
	
	Элемент.Значение = "";
	Если Структура <> Неопределено И КлючВСтруктуре <> Неопределено Тогда
		Структура[КлючВСтруктуре] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция УниверсальнаяОчисткаФильтра(ЭлементыФормы, ИмяКнопки, Структура = Неопределено, КлючВСтруктуре = Неопределено) Экспорт
	
	ИмяПоляФильтра = СтрЗаменить(ИмяКнопки, "Очистить", "");
	Элемент = ЭлементыФормы.Найти(ИмяПоляФильтра);
	Если Элемент <> Неопределено Тогда
		Элемент.Значение = "";
	КонецЕсли;
	Если Структура <> Неопределено И КлючВСтруктуре <> Неопределено Тогда
		Структура[КлючВСтруктуре] = Неопределено;
	КонецЕсли;
	
	Возврат Элемент;
КонецФункции

Процедура ОбработататьВыбранныйЭлементВыпадающегоСписка(ЭлементСписок, ЭтаФорма, ЭлементДляАктивизации = Неопределено, СтруктураПараметровВсплывающегоСписка) Экспорт
	
	ВыбранныйТекст = ЭлементСписок.Value;
	Если ЗначениеЗаполнено(ВыбранныйТекст) Тогда
		Если ЭлементДляАктивизации <> Неопределено Тогда
			ЭтаФорма.ТекущийЭлемент = ЭтаФорма.ЭлементыФормы[ЭлементДляАктивизации];
		КонецЕсли;
		ЭлементСпискаЗначение = НайтиЭлементСпискаПоПредставлению(СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка,ВыбранныйТекст);
		Если ЭлементСпискаЗначение <> Неопределено Тогда
			СтруктураПараметровВсплывающегоСписка.ВыбранныйЭлементТекущегоСписка = ЭлементСпискаЗначение;
			СтруктураПараметровВсплывающегоСписка.ПредставлениеВыбранныйЭлементТекущегоСписка = ВыбранныйТекст;
		КонецЕсли;
		ЭлементСписок.Видимость = Ложь;
		Если СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка.Значение = ВыбранныйТекст Тогда
			СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка.Значение = " ";//чтобы вызвать событие onchange поля
			СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка.Значение = ВыбранныйТекст;
		Иначе
			СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка.Значение = ВыбранныйТекст;
		КонецЕсли;
		СтруктураПараметровВсплывающегоСписка.ВладелецВсплывающегоСписка = Неопределено;
		СтруктураПараметровВсплывающегоСписка.ТекущийСписокВсплывающегоСписка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры


//сначала нужно заблокировать поля фильтров, по данным котором нельзя менять отбор
Процедура ИсключитьНеВидимыеИлиНеДоступныеПоляВТЗФильтров(Форма) Экспорт
	
	ТЗФильтров = Форма.СтруктураФильтров.ТЗФильтров;
	МассивУдаляемыхИмен = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗФильтров ЦИкл
		Поле = Форма.ЭлементыФормы.Найти(СтрокаТЗ.ИмяПоля);
		Если Не ПроверитьДоступностьВводаВПоле(Поле) Тогда
			МассивУдаляемыхИмен.Добавить(СтрокаТЗ.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивУдаляемыхИмен Цикл
		МассивСтрокТЗ = ТЗФильтров.НайтиСтроки(Новый Структура("ИмяПоля", ЭлементМассива));
		Для Каждого ЭлементМассиваСтрок Из МассивСтрокТЗ Цикл
			ТЗФильтров.Удалить(ТЗФильтров.Индекс(ЭлементМассиваСтрок));
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//истина, если поле доступно для ввода/изменения данных
//TODO добавить свойства блокировки элемента ActiveX
Функция ПроверитьДоступностьВводаВПоле(Поле)
	
	Возврат Поле <> Неопределено И Поле.Видимость И ?(ТипЗнч(Поле) <> Тип("ActiveX"), Поле.Доступность И Не Поле.ТолькоПросмотр, Не Поле.Locked)
	
КонецФункции // ПроверитьДоступностьВводаВПоле()


Функция НайтиЭлементСпискаПоПредставлению(Список, Текст)
	Для Каждого ЭлементСписка Из Список Цикл
		Если Текст = ЭлементСписка.Представление Тогда
			Возврат ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции



Процедура ОбъектСписокПриАктивизацииСтроки(Элемент, ЭтаФорма, СтруктураФильтров) Экспорт
	
	Если Найти(СтруктураФильтров.ИмяСписка,"Документ")=0 Тогда
		ЭтаФорма.ОповеститьОбАктивизацииОбъекта(Элемент.ТекущаяСтрока);
	КонецЕсли;	
	ЭлементыФормы = ЭтаФорма.ЭлементыФормы;
	Если СтруктураФильтров.ВернутьФокусВПоле <> Неопределено Тогда
		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы[СтруктураФильтров.ВернутьФокусВПоле];
		СтруктураФильтров.ВернутьФокусВПоле = Неопределено;
	КонецЕсли;
	
КонецПроцедуры



Процедура MouseMoveПоляФильтра(Элемент, Button, Shift, X, Y, ЭтаФорма, ПолеПодсказки, СтруктураПараметровВсплывающегоСписка, ИмяВСтруктуре) Экспорт
	
	Если СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуре] <> Неопределено И СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуре].Количество() = 1 Тогда
		ТекстПодсказки = СтруктураПараметровВсплывающегоСписка[ИмяВСтруктуре][0].Представление;
		//ПолеПодсказки.Clear();
		//ПолеПодсказки.AddItem(ТекстПодсказки);
		ПолеПодсказки.Значение = ТекстПодсказки;
		ПолеПодсказки.Видимость = Истина;
		//ПолеПодсказки.Лево = Элемент.Лево + 7;
		ПолеПодсказки.Лево = Элемент.Лево;
		ПолеПодсказки.Ширина = Элемент.Ширина + 22;
		ЭтаФорма.ПодключитьОбработчикОжидания("ВыключитьПодсказку", 0.3, Истина);
	Иначе
		ПолеПодсказки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры