
Процедура НачалоВыбораБСО(Элемент, ВидБСО, НомерБСО) Экспорт
	
	ОтображаемыеКолонки = Новый СписокЗначений;
	ОтображаемыеКолонки.Добавить("СостояниеБСО");	
	ОтображаемыеКолонки.Добавить("НомерПолиса");	
	ОтображаемыеКолонки.Добавить("Агент");	
	ОтображаемыеКолонки.Добавить("ПоложениеБСО");	
	ОтображаемыеКолонки.Добавить("Блокировка");	
	ОтображаемыеКолонки.Добавить("Поставщик");	
	ОтображаемыеКолонки.Добавить("ОрганизацияАгент");	
	
	Параметры = Новый Структура("СК, ВидБСО", ВидБСО.Владелец, ВидБСО);
	
    Параметры.Вставить("ТекНомерБСО", НомерБСО);
	
	Параметры.Вставить("ОтображаемыеКолонки", ОтображаемыеКолонки);
	
	Если РольДоступна("ПолныеПрава")  
		ИЛИ РольДоступна("уб_СотрудникОтделаБСО") 
		Тогда
		//Параметры.Вставить("ДоступныВсеПоля", Истина);
		Параметры.Вставить("ВидБСОДоступно", Истина);
		Параметры.Вставить("ПоложениеБСОДоступно", Истина);
		Параметры.Вставить("ПодразделениеДоступно", Истина);
		Параметры.Вставить("АгентДоступно", Истина);
		Параметры.Вставить("СостояниеБСОДоступно", Истина);
		Параметры.Вставить("ОрганизацияАгентДоступно", Истина);
 	КонецЕсли;
	
	Параметры.Вставить("СообщатьЕслиНеНайдено"); //Выводить надпись о нахождении на форме при открытии	
	
	ФормаВыбора = ПолучитьОбщуюФорму("уб_ПодборБСО",Элемент);
	#Если Клиент Тогда
	ФормаВыбора.РежимВыделения = РежимВыделенияТабличногоПоля.Одиночный;
	#КонецЕсли
	ФормаВыбора.Параметры = Параметры;
	ФормаВыбора.ОткрытьМодально();
КонецПроцедуры
