
Функция ПолучитьДанныеАдреса(Объект, Вид = Неопределено,ТипАдресногоЭлемента = 999) Экспорт

	ПараметрыАК = РегистрыСведений.АдресныйКлассификатор.ПараметрыФункцииДанныеАдресногоКлассификатора();
	Если ЗначениеЗаполнено(Объект) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КИ.Поле1 КАК Индекс,
		|	КИ.Поле2 КАК Регион,
		|	КИ.Поле3 КАК Район,
		|	КИ.Поле4 КАК Город,
		|	КИ.Поле5 КАК НаселенныйПункт,
		|	КИ.Поле6 КАК Улица,
		|	КИ.Поле7 КАК Дом,
		|	КИ.Поле8 КАК Корпус,
		|	КИ.Поле9 КАК Квартира,
		|	КИ.Поле1 КАК Поле1,
		|	КИ.Поле2 КАК Поле2,
		|	КИ.Поле3 КАК Поле3,
		|	КИ.Поле4 КАК Поле4,
		|	КИ.Поле5 КАК Поле5,
		|	КИ.Поле6 КАК Поле6,
		|	КИ.Поле7 КАК Поле7,
		|	КИ.Поле8 КАК Поле8,
		|	КИ.Поле9 КАК Поле9
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КИ
		|ГДЕ
		|	КИ.Объект = &Объект
		|	И КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КИ.Вид = &Вид");
		Запрос.УстановитьПараметр("Объект", Объект);
		Запрос.УстановитьПараметр("Вид",	?(Вид = Неопределено, Справочники.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке, Вид));
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(ПараметрыАК, Выборка);
			ПараметрыАК.ТипАдресногоЭлемента = ТипАдресногоЭлемента;
			
			РегистрыСведений.АдресныйКлассификатор.ДанныеАдресногоКлассификатора(ПараметрыАК);
			
			ПараметрыАК.Представление = УправлениеКонтактнойИнформацией.СформироватьПредставлениеАдресаЗаПределамиРФ("Россия", УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Выборка));
			Если ПараметрыАК.Результат.Количество() > 0 Тогда
				КодКладраФакт = Лев(СтрЗаменить(Строка(ПараметрыАК.Результат[0]), Символ(160), "") + " общее: " + ПараметрыАК.Результат.Количество(),13);
			Иначе
				КодКладраФакт = "";
			КонецЕсли;				
			ПараметрыАК.КодКладра = КодКладраФакт;
			
			
			МасСокр = Новый Массив;
	МасСокр.Добавить(" обл");
	МасСокр.Добавить(" г");
	МасСокр.Добавить(" п");
	МасСокр.Добавить(" рп");
	МасСокр.Добавить(" нп");
	МасСокр.Добавить(" пер");
	МасСокр.Добавить(" пер");
	МасСокр.Добавить(" переезд");
	МасСокр.Добавить(" д");
	МасСокр.Добавить(" с");
	МасСокр.Добавить(" кр");
	МасСокр.Добавить(" ул");
	МасСокр.Добавить(" р-н");
	МасСокр.Добавить(" сл");
	МасСокр.Добавить(" ст");
	МасСокр.Добавить(" ст-ца");
	МасСокр.Добавить(" тер");
	МасСокр.Добавить(" аллея");
	МасСокр.Добавить(" б-р");
	МасСокр.Добавить(" въезд");
	МасСокр.Добавить(" городок");
	МасСокр.Добавить(" дор");
	МасСокр.Добавить(" заезд");
	МасСокр.Добавить(" казарма");
	МасСокр.Добавить(" кв-л");
	МасСокр.Добавить(" км");
	МасСокр.Добавить(" кольцо");
	МасСокр.Добавить(" линия");
	МасСокр.Добавить(" м");
	МасСокр.Добавить(" мкр");
	МасСокр.Добавить(" наб");
	МасСокр.Добавить(" нп");
	МасСокр.Добавить(" остров");
	МасСокр.Добавить(" п");
	МасСокр.Добавить(" п/о");
	МасСокр.Добавить(" п/р");
	МасСокр.Добавить(" п/ст");
	МасСокр.Добавить(" парк");
	МасСокр.Добавить(" пер");
	МасСокр.Добавить(" переезд");
	МасСокр.Добавить(" пл");
	МасСокр.Добавить(" платф");
	МасСокр.Добавить(" пл-ка");
	МасСокр.Добавить(" полустанок");
	МасСокр.Добавить(" починок");
	МасСокр.Добавить(" пр-кт");
	МасСокр.Добавить(" проезд");
			//Пока так
			
			Для каждого эл из ПараметрыАК Цикл
				Если Найти("Регион,Район,Город,Улица,НаселенныйПункт",Эл.Ключ)> 0 Тогда
					
					ЗначениеА = эл.Значение;
					Для каждого ЭлМас из МасСокр Цикл
						ПозСокр = Найти(ЗначениеА,ЭлМас);
						Если ПозСокр = 0 Тогда
							Продолжить;
						Иначе
							ЗначениеА = СтрЗаменить(ЗначениеА,ЭлМас,"");
							Прервать;
						КонецЕсли;
					КонецЦикла;	

					//ЗначениеА = СтрЗаменить(эл.Значение," область","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," край","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," республика","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," город","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," поселок","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," улица","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," проспект","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," район","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," проезд","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," набережная","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," тракт","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," обл","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," п","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," кр","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," г","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," ул","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," пр","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," прзд","");
					//ЗначениеА = СтрЗаменить(ЗначениеА," р-н","");
					ПараметрыАК.Вставить(Эл.Ключ,ЗначениеА);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	Возврат ПараметрыАК;

КонецФункции // ПолучитьДетально()
