Процедура СозданиеДереваЭлементовФормы() Экспорт
	
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уб_Справка.Ссылка,
	               |	уб_Справка.Наименование
	               |ИЗ
	               |	Справочник.уб_Справка КАК уб_Справка
	               |ГДЕ
	               |	НЕ уб_Справка.ЭтоГруппа
	               |	И НЕ уб_Справка.ПометкаУдаления
	               |	И (уб_Справка.Наименование ПОДОБНО ""Документ."" + ""%""
	               |			ИЛИ уб_Справка.Наименование ПОДОБНО ""Справочник."" + ""%"")";
	// ИЛИ уб_Справка.Наименование ПОДОБНО "Отчет." + "%"
	//ИЛИ уб_Справка.Наименование ПОДОБНО "Обработка." + "%"
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
			Попытка			
				ДеревоЭлементовФормы = ПолучитьДеревоЭлементовФормы(Выборка.Наименование);
				Если ЗначениеЗаполнено(ДеревоЭлементовФормы) Тогда					
					Объект = Выборка.Ссылка.ПолучитьОбъект();
					Объект.ДеревоЭлементовФормы = Новый ХранилищеЗначения(ДеревоЭлементовФормы);
					Объект.Записать();
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка при выполнении процедуры уб_СозданиеДереваЭлементовФормы для формы: " + Выборка.Наименование,
				УровеньЖурналаРегистрации.Ошибка, , ,
				ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	


Функция ПолучитьДеревоЭлементовФормы(Знач Наименование) Экспорт
	
	//Отчет.ДвиженияДокумента.Форма
	Поз=Найти(Наименование,".");			
	Если Поз>0 Тогда 
		СтрокаМенеджерОбъектов = Лев(Наименование,Поз-1);
		СтрокаОбъекта=Сред(Наименование,Поз+1);
		ПозОб=Найти(СтрокаОбъекта,".");
		Если ПозОб>0 Тогда 
			Объект=Лев(СтрокаОбъекта,ПозОб-1);
			ИмяФормы=Сред(СтрокаОбъекта,ПозОб+1);
			Если СтрокаМенеджерОбъектов="Справочник" тогда
				МенеджерОбъектов=Справочники;
			ИначеЕсли СтрокаМенеджерОбъектов="Документ" тогда
				МенеджерОбъектов=Документы;
			//ИначеЕсли СтрокаМенеджерОбъектов="Отчет" тогда
			//	МенеджерОбъектов=Отчеты;
			//ИначеЕсли СтрокаМенеджерОбъектов="Обработка" тогда
			//	МенеджерОбъектов=Обработки;
			Иначе
				Возврат Неопределено;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Попытка
		МенеджерОбъекта = МенеджерОбъектов[Объект];
	Исключение
		Возврат Неопределено;//если объект удален из конфигурации
	КонецПопытки;	
	Возврат ДеструктивныйАнализФормы(МенеджерОбъекта, ИмяФормы);
	                      
КонецФункции	

Функция ДеструктивныйАнализФормы(МенеджерОбъекта, ИмяФормы) экспорт
	ТаблицаДеструктивногоАнализа=Новый ТаблицаЗначений;
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("ИмяЭлемента",Новый ОписаниеТипов("Строка"));	
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("ТипЭлемента");	
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("Сигнатура",Новый ОписаниеТипов("Строка"));
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("Верх",Новый ОписаниеТипов("Число"));
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("Лево",Новый ОписаниеТипов("Число"));
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("Подсказка",Новый ОписаниеТипов("Строка"));	
	ТаблицаДеструктивногоАнализа.Колонки.Добавить("Данные",Новый ОписаниеТипов("Строка"));	
	
	ТаблицаПанелей=Новый ТаблицаЗначений;
	ТаблицаПанелей.Колонки.Добавить("Имя",Новый ОписаниеТипов("Строка"));
	ТаблицаПанелей.Колонки.Добавить("ИмяПанели",Новый ОписаниеТипов("Строка"));
	ТаблицаПанелей.Колонки.Добавить("Сигнатура",Новый ОписаниеТипов("Строка"));
	ТаблицаПанелей.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	ТаблицаПанелей.Колонки.Добавить("ИндексСтраницы",Новый ОписаниеТипов("Число"));
	ТаблицаПанелей.Колонки.Добавить("Верх",Новый ОписаниеТипов("Число"));
	ТаблицаПанелей.Колонки.Добавить("Лево",Новый ОписаниеТипов("Число"));
	ТаблицаПанелей.Колонки.Добавить("Подсказка",Новый ОписаниеТипов("Строка"));
	КоличествоКолонокВТаблицеПанелей = 7;//начиная с 0
	
	СписокПанелейФормы=Новый СписокЗначений;
	
	ДеревоЭлементовФормы=Новый ДеревоЗначений;
	ДеревоЭлементовФормы.Колонки.Добавить("ИмяЭлемента",Новый ОписаниеТипов("Строка"));
	ДеревоЭлементовФормы.Колонки.Добавить("ПолноеИмя",Новый ОписаниеТипов("Строка"));
	ДеревоЭлементовФормы.Колонки.Добавить("ТипЭлемента");
	ДеревоЭлементовФормы.Колонки.Добавить("Верх",Новый ОписаниеТипов("Число"));
	ДеревоЭлементовФормы.Колонки.Добавить("Лево",Новый ОписаниеТипов("Число"));
	ДеревоЭлементовФормы.Колонки.Добавить("ИндексСтраницы",Новый ОписаниеТипов("Число"));
	ДеревоЭлементовФормы.Колонки.Добавить("Подсказка",Новый ОписаниеТипов("Строка"));
	ДеревоЭлементовФормы.Колонки.Добавить("Данные",Новый ОписаниеТипов("Строка"));	
	
	Корень=ДеревоЭлементовФормы.Строки.Добавить();	
	Корень.ИмяЭлемента="ЭтаФорма";
	Корень.ПолноеИмя="ЭтаФорма";
	//Корень.ТипЭлемента=Тип("Форма");	
	Попытка
		тФорма=МенеджерОбъекта.ПолучитьФорму(ИмяФормы, ,Новый УникальныйИдентификатор());
		Если тФорма = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Корень.ТипЭлемента = ТипЗнч(тФорма);
	Для каждого Элем из тФорма.ЭлементыФормы Цикл
		тТип=ТипЗнч(Элем);
		Если тТип=Тип("Панель") Тогда
			СписокПанелейФормы.Добавить(Элем.Имя);
			пан=ТаблицаПанелей.Добавить();
			пан.Имя=Элем.Имя;
			
			пан.Верх=Элем.Верх;
			пан.Лево=Элем.Лево;
			
			пан.ИмяПанели="";
			ИндексСтраницы = 1;
			Для каждого Страница Из Элем.Страницы Цикл
				СписокПанелейФормы.Добавить(Элем.Имя+"_"+Страница.Имя,Элем.Имя+"."+Страница.Имя);
				пан=ТаблицаПанелей.Добавить();
				пан.Имя=Страница.Имя;
				пан.ИмяПанели=Элем.Имя;
				пан.Верх = Элем.Верх;
				пан.Лево = Элем.Лево;
				пан.ИндексСтраницы = ИндексСтраницы;
				ИндексСтраницы = ИндексСтраницы + 1;
			КонецЦикла;	
		Иначе	
			стр=ТаблицаДеструктивногоАнализа.Добавить();
			Попытка
				стр.ИмяЭлемента=Элем.Имя;						
				стр.ТипЭлемента=тТип;
				стр.Верх = Элем.Верх;
				стр.Лево = Элем.Лево;
				стр.Данные=Элем.Данные;
				стр.Подсказка = Элем.Подсказка;
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого пан из СписокПанелейФормы Цикл
		ТаблицаДеструктивногоАнализа.Колонки.Добавить(пан.Значение,Новый ОписаниеТипов("Число"));	
		ТаблицаПанелей.Колонки.Добавить(пан.Значение,Новый ОписаниеТипов("Число"));	
	КонецЦикла;		
	Для каждого пан из СписокПанелейФормы Цикл
		тФорма=Неопределено;
		тФорма=МенеджерОбъекта.ПолучитьФорму(ИмяФормы, ,Новый УникальныйИдентификатор());
		тЭлементыФормы=тФорма.ЭлементыФормы;
		тПоз=Найти(пан.Представление,".");
		Если тПоз>0 Тогда // это страница панели
			тИмяПанели=Лев(пан.Значение,тПоз-1);
			тИмяСтраницы=Сред(пан.Значение,тПоз+1);
			фПанель=тЭлементыФормы[тИмяПанели];
			фСтраница=фПанель.Страницы.Найти(тИмяСтраницы);
			Если фСтраница<>неопределено Тогда
				ИмяСтраницы = фСтраница.Имя;
				ЗаголовокСтраницы = фСтраница.Заголовок;
				ФПанель.Страницы.Добавить(ИмяСтраницы,ЗаголовокСтраницы);
				фПанель.Страницы.Удалить(фСтраница); 
				тФорма.УстановитьДействие("ОбновлениеОтображения",Неопределено);
				//фПанель.Страницы.Удалить(фСтраница);	
			КонецЕсли;	
		Иначе	
			тЭлементыФормы.Удалить(тЭлементыФормы[пан.Значение]);
		КонецЕсли;	
		ТаблицаДеструктивногоАнализа.ЗаполнитьЗначения(0,пан.Значение);
		ТаблицаПанелей.ЗаполнитьЗначения(0,пан.Значение);
		Для каждого Элем из ТаблицаДеструктивногоАнализа Цикл
			Попытка
				тЭлем=тЭлементыФормы[Элем.ИмяЭлемента];
			Исключение
				Элем[пан.Значение]=1;
			КонецПопытки;	
		КонецЦикла;				
		Для каждого Элем из ТаблицаПанелей Цикл
			тИмяЭлемента=Элем.Имя;
			ЭтоСтраница=Ложь;
			Если Элем.ИмяПанели<>"" Тогда // это страница панели
				ЭтоСтраница=Истина;
				тИмяЭлемента=Элем.ИмяПанели+"_"+Элем.Имя;
				Если пан.Значение=Элем.ИмяПанели Тогда
					Элем[пан.Значение]=1;	
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			Если пан.Значение=тИмяЭлемента Тогда
				Элем[пан.Значение]=1;	
				Продолжить;
			КонецЕсли;	
			тПоз=Найти(пан.Представление,".");
			Если тПоз>0 Тогда // это страница панели
				тИмяПанели=Лев(пан.Значение,тПоз-1);
				Если тИмяПанели=Элем.Имя Тогда
					Продолжить;
				КонецЕсли;		
			КонецЕсли;	
			
			Если ЭтоСтраница Тогда // это страница панели
				Попытка	
					фПанель=тЭлементыФормы[Элем.ИмяПанели];
					фСтраница=фПанель.Страницы.Найти(Элем.Имя);
				Исключение
					фСтраница=неопределено;
				КонецПопытки;			
				Если фСтраница=неопределено Тогда
					Элем[пан.Значение]=1;	
				КонецЕсли;	
			Иначе	
				Попытка
					тЭлем=тЭлементыФормы[Элем.Имя];
				Исключение
					Элем[пан.Значение]=1;
				КонецПопытки;	
			КонецЕсли;	
		КонецЦикла;				
	КонецЦикла;
	колстр=ТаблицаДеструктивногоАнализа.Количество();
	Для СчСтр=1 по колстр Цикл
		текСтр=ТаблицаДеструктивногоАнализа[колстр-СчСтр];
		тСигнатура="";
		тСумма=0;
		Для каждого пан из СписокПанелейФормы Цикл
			тСигнатура=тСигнатура+текСтр[пан.Значение];
			тСумма=тСумма+текСтр[пан.Значение];
		Конеццикла;			
		текСтр.Сигнатура=тСигнатура;
		Если тСумма=0 Тогда
			тЭлемент=Корень.Строки.Добавить();
			тЭлемент.ИмяЭлемента=текСтр.ИмяЭлемента;
			тЭлемент.Данные=текСтр.Данные;
			тЭлемент.ПолноеИмя=текСтр.ИмяЭлемента;
			тЭлемент.ТипЭлемента=текСтр.ТипЭлемента;
			тЭлемент.Верх=текСтр.Верх;
			тЭлемент.Лево=текСтр.Лево;
			тЭлемент.Подсказка = текСтр.Подсказка;
			ТаблицаДеструктивногоАнализа.Удалить(текСтр);
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого стр из ТаблицаПанелей Цикл
		тСигнатура="";
		тСумма=0;
		Для каждого пан из СписокПанелейФормы Цикл
			тСигнатура=тСигнатура+стр[пан.Значение];
			тСумма=тСумма+стр[пан.Значение];
		Конеццикла;			
		стр.Сигнатура=тСигнатура;
		стр.Сумма=тСумма;
	Конеццикла;	
	ТаблицаПанелей.Сортировать("Сумма");//индексстраницы
	Для каждого стр из ТаблицаПанелей Цикл
		тДлинаСигнатуры=СтрДлина(стр.Сигнатура);
		тСигнатура=стр.Сигнатура;
		тСумма=стр.Сумма;
		тРодитель=Корень;
		Если тСумма>1 Тогда
			Для тПоз=1 по тДлинаСигнатуры Цикл
				тФлаг=Сред(тСигнатура,тПоз,1);
				Если тФлаг="0" Тогда
					Продолжить;
				КонецЕсли;
				тИмяПанелиРодителя=ТаблицаПанелей.Колонки[КоличествоКолонокВТаблицеПанелей+тПоз].Имя;//тИмяПанелиРодителя=ТаблицаПанелей.Колонки[3+тПоз].Имя;
				Если стр.ИмяПанели="" Тогда
					тИмяСтроки=стр.Имя;
				Иначе
					тИмяСтроки=стр.ИмяПанели+"_"+стр.Имя;
				КонецЕсли;	
				Если тИмяСтроки=тИмяПанелиРодителя Тогда
					Продолжить;
				КонецЕсли;	
				мРодитель=Корень.Строки.Найти(тИмяПанелиРодителя,"ПолноеИмя",Истина);
				Если мРодитель<>неопределено Тогда
					Если мРодитель.Уровень()>тРодитель.Уровень() Тогда
						тРодитель=мРодитель;
					КонецЕсли;			
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		тПанель=тРодитель.Строки.Добавить();
		тПанель.ИмяЭлемента=стр.Имя;
		тПанель.Подсказка=стр.Подсказка;		
		тПанель.ПолноеИмя=стр.Имя;
		тПанель.Верх=стр.Верх;
		тПанель.Лево=стр.Лево;
		тПанель.ТипЭлемента=Тип("Панель"); //!!!! добавили панель в дерево
		Если стр.ИмяПанели<>"" Тогда
			тПанель.ТипЭлемента=Тип("СтраницаПанели");
			тПанель.ПолноеИмя=стр.ИмяПанели+"_"+стр.Имя;
		КонецЕсли;	
		
	КонецЦикла;			
	
	Для каждого Элем из ТаблицаДеструктивногоАнализа Цикл
		сСигнатура=Элем.Сигнатура;
		эПанель=ТаблицаПанелей.Найти(сСигнатура,"Сигнатура");
		тРодитель=Корень;
		Если эПанель<>неопределено Тогда
			ИмяСтрокиДерева=эПанель.Имя;
			Если эПанель.ИмяПанели<>"" Тогда
				ИмяСтрокиДерева=эПанель.ИмяПанели+"_"+эПанель.Имя;
			КонецЕсли;		
			эСтрока=Корень.Строки.Найти(ИмяСтрокиДерева,"ПолноеИмя",Истина);
			Если эСтрока<>неопределено Тогда
				тРодитель=эСтрока;
			Конецесли;
			тРодитель.ИндексСтраницы = эПанель.ИндексСтраницы;
		КонецЕсли;
		тЭлемент=тРодитель.Строки.Добавить();
		тЭлемент.ИмяЭлемента=Элем.ИмяЭлемента;
		тЭлемент.Данные=Элем.Данные;
		тЭлемент.ПолноеИмя=Элем.ИмяЭлемента;
		тЭлемент.ТипЭлемента=Элем.ТипЭлемента;
		тЭлемент.Подсказка=Элем.Подсказка;
		
		тЭлемент.Верх=Элем.Верх;
		тЭлемент.Лево=Элем.Лево;
	КонецЦикла;
	ДеревоЭлементовФормы.Строки.Сортировать("Верх Возр, Лево Возр, ИндексСтраницы Возр", Истина);
	ДеревоЭлементовФормы.Колонки.Удалить(ДеревоЭлементовФормы.Колонки.Верх);
	ДеревоЭлементовФормы.Колонки.Удалить(ДеревоЭлементовФормы.Колонки.Лево);
	ДеревоЭлементовФормы.Колонки.Удалить(ДеревоЭлементовФормы.Колонки.ИндексСтраницы);	
	Возврат ДеревоЭлементовФормы;
КонецФункции

