&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьДанные();
КонецПроцедуры



&НаКлиенте
Процедура _ОтделПриИзменении(Элемент)
	Элементы.ТаблицаСотрудников.ОтборСтрок = ?(ЗначениеЗаполнено(_Отдел),Новый ФиксированнаяСтруктура("Подразделение", _Отдел),Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Кошельки(Команда)
	ОткрытьФорму("Справочник.Кошельки.Форма.ФормаСписка",Новый Структура("Отбор",Новый Структура("ЭтоКартаСотрудника",Истина)));
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого Идентификатор из Элементы.ТаблицаСотрудников.ВыделенныеСтроки Цикл
		ТекущаяСтрокаСотрудник = ТаблицаСотрудников.НайтиПоИдентификатору(Идентификатор);
		Для каждого ЭлементСписка из ЭтаФорма.СписокКартДляВыбора Цикл
			ЭлементСписка.Пометка = Ложь;
			УдалитьКарту(ЭлементСписка.Значение,ТекущаяСтрокаСотрудник);
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для каждого Идентификатор из Элементы.ТаблицаСотрудников.ВыделенныеСтроки Цикл
		ТекущаяСтрокаСотрудник = ТаблицаСотрудников.НайтиПоИдентификатору(Идентификатор);
		Для каждого ЭлементСписка из ЭтаФорма.СписокКартДляВыбора Цикл
			ЭлементСписка.Пометка = Истина;
			ДобавитьКарту(ЭлементСписка.Значение,ТекущаяСтрокаСотрудник);
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецКартПриИзменении(Элемент)
	ТаблицаСотрудниковПриАктивизацииСтроки(Элемент);
КонецПроцедуры




&НаКлиенте
Процедура СписокКартДляВыбораПометкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокКартДляВыбора.ТекущиеДанные;
	Для каждого Идентификатор из Элементы.ТаблицаСотрудников.ВыделенныеСтроки Цикл
		ТекущаяСтрокаСотрудник = ТаблицаСотрудников.НайтиПоИдентификатору(Идентификатор);
		Если ТекущаяСтрока.Пометка Тогда
			ДобавитьКарту(ТекущаяСтрока.Значение,ТекущаяСтрокаСотрудник);
		Иначе
			УдалитьКарту(ТекущаяСтрока.Значение,ТекущаяСтрокаСотрудник);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСотрудниковПриАктивизацииСтроки(Элемент)
	
	Карты = Карты(ВладелецКарт);
	
	СписокКартДляВыбора.Очистить();
	ТекущаяСтрокаСотрудник = Элементы.ТаблицаСотрудников.ТекущиеДанные;
	Для каждого СтрокаКарты из Карты Цикл
		Пометка = НЕ ТекущаяСтрокаСотрудник.СписокКарт.НайтиПоЗначению(СтрокаКарты.Карта) = Неопределено;
		
		СписокКартДляВыбора.Добавить(СтрокаКарты.Карта,,Пометка);
		
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ИнициализироватьДанные()
	ПараметрыПодчиненных = уб_СС.СтруктураПараметровФункцииПодчиненныеРуководителяПоУмолчанию();
	//ПараметрыПодчиненных.ВключаяВыбывших 	= Истина;		
	ПараметрыПодчиненных.ТипРезультата = "тз";
	Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду("000003861");
	
	ТаблицаСотрудников.Очистить();
	Для каждого СтрокаСотрудника из уб_СС.ПодчиненныеРуководителя(Сотрудник,КонецМесяца(ТекущаяДата()), ПараметрыПодчиненных) Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСотрудников.Добавить(),СтрокаСотрудника);
	КонецЦикла;	
	//ТаблицаСотрудников.Загрузить();
	
	ВсеКарты = Уб_Серверные.КартыСотрудники();
	Для каждого СтрокаСотрудника из ТаблицаСотрудников Цикл
		СтрокаСотрудника.СписокКарт.Очистить();
		нСТроки = ВсеКарты.НайтиСтроки(Новый Структура("Сотрудник",СтрокаСотрудника.Сотрудник));
		Для каждого СтрокаКарты из нСТроки Цикл
			СтрокаСотрудника.СписокКарт.Добавить(СтрокаКарты.Карта);
		КонецЦикла;
	КонецЦикла;	
	
	Элементы.ВладелецКарт.СписокВыбора.ЗагрузитьЗначения(Владельцы());
	
КонецПроцедуры	



Функция Карты(Владелец)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Кошельки.Сотрудник КАК Владелец,
	|	Кошельки.НомерТелефона,
	|	Кошельки.НомерКарты, Ссылка как Карта
	|ИЗ
	|	Справочник.Кошельки КАК Кошельки
	|ГДЕ
	|	Кошельки.Актуальность
	|	И Кошельки.ЭтоКартаСотрудника
	|	И (Кошельки.Сотрудник = &Владелец
	|			ИЛИ &Владелец = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Владелец",Владелец);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция Владельцы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Кошельки.Сотрудник КАК Владелец
	|ИЗ
	|	Справочник.Кошельки КАК Кошельки
	|ГДЕ
	|	Кошельки.Актуальность
	|	И Кошельки.ЭтоКартаСотрудника
	|	И НЕ Кошельки.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Кошельки.Сотрудник.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Владелец");
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьКарту(Карта,СтрокаСотрудника)
	Если ДобавитьКартуНаСервере(Карта,СтрокаСотрудника.Сотрудник) Тогда
		Если СтрокаСотрудника.СписокКарт.НайтиПоЗначению(Карта) = Неопределено Тогда
			СтрокаСотрудника.СписокКарт.Добавить(Карта);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ДобавитьКартуНаСервере(Карта, Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	ОбъектКарта = Карта.ПолучитьОбъект();
	Если ОбъектКарта.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник",Сотрудник)).Количество() = 0  Тогда
		НоваяСтрока= ОбъектКарта.Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЕсли;
	ОбъектКарта.Записать();
	Возврат Истина
КонецФункции

&НаКлиенте
Процедура УдалитьКарту(Карта,СтрокаСотрудника)
	
	Если УдалитьКартуНаСервере(Карта,СтрокаСотрудника.Сотрудник) Тогда
		НайденнноеЗначение =СтрокаСотрудника.СписокКарт.НайтиПоЗначению(Карта);
		Если НЕ НайденнноеЗначение = Неопределено Тогда
			СтрокаСотрудника.СписокКарт.Удалить(НайденнноеЗначение);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция УдалитьКартуНаСервере(Карта, Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	ОбъектКарта = Карта.ПолучитьОбъект();
	Пока НЕ ОбъектКарта.Сотрудники.Найти(Сотрудник) = Неопределено  Цикл
		ОбъектКарта.Сотрудники.Удалить(ОбъектКарта.Сотрудники.Найти(Сотрудник));
	КонецЦикла;
	ОбъектКарта.Записать();
	Возврат Истина
КонецФункции





