//TODO упразднить реквизит СтрокаРеквизитов для этой функции
//Результат: Истина - были перепроведены какие либо объекты, либо изменены статусы заявок
//	иначе Ложь
Функция ВыполнитьДействиеПоЗаявке(
	Заявка, 
	ТекСтатус				= Неопределено, 
	Действие, 
	СтрокаРеквизитов 		= Неопределено, 
	Знач МассивРолей		= Неопределено, 
	ТекстКоманды 			= "",
	ТребуетсяВозвратБСО		= Неопределено,
	ФормаИлиОбъектЗаявки	= Неопределено,
	Комментарий				= "",
	Предупреждать			= Истина
	) Экспорт
	//

	Результат = Ложь;
	ЭтоФорма = ФормаИлиОбъектЗаявки <> Неопределено и ТипЗнч(ФормаИлиОбъектЗаявки) = Тип("УправляемаяФорма");
	Если МассивРолей = Неопределено Тогда
		МассивРолей = уб_УСЗ.ПолучитьРольПользователяДляЗаявок(, Истина)
	КонецЕсли;
	//Если СтрокаРеквизитов = Неопределено Тогда
	//	СтрокаРеквизитов = уб_УСЗ.ПолучитьРеквизитыЗаявки(Заявка);
	//КонецЕсли;
	Если 
		(ТекСтатус = Неопределено Или ТекСтатус = ПредопределенноеЗначение("Перечисление.уб_СтатусыЗаявок.ПустаяСсылка"))
		И Действие <> "ПроверитьБСО" //TODO некоторым действиям статус не нужен
		Тогда
		Попытка
			Если Заявка.Дата < Дата(2012,6,5) Тогда
				_Оповестить("Консоль"," "+ Заявка + " до 05.06.12");
				Если Предупреждать Тогда
				#Если клиент Тогда
					Предупреждение("Действия над заявками до 05.06.12 не производятся",1);
				#КонецЕсли
				КонецЕсли;
				Возврат Ложь;
			КонецЕсли;	
		Исключение	
			_Оповестить("Консоль","" + Заявка + " не доступна!");
		КонецПопытки;
	КонецЕсли;
	//Статусы = ПредопределенноеЗначение("Перечисление.уб_СтатусыЗаявок;	
	Если Не ПустаяСтрока(ТекстКоманды) И Найти("ВнестиИзменения,СтруктураПодчиненности,ПоказатьТаблицуБСО,ИзменитьКурьера,СоздатьПеремещениеБСО,СоздатьПриемкуОплат,ПроверитьБСО,ИсторияЗаявки,", Действие + ",") = 0 Тогда
		//Остальные действия производятся с подтверждением
		Если Предупреждать Тогда
		#Если Клиент Тогда
			КомандаПодсказки ="
			|Ш Подсказка о подтверждении действия
			|Р Требуется ваш ответ в диалоге
			|НП
			|СС Если нажмёте «Да» действие будет выполнено
			|СС Если нажмёте «Нет» или «Отмена» - никаких действий не будет произведено
			|КП
			|П";
			_Оповестить("Подсказка", КомандаПодсказки);
			Ответ = Вопрос(ТекстКоманды + "?", РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Нет, "Подтверждение действия:",КодВозвратаДиалога.Нет);
			Если Не Ответ = КодВозвратаДиалога.Да  Тогда
				_Оповестить("Консоль", "Не получено подтверждение для выполнения действия «" + ТекстКоманды + "»");
				Возврат Ложь;
			КонецЕсли;	
		#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(Действие) Тогда
	ИначеЕсли Действие = "ВнестиИзменения" Тогда 
		//Обработка = Обработки.уб_СтатусыЗаявок;
		//Форма = Обработка.ПолучитьФорму("ВнестиИзменения");
		//Форма.Заявка = Заявка;
		//СписокРолей = Новый СписокЗначений;
		//СписокРолей.ЗагрузитьЗначения(МассивРолей);
		//Форма.СписокРолей = СписокРолей;
		//Форма.ОткрытьМодально();
		//_Оповестить("Консоль","Открытие формы «Внести изменения»");
		//флВремяМесто       = Форма.флВремяМесто;
		//флИзменениеКурьера = Форма.флИзменениеКурьера; 
		//флСоставБСО        = Форма.флСоставБСО;
		//Комментарий = Форма.Комментарий;
		//Если Не (флВремяМесто Или флИзменениеКурьера Или флСоставБСО) Тогда
		//	_Оповестить("Консоль","Ничего не отмечено.");
		//Иначе
		//	Если флВремяМесто Или флИзменениеКурьера Тогда
		//		//флаг утверждено надо исправлять?
		//		НовыйДействие 	= "УстановитьСтатус_НазначениеКурьера";
		//		НовыйСтатус		= "НазначениеКурьера";
		//	ИначеЕсли флСоставБСО Тогда	
		//		НовыйДействие 	= "УстановитьСтатус_ФормированиеКомплектаБСО";
		//		НовыйСтатус		= "ФормированиеКомплектаБСО";
		//	Иначе 
		//		НовыйДействие = Неопределено;	
		//	КонецЕсли;	
		//	Если НовыйДействие <> Неопределено Тогда	
		//		Доработка = Истина;
		//		Результат = ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, НовыйДействие, СтрокаРеквизитов, ТекстКоманды, ТребуетсяВозвратБСО, ФормаИлиОбъектЗаявки);
		//		Если Результат Тогда
		//			Если Не ЕстьРоль("Менеджер", МассивРолей) Тогда
		//				Уведомление("Изменился статус: " + НовыйСтатус, "Менеджер", Заявка, "Изменился статус");
		//			КонецЕсли;
		//			Если Не ЕстьРоль("РСВС",МассивРолей) Тогда
		//				Уведомление("Изменился статус: " + НовыйСтатус, "РСВС", Заявка, "Изменился статус");
		//			КонецЕсли;
		//			Если Не ЕстьРоль("сБСО", МассивРолей) и флСоставБСО  Тогда
		//				Уведомление("Изменился статус: " + НовыйСтатус + ", требуется расформировать комплект БСО ", "сБСО", Заявка, "Расформировать");
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	ИначеЕсли Действие = "ИзменитьКурьера" Тогда 
		//РСВС при замене курьера, без изменения комплекта БСО 
		КурьерДо = Заявка.Курьер;
		Форма = Заявка.ПолучитьФорму();
		//TODO заявка при изменении должна
		Форма.ОткрытьМодально();
		_Оповестить("Консоль", "Открытие формы заявки для изменения курьера");
		КурьерПосле = Заявка.Курьер;
		Если КурьерДо <> КурьерПосле Тогда
			уб_усз.Уведомление("Поменялся курьер в заявке: " + Заявка + " " + КурьерДо + "/" + КурьерПосле, "сБСО", Заявка, "Изменился курьер");
		КонецЕсли;	
	ИначеЕсли Действие = "ПоказатьТаблицуБСО" Тогда 
		
		АдресВХранилище = уб_УСЗ.ПолучитьТаблицуБСОПоЗаявке(Заявка,,ИСТИНА,Истина);
		Если НЕ АдресВХранилище = "" Тогда
			ОткрытьФорму("ОбщаяФорма.уб_ФормаПросмотраТЗУправляемая",Новый Структура("АдресТаблицыЗначений",АдресВХранилище));
		КонецЕсли;	
		//#Если Клиент Тогда
		//	//TODO получать все реквизиты и дополнительные данные по заявке в одном запросе
		//	//или передавать полученные ранее
		//	Запрос = Новый Запрос(
		//	"ВЫБРАТЬ
		//	|	З.Номер,
		//	|	З.Курьер
		//	|ИЗ
		//	|	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК З
		//	|ГДЕ
		//	|	З.Ссылка = &Ссылка");
		//	Запрос.УстановитьПараметр("Ссылка", Заявка);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Форма = Обработки.уб_СтатусыЗаявок.ПолучитьФорму("ФормаТаблицыБСО");
		//		Форма.Заявка 	= Заявка;
		//		Форма.Заголовок = "Таблица БСО по заявке № " + Выборка.Номер + " " + Выборка.Курьер;
		//		Форма.Открыть();
		//	КонецЕсли;
		//#КонецЕсли
	ИначеЕсли Действие = "СоздатьПеремещениеБСО" Тогда 
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		//сБСО
		Отказ 			= Ложь;
		ЗадаватьВопрос 	= Истина;
		МассивПеремещений = Новый Массив;
		Если уб_УСЗ.ЕстьПеремещениеПоЗаявке(Заявка,, МассивПеремещений) Тогда
			
				КомандаПодсказки ="
				|Ш Подсказка для заявки № "+Заявка.Номер+"
				|Р Требуется ваш ответ в диалоге
				|НП
				|СС Если нажмёте «Да»  - Откроется существующий документ
				|СС «Нет» - Откроется диалог создания нового документа Перемещение БСО
				|СС «Отмена» - никаких действий не будет произведено
				|КП
				|П";
				_Оповестить("Подсказка",КомандаПодсказки);
				Ответ = Вопрос("Открыть документ? (Да - Откроется существующий документ, Нет - создаем новый документ, Отмена - никаких действий",РежимДиалогаВопрос.ДаНетОтмена,,,"Уже есть созданный документ 'Перемещение БСО'");
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Если МассивПеремещений.Количество() = 1 Тогда
						ВыбПеремещение = МассивПеремещений[0];
					Иначе
						ВыбПеремещение = уб_УСЗ.ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
					КонецЕсли;	
					Если ВыбПеремещение <> Неопределено Тогда
						ВыбПеремещение.ПолучитьФорму().Открыть();
						_Оповестить("Консоль","Открыто существующее перемещение " + ВыбПеремещение + " по :" + Заявка.Номер);
					Иначе
						ЗадаватьВопрос  = Ложь;
					КонецЕсли;
				ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
					ЗадаватьВопрос  = Ложь;
				Иначе
					_Оповестить("Консоль", "Отмена создания перемещения при уже существующем по :" + Заявка.Номер);
					Отказ = Истина;
				Конецесли;	
			
		КонецЕсли;
		Если ЗадаватьВопрос Тогда
		
			КомандаПодсказки ="
			|Ш Подсказка для заявки № " + Заявка.Номер + "
			|Р Требуется Ваш ответ в диалоге
			|НП
			|СС Если нажмёте «Да»  - Откроется диалог создания нового документа Перемещение БСО
			|СС «Нет» - никаких действий не будет произведено
			|П";
			_Оповестить("Подсказка", КомандаПодсказки);
			Ответ = Вопрос(ТекстКоманды + "?", РежимДиалогаВопрос.ДаНет,,, "Подтверждение действия:");
			Если Не Ответ = КодВозвратаДиалога.Да Тогда
				_Оповестить("Консоль", "Не получено подтверждение для выполнения действия «" + ТекстКоманды + "»");
				Возврат Ложь;
			КонецЕсли;	
			
		КонецЕсли;
		Если Не Отказ Тогда
			нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("Документ",	Заявка);
			СтруктураЗаполнения.Вставить("Проверять",	Ложь);
			нДокумент.Заполнить(СтруктураЗаполнения);
			нДокумент.ПолучитьФорму().Открыть();
			_Оповестить("Консоль", "Создано перемещение на основании заявки № " + Заявка.Номер);
		КонецЕсли;
		#КонецЕсли
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_Возврат" Тогда 
		//сБСО
		МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Заявка);
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			ВыбПеремещение = уб_УСЗ.ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		//нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		//нДокумент.Заполнить(ВыбПеремещение);
		//Форма = нДокумент.ПолучитьФорму();
		//Форма.Открыть();
		//ТекстОповещения = "Создано перемещение";
		//Если ВыбПеремещение <> Неопределено Тогда
		//	ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		//КонецЕсли;
		//_Оповестить("Консоль", ТекстОповещения);
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратНеСостоялась" Тогда 
		//сБСО
		МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			//ВыбПеремещение  = ВыбратьПеремещениеИзМассива(МассивПеремещений);
			ВыбПеремещение = уб_УСЗ.ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		//нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		//нДокумент.Заполнить(ВыбПеремещение);
		//КомандаПодсказки = "
		//|Ш Подсказка для заявки № " + Заявка.Номер + "
		//|Р «Возврат БСО. Страховка не состоялась»				
		//|НН
		//|СС Проверьте состав БСО
		//|СС После проведения и закрытия документа для Заявки "+ Заявка.Номер +" будет установлен статус «Страховка не состоялась»
		//|СС Затем в заявке автоматически будет изменен курьер, если это необходимо.
		//|КН
		//|П
		//|Ж";//Ждем 
		//_Оповестить("Подсказка", КомандаПодсказки);
		//Форма  = нДокумент.ПолучитьФорму();
		//Форма.Заголовок = "Проверьте состав БСО. После проведения и закрытия для Заявки "+ Заявка.Номер +" будет установлен статус «Страховка не состоялась»";
		//Форма.ОткрытьМодально();
		_Оповестить("Подсказка",	"НЖ");
		ТекстОповещения = "Создано перемещение";
		Если ВыбПеремещение <> Неопределено Тогда
			ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		КонецЕсли;
		_Оповестить("Консоль",	ТекстОповещения);	
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратЗаменаБСО" Тогда 
		//сБСО
		МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 1 Тогда
			ВыбПеремещение = МассивПеремещений[0];
		ИначеЕсли ВсегоПеремещений > 1 Тогда
			//ВыбПеремещение = ВыбратьПеремещениеИзМассива(МассивПеремещений);
			ВыбПеремещение = уб_УСЗ.ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		КонецЕсли;
		//нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		//нДокумент.Заполнить(ВыбПеремещение);
		//КомандаПодсказки ="
		//|Ш Подсказка для заявки № " + Заявка.Номер + "
		//|Р «Возврат БСО. Страховка не состоялась»				
		//|НН
		//|СС Проверьте состав БСО
		//|СС После проведения и закрытия документа для Заявки "+Заявка.Номер +" будет установлен статус «Формирование комплекта БСО»
		//|КН
		//|П
		//|Ж";//Ждем 
		//_Оповестить("Подсказка",КомандаПодсказки);
		//Форма  = нДокумент.ПолучитьФорму();
		//Форма.Заголовок = "Проверьте состав БСО. После проведения и закрытия для Заявки " + Заявка.Номер + " будет установлен статус «Формирование комплекта БСО». ";
		//Форма.ОткрытьМодально();
		//_Оповестить("Подсказка","НЖ");
		//ТекстОповещения = "Создано перемещение";
		//Если ВыбПеремещение <> Неопределено Тогда
		//	ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		//КонецЕсли;
		//_Оповестить("Консоль", ТекстОповещения);
		//Если Не нДокумент.Ссылка.Пустая() Тогда
		//	Комментарий = "Возврат/замена";
		//	Результат = ВыполнитьДействиеПоЗаявке(Заявка, ТекСтатус, "УстановитьСтатус_ФормированиеКомплектаБСО", СтрокаРеквизитов, МассивРолей, ТекстКоманды, ТребуетсяВозвратБСО, ФормаИлиОбъектЗаявки, Комментарий, Ложь);
		//	Если Результат Тогда
		//		_Оповестить("Консоль", "Установлен статус Формирование комплекта БСО:" + Заявка);
		//	КонецЕсли;
		//	нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		//	нДокумент.Заполнить(Заявка);
		//	Форма = нДокумент.ПолучитьФорму();
		//	Форма.Заголовок = "Измените/Добавьте БСО по замене";
		//	Форма.Открыть();
		//КонецЕсли;	
	ИначеЕсли Действие = "СоздатьПеремещениеБСО_ВозвратЗаменаКурьера" Тогда 
		//МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Заявка);//Фильтровать по курьеру?
		//ВсегоПеремещений = МассивПеремещений.Количество();
		//Если ВсегоПеремещений = 1 Тогда
		//	ВыбПеремещение = МассивПеремещений[0];
		//ИначеЕсли ВсегоПеремещений > 1 Тогда
		//	ВыбПеремещение = уб_УСЗ.ВыбратьПеремещениеПоЗаявке(Заявка.Номер);
		//КонецЕсли;
		//нДокумент = Документы.уб_ПеремещениеБСО.СоздатьДокумент();
		//нДокумент.Заполнить(ВыбПеремещение);
		//КомандаПодсказки = "
		//|Ш Подсказка для заявки № "+Заявка.Номер+"
		//|Р «Замена курьера»				
		//|НН
		//|СС Проверьте состав БСО
		//|СС Измените «Агента куда» на нового курьера
		//|СС После проведения и закрытия для Заявки "+Заявка.Номер +" будет установлен статус «БСО на руках у курьера»
		//|СС Затем в заявке автоматически будет изменен курьер, если это необходимо.
		//|КН
		//|П
		//|Ж";//Ждем 
		//_Оповестить("Подсказка", КомандаПодсказки);
		//Форма = нДокумент.ПолучитьФорму();
		//Форма.Заголовок = "Проверьте состав БСО. Измените «Агента куда» на нового курьера. После проведения и закрытия для Заявки " + Заявка.Номер + " будет установлен статус «БСО на руках», и в заявке будет заменен курьер.";
		//Форма.ОткрытьМодально();
		//_Оповестить("Подсказка",	"НЖ"); //"Не ждем" Разрешаем прочий вывод
		//ТекстОповещения = "Создано перемещение";
		//Если ВыбПеремещение <> Неопределено Тогда
		//	ТекстОповещения = ТекстОповещения + " на основании перемещения № " + ВыбПеремещение.Номер;
		//КонецЕсли;
		//_Оповестить("Консоль",	ТекстОповещения);
	ИначеЕсли Действие = "СтруктураПодчиненности" Тогда
		//РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Заявка);
		ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненностиУправляемая",Новый Структура("ДокументСсылка",Заявка))
	ИначеЕсли Действие = "ИсторияЗаявки" Тогда	
		
		
		ФормаОтчёта = ПолучитьФорму("Отчет.ИсторияЗаявки.Форма.ФормаОтчетаУправляемая");
		КомпоновщикНастроек = ФормаОтчёта.Отчет.КомпоновщикНастроек;
		
		УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, "Заявка", Заявка);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючВарианта", "Основной");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
		
		ОткрытьФорму("Отчет.ИсторияЗаявки.Форма.ФормаОтчетаУправляемая", ПараметрыФормы);

		
		Попытка
			//Отчет = Отчеты.ИсторияЗаявки.Создать();
			//ФормаОтчета = Отчет.ПолучитьФорму();
			//ФормаОтчета.Заявка = Заявка;
			//ФормаОтчета.Открыть();
		Исключение
		КонецПопытки; 		
	ИначеЕсли Действие = "СоздатьПриемкуОплат" Тогда 
		//Кассир
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭтоЕОСАГО = Ложь;
		БСО = уб_УСЗ.ЗапросПоБСОВМассив(Заявка);
		Если БСО.Количество() > 0 Тогда
			СуммаВзноса = 0;
			СуммаПрочих = 0;
			СуммаЕОсаго = 0;
			УИДПРОЧИХ="";
			Для каждого Строка из БСО Цикл
				СуммаВзноса = СуммаВзноса + Строка.ИтогСтраховаяПремия;
				Если Строка.ЭтоКорень Тогда
					Если Строка(Строка.ВидБСО) = "Е-ОСАГО" Тогда
						ЭтоЕОСАГО = Истина;
						УИДПРОЧИХ = Строка.УидСтроки;
						СуммаЕОсаго = СуммаЕОсаго+ Строка.ИтогСтраховаяПремия;
					КонецЕсли;	
				Иначе
					Если Строка.УидРодителя = УИДПРОЧИХ Тогда
						СуммаПрочих = СуммаПрочих + Строка.ИтогСтраховаяПремия;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
			Если ЭтоЕОСАГО = Истина Тогда
				//Сообщить(СуммаВзноса);
				//Сообщить(СуммаПрочих);
				Форма = ПолучитьФорму("Документ.уб_ПриемкаОплат.Форма.ФормаДокумента");
				нДокумент = Документы.уб_ПриемкаОплат.СоздатьДокумент();
				
				нДокумент.ПринятоОТ = Заявка.Менеджер;
				
				СтрокаП = нДокумент.Платежи.Добавить();
				СтрокаП.УИДСтроки    = Новый УникальныйИдентификатор;
				СтрокаП.ФормаОплаты  = Перечисления.уб_ФормыОплаты.Безнал;
				СтрокаП.Сумма        = СуммаВзноса;
				СтрокаП.СуммаВВалюте = СуммаВзноса;  
				СтрокаП.Валюта         = Константы.ВалютаРегламентированногоУчета.Получить();
				СтрокаП.Курс         = 1;
				//СтрокаП.ДатаКурса    = 1;
				СтрокаП.Кратность    = 1;
				//СтрокаП.НомерОбосновывающегоДокумента  
				//СтрокаП.ДатаОбосновывающегоДокумента
				СтрокаП.ОбоснованиеРазницы  = "Перечислил клиент";
				СтрокаП.Комментарий         = "";
				СтрокаП.Заявка              = Заявка;
				СтрокаП.ОтсутствуетВОплатах = Ложь;
				//
				СтрокаП = нДокумент.Платежи.Добавить();
				СтрокаП.УИДСтроки    = Новый УникальныйИдентификатор;
				СтрокаП.ФормаОплаты  = Перечисления.уб_ФормыОплаты.Поставщику;
				СтрокаП.Сумма        = - (СуммаЕОсаго);
				СтрокаП.СуммаВВалюте = - (СуммаЕОсаго);  
				СтрокаП.Валюта         = Константы.ВалютаРегламентированногоУчета.Получить();
				СтрокаП.Курс         = 1;
				//СтрокаП.ДатаКурса    = 1;
				СтрокаП.Кратность    = 1;
				//СтрокаП.НомерОбосновывающегоДокумента  
				//СтрокаП.ДатаОбосновывающегоДокумента
				СтрокаП.ОбоснованиеРазницы  = "Отправим в СК";
				СтрокаП.Комментарий         = "";
				СтрокаП.Заявка              = Заявка;
				СтрокаП.ОтсутствуетВОплатах = Ложь;
				
				Для каждого Строка из БСО Цикл
					Если Строка.ЭтоКорень = Ложь и Строка.УидРодителя = УИДПРОЧИХ Тогда
						СтрокаПолиса = нДокумент.Полисы.Добавить();
						СтрокаПолиса.ВидБСО                     = Строка.ВидБСО; 
						СтрокаПолиса.Заявка                     = Заявка;
						СтрокаПолиса.Поставщик                  = Строка.СК;
						СтрокаПолиса.ОрганизацияАгент           = ?(Строка.ОрганизацияАгент.Пустая(),Справочники.Организации.НайтиПоКоду("000000020"),Строка.ОрганизацияАгент);//Строка.ОрганизацияАгент;
						СтрокаПолиса.СК                         = Строка.СК;
						СтрокаПолиса.НомерБСО                   = "б/н";
						СтрокаПолиса.НомерПолиса                = "б/н";
						СтрокаПолиса.НомерКвитанции             = "";
						//СтрокаПолиса.ПоставщикКвитанции         =   ;
						//СтрокаПолиса.ОрганизацияАгентКвитанции  =   ;
						СтрокаПолиса.Сумма                      =  Строка.ИтогСтраховаяПремия;
						СтрокаПолиса.УИДСтроки                  =  Новый УникальныйИдентификатор ;
						СтрокаПолиса.УИДСтрокиЗаявки            =  Строка.УИДСтроки;
					КонецЕсли;         
				КонецЦикла;	                       
				
				нДокумент.ПолучитьФорму().Открыть();
				//Возврат Ложь;
			КонецЕсли;
		КонецЕсли;	

		МассивПеремещений  = уб_УСЗ.ВернутьСвязанныеСЗаявкойПеремещения(Заявка);
		ВсегоПеремещений = МассивПеремещений.Количество();
		Если ВсегоПеремещений = 0 Тогда
			
			Если ЭтоЕОСАГО Тогда
				нДокумент.ПолучитьФорму().Открыть();
			КонецЕсли;
			
			#Если Клиент Тогда
				Предупреждение("Не обнаружено перемещений БСО, связанных с этой заявкой. Невозможно продолжить операцию!",,"Не найдены выданные БСО");
			#КонецЕсли
			Возврат Ложь;
		Иначе	
			Попытка
				Если Не ЭтоЕОСАГО Тогда
					нДокумент = Документы.уб_ПриемкаОплат.СоздатьДокумент();
				КонецЕсли;	
				//нДокумент.Заполнить(ВыбПеремещение);
				нДокумент.Заполнить(Новый Структура("Документ,ТолькоВыдача,Заявка", МассивПеремещений, Ложь, Заявка));
				
				нДокумент.ПолучитьФорму().Открыть();
				//ОповеститьДляСервера("Консоль","Создана приемка на основании перемещения по заявке № "+Заявка.Номер);
			Исключение  
				уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка установки статуса по причине " + уб_УСЗ.РасшифроватьПричину(ОписаниеОшибки()), "Сообщить");
			КонецПопытки

		КонецЕсли;	
	
	#КонецЕсли
	Иначе 
		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не знаю, что делать с : " + Заявка + " - " + Действие);		
		_Оповестить("Консоль","Не известно действие " + Действие);
		Возврат Ложь;
	КонецЕсли;	
	Возврат Результат;	
	
КонецФункции

Функция _Оповестить(ИмяСобытия = Неопределено, Параметр = Неопределено, Источник = Неопределено)
	
	#Если Клиент Тогда
		Оповестить(ИмяСобытия, Параметр, Источник);
	#КонецЕсли
	
КонецФункции


&НаКлиенте
Процедура УстановитьПользовательскийПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
	
	Перем ПараметрДанных, Настройки, ПользовательскиеНастройки, ПользовательскийПараметр;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	
	Если ЗначениеЗаполнено(ПараметрДанных.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		ПользовательскийПараметр = ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		ПользовательскийПараметр.Использование = Истина;
		ПользовательскийПараметр.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры  //  УстановитьПользовательскийПараметрСКД