Функция ПолучитьВознаграждениеМенеджера(
	ОП,
	Параметры,
	ВознаграждениеМенеджера, 
	СхемаРасчета, 
	НЕДобавлятьСтатистикувИнфо 	= Ложь
	) Экспорт
	
	//ИнфоКВМ 						= "", 
	//СтатПоКАСКО 					= Неопределено,
	//СведенияОСквитованныхОплатах 	= Неопределено,
	//СуммаПоПриемкам 				= 0,
	//бНетКвитовкиПоСуммам 			= Неопределено
	Ф = "ЧН=0; ЧГ=";
	ВознаграждениеМенеджера = 0;
	//Если НЕ уб_СС.ОП_ВозможноРедактирование(ОП) Тогда
	//	Возврат 0;	
	//КонецЕсли;
	СведенияОСквитованныхОплатах = Параметры.СведенияОСквитованныхОплатах;
	Если СведенияОСквитованныхОплатах <> Неопределено Тогда
		БалансОплаты = СведенияОСквитованныхОплатах.Итог("НачисленнаяСуммаВзносаВКЛ")
		+ СведенияОСквитованныхОплатах.Итог("СуммаДоп")
		//- СведенияОСквитованныхОплатах.Итог("АВилиСкидкаСумма")
		- СведенияОСквитованныхОплатах.Итог("КВСумма")
		- Параметры.СуммаПоПриемкам
		+ СведенияОСквитованныхОплатах.Итог("СкидкаВыплаченаяКлиенту");
	Иначе
		БалансОплаты = 0;
	Конецесли;
	//Отрицательный баланс говорит о прибыли
	//Положительный об убытке, который требуется компенсировать
	
	//Если ОП.КВСумма < ОП.АВилиСкидкаСумма Тогда
	Если БалансОплаты>0 и СведенияОСквитованныхОплатах.Итог("НачисленнаяСуммаВзносаВКЛ")>0 Тогда
		//ВознаграждениеМенеджера = ОП.КВСумма - ОП.АВилиСкидкаСумма;
		УжеУчтено = -(СведенияОСквитованныхОплатах.Итог("ВознаграждениеМенеджера")-ОП.Знч("ВознаграждениеМенеджера"));
		ВознаграждениеМенеджера = Окр(-(БалансОплаты-УжеУчтено),2);
		Если ВознаграждениеМенеджера<>0 Тогда
			Параметры.ИнфоКВМ = "Недостаточно средств, которые надо оплатить поставщику " + Формат(-ВознаграждениеМенеджера,Ф) + "р, компенсируется менеджером.";
			//ИнфоКрасчетуВМ = "Сумма предоставленной скидки превышает КВ брокера на сумму " + Формат(-ВознаграждениеМенеджера,Ф) + "р, которая удерживается с сотрудника";
			//ДобавитьВычетСАгента(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера);//Не добавялем будет задвоение	
			Если ВознаграждениеМенеджера < 0 
				И ОП.Знч("СхемаРасчетаСМенеджером") = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ
				И Не ОП.Знч("ПроверенаЗП")
				Тогда
				// СКВ не должно аккумулироваться по этой оплате в расчете ВМ
				УстЗнч(ОП, "СхемаРасчетаСМенеджером", ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета, Параметры.РасчетныеПоля.бЗаблокирована);
			Иначе
				//Если ОП.УслугиПоДокументу.Итог("ВМ") Тогда
				//	
				//КонецЕсли;	
					
			КонецЕсли;
			Возврат ВознаграждениеМенеджера;	
		Иначе
			Для Каждого СтрокаУслуги Из ОП.УслугиПоДокументу Цикл
				Если СтрокаУслуги.СхемаОплаты = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль Тогда
					//
					ВознаграждениеМенеджера = ВознаграждениеМенеджера+СтрокаУслуги.ВМ;
				КонецЕсли;
			КонецЦикла;	
			Возврат ВознаграждениеМенеджера;	
		КонецЕсли;
	Иначе
		//УжеУчтено = -(СведенияОСквитованныхОплатах.Итог("ВознаграждениеМенеджера")-ОП.Знч("ВознаграждениеМенеджера"));
		//ВознаграждениеМенеджера = Окр(-(0-УжеУчтено),2);
		Если ОП.СхемаРасчетаСМенеджером = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль Тогда
			Выручка = ОП.Знч("НачисленнаяСуммаВзноса") - ОП.Знч("АВилиСкидкаСумма");//-ОП.Знч("СуммаДоп");
			//ВознаграждениеМенеджера = Выручка - ПолучитьСебестоимость(Оп.Знч("Ссылка"));
			ВидБСО = ПолучитьБланкПолиса(Оп.Знч("Ссылка"));
			Если Не ВидБСО = Неопределено Тогда
				ДанныеБланка = ПолучитьСхемуИАлгоритмРасчета(ВидБСО,ОП.Знч("Агент"),ОП.Знч("ЗарплатныйПериод"));
				Если не ДанныеБланка = Неопределено Тогда
					ВознаграждениеМенеджера = Выручка - ДанныеБланка.МинимальнаяСумма;
				КонецЕсли;	
			КонецЕсли;	
				
		Иначе
			ВознаграждениеМенеджера = 0;
		КонецЕсли;	
		
		Для Каждого СтрокаУслуги Из ОП.УслугиПоДокументу Цикл
			Если СтрокаУслуги.СхемаОплаты = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль Тогда
				//
				ВознаграждениеМенеджера = ВознаграждениеМенеджера+СтрокаУслуги.ВМ;
			КонецЕсли;
		КонецЦикла;	
		Возврат ВознаграждениеМенеджера;	
	КонецЕсли;
	_ВидСП  = ОП.Знч("ВидСП");
	//Если _ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО Тогда 
	//	//Здесь ничего не делаем	
	//ИначеЕсли _ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО Тогда
	//	//Здесь ничего не делаем	
	//Иначе	
	//	ИнфоКрасчетуВМ = "ВМ по виду страховых продуктов '" + _ВидСП + "' по этой схеме расчетов не начисляется.";
	//	ВознаграждениеМенеджера = 0;
	//	Возврат  ВознаграждениеМенеджера;
	//КонецЕсли;
	//
	//20120607
	ПВР = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП;
	СтраховойПродукт = ОП.Знч("СтраховойПродукт"); 
	Если Оп.Знч("ПроверенаЗП") Тогда
		СхемаРасчета  = Оп.Знч("СхемаРасчетаСМенеджером");
	Иначе
		Если ЗначениеЗаполнено(СтраховойПродукт) = Ложь Тогда
			СхемаРасчета  = СтраховойПродукт.СхемаРасчетаСМенеджером; //Приоритетный в определении схемы оплаты
		Иначе
			СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка();	
		КонецЕсли;	
	КонецЕсли;
	
	Если СхемаРасчета = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПустаяСсылка() Тогда
		тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(ОП.Знч("ЗарплатныйПериод"), ОП.Знч("Подразделение").Владелец, ОП.Знч("Подразделение"), ОП.Знч("Агент"), ОП.Знч("ВидСП"));
		Если тз.Количество() > 0 Тогда
			СхемаРасчета = тз[0].СхемаРасчета;
		Иначе
			СхемаРасчета = ПВР.БезРасчета;
			Сообщить("Ошибка при получении вида расчета с менеджером.",СтатусСообщения.ОченьВажное);
			Возврат  ВознаграждениеМенеджера;
		КонецЕсли;
	КонецЕсли;
	
	Если СхемаРасчета = ПВР.БезРасчета Тогда
		Параметры.ИнфоКВМ = "Вознаграждение не начисляется (Схема 'Без Расчета'). ";
		ВознаграждениеМенеджера = 0;
	ИначеЕсли СхемаРасчета = ПВР.ПланПоСКВ Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'План по СКВ'. ";
		ПолучитьВМдляСхемы_ПланПоСКВ(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.ПоИнтерваламСКВ Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Интервалы СКВ'. ";
		Параметры.ИнфоКВМ = "Расчет ВМ по отдельной оплате не производится.
		|СКВ определяется как: КВ-ПолнаяСкидка,
		|ВМ рассчитывается как сумма вознаграждений за каждый интервал СКВ
		|Общий расчет ВМ производится в конце месяца.";
	//	ПолучитьВМдляСхемы_ПланПоСКВ(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);	
	ИначеЕсли СхемаРасчета = ПВР.СтраховойПродукт_Фикс Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Фиксированная сумма по страховому продукту'. ";
		ПолучитьВМдляСхемы_СтраховойПродукт_Фикс(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера);
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_2500 Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме '2500 за КАСКО'. ";
		ПолучитьВМдляСхемы_КАСКО_2500(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_ОкладПремия Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Оклад+Премия'. ";
		ПолучитьВМдляСхемы_КАСКО_ОкладПремия(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_Процент Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Процент'. ";
		ПолучитьВМдляСхемы_КАСКО_Процент_от_СКВ_суперплан_по_количеству_новых_страховок(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, ОП.Знч("Подразделение"), Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_Фикс Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Фикс за страховку'. ";
		ПолучитьВМдляСхемы_КАСКО_Фикс(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера, Параметры.СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.ОСАГО_Фикс Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Фикс за ОСАГО'. ";
		ПолучитьВМдляСхемы_ОСАГО_Фикс(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера);
	ИначеЕсли СхемаРасчета = ПВР.ОСАГО_Фикс_Администратор Тогда
		Параметры.ИнфоКВМ = "Расчет по схеме 'Фикс за ОСАГО для администратора'. ";
		ПолучитьВМдляСхемы_ОСАГО_Фикс_Администратор(ОП, Параметры.ИнфоКВМ, ВознаграждениеМенеджера);
	ИначеЕсли НЕ СхемаРасчета.Предопределенный Тогда
		Параметры.ИнфоКВМ = "Фиксированный процент от СКВ";
		ВознаграждениеМенеджера = СхемаРасчета.Показатель * (ОП.Знч("КВСуммаДляАгента") - ОП.Знч("СкидкаВыплаченаяКлиенту")) / 100;
	Иначе	
		Сообщить("Ошибка расчета ВМ (получена неизвестная схема расчета: '" + СхемаРасчета + "').",СтатусСообщения.ОченьВажное);
	КонецЕсли;
	Возврат ВознаграждениеМенеджера;
	
КонецФункции
///////////////////////////////////////////////////////////////////////////
//    процедуры расчета ВМ для различных видов (схем) расчета
///////////////////////////////////////////////////////////////////////////
Функция ПолучитьСтруктуруСтатистики() Экспорт
	
	Статистика = Новый Структура("ЗарплатныйПериод, Агент, ВидСП, ОП, Заявка");	
	Статистика.Вставить("ВсегоОплат",						0);
	Статистика.Вставить("ОплатДоПереданной",				0); 
	Статистика.Вставить("НовыхПолисовВсего",				0);
	Статистика.Вставить("НовыхПолисовДоПереданной",			0);
	Статистика.Вставить("НомерПереданнойОплаты",			0);	
	Статистика.Вставить("ПереданаТекущая",					Ложь);
	Статистика.Вставить("ПереданнаяНовая",					Ложь);
	Статистика.Вставить("СуммПрибыль",						0);
	Статистика.Вставить("СредПрибыль",						0);
	Статистика.Вставить("СуммПрибыль3",						0);
	Статистика.Вставить("СредПрибыль3",						0);
	Статистика.Вставить("СуммНачисленнаяПремия",			0);
	Статистика.Вставить("СредНачисленнаяПремия",			0);
	Статистика.Вставить("СуммОплаченоФакт",					0);
	Статистика.Вставить("СредОплаченоФакт",					0);
	Статистика.Вставить("СуммАВилиСкидкаСумма",				0);
	Статистика.Вставить("СредАВилиСкидкаСумма",				0);
	Статистика.Вставить("СредАВилиСкидкаПроцент",			0);
	Статистика.Вставить("СредАВилиСкидкаПроцентПоСуммам",	0);
	Статистика.Вставить("СуммПолнаяПремия",					0);
	Статистика.Вставить("СредПолнаяПремия",					0);
	Статистика.Вставить("СуммСтраховаяСумма",				0);
	Статистика.Вставить("СредСтраховаяСумма",				0);
	Статистика.Вставить("СуммКВСумма",						0);
	Статистика.Вставить("СредКВСумма",						0);
	Статистика.Вставить("СредКВПроцент",					0);
	Статистика.Вставить("СредКВПроцентПоСуммам",			0);
	Статистика.Вставить("СуммКВСумма3",						0);
	Статистика.Вставить("СредКВСумма3",						0);
	Статистика.Вставить("СредКВПроцент3",					0);
	Статистика.Вставить("СуммДоходБрокера",					0);
	Статистика.Вставить("СредДоходБрокера",					0);
	Возврат Статистика;
	
КонецФункции

//Получает статистику по оплатам за месяц по Агенту (не включая Личные страховки)
// Если указан вид страховых продуктов, то берется статистика по нему
// Если не указан - то по всем страховкам
// Если передан менеджер записи оплаты (ОП), то эта оплата не будет включена
// в статистику
//
// Если Агент не указан, то берется статистика по всем агентам
// Если Зарплатный Период не указан, то берется текущий месяц
// 
// Результат:
//
// КоличествоВсего - общее количество оплат за период
// КоличествоНовых - количество первичных оплат (полных или первых взносов)
// СредняяПрибыльНаСтраховкуПоКВминус3Процента (расчет ведется по КВ брокера - 3%)
//
Процедура ПолучитьСтатистикуПоКорпоративнымОплатамЗаМесяц(Статистика) Экспорт
	
	ОП = Статистика.ОП;
	кРасчетПоАВ = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;	 
	Если ОП <> Неопределено Тогда
		Если ТипЗнч(ОП.СтраховойПолис.НомерЗаявки) = Тип("Число") И ОП.ВидРасчетаСАгентом <> кРасчетПоАВ Тогда
			Статистика.ЗарплатныйПериод = ОП.ЗарплатныйПериод;
			Статистика.Агент 			= ОП.Агент;
			Статистика.ПереданаТекущая 	= Истина;
			Статистика.ПереданнаяНовая 	= ОП.НомерВзноса = 1;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Статистика.ЗарплатныйПериод) Тогда
		Статистика.ЗарплатныйПериод = ТекущаяДата();	
	КонецЕсли;
	ДатаНачала = НачалоМесяца(Статистика.ЗарплатныйПериод);
	ДатаКонца = КонецМесяца(Статистика.ЗарплатныйПериод);
	Запрос = Новый Запрос;
	Если Статистика.ПереданаТекущая Тогда
		ВставкаПереданнойОплаты = "
		|ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|		&Дата,
		|		&Агент,
		|		&СтраховойПродуктВид,
		|		&СК,
		|		&Номер,
		|		&Ссылка,
		|		&НомерВзноса,
		//|		&ФормаОплаты,
		|		&НомерЗаявки,
		|		&ВидУчетаСтраховки,
		|		ВЫБОР
		|			КОГДА &ВидУчетаСтраховки = &Первичная
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Первичная,
		|		ВЫБОР
		|			КОГДА &ВидУчетаСтраховки = &Пролонгация
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Пролонгация,
		|		ВЫБОР
		|			КОГДА &ВидУчетаСтраховки = &Вторичная
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Вторичная,
		|		ВЫБОР
		|			КОГДА &ВидУчетаСтраховки = &Рекомендация
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Рекомендация,
		|		&ВидРасчетаСАгентом,
		|		ВЫБОР
		|			КОГДА &НомерВзноса = 1
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		0,
		|		0,
		|		1,
		|		&СтраховаяСумма,
		|		&СтраховаяПремия,
		|		&НачисленнаяСуммаВзноса,
		|		&ОплаченоФакт,
		|		&АВилиСкидкаСумма,
		|		&АВилиСкидкаПроцент,
		|		&КВПроцент,
		|		&КВПроцент - 3,
		|		&КВСумма,
		|		&НачисленнаяСуммаВзноса * (&КВПроцент - 3) / 100,
		|		&КВСумма - &АВилиСкидкаСумма,
		|		&НачисленнаяСуммаВзноса * (&КВПроцент - 3) / 100 - &АВилиСкидкаСумма
		|	ИЗ
		|		Документ.уб_ОплатаПолисов КАК ОП2";				   
		Запрос.УстановитьПараметр("Дата", 					ОП.Дата);
		Запрос.УстановитьПараметр("Агент", 					ОП.Агент);
		Запрос.УстановитьПараметр("СтраховойПродуктВид", 	ОП.ВидСП);
		Запрос.УстановитьПараметр("СК", 					ОП.СтраховойПолис.СК);
		Запрос.УстановитьПараметр("Номер", 					ОП.Номер);
		Запрос.УстановитьПараметр("Ссылка", 				ОП.Ссылка);
		Запрос.УстановитьПараметр("НомерВзноса", 			ОП.НомерВзноса);
		//Запрос.УстановитьПараметр("ФормаОплаты", 			ОП.ФормаОплаты);
		Запрос.УстановитьПараметр("НомерЗаявки", 			ОП.СтраховойПолис.НомерЗаявки);
		Запрос.УстановитьПараметр("ВидУчетаСтраховки", 		ОП.СтраховойПолис.ВидУчетаСтраховки);
		Запрос.УстановитьПараметр("ВидРасчетаСАгентом", 	ОП.ВидРасчетаСАгентом);
		Запрос.УстановитьПараметр("СтраховаяСумма", 		ОП.СтраховойПолис.СтраховаяСумма);
		Запрос.УстановитьПараметр("СтраховаяПремия", 		ОП.СтраховойПолис.СтраховаяПремия);
		Запрос.УстановитьПараметр("НачисленнаяСуммаВзноса", ОП.НачисленнаяСуммаВзноса);
		Запрос.УстановитьПараметр("ОплаченоФакт", 			ОП.ОплаченоФакт);
		Запрос.УстановитьПараметр("АВилиСкидкаСумма", 		ОП.АВилиСкидкаСумма);
		Запрос.УстановитьПараметр("АВилиСкидкаПроцент", 	ОП.АВилиСкидкаПроцент);
		Запрос.УстановитьПараметр("КВПроцент", 				ОП.КВПроцент);
		Запрос.УстановитьПараметр("КВСумма", 				ОП.КВСумма);
	Иначе
		Запрос.УстановитьПараметр("Дата", ДатаКонца);
	КонецЕсли;	
	УслГде = "";
	Если Статистика.Заявка = 1 Тогда
		УслГде = " И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок";
	ИначеЕсли Статистика.Заявка = 2 Тогда 	
		УслГде = " И ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок";
	КонецЕсли;
	//прибыль рассчитывалась так:
	//|		ВЫБОР
	//|			КОГДА ОП.АВилиСкидкаСумма < ОП.КВСумма
	//|				ТОГДА ОП.КВСумма - ОП.АВилиСкидкаСумма
	//|			ИНАЧЕ 0
	//|		КОНЕЦ КАК Прибыль,
	ТекстЗапроса = "
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОП.Дата КАК Дата,
	|		ОП.Агент КАК Агент,
	|		ОП.ВидСП КАК ВидСП,
	|		ОП.СтраховойПолис.СК КАК СК,
	|		ОП.Номер,
	|		ОП.Ссылка,
	|		ОП.НомерВзноса КАК НомерВзноса,
	//|		ОП.ФормаОплаты КАК ФормаОплаты,
	|		ОП.СтраховойПолис.НомерЗаявки КАК НомерЗаявки,
	|		ОП.СтраховойПолис.ВидУчетаСтраховки КАК ВидУчетаСтраховки,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Первичная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Первичная,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Пролонгация
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Пролонгация,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Вторичная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Вторичная,
	|		ВЫБОР
	|			КОГДА ОП.СтраховойПолис.ВидУчетаСтраховки = &Рекомендация
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Рекомендация,
	|		ОП.ВидРасчетаСАгентом КАК ВидРасчетаСАгентом,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Новая,
	|		ВЫБОР
	|			КОГДА ОП.Дата <= &Дата
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОплатаДоПереданной,
	|		ВЫБОР
	|			КОГДА ОП.НомерВзноса = 1
	|					И ОП.Дата <= &Дата
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НоваяОплатаДоПереданной,
	|		1 КАК ЭтоОплата,
	|		ОП.СтраховойПолис.СтраховаяСумма КАК СтраховаяСумма,
	|		ОП.СтраховойПолис.СтраховаяПремия КАК СтраховаяПремия,
	|		ОП.НачисленнаяСуммаВзноса КАК НачисленнаяСуммаВзноса,
	|		ОП.ОплаченоФакт КАК ОплаченоФакт,
	|		ОП.АВилиСкидкаСумма КАК АВилиСкидкаСумма,
	|		ОП.АВилиСкидкаПроцент КАК АВилиСкидкаПроцент,
	|		ОП.КВПроцент КАК КВПроцент,
	|		ОП.КВПроцент - 3 КАК КВПроцент3,
	|		ОП.КВСумма КАК КВСумма,
	|		ОП.НачисленнаяСуммаВзноса * (ОП.КВПроцент - 3) / 100 КАК КВСумма3,
	|		ВЫБОР
	|			КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|			КОНЕЦ - ОП.КВСумма
	|				ТОГДА 0
	|			ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|			КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|		КОНЕЦ КАК Прибыль,		
	|		ОП.НачисленнаяСуммаВзноса * (ОП.КВПроцент - 3) / 100 - ОП.АВилиСкидкаСумма КАК Прибыль3
	|	ИЗ
	|		Документ.уб_ОплатаПолисов КАК ОП
	|	ГДЕ НЕ ОП.ПометкаУдаления И
	|		ОП.ЗарплатныйПериод >= &ДатаНачала
	|		И ОП.ЗарплатныйПериод <= &ДатаКонца
	|		И ОП.ВидРасчетаСАгентом <> &РасчетПоАВ
	//|      И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	|		"+УслГде+"
	|";
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", 		ДатаКонца);
	Запрос.УстановитьПараметр("РасчетПоАВ", 	кРасчетПоАВ);
	Запрос.УстановитьПараметр("Первичная", 		Перечисления.уб_ВидыУчетаСтраховок.Первичная);
	Запрос.УстановитьПараметр("Пролонгация", 	Перечисления.уб_ВидыУчетаСтраховок.Пролонгация);
	Запрос.УстановитьПараметр("Вторичная", 		Перечисления.уб_ВидыУчетаСтраховок.Вторичная);
	Запрос.УстановитьПараметр("Рекомендация", 	Перечисления.уб_ВидыУчетаСтраховок.Рекомендация);
	Если ЗначениеЗаполнено(Статистика.Агент) Тогда
		ТекстЗапроса = ТекстЗапроса + " И Агент = &Агент";
		Запрос.УстановитьПараметр("Агент", Статистика.Агент);
	КонецЕсли;
	Если ОП <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса +  " И ОП.Номер <> &НомерОП";
		Запрос.УстановитьПараметр("НомерОП", Статистика.ОП.Номер);
	КонецЕсли;
	Если Статистика.ВидСП <> Неопределено И Статистика.ВидСП <> Перечисления.уб_ВидыСтраховыхПродуктов.ПустаяСсылка() Тогда
		ТекстЗапроса = ТекстЗапроса + " И ОП.ВидСП = &ВидСП";
		Запрос.УстановитьПараметр("ВидСП", Статистика.ВидСП);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	" + ВставкаПереданнойОплаты + "
	|
	|	) КАК Т ";
	НачалоЗапроса = "ВЫБРАТЬ
	|	СУММА(Т.ЭтоОплата) КАК ВсегоОплат,
	|	СУММА(Т.Новая) КАК НовыхПолисов,
	|
	|	СУММА(Т.ОплатаДоПереданной) КАК ОплатДоПереданной,
	|	СУММА(Т.НоваяОплатаДоПереданной) КАК НовыхПолисовДоПереданной,
	|
	|	СУММА(Т.Первичная) КАК Первичных,
	|	СУММА(Т.Пролонгация) КАК Пролонгаций,
	|	СУММА(Т.Вторичная) КАК Вторичных,
	|	СУММА(Т.Рекомендация) КАК Рекомендаций,
	|
	|	СУММА(Т.СтраховаяСумма) КАК СтраховаяСумма,
	|	СУММА(Т.СтраховаяПремия) КАК СтраховаяПремия,
	|	СУММА(Т.НачисленнаяСуммаВзноса) КАК НачисленнаяСуммаВзноса,
	|	СУММА(Т.ОплаченоФакт) КАК ОплаченоФакт,
	|	СУММА(Т.АВилиСкидкаСумма) КАК АВилиСкидкаСумма,
	|	СУММА(Т.КВПроцент) КАК КВПроцент,
	|	СУММА(Т.КВПроцент3) КАК КВПроцент3,
	|	СУММА(Т.КВСумма) КАК КВСумма,
	|	СУММА(Т.КВСумма3) КАК КВСумма3,
	|	СУММА(Т.Прибыль) КАК Прибыль,
	|	СУММА(Т.Прибыль3) КАК Прибыль3,
	|	СРЕДНЕЕ(Т.СтраховаяСумма) КАК СрСтраховаяСумма,
	|	СРЕДНЕЕ(Т.СтраховаяПремия) КАК СрСтраховаяПремия,
	|	СРЕДНЕЕ(Т.НачисленнаяСуммаВзноса) КАК СрНачисленнаяСуммаВзноса,
	|	СРЕДНЕЕ(Т.ОплаченоФакт) КАК СрОплаченоФакт,
	|	СРЕДНЕЕ(Т.АВилиСкидкаСумма) КАК СрАВилиСкидкаСумма,
	|	СРЕДНЕЕ(Т.АВилиСкидкаПроцент) КАК СрАВилиСкидкаПроцент,
	|	СРЕДНЕЕ(Т.КВПроцент) КАК СрКВПроцент,
	|	СРЕДНЕЕ(Т.КВПроцент3) КАК СрКВПроцент3,
	|	СРЕДНЕЕ(Т.КВСумма) КАК СрКВСумма,
	|	СРЕДНЕЕ(Т.КВСумма3) КАК СрКВСумма3,
	|	СРЕДНЕЕ(Т.Прибыль) КАК СрПрибыль,
	|	СРЕДНЕЕ(Т.Прибыль3) КАК СрПрибыль3
	|	 ";		 
	/////  Проверочный запрос  ////////
	//Запрос.Текст = "ВЫБРАТЬ Т.* " + ТекстЗапроса;
	//Результат = Запрос.Выполнить();
	//ТЗЗ = Результат.Выгрузить();
	///////////////////////////////////
	Запрос.Текст = НачалоЗапроса + ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Не Выборка.Следующий() Или Выборка.ВсегоОплат = Null Тогда
		Возврат;	
	КонецЕсли;
	Статистика.Вставить("ВсегоОплат",				Выборка.ВсегоОплат);
	Статистика.Вставить("ОплатДоПереданной",		Выборка.ОплатДоПереданной); 
	Статистика.Вставить("НовыхПолисовВсего",		Выборка.НовыхПолисов);
	Статистика.Вставить("НовыхПолисовДоПереданной",	Выборка.НовыхПолисовДоПереданной);
	Статистика.Вставить("НомерПереданнойОплаты",	Выборка.ОплатДоПереданной + 1);
	Статистика.Вставить("Первичных",				Выборка.Первичных);
	Статистика.Вставить("Пролонгаций",				Выборка.Пролонгаций);
	Статистика.Вставить("Вторичных",				Выборка.Вторичных);
	Статистика.Вставить("Рекомендаций",				Выборка.Рекомендаций);
	Статистика.Вставить("СуммПрибыль",				Окр(Выборка.Прибыль, 2));
	Статистика.Вставить("СредПрибыль",				Окр(Выборка.СрПрибыль, 2));
	Статистика.Вставить("СуммПрибыль3",				Окр(Выборка.Прибыль3, 2));
	Статистика.Вставить("СредПрибыль3",				Окр(Выборка.СрПрибыль3, 2));
	Статистика.Вставить("СуммНачисленнаяПремия",	Окр(Выборка.НачисленнаяСуммаВзноса, 2));
	Статистика.Вставить("СредНачисленнаяПремия",	Окр(Выборка.СрНачисленнаяСуммаВзноса, 2));
	Статистика.Вставить("СуммОплаченоФакт",			Окр(Выборка.ОплаченоФакт, 2));
	Статистика.Вставить("СредОплаченоФакт",			Окр(Выборка.СрОплаченоФакт, 2));
	Статистика.Вставить("СуммАВилиСкидкаСумма",		Окр(Выборка.АВилиСкидкаСумма, 2));
	Статистика.Вставить("СредАВилиСкидкаСумма",		Окр(Выборка.СрАВилиСкидкаСумма, 2));
	Статистика.Вставить("СредАВилиСкидкаПроцент",	Окр(Выборка.СрАВилиСкидкаПроцент,2));
	Статистика.Вставить("СуммПолнаяПремия",			Окр(Выборка.СтраховаяПремия, 2));
	Статистика.Вставить("СредПолнаяПремия",			Окр(Выборка.СрСтраховаяПремия, 2));
	Статистика.Вставить("СуммСтраховаяСумма",		Окр(Выборка.СтраховаяСумма, 2));
	Статистика.Вставить("СредСтраховаяСумма",		Окр(Выборка.СрСтраховаяСумма, 2));
	Статистика.Вставить("СуммКВСумма",				Окр(Выборка.КВСумма, 2));
	Статистика.Вставить("СредКВСумма",				Окр(Выборка.СрКВСумма, 2));
	Статистика.Вставить("СредКВПроцент",			Окр(Выборка.СрКВПроцент, 2));
	Если Выборка.НачисленнаяСуммаВзноса <> 0 Тогда
		Статистика.Вставить("СредАВилиСкидкаПроцентПоСуммам",	Окр(Выборка.АВилиСкидкаСумма / Выборка.НачисленнаяСуммаВзноса * 100, 2));
		Статистика.Вставить("СредКВПроцентПоСуммам",			Окр(Выборка.КВСумма / Выборка.НачисленнаяСуммаВзноса * 100, 2));
	КонецЕсли;
	Статистика.Вставить("СуммКВСумма3", 	Окр(Выборка.КВСумма3, 2));
	Статистика.Вставить("СредКВСумма3", 	Окр(Выборка.СрКВСумма3, 2));
	Статистика.Вставить("СредКВПроцент3",	Окр(Выборка.СрКВПроцент3, 2));
	
КонецПроцедуры

Функция ПолучитьСтрокуСтатистикиПоКАСКО(Стат)
	
	ИнфоСтат = "Статистика" + ?(ЗначениеНеЗаполнено(Стат.Агент),""," Агента " + Стат.Агент) 
	+ " по корпоративным страховкам КАСКО
	|за отчетный период """	+ Формат(Стат.ЗарплатныйПериод,"ДФ='ММMM yyyy'") + """:
	|
	|	Текущая оплата № " + Стат.НомерПереданнойОплаты + ", " + (?(Стат.ПереданнаяНовая,"первичная № " + (Стат.НовыхПолисовДоПереданной + 1),"вторичная")) + "
	|	Всего оплат: " + Стат.ВсегоОплат + ", из них первичных: " + Стат.НовыхПолисовВсего + "
	|	Средняя прибыль: " + Стат.СредПрибыль3;	
	Если Не уб_КЭШируемые.ДоступностьРоли("уб_МенеджерНаТочке") Тогда
		ИнфоСтат = ИнфоСтат + "
		|	Ср. прибыль (полое КВ): " + Стат.СредПрибыль + "
		|	Сумма по КВ брокера: " + Стат.СуммКВСумма + "
		|	Ср. сумма КВ брокера: " + Стат.СредКВСумма + "
		|	Ср. % КВ брокера: " + Стат.СредКВПроцент;
		Если Стат.СуммНачисленнаяПремия = 0 Тогда
			КвС = 0;
		Иначе
			КвС = Окр((Стат.СуммКВСумма / Стат.СуммНачисленнаяПремия * 100),2);
		КонецЕсли;
		ИнфоСтат = ИнфоСтат + "
		|	Ср. % КВ брокера (по суммам): " + КвС + "%
		|	Сумма начисленных премий: " + Стат.СуммНачисленнаяПремия + "
		|	Ср. начисленная премия: " + Стат.СредНачисленнаяПремия + "
		|	Ср. страховая сумма: " + Стат.СредСтраховаяСумма
		//|	Доход брокера: " + Стат.СуммДоходБрокера
		//|	Доход брокера на 1 оплату: " + Стат.СредДоходБрокера
		+ "";
	КонецЕсли;	
	Возврат ИнфоСтат;
	
КонецФункции

Функция ПроверитьПревышениеСуперПлана_ПоКоличествуНовыхКАСКО(ОП, ЗарплатныйПериод, Агент, ВидСП, ДоляОплатыОтПолнойПремии, ВознаграждениеМенеджера, Инфо, Стат = Неопределено)
	
	Ф = "ЧН=0; ЧГ=";	
	Если Стат = Неопределено Тогда
		Стат = ПолучитьСтруктуруСтатистики();
		Стат.ЗарплатныйПериод = ЗарплатныйПериод; 
		Стат.Агент = Агент; 
		Стат.ВидСП = ВидСП; 
		Стат.ОП = ОП.Знч("Ссылка"); 
		ПолучитьСтатистикуПоКорпоративнымОплатамЗаМесяц(Стат);	
	КонецЕсли;
	МаксКолКАСКО = 20;
	Если Стат.НовыхПолисовДоПереданной >= МаксКолКАСКО И ОП.Знч("НомерВзноса") = 1 Тогда
		Инфо = Инфо + "
		|Новая страховка № " + (Стат.НовыхПолисовДоПереданной + 1) + ".
		|Среднестатистическая прибыль на оплату по КАСКО за месяц: " + Формат(Стат.СредПрибыль3,Ф) + "р.";
		СреднестатистическаяПрибыль = Окр(Стат.СредПрибыль3 * ДоляОплатыОтПолнойПремии,2);
		Если ДоляОплатыОтПолнойПремии < 1 Тогда
			Инфо = Инфо + "
			|Доля оплаты от полной премии: ДО=" +  Строка(Окр(ДоляОплатыОтПолнойПремии*100,1)) + "%
			|Пропорциональная среднестатистическая премия на данную оплату = ДО*" 
			+ Формат(Стат.СредПрибыль3,Ф) + "р. = " 
			+ Формат(СреднестатистическаяПрибыль,Ф) + "р. 
			|";
		КонецЕсли;
		//Расчитываем фактическую прибыль со страховки (по КВ минус 3%)		
		ФактическаяПрибыльПоКВминус3Процента = ОП.Знч("НачисленнаяСуммаВзноса") * (ОП.Знч("КВПроцент") - 3) / 100 - ОП.Знч("АВилиСкидкаСумма");
		Инфо = Инфо + "
		|Фактическая прибыль по оплате = [Начисленная Сумма Взноса]*[КВ-3%]-[Скидка] = " 
		+ Формат(ОП.Знч("НачисленнаяСуммаВзноса"),Ф) + "р*" + (ОП.КВПроцент - 3) + "%-" 
		+ Формат(ОП.Знч("АВилиСкидкаСумма"),Ф) + "р = " + Формат(ФактическаяПрибыльПоКВминус3Процента,Ф) + "р.";
		Если ФактическаяПрибыльПоКВминус3Процента <= СреднестатистическаяПрибыль Тогда
			ВознаграждениеМенеджера = ФактическаяПрибыльПоКВминус3Процента;
			Инфо = Инфо + "
			|ВМ = " + Формат(ФактическаяПрибыльПоКВминус3Процента,Ф) + "р.";
		Иначе
			ВознаграждениеМенеджера = СреднестатистическаяПрибыль;
			Инфо = Инфо + "
			|По данной схеме расчета ВМ не превышает среднестатистическую прибыль за месяц.
			|ВМ = " + Формат(СреднестатистическаяПрибыль,Ф) + "р.";
		КонецЕсли;		
		ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);	
		Возврат Истина;	
	КонецЕсли;
	Возврат Ложь;	
	
КонецФункции

Процедура ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера)
	
	_Дата = ОП.Знч("Дата");
	_ВычетСАгента = ОП.Знч("ВычетСАгента");
	Если (_Дата>=Дата(2013,1,1) И _ВычетСАгента <> 0) //Возможность уменьшить компенсаацию агента при отрицательном вычете
		ИЛИ (_Дата<Дата(2013,1,1) И _ВычетСАгента > 0)//При отрицательном вычете не учитывается
		Тогда
		ВознаграждениеМенеджера = ВознаграждениеМенеджера - _ВычетСАгента;
		Инфо = Инфо + "
		|
		|С учетом вычета с агента, ВМ = " 	
		+ Формат(ВознаграждениеМенеджера,"ЧН=0; ЧГ=") + "р.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтатистикуПоКорпоративнымОплатамКАСКОЗаМесяц(ОП, Инфо, Стат = Неопределено)
	
	Если Стат = Неопределено Тогда
		Стат = ПолучитьСтруктуруСтатистики();
		Стат.ЗарплатныйПериод = ОП.Знч("ЗарплатныйПериод"); 
		Стат.Агент = ОП.Знч("Агент"); 
		Стат.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО; 
		ПолучитьСтатистикуПоКорпоративнымОплатамЗаМесяц(Стат);
	КонецЕсли;
	Инфо = Инфо + "
	|
	|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
	
КонецПроцедуры

Функция ДайДолюОтПолнойПремии(ОП)
	
	Если ОП.ПолнаяСтраховаяПремия = 0 Тогда
		Сообщить("Полная премия равна 0 в оплате : " + ОП.Номер, СтатусСообщения.ОченьВажное);	
		Возврат 1;
	Иначе	
		Возврат Окр(Мин(1 ,ОП.НачисленнаяСуммаВзносаВВалюте / ОП.ПолнаяСтраховаяПремия), 2);
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////
//ОСАГО

Процедура ПолучитьВМдляСхемы_ОСАГО_Фикс_Администратор(ОП, Инфо, ВознаграждениеМенеджера)
	
	//ОСАГО:
	//Для дневного и вечернего администратора
	// 50р за сраховку при КВ < 30%.
	// 100р за страховку при КВ >= 30% 
	// Без вычета за скидку.	
	Ф = "ЧН=0; ЧГ=";
	Если ОП.Знч("КВПроцент") < 30 Тогда
		ФиксПоОСАГО = 50; //руб.
	Иначе
		ФиксПоОСАГО = 100; //руб.
	КонецЕсли;
	ПроцентВычетаЗаСкидкуПоОСАГО = 0; //%
	ДоляОплатыОтПолнойПремии = ДайДолюОтПолнойПремии(ОП);
	ЗаОСАГО = Окр(ФиксПоОСАГО * ДоляОплатыОтПолнойПремии,2);
	ВычетЗаСкидку = Окр(ОП.Знч("АВилиСкидкаСумма") * ПроцентВычетаЗаСкидкуПоОСАГО / 100 * ДоляОплатыОтПолнойПремии,2); 
	ВознаграждениеМенеджера = Окр(ЗаОСАГО - ВычетЗаСкидку);
	Если ДоляОплатыОтПолнойПремии < 1 Тогда
		Инфо = Инфо + "
		|Доля оплаты от полной премии: ДО = " + Строка(Окр(ДоляОплатыОтПолнойПремии*100,1)) + "%. 
		|Фикс по ОСАГО: " + Формат(ФиксПоОСАГО,Ф) + "р (при КВ брокера " + ОП.Знч("КВПроцент") + "%).
		|За ОСАГО: " + Формат(ФиксПоОСАГО,Ф) + " * ДО = " + Формат(ЗаОСАГО,Ф) + "р. 
		|Вычет за скидку: " + Формат(ОП.Знч("АВилиСкидкаСумма"),Ф) + "*" 
		+ Формат(ПроцентВычетаЗаСкидкуПоОСАГО,Ф) + "% * ДО = " + Формат(ВычетЗаСкидку,Ф) + "р.";
	Иначе
		Инфо = Инфо + "
		|За ОСАГО: " + Формат(ЗаОСАГО,Ф) + "р (при КВ брокера " + ОП.Знч("КВПроцент") + "%). 
		|Вычет за скидку: " + Формат(ОП.Знч("АВилиСкидкаСумма"),Ф) + " * " + ПроцентВычетаЗаСкидкуПоОСАГО + "% = " + Формат(ВычетЗаСкидку,Ф) + "р.";
	КонецЕсли;
	Инфо = Инфо + "
	|Итого, ВМ = " + Формат(ЗаОСАГО,Ф) + " - " + Формат(ВычетЗаСкидку,Ф) + " = " + Формат(ВознаграждениеМенеджера,Ф) + "р.";
	ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_ОСАГО_Фикс(ОП, Инфо, ВознаграждениеМенеджера)
	
	//ОСАГО:
	// Для дневных и вечерних менеджеров
	// Фикс за сраховку в зависимости от КВ. Выит за скидку - 30% от суммы предоставленной скидки
	// По остальным видам страхования - 0р	
	Ф = "ЧН=0; ЧГ=";
	Если ОП.Знч("ЗарплатныйПериод") < Дата("20090714000000") Тогда
		Если ОП.Знч("КВПроцент") < 30 Тогда
			ФиксПоОСАГО = 150; //руб.
		Иначе
			ФиксПоОСАГО = 350; //руб.
		КонецЕсли;
	Иначе
		Если ОП.Знч("КВПроцент") < 30 Тогда
			ФиксПоОСАГО = 100; //руб.
		Иначе
			ФиксПоОСАГО = 250; //руб.
		КонецЕсли;
	КонецЕсли;
	ПроцентВычетаЗаСкидкуПоОСАГО = 30; //%
	ДоляОплатыОтПолнойПремии = ДайДолюОтПолнойПремии(ОП);
	ЗаОСАГО = Окр(ФиксПоОСАГО * ДоляОплатыОтПолнойПремии,2);
	ВычетЗаСкидку = Окр(ОП.Знч("АВилиСкидкаСумма") * ПроцентВычетаЗаСкидкуПоОСАГО / 100 * ДоляОплатыОтПолнойПремии,2); 
	ВознаграждениеМенеджера = Окр(ЗаОСАГО - ВычетЗаСкидку);
	Если ДоляОплатыОтПолнойПремии < 1 Тогда
		Инфо = Инфо + "
		|Доля оплаты от полной премии: ДО = " + Строка(Окр(ДоляОплатыОтПолнойПремии*100,1)) + "%. 
		|Фикс по ОСАГО: " + Формат(ФиксПоОСАГО,Ф) + "р (при КВ брокера " + ОП.Знч("КВПроцент") + "%).
		|За ОСАГО: " + Формат(ФиксПоОСАГО,Ф) + " * ДО = " + Формат(ЗаОСАГО,Ф) + "р. 
		|Вычет за скидку: " + Формат(ОП.Знч("АВилиСкидкаСумма"),Ф) + "*" 
		+ Формат(ПроцентВычетаЗаСкидкуПоОСАГО,Ф) + "% * ДО = " + Формат(ВычетЗаСкидку,Ф) + "р.";
	Иначе
		Инфо = Инфо + "
		|За ОСАГО: " + Формат(ЗаОСАГО,Ф) + "р (при КВ брокера " + ОП.Знч("КВПроцент") + "%). 
		|Вычет за скидку: " + Формат(ОП.Знч("АВилиСкидкаСумма"),Ф) + " * " + ПроцентВычетаЗаСкидкуПоОСАГО + "% = " + Формат(ВычетЗаСкидку,Ф) + "р.";
	КонецЕсли;
	Инфо = Инфо + "
	|Итого, ВМ = " + Формат(ЗаОСАГО,Ф) + " - " + Формат(ВычетЗаСкидку,Ф) + " = " + Формат(ВознаграждениеМенеджера,Ф) + "р.";
	ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);
	
КонецПроцедуры

//КАСКО

Процедура ПолучитьВМдляСхемы_КАСКО_2500(ОП, Инфо, ВознаграждениеМенеджера, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	
	//Самая первая схема: 
	//КАСКО:
	//	2500р за страховку. За каждый процент скидки - минус 100р 
	//	При частичном платеже начисляется пропорциональная доля от ВМ
	ПолучитьВМдляСхемы_КАСКО_ФиксИ2500(ОП, Инфо, ВознаграждениеМенеджера, "2500", Стат, НЕДобавлятьСтатистикувИнфо);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_КАСКО_Фикс(ОП, Инфо, ВознаграждениеМенеджера, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	
	//Схема мотивации «Фикс за страховку»
	//При количестве новых договоров страхования КАСКО до 20 шт. в месяц
	//вознаграждение сотрудника составляет 2500руб. за одну страховку КАСКО. 
	//При частичной оплате страховки КАСКО, вознаграждение начисляется 
	//пропорционально доле платежа от полной премии.
	
	//Правила предоставления скидок: 2
	//Сотрудник вправе давать скидку до 5% от страховой премии по собственному усмотрению.
	//За каждый предоставленный % скидки из вознаграждения сотрудника вычитается 100руб.
	ПолучитьВМдляСхемы_КАСКО_ФиксИ2500(ОП, Инфо, ВознаграждениеМенеджера, "Фикс", Стат, НЕДобавлятьСтатистикувИнфо);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_КАСКО_ФиксИ2500(ОП, Инфо, ВознаграждениеМенеджера, СхемаРасчета, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	
	Ф = "ЧН=0; ЧГ=";	
	ФиксПоКАСКО = 2500; //руб.
	ВычетЗа1ПроцентСкидкиПоКАСКО = 100; //руб.	
	ДоляОплатыОтПолнойПремии = ДайДолюОтПолнойПремии(ОП);
	Если СхемаРасчета = "Фикс" Тогда
		Если ПроверитьПревышениеСуперПлана_ПоКоличествуНовыхКАСКО(ОП, ОП.Знч("ЗарплатныйПериод"), ОП.Знч("Агент"), Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО, ДоляОплатыОтПолнойПремии, ВознаграждениеМенеджера, Инфо, Стат) Тогда
			Инфо = Инфо + "
			|
			|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	//Схема "Фикс за КАСКО"	
	ЗаКАСКО = Окр(ФиксПоКАСКО * ДоляОплатыОтПолнойПремии,2);
	Если ОП.Знч("СтраховойПолис").БонусМенеджеру Тогда
		ВычетЗаСкидку = 0; 
	Иначе
		ВычетЗаСкидку = Окр(ОП.Знч("АВилиСкидкаПроцент") * ВычетЗа1ПроцентСкидкиПоКАСКО * ДоляОплатыОтПолнойПремии,2); 
	КонецЕсли;
	ВознаграждениеМенеджера = Окр(ЗаКАСКО - ВычетЗаСкидку,2);
	Если ДоляОплатыОтПолнойПремии < 1 Тогда
		ДоляИнфо1 = "Доля оплаты от полной премии: ДО = " + Строка(Окр(ДоляОплатыОтПолнойПремии*100,1)) + "%. "; 
		сДО = "р * ДО"; 
		сДО2 = сДО + " = " + Формат(ЗаКАСКО,Ф); 
	Иначе
		ДоляИнфо1 = ""; 
		сДО = ""; 
		сДО2 = ""; 
	КонецЕсли;
	Инфо = Инфо + "
	|" + ДоляИнфо1 + "За КАСКО: " + Формат(ФиксПоКАСКО,Ф) + сДО2 + "р. ";
	Если ОП.Знч("СтраховойПолис").БонусМенеджеру Тогда
		Инфо = Инфо + "
		|За скидку " + ОП.Знч("АВилиСкидкаПроцент") + "% вычет не начисляется, поскольку страховка вида '" 
		+ ОП.Знч("СтраховойПолис").ВидУчетаСтраховки + "'";
	Иначе
		Инфо = Инфо + "
		|Вычет за скидку: " + ОП.Знч("АВилиСкидкаПроцент") + "% * " + ВычетЗа1ПроцентСкидкиПоКАСКО 
		+ сДО + " = " + Формат(ВычетЗаСкидку,Ф) + "р.";
	КонецЕсли;
	Инфо = Инфо + "
	|Итого, ВМ=" + Формат(ЗаКАСКО,Ф) + " - " + Формат(ВычетЗаСкидку,Ф) 
	+ " = " + Формат(ВознаграждениеМенеджера,Ф) + "р.";
	ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);
	Если НЕДобавлятьСтатистикувИнфо Тогда 
		Возврат;
	КонецЕсли;
	Если СхемаРасчета = "Фикс" Тогда
		Инфо = Инфо + "
		|
		|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
	Иначе
		ДобавитьСтатистикуПоКорпоративнымОплатамКАСКОЗаМесяц(ОП, Инфо);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_КАСКО_ОкладПремия(ОП, Инфо, ВознаграждениеМенеджера, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	
	//Схема мотивации «Оклад + Премия»
	
	//Вознаграждение сотрудника состоит из оклада и премиальной части.
	//Оклад – 20 000р выплачивается в полном размере при условии выполнения плана.
	//План: 10 новых договоров автострахования КАСКО в месяц.
	//Каждая страховка КАСКО сверх плана премируется из расчета 1500 руб. за страховку.
	
	//При невыполнении плана из оклада удерживается по 2000р за каждую страховку КАСКО, недостающую до планового количества.
	//Если сотрудник в течение отчетного периода (30 дней) не осуществит ни одной страховки КАСКО, 
	//его вознаграждение составит 3000 руб.
	
	//Правила предоставления скидок :
	//Сотрудник вправе давать скидку до 5% от страховой премии по собственному усмотрению.
	//За скидки свыше 5% из ЗП удерживается по 250р за каждый % скидки сверх 5%.
	
	//Начиная с 21-й новой страховки КАСКО (в отчетный месяц) вознаграждение сотрудника составляет 100% прибыли .
	
	Ф = "ЧН=0; ЧГ=";	
	ФиксПоКАСКО = 2000; //руб.
	ФиксПоКАСКОСверхПлана = 1500; //руб.
	ПланПоКАСКО = 10; //шт.
	ЛимитСкидки = 5; //%
	ВычетЗа1ПроцентСкидкиПоКАСКО = 250; //руб.	
	ДоляОплатыОтПолнойПремии = ДайДолюОтПолнойПремии(ОП);
	Если ПроверитьПревышениеСуперПлана_ПоКоличествуНовыхКАСКО(ОП, ОП.Знч("ЗарплатныйПериод"), ОП.Знч("Агент"), Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО, ДоляОплатыОтПолнойПремии, ВознаграждениеМенеджера, Инфо, Стат) Тогда
		Инфо = Инфо + "
		|
		|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
		Возврат;	
	КонецЕсли;
	//Схема «Оклад + Премия»
	ПревышениеПроцента = Макс(0,ОП.Знч("АВилиСкидкаПроцент") - ЛимитСкидки);
	ВычетЗаСкидку = Окр(ПревышениеПроцента * ВычетЗа1ПроцентСкидкиПоКАСКО * ДоляОплатыОтПолнойПремии,2); 
	ЗаКАСКО = Окр(ФиксПоКАСКО * ДоляОплатыОтПолнойПремии,2);
	ВознаграждениеМенеджера = Окр(ЗаКАСКО - ВычетЗаСкидку,2);
	сВычетЗаСкидку = Формат(ВычетЗаСкидку,Ф);	
	сЗаКАСКО = Формат(ЗаКАСКО,Ф);
	Если ДоляОплатыОтПолнойПремии < 1 Тогда
		ДоляИнфо1 = "Доля оплаты от полной премии: ДО = " + Строка(Окр(ДоляОплатыОтПолнойПремии*100,1)) + "%. "; 
		сДО = "р * ДО"; 
		сДО2 = сДО + " = " + сЗаКАСКО; 
	Иначе
		ДоляИнфо1 = ""; 
		сДО = ""; 
		сДО2 = ""; 
	КонецЕсли;
	Инфо = Инфо + "
	|" + ДоляИнфо1 + "За КАСКО: " + Формат(ФиксПоКАСКО,Ф) + сДО2 + "р. ";
	Если ВычетЗаСкидку > 0 Тогда
		Инфо = Инфо + "
		|Вычет за скидку: (" + Формат(ОП.Знч("АВилиСкидкаПроцент"),Ф) + "% - " + ЛимитСкидки + "%) = " 
		+ Формат(ПревышениеПроцента,Ф) + " * " + ВычетЗа1ПроцентСкидкиПоКАСКО + сДО + " = " + сВычетЗаСкидку + "р. "
	Иначе
		Инфо = Инфо + "
		|Скидка не более " + ЛимитСкидки + "%. Вычет за скидку: 0р. ";
	КонецЕсли;
	Инфо = Инфо + "
	|Итого, ВМ = " + ?(ВычетЗаСкидку > 0,сЗаКАСКО + "р - " + сВычетЗаСкидку + "р = ","") + Формат(ВознаграждениеМенеджера,Ф) + "р. ";
	ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);
	Если НЕДобавлятьСтатистикувИнфо Тогда 
		Возврат;
	КонецЕсли;
	Инфо = Инфо + "
	|
	|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_КАСКО_Процент_от_СКВ_суперплан_по_количеству_новых_страховок(ОП, Инфо, ВознаграждениеМенеджера, ПодразделениеАгента = Неопределено, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	//Схема мотивации «Процент»
	//При количестве новых договоров страхования КАСКО до 20 шт в месяц
	//вознаграждение сотрудника составляет 30% от СКВ (собранное КВ = Сумма КВ - Скидка).
	//Прибыль со страховки равна сумме КВ брокера за вычетом суммы предоставленной скидки:
	//			СКВ = Сумма КВ - Скидка
	//			Вознаграждение сотрудника =  СКВ * 30%
	
	//Правила предоставления скидок:
	//Сотрудник вправе давать скидку до 10% от страховой премии по собственному усмотрению.
	
	//Примечание: в зависимости от эффективности работы сотрудника процент вознаграждения сотрудника 
	//может быть увеличен по усмотрению руководства до 33%.
	
	Ф = "ЧН=0; ЧГ=";	
	СП = ОП.Знч("СтраховойПолис");
	ПолнаяПремия = СП.СтраховаяПремия;	
	ДоляОплатыОтПолнойПремии = ДайДолюОтПолнойПремии(ОП);	
	_Агент = ОП.Знч("Агент");
	_ЗарплатныйПериод = ОП.Знч("ЗарплатныйПериод");
	
	Если ПроверитьПревышениеСуперПлана_ПоКоличествуНовыхКАСКО(ОП, _ЗарплатныйПериод, _Агент, Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО, ДоляОплатыОтПолнойПремии, ВознаграждениеМенеджера, Инфо, Стат) Тогда
		Инфо = Инфо + "
		|
		|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
		Возврат;	
	КонецЕсли;
	//Схема "Процент"	
	Если ПодразделениеАгента = Неопределено Тогда
		ПодразделениеАгента = уб_СС.ПолучитьПодразделениеАгента(_Агент, КонецМесяца(_ЗарплатныйПериод) - 1);
	КонецЕсли;
	_Организация = ПодразделениеАгента.Владелец;
	тзКВЗП = уб_СтраховойБрокер.ПолучитьПроцентнуюСтавкуДляСхемы_Процент_(ОП.Знч("ЗарплатныйПериод"), _Организация, ПодразделениеАгента, _Агент);
	Если тзКВЗП.Количество() > 0 Тогда
		КВЗП = тзКВЗП[0].Процент;
	Иначе
		КВЗП = 0;
		Сообщить("Ошибка при получении % вознаграждения для работающего по схеме ""Процент"".");
	КонецЕсли;
	Прибыль = ОП.Знч("КВСумма") - ОП.Знч("АВилиСкидкаСумма");
	ВознаграждениеМенеджера	= Окр(Прибыль * КВЗП / 100,2);
	Инфо = Инфо	+ "
	|Прибыль по оплате: " + Формат(Прибыль,Ф) + "р.
	|Процент от прибыли для сотрудника " + _Агент + ": " + КВЗП + "%.
	|ВМ = " + Формат(Прибыль,Ф) + "р * " + КВЗП + "% = " + Формат(ВознаграждениеМенеджера,Ф) + "р.";
	ДобавитьВычетСАгента(ОП, Инфо, ВознаграждениеМенеджера);
	Если НЕДобавлятьСтатистикувИнфо Тогда 
		Возврат;
	КонецЕсли;	
	Инфо = Инфо + "
	|
	|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_ПланПоСКВ(ОП, Инфо, ВознаграждениеМенеджера, Стат = Неопределено, НЕДобавлятьСтатистикувИнфо = Ложь)
	
	//Схема мотивации «План по СКВ»
	//СКВ = Сумма КВ - Скидка
	//В расчетах используется формула:
	//СКВ =ПолученоОтКлиента-ВыплаченнаяСкидкаПослеОплаты-СуммаДляСК(за минусом КВ)
	//На отчетный месяц ставится План и СсуперПлан по сумме СКВ (уб_ЗП_Схема_ПланПоСКВ_Планы, уб_ЗП_Схема_ПланПоСКВ_СуперПланы)
	//При НЕ выполнении плана сотрудник получает процент ставки До Плана от СКВ  
	//При выполнении плана сотрудник получает процент ставки После Плана от минимальной из сумм СКВ и Размер СуперПлана  
	//При превышении СуперПлана, с суммы превышения суперплана менеджер получает по ставе превышения суперплана
	// Ставки До Плана, После Плана и Превышение Суперплана устанавливаются в уб_ЗП_Схема_ПланПоСКВ_ПроцентныеСтавки
	
	//расчет ВМ и ДБ для конкретной оплаты по этой схеме не производится, поскольку ВМ м ВР расчитываются по результатм ЗП периода
	Инфо = Инфо + "
	|
	|Расчет ВМ по отдельной оплате не производится.
	|СКВ определяется как: ПолученоОтКлиента-ВыплаченнаяСкидкаПослеОплаты-СуммаДляСК(за минусом КВ),
	|Общий расчет ВМ производится в конце месяца.";
	ВознаграждениеМенеджера = 0;
	Если НЕДобавлятьСтатистикувИнфо Тогда 
		Возврат;
	КонецЕсли;
	Если Стат = Неопределено Тогда
		Стат = ПолучитьСтруктуруСтатистики();
		Стат.ЗарплатныйПериод = ОП.Знч("ЗарплатныйПериод"); 
		Стат.Агент = ОП.Знч("Агент"); 
		Стат.ОП = ОП.Знч("Ссылка"); 
		ПолучитьСтатистикуПоКорпоративнымОплатамЗаМесяц(Стат);	
	КонецЕсли;
	Инфо = Инфо + "
	|
	|" + ПолучитьСтрокуСтатистикиПоКАСКО(Стат);
	
КонецПроцедуры

Процедура ПолучитьВМдляСхемы_СтраховойПродукт_Фикс(ОП, Инфо, ВознаграждениеМенеджера)
	
	ВознаграждениеМенеджера  = ОП.Знч("СтраховойПолис").СтраховойПродукт.ВознаграждениеМенеджера;
	
КонецПроцедуры	
///////////////////////////////////////////////////////////////////////////



Функция ПолучитьВознаграждениеМенеджера2(ОП, 
	ВознаграждениеМенеджера, 
	ИнфоКрасчетуВМ, 
	СхемаРасчета, 
	СтатПоКАСКО = Неопределено, 
	НЕДобавлятьСтатистикувИнфо = Ложь,
	СведенияОСквитованныхОплатах = Неопределено,СуммаПоПриемкам=0) Экспорт
	
	Ф = "ЧН=0; ЧГ=";
	
	ВознаграждениеМенеджера = 0;
	
	//Если НЕ уб_СС.ОП_ВозможноРедактирование(ОП) Тогда
	//	Возврат 0;	
	//КонецЕсли;
	Если НЕ СведенияОСквитованныхОплатах = Неопределено Тогда
		БалансОплаты = СведенияОСквитованныхОплатах.Итог("НачисленнаяСуммаВзносаВКЛ")
		//- СведенияОСквитованныхОплатах.Итог("АВилиСкидкаСумма")
		- СведенияОСквитованныхОплатах.Итог("КВСумма")
		- СуммаПоПриемкам
		+ СведенияОСквитованныхОплатах.Итог("СкидкаВыплаченаяКлиенту");
	Иначе
		БалансОплаты = 0;
	Конецесли;
	//Если ОП.КВСумма < ОП.АВилиСкидкаСумма Тогда
	Если БалансОплаты>0 Тогда
		//ВознаграждениеМенеджера = ОП.КВСумма - ОП.АВилиСкидкаСумма;
		УжеУчтено = -(СведенияОСквитованныхОплатах.Итог("ВознаграждениеМенеджера")-ОП.Знч("ВознаграждениеМенеджера"));
		ВознаграждениеМенеджера = -(БалансОплаты-УжеУчтено);
		Если ВознаграждениеМенеджера<>0 Тогда
			ИнфоКрасчетуВМ = "Недостаточно средств, которые надо оплатить поставщику " + Формат(-ВознаграждениеМенеджера,Ф) + "р, компенсируется менеджером.";
			//ИнфоКрасчетуВМ = "Сумма предоставленной скидки превышает КВ брокера на сумму " + Формат(-ВознаграждениеМенеджера,Ф) + "р, которая удерживается с сотрудника";
			
			//ДобавитьВычетСАгента(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера);//Не добавялем будет задвоение	
			
			Возврат ВознаграждениеМенеджера;	
		КонецЕсли;
	КонецЕсли;
	
	//Если ОП.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО Тогда 
	//	//Здесь ничего не делаем	
	//ИначеЕсли ОП.ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО Тогда
	//	//Здесь ничего не делаем	
	//Иначе	
	//	ИнфоКрасчетуВМ = "ВМ по виду страховых продуктов '" + ОП.ВидСП + "' по этой схеме расчетов не начисляется.";
	//	ВознаграждениеМенеджера = 0;
	//	Возврат  ВознаграждениеМенеджера;
	//КонецЕсли;
	
	//20120607
	//УстЗнач(ОП.Подразделение, уб_СС.ПолучитьПодразделениеАгента(ОП.Агент, ОП.ЗарплатныйПериод, Ложь, Истина), Неопределено);
	_Агент = ОП.Знч("Агент");
	_Подразделение = уб_СС.ПолучитьПодразделениеАгента(_Агент, ОП.Знч("Дата"), Ложь, Истина);
	Если Не УстЗнач(ОП,"Подразделение", _Подразделение, Неопределено) Тогда
		_Подразделение = ОП.Знч("Подразделение");//Раз не установили, запрашиваем текущее
	КонецЕсли;	
	ПВР = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП;
	
	тз = уб_СтраховойБрокер.ПолучитьСхемуРасчетаСМенеджером(ОП.Знч("ЗарплатныйПериод"), _Подразделение.Владелец, _Подразделение, _Агент, ОП.Знч("ВидСП"));
	Если тз.Количество() > 0 Тогда
		СхемаРасчета = тз[0].СхемаРасчета;
	Иначе
		СхемаРасчета = ПВР.БезРасчета;
		Сообщить("Ошибка при получении вида расчета с менеджером.",СтатусСообщения.ОченьВажное);
		Возврат  ВознаграждениеМенеджера;
	КонецЕсли;
	
	
	Если СхемаРасчета = ПВР.БезРасчета Тогда
		
		ИнфоКрасчетуВМ = "Вознаграждение не начисляется (Схема 'Без Расчета'). ";
		ВознаграждениеМенеджера = 0;
		
	ИначеЕсли СхемаРасчета = ПВР.ПланПоСКВ Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'План по СКВ'. ";
		ПолучитьВМдляСхемы_ПланПоСКВ(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера, СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
	ИначеЕсли СхемаРасчета = ПВР.СтраховойПродукт_Фикс Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Фиксированная сумма по страховому продукту'. ";
		ПолучитьВМдляСхемы_СтраховойПродукт_Фикс(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера);
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_2500 Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме '2500 за КАСКО'. ";
		ПолучитьВМдляСхемы_КАСКО_2500(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера, СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
		
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_ОкладПремия Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Оклад+Премия'. ";
		ПолучитьВМдляСхемы_КАСКО_ОкладПремия(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера, СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
		
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_Процент Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Процент'. ";
		ПолучитьВМдляСхемы_КАСКО_Процент_от_СКВ_суперплан_по_количеству_новых_страховок(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера, _Подразделение, СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
		
	ИначеЕсли СхемаРасчета = ПВР.КАСКО_Фикс Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Фикс за страховку'. ";
		ПолучитьВМдляСхемы_КАСКО_Фикс(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера, СтатПоКАСКО, НЕДобавлятьСтатистикувИнфо);
		
	ИначеЕсли СхемаРасчета = ПВР.ОСАГО_Фикс Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Фикс за ОСАГО'. ";
		ПолучитьВМдляСхемы_ОСАГО_Фикс(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера);
		
	ИначеЕсли СхемаРасчета = ПВР.ОСАГО_Фикс_Администратор Тогда
		
		ИнфоКрасчетуВМ = "Расчет по схеме 'Фикс за ОСАГО для администратора'. ";
		ПолучитьВМдляСхемы_ОСАГО_Фикс_Администратор(ОП, ИнфоКрасчетуВМ, ВознаграждениеМенеджера);
		
		
	ИначеЕсли НЕ СхемаРасчета.Предопределенный Тогда
		ИнфоКрасчетуВМ = "Фиксированный процент от СКВ";
		ВознаграждениеМенеджера = СхемаРасчета.Показатель*(ОП.Знач("КВСуммаДляАгента") - ОП.Знч("СкидкаВыплаченаяКлиенту"))/100;
	Иначе	
		
		Сообщить("Ошибка расчета ВМ (получена неизвестная схема расчета: '" + СхемаРасчета + "').",СтатусСообщения.ОченьВажное);
		
	КонецЕсли;
	
	Возврат  ВознаграждениеМенеджера;
КонецФункции

//TODO актуально или удалить?
Процедура ОП_ПересчетСумм_внешний(ОП, ИнфоКВМ = "", СтатПоКАСКО = Неопределено, НомерНовогоПлатежа, НомерПереданнойОплаты) Экспорт
	
	//Если СтатПоКАСКО <> Неопределено Тогда
	//	СтатПоКАСКО.Вставить("НовыхПолисовДоПереданной", 	НомерНовогоПлатежа - 1);
	//	СтатПоКАСКО.Вставить("НомерПереданнойОплаты", 		НомерПереданнойОплаты);
	//КонецЕсли;
	//Параметры = СтруктураПараметровОППересчетСуммПоУмолчанию();
	//Параметры.ИнфоКВМ 		= ИнфоКВМ;
	//Параметры.СтатПоКАСКО   = СтатПоКАСКО;
	//ОП_ПересчетСумм(ОП, Неопределено, ИнфоКВМ, СтатПоКАСКО);
	
КонецПроцедуры

Процедура ОП_ПересчетСумм_Страхователь(ОП, Форма, ПараметрыПересчета, Параметры)

	РасчетныеПоля = Параметры.РасчетныеПоля;
	//по новой системе скидка АВили расчитывается от ОплаченоФакт, а не наоборот
	//TODO ПО АВ
	//убрал проверки на ВКассу (скидка может быть и при безнале в обход банка)
	//и на УстанавливатьАВилиСкидкаЕслиРасчетПоАВ - проверить загрузку ВЗР
	//она только там используется
	_ОплаченоФакт = ОП.Знч("ОплаченоФакт");
	_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса")+ОП.Знч("СуммаДоп") - _ОплаченоФакт + ОП.Знч("СкидкаВыплаченаяКлиенту"), 2);				
	Если ОП.Знч("НачисленнаяСуммаВзноса") > 0 Тогда
		_АВилиСкидкаПроцент = Окр(_АВилиСкидкаСумма * 100 / ОП.Знч("НачисленнаяСуммаВзноса"), 2);
	Иначе	
		_АВилиСкидкаПроцент = 0;
	КонецЕсли;
	Если Не РасчетныеПоля.СистемаНаправлениеПлатежа И РасчетныеПоля.ВКассу Тогда
		УстЗнч(ОП, "СкидкаВыплаченаяКлиенту", 0, РасчетныеПоля.бЗаблокирована);
	КонецЕсли;
	УстЗнч(ОП, "АВилиСкидкаПроцент", 	_АВилиСкидкаПроцент, 	РасчетныеПоля.бЗаблокирована);
	УстЗнч(ОП, "АВилиСкидкаСумма",		_АВилиСкидкаСумма,		РасчетныеПоля.бЗаблокирована);
	//старый код
	//УстанавливатьАВилиСкидкаЕслиРасчетПоАВ = Не РасчетПоАВ Или Параметры.УстанавливатьКВДляАгента;
	//Если РасчетПоАВ Тогда
	//	_АВилиСкидкаПроцент = ОП.Знч("АВилиСкидкаПроцент");
	//	_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") * _АВилиСкидкаПроцент / 100, 2); 
	//	_ОплаченоФакт = ОП.Знч("НачисленнаяСуммаВзноса") - ?(ВКассу И УстанавливатьАВилиСкидкаЕслиРасчетПоАВ, _АВилиСкидкаСумма, 0);
	//Иначе
	//	Если ВКассу Тогда
	//		УстЗнч(ОП, "СкидкаВыплаченаяКлиенту", 0, бЗаблокирована);
	//	КонецЕсли;
	//	_ОплаченоФакт = ОП.Знч("ОплаченоФакт");
	//	_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") - _ОплаченоФакт + ОП.Знч("СкидкаВыплаченаяКлиенту"), 2);				
	//	Если ОП.Знч("НачисленнаяСуммаВзноса") > 0 Тогда
	//		_АВилиСкидкаПроцент = Окр(_АВилиСкидкаСумма * 100 / ОП.Знч("НачисленнаяСуммаВзноса"), 2);
	//	Иначе	
	//		_АВилиСкидкаПроцент = 0;
	//	КонецЕсли;				 
	//КонецЕсли;	
	//Если УстанавливатьАВилиСкидкаЕслиРасчетПоАВ Тогда
	//	УстЗнч(ОП, "АВилиСкидкаПроцент", _АВилиСкидкаПроцент, бЗаблокирована);
	//	Если УстЗнч(ОП, "АВилиСкидкаСумма", _АВилиСкидкаСумма, бЗаблокирована) Тогда
	//		ПараметрыПерерасчета.Менеджер = Истина
	//	КонецЕсли;
	//КонецЕсли;
	//УстЗнч(ОП, "ОплаченоФакт", _ОплаченоФакт, бЗаблокирована);

КонецПроцедуры

Процедура ОП_ПересчетСумм_КВ(ОП, Форма, ПараметрыПерерасчета, Параметры)

	РасчетныеПоля = Параметры.РасчетныеПоля;
	_Разрядность = ОП.Знч("РазрядностьОкругления");
	_РежимОкругления  = ОП.Знч("РежимОкругления");
	//НеМенятьАВ не может при виде расчета не при АВ
	//20260512 - удеражеие 3% блокируется этой кнопкой
	//Если Не РасчетныеПоля.РасчетПоАВ Тогда
	//Если Не ОП.Знч("ВидРасчетаСАгентом") = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда 
	//	УстЗнч(ОП, "НеМенятьАВ", Ложь, РасчетныеПоля.бЗаблокирована);
	//КонецЕсли;
	//УстановитьКВиАВ
	//ТребуетсяУстановкаКВ = (Не ОП.Знч("НеМенятьКВ") И ОП.Знч("КВПроцент") = 0 И ОП.Знч("КодКВ") = 0) Или Параметры.ОткрыватьФормуВыбораКВиАВ;
	Если Параметры.КВАгентаРавноКВ = Неопределено Тогда
		Если НЕ РасчетныеПоля.РасчетПоАВ 
			и НЕ (ОП.ВидС = Перечисления.уб_ВидыСтрахования.ВЗР
			ИЛИ ОП.ВидС = Перечисления.уб_ВидыСтрахования.Ипотека)
			и ОП.Знч("ЗарплатныйПериод")>=Дата(2026,1,1)	 
			и ОП.Знч("ФормаОплаты")     = Перечисления.уб_ФормыОплаты.Поставщику
			Тогда
			Если ОП.Знч("НеМенятьАВ") = ЛОЖЬ Тогда
				Если ОП.Знч("КВПроцентУдержания") < 3 Тогда
					ОП.УстЗнч("КВПроцентУдержания",Мин(3,ОП.Знч("КВПроцентДляАгента")));
					ОП.УстЗнч("КВСуммаУдержания",уб_ОКР(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцентУдержания") / 100, _Разрядность,_РежимОкругления));
				КонецЕсли;	
			КонецЕсли;	
			//Дельта = 3;
			//Параметры.КВАгентаРавноКВ = ЛОЖЬ; 
			//Если ОП.Знч("КВПроцент")- ОП.Знч("КВПроцентДляАгента")>Дельта Тогда
			//Иначе
			//	ОП.УстЗнч("КВПроцентДляАгента",Макс(0,ОП.Знч("КВПроцент")-Дельта));
			//КонецЕсли;	
		ИначеЕсли (РасчетныеПоля.РасчетПоАВ или ОП.ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ)
			и НЕ (ОП.ВидС = Перечисления.уб_ВидыСтрахования.ВЗР
			ИЛИ ОП.ВидС = Перечисления.уб_ВидыСтрахования.Ипотека)
			и ОП.Знч("ЗарплатныйПериод")>=Дата(2026,1,1)	 
			и ОП.Знч("ФормаОплаты")     = Перечисления.уб_ФормыОплаты.Поставщику
			Тогда
			
			Если ОП.Знч("НеМенятьАВ") = ЛОЖЬ Тогда
				Если ОП.Знч("КВПроцентУдержания") < 3 Тогда
					ОП.УстЗнч("КВПроцентУдержания",Мин(3,ОП.Знч("КВПроцентДляАгента")));
					ОП.УстЗнч("КВСуммаУдержания",уб_ОКР(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцентУдержания") / 100, _Разрядность,_РежимОкругления));
				КонецЕсли;	
			КонецЕсли;	
			
			Дельта = 6;
			Параметры.КВАгентаРавноКВ = ЛОЖЬ; 
			Если ОП.Знч("КВПроцент")- ОП.Знч("КВПроцентДляАгента")>Дельта Тогда
			Иначе
				ОП.УстЗнч("КВПроцентДляАгента",Макс(0,ОП.Знч("КВПроцент")-Дельта));
			КонецЕсли;		
		ИначеЕсли ОП.Знч("КВПроцентУдержания")>0 и ОП.Знч("НеМенятьАВ") = ЛОЖЬ Тогда
			//Поменяли
			ОП.УстЗнч("КВПроцентУдержания",0);
			ОП.УстЗнч("КВСуммаУдержания",0);
			
		Иначе	
			//Параметры.КВАгентаРавноКВ = ?(РасчетныеПоля.РасчетПоАВ, Ложь, ОП.Знч("КВПроцент") = ОП.Знч("КВПроцентДляАгента")); 
		КонецЕсли;	
	КонецЕсли;
	Если ОП.Знч("КВПроцентУдержания")>0  и ОП.Знч("КВПроцентДляАгента") = 0 Тогда
		ОП.УстЗнч("КВПроцентУдержания",0);
		ОП.УстЗнч("КВСуммаУдержания",0);
	ИначеЕсли ОП.Знч("КВПроцентУдержания")>=0 Тогда	
		//синхронизация суммы, могут исправить процент руками при заблокированном АВ
		ОП.УстЗнч("КВСуммаУдержания",уб_ОКР(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцентУдержания") / 100, _Разрядность,_РежимОкругления));
	КонецЕсли;	
	Параметры.КВАгентаРавноКВ = ?(РасчетныеПоля.РасчетПоАВ, Ложь, ОП.Знч("КВПроцент") = ОП.Знч("КВПроцентДляАгента")); 
	Если Параметры.ОтключитьВыравниваниеКВ = Неопределено Тогда
		Если РасчетныеПоля.бФорма Тогда
			Параметры.ОтключитьВыравниваниеКВ = Форма.ОтключитьВыравниваниеКВ
		Иначе
			Параметры.ОтключитьВыравниваниеКВ = ОП.Знч("КВПроцент") <> ОП.Знч("КВПроцентДляОтчета")
		КонецЕсли;
	КонецЕсли;
	//проверяем согласование оплаты - нужно ли менять КВПроцент
	//TODO почистить УстановитьКВиАВ от установки данных страхового полиса, подразделений и прочего - вывести сюда
	Если Параметры.УстанавливатьКВИАВ И Не ОплатаСогласована(ОП, 3) Тогда
		ТребуетсяУстановкаКВ =  Параметры.ОткрыватьФормуВыбораКВиАВ;//Ложь;//!!!! (Не ОП.Знч("НеМенятьКВ")) Или Параметры.ОткрыватьФормуВыбораКВиАВ;
		ТребуетсяУстановкаАВ = (Не ОП.Знч("НеМенятьАВ") И ОП.Знч("КВСуммаДляАгента") = 0 И РасчетныеПоля.РасчетПоАВ);
		Если Не ТребуетсяУстановкаКВ И ТребуетсяУстановкаАВ Тогда 	
			НеПереустанавливатьРанееВыбранноеКВ = ОП.Знч("КодКВ") <> 0;		
			ПроверятьАктуальностьКВ = Истина;		
			ОП.УстановитьКВиАВ(НеПереустанавливатьРанееВыбранноеКВ, ПроверятьАктуальностьКВ, Параметры);
			_АВилиСкидкаПроцент = ОП.Знч("АВилиСкидкаПроцент");
			_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") * _АВилиСкидкаПроцент / 100, 2); 
		ИначеЕсли ТребуетсяУстановкаКВ Тогда
			ОП.УстановитьКВиАВ(,, Параметры);
		КонецЕсли;
	КонецЕсли;
	
	Если РасчетныеПоля.бФорма И Не Форма.ОтключитьВыравниваниеКВ Тогда //Может быть форма без этих реквизитов (взаиморасчетный диалог)
		Если УстЗнч(ОП, "КВПроцентДляОтчета", ОП.Знч("КВПроцент"), РасчетныеПоля.бЗаблокирована) Тогда
			ПараметрыПерерасчета.Поставщик = Истина
		КонецЕсли;
	КонецЕсли;
	
	КВСуммаРасчетное = уб_ОКР(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцент") / 100, _Разрядность,_РежимОкругления);
	ТекКВСумма   = ОП.Знч("КВСумма");
	ТекКВПроцент = ?(РасчетныеПоля.СуммаВзносаДляРасчетов = 0,999.99,// "Бесконечность" подумать может ли вызывать ложный пеерсчет или сброс
	ТекКВСумма*100/РасчетныеПоля.СуммаВзносаДляРасчетов);
	ПроцентРасхождения = Макс(ТекКВПроцент,ОП.Знч("КВПроцент"))-Мин(ТекКВПроцент,ОП.Знч("КВПроцент"));
	Если ОП.Знч("НеМенятьКВ") = Истина  и ПроцентРасхождения > 0.0145 Тогда
		//Если большое расхождение в процентах, то это не проблема округлений, замок неверно взведен
		//Попытка снять
		
		Если УстЗнч(ОП, "НеМенятьКВ", Ложь, РасчетныеПоля.бЗаблокирована) = Истина 
			и РасчетныеПоля.бФорма  Тогда //Если есть форма, то в ней тоже требуется обновление
			Форма.ОбновитьСостояниеФиксацииКВ();
		КонецЕсли;	
	КонецЕсли;	
	Если ОП.Знч("НеМенятьКВ") = Истина и ПроцентРасхождения <= 0.0145 Тогда //Расчитать надо правильно, даже если нельзя внести изменения
		КВСумма = ТекКВСумма; 
	Иначе
		КВСумма = КВСуммаРасчетное;//уб_ОКР(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцент") / 100, _Разрядность,_РежимОкругления);
		УстЗнч(ОП, "КВСумма", КВСумма, РасчетныеПоля.бЗаблокирована);
	КонецЕсли;
	
	КВСинхронизировано = Ложь;
	Если Параметры.УстанавливатьКВДляАгента Тогда
		Если Не РасчетныеПоля.РасчетПоАВ И Параметры.КВАгентаРавноКВ Тогда
			УстЗнч(ОП, "КВПроцентДляАгента", 	ОП.Знч("КВПроцент"), РасчетныеПоля.бЗаблокирована);
			УстЗнч(ОП, "КВСуммаДляАгента", 		ОП.Знч("КВСумма"), РасчетныеПоля.бЗаблокирована);
			КВСинхронизировано = Истина;
		КонецЕсли;
		//Если РасчетПоАВ Тогда
		//	//процент агента РАНЕЕ синхронизировался с АВ 
		//	//УстЗнч(ОП, "КВПроцентДляАгента", 	ОП.Знч("АВилиСкидкаПроцент"), бЗаблокирована);
		//	//УстЗнч(ОП, "КВСуммаДляАгента", 		ОП.Знч("АВилиСкидкаСумма"), бЗаблокирована);
		//ИначеЕсли Параметры.КВАгентаРавноКВ Тогда
		//	//КВ агента синхронизируется, только при их совпадении
		//	УстЗнч(ОП, "КВПроцентДляАгента", 	ОП.Знч("КВПроцент"), бЗаблокирована);
		//	УстЗнч(ОП, "КВСуммаДляАгента", 		ОП.Знч("КВСумма"), бЗаблокирована);
		//КонецЕсли;
	КонецЕсли;
	Если КВСинхронизировано= Истина или Параметры.КВАгентаРавноКВ=Ложь Тогда
		СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("СуммаФикс",ОП.Знч("Агент"),ОП.Знч("ЗарплатныйПериод"),-1);
		ПроцентФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ПроцентФикс",ОП.Знч("Агент"),ОП.Знч("ЗарплатныйПериод"),-1);
		
		
		Заявка= ОП.Знч("СтраховойПолис").Заявка;
		
		
		БезДоставки = ?(ЗначениеЗаполнено(Заявка)и ((Заявка.ЗаблокироватьАвторасчет = Истина и Заявка.ОплатитьВКассуЗаВыездКурьера =0) или Заявка.Самовыезд),Истина , Ложь);
		Если БезДоставки = Истина Тогда
			СуммаФикс =0;
		КонецЕсли;	
		
		Если РасчетныеПоля.РасчетПоАВ и (СуммаФикс>0 или ПроцентФикс>0) и ОП.НеМенятьАВ=Ложь Тогда
			 
			ЗаФиксПроцент = ?(ПроцентФикс>0,ОП.Знч("НачисленнаяСуммаВзноса")*ПроцентФикс/100,0);
			КВСуммаДляАгента =  Макс(ОП.Знч("КВСумма")- СуммаФикс-ЗаФиксПроцент,0);
			КВПроцентДляАгента = Окр(?(КВСуммаДляАгента=0,0,Окр(КВСуммаДляАгента*100/ОП.Знч("НачисленнаяСуммаВзноса"))),2);
			УстЗнч(ОП, "КВПроцентДляАгента", КВПроцентДляАгента, РасчетныеПоля.бЗаблокирована);
		ИначеЕсли Параметры.Свойство("КВАгентаУжеПосчитан") и Параметры.КВАгентаУжеПосчитан = Истина Тогда
			//ничего не делать
		Иначе
			КВСуммаДляАгента = Окр(ОП.Знч("НачисленнаяСуммаВзноса") * ОП.Знч("КВПроцентДляАгента") / 100, 2);
			// при изменении начисленной суммы взноса не происходил пересчет КВСуммаДляАгента
		КонецЕсли;
		УстЗнч(ОП, "КВСуммаДляАгента", КВСуммаДляАгента, РасчетныеПоля.бЗаблокирована);
	КонецЕсли;
	
	
	
	//Недостано средств
	//РасчетныйАВилиСумма	= Окр(ОП.Знч("НачисленнаяСуммаВзноса")+ОП.Знч("СуммаДоп") - ОП.Знч("ОплаченоФакт"), 2);
	
	// новая система. Пока привяжемся к константе направлений платежа для отладки
	Если РасчетныеПоля.СистемаНаправлениеПлатежа Тогда
		КВСуммаДляАгента = ОП.Знч("КВСуммаДляАгента");
		АВилиСкидкаСумма = ОП.Знч("АВилиСкидкаСумма");
		АВилиСкидкаПроцент = ОП.Знч("АВилиСкидкаПроцент");
		СкидкаВыплаченаяКлиенту = ОП.Знч("СкидкаВыплаченаяКлиенту");
		
		//Производится коррекция полей при изменении схемы оплаты, 
		//для сохранения цикличности значений, например при откате выбора назад, иначе может происходить изменение АВ менеджера 
		Если РасчетныеПоля.РасчетПоАВ  Тогда //Схема
			Разница = КВСуммаДляАгента - АВилиСкидкаСумма;
			Если Разница <> 0 Тогда 
				//Если ОП.Знч("ВидРасчетаСАгентом") <> Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда //Вид
					
					СкидкаВыплаченаяКлиенту = СкидкаВыплаченаяКлиенту + Разница;
				//Иначе
				//	Если КВСуммаДляАгента = ОП.Знч("КВСумма") Тогда 
				//		//Было синхронизировано с кв брокера, приравниваем к скидке/несданной сумме
				//		//АВилиСкидкаСумма = КВСуммаДляАгента;//
				//		КВСуммаДляАгента    = АВилиСкидкаСумма;
				//		//АВилиСкидкаПроцент = КВПроцентДляАгента;//
				//		КВПроцентДляАгента  = АВилиСкидкаПроцент;
				//	КонецЕсли;
				//	
				//КонецЕсли;
				
			КонецЕсли;	
		Иначе	
			Если ОП.Знч("ВидРасчетаСАгентом") = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда //Вид
				//Расчет по АВ, а схема СКВ
				Если КВСуммаДляАгента = АВилиСкидкаСумма и ОП.НеМенятьАВ = Ложь Тогда 
					
					Если ОП.Знч("СкидкаВыплаченаяКлиенту")<>0 Тогда
						//Значит в поле скидка была разница КВ и факт уплачено(то что менеджер должен был забрать позднее)
						СкидкаВыплаченаяКлиенту = 0;
					КонецЕсли;
					
					КВСуммаДляАгента   = ОП.Знч("КВСумма");
					КВПроцентДляАгента = ОП.Знч("КВПроцент");
					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		УстЗнч(ОП, "КВСуммаДляАгента",   КВСуммаДляАгента, РасчетныеПоля.бЗаблокирована);
		Если УстЗнч(ОП, "КВПроцентДляАгента", КВПроцентДляАгента, РасчетныеПоля.бЗаблокирована) Тогда
			//требуется ниже досчитать КВ менеджера
			ПараметрыПерерасчета.Менеджер = Истина;
			Параметры.ПересчетВМ          = Истина;
		КонецЕсли;	
		
		УстЗнч(ОП,"ВМпоРезультатамПериодаЗП",ОП.Знч("СхемаРасчетаСМенеджером") = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ, РасчетныеПоля.бЗаблокирована);
		
		Если УстЗнч(ОП, "СкидкаВыплаченаяКлиенту", СкидкаВыплаченаяКлиенту, РасчетныеПоля.бЗаблокирована) Тогда
			ОП_ПересчетСумм_Страхователь(ОП, Форма, ПараметрыПерерасчета, Параметры);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОП_ПересчетСумм_Менеджер(ОП, Форма, ПараметрыПерерасчета, Параметры)

	РасчетныеПоля = Параметры.РасчетныеПоля;
	//--- в случае, если ДС недостаточно покрыть платежи поставщику или скидку клиенту, происходит удержание с менеджера
	//
	УстЗнч(ОП, "Подразделение", уб_СС.ПолучитьПодразделениеАгента(ОП.Знч("Агент"), ОП.Знч("ЗарплатныйПериод"), Ложь, Истина), РасчетныеПоля.бЗаблокирована);
	_ВознаграждениеМенеджера = 0;
	__ПримечаниеКОплатеАгентом = "";
	ПВР = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП;
	//_СхемаРасчетаСМенеджером = ПВР.БезРасчета; 
	__ВознаграждениеМенеджера = 0;
	СтруктураПолей = СтруктураПолейДляРасчетаСКВ(ОП);
	СтруктураСКВ = ПолучитьСКВ(СтруктураПолей, "структура");
	__СКВ 		= СтруктураСКВ.СКВ;
	__СКВАгента = СтруктураСКВ.СКВДляАгента;
	//Если __СКВ =0 и ОП.Знч("СуммаДоп") >0 и ОП.Знч("ОплаченоФакт") >= ОП.Знч("СуммаДоп") Тогда
	//	__СКВ = ОП.Знч("СуммаДоп");
	
	Если Окр(ОП.Знч("НачисленнаяСуммаВзноса")+ОП.Знч("СуммаДоп") - ОП.Знч("ОплаченоФакт"), 2)<=0 Тогда
		//Все оплачено
		//__СКВ = __СКВ+ОП.Знч("СуммаДоп");//Что-то неведомое убрал. скв посчитано выше уже верно, скорее всго артифакт
		//__СКВАгента !!! не меняем
	КонецЕсли;
			
	Если РасчетныеПоля.РасчетПоАВ Тогда
		_КОплатеАгентом = ОП.Знч("НачисленнаяСуммаВзноса") - ОП.Знч("ОплаченоФакт") - ОП.Знч("АВилиСкидкаСумма") + ОП.Знч("ВычетСАгента");
		//__ВознаграждениеМенеджера = ОП.Знч("АВилиСкидкаСумма") + ОП.Знч("ВычетСАгента");
		__ВознаграждениеМенеджера = ОП.Знч("КВСуммаДляАгента") + ОП.Знч("ВычетСАгента")- ОП.Знч("КВСуммаУдержания");
		__ДоходБрокера = ОП.Знч("КВСумма") - __ВознаграждениеМенеджера;
		ЗарплатныйПериод  = Оп.Знч("ЗарплатныйПериод");
		Если ЗарплатныйПериод<Дата(2016,1,1) или ЗначениеЗаполнено(ОП.Знч("СхемаРасчетаСМенеджером"))=Ложь  Тогда
			_СхемаРасчетаСМенеджером = ПВР.ПоАВ;
		КонецЕсли;
		
		//_ВознаграждениеМенеджера =//
		//Если ОП.Знч("НачисленнаяСуммаВзноса") <= 0 Тогда
			//__СКВ = 0;
			//__СКВАгента = 0;
		//Иначе	
			//__СКВ = ?(ОП.Знч("АВилиСкидкаСумма") > ОП.Знч("КВСумма"), 0, ОП.Знч("КВСумма") - ОП.Знч("АВилиСкидкаСумма"));//В расчет не попадает, но расчитаем и покажем в форме
			//__СКВАгента = ?(ОП.Знч("АВилиСкидкаСумма")>ОП.Знч("КВСуммаДляАгента"),0,ОП.Знч("КВСуммаДляАгента") - ОП.Знч("АВилиСкидкаСумма"));//В расчет не попадает, но расчитаем и покажем в форме
		//КонецЕсли;		
	Иначе
		Если ЗначениеЗаполнено(ОП.Знч("СхемаРасчетаСМенеджером")) = Ложь  Тогда
			_СхемаРасчетаСМенеджером = ПВР.ПланПоСКВ;
		КонецЕсли;

		//Расчет По Схеме - блокировка АВ не требуется
		//20260512 - На это значение завязана блокировка 3%
		//Если Не ОП.Знч("ВидРасчетаСАгентом") = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда 
		//	//Добавлено условие с учетом использования ПрименитьСебестоимость()
		//	УстЗнч(ОП, "НеМенятьАВ", Ложь, РасчетныеПоля.бЗаблокирована);
		//КонецЕсли;	
		Если ОП.Знч("ИсключитьИзРасчетаЗП") = ЛОЖЬ Тогда //Должно быть всегда
			//Параметры.СведенияОСквитованныхОплатах 	= Неопределено;
			//Параметры.СуммаПоПриемкам 				= 0;
			Если НЕ Параметры.СведенияОСквитованныхОплатах = Неопределено Тогда
				уб_СС.ОбновитьДанныеОплатыВКвитовке(Параметры.СведенияОСквитованныхОплатах,ОП);
			КонецЕсли;
			Параметры.НетКвитовкиПоСуммам = Не уб_СС.КвитовкаПоСуммам(
				?(Оп.ЭтоНовый(),Оп.ПолучитьСсылкуНового(),ОП.Знч("Ссылка")),
				,
				Параметры.СуммаПоПриемкам,
				,
				?(РасчетныеПоля.ЭтоФорма,ОП.Знч("ЭтотОбъект"),ОП), 
				Параметры.СведенияОСквитованныхОплатах,
				Параметры.СведенияОСквитованныхПриемках,
				Параметры.УИДГруппыКвитовки);
			    //
			ПолучитьВознаграждениеМенеджера(
				ОП,
				Параметры,
				_ВознаграждениеМенеджера, 
				_СхемаРасчетаСМенеджером, 
				Истина
				);
		КонецЕсли;
		_СуммаДляСК = РасчетныеПоля.СуммаВзносаДляРасчетов - ОП.Знч("КВСумма");
		_ПолученоОтКлиентаФакт = (ОП.Знч("ОплаченоФакт") - ОП.Знч("СкидкаВыплаченаяКлиенту"));
		Если _ПолученоОтКлиентаФакт < _СуммаДляСК Тогда
			//Это условие соответствует условию КВСумма < АВилиСкидкаСумма
			_КОплатеАгентом = _СуммаДляСК - _ПолученоОтКлиентаФакт;
			Если ОП.Знч("НаправлениеПлатежа") = Перечисления.уб_НаправленияПлатежа.ВБрокер Тогда
				__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) больше фактически оплаченной суммы (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена максимальная из двух сумм.";
			Иначе
				__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) меньше суммы, фактически переведенной брокеру (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена сумма недоплаты.";
			КонецЕсли;
			//_КОплатеАгентом = _СуммаДляСК - _ПолученоОтКлиентаФакт;
			//Если ВКассу Тогда
			//	__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) больше фактически оплаченной суммы (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена максимальная из двух сумм.";
			//	_КОплатеАгентом = _СуммаДляСК;
			//Иначе
			//	__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) меньше суммы, фактически переведенной брокеру (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена сумма недоплаты.";
			//	_КОплатеАгентом = _СуммаДляСК - _ПолученоОтКлиентаФакт;
			//КонецЕсли;
			//__СКВ = 0;
			//__СКВАгента = 0;
			__ДоходБрокера = 0;
			__ВознаграждениеМенеджера = ОП.Знч("ВознаграждениеМенеджера");
			//Случай когда средств недостаточно, они компенсируются за счет менеджера					
		Иначе
			//Если ВКассу Тогда
			//	_КОплатеАгентом = _ПолученоОтКлиентаФакт;
			//Иначе
			//	_КОплатеАгентом = 0;
			//КонецЕсли;
			_КОплатеАгентом = 0;
			//__СКВ = _ПолученоОтКлиентаФакт - _СуммаДляСК;                                                          
			//__СКВАгента = _ПолученоОтКлиентаФакт - (СуммаВзносаДляРасчетов - ОП.Знч("КВСуммаДляАгента")); 
			__ВознаграждениеМенеджера = 0;
			_вм =Неопределено;
			Если ОП.Знч("ВМпоРезультатамПериодаЗП")=Истина Тогда
				__ДоходБрокера = 0;
				//TODO Расчет выполнения плана
				Если Параметры.ПересчетВМ = ИСТИНА Тогда							
					//еще: получается, сейчас возможно поменять данные в оплате, которые не учтутся в быстром расчете до записи оплаты.
					Если Параметры.ДанныеПоЗПМенеджерам=Неопределено Тогда
						//тз = РасчетЗП_Быстро(ОП.Знч("ЗарплатныйПериод"),ОП.Знч("Агент"));
						//TODO при выборе агента, передавать строку или структуру?
						тз = уб_СЕРВЕРНЫЕ.РасчетЗП_Быстро(ОП.Знч("ЗарплатныйПериод"),ОП.Знч("Агент"));
						Если тз.Количество()=1  Тогда
							//ВМ по данной оплате
							_вм =тз[0];
						КонецЕсли; 
					Иначе
						тз = Параметры.ДанныеПоЗПМенеджерам.НайтиСтроки(НОвый Структура("Агент",ОП.Знч("Агент")));
						Если тз.Количество()>0 Тогда
							_вм =тз[0];
						КонецЕсли; 
					КонецЕсли;	 
					Если НЕ _вм =Неопределено Тогда
						_этоКС = НЕ _вм.СписокКС.Найти(ОП.Знч("Ссылка")) = Неопределено;
						__ВознаграждениеМенеджера = Окр(?(_вм.ЗП_СКВ=0 ИЛИ _этоКС,0,_вм.ЗП_СКВ*__СКВАгента/_вм.СКВ)+?(РасчетныеПоля.бЗаблокирована,ОП.Знч("ВознаграждениеМенеджера"),_ВознаграждениеМенеджера)+
						?(_вм.СКВ_КС=0 ИЛИ НЕ _этоКС,0,_вм.Бонус_КС*__СКВАгента/_вм.СКВ_КС),2);
					КонецЕсли;	
				Иначе
					__ВознаграждениеМенеджера = ОП.Знч("ВМРасчетное");
				КонецЕсли;	 
				__ДоходБрокера = __СКВ - __ВознаграждениеМенеджера;
			Иначе
				__ДоходБрокера = __СКВ - _ВознаграждениеМенеджера;
				__ВознаграждениеМенеджера = _ВознаграждениеМенеджера;
			КонецЕсли;
			
		КонецЕсли;				
	КонецЕсли;
	// вычитаем сумму подвязанных разниц
	Если РасчетныеПоля.РасчетПоАВ Тогда
		//Старый расчет  Сейчас в доходе уже вычтено полное АВ = АВВыплаченное+СкидкаВыплаченаяКлиенту
		//СуммаВзаиморасчетовСкидкаИлиАВ = Документы.уб_ВзаиморасчетСПоставщиком.СуммаПодвязкиПоСсылке(ОП.Знч("Ссылка"), Перечисления.уб_ВидОперацииВзаиморасчетов.СкидкаКлиенту);
		//__ДоходБрокера = __ДоходБрокера - (СуммаВзаиморасчетовСкидкаИлиАВ - ОП.Знч("СкидкаВыплаченаяКлиенту"));
	КонецЕсли;
	УстЗнч(ОП, "ДБ", 						Окр(__ДоходБрокера, 2), 			РасчетныеПоля.бЗаблокирована);
	УстЗнч(ОП, "ВМРасчетное", 				Окр(__ВознаграждениеМенеджера, 2), 	РасчетныеПоля.бЗаблокирована);
	УстЗнч(ОП, "СхемаРасчетаСМенеджером", 	_СхемаРасчетаСМенеджером, 			РасчетныеПоля.бЗаблокирована);			
	Если УстЗнч(ОП, "ВознаграждениеМенеджера", Окр(_ВознаграждениеМенеджера, 2), РасчетныеПоля.бЗаблокирована) = ИСТИНА 
		//И (Параметры.СведенияОСквитованныхОплатах <> Неопределено) И ТипЗнч(ОП) = Тип("ДокументОбъект.уб_ОплатаПолисов") 
		Тогда
		//НайденнаяСтрока = Параметры.СведенияОСквитованныхОплатах.Найти(ОП.Знч("Ссылка"), "ОплатаПолиса"); //TODO нужна ли ПолучитьСсылкуНового?
		//Если НайденнаяСтрока <> Неопределено Тогда
		//	НайденнаяСтрока.ВознаграждениеМенеджера = _ВознаграждениеМенеджера; 
		//КонецЕсли;
	ИначеЕсли РасчетныеПоля.бФорма и _ВознаграждениеМенеджера <> ОП.Знч("ВознаграждениеМенеджера") Тогда
		#Если Клиент Тогда
			Предупреждение("Рекомендуется пересчитать эту оплату. Отличается ВМ");
		#КонецЕсли
	КонецЕсли;
	Если РасчетныеПоля.бФорма Тогда
		Форма.лАгентВнешний = (ОП.Знч("Подразделение") = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети);//Проверить зачем
		Форма.лИнфоКВМ 		= Параметры.ИнфоКВМ;	
		Если Не РасчетныеПоля.СистемаНаправлениеПлатежа Тогда
			Форма.лПримечаниеКОплатеАгентом = __ПримечаниеКОплатеАгентом;	
		КонецЕсли;
		Форма.лТекущееВознаграждениеМенеджера 	= _ВознаграждениеМенеджера;
		Форма.лСКВ 								= __СКВ;	
		Попытка
			Форма.лСКВАгента = __СКВАгента;
		Исключение
		КонецПопытки;	
		ЦветСКВ = ?(__СКВ = 0,Новый Цвет(255, 196, 196), Новый Цвет);
		РасчетныеПоля.ЭФ.СКВ.ЦветФонаПоля = ЦветСКВ;
		//Форма.ДоходБрокера = __ДоходБрокера; 	
		Форма.лСхемаРасчетаСМенеджером = "Схема расчета: " + ?(РасчетныеПоля.РасчетПоАВ,"по АВ",ОП.Знч("СхемаРасчетаСМенеджером")); 	
		РасчетныеПоля.ЭФ.нСхемаРасчетаСМенеджером.ЦветФона  = ЦветСКВ;
		РасчетныеПоля.ЭФ.нСхемаРасчетаСМенеджером.Подсказка = ?(__СКВ = 0, "СКВ по этой оплате = 0 ","");
	КонецЕсли;
	УстЗнч(ОП, "ВМпоРезультатамПериодаЗП", 	ОП.Знч("СхемаРасчетаСМенеджером") = ПВР.ПланПоСКВ, РасчетныеПоля.бЗаблокирована);			
	Если Не РасчетныеПоля.СистемаНаправлениеПлатежа Тогда
		УстЗнч(ОП, "КОплатеАгентом", Окр(_КОплатеАгентом, 2), РасчетныеПоля.бЗаблокирована);
	КонецЕсли;
	//Дополнение актуальными данными из объекта

КонецПроцедуры

Процедура ОП_ПересчетСумм_Поставщик(ОП, Форма, ПараметрыПерерасчета, Параметры)

	РасчетныеПоля = Параметры.РасчетныеПоля;
	_КВИзмененное = Окр(РасчетныеПоля.СуммаВзносаДляРасчетов, 2) - Окр(ОП.Знч("Баланс_Брокер_Поставщик"),2);
	Если ОП.Знч("ПересчетКВ") И _КВИзмененное > 0 И ОП.Знч("Баланс_Брокер_Поставщик") > 0 Тогда 
		_КВСуммаДляОтчета = _КВИзмененное;
	Иначе	
		_Разрядность = ОП.Знч("РазрядностьОкругления");
		_РежимОкругления  = ОП.Знч("РежимОкругления");
		Если ОП.Знч("НеМенятьКВ") = Истина Тогда
			Если Параметры.ОтключитьВыравниваниеКВ = Истина Тогда
				_КВСуммаДляОтчета = ОП.Знч("КВСуммаДляОтчета");
			Иначе
				_КВСуммаДляОтчета  = ОП.Знч("КВСумма");
			КонецЕсли;
			
		Иначе
			_КВСуммаДляОтчета = уб_Окр(РасчетныеПоля.СуммаВзносаДляРасчетов * ОП.Знч("КВПроцентДляОтчета") / 100, _Разрядность,_РежимОкругления); 
		КонецЕсли;
	
	КонецЕсли;
	УстЗнч(ОП, "КВСуммаДляОтчета", _КВСуммаДляОтчета, РасчетныеПоля.бЗаблокирована);
	СП = ОП.Знч("СтраховойПолис");
	Если РасчетныеПоля.бЕстьОП Тогда
		бДоговорБезУдержанияКВ = ОП.Знч("ОтчетПоставщику").ВидВзаиморасчета = ПараметрыСеанса.уб_Константы.ВидВзаиморасчетовБезУдержанияКВ;
		Если НЕ ЗначениеЗаполнено(бДоговорБезУдержанияКВ)Тогда
			бДоговорБезУдержанияКВ = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если бДоговорБезУдержанияКВ = Неопределено Тогда //Нет ОП, либо в ОП не указан Вид взаиморасчетов
		Если Форма <> Неопределено Тогда
			Если Форма.лСУдержанием = Неопределено Тогда
				бДоговорБезУдержанияКВ = НЕ уб_СС.ОпределитьЭтоРасчетСУдержаниемКВ(СП.Поставщик, СП.ОрганизацияАгент, СП.Дата, Ложь);
				Форма.лСУдержанием =  бДоговорБезУдержанияКВ;
			Иначе
				бДоговорБезУдержанияКВ = Форма.лСУдержанием;
			КонецЕсли;	
		Иначе	
			бДоговорБезУдержанияКВ = НЕ уб_СС.ОпределитьЭтоРасчетСУдержаниемКВ(СП.Поставщик, СП.ОрганизацияАгент, СП.Дата, Ложь);
		КонецЕсли;
	КонецЕсли;	
	_Баланс_Брокер_Поставщик = РасчетныеПоля.СуммаВзносаДляРасчетов
	- ?(бДоговорБезУдержанияКВ И РасчетныеПоля.бОплаченоВБрокер, 0, ОП.Знч("КВСуммаДляОтчета"))
	- ?(РасчетныеПоля.бОплаченоВБрокер, 0, ОП.Знч("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"));
	УстЗнч(ОП, "Баланс_Брокер_Поставщик", _Баланс_Брокер_Поставщик, РасчетныеПоля.бЗаблокирована);
	Если _Баланс_Брокер_Поставщик >= 0 Тогда
		_СуммаКОплатеБрокеруДляОчетаПоставщику = 0;
		//_СуммаКОплатеПоставщикуДляОчетаПоставщику = _Баланс_Брокер_Поставщик;
	Иначе
		_СуммаКОплатеБрокеруДляОчетаПоставщику = - _Баланс_Брокер_Поставщик;
		//_СуммаКОплатеПоставщикуДляОчетаПоставщику = 0;
	КонецЕсли;
	УстЗнч(ОП, "СуммаКОплатеБрокеруДляОчетаПоставщику", Окр(_СуммаКОплатеБрокеруДляОчетаПоставщику, 2), РасчетныеПоля.бЗаблокирована);

КонецПроцедуры

Функция ОП_ПересчетСумм(
	ОП, 
	Форма 					= Неопределено, 
	ПараметрыПерерасчета 	= Неопределено,
	Параметры               = Неопределено
	) Экспорт
	
	ТЗИзменений = ОП.Знч("ТЗИзменений");
	#Если Клиент Тогда
		_ЭтоФорма = ТипЗнч(ОП)=Тип("Форма");
	#Иначе
		_ЭтоФорма = Ложь;
	#КонецЕсли
	_Модифицированность = ?(_ЭтоФорма,ОП.Модифицированность,ОП.Модифицированность());//Начальная Модифицированность
	Если ПараметрыПерерасчета = Неопределено Тогда
		ПараметрыПерерасчета = Новый Структура("Страхователь, КВ, Менеджер, Поставщик", Истина, Истина, Истина, Истина);
	КонецЕсли;
	Если Параметры = Неопределено Тогда
		Параметры = СтруктураПараметровОППересчетСуммПоУмолчанию()
	КонецЕсли;
	РасчетныеПоля = Параметры.РасчетныеПоля;
	РасчетныеПоля.СистемаНаправлениеПлатежа = ПараметрыСеанса.уб_Константы.СистемаНаправлениеПлатежаВОплатеПолиса = Истина;
	РасчетныеПоля.ЭтоФорма					= _ЭтоФорма;
	Если Форма = Неопределено Тогда
		РасчетныеПоля.бФорма = Ложь;
		//без формы разрешено редактирование пересчета всегда
		Попытка
			ОП.лРазрешеноРедактирование = Истина;
		Исключение
		КонецПопытки;	
	Иначе
		РасчетныеПоля.бФорма 	= Истина;
		РасчетныеПоля.ЭФ 		= Форма.ЭлементыФормы;
	КонецЕсли;
	РасчетныеПоля.бЗаблокирована = РасчетныеПоля.бФорма = Истина И Форма.лРазрешеноРедактирование = Ложь;
	//Убрано, потому что дергается 1001>0,0>1001
	//Если Параметры.ИзменятьКодКВ Тогда
	//	УстЗнч(ОП, "КодКВ", 0, бЗаблокирована);
	//КонецЕсли;
	//пропишем код, который вызывался в форме здесь - перед началом обработки, во избежание несоответствий вызова
	//TODO распределить по параметрам перерасчета
	//пока без параметров перерасчета вызывается только установка валюты,
	//кодКВ при установке параметра и ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	//ну и еще раскрашивается элемент формы КВПроцент в конце функции - убрать, или переместить код в форму TODO
	_СтраховойПолис = ОП.Знч("СтраховойПолис");
	УстЗнч(ОП, "Валюта", ?(_СтраховойПолис.Пустая(), ПараметрыСеанса.уб_Константы.уб_ВалютаРегламентированногоУчета, _СтраховойПолис.ВалютаДокумента),РасчетныеПоля.бЗаблокирована, Истина);
	//Проверка итога по ТЧ
	СуммаДоп = ОП.Знч("УслугиПоДокументу").Итог("Сумма");
	УстЗнч(ОП, "СуммаДоп", СуммаДоп, РасчетныеПоля.бЗаблокирована);
	
	//Получаем данные бланка и корректируем схему при необходимости
	ВидБСО = ПолучитьБланкПолиса(Оп.Знч("Ссылка"));
	Если Не ВидБСО = Неопределено Тогда
		ДанныеБланка = ПолучитьСхемуИАлгоритмРасчета(ВидБСО,ОП.Знч("Агент"),ОП.Знч("ЗарплатныйПериод"));
		Если не ДанныеБланка = Неопределено Тогда
			Если ДанныеБланка.Схема = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ и НЕ Оп.Знч("ПроверенаЗП") Тогда
				//СхемаРасчетаСМенеджером = ОП.Знч("СхемаРасчетаСМенеджером");
				Если УстЗнч(ОП, "ВидРасчетаСАгентом",Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ,РасчетныеПоля.бЗаблокирована) Тогда
					//меняем только при начальной установке
					УстЗнч(ОП, "СхемаРасчетаСМенеджером",ДанныеБланка.Схема,РасчетныеПоля.бЗаблокирована);
				КонецЕсли;	
				
				Если Не ПустаяСтрока(ДанныеБланка.Алгоритм) Тогда
					
					флЕстьПравки = Ложь;
					
					//Считываем значения
					ПараметрыАлгоритма  = Новый Структура;
					
					ПараметрыАлгоритма.Вставить("Документ",Оп);
					ПараметрыАлгоритма.Вставить("НачисленнаяСуммаВзноса", Оп.Знч("НачисленнаяСуммаВзноса"));
					ПараметрыАлгоритма.Вставить("АВилиСкидкаПроцент",     Оп.Знч("АВилиСкидкаПроцент"));
					ПараметрыАлгоритма.Вставить("АВилиСкидкаСумма",       Оп.Знч("АВилиСкидкаСумма"));
					ПараметрыАлгоритма.Вставить("КВПроцент",              Оп.Знч("КВПроцент"));
					ПараметрыАлгоритма.Вставить("КВСумма",                Оп.Знч("КВСумма"));
					ПараметрыАлгоритма.Вставить("КВПроцентДляАгента",     Оп.Знч("КВПроцентДляАгента"));
					ПараметрыАлгоритма.Вставить("КВСуммаДляАгента",       Оп.Знч("КВСуммаДляАгента"));
					ПараметрыАлгоритма.Вставить("КВПроцентДляОтчета",     Оп.Знч("КВПроцентДляОтчета"));
					ПараметрыАлгоритма.Вставить("КВСуммаДляОтчета",       Оп.Знч("КВСуммаДляОтчета"));
					ПараметрыАлгоритма.Вставить("СуммаДоп",               Оп.Знч("СуммаДоп"));
					ПараметрыАлгоритма.Вставить("НеМенятьКВ",             Оп.Знч("НеМенятьКВ"));
					ПараметрыАлгоритма.Вставить("ОплаченоФакт",           Оп.Знч("ОплаченоФакт"));
					ПараметрыАлгоритма.Вставить("НеМенятьАВ",             Оп.Знч("НеМенятьАВ"));
					ПараметрыАлгоритма.Вставить("бЗаблокирована",         РасчетныеПоля.бЗаблокирована);
					
					
					
					
					ПараметрыАлгоритма.Вставить("ДанныеБланка",           ДанныеБланка);
					
					Попытка
						//здесь значения могут поменяться
						Выполнить(ДанныеБланка.Алгоритм);
						флЕстьПравки = Истина;
						
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка при алгоритмическом расчет"+ ОписаниеОшибки(),,Истина);
					КонецПопытки;
					
					Если флЕстьПравки Тогда
						//устанавливаем значения в объект
						УстЗнч(ОП, "НачисленнаяСуммаВзноса", ПараметрыАлгоритма.НачисленнаяСуммаВзноса, РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "АВилиСкидкаПроцент"    , ПараметрыАлгоритма.АВилиСкидкаПроцент    , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "АВилиСкидкаСумма"      , ПараметрыАлгоритма.АВилиСкидкаСумма      , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВПроцент"             , ПараметрыАлгоритма.КВПроцент             , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВСумма"               , ПараметрыАлгоритма.КВСумма               , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВПроцентДляАгента"    , ПараметрыАлгоритма.КВПроцентДляАгента    , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВСуммаДляАгента"      , ПараметрыАлгоритма.КВСуммаДляАгента      , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВПроцентДляОтчета"    , ПараметрыАлгоритма.КВПроцентДляОтчета    , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "КВСуммаДляОтчета"      , ПараметрыАлгоритма.КВСуммаДляОтчета      , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "НеМенятьКВ"            , ПараметрыАлгоритма.НеМенятьКВ            , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "СуммаДоп"              , ПараметрыАлгоритма.СуммаДоп              , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "ОплаченоФакт"          , ПараметрыАлгоритма.ОплаченоФакт          , РасчетныеПоля.бЗаблокирована);
						УстЗнч(ОП, "НеМенятьАВ"            , ПараметрыАлгоритма.НеМенятьАВ            , РасчетныеПоля.бЗаблокирована);
							
					Конецесли;	
					//далее применются стандартные алгоритмы
				КонецЕсли;	
			ИначеЕсли ДанныеБланка.Схема = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ и НЕ Оп.Знч("ПроверенаЗП") Тогда
				Если Не ПустаяСтрока(ДанныеБланка.Алгоритм) Тогда
					Попытка
						//здесь значения могут поменяться
						Выполнить(ДанныеБланка.Алгоритм);
						флЕстьПравки = Истина;
						
					Исключение
						уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка при алгоритмическом расчет"+ ОписаниеОшибки(),,Истина);
					КонецПопытки;
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
	//РТ+
	Параметры.Вставить("КВАгентаУжеПосчитан",Ложь);
	
	Если Оп.Знч("ПроверенаЗП") = Ложь и ЗначениеЗаполнено(Оп.Знч("Куратор"))= Ложь Тогда
		//Куратор, это другая схема, когда проверена ЗП править уже нельзя
		Источник = ПолучитьИсточникЗаявки(Оп.Знч("СтраховойПолис"));
		Если ЗначениеЗаполнено(Источник) и Оп.Знч("Агент")<>Источник Тогда
			
			ВидСп = Оп.Знч("ВидСП");
			//Вариант 1
			Если ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО или ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО
				или ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КаскоПП
				Тогда
				_ВычетСАгента = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетПоИсточникуКАСКО",Источник,ОП.Знч("ЗарплатныйПериод"),0);
			ИначеЕсли ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда
				_ВычетСАгента = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетПоИсточникуОСАГО",Источник,ОП.Знч("ЗарплатныйПериод"),0);	
			Иначе
				//Если вычет установлен руками, он должен быть заблокирован "ПроверенаЗП", иначе вычет обнулится
				_ВычетСАгента = 0;
			КонецЕсли;	
			УстЗнч(ОП, "ВычетСАгента", _ВычетСАгента, РасчетныеПоля.бЗаблокирована);
			
			//Вариант 2
			Если ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО или ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО Тогда
				_СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетСКВПоИсточникуКАСКО",Источник,ОП.Знч("ЗарплатныйПериод"),-1);
			ИначеЕсли ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО или ВидСп = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОСАГО Тогда
				_СуммаФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ВычетСКВПоИсточникуОСАГО",Источник,ОП.Знч("ЗарплатныйПериод"),-1);
			Иначе
				_СуммаФикс = 0;
			КонецЕсли;	
			Если _СуммаФикс>0 и (Оп.Знч("ПроверенаЗП") = Ложь) Тогда
				_КВСуммаДляАгента =  Макс(ОП.Знч("КВСумма")- _СуммаФикс,0);
				_КВПроцентДляАгента = Окр(?(_КВСуммаДляАгента=0,0,_КВСуммаДляАгента*100/ОП.Знч("НачисленнаяСуммаВзноса")),2);
				УстЗнч(ОП, "КВПроцентДляАгента", _КВПроцентДляАгента, РасчетныеПоля.бЗаблокирована);	
				Параметры.Вставить("КВАгентаУжеПосчитан",УстЗнч(ОП, "КВСуммаДляАгента", _КВСуммаДляАгента, РасчетныеПоля.бЗаблокирована));	
				//УстЗнч(ОП, "НеМенятьАВ", Истина, РасчетныеПоля.бЗаблокирована);	//Блокировка расчета суммы по проценту/разница округления
			КонецЕсли;	
		//ПроцентФикс = уб_РасчетыСМенеджерами.ПолучитьПараметрРасчетаЗП("ПроцентФикс",ОП.Знч("Агент"),ОП.Знч("ЗарплатныйПериод"),-1);
		//Если РасчетныеПоля.РасчетПоАВ и СуммаФикс>0 и ОП.НеМенятьАВ=Ложь Тогда
		//	 
		//	ЗаФиксПроцент = ?(ПроцентФикс>0,ОП.Знч("НачисленнаяСуммаВзноса")*ПроцентФикс/100,0);
		//	КВСуммаДляАгента =  Макс(ОП.Знч("КВСумма")- СуммаФикс-ЗаФиксПроцент,0);
		//	КВПроцентДляАгента = Окр(?(КВСуммаДляАгента=0,0,Окр(КВСуммаДляАгента*100/ОП.Знч("НачисленнаяСуммаВзноса"))),2);
		//	УстЗнч(ОП, "КВПроцентДляАгента", КВПроцентДляАгента, РасчетныеПоля.бЗаблокирована);

		КонецЕсли;	
		//БанкиРу = Справочники.ФизическиеЛица.НайтиПоНаименованию("Банки.ру")
	КонецЕсли;
	//РТ-
	
	//если передана пустая структура - ничего не пересчитываем (может потребоваться только для обработки кода выше)
	Если ПараметрыПерерасчета.Количество() > 0 Тогда
		Если Не ПараметрыПерерасчета.Свойство("Страхователь") Тогда
			ПараметрыПерерасчета.Вставить("Страхователь", Ложь)
		КонецЕсли;
		Если Не ПараметрыПерерасчета.Свойство("Менеджер") Тогда
			ПараметрыПерерасчета.Вставить("Менеджер", Ложь)
		КонецЕсли;
		Если Не ПараметрыПерерасчета.Свойство("КВ") Тогда
			ПараметрыПерерасчета.Вставить("КВ", Ложь)
		КонецЕсли;
		Если Не ПараметрыПерерасчета.Свойство("Поставщик") Тогда
			ПараметрыПерерасчета.Вставить("Поставщик", Ложь)
		КонецЕсли;
		РасчетныеПоля.РасчетПоАВ = ОП.Знч("СхемаРасчетаСМенеджером")= ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ;//(ОП.Знч("ВидРасчетаСАгентом") = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ);
		Если РасчетныеПоля.СистемаНаправлениеПлатежа Тогда
			РасчетныеПоля.бОплаченоВБрокер = ОП.Знч("НаправлениеПлатежа") = Перечисления.уб_НаправленияПлатежа.ВБрокер;
		Иначе
			_ФормаОплаты = ОП.Знч("ФормаОплаты");
			РасчетныеПоля.ВКассу 			= (_ФормаОплаты = Перечисления.уб_ФормыОплаты.Касса);
			РасчетныеПоля.бОплаченоВБрокер 	= РасчетныеПоля.ВКассу Или _ФормаОплаты = Перечисления.уб_ФормыОплаты.Безнал;
		КонецЕсли;
		РасчетныеПоля.бЕстьОП = Не ОП.Знч("ОтчетПоставщику").Пустая();
		Если Не (ОП.Знч("НачисленнаяСуммаВзноса") = 0 И РасчетныеПоля.бЕстьОП) Тогда
			УстЗнч(ОП, "ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику", ?(РасчетныеПоля.бОплаченоВБрокер, ОП.Знч("НачисленнаяСуммаВзноса"), ОП.Знч("ОплаченоФакт")), РасчетныеПоля.бЗаблокирована);
		КонецЕсли;
		РасчетныеПоля.СуммаВзносаДляРасчетов = ?(ОП.Знч("НачисленнаяСуммаВзноса") = 0, ОП.Знч("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"), ОП.Знч("НачисленнаяСуммаВзноса"));
		Если ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыПерерасчета, "Страхователь", Истина) Тогда
	       	ОП_ПересчетСумм_Страхователь(ОП, Форма, ПараметрыПерерасчета, Параметры);
		КонецЕсли;
		Если ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыПерерасчета, "КВ", Истина) Тогда
			ОП_ПересчетСумм_КВ(ОП, Форма, ПараметрыПерерасчета, Параметры);
		КонецЕсли;	
		Если ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыПерерасчета, "Менеджер", Истина) Тогда
			ОП_ПересчетСумм_Менеджер(ОП, Форма, ПараметрыПерерасчета, Параметры);
		КонецЕсли;
		//Расчет полей для Отчета Поставщику
		Если ОбщегоНазначения.СравнитьСоЗначениемВСтруктуре(ПараметрыПерерасчета, "Поставщик", Истина) Тогда
			ОП_ПересчетСумм_Поставщик(ОП, Форма, ПараметрыПерерасчета, Параметры);
		КонецЕсли;
	КонецЕсли;
	//ниже код шел в форме после перерасчета
	Если РасчетныеПоля.бФорма Тогда
		РасчетныеПоля.ЭФ.КВПроцент.ЦветТекстаПоля = ?(ПроверитьПредОплаты(ОП), Новый Цвет(), Новый Цвет(51, 204, 204));//!!!!!
	КонецЕсли;
	Параметры.Вставить("ТЗИзменений", ТЗИзменений);
	Если ТЗИзменений <> Неопределено Тогда
		КоличествоИзменений = ТЗИзменений.Количество();
		Если  КоличествоИзменений = 0 И _Модифицированность = ЛОЖЬ И ?(РасчетныеПоля.ЭтоФорма,ОП.Модифицированность,ОП.Модифицированность()) Тогда
			//	//Здесь ничего не поменяли, но есть модифицированность.
			//	//неучтенные изменения, не входящие в ТЗИзменений
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ОП_ПересчетСумм(): Оплата " + ОП.Знч("Номер") + ". Не все изменения учтены ТЗИзменений - оплата модифицирована", "НеСообщать", Истина);
		КонецЕсли;
	КонецЕсли;
	Если РасчетныеПоля.бФорма Тогда
		эу = Форма.ЭлементыФормы.нЧтоПоменялось;
		эу.Видимость 	= КоличествоИзменений > 0;
		эу.ЦветТекста 	= ?(РасчетныеПоля.бЗаблокирована = ЛОЖЬ, ЦветаСтиля.ЦветГиперссылки, Новый Цвет (192,192,192));
		эу.Заголовок 	= ?(РасчетныеПоля.бЗаблокирована = ЛОЖЬ, "Что поменялось?", "Что поменяется?");
		Если РасчетныеПоля.СистемаНаправлениеПлатежа Тогда
			РасчетныйАВилиСумма	= Окр(ОП.Знч("НачисленнаяСуммаВзноса")+ОП.Знч("СуммаДоп") - ОП.Знч("ОплаченоФакт"), 2);
			Если ОП.Знч("НачисленнаяСуммаВзноса") > 0 Тогда
				РасчетныйАВилиПроцент = Окр(РасчетныйАВилиСумма * 100 / ОП.Знч("НачисленнаяСуммаВзноса"), 2);
			Иначе	
				РасчетныйАВилиПроцент = 0;
			КонецЕсли;
			Форма.АВилиСкидкаПроцентРасчетное 	= РасчетныйАВилиПроцент;
			Форма.АВилиСкидкаСуммаРасчетное		= РасчетныйАВилиСумма;
			Форма.ЭлементыФормы.АВилиСкидкаСумма.Подсказка = "Сумма АВ или скидки, удержанная / недосданная кассиру агентом (" + ОП.Знч("АВилиСкидкаПроцент") + " %)";
			ВидимостьРасчетнойСуммы = Форма.АВИлиСкидкаСуммаРасчетное <> ОП.Знч("АВилиСкидкаСумма");
			Форма.ЭлементыФормы.ПолеКартинкиПолосаСуммирования.Видимость 	= ВидимостьРасчетнойСуммы;
			Форма.ЭлементыФормы.НадписьПлюс.Видимость						= ВидимостьРасчетнойСуммы;
			Форма.ЭлементыФормы.АВилиСкидкаСумма.Видимость					= ВидимостьРасчетнойСуммы;
		КонецЕсли;
	КонецЕсли;	
	//по новой системе начальное значение может совпадать с устанавливаемым
	//Для Каждого СтрокаТЗ Из ТЗИзменений Цикл
	//	Если СтрокаТЗ.НачальноеЗначение = СтрокаТЗ.НовоеЗначение Тогда
	//		//TODO
	//		//ошибки формата (разрядности реквизита) - нужно в расчет сделать округление. Сделано
	//		//либо попытка установить не соответствующий тип - исправить в расчете. Сделано
	//		//либо попытка установить число больше максимального возможного значения реквизита. ?????
	//		уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("ОП_ПересчетСумм(): Оплата " + ОП.Знч("Номер") + ". Некорректный формат устанавливаемого реквизита " + СтрокаТЗ.Реквизит + ", начальное значение: " +  СтрокаТЗ.НачальноеЗначение + ", установленное значение: " + СтрокаТЗ.НовоеЗначение, "НеСообщать", Истина);
	//	КонецЕсли;
	//КонецЦикла;
	Возврат Параметры;
	
КонецФункции

//т.к. пока не известно, что является признаком утвержденной оплаты - несколько параметров
//ОП - оплата полиса
//1: есть проведенный отчет
//2: есть дата согласования в отчете
//3: есть перечисление поставщику
Функция ОплатаСогласована(ОП, Вариант)
	
	ОтчетПоставщику = ОП.ОтчетПоставщику;
	Если Вариант = 1 Тогда
		Возврат ОтчетПоставщику.Проведен
	КонецЕсли;
	//также с учетом, что он должен быть проведен
	Если Вариант = 2 Тогда
		Результат = ЗначениеЗаполнено(ОтчетПоставщику.ДатаСогласования)
	ИначеЕсли Вариант = 3 Тогда
		//дата согласование у оплаченного может быть незаполнена
		//TODO закэшировать в модуле объекта результат этой функции
		СтруктураБлокировкиОтчета = уб_temp.СтруктураБлокировкиДокумента(ОП.Ссылка);
		//интересует сам факт перечисления средств, права и регистра разблокировки не влияет
		Результат = СтруктураБлокировкиОтчета.ЕстьПеречисление;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // СостояниеСогласованнойОплаты()

//функция установить значение для пересчета сумм с записью лога изменений
Функция УстЗнч(ОП, ИмяПоляДанных, НовоеЗначение, бЗаблокирована, ИгнорироватьБлокировкуОплаты = Ложь,ЕстьОтличия=Ложь)
	
	Попытка
		НачальноеЗначение = ОП.Знч(ИмяПоляДанных);
		ФлЕстьЗнч =Истина;
	Исключение
		НачальноеЗначение = ОП[ИмяПоляДанных];//Например строка ТЧ
		ФлЕстьЗнч = Ложь;
	КонецПопытки;	
	
	Если НачальноеЗначение <> НовоеЗначение И НовоеЗначение <> Неопределено Тогда
		//Таблицу заполняем всегда
		Если ФлЕстьЗнч Тогда
		ТЗИзменений = ОП.Знч("ТЗИзменений");
		ТипТаблицы = ТипЗнч(ТЗИзменений);
		Если ТипТаблицы = Тип("ТаблицаЗначений") Тогда
			МассивСтрок = ТЗИзменений.НайтиСтроки(Новый Структура("Реквизит",ИмяПоляДанных));
			Если МассивСтрок.Количество()>0 Тогда
				СтрокаТЗ = МассивСтрок[0];
				НачальноеЗначение = СтрокаТЗ.НачальноеЗначение;
			Иначе	
				СтрокаТЗ = ТЗИзменений.Добавить();
			КонецЕсли;	
			СтрокаТЗ.Реквизит 			= ИмяПоляДанных;
			СтрокаТЗ.НачальноеЗначение  = НачальноеЗначение;
			СтрокаТЗ.НовоеЗначение		= НовоеЗначение;
		Иначе
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не известный тип таблицы изменений "+ТипТаблицы, "НеСообщать", Истина);
		КонецЕсли;
		КонецЕсли;
		ЕстьОтличия = Истина;
		//Реквизит если только разрешено
		Если бЗаблокирована=ЛОЖЬ ИЛИ ИгнорироватьБлокировкуОплаты=ИСТИНА Тогда
			//
			Попытка
				ОП.УстЗнч(ИмяПоляДанных,НовоеЗначение);
			Исключение	
				уб_ВызовСервера._УстановитьЗначение(ОП,"ИмяПоляДанных",НовоеЗначение);
			КонецПопытки;	
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;	
	
КонецФункции // УстЗнч()

//ИзменятьКодКВ 	- если Истина, сбрасывает КодКВ на 0
//КВАгентаРавноКВ   - при Неопределено рассчитает
//ИзмененоПоле		- поле, которое изменилось в форме, для корректного перерасчета!
Функция СтруктураПараметровОППересчетСуммПоУмолчанию() Экспорт
	
	//ИнфоКВМ 						= "", 
	//СтатПоКАСКО 					= Неопределено,
	//СведенияОСквитованныхОплатах 	= Неопределено,
	//СуммаПоПриемкам 				= 0,
	//бНетКвитовкиПоСуммам 			= Неопределено
	Структура = Новый Структура;
	Структура.Вставить("ИнфоКВМ", 									"");
	Структура.Вставить("СтатПоКАСКО",   							Неопределено);
	Структура.Вставить("СведенияОСквитованныхОплатах",				Неопределено);
	Структура.Вставить("СведенияОСквитованныхПриемках",				НЕопределено);
	Структура.Вставить("СуммаПоПриемкам",							0);
	Структура.Вставить("НетКвитовкиПоСуммам",						Неопределено);
	Структура.Вставить("ИзменятьКодКВ",								Ложь);
	Структура.Вставить("КВАгентаРавноКВ",							Неопределено);
	Структура.Вставить("ОткрыватьФормуВыбораКВиАВ",					Ложь);
	Структура.Вставить("УстанавливатьКВИАВ",						Ложь);
	Структура.Вставить("ОтключитьВыравниваниеКВ",					Неопределено);
	Структура.Вставить("ПроверитьВозможностьРедактирования", 		Истина);
	Структура.Вставить("ТЗИзменений", 								Неопределено);
	Структура.Вставить("УИДГруппыКвитовки",							Неопределено);
	Структура.Вставить("ДанныеПоЗПМенеджерам",						Неопределено);
	Структура.Вставить("УстанавливатьКВДляАгента",					Истина);
	Структура.Вставить("ПеречитатьПоказателиГруппыВзаиморасчетов",	Ложь);
	Структура.Вставить("ПересчетВМ",								Истина);
	Структура.Вставить("РасчетРазницПоАВПослеСтрахователя",			Ложь);
	СтруктураРасчетныхПолей = Новый Структура;
	СтруктураРасчетныхПолей.Вставить("ВКассу");
	СтруктураРасчетныхПолей.Вставить("бЗаблокирована");
	СтруктураРасчетныхПолей.Вставить("СистемаНаправлениеПлатежа");
	СтруктураРасчетныхПолей.Вставить("СуммаВзносаДляРасчетов");
	СтруктураРасчетныхПолей.Вставить("бФорма");
	СтруктураРасчетныхПолей.Вставить("РасчетПоАВ");
	СтруктураРасчетныхПолей.Вставить("ЭФ");
	СтруктураРасчетныхПолей.Вставить("ЭтоФорма");
	СтруктураРасчетныхПолей.Вставить("бОплаченоВБрокер");
	СтруктураРасчетныхПолей.Вставить("бЕстьОП");
	Структура.Вставить("РасчетныеПоля", СтруктураРасчетныхПолей);
	Возврат Структура;
	
КонецФункции // СтруктураПараметровОППересчетСуммПоУмолчанию()

//TODO ???
Функция ПроверитьПредОплаты(Объект)
	
	Результат = Истина;
	Если Объект.НомерВзноса <> 1 Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уб_ОплатаПолисов.КВПроцент
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
		|ГДЕ
		|	уб_ОплатаПолисов.СтраховойПолис = &СтраховойПолис
		|	И НЕ уб_ОплатаПолисов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	уб_ОплатаПолисов.Дата");
		Запрос.УстановитьПараметр("СтраховойПолис", Объект.СтраховойПолис);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Объект.КВПроцент = Выборка.КВПроцент;
		КонецЕсли;		
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция УстЗнач(ПолеДанных, НовоеЗначение, Форма = Неопределено, ИгнорироватьБлокировкуОплаты = Ложь)// 
	
	Если Форма <> Неопределено Тогда
		Возврат Форма.УстЗнач(ПолеДанных, НовоеЗначение,,ИгнорироватьБлокировкуОплаты); 
	Иначе
		#Если ТолстыйКлиент Тогда
			Возврат УстановитьЗначение(ПолеДанных, НовоеЗначение); 
		#Иначе
			Изменилось = НЕ ПолеДанных=НовоеЗначение;
			Если Изменилось Тогда
				ПолеДанных = НовоеЗначение;
				Возврат Изменилось
			Иначе
				Возврат ЛОЖЬ;
			КонецЕсли;
		#КонецЕсли	
	КонецЕсли;
	
КонецФункции

Функция РазмерКС(ЗППериод=Неопределено) Экспорт
	
	Если ЗППериод=Неопределено Тогда
		ЗППериод = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.РазмерКрупнойСделки
	|ИЗ
	|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗППериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних");
	Запрос.УстановитьПараметр("ЗППериод",КонецМесяца(ЗППериод));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РазмерКрупнойСделки;
	Иначе
		Возврат 41900;
	КонецЕсли;
КонецФункции	
Функция РасчетДО1БП(ЗППериод=Неопределено) Экспорт
	
	Если ЗППериод=Неопределено Тогда
		ЗППериод = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_ЗП_ПоказателиРасчетаЗПСрезПоследних.БазаРОП_до_1БП
	                      |ИЗ
	                      |	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&ЗППериод, ) КАК уб_ЗП_ПоказателиРасчетаЗПСрезПоследних");
	Запрос.УстановитьПараметр("ЗППериод",КонецМесяца(ЗППериод));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БазаРОП_до_1БП;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;
КонецФункции

Функция ПолучитьПолноеКВСделки(Сделка) Экспорт 
	КВСделки = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУММА(уб_ОплатаПолисов.КВСумма) КАК КВСумма
	|ИЗ
	|	Документ.уб_ОплатаПолисов КАК уб_ОплатаПолисов
	|ГДЕ
	|	НЕ уб_ОплатаПолисов.ПометкаУдаления 
	|	И уб_ОплатаПолисов.СтраховойПолис.Сделка = &Сделка");
	Запрос.УстановитьПараметр("Сделка",Сделка);
	Выборка = Запрос.Выполнить().Выбрать();					  
	Если Выборка.Следующий() Тогда
		КВСделки = Выборка.КВСумма;
	КонецЕсли;	
	Возврат КВСделки;
КонецФункции	

Функция ПланВыполнен(Менеджер,Период,Условие) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	уб_ЗП_ВыполнениеПланаМенеджерами.ВыполненПлан
	|ИЗ
	|	РегистрСведений.уб_ЗП_ВыполнениеПланаМенеджерами КАК уб_ЗП_ВыполнениеПланаМенеджерами
	|ГДЕ
	|	уб_ЗП_ВыполнениеПланаМенеджерами.Менеджер = &Менеджер
	|	И НАЧАЛОПЕРИОДА(уб_ЗП_ВыполнениеПланаМенеджерами.ПериодЗП, МЕСЯЦ) = &ПериодЗП");
	Запрос.УстановитьПараметр("Менеджер",Менеджер);						  
	Запрос.УстановитьПараметр("ПериодЗП",НачалоМесяца(Период));						  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВыполненПлан;
	Иначе
		Возврат Условие;
	КонецЕсли;	
КонецФункции	

Функция ТЗИзмененийРеквизитов() Экспорт
	
	ТЗИзменений = Новый ТаблицаЗначений;
	ТЗИзменений.Колонки.Добавить("Реквизит");
	ТЗИзменений.Колонки.Добавить("НачальноеЗначение");
	ТЗИзменений.Колонки.Добавить("НовоеЗначение");
	Возврат ТЗИзменений;
	
КонецФункции

Функция АТыВыполнилПлан(Менеджер, Знач Дата = Неопределено) Экспорт
	
	Перем Параметры;
	
	СКВ  				= 0;
	План 				= 0;
	ПроцентВыполнения 	= 0;	
	ЗП   				= 0;
	//
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата()
	КонецЕсли;
	уб_СС.ПодчиненныеРуководителя(Менеджер, Дата, Параметры);	
	////переберем ТЗ результата, для получения списка сотрудников подразделений руководителя, где руководитель не является замом
	//СписокСотрудников = Новый СписокЗначений;
	//Для Каждого СтрокаТЗ Из Параметры.ТЗ Цикл
	//	Если Не СтрокаТЗ.Заместитель Или СтрокаТЗ.Сотрудник = Менеджер Тогда
	//		СписокСотрудников.Добавить(СтрокаТЗ.Сотрудник, СтрокаТЗ.СотрудникСтрока);
	//	КонецЕсли;
	//КонецЦикла;
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|		КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	//|				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	//|					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	//|				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	//|			КОНЕЦ - ОП.КВСумма
	//|			ТОГДА 0
	//|		ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	//|				КОГДА ОП.НачисленнаяСуммаВзноса = 0
	//|					ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	//|				ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	//|			КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	//|	КОНЕЦ), 0) КАК СКВ
	//|ИЗ
	//|	Документ.уб_ОплатаПолисов КАК ОП
	//|ГДЕ
	//|	ОП.Агент В(&СписокСотрудников)
	//|	И НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) = &ДатаНачала
	//|	И НЕ ОП.ИсключитьИзРасчетаЗП
	//|	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	//|	И НЕ ОП.СтраховойПолис.ПометкаУдаления
	//|	И НЕ ОП.ПометкаУдаления
	//|	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок");
	//Запрос.УстановитьПараметр("ДатаНачала", 		НачалоМесяца(Дата));
	//Запрос.УстановитьПараметр("СписокСотрудников",	СписокСотрудников);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	СКВ = Выборка.СКВ;
	//КонецЕсли;
	//План = уб_temp.ПолучитьПланРуководителяОП(
	//	Менеджер, 
	//	НачалоДня(КонецМесяца(Дата)),
	//	,
	//	Параметры);
	//ПроцентВыполнения = ?(План = 0, 0, СКВ / План * 100);
	//Если Не Параметры.ЭтоРуководитель Тогда
	ТЗ = РасчетЗП_Быстро(НачалоМесяца(Дата), Менеджер);
	Если ТЗ.Количество() = 1 Тогда
		СтрокаЗП = тз[0];
		СтрокаЗППроцентВыполнения = ?(СтрокаЗП.План = 0, 0, СтрокаЗП.СКВ / СтрокаЗП.План * 100);
		//запрос сверху некорректно считает СКВ
		//нужно использовать данные РасчетЗП_Быстро
		//TODO для руководителей подразделений покажет только его данные
		//Если СКВ <> СтрокаЗП.СКВ 
		//	Или План <> СтрокаЗП.План
		//	Или ПроцентВыполнения <> СтрокаЗППроцентВыполнения
		//	Тогда
		//	уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Не совпадают данные планов или СКВ по разным запросам по сотруднику " + Менеджер + " за период " + НачалоМесяца(Дата) + "!", "НеСообщать", Истина);
		//КонецЕсли;
		СКВ  				= СтрокаЗП.ЗП_СКВ;
		План 				= СтрокаЗП.План;
		ПроцентВыполнения 	= СтрокаЗППроцентВыполнения;	
		ЗП 					= СтрокаЗП.ЗП_СКВ + СтрокаЗП.Бонус_КС + СтрокаЗП.ВознаграждениеМенеджера;
	КонецЕсли;		
	//КонецЕсли;
	Возврат Новый Структура("СКВ, План, ПроцентВыполнения, ЗП", СКВ, План, ПроцентВыполнения, ЗП);
	//
	//старый код
	//Если РольДоступна("уб_СтаршийМенеджерНаТочке") Тогда
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	РП.Подразделение
	//	|ИЗ
	//	|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&Период, Заместитель) КАК РП
	//	|ГДЕ
	//	|	РП.Сотрудник = &Сотрудник
	//	|	И НЕ РП.Уход");
	//	Запрос.УстановитьПараметр("Период", 	ТекущаяДата());
	//	Запрос.УстановитьПараметр("Сотрудник",  Менеджер);
	//	Результат = Запрос.Выполнить();
	//	Если Не Результат.Пустой() Тогда
	//		Заместитель = Истина
	//	Иначе
	//		Запрос = Новый Запрос(
	//		"ВЫБРАТЬ
	//		|	РП.Подразделение
	//		|ПОМЕСТИТЬ ПодразделениеСотрудника
	//		|ИЗ
	//		|	РегистрСведений.уб_РуководителиПодразделений.СрезПоследних(&ДатаСреза, ) КАК РП
	//		|ГДЕ
	//		|	РП.Сотрудник = &Сотрудник
	//		|	И НЕ РП.Уход
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ДФЛ.Агент
	//		|ПОМЕСТИТЬ СотрудникиПодразделения
	//		|ИЗ
	//		|	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&ДатаСреза, ) КАК ДФЛ
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодразделениеСотрудника КАК ПС
	//		|		ПО ДФЛ.Подразделение = ПС.Подразделение
	//		|ГДЕ
	//		|	НЕ ДФЛ.Выбытие
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//		|	СУММА(ВЫБОР
	//		|			КОГДА ОП.ОплаченоФакт - ОП.НачисленнаяСуммаВзноса - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента < 0
	//		|				ТОГДА 0
	//		|			ИНАЧЕ ОП.ОплаченоФакт - ОП.НачисленнаяСуммаВзноса - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента
	//		|		КОНЕЦ) КАК СКВ
	//		|ИЗ
	//		|	Документ.уб_ОплатаПолисов КАК ОП
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СотрудникиПодразделения КАК СП
	//		|		ПО ОП.Агент = СП.Агент
	//		|ГДЕ
	//		|	ОП.ЗарплатныйПериод >= &ДатаНачала
	//		|	И ОП.ЗарплатныйПериод <= &ДатаКонца
	//		|	И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
	//		|	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
	//		|	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
	//		|	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок");							  
	//		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
	//		Запрос.УстановитьПараметр("ДатаКонца", 	КонецМесяца(ТекущаяДата()));
	//		Запрос.УстановитьПараметр("Сотрудник", 	Менеджер);
	//		Запрос.УстановитьПараметр("ДатаСреза", 	ТекущаяДата());
	//		Выборка = Запрос.Выполнить().Выгрузить();
	//		Если Выборка.Количество() > 0 Тогда
	//			СКВ = ?(ЗначениеЗаполнено(Выборка[0].СКВ),Выборка[0].СКВ,0);
	//		Иначе
	//			СКВ = 0;
	//		КонецЕсли;
	//		//План = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ТекущаяДата())), , , Менеджер)[0].План;
	//		План = уб_temp.ПолучитьПланРуководителяОП(Менеджер,НачалоДня(КонецМесяца(ТекущаяДата())));
	//		ПроцентВыполнения = ?(План = 0, 0, СКВ/План*100);
	//	КонецЕсли;
	//КонецЕсли;
	//Если РольДоступна("уб_МенеджерНаТочке") Или Заместитель Тогда
		//Запрос = Новый Запрос(
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	СУММА(ВЫБОР
		//|			КОГДА ОП.ОплаченоФакт - ОП.НачисленнаяСуммаВзноса - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ ОП.ОплаченоФакт - ОП.НачисленнаяСуммаВзноса - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента
		//|		КОНЕЦ) КАК СКВ
		//|ИЗ
		//|	Документ.уб_ОплатаПолисов КАК ОП
		//|ГДЕ
		//|	ОП.ЗарплатныйПериод >= &ДатаНачала
		//|	И ОП.ЗарплатныйПериод <= &ДатаКонца
		//|	И ОП.Агент = &Агент
		//|	И ОП.ИсключитьИзРасчетаЗП = ЛОЖЬ
		//|	И НЕ ОП.СтраховойПолис.Ссылка = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
		//|	И ОП.СтраховойПолис.ПометкаУдаления = ЛОЖЬ
		//|	И ОП.ПометкаУдаления = ЛОЖЬ
		//|	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок");							  
		//Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
		//Запрос.УстановитьПараметр("ДатаКонца", 	КонецМесяца(ТекущаяДата()));
		//Запрос.УстановитьПараметр("Агент", 		Менеджер);
		//Выборка = Запрос.Выполнить().Выгрузить();
		//Если Выборка.Количество() > 0 Тогда
		//	СКВ = ?(ЗначениеЗаполнено(Выборка[0].СКВ),Выборка[0].СКВ,0);
		//Иначе
		//	СКВ = 0;
		//КонецЕсли;
		//План = уб_СтраховойБрокер.ПолучитьПланПоСКВ(НачалоДня(КонецМесяца(ТекущаяДата())), , , Менеджер)[0].План;
		//ПроцентВыполнения = ?(План = 0, 0, СКВ/План*100);
	//	тз = РасчетЗП_Быстро(НачалоМесяца(ТекущаяДата()),Менеджер);
	//	Если тз.Количество()=1  Тогда
	//		СтрокаЗП          = тз[0];
	//		СКВ               = СтрокаЗП.СКВ;
	//		План              = СтрокаЗП.План;
	//		ПроцентВыполнения = ?(План = 0, 0, СКВ/План*100);
	//		ЗП                = СтрокаЗП.ЗП_СКВ+СтрокаЗП.Бонус_КС+СтрокаЗП.ВознаграждениеМенеджера;
	//	КонецЕсли;	
	//КонецЕсли;
	
КонецФункции

Функция РасчетЗП_Быстро (Период,Менеджер=Неопределено) Экспорт
	
	
	
	Возврат	уб_СЕРВЕРНЫЕ.РасчетЗП_Быстро(Период,Менеджер);
	
КонецФункции	

Функция уб_ОКР(Значение,Знач Разрядность,Режим=Неопределено) Экспорт
	
	//взводится излишняя модифицированность
	//Режим = ?(ЗначениеЗаполнено(Режим), Режим, Перечисления.уб_РежимОкругления.Окр15как20);
	Если Не ЗначениеЗаполнено(Режим) Тогда
		Режим = Перечисления.уб_РежимОкругления.Окр15как20;
	КонецЕсли;
	Если Режим = Перечисления.уб_РежимОкругления.Отсечение Тогда
		//Отсечение
		Дельта =  pow(0.1,Разрядность+1)*5;
		Результат = Окр(Значение-Дельта,Разрядность,РежимОкругления.Окр15как20);
	ИначеЕсли Режим = Перечисления.уб_РежимОкругления.Вбольшую Тогда
		//В большую
		Результат = уб_Взаиморасчеты.ОкруглитьДоПорядка(Значение,pow(0.1,Разрядность),Истина);	
	Иначе
		Результат = Окр(Значение, Разрядность,?(Режим = Перечисления.уб_РежимОкругления.Окр15как20,РежимОкругления.Окр15как20,РежимОкругления.Окр15как10));
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции	

//Исключена - исключена из расчета зп по различным причинам
Функция ПолучитьСКВ(Данные, Знач ТипРезультата = "стр", Параметры = Неопределено, ПоКрупнымСделкам = ЛОЖЬ) Экспорт

	Параметры = Новый Структура("СКВ, СКВДляАгента, СКВДляОтчета, ЭтоКрупнаяСделка, Исключена", 0, 0, 0, Ложь, Ложь);
	ТипЗнчДанные = ТипЗнч(Данные);
	ТипРезультата = СокрЛП(НРег(ТипРезультата));
	
	ЗапросСКВ = Новый Запрос;
	КоэффициентСКВ =  (100-Данные.ПроцентСКВ)/100;
	ЗапросСКВ.УстановитьПараметр("КоэффициентСКВ",КоэффициентСКВ);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСумма > (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	|						ТОГДА ОП.КВСумма - (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт > 0
	|						И ОП.КВСумма > ОП.АВилиСкидкаСумма
	|					ТОГДА ОП.КВСумма - ОП.АВилиСкидкаСумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ*&КоэффициентСКВ КАК СКВ,
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСумма > (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	|						ТОГДА ОП.КВСумма - (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт > 0
	|						И (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания) > ОП.АВилиСкидкаСумма
	|					ТОГДА (ОП.КВСуммаДляАгента-ОП.КВСуммаУдержания) - ОП.АВилиСкидкаСумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ*&КоэффициентСКВ КАК СКВДляАгента,
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСуммаДляОтчета > ОП.КВСуммаДляАгента
	|						ТОГДА ОП.КВСуммаДляОтчета - ОП.КВСуммаДляАгента
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт > 0
	|						И ОП.КВСуммаДляОтчета > ОП.АВилиСкидкаСумма
	|					ТОГДА ОП.КВСуммаДляОтчета - ОП.АВилиСкидкаСумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СКВДляОтчета,
	|	ОП.ЗарплатныйПериод,
	|	ОП.Агент,
	|	ОП.СтраховойПолис,
	|	ОП.КВСумма,
	|	ОП.ЭтоКрупнаяСделка,
	|	ОП.ИсключитьИзРасчетаЗП,
	|	ОП.ПометкаУдаления
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ИсточникДанных КАК ОП
	|ГДЕ
	|	ОП.Ссылка = &Ссылка";
	Если ПоКрупнымСделкам Тогда
		ТекстДопЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_Данные.СКВ,
		|	ВТ_Данные.СКВДляАгента,
		|	ВТ_Данные.СКВДляОтчета,
		|	ВТ_Данные.ЗарплатныйПериод,
		|	ВТ_Данные.Агент,
		|	ВТ_Данные.СтраховойПолис,
		|	ВТ_СП.Страхователь КАК Страхователь,
		|	ВТ_Данные.КВСумма,
		|	ВТ_Данные.ЭтоКрупнаяСделка,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ИсключитьИзРасчетаЗП
		|				ИЛИ ВТ_Данные.ПометкаУдаления
		|				ИЛИ ВТ_СП.Ссылка ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Исключена
		|ПОМЕСТИТЬ ВТ_Оплата
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК ВТ_СП
		|		ПО ВТ_Данные.СтраховойПолис = ВТ_СП.Ссылка
		|			И (НЕ ВТ_СП.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЗП.РазмерКрупнойСделки,
		|	ПРЗП.Период
		|ПОМЕСТИТЬ ВТ_ПРЗП
		|ИЗ
		|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних КАК ПРЗП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		|	СУММА(ОП.КВСумма) КАК СуммаКВСумма,
		|	ОП.Агент КАК Агент
		|ПОМЕСТИТЬ АВТО_КС
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПРЗП КАК ВТ_ПРЗП
		|		ПО ОП.ЗарплатныйПериод >= ВТ_ПРЗП.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Оплата КАК ВТ_Оплата
		|		ПО (НЕ ВТ_Оплата.Исключена)
		|			И (НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВТ_Оплата.ЗарплатныйПериод, МЕСЯЦ))
		|			И ОП.Агент = ВТ_Оплата.Агент
		|			И ОП.СтраховойПолис.Страхователь = ВТ_Оплата.Страхователь
		|			И (НЕ ВТ_Оплата.ЭтоКрупнаяСделка)
		|ГДЕ
		|	НЕ ОП.ИсключитьИзРасчетаЗП
		|	И НЕ ОП.ПометкаУдаления
		|	И НЕ ОП.СтраховойПолис = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
		|	И НЕ ОП.СтраховойПолис.ПометкаУдаления
		|	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок
		|
		|СГРУППИРОВАТЬ ПО
		|	ОП.СтраховойПолис.Страхователь,
		|	ВТ_ПРЗП.РазмерКрупнойСделки,
		|	ОП.Агент
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОП.КВСумма) > ЕСТЬNULL(ВТ_ПРЗП.РазмерКрупнойСделки, 41900)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ПРЗП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплата.СКВ КАК СКВ,
		|	ВЫБОР
		|		КОГДА АВТО_КС.Страхователь ЕСТЬ NULL 
		|				И НЕ ВТ_Оплата.ЭтоКрупнаяСделка
		|				И НЕ ВТ_Оплата.Исключена
		|			ТОГДА ВТ_Оплата.СКВДляАгента
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СКВДляАгента,
		|	ВТ_Оплата.СКВДляОтчета КАК СКВДляОтчета,
		|	АВТО_КС.Страхователь КАК Страхователь,
		|	АВТО_КС.СуммаКВСумма КАК СуммаКВСумма,
		|	ВЫБОР
		|		КОГДА АВТО_КС.Страхователь ЕСТЬ NULL 
		|				И НЕ ВТ_Оплата.ЭтоКрупнаяСделка
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоКрупнаяСделка
		|ИЗ
		|	ВТ_Оплата КАК ВТ_Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ АВТО_КС КАК АВТО_КС
		|		ПО (ВТ_Оплата.ЗарплатныйПериод >= ДАТАВРЕМЯ(2012, 10, 1, 0, 0, 0))";
	Иначе
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Данные", "");
		ТекстДопЗапроса =
		"ВЫБРАТЬ
		|	ВТ_Данные.СКВ,
		|	ВТ_Данные.СКВДляОтчета,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ИсключитьИзРасчетаЗП
		|				ИЛИ ВТ_Данные.ПометкаУдаления
		|				ИЛИ ВТ_СП.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.СКВДляАгента
		|	КОНЕЦ КАК СКВДляАгента
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК ВТ_СП
		|		ПО ВТ_Данные.СтраховойПолис = ВТ_СП.Ссылка
		|			И (НЕ ВТ_СП.ПометкаУдаления)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + ТекстДопЗапроса;
	ЗапросСКВ.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Если ТипЗнчДанные = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникДанных", "Документ.уб_ОплатаПолисов");
	Иначе
		ОписаниеТиповБулево = ОбщегоНазначения.ПолучитьОписаниеТиповБулево();
		ОписаничеЧисла	= ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2);
		
		ИсточникДанных = Новый ТаблицаЗначений;
		ИсточникДанных.Колонки.Добавить("Ссылка",											уб_temp.СозданиеОписанияТиповПоТипу(Тип("ДокументСсылка.уб_ОплатаПолисов")));
		ИсточникДанных.Колонки.Добавить("ОплаченоФакт",										ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("СкидкаВыплаченаяКлиенту",							ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("НачисленнаяСуммаВзноса",							ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику",	ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("КВСумма",											ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 4));
		ИсточникДанных.Колонки.Добавить("КВСуммаДляАгента",									ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 4));
		ИсточникДанных.Колонки.Добавить("КВСуммаУдержания",									ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 4));
		ИсточникДанных.Колонки.Добавить("КВСуммаДляОтчета",									ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("АВилиСкидкаСумма",									ОписаничеЧисла);
		ИсточникДанных.Колонки.Добавить("ЗарплатныйПериод",									ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
		ИсточникДанных.Колонки.Добавить("СтраховойПолис",									уб_temp.СозданиеОписанияТиповПоТипу(Тип("ДокументСсылка.уб_СтраховойПолис")));
		ИсточникДанных.Колонки.Добавить("ИсключитьИзРасчетаЗП",								ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("ПометкаУдаления",									ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("ЭтоКрупнаяСделка",									ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("СхемаРасчетаСМенеджером",						  	уб_temp.СозданиеОписанияТиповПоТипу(Тип("ПланВидовРасчетаСсылка.уб_РасчетЗарплатыМенеджерамОП")));

		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
		Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ИсточникДанных.Колонки.Добавить("Агент", Новый ОписаниеТипов(Массив));
		СтрокаТЗ = ИсточникДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Данные);
		ЗапросСКВ.УстановитьПараметр("ИсточникДанных", ИсточникДанных); 
	КонецЕсли;
	ЗапросСКВ.Текст = ТекстЗапроса;
	Выборка = ЗапросСКВ.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	КонецЕсли;
	//МассивИменКВ = Новый Массив;
	//МассивИменКВ.Добавить("");
	//МассивИменКВ.Добавить("ДляАгента");
	//МассивИменКВ.Добавить("ДляОтчета");
	//Для Каждого ЭлементМассиваИменКВ Из МассивИменКВ Цикл
	//	КлючПараметры = "СКВ" + ЭлементМассиваИменКВ;
	//	КВСумма = Данные["КВСумма" + ЭлементМассиваИменКВ];
	//	СуммаВзносаДляРасчетов = ?(Данные.НачисленнаяСуммаВзноса = 0, Данные.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику, Данные.НачисленнаяСуммаВзноса);
	//	Если Данные.ОплаченоФакт - Данные.СкидкаВыплаченаяКлиенту < СуммаВзносаДляРасчетов - КВСумма Тогда
	//		Параметры[КлючПараметры] = 0;
	//	Иначе
	//		Параметры[КлючПараметры] = Данные.ОплаченоФакт - СуммаВзносаДляРасчетов - Данные.СкидкаВыплаченаяКлиенту + КВСумма;
	//	КонецЕсли;
	//КонецЦикла;
	Если Лев(ТипРезультата, 3) = "стр" Тогда
		Результат = Параметры
	ИначеЕсли Лев(ТипРезультата, 2) = "кс" Тогда
		Результат = Параметры.ЭтоКрупнаяСделка
	ИначеЕсли Параметры.Свойство("СКВ" + ТипРезультата) Тогда
		Результат = Параметры["СКВ" + ТипРезультата]
	Иначе
		Результат = 0;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьСКВ()

Функция ПолучитьСКВСтарый(Данные, Знач ТипРезультата = "стр", Параметры = Неопределено, ПоКрупнымСделкам = ЛОЖЬ) Экспорт

	Параметры = Новый Структура("СКВ, СКВДляАгента, СКВДляОтчета, ЭтоКрупнаяСделка, Исключена", 0, 0, 0, Ложь, Ложь);
	ТипЗнчДанные = ТипЗнч(Данные);
	ТипРезультата = СокрЛП(НРег(ТипРезультата));
	ЗапросСКВ = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСумма > ОП.КВСуммаДляАгента
	|						ТОГДА ОП.КВСумма - ОП.КВСуммаДляАгента
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.КВСумма
	|					ТОГДА 0
	|				ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СКВ,
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСумма > ОП.КВСуммаДляАгента
	|						ТОГДА ОП.КВСумма - ОП.КВСуммаДляАгента
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.КВСуммаДляАгента
	|					ТОГДА 0
	|				ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляАгента
	|			КОНЕЦ
	|	КОНЕЦ КАК СКВДляАгента,
	|	ВЫБОР
	|		КОГДА ОП.СхемаРасчетаСМенеджером = ЗНАЧЕНИЕ(ПланВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ)
	|			ТОГДА ВЫБОР
	|					КОГДА ОП.КВСуммаДляОтчета > ОП.КВСуммаДляАгента
	|						ТОГДА ОП.КВСуммаДляОтчета - ОП.КВСуммаДляАгента
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОП.ОплаченоФакт - ОП.СкидкаВыплаченаяКлиенту < ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.КВСуммаДляОтчета
	|					ТОГДА 0
	|				ИНАЧЕ ОП.ОплаченоФакт - ВЫБОР
	|						КОГДА ОП.НачисленнаяСуммаВзноса = 0
	|							ТОГДА ОП.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику
	|						ИНАЧЕ ОП.НачисленнаяСуммаВзноса
	|					КОНЕЦ - ОП.СкидкаВыплаченаяКлиенту + ОП.КВСуммаДляОтчета
	|			КОНЕЦ
	|	КОНЕЦ КАК СКВДляОтчета,
	|	ОП.ЗарплатныйПериод,
	|	ОП.Агент,
	|	ОП.СтраховойПолис,
	|	ОП.КВСумма,
	|	ОП.ЭтоКрупнаяСделка,
	|	ОП.ИсключитьИзРасчетаЗП,
	|	ОП.ПометкаУдаления
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ИсточникДанных КАК ОП
	|ГДЕ
	|	ОП.Ссылка = &Ссылка";
	Если ПоКрупнымСделкам Тогда
		ТекстДопЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_Данные.СКВ,
		|	ВТ_Данные.СКВДляАгента,
		|	ВТ_Данные.СКВДляОтчета,
		|	ВТ_Данные.ЗарплатныйПериод,
		|	ВТ_Данные.Агент,
		|	ВТ_Данные.СтраховойПолис,
		|	ВТ_СП.Страхователь КАК Страхователь,
		|	ВТ_Данные.КВСумма,
		|	ВТ_Данные.ЭтоКрупнаяСделка,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ИсключитьИзРасчетаЗП
		|				ИЛИ ВТ_Данные.ПометкаУдаления
		|				ИЛИ ВТ_СП.Ссылка ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Исключена
		|ПОМЕСТИТЬ ВТ_Оплата
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК ВТ_СП
		|		ПО ВТ_Данные.СтраховойПолис = ВТ_СП.Ссылка
		|			И (НЕ ВТ_СП.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЗП.РазмерКрупнойСделки,
		|	ПРЗП.Период
		|ПОМЕСТИТЬ ВТ_ПРЗП
		|ИЗ
		|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних КАК ПРЗП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОП.СтраховойПолис.Страхователь КАК Страхователь,
		|	СУММА(ОП.КВСумма) КАК СуммаКВСумма,
		|	ОП.Агент КАК Агент
		|ПОМЕСТИТЬ АВТО_КС
		|ИЗ
		|	Документ.уб_ОплатаПолисов КАК ОП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПРЗП КАК ВТ_ПРЗП
		|		ПО ОП.ЗарплатныйПериод >= ВТ_ПРЗП.Период
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Оплата КАК ВТ_Оплата
		|		ПО (НЕ ВТ_Оплата.Исключена)
		|			И (НАЧАЛОПЕРИОДА(ОП.ЗарплатныйПериод, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВТ_Оплата.ЗарплатныйПериод, МЕСЯЦ))
		|			И ОП.Агент = ВТ_Оплата.Агент
		|			И ОП.СтраховойПолис.Страхователь = ВТ_Оплата.Страхователь
		|			И (НЕ ВТ_Оплата.ЭтоКрупнаяСделка)
		|ГДЕ
		|	НЕ ОП.ИсключитьИзРасчетаЗП
		|	И НЕ ОП.ПометкаУдаления
		|	И НЕ ОП.СтраховойПолис = ЗНАЧЕНИЕ(Документ.уб_СтраховойПолис.ПустаяСсылка)
		|	И НЕ ОП.СтраховойПолис.ПометкаУдаления
		|	И НЕ ОП.СтраховойПолис.НомерЗаявки ССЫЛКА Перечисление.уб_ВидыЗаявок
		|
		|СГРУППИРОВАТЬ ПО
		|	ОП.СтраховойПолис.Страхователь,
		|	ВТ_ПРЗП.РазмерКрупнойСделки,
		|	ОП.Агент
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОП.КВСумма) > ЕСТЬNULL(ВТ_ПРЗП.РазмерКрупнойСделки, 41900)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ПРЗП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплата.СКВ КАК СКВ,
		|	ВЫБОР
		|		КОГДА АВТО_КС.Страхователь ЕСТЬ NULL 
		|				И НЕ ВТ_Оплата.ЭтоКрупнаяСделка
		|				И НЕ ВТ_Оплата.Исключена
		|			ТОГДА ВТ_Оплата.СКВДляАгента
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СКВДляАгента,
		|	ВТ_Оплата.СКВДляОтчета КАК СКВДляОтчета,
		|	АВТО_КС.Страхователь КАК Страхователь,
		|	АВТО_КС.СуммаКВСумма КАК СуммаКВСумма,
		|	ВЫБОР
		|		КОГДА АВТО_КС.Страхователь ЕСТЬ NULL 
		|				И НЕ ВТ_Оплата.ЭтоКрупнаяСделка
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоКрупнаяСделка
		|ИЗ
		|	ВТ_Оплата КАК ВТ_Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ АВТО_КС КАК АВТО_КС
		|		ПО (ВТ_Оплата.ЗарплатныйПериод >= ДАТАВРЕМЯ(2012, 10, 1, 0, 0, 0))";
	Иначе
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Данные", "");
		ТекстДопЗапроса =
		"ВЫБРАТЬ
		|	ВТ_Данные.СКВ,
		|	ВТ_Данные.СКВДляОтчета,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ИсключитьИзРасчетаЗП
		|				ИЛИ ВТ_Данные.ПометкаУдаления
		|				ИЛИ ВТ_СП.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Данные.СКВДляАгента
		|	КОНЕЦ КАК СКВДляАгента
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК ВТ_СП
		|		ПО ВТ_Данные.СтраховойПолис = ВТ_СП.Ссылка
		|			И (НЕ ВТ_СП.ПометкаУдаления)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + ТекстДопЗапроса;
	ЗапросСКВ.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Если ТипЗнчДанные = Тип("ДокументСсылка.уб_ОплатаПолисов") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникДанных", "Документ.уб_ОплатаПолисов");
	Иначе
		ОписаниеТиповБулево = ОбщегоНазначения.ПолучитьОписаниеТиповБулево();
		ОписаниеТиповЧисло	= ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2);
		ИсточникДанных = Новый ТаблицаЗначений;
		ИсточникДанных.Колонки.Добавить("Ссылка",											уб_temp.СозданиеОписанияТиповПоТипу(Тип("ДокументСсылка.уб_ОплатаПолисов")));
		ИсточникДанных.Колонки.Добавить("ОплаченоФакт",										ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2));
		ИсточникДанных.Колонки.Добавить("СкидкаВыплаченаяКлиенту",							ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2));
		ИсточникДанных.Колонки.Добавить("НачисленнаяСуммаВзноса",							ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2));
		ИсточникДанных.Колонки.Добавить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику",	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2));
		ИсточникДанных.Колонки.Добавить("КВСумма",											ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 4));
		ИсточникДанных.Колонки.Добавить("КВСуммаДляАгента",									ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 4));
		ИсточникДанных.Колонки.Добавить("КВСуммаДляОтчета",									ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 2));
		ИсточникДанных.Колонки.Добавить("ЗарплатныйПериод",									ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
		ИсточникДанных.Колонки.Добавить("СтраховойПолис",									уб_temp.СозданиеОписанияТиповПоТипу(Тип("ДокументСсылка.уб_СтраховойПолис")));
		ИсточникДанных.Колонки.Добавить("ИсключитьИзРасчетаЗП",								ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("ПометкаУдаления",									ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("ЭтоКрупнаяСделка",									ОписаниеТиповБулево);
		ИсточникДанных.Колонки.Добавить("СхемаРасчетаСМенеджером",						  	уб_temp.СозданиеОписанияТиповПоТипу(Тип("ПланВидовРасчетаСсылка.уб_РасчетЗарплатыМенеджерамОП")));

		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
		Массив.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ИсточникДанных.Колонки.Добавить("Агент", Новый ОписаниеТипов(Массив));
		СтрокаТЗ = ИсточникДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Данные);
		ЗапросСКВ.УстановитьПараметр("ИсточникДанных", ИсточникДанных); 
	КонецЕсли;
	ЗапросСКВ.Текст = ТекстЗапроса;
	Выборка = ЗапросСКВ.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	КонецЕсли;
	//МассивИменКВ = Новый Массив;
	//МассивИменКВ.Добавить("");
	//МассивИменКВ.Добавить("ДляАгента");
	//МассивИменКВ.Добавить("ДляОтчета");
	//Для Каждого ЭлементМассиваИменКВ Из МассивИменКВ Цикл
	//	КлючПараметры = "СКВ" + ЭлементМассиваИменКВ;
	//	КВСумма = Данные["КВСумма" + ЭлементМассиваИменКВ];
	//	СуммаВзносаДляРасчетов = ?(Данные.НачисленнаяСуммаВзноса = 0, Данные.ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику, Данные.НачисленнаяСуммаВзноса);
	//	Если Данные.ОплаченоФакт - Данные.СкидкаВыплаченаяКлиенту < СуммаВзносаДляРасчетов - КВСумма Тогда
	//		Параметры[КлючПараметры] = 0;
	//	Иначе
	//		Параметры[КлючПараметры] = Данные.ОплаченоФакт - СуммаВзносаДляРасчетов - Данные.СкидкаВыплаченаяКлиенту + КВСумма;
	//	КонецЕсли;
	//КонецЦикла;
	Если Лев(ТипРезультата, 3) = "стр" Тогда
		Результат = Параметры
	ИначеЕсли Лев(ТипРезультата, 2) = "кс" Тогда
		Результат = Параметры.ЭтоКрупнаяСделка
	ИначеЕсли Параметры.Свойство("СКВ" + ТипРезультата) Тогда
		Результат = Параметры["СКВ" + ТипРезультата]
	Иначе
		Результат = 0;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ПолучитьСКВ()
////старый алгоритм
//Процедура ОП_ПересчетСумм2(
//	ОП, 
//	Форма 							= Неопределено, 
//	ПараметрыПерерасчета 			= Неопределено,
//	ИнфоКВМ 						= "", 
//	СтатПоКАСКО 					= Неопределено,
//	СведенияОСквитованныхОплатах 	= Неопределено,
//	СуммаПоПриемкам 				= 0,
//	бНетКвитовкиПоСуммам 			= Неопределено
//	) Экспорт
//	
//	Если ПараметрыПерерасчета = Неопределено Тогда
//		ПараметрыПерерасчета = Новый Структура("Страхователь,Менеджер,КВ,Поставщик",Истина,Истина,Истина,Истина);
//	КонецЕсли;	
//	
//	РасчетПоАВ = ОП.Знч("ВидРасчетаСАгентом") = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ;
//	ВКассу     = ОП.Знч("ФормаОплаты") = Перечисления.уб_ФормыОплаты.Касса;
//	ПоБезналу  = ОП.Знч("ФормаОплаты") = Перечисления.уб_ФормыОплаты.Безнал;
//	Поставщику = ОП.Знч("ФормаОплаты") = Перечисления.уб_ФормыОплаты.Поставщику;
//	бФорма     = Форма <> Неопределено;                        
//	бОплаченоВБрокер = ПоБезналу ИЛИ ВКассу;
//	бЕстьОП = НЕ ОП.Знч("ОтчетПоставщику").Пустая();
//	Если ОП.Знч("НачисленнаяСуммаВзноса") = 0 //И бОплаченоВБрокер <--Непонятно-->
//		И бЕстьОП Тогда
//		//Это поле в этой ситуации "нерасчетное", а вводится руками, чтобы не занулятся при замене бланка после сдачи отчета 
//	Иначе	
//		УстЗнч(ОП,"ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику", ?(бОплаченоВБрокер, ОП.Знч("НачисленнаяСуммаВзноса"), ОП.Знч("ОплаченоФакт")), Форма);
//	КонецЕсли;	
//	СуммаВзносаДляРасчетов  = ?(ОП.Знч("НачисленнаяСуммаВзноса")=0,ОП.Знч("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"),ОП.Знч("НачисленнаяСуммаВзноса"));
//	Если  ПараметрыПерерасчета.Свойство("Страхователь") и ПараметрыПерерасчета.Страхователь = Истина Тогда		
//		Если РасчетПоАВ Тогда
//			_АВилиСкидкаПроцент = ОП.Знч("АВилиСкидкаПроцент");
//			_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") * _АВилиСкидкаПроцент / 100, 2); 
//			УстЗнч(ОП,"АВилиСкидкаПроцент", _АВилиСкидкаПроцент, Форма);
//			УстЗнч(ОП,"АВилиСкидкаСумма", _АВилиСкидкаСумма, Форма);
//		Иначе
//			Если ВКассу Тогда
//				УстЗнч(ОП,"СкидкаВыплаченаяКлиенту", 0, Форма);
//			ИначеЕсли Поставщику Тогда
//			КонецЕсли;
//			_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") - ОП.Знч("ОплаченоФакт") + ОП.Знч("СкидкаВыплаченаяКлиенту"), 2);
//			Если ОП.Знч("НачисленнаяСуммаВзноса") > 0 Тогда
//				//_АВилиСкидкаСумма = Окр(ОП.Знч("НачисленнаяСуммаВзноса") - ОП.Знч("ОплаченоФакт") + ОП.Знч("СкидкаВыплаченаяКлиенту"),2);
//				_АВилиСкидкаПроцент = Окр(_АВилиСкидкаСумма * 100 / ОП.Знч("НачисленнаяСуммаВзноса"), 2);
//			Иначе	
//				//_АВилиСкидкаСумма = 0;
//				_АВилиСкидкаПроцент = 0;
//			КонецЕсли;
//			УстЗнч(ОП,"АВилиСкидкаСумма", _АВилиСкидкаСумма, Форма);
//			УстЗнч(ОП,"АВилиСкидкаПроцент", _АВилиСкидкаПроцент, Форма);
//		КонецЕсли;	
//	КонецЕсли;	
//	Если ПараметрыПерерасчета.Свойство("КВ") и ПараметрыПерерасчета.КВ = Истина Тогда
//		КВРавно = ?(РасчетПоАВ, ЛОЖЬ, ОП.Знч("КВСумма") = ОП.Знч("КВСуммаДляАгента")); //До пересчета КВ агента и КВ брокера совпадают
//		
//		_Разрядность = ОП.Знч("РазрядностьОкругления");
//		_РежимОкругления  = ОП.Знч("РежимОкругления");
//		_КВСумма = Окр(СуммаВзносаДляРасчетов * ОП.Знч("КВПроцент") / 100, _Разрядность,_РежимОкругления);
//		
//		УстЗнч(ОП,"КВСумма", _КВСумма, Форма);
//		Если РасчетПоАВ Тогда
//			//процент агента всегда синхронизируется с АВ 
//			УстЗнч(ОП,"КВПроцентДляАгента", _АВилиСкидкаПроцент, Форма);
//			УстЗнч(ОП,"КВСуммаДляАгента", _АВилиСкидкаСумма, Форма);
//		Иначе
//			Если КВРавно Тогда
//				УстЗнч(ОП,"КВПроцентДляАгента", ОП.Знч("КВПроцент"), Форма);
//				УстЗнч(ОП,"КВСуммаДляАгента", _КВСумма, Форма);
//			КонецЕсли;	
//		КонецЕсли;	
//	КонецЕсли;
//	Если ПараметрыПерерасчета.Свойство("Менеджер") и ПараметрыПерерасчета.Менеджер = Истина Тогда
//		//--- в случае, если ДС недостаточно покрыть платежи поставщику или скидку клиенту, происходит удержание с менеджера
//		_ВознаграждениеМенеджера = 0;
//		__ПримечаниеКОплатеАгентом = "";
//		ПВР = ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП;
//		_СхемаРасчетаСМенеджером = ПВР.БезРасчета; 
//		Если РасчетПоАВ Тогда
//			_КОплатеАгентом = ОП.Знч("НачисленнаяСуммаВзноса") - ОП.Знч("ОплаченоФакт") - ОП.Знч("АВилиСкидкаСумма") + ОП.Знч("ВычетСАгента");
//			__ДоходБрокера = ОП.Знч("КВСумма") - ОП.Знч("АВилиСкидкаСумма") + ОП.Знч("ВычетСАгента");
//			Если ОП.Знч("НачисленнаяСуммаВзноса")<=0 Тогда
//				__СКВ = 0;
//				__СКВАгента = 0;
//			Иначе	
//				__СКВ = ?(ОП.Знч("АВилиСкидкаСумма")>ОП.Знч("КВСумма"),0,ОП.Знч("КВСумма") - ОП.Знч("АВилиСкидкаСумма"));//В расчет не попадает, но расчитаем и покажем в форме
//				__СКВАгента = ?(ОП.Знч("АВилиСкидкаСумма")>ОП.Знч("КВСуммаДляАгента"),0,ОП.Знч("КВСуммаДляАгента") - ОП.Знч("АВилиСкидкаСумма"));//В расчет не попадает, но расчитаем и покажем в форме
//			КонецЕсли;	
//			
//			УстЗнч(ОП,"Подразделение", уб_СС.ПолучитьПодразделениеАгента(ОП.Знч("Агент"), ОП.Знч("Дата"), Ложь, Истина),Форма);
//		Иначе
//			//Расчет По Схеме
//			УстЗнч(ОП,"НеМенятьАВ", Ложь, Форма);
//			Если НЕ ОП.Знч("ИсключитьИзРасчетаЗП") Тогда
//				СведенияОСквитованныхОплатах = Неопределено;
//				СуммаПоПриемкам = 0;
//				бНетКвитовкиПоСуммам = НЕ уб_СС.КвитовкаПоСуммам(?(ОП.ЭтоНовый(),ОП.ПолучитьСсылкуНового(),ОП.Знч("Ссылка")),,СуммаПоПриемкам,,ОП,СведенияОСквитованныхОплатах);
//				ПолучитьВознаграждениеМенеджера2(ОП, _ВознаграждениеМенеджера, ИнфоКВМ, _СхемаРасчетаСМенеджером, СтатПоКАСКО, Истина,СведенияОСквитованныхОплатах,СуммаПоПриемкам);
//			Иначе
//				УстЗнч(ОП,"Подразделение", уб_СС.ПолучитьПодразделениеАгента(ОП.Знч("Агент"), ОП.Знч("Дата"), Ложь, Истина),Форма);	
//			КонецЕсли;
//			_СуммаДляСК = СуммаВзносаДляРасчетов - ОП.Знч("КВСумма");
//			_ПолученоОтКлиентаФакт = (ОП.Знч("ОплаченоФакт") - ОП.Знч("СкидкаВыплаченаяКлиенту"));
//			Если _ПолученоОтКлиентаФакт < _СуммаДляСК Тогда
//				//Это условие соответствует условию КВСумма < АВилиСкидкаСумма
//				Если ВКассу Тогда
//					__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) больше фактически оплаченной суммы (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена максимальная из двух сумм.";	
//					_КОплатеАгентом = _СуммаДляСК;
//				Иначе
//					__ПримечаниеКОплатеАгентом = "Сумма, которую брокер должен перечислить в СК (" + _СуммаДляСК + "р) меньше суммы, фактически переведенной брокеру (" + ОП.Знч("ОплаченоФакт") + "р), поэтому в поле установлена сумма недоплаты.";	
//					_КОплатеАгентом = _СуммаДляСК - _ПолученоОтКлиентаФакт;
//				КонецЕсли;	
//				__СКВ = 0;
//				__СКВАгента = 0;
//				__ДоходБрокера = 0;
//			Иначе
//				Если ВКассу Тогда
//					_КОплатеАгентом = _ПолученоОтКлиентаФакт;
//				Иначе
//					_КОплатеАгентом = 0;
//				КонецЕсли;	
//				__СКВ = _ПолученоОтКлиентаФакт - _СуммаДляСК;
//				__СКВАгента = _ПолученоОтКлиентаФакт - (СуммаВзносаДляРасчетов - ОП.Знч("КВСуммаДляАгента")); 
//				Если ОП.Знч("ВМпоРезультатамПериодаЗП") Тогда
//					__ДоходБрокера = 0;
//				Иначе
//					__ДоходБрокера = __СКВ - _ВознаграждениеМенеджера;
//				КонецЕсли;
//			КонецЕсли;
//			УстЗнч(ОП,"СхемаРасчетаСМенеджером", _СхемаРасчетаСМенеджером, Форма); //, Истина	
//		КонецЕсли;
//		Если бФорма Тогда
//			Форма.лАгентВнешний 					= (ОП.Знч("Подразделение") = ПараметрыСеанса.уб_Константы.уб_ПодразделениеАгентскойСети);//Проверить зачем
//			Форма.лИнфоКВМ 							= ИнфоКВМ;	
//			Форма.лПримечаниеКОплатеАгентом 		= __ПримечаниеКОплатеАгентом;	
//			Форма.лТекущееВознаграждениеМенеджера 	= _ВознаграждениеМенеджера;
//			Форма.лСКВ 								= __СКВ;	
//			эф = Форма.ЭлементыФормы;
//			ЦветСКВ = ?(__СКВ = 0,Новый Цвет(255, 196, 196), Новый Цвет);
//			эф.СКВ.ЦветФонаПоля = ЦветСКВ;
//			Форма.ДоходБрокера = __ДоходБрокера; 	
//			Форма.лСхемаРасчетаСМенеджером = "Схема расчета: " + ?(РасчетПоАВ,"по АВ",_СхемаРасчетаСМенеджером); 	
//			эф.нСхемаРасчетаСМенеджером.ЦветФона  = ЦветСКВ;
//			эф.нСхемаРасчетаСМенеджером.Подсказка = ?(__СКВ = 0, "СКВ по этой оплате = 0 ","");
//		КонецЕсли;
//		УстЗнч(ОП,"ВМпоРезультатамПериодаЗП", _СхемаРасчетаСМенеджером = ПВР.ПланПоСКВ, Форма);
//		
//		УстЗнч(ОП,"КОплатеАгентом", _КОплатеАгентом, Форма);
//		//Дополнение актуальными данными из объекта
//		Если УстЗнч(ОП,"ВознаграждениеМенеджера", _ВознаграждениеМенеджера, Форма) = ИСТИНА И (НЕ СведенияОСквитованныхОплатах=Неопределено) И ТипЗнч(ОП) = Тип("ДокументОбъект.уб_ОплатаПолисов") Тогда
//			НайденнаяСтрока = СведенияОСквитованныхОплатах.Найти(ОП.Знч("Ссылка"), "ОплатаПолиса"); //TODO нужна ли ПолучитьСсылкуНового?
//			Если НайденнаяСтрока <> Неопределено Тогда
//				НайденнаяСтрока.ВознаграждениеМенеджера = _ВознаграждениеМенеджера; 
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	//Расчет полей для Отчета Поставщику
//	Если  ПараметрыПерерасчета.Свойство("Поставщик") и ПараметрыПерерасчета.Поставщик = Истина Тогда
//		//рОкр = ?(Разрядность,РежимОкругления.Окр15как10,РежимОкругления.Окр15как20);
//		//Разр = ?(Разрядность,2,4);
//		_КВИзмененное = Окр(СуммаВзносаДляРасчетов,2) - Окр(ОП.Знч("Баланс_Брокер_Поставщик"),2);
//		Если ОП.Знч("ПересчетКВ") И _КВИзмененное > 0 И ОП.Знч("Баланс_Брокер_Поставщик") > 0 Тогда 
//			_КВСуммаДляОтчета = _КВИзмененное;
//		Иначе	
//			_Разрядность = ОП.Знч("РазрядностьОкругления");
//			_РежимОкругления  = ОП.Знч("РежимОкругления");
//			_КВСуммаДляОтчета = Окр(СуммаВзносаДляРасчетов * ОП.Знч("КВПроцентДляОтчета") / 100, _Разрядность,_РежимОкругления); 
//		КонецЕсли;
//		УстЗнч(ОП,"КВСуммаДляОтчета", _КВСуммаДляОтчета, Форма);
//		СП = ОП.Знч("СтраховойПолис");
//		Если бЕстьОП Тогда
//			бДоговорБезУдержанияКВ = ОП.Знч("ОтчетПоставщику.ВидВзаиморасчета") = ПараметрыСеанса.уб_Константы.ВидВзаиморасчетовБезУдержанияКВ;
//			Если НЕ ЗначениеЗаполнено(бДоговорБезУдержанияКВ)Тогда
//				бДоговорБезУдержанияКВ = Неопределено;
//			КонецЕсли;
//		КонецЕсли;
//		Если бДоговорБезУдержанияКВ = Неопределено Тогда //Нет ОП, либо в ОП не указан Вид взаиморасчетов
//			Если Форма <> Неопределено Тогда
//				Если Форма.лСУдержанием = Неопределено Тогда
//					бДоговорБезУдержанияКВ = НЕ Форма.Определить_ЭтоРасчетСУдержаниемКВ();
//					Форма.лСУдержанием =  бДоговорБезУдержанияКВ;
//				Иначе
//					бДоговорБезУдержанияКВ = Форма.лСУдержанием;
//				КонецЕсли;	
//			Иначе	
//				бДоговорБезУдержанияКВ = НЕ уб_СС.ОпределитьЭтоРасчетСУдержаниемКВ(СП.Поставщик, СП.ОрганизацияАгент, СП.Дата, Ложь);
//			КонецЕсли;
//		КонецЕсли;	
//		_Баланс_Брокер_Поставщик = СуммаВзносаДляРасчетов
//		- ?(бДоговорБезУдержанияКВ и бОплаченоВБрокер, 0, ОП.Знч("КВСуммаДляОтчета"))
//		- ?(бОплаченоВБрокер		, 0, ОП.Знч("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"));
//		УстЗнч(ОП,"Баланс_Брокер_Поставщик", _Баланс_Брокер_Поставщик, Форма);
//		Если _Баланс_Брокер_Поставщик >= 0 Тогда
//			_СуммаКОплатеБрокеруДляОчетаПоставщику = 0;
//			//_СуммаКОплатеПоставщикуДляОчетаПоставщику = _Баланс_Брокер_Поставщик;
//		Иначе
//			_СуммаКОплатеБрокеруДляОчетаПоставщику = - _Баланс_Брокер_Поставщик;
//			//_СуммаКОплатеПоставщикуДляОчетаПоставщику = 0;
//		КонецЕсли;
//		УстЗнч(ОП,"СуммаКОплатеБрокеруДляОчетаПоставщику", _СуммаКОплатеБрокеруДляОчетаПоставщику, Форма);
//	КонецЕсли;
//	
//КонецПроцедуры
Функция СтруктураПолейДляРасчетаСКВ(Объект) Экспорт

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Ссылка",											Объект.Знч("Ссылка"));
	СтруктураПолей.Вставить("ОплаченоФакт",										Объект.Знч("ОплаченоФакт"));
	СтруктураПолей.Вставить("СкидкаВыплаченаяКлиенту",							Объект.Знч("СкидкаВыплаченаяКлиенту"));
	СтруктураПолей.Вставить("НачисленнаяСуммаВзноса",							Объект.Знч("НачисленнаяСуммаВзноса"));
	СтруктураПолей.Вставить("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику",	Объект.Знч("ПолученнаяСКлиентаСуммаВзносаДляОтчетаПоставщику"));
	СтруктураПолей.Вставить("КВСумма",											Объект.Знч("КВСумма"));
	СтруктураПолей.Вставить("КВСуммаДляАгента",									Объект.Знч("КВСуммаДляАгента"));
	СтруктураПолей.Вставить("КВСуммаУдержания",									Объект.Знч("КВСуммаУдержания"));
	СтруктураПолей.Вставить("КВСуммаДляОтчета",									Объект.Знч("КВСуммаДляОтчета"));
	СтруктураПолей.Вставить("АВИлиСкидкаСумма",									Объект.Знч("АВИлиСкидкаСумма"));
	СтруктураПолей.Вставить("ЗарплатныйПериод",									Объект.Знч("ЗарплатныйПериод"));
	СтруктураПолей.Вставить("СтраховойПолис",									Объект.Знч("СтраховойПолис"));
	СтруктураПолей.Вставить("Агент",											Объект.Знч("Агент"));
	СтруктураПолей.Вставить("ИсключитьИзРасчетаЗП",								Объект.Знч("ИсключитьИзРасчетаЗП"));
	СтруктураПолей.Вставить("ПометкаУдаления",									Объект.Знч("ПометкаУдаления"));
	СтруктураПолей.Вставить("ЭтоКрупнаяСделка",									Объект.Знч("ЭтоКрупнаяСделка"));
	СтруктураПолей.Вставить("СхемаРасчетаСМенеджером",							Объект.Знч("СхемаРасчетаСМенеджером"));
	СтруктураПолей.Вставить("ПроцентСКВ",							            Объект.Знч("ПроцентСКВ"));
	Возврат СтруктураПолей;

КонецФункции // СтруктураПолейДляРасчетаСКВ()
//Возвращает актуальность зарплатного периода, если переданы параметры производит ее изменение
Функция ЗарплатныйПериодАктуален(Период,ПараметрыЗаписи = Неопределено) Экспорт
	Отбор = Новый Структура ("РасчетныйПериод",НачалоМесяца(Период));
	
	ТаблицаАктуальности = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(ТекущаяДата(),Отбор);
	
	Актуален = Ложь;
	
	Если ТаблицаАктуальности.Количество() > 0 ТОгда
		//
		Актуален = ТаблицаАктуальности[0].Актуален;
	КонецЕсли;	
	Если ПравоДоступа("Изменение",Метаданные.РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП) = Истина и (НЕ ПараметрыЗаписи = Неопределено) И Актуален<>ПараметрыЗаписи.Актуален Тогда
		МЗ = РегистрыСведений.уб_АктуальностьРасчетаПериодовЗП.СоздатьМенеджерЗаписи();
		МЗ.Актуален 		= ПараметрыЗаписи.Актуален;
		МЗ.РасчетныйПериод 	= Период;
		МЗ.Период 			= ТекущаяДата();
		МЗ.Объект 			= ПараметрыЗаписи.Объект;
		Попытка
			МЗ.Записать();
			Актуален = МЗ.Актуален;
		Исключение
			#Если Клиент Тогда
			уб_СтраховойБрокер.ЗаписатьОшибкуИСообщить("Ошибка регистрации неактуальности периода расчета ЗП: " + ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;	
	КонецЕсли;
	Возврат Актуален;
КонецФункции

Функция ВернутьНеактуальныеПериоды() Экспорт
	ЗапросНеактуальныхПериодов = Новый Запрос("ВЫБРАТЬ
	                                          |	Вложенный.РасчетныйПериод КАК РасчетныйПериод
	                                          |ИЗ
	                                          |	(ВЫБРАТЬ
	                                          |		уб_АктуальностьРасчетаПериодовЗПСрезПоследних.РасчетныйПериод КАК РасчетныйПериод,
	                                          |		уб_АктуальностьРасчетаПериодовЗПСрезПоследних.Актуален КАК Актуален
	                                          |	ИЗ
	                                          |		РегистрСведений.уб_АктуальностьРасчетаПериодовЗП.СрезПоследних(, ) КАК уб_АктуальностьРасчетаПериодовЗПСрезПоследних) КАК Вложенный
	                                          |ГДЕ
	                                          |	НЕ Вложенный.Актуален
	                                          |	И Вложенный.РасчетныйПериод <> ДАТАВРЕМЯ(1, 1, 1)
	                                          |	И Вложенный.РасчетныйПериод >= ДАТАВРЕМЯ(2020, 1, 1)
	                                          |
	                                          |УПОРЯДОЧИТЬ ПО
	                                          |	РасчетныйПериод");
	//ЗапросНеактуальныхПериодов.УстановитьПараметр("ДатаВыплаты", ТекущаяДата());
	
	Возврат  ЗапросНеактуальныхПериодов.Выполнить().Выгрузить().ВыгрузитьКолонку("РасчетныйПериод");					  
КонецФункции	

Функция ПолучитьПараметрРасчетаЗП (ИмяПараметра,Сотрудник, Период = Неопределено,ЗначениеПоУмолчанию = Неопределено) Экспорт
	Если Период = Неопределено  Тогда
		Период = ТекущаяДата();
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Период,
	                      |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник,
	                      |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра,
	                      |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ЗначениеПараметра
	                      |ИЗ
	                      |	РегистрСведений.уб_ПараметрыРасчетаЗарплатыСотрудников.СрезПоследних(&Период, ) КАК уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних
	                      |ГДЕ
	                      |	уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник
	                      |	И уб_ПараметрыРасчетаЗарплатыСотрудниковСрезПоследних.ТипПараметра = &ТипПараметра");
Запрос.УстановитьПараметр("Период",Период);
Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
Запрос.УстановитьПараметр("ТипПараметра",ИмяПараметра);
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Возврат Выборка.ЗначениеПараметра;
Иначе
	Возврат ЗначениеПоУмолчанию;
КонецЕсли;	

Конецфункции	


Функция СписокДействующихСхемОплаты() Экспорт
	СписокДействующихСхемОплаты = Новый СписокЗначений;
	СписокДействующихСхемОплаты.Добавить(ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль);
	СписокДействующихСхемОплаты.Добавить(ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.БезРасчета);
	СписокДействующихСхемОплаты.Добавить(ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоАВ);
	СписокДействующихСхемОплаты.Добавить(ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПланПоСКВ);
	СписокДействующихСхемОплаты.Добавить(ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ПоИнтерваламСКВ);
	
	Возврат СписокДействующихСхемОплаты;
КонецФункции	

Функция СписокСхемДляВидаРасчетов(ВидРасчетаСАгентом) Экспорт
	
	СписокСхем = Новый СписокЗначений;
	ПВР =  ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП;
	//Если ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоСхеме Тогда
		СписокСхем.Добавить(ПВР.ПланПоСКВ);
	//	СписокСхем.Добавить(ПВР.ПоИнтерваламСКВ);
	//ИначеЕсли ВидРасчетаСАгентом = Перечисления.уб_ВидыРасчетовСАгентом.ПоАВ Тогда
	//	СписокСхем.Добавить(ПВР.ПланПоСКВ);
		СписокСхем.Добавить(ПВР.ПоАВ);
	//КонецЕсли;
	Возврат СписокСхем;
КонецФункции


Функция ПоказателиРасчетаЗП(Дата) экспорт
ПоказателиРасчетаЗП = Новый Структура();
Запрос = Новый Запрос(
"ВЫБРАТЬ
|	ПРЗП.*
|ИЗ
|	РегистрСведений.уб_ЗП_ПоказателиРасчетаЗП.СрезПоследних(&Период, ) КАК ПРЗП");
Запрос.УстановитьПараметр("Период", Дата);
Результат = Запрос.Выполнить(); 
Выборка = Результат.Выбрать();
Если Выборка.Следующий() Тогда
	//ЗаполнитьЗначенияСвойств(ПоказателиРасчетаЗП, Выборка);
	Для Каждого Колонка Из  Результат.Колонки Цикл
		ПоказателиРасчетаЗП.Вставить(Колонка.Имя,Выборка[Колонка.Имя]);
	КонецЦикла;
Иначе
	Для Каждого Колонка Из  Результат.Колонки Цикл
		ПоказателиРасчетаЗП.Вставить(Колонка.Имя,Колонка.ТипЗначения.ПривестиЗначение(0));
	КонецЦикла;
КонецЕсли;
Возврат  ПоказателиРасчетаЗП;
КонецФункции

Функция ПолучитьБланкПолиса(Оплата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	уб_СтраховойПолисБСО.ВидБСО,
	                      |	уб_СтраховойПолисБСО.НомерБСО,
	                      |	уб_СтраховойПолисБСО.НомерПолиса,
	                      |	уб_СтраховойПолисБСО.Оформлен
	                      |ИЗ
	                      |	Документ.уб_СтраховойПолис.БСО КАК уб_СтраховойПолисБСО
	                      |ГДЕ
	                      |	уб_СтраховойПолисБСО.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				ОП.СтраховойПолис
	                      |			ИЗ
	                      |				Документ.уб_ОплатаПолисов КАК ОП
	                      |			ГДЕ
	                      |				ОП.Ссылка = &Оплата)
	                      |	И уб_СтраховойПолисБСО.ВидБСО.Тип <> ЗНАЧЕНИЕ(Перечисление.уб_ТипыБСО.КвитанцияА7)
	                      |	И уб_СтраховойПолисБСО.Оформлен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	уб_СтраховойПолисБСО.ВидБСО.Тип.Порядок");
	Запрос.УстановитьПараметр("Оплата",Оплата);
	
	Себестоимость = 0;
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидБСО ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьСхемуИАлгоритмРасчета(Знач ВидБСО,Знач Агент,Знач ЗарплатныйПериод, Знач какТз = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидБСО",ВидБСО);
	Запрос.УстановитьПараметр("Агент",Агент);
	Запрос.УстановитьПараметр("тДата",ЗарплатныйПериод);
	Запрос.Текст  = "ВЫБРАТЬ
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Агент,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие,
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Подразделение.Родитель КАК ПодразделениеРодитель
	                |ПОМЕСТИТЬ Подразделения
	                |ИЗ
	                |	РегистрСведений.уб_ДвижениеФизлицПоПодразделениям.СрезПоследних(&тДата, Агент = &Агент) КАК уб_ДвижениеФизлицПоПодразделениямСрезПоследних
	                |ГДЕ
	                |	уб_ДвижениеФизлицПоПодразделениямСрезПоследних.Выбытие = ЛОЖЬ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ ПЕРВЫЕ 10000
	                |	уб_ВидыБСОСхемыРасчетаЗП.Ссылка,
	                |	уб_ВидыБСОСхемыРасчетаЗП.Период КАК Период,
	                |	уб_ВидыБСОСхемыРасчетаЗП.Агент,
	                |	уб_ВидыБСОСхемыРасчетаЗП.Схема,
	                |	уб_ВидыБСОСхемыРасчетаЗП.СхемаРОП,
	                |	уб_ВидыБСОСхемыРасчетаЗП.МинимальнаяСумма,
	                |	уб_ВидыБСОСхемыРасчетаЗП.Алгоритм,
	                |	ВЫБОР
	                |		КОГДА уб_ВидыБСОСхемыРасчетаЗП.Агент = НЕОПРЕДЕЛЕНО
	                |			ТОГДА 0
	                |		КОГДА ТИПЗНАЧЕНИЯ(уб_ВидыБСОСхемыРасчетаЗП.Агент) = ТИП(Справочник.ПодразделенияОрганизаций)
	                |				И уб_ВидыБСОСхемыРасчетаЗП.Агент = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                |			ТОГДА 1
	                |		КОГДА ТИПЗНАЧЕНИЯ(уб_ВидыБСОСхемыРасчетаЗП.Агент) = ТИП(Справочник.ПодразделенияОрганизаций)
	                |			ТОГДА 2
	                |		КОГДА ТИПЗНАЧЕНИЯ(уб_ВидыБСОСхемыРасчетаЗП.Агент) = ТИП(Справочник.ФизическиеЛица)
	                |				И уб_ВидыБСОСхемыРасчетаЗП.Агент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	                |			ТОГДА 3
	                |		ИНАЧЕ 4
	                |	КОНЕЦ КАК ПорядокПрименения
	                |ПОМЕСТИТЬ Схемы
	                |ИЗ
	                |	Справочник.уб_ВидыБСО.СхемыРасчетаЗП КАК уб_ВидыБСОСхемыРасчетаЗП
	                |ГДЕ
	                |	уб_ВидыБСОСхемыРасчетаЗП.Ссылка = &ВидБСО
	                |	И уб_ВидыБСОСхемыРасчетаЗП.Период <= &тДата
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Схемы.Ссылка,
	                |	Схемы.Период,
	                |	Схемы.Агент,
	                |	Схемы.Схема,
	                |	Схемы.СхемаРОП,
	                |	Схемы.МинимальнаяСумма,
	                |	Схемы.Алгоритм,
	                |	Схемы.ПорядокПрименения,
	                |	Подразделения.Подразделение
	                |ИЗ
	                |	Схемы КАК Схемы
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Подразделения КАК Подразделения
	                |		ПО (Схемы.Агент = Подразделения.Агент
	                |				ИЛИ Схемы.Агент = Подразделения.Подразделение
	                |				ИЛИ Схемы.Агент = Подразделения.ПодразделениеРодитель)
	                |ГДЕ
	                |	(НЕ Подразделения.Подразделение ЕСТЬ NULL 
	                |			ИЛИ Схемы.ПорядокПрименения < 2)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Схемы.ПорядокПрименения УБЫВ,
	                |	Схемы.Период УБЫВ";
					
	Результат = Запрос.Выполнить();
	Если какТз = Истина Тогда
		Возврат Результат.Выгрузить();
	Иначе
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Ответ = Новый Структура ("Схема,СхемаРОП,МинимальнаяСумма,Алгоритм");
			ЗаполнитьЗначенияСвойств(Ответ,Выборка);
			Возврат Ответ;
		Иначе	
			Возврат Неопределено; 			
		КонецЕсли;	
	КонецЕсли;	
		
					
КонецФункции	

Процедура ПрименитьСебестоимость(ДляМенеджера,ДляБрокера,Параметры)
	
	Оп = Параметры.Документ;
	
	ДопУслуга = Справочники.уб_ВидыБСО.НайтиПоНаименованию("Дополнительная услуга");
	
	СтрокаДоп = Неопределено;
	
	Для каждого СтрокаУ из Оп.УслугиПоДокументу Цикл
		Если СтрокаУ.Вид = ДопУслуга Тогда
			 СтрокаДоп = СтрокаУ;
			 Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаДоп = Неопределено Тогда
		СтрокаДоп       = Оп.УслугиПоДокументу.Добавить();
		СтрокаДоп.Вид   = ДопУслуга; 
	КонецЕсли;
	
	УстЗнч(СтрокаДоп, "СхемаОплаты", ПланыВидовРасчета.уб_РасчетЗарплатыМенеджерамОП.ВаловаяПрибыль, Параметры.бЗаблокирована);
	
	УстЗнч(СтрокаДоп, "Сумма", Параметры.ОплаченоФакт-ДляМенеджера, Параметры.бЗаблокирована);
	
	
	Параметры.НачисленнаяСуммаВзноса = ДляМенеджера;
	Параметры.СуммаДоп               = Оп.УслугиПоДокументу.Итог("Сумма");
	Параметры.КВПроцентДляАгента     = 0;
	Параметры.КВСуммаДляАгента       = 0; 
	
	Параметры.НеМенятьКВ             = Истина;
	Параметры.НеМенятьАВ             = Истина;
	Параметры.КВСумма                = ДляБрокера; 
	Параметры.КВПроцент              = ?(ДляМенеджера=0,0,уб_ОКР(ДляБрокера*100/ДляМенеджера, ОП.РазрядностьОкругления,ОП.Знч("РежимОкругления")));
	Параметры.КВСуммаДляОтчета       = Параметры.КВСумма; 
	Параметры.КВПроцентДляОтчета     = Параметры.КВПроцент;
	
	//Параметры.ДанныеБланка.МинимальнаяСумма;	
	
	
КонецПроцедуры	

Функция ПараметрыСВС(Курьер,Дата) Экспорт
	
	ТипПодразделения = Перечисления.уб_ТипПодразделения.ТочкаПродаж;
	
	Если ЗначениеЗаполнено(Курьер) Тогда
		Уволен = Ложь;
		_СВС = уб_СС.ПолучитьПодразделениеАгента(Курьер, Дата, Истина, Уволен);
		
		МассивСтруктур = уб_КЭШируемые.ПолучитьПодразделенияВС(,Истина);
		флНайден = Ложь;
		Для каждого Структ из МассивСтруктур Цикл
			Если _СВС = Структ.Ссылка Тогда
				флНайден = Истина;	
				ТипПодразделения = Структ.ТипПодразделения;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если флНайден = Ложь Тогда
			//_СВС = Справочники.ПодразделенияОрганизаций.ПустаяСсылка(); 	
			_СВС = ПараметрыСеанса.уб_Константы.уб_ПодразделениеСВС;
		КонецЕсли;	
		
	Иначе	
		_СВС = Справочники.ПодразделенияОрганизаций.ПустаяСсылка(); 
	КонецЕсли;	
	
	Результат = Новый Структура("Курьер,СВС,ТипПодразделения",Курьер,_СВС,ТипПодразделения);
	
	Возврат Результат;
КонецФункции


Функция ПолучитьИсточникЗаявки(СтраховойПолис) Экспорт
	//Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уб_ЗаявкаНаЗаказВыездногоСпециалиста.Источник
	               |ИЗ
	               |	Документ.уб_ЗаявкаНаЗаказВыездногоСпециалиста КАК уб_ЗаявкаНаЗаказВыездногоСпециалиста
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уб_СтраховойПолис КАК уб_СтраховойПолис
	               |		ПО уб_ЗаявкаНаЗаказВыездногоСпециалиста.Ссылка = уб_СтраховойПолис.Заявка
	               |ГДЕ
	               |	уб_СтраховойПолис.Ссылка = &СтраховойПолис";
	Запрос.УстановитьПараметр("СтраховойПолис",СтраховойПолис);
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Источник = Выборка.Источник;
	Иначе	
		Источник = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;	
	
	Возврат Источник;
КонецФункции	

Функция  ПолучитьСетку(_Период,_Подразделение) Экспорт
	_Сетка = Новый ТаблицаЗначений;
	_Сетка.Колонки.Добавить("ПроцентОт",Новый ОписаниеТипов("Число"));
	_Сетка.Колонки.Добавить("СтавкаПролонгация",Новый ОписаниеТипов("Число"));
	_Сетка.Колонки.Добавить("СтавкаНБ",Новый ОписаниеТипов("Число"));
	ТекСтавка = 100;
	Пока ТекСтавка >= 0 Цикл
		СтрокаСетки = _Сетка.Добавить();
		СтрокаСетки.ПроцентОт = ТекСтавка;
		
		ТекСтавка = ТекСтавка-10;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение",_Подразделение);
	Запрос.УстановитьПараметр("Период",_Период);
	Запрос.Текст  = "ВЫБРАТЬ
	|	уб_ЗП_СтавкиРОПСрезПоследних.Период,
	|	уб_ЗП_СтавкиРОПСрезПоследних.Подразделение,
	|	уб_ЗП_СтавкиРОПСрезПоследних.ВидМотивации,
	|	уб_ЗП_СтавкиРОПСрезПоследних.ПроцентОт,
	|	уб_ЗП_СтавкиРОПСрезПоследних.СтавкаВознаграждения
	|ИЗ
	|	РегистрСведений.уб_ЗП_СтавкиРОП.СрезПоследних(&Период,Подразделение = &Подразделение) КАК уб_ЗП_СтавкиРОПСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		нСтроки = _Сетка.НайтиСтроки(Новый Структура("ПроцентОт",Выборка.ПроцентОт));
		Если нСтроки.Количество() = 0 Тогда
			Сообщить("Не найден ПроцентОт "+Выборка.ПроцентОт);
			продолжить;
		КонецЕсли;	
		ТекСтрока = нСтроки[0];
		Если Выборка.ВидМотивации = ПланыВидовРасчета.уб_ОсновныеНачисленияОрганизаций.ВознПролонгация Тогда
			ТекСтрока.СтавкаПролонгация = Выборка.СтавкаВознаграждения;
		Иначе
			//Новый бизнес
			ТекСтрока.СтавкаНБ = Выборка.СтавкаВознаграждения;
		КонецЕсли;	
	КонецЦикла;	
	
	
	Возврат _Сетка;
	
КонецФункции	

Процедура ПолныйПерерасчетЗП() Экспорт
	перем ПротоколРасхождений;
	УстановитьПривилегированныйрежим(Истина);
	
	Организация = Справочники.Организации.НайтиПоКоду("000000001");
	Актуально = Истина;
	МассивДат = уб_РасчетыСМенеджерами.ВернутьНеактуальныеПериоды();
	ПрошлыйМесяц = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	Если МассивДат.Найти(ПрошлыйМесяц) = Неопределено Тогда
		МассивДат.Вставить(0,ПрошлыйМесяц);
	КонецЕсли;
	#Если Клиент Тогда
		Если ВвестиДату(ПрошлыйМесяц,"Выберите дату из нужного месяца",ЧастиДаты.Дата) = Истина Тогда
			ПрошлыйМесяц = НачалоМесяца(ПрошлыйМесяц);
			Если МассивДат.Найти(ПрошлыйМесяц) = Неопределено Тогда
				МассивДат.Вставить(0,ПрошлыйМесяц);
			КонецЕсли;	
		КонецЕсли;
	#КонецЕсли	
	
	Если МассивДат.Количество() > 0 Тогда
		Для Ит = 1 по МассивДат.Количество() Цикл
			ТекРасчетныйПериод = МассивДат[Ит-1];
			Если ЗначениеЗаполнено(ТекРасчетныйПериод) 
				И НачалоМесяца(ТекРасчетныйПериод) < НачалоМесяца(ТекущаяДата())
				Тогда
				СтрокаДат = Формат(ТекРасчетныйПериод,"ДФ='MMMM yyyy'")+";";
				//TODO пока нет модуля менеджера 1C 8.2 сделано так
				Если ТекРасчетныйПериод >= Дата(2020,1,1) Тогда
					Объект = Документы.уб_НачислениеЗП.ПолучитьДокументНачисленияЗаПериод(ТекРасчетныйПериод,Организация,Истина);
					#Если Клиент Тогда
					Состояние("Перерасчет периода:" + СтрокаДат);
					#КонецЕсли
					Объект.Перезаполнить(,, ПротоколРасхождений);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Если ПротоколРасхождений <> Неопределено Тогда
		ПротоколРасхождений.Показать();
	КонецЕсли;
	//Возврат Актуально;
	
КонецПроцедуры	

Процедура ПроверитьВидСтрахования(Объект,ВидСП = Неопределено) Экспорт
	Если ВидСП = Неопределено Тогда
		ВидСП = Объект.ВидСП;
	КонецЕсли;	
	Если ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КАСКО
		или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕКАСКО
		или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КаскоПП
		Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.КАСКО;
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ОСАГО
		или ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ЕОсаго Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.ОСАГО;	
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ВЗР	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.ВЗР;		
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ГК	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.ГК;			
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДМС	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.ДМС;				
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.ДСАГО	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.ДСАГО;					
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Имущество	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.Имущество;						
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Ипотека	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.Ипотека;							
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.НС	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.НС;								
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Произвольный	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.Произвольный;									
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Бесполисные	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.Бесполисные;										
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Онкокоробка	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.Онкокоробка;												
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.КоробкаОтБПЛА	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.КоробкаОтБПЛА;													
	ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.АнтиКлещ	Тогда
		ВидСтрахования = Перечисления.уб_ВидыСтрахования.АнтиКлещ;													
	//ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Онкокоробка	Тогда
	//	ВидСтрахования = Перечисления.уб_ВидыСтрахования.Онкокоробка;													
	//ИначеЕсли ВидСП = Перечисления.уб_ВидыСтраховыхПродуктов.Онкокоробка	Тогда
	//	ВидСтрахования = Перечисления.уб_ВидыСтрахования.Онкокоробка;														
КонецЕсли;	
Если НЕ Объект.ВидС = ВидСтрахования Тогда
	Объект.ВидС = ВидСтрахования
	//УстановитьЗначение(Объект.ВидС, ВидСтрахования);
КонецЕсли;	
КонецПроцедуры	
