
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ПараметрДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = НачПериода;
	
	ПараметрПоставщик = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НомерКартыСтрахователя");
	ПараметрПоставщик.Использование = Истина;
	НомерКартыКПП = СокрЛП(НомерКартыСтрахователя);
	Если ЗначениеЗаполнено(НомерКартыКПП) Тогда
		ПараметрПоставщик.Значение  = НомерКартыКПП;
	Иначе	
		ПараметрПоставщик.Значение  = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан номер карты страхователя!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДатаКон.Использование = Истина;
	Если КонПериода = '00010101000000' Тогда
		ПараметрДатаКон.Значение  = КонецДня(ТекущаяДата());
	Иначе	
		ПараметрДатаКон.Значение  = КонецДня(КонПериода);
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ДокументРезультат);
	
	ПолеПоКоторомуНеобходимоПолучитьЗначение = "Ссылка";
	ПроцессорВывода.НачатьВывод();
	Пока истина Цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		
		Если ЭлементРезультата = Неопределено Тогда
			прервать;
		КонецЕсли;	
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
			ЗначениеВыводимыхДанных = Неопределено;
			Для каждого ЗначениеПараметра из ЭлементРезультата.ЗначенияПараметров Цикл
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
					ПоляРасшифровки = ДанныеРасшифровки.Элементы[ЗначениеПараметра.Значение].ПолучитьПоля();
					Для Каждого ПолеРасшифровки из ПоляРасшифровки Цикл
						Если ПолеРасшифровки.Поле = ПолеПоКоторомуНеобходимоПолучитьЗначение Тогда
							ЗначениеВыводимыхДанных = ПолеРасшифровки.Значение;
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	
			Если ЗначениеЗаполнено(ЗначениеВыводимыхДанных) Тогда
				Рис = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				Рис.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
							
				Индекс = ДокументРезультат.Рисунки.Индекс(Рис);
				Если ЗначениеВыводимыхДанных.ПометкаУдаления Тогда
					ДокументРезультат.Рисунки[Индекс].Картинка = БиблиотекаКартинок.уб_ДокументУдален;
				ИначеЕсли ЗначениеВыводимыхДанных.Проведен Тогда
					ДокументРезультат.Рисунки[Индекс].Картинка = БиблиотекаКартинок.уб_ДокументПроведен;
				Иначе
					ДокументРезультат.Рисунки[Индекс].Картинка = БиблиотекаКартинок.уб_ДокументНеПроведен;
				КонецЕсли;	
				ВысотаТабДок = ДокументРезультат.ВысотаТаблицы;
				ОбластьДляКартинки = ДокументРезультат.НайтиТекст("%Картинка%");
				Если ОбластьДляКартинки <> Неопределено Тогда
					ДокументРезультат.Рисунки[Индекс].Расположить(ОбластьДляКартинки);
					ОбластьДляКартинки.Текст = "";
					ДокументРезультат.Рисунки[Индекс].ЦветЛинии = ОбластьДляКартинки.ЦветРамки;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
КонецПроцедуры
