

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Мета = Метаданные.Документы;
	МетаСпр = Метаданные.Справочники;
	
	//СписокВидовДокументов.Добавить("Справочник."+МетаСпр.ФизическиеЛица.Имя,МетаСпр.ФизическиеЛица.Синоним,Ложь);
	//СписокВидовДокументов.Добавить("Справочник."+МетаСпр.СотрудникиОрганизаций.Имя,МетаСпр.СотрудникиОрганизаций.Синоним,Ложь);
	//
	//СписокВидовДокументов.Добавить("Документ."+Мета.ИсполнительныйЛист.Имя,Мета.ИсполнительныйЛист.Синоним,Истина);
	СписокВидовДокументов.Добавить("Документ."+Мета.РеализацияТоваровУслуг.Имя,Мета.РеализацияТоваровУслуг.Синоним,Истина);
	СписокВидовДокументов.Добавить("Документ."+Мета.ПриходныйКассовыйОрдер.Имя,Мета.ПриходныйКассовыйОрдер.Синоним,Истина);
	СписокВидовДокументов.Добавить("Документ."+Мета.ПриобретениеТоваровУслуг.Имя,Мета.ПриобретениеТоваровУслуг.Синоним,Истина);
	
	НачПериода = Дата(2022,1,1);
	Период = Новый СтандартныйПериод(НачПериода,КонецМесяца(НачПериода));
	
	//Объект.Адрес = "SERVER-1C";
	//Объект.Адрес = "RDPServer9";
	//
	////Ресурс = "/DB/hs/api/post";
	//Объект.Ресурс = "/_UprDistrBK_RDP/hs/api/post";
	//Объект.Порт = 8080;
	//Объект.Пользователь = "Администратор";
	//Объект.Пароль = "rarus";
	//Объект.РазмерПорции = 10;
	//Объект.ФлПроводить = Истина;
	//ФирмаПриИзменении(Неопределено);
	//Объект.Узел = ПланыОбмена.rdp_Обмен.НайтиПоКоду("Дис");

	
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьВФайлНаСервере()
			
	
	Обработка = РеквизитФормыВзначение("Объект");
	МассивОбъектов = Новый Массив;
	
	КэшЗначения = Новый Соответствие;
	
	ПодготовитьДанные(МассивОбъектов,КэшЗначения,Обработка);
	
	Текст = Новый ТекстовыйДокумент;
	Если МассивОбъектов.Количество() > 0 Тогда
		МассивОбъектов.Вставить(0,Обработка.СтруктураКэша(КэшЗначения));
		//Строка = ЗначениеВСтрокуВнутр(МассивОбъектов);
		//Возврат;
		Строка = Обработка.ЗаписьJSON(МассивОбъектов);
		//Возврат;
		Текст.УстановитьТекст(Строка);
	Иначе	
		Текст.УстановитьТекст("");
	КонецЕсли;	
	ВремИмяФайла = ПолучитьИмяВременногоФайла("txt");
	Текст.Записать(ВремИмяФайла);
	Объект.АдресВХранилище= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВремИмяФайла),Новый УникальныйИдентификатор);
	МассивОбъектов = Новый Массив;
	Строка = "";
	

КонецПроцедуры

&НаСервере
Функция ПодготовитьДанные(МассивОбъектов,КэшЗначения,Обработка)
	Если ПустаяСтрока(Объект.ИмяФайлаОбмена) Тогда
		Сообщить("Не выбран файл сохранения");
		Возврат Ложь
	КонецЕсли;	
	
	
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата1",Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Фирма",Объект.Организация);
	ШаблонЗапроса = "ВЫБРАТЬ
	|	ТекДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ТекДокумент
	|ГДЕ
	|	ТекДокумент.Дата >= &Дата1
	|	И ТекДокумент.Дата <= &Дата2 И ТекДокумент.Организация = &Фирма  и 2 = 2
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекДокумент.Дата"; 
	
	ШаблонЗапроса2 = "ВЫБРАТЬ
	|	ТекДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ТекДокумент"; 
	
	СчетчикКэша = 0;
	Для каждого СтрокаВида из  Объект.СписокВидовДокументов Цикл
		Если СтрокаВида.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;	
		Если Найти(СтрокаВида.Значение,"Справочник")>0 Тогда
			Запрос.Текст = СтрЗаменить(ШаблонЗапроса2,"Документ.ПриходнаяНакладная",СтрокаВида.Значение);
		Иначе	
			Запрос.Текст = СтрЗаменить(ШаблонЗапроса,"Документ.ПриходнаяНакладная",СтрокаВида.Значение);
		КонецЕсли;	
		//Если НЕ ПустаяСтрока(Комментарий) Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"2 = 2","ТекДокумент.Комментарий подобно ""%"+Комментарий+"%""");
		//КонецЕсли;	
			 
		Выборка  = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//ДанныеВходные = ЗначениеСтруктурой(Выборка.Ссылка,КэшЗначения,ИСТИНА);
			ТекОбъект = Обработка.ЗначениеСтруктурой(Выборка.Ссылка,КэшЗначения,ИСТИНА,,,,ЛОЖЬ,СчетчикКэша);
			//ТекОбъектСтрока = ЗаписьJSON(ТекОбъект);
			//ТекОбъектСтрока = ЗначениеВСтрокуВнутр(ТекОбъект);
			МассивОбъектов.Добавить(ТекОбъект);
			//Прервать;
		КонецЦикла;	
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	Если ПустаяСтрока(Объект.ИмяФайлаОбмена) Тогда
		ПоказатьПредупреждение(,"Не выбрано имя файла",3);
		ЭтаФорма.ТекущийЭлемент = Элементы.ИмяФайлаОбмена;
		Возврат
	КонецЕсли;	
	ВыгрузитьВФайлНаСервере();
	Если ЭтоАдресВременногоХранилища(Объект.АдресВХранилище) Тогда
		ДД = ПолучитьИзВременногоХранилища(Объект.АдресВХранилище);
		ДД.Записать(Объект.ИмяФайлаОбмена);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтправитьЧерезСервисНаСервере()
	Обработка = РеквизитФормыВзначение("Объект");
	МассивОбъектов = Новый Массив;
	
	КэшЗначения = Новый Соответствие;
	
	ПодготовитьДанные(МассивОбъектов,КэшЗначения,Обработка);
	
	Если МассивОбъектов.Количество()>0 Тогда
		МассивОбъектов.Вставить(0,Обработка.СтруктураКэша(КэшЗначения));
		Строкаjson = Обработка.ЗаписьJSON(МассивОбъектов);
		
		Обработка.ОтправитьСтрокой(Строкаjson);
		
		МассивОбъектов = Новый Массив;
		КэшЗначения = Новый Соответствие;
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезСервис(Команда)
	ОтправитьЧерезСервисНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьИзмененныеНаСервере()
	
	МассивОтправки = Новый Соответствие();
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ОбъектыДляВыгрузки.Количество()>0 Тогда
			Для каждого _Объект Из Объект.ОбъектыДляВыгрузки Цикл
			
			Если _Объект.Выгружать Тогда
				МассивОтправки.Вставить(_Объект.Объект.УникальныйИдентификатор(),_Объект.Объект);
			КонецЕсли;
		КонецЦикла;	
	Иначе
		МассивОтправки = Обработка.МассивОтправки(Объект.Узел);
	КонецЕсли;	
	
	Обработка.ОтправитьМассив(Объект.Узел,МассивОтправки);

	//ЗаполнитьИзмененныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИзмененные(Команда)
	ОтправитьИзмененныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененныеНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ВыборкаДанных = ПланыОбмена.ВыбратьИзменения(Объект.Узел,1,);
	
	МассивОбъектов = Новый Массив;
	КэшЗначения = Новый Соответствие;
	СчетчикКэша = 0;
	СчетчикДокументов = 0;
	
	Объект.ОбъектыДляВыгрузки.Очистить();
	ДатаНачалаОбмена = Объект.Узел.ДатаНачалаВыгрузкиДокументов;
	Организации = Объект.Узел.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
	МассивОтправки = Новый Соответствие();
	Пока ВыборкаДанных.Следующий() Цикл
		//Попытка
		_Объект = ВыборкаДанных.Получить();
		Если ТипЗнч(_Объект) = ТИп("УдалениеОбъекта") Тогда
		Иначе	
			Если Обработка.ВыгружатьОбъект(_Объект,Организации,ДатаНачалаОбмена) =Истина  Тогда
				_Ссылка= Объект.ОбъектыДляВыгрузки.Добавить();
				Если ОтмечатьКОтправке Тогда
					_Ссылка.Выгружать = Истина;
				КонецЕсли;	
				_Ссылка.Объект = _Объект.Ссылка;
				
				_Ссылка.ПредставлениеОбъекта = ПредставлениеОбъекта(_Объект.Ссылка);
			КонецЕсли;	
		КонецЕсли;	
		
		СчетчикДокументов = СчетчикДокументов+1;
	КонецЦикла;		
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьИзмененные(Команда)
	ЗаполнитьИзмененныеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПриВыбореИмениФайла",ЭтаФорма,Новый Структура));
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореИмениФайла(Результат,ДопПараметр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;	
	Для каждого Файл из Результат Цикл
		Объект.ИмяФайлаОбмена  = Файл;
	КонецЦикла;	
		
КонецПроцедуры	


&НаСервере
Процедура ЗаполнитьПоПериодуИВидуНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбменУправлениеТорговлейБухгалтерияПредприятия30Организации.Организация КАК Организация
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.Организации КАК ОбменУправлениеТорговлейБухгалтерияПредприятия30Организации
	|ГДЕ
	|	ОбменУправлениеТорговлейБухгалтерияПредприятия30Организации.Ссылка = &Узел";
	Запрос.УстановитьПараметр("Узел",Объект.Узел);
	_Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
	Запрос.УстановитьПараметр("Дата1",Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организации",_Организации);
	
	ДатаНачалаОбмена = Объект.Узел.ДатаНачалаВыгрузкиДокументов;
	
	Объект.ОбъектыДляВыгрузки.Очистить();
	СчетчикДокументов = 0;
	
	Для каждого ЭлементСписка из СписокВидовДокументов Цикл
		
		Если ЭлементСписка.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;	
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Дата КАК Дата,
		|	РеализацияТоваровУслуг.Проведен КАК Проведен
		|ИЗ
		|	"+ЭлементСписка.Значение+" КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|	И РеализацияТоваровУслуг.Дата >= &Дата1
		|	И РеализацияТоваровУслуг.Дата <= &Дата2
		|	И РеализацияТоваровУслуг.Организация В(&Организации)";
		Выборка =Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			_Объект = Выборка.Ссылка;
			Если ТипЗнч(_Объект) = ТИп("УдалениеОбъекта") Тогда
			Иначе	
				Если Обработка.ВыгружатьОбъект(_Объект,_Организации,ДатаНачалаОбмена) =Истина Тогда
					_Ссылка= Объект.ОбъектыДляВыгрузки.Добавить();
					Если  ОтмечатьКОтправке Тогда
						_Ссылка.Выгружать = Истина;
					КонецЕсли;	
					_Ссылка.Объект = _Объект.Ссылка;
					
					_Ссылка.ПредставлениеОбъекта = ПредставлениеОбъекта(_Объект.Ссылка);
				КонецЕсли;	
			КонецЕсли;	
			
			СчетчикДокументов = СчетчикДокументов+1;
			
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоПериодуИВиду(Команда)
	ЗаполнитьПоПериодуИВидуНаСервере();
КонецПроцедуры


Функция ПредставлениеОбъекта(_Ссылка)
	Суффикс = "";
	Попытка 
		Партнер = _Ссылка.Партнер;
		Суффикс = Суффикс+" ["+СокрЛП(Партнер)+"]";
	Исключение
		
	КонецПопытки;	
	
	Попытка 
		СуммаДокумента = _Ссылка.СуммаДокумента;
		Суффикс = Суффикс+" {"+Формат(СуммаДокумента,"ЧГ=")+"}";
	Исключение
		
	КонецПопытки;	
	Возврат ""+_Ссылка+ суффикс;
КонецФункции

&НаКлиенте
Процедура ОбъектыДляВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.ОбъектыДляВыгрузки.ТекущиеДанные.ОБъект);
КонецПроцедуры
