
Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;	
	Если Не Отказ Тогда
		СвойствоУчетПоВсемОрганизациям = ПланыВидовХарактеристик.НастройкиПользователей.УчетПоВсемОрганизациям;
		СвойствоОсновнаяОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;		
		Для Каждого Запись ИЗ ЭтотОбъект Цикл
			Если Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
				Если Запись.Настройка = СвойствоУчетПоВсемОрганизациям Тогда
					глЗначениеПеременнойУстановить("УчетПоВсемОрганизациям", Запись.Значение, Истина);
				ИначеЕсли Запись.Настройка = СвойствоОсновнаяОрганизация Тогда
					глЗначениеПеременнойУстановить("ОсновнаяОрганизация", Запись.Значение, Истина);
				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;		
		КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
		//todo реализовать в другом месте
		УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																						  КэшДополнительныхПрав, 
																						  "Настройка",
																						  глЗначениеПеременной("глТекущийПользователь"), 
																						  "значения дополнительных прав",
																						  ОбновлятьЗначениеГлПеременной,
																						  Ложь);																						  
		Если ОбновлятьЗначениеГлПеременной Тогда
			глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", КэшДополнительныхПрав, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;	
	Если Не (РольДоступна("ПолныеПрава") Или уб_temp.ПолучитьПредопределеннуюНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.НастройкаПолномочийИРолей, Ложь)) Тогда
		//проверяем по отбору
		Если Отбор.Пользователь.Значение <> ПараметрыСеанса.ТекущийПользователь Или Не Отбор.Пользователь.Использование
		Или Отбор.Настройка.Значение.ВидНастройки = Перечисления.уб_ВидыНастроекПользователей.Полномочие Или Не Отбор.Настройка.Использование 
		Или Отбор.Настройка.Значение = ПланыВидовХарактеристик.НастройкиПользователей.ПустаяСсылка() Тогда
			#Если Клиент Тогда
				Предупреждение("Недостаточно прав!");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры